{"id": 22537, "submission_id": "152nlmq", "title": "AITAH for explaining how my \"son\" came into being?", "selftext": "I travel for work and the guys I travel with are closer to me than family in most cases. I haven't been home in almost 6 months, stuck out here on the road working 70+hours a week. \n\nWe got this temp several months ago who is rather rotund, much like I am. Anyway someone made the comment that he could be my kid and he ran with it. So for over a month I have been dealing with him calling me \"father\", \"daddy\" and other names. I have asked him to stop ever since he started with this behavior. I have tried to nip it in the bud without being too much of a dick. My boss has even gotten into calling me his dad, though not very often. It is driving me crazy.\n\n\nNow to the part where I may be the AH. If he wants me to be his \"daddy\" I will be. One morning before the daily safety meeting he started up with his bullshit and so I finally publicly accepted that he was in face my son. Then described how he came about, in front of everybody. I explained how I had too many beers one night and went to taco bell. The next morning as I woke feeling like I was going to die and a huge knot in my gut I made my way to the restrooms  and after many prayers and promises to never do this again the good Lord gave me a reminder. Him.  \n\n\nBorn through the stress and labor of an alcohol induced drunken night of the world's worst fast food and pretty decent beer. My son arrived with the stench that honestly made me want to hurl and the amniotic fluid that was made from the unholy union of IPA and chicken burrito Supreme. My asshole baby. The buthole messiah. No mother carried him. No mother cared for him. The existence he has came from only me, beer, and a culinary mistake. \n\n\nNow everyone is calling him taco bell, or as I said earlier the Buthole Messiah. He asked me to stop and I told him I couldn't deny my child anymore. He doesn't talk to me much anymore, but I really don't care. My boss asked me to stop this, as if I could at this point. I asked him where he was the whole time I protested, he didn't say anything. \n\n\nAnyway,  I await your judgment, am I the AH for bringing the Buthole Messiah into this world?", "created_utc": 1689652792, "permalink": "/r/AmItheAsshole/comments/152nlmq/aitah_for_explaining_how_my_son_came_into_being/", "score": 58, "replies": ["NTA\n\nThis is amazing.  You deserve a medal.", "NTA - Fucking brilliant.", "I don’t usually laugh out loud when on these threads…. You win the AITA awards of 2023 🥇 👏", "this post deserves to be posted in /r/MaliciousCompliance.\n\nNTA", "NTA\n\nHe was kind of asking for it, and this is hilarious. 🤣", "NTA. He effed around and found out. 😂", "NTA\n\nIf your asshole baby can joke around, so can you.", "NTA - perfect example of fucking around and finding out lmao\n\nI love your description of his 'coming into the world' tho, applause to you good sir.\n\nAlso, how could you even stop it, when the rest of the crew is also calling him the Butthole Messiah? The hypocrisy of your boss, jeez. \n\nI hope that you and your son will someday unite and bring salvation onto this unholy land.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI travel for work and the guys I travel with are closer to me than family in most cases. I haven't been home in almost 6 months, stuck out here on the road working 70+hours a week. \n\nWe got this temp several months ago who is rather rotund, much like I am. Anyway someone made the comment that he could be my kid and he ran with it. So for over a month I have been dealing with him calling me \"father\", \"daddy\" and other names. I have asked him to stop ever since he started with this behavior. I have tried to nip it in the bud without being too much of a dick. My boss has even gotten into calling me his dad, though not very often. It is driving me crazy.\n\n\nNow to the part where I may be the AH. If he wants me to be his \"daddy\" I will be. One morning before the daily safety meeting he started up with his bullshit and so I finally publicly accepted that he was in face my son. Then described how he came about, in front of everybody. I explained how I had too many beers one night and went to taco bell. The next morning as I woke feeling like I was going to die and a huge knot in my gut I made my way to the restrooms  and after many prayers and promises to never do this again the good Lord gave me a reminder. Him.  \n\n\nBorn through the stress and labor of an alcohol induced drunken night of the world's worst fast food and pretty decent beer. My son arrived with the stench that honestly made me want to hurl and the amniotic fluid that was made from the unholy union of IPA and chicken burrito Supreme. My asshole baby. The buthole messiah. No mother carried him. No mother cared for him. The existence he has came from only me, beer, and a culinary mistake. \n\n\nNow everyone is calling him taco bell, or as I said earlier the Buthole Messiah. He asked me to stop and I told him I couldn't deny my child anymore. He doesn't talk to me much anymore, but I really don't care. My boss asked me to stop this, as if I could at this point. I asked him where he was the whole time I protested, he didn't say anything. \n\n\nAnyway,  I await your judgment, am I the AH for bringing the Buthole Messiah into this world?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA… more like a taste of their own medicine, but in short story form."]}