{"id": 22533, "submission_id": "152mlnm", "title": "AITA for taking a THC gummy at a Christian wedding?", "selftext": "I (26M) was the plus 1 for a wedding that my roomie (27F) was in as a bridesmaid. I had previously met the couple (M&F 28) a few times & they seemed fine.\nI brought a pack of 5mg gummies that I would take during the reception & my roomie knew I was bringing them. The wedding was small, about 60 ppl. I knew going in that not everyone was allowed plus 1s, but my roomie was as she’s in the bridal party.\nThe ceremony was nice & when we moved to the reception, I was seated with 3 bridesmaids & 2 of the bride’s college friends (20s MF couple). The wedding party left for pics and some food was brought out, so I took a gummy. I offered some to the couple I was left with, & they politely declined, & I thought that was the end of that.\nSome time passed & the wedding party returned. Right away, the couple engaged in hushed conversation with the bridesmaid sitting opposite me. I couldn’t hear over the music. The couple’s vibe changed & while we were talking as a table they would start responding to things I was saying with “oh, I wonder what other fun things you’re taking” & “don’t let the kids here see you’re doing that” in snarky-ish tones. I became uncomfortable, so I excused myself & stepped out onto the patio.\nSoon after my roomie stepped out & joined me. She informed me that the table started talking about me when I left, and the couple was appalled to find out I brought gummies to the reception. They expressed their distaste for drugs that aren’t “FDA approved” & are also apparently christian, which became clear when they stated that “this was a Christian wedding & [I] should be more respectful in not bringing ‘addictive drugs’ around a celebration with kids present”. My roomie thought they were overreacting, but the other bridesmaids agreed with them & debated kicking me out.\nI was embarrassed & didn’t realize I would cause such a reaction, as they had an open bar & plenty of the people were already buzzed, that couple included. We returned & I apologized, and tried to explain that the gummies are legal, & not addictive like alcohol or other drugs. The man seemed to think that was a jab at him, as he was already pretty drunk. He interrupted me & said “you don’t get to tell others how much they can drink at a wedding, especially when you’re a plus 1 & we were actually invited.” \nThe convo died, & we were dismissed for dinner. I could hear that couple a few people behind us in line for the buffet still talking about it & including others in the convo. At that point I felt unwelcome and told my roomie I was just going to wait in the car outside. She opposed that, but I told her I’d be fine and left.\nI stayed in the car for 3 hours. When my roomie finally came she told me that when the bride heard about this, she didn’t personally care, but said I absolutely shouldn’t have brought edibles, as many of the attendees were christians and equated weed to meth or cocaine", "created_utc": 1689649860, "permalink": "/r/AmItheAsshole/comments/152mlnm/aita_for_taking_a_thc_gummy_at_a_christian_wedding/", "score": 894, "replies": ["I'm gonna say ESH. They need to chill out especially if you aren't making a scene but you shouldn't offer random people you don't know THC at a wedding.", "ESH.\n\nIt’s ok you took 5mg thc.  No worse than being drunk or buzzed.  But you failed to gauge your audience and randomly offering other people gummies.  Should have kept it to yourself.  There’s still quite a social stigma. And a wedding is not the place to try to tear down those barriers if you’re not the bride or groom. \n\nAnd everyone else decided to judge you harshly for a benign drug that’s legal as alcohol.  And no worse than alcohol.", "Not the ah for bringing it or taljng it.\n\nKinda YTA for offering it to people you don't know. Never assume someone's ok with it.", "I don’t think you’re the AH, but as someone who partakes daily, I would NEVER offer anything to a bunch of strangers let alone do it in front of them, regardless of the method. Be a little more discreet next time and excuse yourself to do what you need to come back a little more relaxed.", "As someone who smokes heavily and does edibles occasionally, YTA. You barely know these people and you’re a plus one, why would you bring gummies to eat *at* the event, and then offer them to strangers around you? If you’re gonna be taking that stuff, you do it before you go or when you’re alone. Or, if you barely know these people, don’t take them at all. It doesn’t matter if it’s legal. If someone had an alcohol-free wedding, you’d be just as much an AH for bringing alcohol to drink and offer to others. While yeah, I do think they overreacted a bit, bringing the gummies to the wedding with you was unnecessary.", "ESH. They were definitely overreacting but why would you offer the gummies to random people at the wedding? It's like you were trying to draw attention to yourself on purpose. \n\n5mg won't even get most people high so it's not like it's a huge deal. But just keep it to yourself.", "YTA for not being discreet about it.", "NTA especially in a legal state/country.\n\nBUT at a situation like a wedding, you gotta read the room. Popping the gummy is fine, definitely makes the reception better, but for the love of God don’t offer one to some rando. People have strong (read: misguided) opinions on weed, and sometimes it’s just better to keep that on the DL.", "YTA for being indiscreet at someone else's event.  What made you think it was appropriate to advertise your consumption and then offer gummies to strangers....at a wedding where you were not even close to the couple but a guest of one of the wedding party?", "Lots of people in the comments should be eating some gummies right now", "YTA.  Unless the couple getting married openly encourages it at the wedding itself, you don’t bring drugs to a wedding.  Offering to share only increased the level of inappropriateness.  Doing it when you’re a plus one and have hardly met the couple is in especially poor taste, because you don’t even know the couple well enough to know whether they’d be comfortable around edibles at all, much less comfortable having them at their wedding.", "So there probably wouldn’t have been a problem in just taking a gummie and going on about your night, the problem is, you offered them around in company you didn’t know. Legalization of weed is so new that you have to know that not everyone is on board with it. Offering it to people you didn’t know at the table was kinda trashy, almost like showing up with your own booze and drinking from your purse. YTA", "I am Christian but I could care less. But you should consider that crowd if there is children around. Also don't share that information with just anybody cuz you never know how they're going to respond.", "NTA. The assholes were DRUNK. WTF is the difference?  There are a lot of Christians that would judge them harshly for drinking.", "NTA. 5 mg is nothing compared to how drunk some of those people probably were. Perhaps just be more discreet?", "Typical Christian hypocrisy. Legal edibles are horrible but the open bar is not. NTA", "What does being Christian have to do with being anti-weed?", "Alcohol at a Christian wedding lol.. yeah ok .. what hypocrites", "Weed is cool and God isn't real. NTA", "  NTA - just don’t offer to share next time.", "Seriously, NTA.\n\nThough maybe be a little more careful who you offer them to. Not that there's anything wrong with taking them in the slightest, the people you talked to clearly know nothing about them, but just to avoid this sort of thing. If you didn't say anything, they would have just thought you ate a piece of candy and no more would have occurred.", "NTA…. But some of these anti-weed commenters are lol..   I can hardly believe how effin stupid people can be about cannabis in 2023, modern day reefer madness jackasses.  The reaction when you try to educate is telling.  \n\nYou don’t need anyone’s permission to discreetly take cannabis any more than a stick of gum.  I will step outside to smoke, but edis are definitely nunya.  (Unless you’re out of control but then that’s what makes you an ah.)  \n\nAnd some of these lames said you’re ta because you offered to share!??  You would have been if you HADNT offered lolol, so good work- definitely NTA!", "NTA at all, especially somewhere legal.", "NTA. They’re hypocrites. Next time keep your treats to yourself.", "Just don’t offer. Say they are throat lozenges!", "NTA but maybe don’t offer to strangers next time.", "Woah don’t offer strangers edibles my dude. YTA", "YTA. Don’t take drugs at peoples weddings. \n\nDid not have typing that on my bingo card for the day.", "There is a story in the Bible about Jesus at a wedding. The wedding had been going on for a while, and the fun was starting to wear off. Jesus’s mom comes and tells him that the vibe is whack, and is there anything he can do about it. Jesus ponders the situation for a moment, then he sends his mom to the marketplace to purchase and return with all the Haribo she could find. She returns with several clay pots of the sweet goodies. He tells Mary to try one. She’s all, “What?  Why am I eating gummy bears?” And Jesus is all “Wait a minute.”  \n\nAnd that’s how Jesus saved the day.", "NTA. Typical hypocrite bible thumpers. Don’t get me wrong. God and i have a good working relationship. He knows i don’t care for his typical representation.", "YTA. How tacky.", "NTA- you didn’t do anything wrong, and weren’t being disrespectful or disruptive. However, offering weed to the other guest was maybe not a good move. But you didn’t know and you were trying to be nice. I don’t think your the AH, weed helps calm my nerves and being in a place where you don’t know people can be very stressful. So I completely understand it. You didn’t do anything wrong.", "NTA especially in a legal state. These people need to get over themselves, it’s legal in half the country. And alcohol was being served, so it’s not like it was a straight-edge wedding. \n\nYou sound nice and fun. They were super rude to make you feel unwelcome.", "NTA", "NTA. It’s legal, you weren’t acting disruptive. I don’t see what relevance kids have either. How would they know about the gummies? It’s not like smoking at a wedding around guests, which would definitely be inappropriate. It also doesn’t sound like you told others how to drink. You made a valid point that alcohol is often more addictive and harmful than THC. I also don’t understand what being Christian has to do with it, as I know many Christian’s who recognize the medicinal benefits of THC or even use it themselves.", "NTA. More people die from drunk driving everyday than weed will ever.", "NTA! If it’s legal in your state/country go for it! It’s no different than having a couple shots before the wedding. \n\nI got high at a catholic wedding a few months ago and had THE BEST TIME! I went without my hubby and cried my eyes out at the ceremony and then had a blast at the reception. Made me so much less anxious about being around people.", "NTA, but you could’ve sussed out their opinions first, fairly easily & quickly before getting into this situation!", "NTA and alcohol is worse than weed", "YTA.  Don't do drugs at a wedding, Christian or not.  You wouldn't bring your own sandwich or sneak in a bottle of Jack Daniels, why would it be ok to bring edibles?", "NTA but pretty stupid. Never ever offer weed to strangers. It’s still pretty taboo - while it’s ridiculous it’s the truth. Should’ve taken them in the bathroom or discreetly and kept to yourself.", "YTA for going to a Christian wedding", "Yeah, YTA. Seriously. I would be pissed if someone was doing and offering people drugs at my wedding. Even if it's weed. What is wrong with you? And in the shape of candy around kids? \n\nI'm sorry, but this really wasn't the place or time to take drugs. What if you got a bad trip? What if you forgot to hide your shit away in your pocket and a kid got ahold of them? \nIt may be a low dose for an adult, but a child can react very differently.", "I suppose it’s wrong that the title just made me bust out laughing. I think the “Christian” just tickled me. \n\nAs a Universal Life Minister, courtesy of the Internet, I condone this activity.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26M) was the plus 1 for a wedding that my roomie (27F) was in as a bridesmaid. I had previously met the couple (M&F 28) a few times & they seemed fine.\nI brought a pack of 5mg gummies that I would take during the reception & my roomie knew I was bringing them. The wedding was small, about 60 ppl. I knew going in that not everyone was allowed plus 1s, but my roomie was as she’s in the bridal party.\nThe ceremony was nice & when we moved to the reception, I was seated with 3 bridesmaids & 2 of the bride’s college friends (20s MF couple). The wedding party left for pics and some food was brought out, so I took a gummy. I offered some to the couple I was left with, & they politely declined, & I thought that was the end of that.\nSome time passed & the wedding party returned. Right away, the couple engaged in hushed conversation with the bridesmaid sitting opposite me. I couldn’t hear over the music. The couple’s vibe changed & while we were talking as a table they would start responding to things I was saying with “oh, I wonder what other fun things you’re taking” & “don’t let the kids here see you’re doing that” in snarky-ish tones. I became uncomfortable, so I excused myself & stepped out onto the patio.\nSoon after my roomie stepped out & joined me. She informed me that the table started talking about me when I left, and the couple was appalled to find out I brought gummies to the reception. They expressed their distaste for drugs that aren’t “FDA approved” & are also apparently christian, which became clear when they stated that “this was a Christian wedding & [I] should be more respectful in not bringing ‘addictive drugs’ around a celebration with kids present”. My roomie thought they were overreacting, but the other bridesmaids agreed with them & debated kicking me out.\nI was embarrassed & didn’t realize I would cause such a reaction, as they had an open bar & plenty of the people were already buzzed, that couple included. We returned & I apologized, and tried to explain that the gummies are legal, & not addictive like alcohol or other drugs. The man seemed to think that was a jab at him, as he was already pretty drunk. He interrupted me & said “you don’t get to tell others how much they can drink at a wedding, especially when you’re a plus 1 & we were actually invited.” \nThe convo died, & we were dismissed for dinner. I could hear that couple a few people behind us in line for the buffet still talking about it & including others in the convo. At that point I felt unwelcome and told my roomie I was just going to wait in the car outside. She opposed that, but I told her I’d be fine and left.\nI stayed in the car for 3 hours. When my roomie finally came she told me that when the bride heard about this, she didn’t personally care, but said I absolutely shouldn’t have brought edibles, as many of the attendees were christians and equated weed to meth or cocaine\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA", "I don't get everyone saying YTA \n\nMost people are being reasonable and making the YTA call because you offered it to people. But I disagree. Not reading the room well, yeah a little silly, but you were being polite. This subreddit has a horrible habit of projecting onto the op, and making psuedo psychology claims like \"he was clearly after attention\" but after being around a lot of smokers and being one myself. I know you were just being polite.\n\nMan just didn't want to be rude and Bogart all the goodies. \nI've been to plenty of uptight weddings where I was lucky enough to know where the \"chill people\" were. You were a lone rider who didn't know where the watering hole was and you tried to be nice. It's 2023 and you shouldn't have to expect people to have outdated opinions. \n\nYou seem like a chill dude who made a bad gauge of personalities, totally NTA.", "ESH\nfirst off weed is addictive lol that said it sucks that if you didn’t offer to share no one would’ve know. They were pretty dramatic", "ESH. \n\nIf you planned to take a drug, you should have done it privately and discreetly. Because even if it is a celebration, you're not sure how the bride or groom would have felt about it. The guests were clearly unhappy. \n\nI definitely don't think the guests should have made it such a big issue, because I *think* the only reason you offered them some was to be kind/polite. They definitely weren't kind about it. \n\nI think it's okay to disagree with someone's choice, while still being kind or polite. They made you feel uncomfortable on purpose and that's just a shitty way for adults to behave.", "NTA but this is a good life lesson. Look events like this are total fucking bullshit. Don't let anyone twist your arm into going to shit like this. Jean-Paul Sartre \"hell is other people.\" Think of what particular circumstances begin with you eating a reasonable and legal quantity of THC and end with you sitting in a car waiting for your roommate for three hours all while a bunch of drunk strangers acted like they were disgusted. Also religious people are dumb enough before quantities of alcohol are introduced. If anything your roommate should have warned you that these people are dumb and would also be drinking.", "NTA. People who believe the universe is controlled by an omnipotent deity are superstitious and paranoid about other idiotic things too. Your only mistake was to offer it. You should have had a drink and passed your buzz off as alcohol like a good god-fearing alcoholic Christian.", "If no one had seen the bag no one would notice that he took a 5mg gummy. It’s a very low dose. Kids being around is irrelevant to this issue.", "Maybe I'm out of touch here as a Canadian, but people need to get over their problems with weed.\n\nOP was a little naive to offer them any but I don't even think it warrants an ESH here.\n\nSounds like the crowd just sucked. I feel bad for OP and honestly NTA. I'm Christian if it makes a difference.", "Right? If it was a dry wedding would OP start offering swigs from his hip flask or offer some booze he had smuggled in outside in his car? Unwise in any case.\n\nBut I think OP just wanted to provoke an argument either with the wedding guests (if this post is real) or with the aita commenters (if its not which is more likely) about how THC isn't addictive and alcohol is the worst drug on the planet.", "pretty much my take. \n\nlike it or not lots of people still dislike thc products. parading them around draws needless attention to you regardless. learn a little discretion.", "Exactly and only pull them out if that’s what everyone else is doing. Otherwise the bathroom or not at all. Yta", "I agree. I'm literally high right now and still know that you were not acting in a chill way OP", ">openly encourages it at the wedding itself, you don’t bring drugs to a wedding.\n\nThey're serving alcohol at a wedding, so drugs were openly encouraged.\n\n>Doing it when you’re a plus one and have hardly met the couple is in especially poor taste\n\nYeah, I don't think OP should have shared, but the couple are hypocritical AHs too. All their talk about drugs only to drink alcohol around children, lol.", "Offering to share is being polite \n\nWhat's not polite is starting shit behind someone's back and not just politely declining or suggesting you're uncomfortable with the item. \nIt's a legal product that causes no harm, and is on par with alcohol, which was obviously widely encouraged. \n\nIt's not like he ripped a bong at the dinner table. \n\nHe was just being polite which backfired, he could have gauged the crowd better. But that doesn't make him an AH", "They’re actively encouraging drinking, apparently including excessive drinking.", "I mean, I would rather be around a stoner over an alcoholic any day. People love to draw lines between weed and alcohol, when alcohol is clearly so much more destructive despite being the more accepted vice. Big you're right, both are drugs. Probably nobody would have noticed and flipped out if OP hadn't brought it up, which wasn't a smart idea.", "Yes, I don’t get what’s “not Christian” about cannabis, while booze is, when it’s more dangerous and even deadly? Is it because Jesus made wine but not weed? Weird.", "Many Christians drink. The bible is full of references to wine", "Yeah you're right, Jesus would never have gone to a wedding where there was alcohol.\nOh hang on....", "You must not go to a lot of weddings because that'd be on my bingo card every day, lol... \n\nNow offering drugs to strangers at wedding absolutely stupid.", "They had an open bar dispensing highly addictive and dangerous alcohol. THC is nothing compared to alcohol.", "How is discretely eating a gummy candy more tacky than being openly drunk? Please, explain.", "If OP is from Canada it’s very normal and legal here", "I've never personally brought a flask to a wedding, but almost every wedding I've ever attended had at least one person with a flask.", "Because it's the only way I'd be able to handle a bunch of drunk Christians.  Damn right im getting baked in a situation like that.", "If I had some unique liquor that I didn’t expect to be served, I’d probably bring a flask full to share.", "Cringe", "“Low” is relative. I take 2.5 and get highhhhhhh.", "Terrible take, \nMaking an assumption that someone wanted to start shit because he was being polite. \n\nIf someone is having a drink or smoking a cigarette, it's generally considered good etiquette to offer the people around you one, even iff you don't know what their preferences are. There's no pressure to accept, but the offer is there. It's not about starting a fight or being superior. It's about being polite.\n\nHe explained himself because there is a lot of stigma still lurking around about it from all the propaganda when it was illegal. \nHe was being persecuted and felt he needed to defend himself. \nTotally normal reactions", "Fr I could not imagine going to an event surrounded by strangers and thinking it’s the right time to pop gummies and offer to pass them around", "Alcohol isn’t seen as a drug in the same way as weed. Whether you agree with that stance or not, that is a commonly known social norm and it should direct your actions", "offering strangers drugs at a wedding is not discrete. I don’t think OP is an asshole for eating an edible but he is TA for offering drugs to randoms", "They mentioned the FDA so I don’t think so.", "Eewww", "No, not ok.  That would be really rude.", "Sure, my point is that worst case scenario OP would just look maybe a touch tired. That’s worst case. Still definitely not a threat to kids.", "The couple is literally offering one of the most unsafe and addictive substances in common use to their guests.", "Alcohol is a drug \n\nThc is a drug \n\nBoth aren't illegal \n\n1 was being used in excess around children \n\nThe other was discreetly and politely offered to adults. \n\nWeird take champ", "I really don’t understand why", "yeah but the difference is it’s their wedding with their friends. OP is a stranger at an intimate wedding", "You are saying that what your hosts are providing is not adequate.  Anyway, that is the way I learned it from miss manners.", "[deleted]", "Ancient", "Lol YTA, I don't think you knew any of these people (your roommate included), well enough to have gotten any kind of intoxicated at their party. A little e s h because your roommate should probably have seen something like this coming.", "YTA. I think people forget sometimes that a good percentage of the country see weed as “drugs.” Maybe not on the level of meth or heroin, but still “bad.” I don’t agree with that assessment, but I’m not sure why you would offer edibles to strangers at a Christian wedding. Poor judgement.", "YTA, time and place dude. You’re a stranger and an accessory guest, you are supposed to be in your best behavior. \n\nYou shouldn’t bring weed to a wedding unless you’re SURE you know the crowd. And I say this as someone who went to a wedding with a hotbox tent.", "YTA.\n\nYou don't go to a Muslim wedding and offer the guests some if your liquor stash. Likewise here, it's disrespectful. If you felt you couldn't go a few hours without taking gummies, at least you should have kept it super discreet.", "YTA if this is real (super skeptical). It really seems like you brought these gummies as some sort of stunt, honestly. It's a Christian wedding, it's pretty obvious to anybody guessing blindly that they wouldn't be comfortable with drugs present. Logically, there IS little reason why it's different from alcohol in stigma, but it's not always about logic at a religious event. Whether you are religious or not, when you're at an event like this, you have some respect for your hosts and their comfort level. There's no reason you had to bring them unless you have some medical reason you left out. You could have gotten high when you got home. This has the feeling of a 14 year old drawing a pentagram on their hand before going into church to prove something to nobody.", "YTA.\n\nYou took drugs to a wedding. I don’t want to hear any arguments from others saying ‘they’re not really drugs’, or ‘they’re legal’. They are drugs. Who the fuck thinks it’s a good idea to take drugs to a wedding?\n\nYou couldn’t wait to get home to start chewing on that shit?\n\nI’d have kicked you out.", "ESH. They’re being jerks but like, idk man. Personally I just think it’s in poor taste to be getting high at someone’s wedding who you don’t even really know well, and then going and offering it to others so people KNOW that you’re high is worse. This is definitely one of those “read the room” moments where I think you should have took time and place and company a little more into consideration.", "ESH I think the fact it's a Christian wedding is irrelevant. Jesus never said anything about drugs and he was very into wine. However, I think it's wrong to bring that sort of thing to a wedding and consume it during the reception. Being drunk is not the same as being high. I won't say if it's better or worse but it isn't the same. Maybe if you break off afterwards. Definitely don't offer it to people who you don't know. \n\nI do think they blew it completely out of proportion and were rude.", "Just to clarify, you offered complete strangers drugs at a wedding where you were a plus one. YTA, that's not really the time or place.", "Probably shouldn’t have offered. Thats where you fucked up. Not a huge problem in itself at all, but not the right crowd for that kind of free-spiritedness. As for them, they can all get fucked. Walking with a stick up their asses.", "ESH.\n\nIf you wanted to have a THC gummy, that is fine. Probably you were In better shape than the people drinking. Eat your gummy in privacy and NBD. \n\nBut don't make a deal of it and offer people you don't know to partake. You don't know anyone there, and regardless of legality, THC still has a stigma with some people.", "NTA. Shit I’d have to take MANY THC gummies to attend a Christian wedding.\n\nBut seriously, ya don’t go around offering candy to strangers there Bud. I think most of us know that by now lol.\n\nAnyhow, the way some people of that religion will be so “high & mighty judgmental” when it’s usually “one of their own” who’s done something heinous AF instead.  \n\nDon’t let it at all phase you.", "Genuine question here...\n\nThis is already a fair way down the thread, so it may get lost. A point that I'm picking up,  and it's been mentioned many times: OP was a \"Plus 1\" at this wedding.\n\nHow does their invitation status matter? They're a wedding guest, at a wedding. I was pleased to have people at mine, and I assumed that anyone I didn't know was a friend or relative of my wife.  We even had gatecrashers, and we welcomed them too.\n\nWhy is this a thing? Is it an American thing, or a xtian thing? (I recognise that both of those bodies that have an obsession with status, so this is what I expect the answer to be).  How is the fact that they were invited via their partner relevant, and why is it known by other guests? I am genuinely curious about this peculiarity.", "I guess that's what you get for being generous? I'm sorry that happened,  we still live in a world where not everyone is cool with it. It's decriminalized in my state, but still illegal.  So one is discrete or does not partake. \n\nI think you had altruistic motives,  most thc takets are generally a sharing lot.  But ya didn't know em,  and that was the mistake you made.  I would love,  with every fiber of my being,  because you're clearly a good human to give you the big not the A one,  but you donked up.  Granted, I personally think everyone else was a massive tool that you wasted your generosity on.  I'm going with ESH and it hurts me SO much!! Until opinions change,  stop being a lovely giving human.  And hang in there,  you're s good egg.", "Knowing it's a Christian wedding, it's safe to assume it's not the audience to offer gummies to. And you shouldn't be offering it to people you don't know.", "YTA, as a plus one, I wouldn't take drugs at someone's wedding reception as you don't know the people there and how they will react to it. Yes, they overreacted also", "YTA, taking drugs at someone’s wedding isn’t a right, they asked you not to go, a normal human would go “okay I won’t get high”, however you couldn’t manage this. \n\nAlso, it sounds like you’re an addict, I’d ask yourself why exactly you needed to get high at an event, alone.", "YTA, it's absolutely not okay to indulge in any kind of drugs on a wedding without explicit permission from the bridal party. \n\nI would have kicked you out right then and there.", "YTA would you go to a wedding and offer vicodin? Oxycontin? Both are legal, but trashy AF to offer around as a party drug at an acquaintances wedding. \n\nSeriously. Rolling my eyes.", "NAH but what in the actual fuck. It’s one thing if YOU take your gummies, it’s another to offer others who you have no idea who they are and what they are about. You invited this situation into yourself.", "People take THC gummies for everything to help there anxiety or panic attacks or other medical issues or stomach problems to help them eat n other issues too so that’s not only for “drugs”", "Yta for disrespecting peoples’ events.", "Hypocritical fucks. That’s all they are and you shouldn’t worry about their bullshit opinions for one second. \n\nSo, it’s perfectly acceptable for anyone there to get toilet-hugging, shit-faced drunk, but how dare you bring LEGAL gummies along to a Christian wedding?! \n\nIronic that they’re so worried about “addictive drugs” in front of kids when they have an open bar serving a far more addictive drug than THC. \n\nFuck these people. NTA", "NTA Weed is no worse than the alcohol (the opposite is demonstrably true), and alcohol was served. Weed has nothing to do with Christianity, and the social stigma around weed people keep mentioning - it's time to let that shit go.", "YTA you need to learn social awareness", "NTA\n\nWeed is not a big deal and being “Christian” has nothing to do with it as I’ve met plenty of Christians who smoke weed.\n\nAll y’all saying that you think OP is the AH, I’m sure the people knew it was weed gummies. Y’all need to get the sticks out of your asses about weed.", "NTA Sometimes you need something to get through these stupid weddings - for some it's alcohol, for others weed. So long as it's legal who cares. They need to remove the sticks from their asses.", "NTA lol\n\nThey're just being judgmental, dramatic prudes imo. It's their ignorance about drugs that caused an overreaction and tbh, you acted quite appropriately. It's not like you went around with a flashing neon sign yelling \"free drugs - who wants some drugs? how about you kids?\" lol Instead you kept to yourself and politely offered a couple of nearby ADULTS if they wished to partake and that was it. The ones who chose to make a huge scene about it were more in the wrong than you are because they turned a tiny thing into seemingly everyone's business. \n\nThey could have dealt with it with a simple \"hey man, I don't like that you brought those here, please leave if you are going to take those\" and not with whatever this whole unnecessary debacle was, my god. I think leaving was the best choice. You made a mistake by offering some to the wrong people but that doesn't make you an asshole. Just generous but unfortunate.", "NTA. You even offered to share. They're uptight wanks", "Offering a beer to a non drinker doesn't make people offended. They'd just decline and carry on. Shouldn't be any different with marijuana. Guy was being friendly and generous.\n\nIf you don't partake in that it's fine, say no and move on. No reason at all to be upset.", "NTA BUT would offer my shit to strangers If idk if they are cool with it. Lol at some of the comments. Meanwhile I’ve done drugs at a wedding w the bride and groom and others in the bridal sweet. It was a blast Hahha great wedding", "NTA. People really need to get over themselves when it comes to weed. If that means they need to have it shoved in their faces, they need to have it shoved in their faces.", "NTA. 🤣🙄 Sounds like a bunch of HIPPOcrits. \n\nlike \"yooo bro, this the house of God. How dare you?!\" But it's cool if I down this booze. 🤯\n\nBut yeah, next time keep it discreet. 🤐", "NTA what a bunch of fuckin squares.", "So, they can drink around kids but you can’t take an edible? That logic is flawed on so many levels lol\n\nIt’s their wedding, so respect their wishes, but if they didn’t outline that ahead of time then you’re not the asshole. If they didn’t have a bar and it was a sober affair…that would be different.\n\nThat whole wedding party sounds like a bunch of judgmental assholes; which tracks, given the whole Christian thing. \n\nYou’re NTA.", "NTA. Fuck those judgemental chrissos. Gross", "NTA. Sounds like you were with some self-righteous jerks. But maybe hide the fact that you have gummies next time if you don’t know the people.", "I think most reasonable people would need THC gummies to get through a christian wedding.", "ESH. But you started it. This was a stranger's wedding, why would you think that a) this was appropriate & b) a good idea to be open about?\n\nWhen you're a plus one, you're supposed to be on your absolute best, most charming behaviour.", "i dont even have a judgment to pass the title just cracked me up laughing", "Ask them to point to the bit in the bible that forbids weed.  NTA.", "So YTA. Not for taking thc but even really mentioning it or offering it to people you don’t know. Really, you were a +1 at a Christian wedding so the bride or groom didn’t even know you and you still thought this was okay?", "ESH leaning towards YTA, I’m sorry I partake, but you gotta know a time and place. Also damn, c’mon you know Christians be hardcore when it comes to weed. Alcohol is ok because of the whole water to wine stuff but weed will always be a “No-No” for like 99% of them. Why would you offer to people you don’t know too?!? I understand it’s legal, but people will say shit and if you don’t want to deal with it then you need to learn when to reveal it and when to keep that ace up you’re sleeve. Also next time use a code word, that most who partake would know but those who don’t won’t, such as “Hey would like a safety meeting?” or something including the words safety meeting. Have a good one and enjoy your gummies.", "YTA", "YTA - why the hell are you taking drugs at a wedding? It's good they made you uncomfortable because Christian or not it's still a fucking stupid thing to do.", "Nah do what your posta", "Not the ah for bringing it or taljng it.\n\nKinda YTA for offering it to people you don't know", "But offering alcohol is ok?", "ESH. They were definitely overreacting but why would you offer the gummies to random people at the wedding? It's like you were trying to draw attention to yourself on purpose.", "I agree-ish-- before offering booze or edibles to someone, you should gage how the offer will be received. That said, wow is it suddenly apparent to me how location-related this sort of thing is.\n\nI can't throw a rock without hitting a dispensary, edibles here are on a par with a martini after work, but I'm an Ontarian, so...", "Because there’s an open bar with drugs being served to all guests?", "Don't bring drugs to a wedding? What the hell do you call the open bar? When are these fallacies, these remnants from illogical, hypocritical Nancy Reagan doublespeak, going to be debunked and trashed for good? If he'd brought 20 year old scotch or fine champagne, he'd be toasted. But bring in a much milder vice and he's ostracized. \n\nI am so sick of booze drinkers thinking they are not drug users, simply because it's been legal, and we have made this unscientific distinction, somehow extracting alcohol from the category of drugs. Anyone with any real grasp of these 2 drugs knows that weed is far more benign. We've known this forever. Weed is legal now, and despite enduring 80 years of a legalization process, we certainly didn't have to amend the Constitution to do it. And as much as I love to drink, you'd be blind to laugh off the Prohibitionists as just hyper-religious prudes. Alcohol does serious damage to society and interpersonal relationships. No one ever smoked weed and did so much wrong, that they had to go to Jesus and radically change their life. I know 3 people - including my mother - who would wake and drink. The other 2 would wake and drink, eat barely anything, and are slowly withering away as I type this. Gummies aren't going to cause serious accidents, regrets or ruin. Face it, after heroin and fentanyl, booze is the most dangerous.\n\nWe didn't jump into an empty pool, our brains weren't fried, and in fact, our brains are so functional that we're running society now.  In the immortal words of Rodney, \"The war's over, get some new parts for your head.\" We went through so much unnecessary bullshit and suffering due to propaganda. Weddings could rightfully normalize it, and to call OP's actions disrespectful is like accusing him of calling the bride a cow or something. It's nonsense, he was trying to be generous. Might as well hang him for his choice of tie, it's so arbitrary. The real crime is that he felt compelled to sit in his car while everyone inside is getting drunk.\n\nAbsolutely, 100%, Not the Asshole, he's not crazy, you're the one that's crazy.", "It’s legal. It’s no different than alcohol, and the dose he took won’t make him any more out of it than if he was drunk. Either way, he can take whatever the fuck he wants as long as he’s not causing a scene. He shouldn’t have offered the gummies to anyone else. But taking them? Nah. Not a dick move unless you know you can’t handle them, which wasn’t his case", "> Likewise here, it's disrespectful.\n\nSays who? When did that become a thing?", "You must have missed the open bar handing out DRUGS!!!?\n\nBut, I’m sure you’re okay with that because it’s “different” \n\nWhy wouldn’t you kick out all the drug users?", "> Who the fuck thinks it’s a good idea to take drugs to a wedding?\n\nMost people. It's actually considered pretty weird in the US to have a sober wedding. We call it an open bar. Alcohol is also a drug. We like to separate that terminology for no other reason that people wanting to feel like it's more acceptable.", "You must be fun at parties", "You also just don’t bring your own party favors to a wedding, whether it’s a flask to a dry wedding or edibles to an open bar wedding. Especially when you don’t personally know the bride and groom.", "Nice. There’s no such thing as a “bad trip” with THC. Bad trips are for hallucinogens only and not possible with THC because it has no hallucinogenic properties whatsoever.", "The difference is that the legalisation of weed is relatively new. Where as alcohol has thousands of years of acceptance and consumption. It will take time for the stigma and misinformation of marijuana to pass.", "Alcohol is often served at weddings. Weed is not.", "Xtians can judge people harshly for *anything*.\nThere's no hate like xtian love.", "Xtians love being repressed, and repressing everyone else.  The church tells them it is what is expected of them.", "Careful with all that sound logic and reason… it’ll get you nowhere with the hypocritical tidal wave flowing through this fucking comment section….", "Yes, I would have said y t a if it was a dry wedding, because I think that kinda sets an expectation of sonriety. A lot of people are saying OP shouldn't have offered the gummies, but I don't think it was an AH move. A lot of people use pot, there is still a stigma for sure but I think that at this point we should acknowledge that if people are getting trashed at an open bar, an adult can take a pot gummy. It's not like OP took 500mg and turned into a zombie.", "Holy shit. \n\nJust, fucking awful.", "Seriously? There are no THC “junkies” \n\nEducate yourself on matters before forming an opinion or it just comes off as idiocy.", "Lmao junkie, it's rather difficult to stuff weed in a syringe dude.", "They’re illegal without a prescription and a controlled substance. Not similar to gummies AT ALL. \n\nSeriously. Rolling my eyes at how stupid that comparison really is.", "I'm rolling my eyes at you comparing a schedule 1 controlled opiate being equivalent to a cannabis edible. If you eat a few strong edibles you'll feel nauseated but it's not going to literally kill you like a damn oxy OD, gtfoh", "It depends what flavour of repression is their church's favourite.  Xtians love to spread their rules over other people.", "Lol don't know why you're being downvoted, it's like a joke DARE class in this thread", "So if something is legal it’s okay to take it to a wedding?", "At a catholic wedding there’s bound to be a higher proportion of people with outdated opinions… as OP found out after he read the room too late. Is everyone here responding under 25?!", "My bf used edibles for the first time, and when he found out my mom took 2 to help her sleep, he decided to take 4.\n\n30 mi utes later he was on the floor saying \"Four was too many\" and I was looking online to see if anyone ever ODed from weed. Lol", "You mean if he hadn't OFFERED it to strangers\n\nESH for sure", "It’s a matter of what folks know how to handle. Your average wedding attendee knows what a glass of wine will do to them, but an edible could turn the reception into a crises for them.", "Yeah, I'm gonna have to agree with this... OP didn't do anything wrong. It's legal in that jurisdiction and they were being polite in offering it to others of legal age. Personally, I also would have declined (for totally different reasons) but wouldn't have been offended or thought anything bad about OP... Because anyone that equates pot to meth or crack is just really fucking ignorant.", "Especially when it is literally going to schools, roads and other things TAXS go to, in states where’s it legal. And for decades before when drug seizures/drug money literally supported police, fire etc.", "Some random dude offering drugs to people at a wedding he wasn’t even specifically invited to is not ok.  \n\nEven disregarding the drug aspect, if some stranger pulled candy from his pocket and started offering it to guests at my wedding during the reception I’d be a little annoyed.", "It's actually frowned upon to show up with your own alcohol. For several reasons, including the venue's insurance policy. The open bar isn't usually stocked with whatever people happened to bring, it's stocked with what the couple are comfortable serving. The bar staff may have been warned about some folks, and are able to decide not to overserve someone who's overdoing it at their discretion. People who show up with bottles or flasks are also rude for implying they expect the couple's hospitality to be insufficient for their standards.", "If you’re doing a drug that is not on offer at the wedding, you shouldn’t be noticeable about it.", "It's always been.\n\nYou're free to do whatever you want, though.", "“Why don’t I have any friends!!!”", "I have self control, I don’t get drunk or high when someone asks me not to. That’s what normal people do, you should try.", "Thank you for telling me. I guess I used the wrong term. You can still react to it in an undesirable way though. That is what I meant to say.", "Every wedding I've been to seems to have men coked up 🤷‍♀️", "Don't know why this true statement is getting so many downvotes.", "Pssst, just a heads up calling it marijuana kind of perpetuates that negative stereotype as it's a heavily racialized term. Better to stick with the scientifically accurate term, cannabis!", "Well... Canadian weddings sometimes have weed available now, just like booze. On a totally unrelated note, those weddings also seem to include late night pizza deliveries or a nacho cart lol.\n\nBut agreed. If a substance isn't being offered at a wedding, it's poor manners to bring it yourself. Don't bring alcohol to a dry wedding (just leave early...) and don't bring weed to an alcohol-only wedding.\n\n It isn't simply about legality, it's also about the norms and vibe of the wedding - and that's what OP failed to consider unfortunately.", "Having a cannabis bar for weddings in legal states like California and Colorado isn't uncommon, it's actually happening more often along with things like medicated high-end dinner courses.", "Yep, the worst thing a stoned person will do is be completely boring.\nWe all know the worst things a drunk will do.", "This!! I'll take a giggly  hungry, slightly tired human over someone punching walls EVERY DAY OF THE WEEK and twice on Sunday.", "Alcohol has been consumed and accepted for thousands of years. The legalisation of weed is new. Generations have been taught that weed is bad. People went to jail for long periods of time because of it. It will take time for that stigma to pass. We are not there yet.", "My late grandfather (a truly great man, may be rest in peace) was a pastor at a local church when I was a child. \nMy mom is an avid cannabis enjoyer. \nThey got into this exact argument and he tried to say that it's because it wasn't fermented wine. \nShe of course responded with \"Then why didn't the bible just say juice?\"", "If you're doing drugs at wildly innapriopiate places, than that's addict behaviour. OP can't get trough a wedding without his fix.\n\nI like to smoke. Nothing wrong with weed. I know when it's appropiate to do so and when it's not. I'm also fine if I cant indulge somewhere for one or multiple days.\n\n&#x200B;\n\n>Educate yourself on matters before forming an opinion or it just comes off as idiocy.\n\nIronic.", "Doing drugs at places where it's wildly innapropiate to do so? Yes, that's the behaviour of an addict.\n\nThis comes from someone who likes to smoke on the regular. I just know when and where it's appropiate to do so.", "Well yes, but beyond that, it's no different than the people drinking. If this was a sober wedding, I'd get the issue, but it wasn't.", "Oh absolutely, everything is relative. \n\nThe max THC i've taken in an 1-2 hour sitting was $3,000. Sometimes it hit me barely, sometimes decently, and sometimes like a f\\*\\*\\*\\*\\*\\*ing truck! - All tolerance dependent. I'm a big dude though with a high tolerance usually so....", "Yeah,  OP was being a good (if slightly myopic) human and got skeward.", "But that’s total bullshit?", "Ergo people are hypocrites, which makes everyone AHs.\n\nWhether it's seen that way doesn't change the fact that alcohol has more addiction potential and has higher risks to a person, including brain health and cancer.", "Right, because nothing says inconsiderate like Dom Perignon. Yes, of course it's unnecessary to bring booze to an open bar, but not weed.", "WTF?! The people involved in the conversation were getting drunk.", "You must keep interesting company", "I don't consume either, but some people are hypocrites who consume alcohol but judge weed users for using 'drugs'. That despite alcohol being more addictive and harmful. So yeah, the downvotes are likely coming from them.\n\nESH, don't offer strangers drugs, but people already partaking in drugs via alcohol at a wedding should get off their moralizing high horse.", "What? Really? I’ve never heard that before! It’s not a radicalised term in Australia. We say medical marijuana when describing the stuff you get with a prescription and colloquial terms for day to day. Weed, pot etc. Cannabis is not an commonly used term here.", "Why are you being downvoted? Reddit is fucking weird sometimes.", "Prohibition of alcohol ended in 1933 in the states.", "Yeah that probably means USA. But that was a dumb comment from them, because guess what else isn't FDA approved? Alcohol.", "But but but REEFER MADNESS 🫨", "Not relevant. It’s not for op to decide what’s okay for other peoples children to be around, nor is it okay for op to offer weed to people at a wedding he doesn’t know lol.", "$3000???", "I don't know anyone who actively uses anything tbh. I'm probably the worst with the occasional joint, but at weddings, there's always coke.", "what part of OP being a stranger don’t you understand? You don’t offer drugs to people you don’t know. if OP offered alcohol instead of weed I would’ve had the same response.", "I probably made too many generalizations? Such is life 😊", "That buys a lot of edibles.", "Sounds like he got ripped off. My partner's mum was convinced that $300 for a few grams was reasonable lol not in the slightest. But otherwise like I don't even know if it's physically possible to even consume that much in such a short amount of time unless you were buying crazy expensive stuff.", "Maybe it’s a local thing?  I can only think of one wedding I’ve been to where maybe a group had something other than alcohol or weed (and that was the bride’s closest friends).  Pretty sure it was just alcohol or weed, though - a lot of it was stuff that was kinda expected of the crowd we went to high school with (a tiny all girl’s high that combined with 2 other small schools to create one of the best drama programs in a very populous state, arguably the best as we won the state competition for that the year before I started plus 2/4 years I should’ve been there, if I hadn’t left high school early).", "It's being polite, \n\"Hi I'm 'x', would you like a drink?\" \"No, thanks\" \"all good, how do you know the bride\" \n\nA totally normal and logical reaction.\n\nGetting agitated and weird that someone offered you something with no pressure, that's weird af.", "Could be, and probably is. I'm from the UK, and coke is absolutely rife, particularly for long stints on the beer. Young men who live with parents and have too much disposable cash seem to be the worst for it.", "you keep offering drugs to strangers and I’ll keep thinking it’s weird and not appropriate 👍 we are allowed to think differently", "You gotta remember that the legalisation of weed is new. It will take time for it to be offered as simply as offering a drink. The stigma and misinformation about weed is still prevalent in many communities and age demographics because that is what they were taught for years. Just because it’s legal now in some place doesn’t mean the prejudices of people automatically lifts. So this couple obviously had prejudices, which OP could of gathered if he had just tested the waters with new people.", "That's why you've downvoted my every response because someone disagreed with you eh? \n\nIt's a moral debate, in moral debate subreddit. \n\nI'm yet to see any point from you as to how offering to share a non illegal, widely accepted substance is \"immoral\". \n\nUnless you're at an AA meeting, I think he's fine.", "when did I say it was immoral 💀 I said it was WEIRD. you’re the type of smoker that gives stoners a bad rep. You don’t offer people you don’t know substances. Using your example- who’s to say the person OP offered drugs to wasn’t in recovery? also weed isn’t even legal everywhere, in many states you’ll still get locked up for possession. and you’re a grown ass man crying about downvotes 😂 have another one weirdo", "You aren't going to change a stoner's mind and you're out numbered on Reddit, in my experience.", "Ahahha \n\nI pointed out the hypocrisy of your \"different opinions\" comment, that's it. You're obviously getting emotionally charged about something that's just supposed to be a discussion of opinion.\nI'm not mad you're downvoting my comments, I used it to point out you're clearly offended by me having a different opinion to you. \n\nIf they're a recovering addict, they say no. It doesn't make someone a bad person for offering. \nSame concept can be applied to someone saying happy mother's day, to someone who lost their mother. They're just being polite, no I'll will was applied. \n\nYou keep getting offended by differing opinions though champ, it shows real growth 😂\n\nEdit: to fit your edit. \n\nYou called it immoral when you gave him the AH title? Unless we consider assholes to have good moral takes of course...", "Gotta love the pointless insults too, you're a real man of the people.", "It’s really not weird at all. Pretty normal. You are 100% adding morality on which substances are okay and which are not. That’s what’s weird. \n\nI don’t smoke or take gummies. I do drink. I’m aware that alcohol is much much worse for me than weed.", "YTA for offering it to someone else. Why would you think that's okay or a good idea?", "NAH. I think you're probably used to being in like minded company where it'd be polite to share so I get why you felt you should offer since you weren't trying to hide it. It sucks but unless you know for sure those around you partake it's just best to err on the side of caution. Funny how if you'd just taken them on the sly no one would have any idea and you'd likely never have needed to post this. It's wild you're being judged for either not being discreet or for being under the influence regardless while others give no mind to people being drunk. Try not to take it too personally, there's no hate like 'christian' love. Maybe one day the stigma will finally be reduced. A lot of strides are being made now for PTSD using MDMA and psilocybin, will be interesting to see if attitudes towards those substances change too.", "NTA. Lotta prudes in this thread", "Y T A for the layout of the post alone. Also, who takes drugs at a wedding?", "That was idiotic. You shouldn't be going around offering people drugs. Especially at a Christian wedding.", "Nta", "Low key YTA. It’s presumptuous to show up as a plus one for a couple you don’t know well and eat an edible, especially as the plus one of a member of the bridal party, even more especially when not everyone got a plus one\n\nI’m happy weed is being legalized. But it is still a polarizing thing. And - I have to say - I got pretty annoyed when my friend ate a gummy at my event and was completely out of it and rude to my other friends who he had just met as a result. He didn’t even do them the courtesy of explaining why he was acting so strange and aloof \n\nUntil the hosts say it is cool at larger gatherings, best to not presume\n\n….and this has nothing to do with anyone being Christian lol", "YTA—You lack tact and decorum. There’s a time and place and her wedding wasn’t it.", "I've never been to a wedding or party when someone didn't offer me THC.  It's legal in my country but even before it was, it wasn't very secretive.  So, my friend, you are NTA and the rest of the pearl clutchers can get bent (on booze)", "I'm sure it's been mentioned before, but for the love of all the THC, put a break in there, champ. your lack of paragraphs is giving me the babadooks ...", "ESH - they all suck for being so extra about someone taking a 5mg gummy and offering to share.\n\nYou suck for taking the most discreet intoxicant indiscreetly.", "YTA. You could have taken it quietly. You didn't just take it, you were offering it to others. Plus you are misleading others about the story. Why can't you be honest with yourself?", "Nta. They the assholes. Fucking religious nuts.", "Nta it is legal, but come on my buddy how can you not stop a square from a mile off. There's times and places to be high and that's all the time and everywhere but you don't have to tell everyone or even share.", "While your generosity does you credit, maybe take this as a learning experience to not offer drugs (regardless of legality) to people you don't know, and do your drugs in the bathroom like any self-respecting coke fiend ;)\n\nAnyone else appreciating the irony of this? Once upon a time it was \"don't take candy from strangers\", now it's \"don't offer candy to strangers\" lol", "It's funny how they all up for getting hammered on whatever \"non FDA approved\" alcohol they have, in front of all those kids 😯.\n\nBut a gummy? God forbid!", "NTA - Fuck those judgmental “Christian” fucks. Why do some people think that believing ridiculous stories from a 2000 year old book entitles you to be a total asshole to everyone who doesn’t completely mirror your arbitrary value system?", "Being chastised for having edibles by a bunch of drunk Christians. NTA", "Yes. Although it is completely hypocritical as people get stupid drunk at weddings, I think it's socially unacceptable to be taking other drugs at a wedding. I'm not saying I agree with that or that's the way it should be, or that the other people should've made such a big deal about it, but there you go.\n\nIn future, if you are at formal events, I suggest you just stick with the socially acceptable drugs and have a beer.", "ESH.  You for offering gummies to people you didn’t know.  This was just a dumb move.  Them for the giant stick of false equivalence up their asses.  Your point about bringing “addictive drugs” to a party with an open bar was spot on.  Alcohol is one of the most socially acceptable and readily available addictive drugs, but they certainly didn’t have a problem with that.", "YTA. Imagine going to a dry wedding with a flask of liquor and offering it to attendees. Legal or not, it’s not appropriate.", "Lol “do you want some drugs man?” to random people at a wedding. And to then go “actually it’s legal, you know” like you’re Cheech\n\nOf course YTA\n\nThose people overreacted but you’re definitely out of order", "YTA", "YTA - Not because you took them, but you offered it to others at the wedding. Rule of thumb is you can only commit one offence at one time, and you got exposed because you broke that. \n\nIt's like smuggling alcohol into a muslim wedding. As long as you aren't caught, taking a sip won't hurt. But the disrespect they feel when you are caught will remain.", "How does your religion allow you to reclassify drugs??? Wtf?", "ESH, you less so. While I understand that it may be etiquette to offer things to others around you, maybe don't offer edibles to strangers at a wedding? But the couple are definitely AHs for their behavior.", "NTA - next time don't share. Drinking and getting drunk is okay but a 5mg gummy isn't, is nothing more than hypocritical bullfarts. 5mg is also very, very, very, very, tiny amount. I can't even phantom anyone really getting that high\nEdit to add : for most seasoned weeders - 5mg is an appetizer.", "YTA\n\nYou know not all people like thc, so why were you trying to give thc to people?\n\nThey should have kicked you out.", "NTA you're not the devils haircut for eating a gummie at a wedding.  But learn to read a room....if you'd been paying attention you would have known straight off these people were not into it.  By all means go out and have some fun....but make sure you know who you're hanging out with before you start feeling generous.  Discreetly having fun is still a good time....", "YTA - So you’re a pot head who literally couldn’t help himself for what 4-6 hours. Get over yourself!\n\nNot only did you bring drugs to a wedding you offered them to others. This is 100% something you should have cleared with the couple before doing.", "Since the bride didn't care NTA... but in the future be more discreet till you know who you're around", "Very very lightly ESH. You're fine for taking them, you know your tolerance and I don't know if it was an either or thing for you, but if so I'm with you that I'd much rather have a teeny bit of weed than drink. But while I appreciate the courtesy of you offering to share and of course they majorly overreacted because of the sheltered, and honestly prejudiced, bubble they're in, strangers at a formal gathering who haven't expressed interest are probably not the folks to offer to. Just gotta work on reading the room and feeling it out a bit. Much love", "ESH. Judgemental hypocrites are the worst. The majority of the adults at weddings are indulging in some kind of drug. Whether it's alcohol, tobacco  or even something illicit. But offering edibles is a fucking brain dead move.", "YTA\n\nI don't think the religion has a lot to do with it. You were a plus one guest at a wedding, at the bridal party table no less, and had to be the guy that offers edibles to people?\n\nThen when you apologized you had to throw in:\n\n >explain that the gummies are legal, & not addictive like alcohol or other drugs\n\nDude, that's not an apology, that's trying to educate people on your point of view.\n\nCome on man. Whether they are prudish or not isn't the issue. That's some main character shit. Just take your gummies in private next time. \n\nAlso, *it is* addictive. I smoked for years, it was hard AF to quit. Honestly, it was easier for me to quit cigarettes than weed. I mean, I get that nicotine is supposed to be more addictive, but weed was just waaaay better imo and took much more effort to quit.... And honestly, now that I'm sober I realize that the people always talking about how THC isn't addictive- they're usually chronic users.", "My wedding recently happened and I know many people either did thc or mushrooms. I also specifically addressed it to all of them - we have a culture gap and it’s a felony in this state to do things like that. Everyone was discrete. It was fine. But if anyone had offered the wrong relative a gummy it would be a major issue …", "Bruh. I’m an addict but this is pure degenerate behaviour, do edibles at home you reprobate 😂. YTA but that couple sound pretty annoying so maybe ESH", "YTA. If you can't go that long without getting high, you need to reevaluate your life. Don't bring drugs to strangers' weddings.", "Yeah, you are.", "YTA, bringing a controversial drug, I believe in legalization, to a wedding of people you don't know well is just stupid and kind of disrespectful. Would not have faulted you if you just took them yourself without anyone knowing but offering special candy to strangers is just....", "YTA for not keeping it to yourself. No one would have ever known but you just had to go and show it off.", "Nta.", "YTA\n\nWas it really necessary to bring drugs to a wedding? You couldn't have gone without them for one day, or at least wait until you get home?", "Lol ESH", "YTA. \n\nYou're a guest. You don't know these people. This is not a public space. They don't know how you act when high. This is an important event not just any dinner party. They don't know how high you're getting. For all they know you're about to start acting a fool like how the movies show weed makes people act, especially if they aren't familiar with the effects. Why stir up such drama? Just stay sober one night or do it discreetly if you're a bit addicted. \n\n Im a stoner and there was 0 weed at my wedding even the after-party for just our friends because it just isn't the vibe for this kind of event IMO. It's a dance party not a loaf around and philosophize at the dorm party, ifywim. At our events no one was told not to get high it just wasn't offered ... so I mean some people might have taken edibles or vaped on the porch and i didn't notice but isn't the whole point of edibles... that it's discreet?? Just pop it and don't make a fuss and no one would have noticed unless you started acting stupid. Imo passing it around the table was dumb. I can't think of a single person who'd have passed weed around the table.of strangers but that's also why no strangers were invited to my wedding. \n\nAlso, weed can be addictive. See the thriving Marijuana Anonymous groups and the r/leaves forum for storytime. \n\nIf you can't enjoy a meal without a hit, consider cutting back for your own health.", "NTA.  Oh, it's cool for people to get sloppy drunk and possibly pass out or puke at a reception but God forbid you take some thc. Bunch damned hypocrites on this thread..", "NTA. You shouldnt brag though, just take it in secret next time and enjoy yourself. Last week I was at an awesome wedding, smoked Like 6 joints, but nobody saw me doing it. I also used a vape cart the entire day but didnt inform anyone what it was so they thought it was tobacco, or whatever I dont know what they thought. Im also Christian. They sound very prude.", "YTA. The issue isn’t that you enjoy THC, that’s fine, my opinion is unless the venue serves it then it’s not the place to take it without permission. If you bought THC behind a bar then fair enough it’s no one else’s business but you brought a product that the venue doesn’t provide. I don’t know if it’s legal to sell it in a venue like that but if it isn’t then you adhere to the standard of the venue you’re in. It’s sort of like going to a macdonalds (that doesn’t serve alcohol) and presuming you are entitled to consume alcohol on the premises. Regardless it was extremely naive of you to think this was ok, if you wanted to take some then Just discreetly have some and drink coke so if you get buzzed they presume you’ve had a couple of vodkas.", "ESH\n\nWhy would you offer strangers candy? Especially THC candy?", "“legal as alcohol”\n\nAlcohol has been made a Schedule I drug by the US federal government? National Banks in the US can’t accept deposits from businesses that manufacture or sell alcohol?\n\nIf not, cannabis and alcohol are not comparably legal.\n\neta: not saying it makes any sense, but it’s still the current reality.", ">It’s ok you took 5mg thc.\n\nNo it's not. It's never okay to do drugs at a wedding without explicit permission from the bridal party. Are you people insane? Would it also be okay to do just a little bit of coke?", "Agreed. When I was in my mid 20s, I was part of the bridal party at a dry wedding, and me and several other people attending, including half of the bridal party, disappeared to the pub for an hour and came back drunk. We were absolutely arseholes for that, and we didn't even bring any alcohol to the wedding.", "Agree, YTA. OP did not read the room and *shocked Pikachu face* when the crowd didn't agree with his choice to bring/ take/ offer gummies. The \"it's legal, it should be fine\" argument is moot. This is about social behavior at a wedding.", "There were already drugs at the wedding, in the form of alcohol\n\nTerrible take", "OP is a weed addict and doesn't have any other personality.", "Yea, grown adults do their drugs in the bathroom with multiple people in one stall.", "\"a bad trip\" it's not LSD yeesh what in the reefer madness", "I understand your point, but alcohol is also a drug and it was being openly done around kids. The hypocrisy of people around marijuana really drives me crazy.", "All this applies to alcohol as well though. What happens if a kid finds a soda based drink someone left on a table? They could react horribly! The AHs here are the people at the table who didn't give OP a heads up that this would not be a weed friendly environment and instead decided to gossip about it.", "Aspirin is perfectly legal but if you take 13 of them mf'ers it'll be your last headache.", "Am I allowed to take painkillers such as codine at a wedding?", "Couldn't* care less.", "I’ve been reading the book of John all wrong", ">Also, who takes drugs at a wedding?\n\nEveryone at the open bar for starters.", "I don't know about other countries, but the US used to really push the idea that weed was a \"gateway drug\" and it would inevitably lead to hard drugs. Growing up, it was really emphasized at school. Cops would even have assemblies to tell students how dangerous it was. I think some people have a hard time letting that mindset go.", ">Maybe I'm out of touch here as a Canadian, but people need to get over their problems with weed.\n\nI'm Dutch so I have literally zero problems with weed. But doing it at a wedding is absolutely not okay.", "> but people need to get over their problems with weed.\n\nEven people who have no issue with weed can understand that someone else's wedding isn't an appropriate time, the same way you wouldn't sneak your own booze into a dry wedding.\n\nI don't think being Canadian has anything to do with you being out of touch, all the Canadians I've met have been able to understand basic social etiquette.", "It's definitely not equivalent to coke, even as a person who's super sensitive to thc/weed.", "Equating any amount of cocaine with a fucking 5mg gummy is such a massive overreaction, my god.", "It's a legal, extremely mild drug that doesn't cause antisocial behaviour. Is it never okay to have a coffee at a wedding without explicit permission? What about paracetamol or wine?", "I would offer people alcohol at a dry wedding.", "> The \"it's legal, it should be fine\" argument is moot\n\nYep. You could say the same with guns at certain venues, but you bet your ass majority of posters here wouldn't want Uncle Cletus packing his revolver on his hip. \n\nFact of the matter is some subcultures would be fine with it; others wouldn't. Just like weed. He didn't read the room. He isn't a bad guy but he did make a faux pas.", "> It’s no different than alcohol, \n\nYes, bringing booze to a dry wedding would also be an asshole move. You're close to getting it!", "When are these fallacies, these remnants from illogical, hypocritical Nancy Reagan doublespeak, going to be debunked and trashed for good?\n\nHopefully soon but the wedding of two people he doesn't even know is not the time to start breaking down these barriers. Fair or not there's still stigma around THC and he shouldn't have advertised that he's taking it to people he doesn't know", "Then the couple has no other personality of being “Christian” hypocrites and groom being a drunk", "I got ridiculously high several times as a small child from eating candy and baked goods that I didn't know weren't okay for me to eat. It's different when it looks like regular snacks.\n\nStill, assuming they were in OP's pocket and not just lying around, I still don't see the problem here.", "how is weed friendly the default? am I missing something?", "Honestly this is the direction I’m veering in. Sure, OP could have read the room better, but lot’s of people in this thread are making the false metaphor of “you wouldn’t bring a flask to a dry wedding,” but presumably the wedding invite/communication about the wedding, didn’t say anything about (legal) drugs being disallowed", "This depends entirely on how you define “bad trip”. It is absolutely possible to have terrible experiences on thc, with overwhelming sensory experiences, paranoia, anxiety, and panic attacks.", "Amen.", "Haha yea. I mean I almost don't want to call him an asshole because it's kinda sweet to offer, but brother read the room!", "That Is low gunmies don't work on me very well I process it too well but second hand smoke will get me a little buzzed I kinda wish 2.5 worked on me", "5 is still low though lol. In WA state a legal serving is 10mg, which is considered overly restrictive by most people here.", "NTA at all, especially somewhere legal.", "It was a gateway drug BECAUSE it was illegal. If you're willing to cross the line in the sand of meeting a dealer and buying illegal drugs, he/she would literally be your gateway to harder drugs. \n\nYour weed dealer knows a coke dealer who knows a meth dealer...", "Truth this mindset needs to die. I still always worry about the stigma of being a smoker even if it is legal. I can take 100-150mg and still fully function. I'd still eat the handful in privacy tho cause... Stigma..\n\nBut when it comes to the gateway drug that would be alcohol for SURE. I lose all sense of rational thinking. \n\nFirst time I smoked weed? Drunk. First time I did anything harder? Drunk.", ">It's legal in that jurisdiction \n\nIt's also legal to scream really loud. But that's also not something you do at a wedding.", "Dutch here too and I’ve noticed that in the Netherlands it’s seen as a fun drug but still a drug whereas in North America people basically take it whenever wherever they feel like. Cultural difference or something but yes in the Netherlands it would be seen as weird to just casually do drugs at a wedding", "I most certainly would be be drinking alcohol in the parking lot and have a flask at a dry wedding 🤣", "It's not about how heavy the drug is. It's about doing drugs at someone elses wedding.", "It's not about how heavy the drugs is. It's about doing drugs at someone elses wedding.", "This wasn't a dry wedding?", "Nice try, but no.", "It's odd how prevalent and acceptable alcoholism is in our society.", "Pizza and nachos, the true dangers of cannabis.", ">I just know when and where it's appropiate to do so.\n\nWell please enlighten us peasants. We clearly didn't get the handbook delivered.", "True but in his defense and as Christian, you'd think a room of drinking people would show some humor and grace. A \"no thanks bro, hey keep those in your pocket because there are kids around\" Would have sufficed. Instead...They told people, they gossiped, they cast judgement, they were rude and mean etc. By time they were done the bride, the groom the caterer and the Holy Spirit knew of the great travesty of the five weed gummies. No water into wine for that bunch at all.", "Thc can be toxic for children and lead to hospital visits. Bringing something that looks and taste like a gummy to an event with children and even offering other guests one is definitly relevant here. \n\n\n\nThe threat is not the impression op makes. The threat is that the kids by accident (and if you would be high accident happens) a child would need to go the hospital.", "Genuine question - what if he dropped them out of his pocket and a kid found them? I am from a place where it's still not legal and haven't been around many people who use drugs other than alcohol but having something that looks like it's for kids around kids just seems like it could be asking for trouble?", "No obviously not, but getting high/drunk is normal at a wedding. Terrible take", "Awful take.", "Your comparison with the loud screaming is actually a logical fallacy and not a valid argument. Read a book about that topic if you don't understand.", "Alcohol is a heavier, more dangerous drug than weed that was available at ~~your~~  the wedding, spare people your hypocrisy.", "How would you feel if you hadn't eaten breakfast this morning (or if you didn't, how would you feel if you had)?", "What’s the difference between couple and OP then?", "The couple actually organising the wedding has a right to allow and disallow the consumption of certain drugs.", "Yea marijuana is how it's generally referred to colloquially but that really began with the Marihuana Tax Act of 1937 in the US to reduce hemp production. Just thought to mention it because of the history and you mentioning misinformation etc.", "Well not at a wedding where the bridal party is clearly not okay with it.", "“…They told people, they gossiped, they cast judgement…” that seems pretty on brand for Christians. One of the big reasons I stopped believing was seeing all the hypocrites in the church.", "I mean he's not TA at all for taking it, just kindavfor offering it to randos lmao", "If people are okay with the children being around adult drinking alcohol, but not someone who ate a low dose edible, then frankly they are prudish, hypocritical assholes. I agree about the not offering it but, but if people want to shelter their children in such a hypocritical way, their attitudes on the subject are simply not worth caring about, because they clearly are not based in anything reasonable.", "His actions had nothing to do with other people's kids unless he was hanging out and talking to the kids. If you take your kids out in public anywhere they will be around people on drugs, there are a lot more folks using than you think. As long as OP wasn't offering some to kids or advertising he had some or was taking them to kids your concern is completely irrelevant. It's not like a kid being in the same room as some low dose weed gummies is going to EVER KNOW. Parents don't get to police other people's private behavior and OP was private except for politely offering to share with the *ADULTS* around him.", "A bunch of guys take THC together at a wedding and decide to start a band. \nA bunch of guys get drunk together at a wedding and decide to start a fight.\nAs an ex cop I’ve seen loads of events go down the drain because of alcohol. Never seen weed ruin a wedding. Wonder which affects the kids more…", "> It’s not for op to decide what’s okay for other peoples children to be around\n\nOpen bar with drunk people. OP was the least of their concern.\n\n> nor is it okay for op to offer weed to people at a wedding he doesn’t know lol.\n\nYeah, that was kinda dumb. As absurd as it is, some people will get blitzed regularly (even nightly!) on alcohol but completely freak out at the sight of weed. Too many decades of propaganda. (I don't partake myself as I live somewhere that it's highly illegal.)", "Guessing they mean 3000 mg but even then, yikes.", "It's not normal to get high at a wedding. And it's absolutely not normal to get high at *this* wedding.", "The fact that it's legal to take weed at that wedding, doesn't mean it's not an asshole move to do so.", "Being condescending doesn't make you look smart.", "Doesn't matter. It's up to the bridal party to decide in what you can indulge. If they say alcohol is okay, than alcohol is okay. It's their wedding. Skip the weed for a day dude.", "What? I never eat breakfast for one. What's that have to do with anything", "And when did I say otherwise?\n\nThat also doesn't change the hypocrisy involved. The couple at the table partaking in drugs while criticizing others for doing the same are hypocrites, which means it's AHs all around.", "Or people misunderstood? So weird", "Yes, totally. Had he taken it, and kept it to himself, nobody would be wise about it and it *could* be a perfectly acceptable situation.  \n\nOP openly talking about it with people he doesn’t know, in an environment with children he also doesn’t know, who aren’t his children - and he’s offering marijuana to people he doesn’t know is the part I’m focused on.", "Yeah, but that’s for them to decide, not you, not OP. These are their children, and this is their wedding, OP is a plus 1 and doesn’t get to decide what’s reasonable for other peoples children. \n\nSo…It still doesn’t matter whether you or OP thinks it’s reasonable or not, it’s not your or OP’s wedding and not your or OP’s children.", "Yeah imho alcohol is wayyy worse than weed when it comes to being able to \"behave\" or whatever. Then again I smoke all the time so eh", "And I totally agree, that alcohol is the more dangerous option. I happen to see a great deal of badly injured people as a result of alcohol at work and not very many injured from marijuana in my line of work (can’t think of any). My issue is not with the marijuana. \n\nWith that being said, there is still a social stigma to some when it comes to the issue of smoking marijuana - and while that’s a perfectly acceptable topic to broach, the Christian wedding is probably not the best place to broach that subject, especially if there’s kids and really really if you don’t know these people. \n\nIf you want my personal opinion (which one effects more), I think that entirely depends on usage. Marijuana can be an addiction to some, while I can’t see it having the same detrimental effects as some, I can see a financial loss that could potentially come to a parent spending too much on marijuana. Too much of anything for an extended period of time is a bad thing.", "- That’s the parents decision, not OP’s decision. Many consider alcohol more socially acceptable then marijuana, it’s not your job at a wedding, with a bunch of people you don’t know togo changing their opinions, respect it or leave. \n\n- whether you or OP consider it propaganda, is irrelevant. This is not OPs wedding, he doesn’t know these people, these are their decisions, and they are absolutely within reason to expect him to adhere to their level of respect, in their environment.", "Tell that to all the people at OP’s table high on alcohol. They’re both drugs.", "What if OP can't drink, what if they don't want to since they used to be addicts to the worse drug? Should they just go sober the whole time? \n\nThere were better comparisons than someone screaming at the top of their lungs, to someone quietly enjoying their *legal* alternative..", "Your logic seems very flawed here. As OP stated they are legal where they are so what is the difference between alcohol and THC besides societal stigma?", "It's actually for us all to decide because that's the point of this subreddit!", "You don’t get to bring your kid to an event and police what everyone is doing so they don’t get “influenced.” Are you insane?", "You missed the entire point that they're agreeing with you.....just that you shouldn't care what these type of people think as they are not reasonable.", "I was pointing out the hypocrisy in the first part, which is objectively true. Alcohol is a legitimately dangerous drug that causes huge amounts of harm to society. That's not to say weed is great, but come on, alcohol does a lot more damage.\n\nIn the second part I was agreeing with you so I'm not sure why you felt the need to get up on your soapbox and preach. It's unwise to offer weed to people you don't know because there are a LOT of stupid people out there.", "Seriously, fuck those kids. If you don't want your kids around shit, then leave them at rather. It's an open bar. I've seen seen anyone using edibles come close to engaging in the shitty behavior of drunks.\n\nAlso, I've never encountered anyone feigning concern over \"the children\" who legitimately gave a single shit about said kids", ">What if OP can't drink\n\nThen don't drink. You're not entitled to getting buzzed.   \n\n\n>Should they just go sober the whole time?\n\nIs your question really \"I he doesn't want to drink, then why can't he use drugs to get buzzed\"? That's addict talk bro. Staying sober for one day isn't a bad thing.", "Taking your shirt off is legal. The only reason not to do it at a wedding is social stigma. I still wouldn't do it at a wedding.  \n\nThis isn't a difficult point to understand - \"not your event, not your place to impose\"", "- that it’s not his wedding\n- he doesn’t know these people \n- the social stigma can apply just the same to alcohol as it does marijuana\n- it’s upto people to choose what’s okay for them, their children and their wedding, not OP.\n- he offered it to people he doesn’t know, around children that aren’t his. \n- it’s not for OP to decide what’s okay or respectful in an environment he’s unfamiliar with (say a wedding with a bunch of people he doesn’t know…)\n\nI’m not too sure what’s flawed here or hard for you to understand. The legality of marijuana means little to me in this situation. \n\nIf I were you I wouldn’t make a habit of doing things around other peoples children just because you think it’s acceptable.", "Because people are allowed to not want certain things at their wedding or around their children, legality aside.\n\nIf someone had a wedding without alcohol and didn't want their kids around people who were drunk, I would be an asshole for bringing a hip flask to the wedding and asking if the other guests wanted a shot.", "It would be wrong to take your own alcohol to a dry wedding too.", "This is beside the point. \n\nWhen you are a rando at a wedding is not the time to proselytize the church of cannabis but it is definitely the time for the hosts to celebrate their religion and beliefs.  If they wanted only weed and no alcohol then the asshole move would have been a flask but the point remains that you don't pass weed around the table at form events filled with people you don't know. This is adulting 101. What is polite at the college party or 20-somethings apartment party is not the real world norm and especially not at special events.", "Oh totally! I’m not talking about in this subreddit, I’m moreso speaking hypothetically towards a wedding sense - like if your at my wedding, and your breaking the waves so to speak. I’m not gonna care about your reasoning ima just want you to stop yk?", "Your mistaken, OP doesn’t get togo to an event where he doesn’t know anybody, with children, and attempt to change their viewpoints. \n\nIt’s pretty simple actually, be respectful of where you are, or leave…\n\nAnd yes, you get to bring your kid to an event with people you know and expect everybody there that knows eachother to be on the same wavelength about what’s acceptable, yes. That happens often.", "Well, you do if its your event obviously.\n\nThe bride said he shouldn't have brought edibles, case closed.", "Spoken like one of those people who thinks human extinction is a real problem solving strategy and is willing to enforce it on others.", "No they weren’t, because it’s their choice to be as reasonable or unreasonable to the situation, at their wedding, as they want too - OP as a guest can either respect that, or leave.\n\nThe legality of marijuana doesn’t matter, you can think these people are raising their children in a hypocritical manner, and that’s okay - but that is your thought vs the actual legal guardians decision. \n\nLike in my head, if I had someone telling me what I should do with my son, and I didn’t have a child with them, I might be liable to ask them “how many children I have with them”. When the obvious answer (0) comes up, ima follow up with “then you should keep your opinions about my children to yourself”. \n\n\nI could give a rats ass about someone else’s opinion on what’s hypocritical with how I raise my son.", "It’s really a combo answer to both of them, while i do agree with the hypocrisy, it’s not upto OP togo against that at a wedding full of people he doesn’t know who disagree with it.\n\nAs another wise commenter said, I could take off my shirt at a wedding, wave it around, but that’s not really that acceptable is it. Don’t make the waves at someone else’s wedding", "It doesn’t matter, it’s not OPs decision to make that call, it’s the parents. If you can’t manage a decent level of respect around my children, at a wedding, and I don’t even know you…we’re gonna have a quick chat and I’m not gonna care too much about your personal thoughts on how a wedding should go where you don’t know anybody there lol.\n\nLong and short of it, if op doesn’t like it, op should bounce.", "Sorry, I forgot alcohol isn't a drug.. 😂", "Orrrrrr....just take the gummies himself and not broadcast it.\n\nYou're still missing the point that you don't have to bend to the will of everyone and what they seem as 'reasonable'.  They're ignorant uptight Christians.....you don't *have* to respect that/them.", "You seem to have poor reading comprehension.\n\nOP shouldn't have been offering weed to people he doesn't know.\n\nHaving an open bar at a wedding but getting really upset about a gumi is hugely hypocritical.\n\nBoth things can be, and are, true.", "Again, fuck those kids. Leave at home. You act like he offered the kids \"special fun candy\". Respect includes not being a hypocrite and having enough insight when you are going down that road. \n\nAdults drink and adults use weed. Nothing disrespect about either. I'd had a long laugh at your short chat then carry on enjoying life.", "It's a drug that the bridal party is clearly okay with. How is this so hard to grasp for you people??\n\nYou're at someone elses event. Someone elses WEDDING. You can indulge in whatever the bridal party agrees to. If they don't have a problen with alcohol and Weed, go ahead and do alcohol and/or weed. If they don't want weed on their wedding, that's totally valid and you should comply. If you don't, you're 100% the asshole in the story.\n\nEdit:\n\nYou know I can't reply to you if you block me right? So your strategy is to reply to me and then immediatly block me so that I can't reply back? lol\n\nNo, I don't hate stoners. I like weed. I enjoy it. I know when to use it. And when not to.\n\n'You people' was referring to the people who defend indulging in weed on a wedding where the bridal party is not okay with people using weed. You know; assholes.", "YTA\n\nWho offers an edible to strangers?", "YTA\n\nNot because you brought them. Hell the last wedding I went to I brought a couple. But I was discrete because the event isn’t about me and my good time. You offered strangers and they told others who were not comfortable with it. It doesn’t matter how you feel about it. You didn’t need to act like everyone needs to cater to your choice. Then you say in the car like a child for 3 hours because you were not having fun. \n\nYou sound like a child.", "Nta those people suck. Alcohol IS worse btw 🙃", "NTA - the bride had no issue with it, these people were literally talking behind your back, and apparently one of them was intoxicated enough to prevent them from holding a conversation.", "NTA. Everyone at that wedding who has a problem with weed, those are the AH. What hypocritical nonsense. Tell me you grew up brainwashed and sheltered without telling me.", "I don't think I'd be all that happy if a plus-one I didn't even know brought and distributed gummies to people at my wedding reception.  It wouldn't have anything to do with being appalled that gummies aren't FDA approved, but because it would create a splinter group of people having a whole different shared experience that wasn't part of what was very carefully planned for the event. \n\nAlso, as a plus-one, it could be hard to read the room -- which you clearly didn't do real well here.  So impossible to know if gummies would be welcome or would be seen as the introduction of Reefer Madness into a convent.\n\nYTA", "YTA, you do that discreetly and you don’t offer it to anyone. You brought the unwanted attention to yourself, be smarter next time and enjoy the high.", "NTA\n\nI’m Christian and dabble with THC products. I wonder if that couple takes vitamins as they aren’t FDA approved either. Sounds like they have a stick up their ass. I’m tired of people treating alcohol as this safe way to let loose and THC as the Devil incarnate. While I hope I never get hit by an intoxicated driver, if I had to choose, I pick the person who had a few hits of THC over the person who had a few drinks. I’d also rather be around people using THC as they’re almost always chill while people who are drunk are unpredictable and can become violent easily.", "NTA Since it was an open bar, if it was a dry weddng thats one thing", "You're not the AH for taking it imo. But YTA for offering it to random people you don't know especially when at a wedding. \n\nIf its legal where you are, that doesn't mean everyone accepts it.\n\nYou're also the AH for arguing with the bride and groom and going to the usual argument that it's legal and alcohol is worse. Alcohol is bad, but it is societally acceptable and you are a guest at their wedding. It isn't the time and place to do your advocacy for weed use. Especially attacking alcohol when clearly they are ok with that.\n\nDid a bunch of Christians overreact? Yeah. But maybe you should have understood and taken a interest in the event and people who were getting married before just offering drugs out like sweeties.", "It's not that it's a Christian wedding, it's that they're antipot. My mom is a good Christian woman and the biggest pothead I've ever met. Gummies, vapes, homemade edibles. The whole 9 yards.", "NTA for taking them.\n\nProbably unwise for offering them to strangers. At the same time, if they’re common in your circles, you might have passed for rude by NOT offering them, a bit like cigarettes a couple of decades back.\n\nThey definitely were assholes for making a fuss about it, especially when half of them were drunk already. Bigoted assholes, the bunch of them. \n\nKids have nothing to do with it, unless you offered the gummies to *them* or left the gummies within their reach, which you didn’t.\n\nNeither does being a +1 or actually invited. You didn’t crash the wedding, were you? So…", "Matthew 15:11\n\nThey aren’t anti weed because they’re Christian.", "Pfft. I would have taken an edible AND smoked a joint before I even got there. 😜 Everyone at that wedding sounds insufferable AF and I'd need that shiz lol. But you OFFERED some to people? Bad move, bruh.\nESH.", "YTA.\n\nKeep it to yourself.", "They sell edibles in 5mg doses??? Was this that synthetic Delta 8/9 bs?", "NTA- they are legal in your state and you did nothing wrong.", "NTA, but you might want to reconsider offering to strangers in the future.", "YTA \n\nIf you wanna get high before a wedding, that’s your prerogative, but I can’t even begin to imagine what went through your head, when you not only bought it with you, but thought it was a good idea to give it out to complete strangers at a formal event.\n\nLet’s not get this twisted. That man was absolutely right. You’re not guest. You’re the plus one OF a guest. You are there to see the person whom actually got an invitation isn’t too lonely and has somebody to talk to at the event. You are there as a courtesy to your roommate. A courtesy that a large majority of that group may not offer her again. \n\nYou have some the audacity to pull this shit. You don’t know these people! How do you know that someone there isn’t a recovering addict? Then to turn around and try to defend yourself by saying “Well, it’s a well it’s legal”. Wow, just wow. The fact that neither you OR your roommate are embarrass (or more appropriately mortified) is a huge indication of your immaturity, because you both absolutely should be. \n\nYou’re both extremely tacky and self-centered. Consider yourselves lucky that the bride was “cool with it” and you weren’t both kicked out. I’m stunned that two people who are almost 30 thought this was a good idea. You both clearly still have a lot of growing up to do. I suggest you start now cause your way behind.", "NTA - for as the Good Book itself says, \n\n\"A man is not defiled by what enters his mouth, but by what comes out of it.\"  \n[Matthew 15:11](https://biblehub.com/matthew/15-11.htm)", "Bunch of dorks in this comment section.", "I'm going with NTA.  What a couple of self-important fools. There was no mal intent on your behalf and you tried to apologize. This could have easily been resolved with a civil conversation without judgment and persecution. That couple really needs to get over themselves. It almost seemed like they jumped at an opportunity to seek moral superiority over someone, and you being a plus one made an easy target. The gossiping and the snarky comments reek of high school bully energy. The comments about you not actually being invited were repulsive, and the man  being drunk was very un Christ like of him. I mean, since they brought that up anyway. I'll say maybe read the room next time but it's firm NTA from me.", "I'm gonna go with ESH. They can't claim it's a Christian wedding when people are getting hammered. Wedding party included. But you could have and absolutely should have been more discreet about the edibles.", "YTA. I like weed, we all like weed. But you were inconsiderate. And despite your attempts to pluck at our heartstrings, it's weird to offer strangers at your wedding table gummies and cringe to lecture other people why weed is chill and soooo much better than booze. Even if that's true, it's never a good look.Take the L.", "YTA, not for taking the gummy, but for doing it where people could see you and potentially causing a scene at the wedding. Next time you would be better off taking it discreetly like in the rest room. Even though they're legal there's still stigma against weed even though as you point out it's no worse than alcohol, but alcohol is more socially accepted than weed is.", "Genesis 1:29 \n\nThen God said, “I give you every seed-bearing plant on the face of the whole earth and every tree that has fruit with seed in it. They will be yours for food.", "Are you in a state where it’s legal? \n\nIf so, absolutely NTA. Especially if there was an open bar. Christians are such hypocrites.", "NTA\n\nI'm not sure why people are calling you an asshole or even ESH.  I live in a legal state.  I don't personal consume because my job prohibits it.  I have plenty of family and friends that consume cannabis.  I support Federal Legalization of Cannabis.  It is a subject that interests me greatly, not just for recreation, but for medical usage as well.  \n\nAll that said, what you did was stupid.  Offering THC to complete strangers is a no-no.  Socially we just aren't their yet, it is going to take at least another 20-30 years before we mostly erase the stigmas of \"reefer madness\", \"gateway drug\", \"lazy stoner\" etc.  I'm assuming the crowds you hang out with have the similar thoughts as you do about cannabis, and honestly that's great.  I'm glad to see more people are replacing alcohol with edibles, assuming people are consuming responsibly.  Again, what you did was stupid or even thoughtless, but in no way makes you an asshole.  Just because something is legal, doesn't mean it is accepted.", "YTA. Why did you have the need to offer to somebody else??? If you need to bring it, just keep it to yourself...", "I'm trying to remember where Jesus said no edibles. Can anyone help?\n\nNTA", "YTA.  Doesn’t matter if it’s just THC dont being drugs to peoples wedding unless you know they’re cool with it.", "NTA. It’s legal the same as booze and unless the married people stated that they didn’t want it at their wedding then the “christian” assholes are the assholes here. Just say no and go about your business. Fucking religious types can kick rocks. Lots of stones being thrown from glass houses with them.", "Alcohol is soooo much worse. And also can be way more addictive. I wouldn't have offered tho.", "YTA for making it obvious you had edibles. That's not something to do in front of strangers. You didn't know that couple and I don't care what their background was, it's not something to do in front of strangers because you have no idea their morals.", "NTA. Genesis states that he gave us all plants with good fruit to eat and all the trees to burn with. As long as you are following the laws of God and man, you are in the clear.\n \nI would beseech your family to instead of minding the splinter in your eye to mind the planks in their own, for the new testament is very clear on judging.", "Man, I hate that it is so normal for people to think it's ok to drink and get pissed all the time, but weed is the devils herb.\n\nHard judgement but I don't think yta for taking them but I would have done it pretty discreetly.", "YTA", "I’m going go with YTA\n\nMany people of acquitted a small dose of weed and alcohol. If this was a dry wedding would you have felt comfortable bringing in a flask? \n\nIf someone showed up to a dry wedding with a flask I would think it’s rather generous when they don’t get thrown out. \n\nYou should be thankful they didn’t throw you.", "Sorry, I am also a Christian and I think weed is fine in moderation. I mean as long as you weren't smoking it near the venue I wouldn't have minded. (It stinks) NTA. Also people need to stop blaming their religion for being uptight conservative assholes. Jesus turned water into wine guys, he is a FUN dude.", "I'm going to go against the grain and say NTA\n\nThe only thing I think you did wrong was not gauging the audience first. Otherwise, this is the norm I think people are going to have to adjust to. Weed is legal now in quite a few states in one form or another because the greater society has begun to acknowledge that it's really not that bad. Sorry but weed isn't like meth, and certainly isn't worse than alcohol, which was readily available at this wedding.\n\nPlus the guy who was on a drug that leads to more death and disability than the drug OP was on judging him was hilarious.", "YTA. I think you could have discreetly eaten the gummies (like go outside or in the restroom), but offering some to strangers at a formal event was in poor taste.", "NTA\n\nThere was no reason for you before hand to think this wouldn't be okay. You even apologised.\n\nTheir backwards views about a substance, which isn't based on religion because in general being drunk is as prohibited as being high, don't justify this treatment and over reaction.", "Good grief, have you not learned how to read a room? There’s a time and a place to hand out party favors, and *a wedding where you’re a **bridesmaid’s** plus one is not it!* You want to bring them along for yourself and your date? No biggie. But you do that discreetly, you don’t just announce and pass the stash.\n\nYTA", "Seriously, it isn’t totally fair / correct but it is the way it is.  YTA, but softly. \n\nThat is a low dose gummy that isn’t going to do anything except make an awkward evening more tolerable. The people drinking will get far more gone yet it is socially acceptable for that to occur. I am with you on your logic and on taking the gummy. No wrong here.  \n\nYour faux-pas comes in offering the gummies to others. Especially as a formal even such as a wedding.   Edibles / weed is NOT nearly as socially acceptable. You can’t offer to others randomly around you as you never know people perceptions and feelings toward it.  Also, a wedding where you are a 1 time presence in all these people lives is NOT the time to go into educator or activist mode. You aren’t changing hearts and minds.  You are just the ‘druggie’ who showed up and made it clear that you intended to get wrecked ( in their POV). \n\nNext time, take your dose quietly. Don’t offer to others and you’ll be fine. I am going on the assumption that you know yourself/ doses/ and won’t make a fool of yourself at a formal event at which you are a guest.", "What if this had been a dry wedding? Some random dude who was not invited brings in a flask. \n\nIt’s not appropriate to go to someone’s wedding and take unapproved substances. It’s literally 1 afternoon. If OP can’t go that long without weed he has a much bigger problem the being the asshole at this wedding.", ">It’s ok you took 5mg thc. \n\nIt really isn't. It someone elses wedding. If they don't want weed at their wedding, then that's the end of that conversation. Taking weed on a wedding where it's not okay is 100% an asshole move and makes OP YTA", "The point people try to make it he doesn't know the bridal party well. He doesn't know the other guests well. He doesn't know the vibe of the wedding. He does know they are Christian. And decided to do weed when the bridal party is not okay with it.\n\nHim being a +1 is not extremely relevant, but it does provide some context on the blundness of his actions.", "Unless THC was served behind the bar with the alcohol then you can presume it isn’t welcome.", ">NTA. The assholes were DRUNK. WTF is the difference? \n\nThe bridal party allowed one and not the other. That's the difference.\n\nIs it really so hard to respect the wishes of the bridal party for one day and not do weed that day? Are you that much of an ah that you *MUST DO WEED BECAUSE ITS THE SAME AS BEING DRUNK WTFF!!!?*   \nEven though you know the bridal party is not okay with it?", "It's not about anti-weed. It's about anti- going against the wishes of the bridal party at their wedding.", ">Not that there's anything wrong with taking them in the slightest\n\nGenerally no. Nothing wrong with it. \n\nBut is *is* wrong to take them at a wedding when the bridal party is not okay with it.", "I guess all the drunk guests were just method actors lol.", ">So, it’s perfectly acceptable for anyone there to get toilet-hugging, shit-faced drunk, but how dare you bring LEGAL gummies along to a Christian wedding?!\n\nIt's perfectally acceptable to follow the bridal party's wishes.\n\nIt's not acceptable to go against that wishes.\n\nThe entire alcohol vs weed discussion isn't relevant. OP doesn't get to decide, the bridal party does.\n\nYou can think whatever you want about the bridal party for allowing alcohol and not weed. But in the end its their decision.", "The problem wasn’t that somebody saw the bag. He offered it to the other people at his table. That was the problem, that he offered drugs to people he didn’t know at an event where he was a guest and unknown unknown to most people there so did not know if they were open to such, as they clearly were not. The reaction was overdone but fella needs to “read the room.”", "I would still lean towards ESH. The rest of the crowd is absolutely hypocritical in their attitudes towards alcohol and marijuana, that is true.\n\nBut bringing your own psychoactive stuff and offering it to random strangers just gives off 'weirdo junkie' vibes and doesn't help the cause any. If OP would come with his own bourbon flask and would offer sips to the other guests, he would get weird looks and judged for being a vino as well.", "No idea why you’re being downvoted.  Weed is not as legal as alcohol and that’s an objective fact", "The federal government wants to be the last hold out for whatever dumb reason.\n\nIt’s now legal in some form in 44 states in the US.  Also plenty of banks accept the cash.  Otherwise how would dispensaries operate.", "There’s a big difference between “doing drugs in the bathroom” and trying to hand out edibles at the table where you’re a plus one and don’t actually know the vibe.", "Being the plus one at a wedding where you barely know the bride and groom is not the right time to make this argument my guy", "Nah you can totally bring your own party favors to weddings of people you know. Just don’t bring attention to yourself.", ">The hypocrisy of people around marijuana really drives me crazy.\n\nI generally agree with you. But there is one very important detail you don't mention.\n\nIt's someone elses wedding. You can't do whatever the fuck you want on someones wedding.\n\nIf they want alcohol on their wedding but no weed. That's valid. It's their wedding, their party, they decide. As a guest, you simply have to follow those wishes. \n\nIs it hypocritical of the bridal party to allow alcohol, but not weed? Maybe, but that's a different discussion altogether.  \nIs OP an asshole for doing weed at a wedding where it's not allowed? 100% yes.", "I've drank a syrup that had a 1000mg in it and nothing lmao I am jealous of you", "But that’s not as legal as alcohol, which is legal in all 50 states, and you can buy with a credit card.\n\nCan you buy cannabis with a credit card? \n\nSo, *not* “as legal as alcohol”.", "That’s a pretty bad analogy. It’s horrible etiquette to smoke around non smokers to begin with, let alone offering them a cigarette", "…. What? Drugs are permitted/allowed unless stated otherwise?", "Not more than a bunch of drunk folks for sure.", "It's because we're still in the \"hehe I've got weed!\" phase of responsible drug use and still don't know how to handle our shit.", "> in the Netherlands it would be seen as weird to just casually do drugs at a wedding\n\nIncluding alcohol? People don't drink casually at weddings there?", "Have… have you been to weddings?", "You might have a problem then", "🤣Nah, but I have also never been to a dry wedding. We still drink in the parking lot and have flasks at weddings with alcohol.", "It's not bad etiquette to offer people who come up to you while smoking, a cigarette. Which is the analogy. \n\nYou're clearly not a smoker. \n\nAnd the analogy works fine.", "The drugs are legal. A flask would be legal.", "Okay... so, offering cannabis at a wedding when you don't know people would be okay with it isn't wise.\n\nHowever, telling someone whose taken a cannabis product that they don't get to choose to expose kids to them being on it is ridiculous. I'm on it medicinally... should I just never be anywhere kids exist without loudly declaring I'm on cannabis so people can decide if they want their kids to be kept far away from me when I'm experiencing less pain and fewer PTSD symptoms?", "Both are inappropriate acts 'in setting', in this case a 'Christian wedding'. If you don't agree with the social norms of an event you're invited to, don't show up, There is no logical fallacy here.", "That’s still crazy like you really need to drink that much?!", ">It's not bad etiquette to offer people who come up to you while smoking, a cigarette.\n\nNo one came up to OP,  he offered gummies to the people around him. This is a YTA because not everyone wants their families to know they- or their friends- use THC. Whether it's legal or not, maybe they know it's going to cause an issue, and they don't want to deal with it at their wedding.\nNo one wants your gummies. It is in very poor taste to pull out a substance and offer it to strangers.\n\nEdit: OP has only met this couple a few tomes, which makes it so much worse.", "OP couldn't go without his gummies for a wedding so decided to bring them with him. As far as we know, the couple didn't smuggle in alcohol to consume for themselves", "Legal is irrelevant. This thinking is bonkers.", "Someone taking a low dose edible in a format that they think it candy. I’m not a fan of gummy’s for the reason. I’ve seen multiple stories of kids getting into their parents supplies and thinking secret candy. You cannot stay with confidence that OP was keeping the gummy’s away from the children.", "Had OP taken cannabis on his own, not offered it to anybody or loudly declared it (in this Christian wedding, I’m not saying do that in general), he would’ve been fine. \n\nI think there’s a general “read the room” attitude applied with marijuana. There’s a lot of people that do it, that don’t openly admit it. There’s a time and a place for these kindof things.", "And how is getting drunk different from getting high when both is legal?", "Just gonna ignore the alcohol huh", "I’m guessing you’re not in Canada because over here I’ve been to weddings that have given home-grown weed in goodie bags, stag and doe prizes that have weed in them, and have literally seen a bride and groom smoke weed at their wedding with their friends and family.", "It's 100% normal to get high at a wedding. I guarantee people have been getting high (on much stronger drugs than just weed as well) at every wedding you've ever attended. Just because you don't see it, doesn't mean it ain't happening.", "But it was absolutely normal for others to partake in things that would leave them under the influence. He is simply doing the same thing via a different route. They're the ones splitting hairs.", "Alcohol is a drug. People drink alcohol at weddings. People get fucking plastered and wasted and rip their pants (looking at you uncle Adam) at weddings. It is disingenuous to say taking an edible is any worse than slamming down glass after glass of wine.", "I’ve gotten high at almost every wedding I’ve been to as an adult, lol. It’s been just as normal to get high at weddings as it is to get sh!t-faced drunk for decades, loooong before it was ever legal. Also, I have seen multiple physical fights break out between drunk people at weddings, but have never seen a fight between two high people.\n\nAnd, for all OP knows, half the people there were eating gummies and they just had the unfortunate luck to sit next to these pompous, hypocritical and “holier than thou” assholes. It’s way ruder to get drunk to the point of belligerence and making a scene like these so-called “Christians” than to quietly and discreetly consume a substance that just relaxes a person.", "Using logical fallacies doesnt make you look smart either you goose", "They’re pointing out that you made use of the logical fallacy known as false equivalence. You set up the false equivalence by stating that it’s legal to use THC in this jurisdiction and it’s also legal to scream really loud; you then went on to say that screaming really loud would be an asshole move at a wedding, therefore so too should be taking an edible and quietly offering it to a whopping two other people. This is a false equivalence because the only comparable fact here is that they’re both legal, but you don’t take any account of the fact that one (screaming loudly) is generally disrespectful and disruptive during an event such as a wedding and the other (taking a low dose edible in a jurisdiction in which it is legal) is generally not. Hope this clears up your use of the logical fallacy of false equivalence and hopefully you can go forward in life with never making use of it again to support your position.", "> in this case a 'Christian wedding'.\n\nI've only been a single wedding that wasn't christian, every other wedding I've ever been to has been a christain wedding. This has not been considered an inappropriate act in any of them. There is no christian tenant that forbids intoxiacation at wedding celebrations. It's almost as if christianity literally never mentions weed at all... go figure.", "I like drinking (and THC) and that's how it goes at social evenys with my family and friends.", "That's you putting your opinions on others \n\nAlcohol and weed are both drugs \n\nBoth legal \n\nOne just doesn't have a stigma, he wasn't flaunting it. \n\nHe offered it to the people next to him who saw him take it. Again just being polite \n\nI cannot believe how desperate you all are to paint this guy as an asshole.\nHe was just being nice.", "But how would you feel if you had eaten breakfast?", "They’re not AHs because they’re allowed to be hypocrites at their own wedding. They’re the people who dictate what drugs people can consume at the event as the hosts. Don’t like their rules, go and have drugs somewhere else.", "It’s a false metaphor, though, is what I’m saying. Bringing a flask to a dry wedding is frowned upon because the flask-bringer would have been explicitly told that the wedding was meant to be dry. \n\nI don’t think that there is a 1:1 parallel here. OP again, should have read the room better, but they live in a state where the edibles were legal. \n\nI’m just saying the metaphor doesn’t work", "Except that millions of people drink without the intent of getting drunk, especially at a wedding. No one takes recreational THC without the intent of getting buzzed.", "I don't want my kids around the blacks. This is a reasonable position because they are my kids and I get to decide who is around them. No you do not get to look deeper into if my reasoning makes sense - they're my kids.\n\n(Very heavy /s)", "I agree, though spending too much money on cannabis is the same as anything else. Cigarettes, cars, gambling, anything tangible. Hell even plenty of Christian families ruin themselves, giving too much to the ‘church’, are they addicted? \nI disagree that it’s not acceptable because it’s a ‘Christian wedding’. My questions for the Christians: why is alcohol accepted at this wedding but cannabis not, despite their bible having several different quotes against it? And overall, a thing that seems to crop up in a lot of stories including religion, how is it any of your business?", "One  is allowed by the bridal party and one is not. Thats the difference.", "It's up to the wedding party which drugs they allow at their own wedding. It's not up to OP", "The alcohol is approved by the bridal party. The weed is not. That where the difference lies and thats where OP is an asshole.", "Listen man, I get your point. But honestly, that's not what it's about. The subject is actually really simple and is not about alcohol vs. weed or the legality of weed or anything like that.\n\n&#x200B;\n\n1. The bridal party doesn't want something at their own wedding.\n2. OP chooses to that thing at the wedding in spite of those wishes.\n3. This makes OP an asshole.\n\nHe can do weed 7 days of the week, at pretty much every place he likes. But at the wedding of people who are not okay with that? No, not there.", "Just because I don't see it, and just because it's happening doesn't mean its okay.", "He's not doing the same thing via a different route. He's doing a different thing, because he feels like it. He does the thing he feel like without regard of the bridal party. \n\nIt's someone elses weddin. Behave. You can do whatever the fuck you want on your own wedding, not on other people's. \n\nBut some people either really need weed every day or are just asshole's who don't give a shit about the bridal party's wishes.", "You miss the point entirely.\n\nThe bride and groom don't want people taking weed on their wedding. That's the end of it. If you go against those wishes and do it anyway, you're TA.\n\nPompous, hypocritical, \"cristians\", call them all you like. But it's their wedding. OP choses to go and then went against their wishes. That's a dick move.", "Yeah I mean you can like it no shame but if you need to drink at even an occasion where people have specifically asked you not to drink then I don’t know I really thing you might wanna re-examine your relationship to alcohol", "Definitely a UK thing. I've been to a lot of weddings in the states. Normally just booze, but like 95% of the time there has been weed unless it's a stick up your ass/religious/kinda bigoted wedding.", "I'm talking about the couple that was sitting at the table making all the comments. They weren't the bride and groom. Read the post again.", "People drink with the sole expectation of getting at least buzzed, lol.", "Your logic seems very flawed here. Its not OPs child. \n\nIt's perfectly legal to do lots of things. It's still not ops child.\n\nIts totally legal to huff lighter gas where I'm from, definitely wouldn't want you doing that at my wedding around children. \n\nIt's totally legal to use experimental chemicals to get high. The only difference between using a synthetic molly and drinking is societal stigma. That STILL doesn't mean a thing because it's not up to OP TO DECIDE.", "What if it was a dry wedding and OP brought a flask. I’m not being rhetorical. If you think that it’s OK to bring a flash drive wedding then I see what you think he did is OK.", "We don’t have that information though.", "The bride literally told OP’s friend that she didn’t care.", "Just because YOU aren't okay with something, doesn't mean that thing isn't okay.", "Hes literally partaking in the influence of a legal substance. Which is what the hypocrite couple is doing.", "I have never been to a dry wedding but all the ones I know of didn't have alcohol to save money, not because they are opposed to alcohol.", "Still pretty unsavoury to open up drugs that clearly aren’t meant to be consumed at a wedding. If someone brought alcohol to a wedding where none is served they’d be the AH, same logic here.   \n\nHonestly even if a substance is not \"technically\" addictive it is pretty dysfunctional if one can’t go through one event without it.", "No one is arguing against this. People are just saying that the \"think of the children\" is a bad, pearl-clutching argument - especially if there are drunk people around.", "I totally fucking agree with you 100%.", ">If I were you I wouldn’t make a habit of doing things around other peoples children just because you think it’s acceptable.\n\nThe flaw in your logic is that if we go down this route, we can stretch it to virtually anything. \n\nThey don't approve of legal substances? Maybe they don't approve of hip hop music, or shots, or stereotypically girly cocktails, or dresses above the knee, or whatever the fuck. And while that's their right, they don't get to impose their views on people around them.\n\nOP was doing something legal in public. If other *guests -* that's right, guests, not the hosts - have a problem with that, that's exactly what it is. Their problem.", "That logic can fuck right off. It’s not anyone else’s job to parent your children. If you’re drinking in front of kids, you have no leg to stand on when criticizing someone for legal marijuana use. No one offered the kids a gummy. What is this pearl clutching over a 5 mg weed gummy. Get over yourself.", "I’ll back this up! I agree!", "Well we do, the bridal party was fine with a bar but kicked out OP, so they're clearly happy with one and not the other", "It's not about me. Or you. It's about the bride and groom. It's their wedding aftera all.\n\nThey were not okay with it on their wedding, that means it's not okay to do weed in that situation. Period.\n\nFor what it's worth, personally i'm okay with it. But you have to go with the wishes of the bridal party on their wedding on this one.", "Them being hypocrite or not is not what this is about. This is about a guest at a wedding going against the wishes of the bridal party.\n\nThe bridal party is allowed to have wishes on their wedding. If they don't want weed, you're just going to have to put on your big boy pants, be a good guest and don't do weed."]}