{"id": 22534, "submission_id": "152lxra", "title": "AITA for filing for child support?", "selftext": "My daughter's father and I haven't been together since shortly before she was born. We've done well at the whole coparenting thing for the most part, and even when it's been hard I've tried to always do the right thing for her.\n\nShe's ten months old and in her whole life he has paid me $430 dollars in support. He makes just under 100k which is about double what I make. He has bought formula for her. I thought where we get along well it was unnecessary to go the legal route and would only rock the boat. When I went back to work we agreed we would split the cost of daycare 50/50. So far I've paid it all. This is where the issue began. He said with the cost of living increases and such he is struggling a bit. I totally understand that is the reality for many people right now and I'm not out for him to finance my life or anything like that.\n\nBut he bought a new 'luxury' vehicle shortly after telling me this. I tried to have a discussion about the fact I need his help with daycare costs and how I think that's a very fair ask. His response was that because I don't pay a mortgage(inherited home) I don't quite understand the struggle. This of course ticked me off because I certainly can't afford to go buy a third very expensive vehicle mortgage or no mortgage.. I also am the primary caregiver, he has 24 hours a week as per his work schedule availability but I too have to work full time and still parent.\n\nUpon advice from other people I've decided it probably is best to have a legal agreement done and to file for child support. Many of my family members think I'm being too nice and in turn being taken advantage of. I feel like he knows a healthy coparenting relationship is important to me and holds that over my head a bit. He is very very upset at the prospect of having to pay court ordered support because he says they will suck him dry. Not at all what I want or how I think they figure it out. I just want him to help financially even if at this point it ruins the good 'friendship' we have.\n\nSooo am I the asshole? I'm kind of feeling like it tonight.", "created_utc": 1689648022, "permalink": "/r/AmItheAsshole/comments/152lxra/aita_for_filing_for_child_support/", "score": 612, "replies": ["NTA. It’s his kid too.  He had the chance to go the non court route and do his part and he didn’t abide. So now he gets a judge. End of story.", "NTA. He has already soiled the co-parenting relationship by not co-financing it with you. He could have avoided the legal route by voluntarily paying his share instead of making excuses. It has nothing to do with you not having a mortgage, he is just conveniently using that fact to try to justify his not paying for his kid.\n\nThis is exactly why the legal system exists. Use it.", "NTA. Child support isn’t about you (or him). It’s about, and for, the child. And, yes, you should have a legal arrangement for child support, it helps protect both parents and the child. And don’t let his whining about it draining him dry sway you. If he didn’t want to pay child support, then he should have been more careful to not have a child. \n\nDon’t worry about your friendship with him either. He’s already ruined it by trying to get out of taking care of his child. It’s more important to make sure your child is taken care of than to spare his feelings.", "YWBTA if you didn’t seek child support. That money is for your daughter. It’s selfish of you to deprive her of it without a good reason.", "NTA\n\nGo get what you are owed. He is 100% taking advantage of the situation and counting on your desire to not rock the boat.", "NTA. He is currently taking advantage of you", "NTA. Child support is there to help take care of the child and pay for her needs. It sounds like the father is chipping in and contributing when and how he sees fit - and nowhere near enough money. Your child isn’t even a year old and he is reneging on paying for child care in favour of buying a luxury vehicle. What’s next? He won’t buy her clothes because he wants a vacation? He meets a new girlfriend who wants to spend all his money? Nope. Nope. Nope. Seek legal advice and file for child support. He lost his chance at amicably sorting that out when he chose a car over daycare costs.\n\nAnd if the courts rule he owes you more than you need to pay for her? Open an account for her education funds for later. It’s all money to help you take care of her. Raising a kid costs $1,000,000 (and more!) and he should be paying half that for the next 18 years.", "NTA. Child support is just that, support for the child. It isn't about either of you. Ensure that your baby is cared for.", "NTA That's his child too and he can start taking some financial responsibility. He's made it clear he's not going to contribute unless he has to.  Be ready for your relationship as coparents to change, but the money will help provide for his and your child.", "NTA. You need to ensure that you have all the means to provide for the baby. Child support still isn’t 50/50 and never will be.", "NTA and you know where your child is on his priority list - right below the luxury vehicle.", "Are you an asshole for wanting to ensure your daughter doesn’t go without?\n\nThat’s the real question.\n\nThe answer is no, of course not. NTA", "You'd be an asshole to your kid if you didn't. NTA for setting the rules.", "NTA, you don't really have a healthy co-parenting relationship now if he isn't financially contributing.", "NTA. As a person who’s father made six figures a year and flaunted it while leaving his ex to struggle raising his kids, file for child support. The least he can do is financially contribute. \n\nHowever, be weary cause he can file for custody and they might give it to him cause he can provide better living conditions.", "NTA\n\nBy filing for child support, you are advocating for your child. This isn’t about rocking the boat or playing nice.  \n\nIf your daughter’s father is such a great co-parent, he would understand that daycare is a need, not an extravagance. $430 is no where near his 50/50 share.\n\nYou need to go through the courts so that it will be official and binding. The amount is determined by an impartial judge based on income, and he can petition the courts if his situation changes. \n\nAs a parent, you will find it is much easier to set the rules and be consistent than to try to adjust along the way. It is the same for your daughter’s father and his expectations as a parent. \n\nTen months have passed, so it may be difficult at first. It will be much easier now than when she is ten. Best wishes! ❤️", "Definitely NTA", "NTA. You have to file for child support. Daycare is insanely expensive and he has to at least do half. Try to get family court mediation so it doesn't have to become hostile.", "NTA but you need to make an adjustment in how you think of this. Your child deserves that the people who brought her into this world support her to the extent they can. Not just what you can manage on your own and little bit of formula from him. He owes HER money for food, clothes, education, medicine - everything she would have gotten if she was being raised by him. By not filing, you are interfering with her right to those resources. Instead of all of your money going to necessities, she might have activities, a vacation, a higher standard of living like the one that she could have had if she had been born into and raised in a two parent household with an income of 100+ thousand dollars. \n\nIf he is holding a respectful or non-hostile relationship over your head to keep from paying, look again because your relationship is already hostile on some level. If he is any kind of father, he should want to care for his child and not leave her to made do with less than what he could provide her.", "NTA, but only if you follow through with this asap. He’s contributed about $43/month since the birth of his child. There’s a word for that. It’s deadbeat. I understand your desire to have a friendly relationship with him for your daughter’s benefit, but at some point, overlooking these kinds of flaws will not benefit her. Children deserve to be raised in a financially stable environment where possible, which means you should be able to put some money away for emergencies and be saving for her future. That means he needs to be dedicating more than roughly 0.5% of his annual salary toward raising his daughter. To be blunt, you’re approaching asshole status toward your daughter by waiting this long to file. Again, I understand your motivation, but this is your child’s wellbeing on the line. You can’t leave that up to chance. Furthermore, we live in a society wherein mothers are expected to sacrifice way too much of themselves in order to facilitate the largess of fathers, and mostly because they’ve been conditioned from day one by patriarchal norms. At ten months, she’s obviously not aware that her father is neglecting his parental responsibility, but before you know it, she will be picking up on dynamics she can’t even quantify. She deserves to be shown a dynamic wherein her mother isn’t submitting to such antiquated ideas so her father can drive a nice car (or three nice cars). She deserves that example so that when she is grown, she doesn’t fall into the same cycle.", "Not at all, but you would be totally TA if you didn’t file for child support. My family’s income is about the same as you and your ex, and almost all of it is for my family including my kids. Duh. It’s called being a parent. You should get about 15-20k in support with his income. He should be paying all of her daycare costs if she lives with you. If he is afraid of a Court order that tells you all you need to know. Do it. For you and your child’s sake. It will be one of the best decisions you can make.", "Na he is being an ass go to court", "NTA it's not much of a friendship if the basis of it is him getting away without paying a dime. Go get him.", "NTA. Both of you made the choice to have the child. So, both of you should share the responsibility of raising the child and making sure she is cared for her. Obviously, if he does pay child support make sure it’s used for the child. I have seen multiple cases where one parent uses the child support for themselves", "NTA. I understand wanting to stay on good terms, but he is not behaving in a friendly way. He's taking advantage of you and is cheating his child by not paying his share.  It sounds like he's trying to play you here, knowing full well that he is not supporting his child like he should.  \n\nI think you should definitely get something legal set up.  He wants you to feel guilty which is a pretty crappy thing to do to you.  It says a lot about what kind of person he is.  You have nothing to feel guilty for.", "NTA. file for child support, if he doesnt pay willingly than they will garnish his check and/or tax returns. my sons dad didnt want to pay either and every year I get his entire return and I got every single stimulus check of his from years ago", "NTA he needs to realize that he no longer has HIM money. He has him AND child money. He needs to grow up.", "NTA. You're getting along well because he's happily playing you for a sucker and counting on you to not rock the boat. Go get your child support, and don't let him treat you or your daughter like doormats.", "NTA and get a wage assignment the second he doesn’t pay the required amount on time. My ex told me I would have to wait for my child support because he had to pay bills, and in the next sentence told me he wouldn’t be taking our child the next week because he was going on vacation. I filed for a wage assignment and it was granted. The money is taken directly from his paycheck now. Don’t be nice if he gives you a sob story.", "NTA, you owe it to your daughter to pursue child support. Your lack of mortgage and his new car are irrelevant here. He has responsibilities towards his child. You also need to go to court for a custody arrangement, otherwise things can get very ugly.", "Child support is not for you and isn't contingent on whether you're nice or not; it's what parents pay according to their income for the benefit of their child.\n\nIf you don't file for child support, you're depriving your child of something to which they're legally entitled and would benefit them.  (Heck, if you don't need the money for day-to-day, you could put it in a college fund.  Of have savings in case your child has an emergency.)\n\nYour ex is not living up to his financial responsibilities, and you're letting him get away with that.  Stop it!  Get yourself a lawyer right now and file for child support and anything else to which your child is entitled.  Try to get an agreement that will help pay for college or voc training after your child is 18.  Get what your child deserves.\n\nMaybe you're being nice to your ex, but you're doing it at the literal expense of your child.\n\nYTA.  File.", "NTA", "If he doesn't have money it makes you an a-hole, If he does then it doesn't. \n\nHe should be supporting your kid if he has the means too however I feel you should have picked a better individual for your child instead of throwing your cat at a deadbeat.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy daughter's father and I haven't been together since shortly before she was born. We've done well at the whole coparenting thing for the most part, and even when it's been hard I've tried to always do the right thing for her.\n\nShe's ten months old and in her whole life he has paid me $430 dollars in support. He makes just under 100k which is about double what I make. He has bought formula for her. I thought where we get along well it was unnecessary to go the legal route and would only rock the boat. When I went back to work we agreed we would split the cost of daycare 50/50. So far I've paid it all. This is where the issue began. He said with the cost of living increases and such he is struggling a bit. I totally understand that is the reality for many people right now and I'm not out for him to finance my life or anything like that.\n\nBut he bought a new 'luxury' vehicle shortly after telling me this. I tried to have a discussion about the fact I need his help with daycare costs and how I think that's a very fair ask. His response was that because I don't pay a mortgage(inherited home) I don't quite understand the struggle. This of course ticked me off because I certainly can't afford to go buy a third very expensive vehicle mortgage or no mortgage.. I also am the primary caregiver, he has 24 hours a week as per his work schedule availability.\n\nUpon advice from other people I've decided it probably is best to have a legal agreement done and to file for child support. Many of my family members think I'm being too nice and in turn being taken advantage of. I feel like he knows a healthy coparenting relationship is important to me and holds that over my head a bit. He is very very upset at the prospect of having to pay court ordered support because he says they will suck him dry. Not at all what I want or how I think they figure it out. I just want him to help financially even if at this point it ruins the good 'friendship' we have.\n\nSooo am I the asshole? I'm kind of feeling like it tonight.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta. He's taking advantage of you. My bf has paid quite a bit in support even up to after his child graduated and turned 19. Kids are expensive af and he's sliding by in life with no responsibility and isn't being held accountable for bringing a child into the world.", "NTA You know the people who don’t go to court for child support? Those who are regularly receiving it. He’s not even trying to give you regular payments.", "NTA, paying child support will not suck him dry, it will make him be a responsible father.  In court set up visitation schedule, medical costs and grandparent rights as well.  Also, that he cannot take her out of state and most of all out of the country without you signing off on it.", "NTA\n\nHe had a chance to come to an agreement outside of court and stick by it. He made many choices not to fulfill his meager financial responsibility, not even to put money aside in an account if he wants to say you didn't ask for/accept it. Your child deserves the financial support of both parents.", "Nta f him he isnt the one struggling you need the money", " Nta, If he won't pay willingly, that's what the courts are for", "ESH Never, ever go outside the law when it comes to child support. You aren't doing it for the child, you are doing it to remain in your ex's good graces. The child is a separate person from the parents and is owed the support.", "NTA just because you’re not paying a mortgage does not excuse him on his financial responsibility towards your child. If he can afford a luxury car, then he can afford child support. He ruined a good co-parenting relationship that you have when he decided to avoid paying his portion of the childcare. Not to mention you have the child majority of the time.", "Nta, your family is right, you are too nice. Get a family lawyer and make a plan with them.", "NTA.\n\nWhy even consider that you are the AH? You aren't asking for money for your own leisure. You are asking for money to support a co-parented, two parent, child. He needs to do his part of supporting the child. \n\nSuck him dry? Nah. They look at his income and then have him pay a small percentage to you. Depends on the state but the average is about 15%. He can afford it.", "NTA... your child is entitled to support from their parent. By enabling his negligence you are short changing your child.\n\nNot criticizing you, just giving you the perspective of the courts.", "NTA seems like this “friendship” is only benefiting him. Your daughter deserves better.", "NTA, he's manipulating you. With his income he should be contributing significantly. If he overspends, that's a 'him' problem. Get to Court ASAP. If you are lucky, you may get some back support. Ask for childcare assistance too. You go girl!!!", "NTA. You aren’t getting child support to make your life easier. You’re getting child support to get your child’s other parent to properly support her. $430/month and some shared expenses was never enough when he makes so much in comparison to you.", "He’s taking a vantage of you, and the most important thing right now is taking care of the baby his needs do not come before hers he’s lowballing you  doing the bare minimum. I always say you play you pay he played he has to play pay. his responsibility in obligations should be to his child and it seems like that’s not the case. Don’t feel sorry for him do what’s best for your child he hast to take on half the responsibilities. It shouldn’t just fall on you. Men think that women should take the whole responsibility, but in reality it’s half his responsibility", "Are you more concerned about your child's well being or his? Your kids need proper houseing, child care, food, clothing, medical care and so on. The dad doest need to live the high life while his kid suffers. Stop thinking about him so much and worry about what your child needs. Goto court and get child support.", "He can file for custody anytime, whether or not she files for child support. If she has evidence of his previous lack of effort at child support, that would weigh against him getting custody, I'd think?", "Did you mean NTA? OP asked if they were the AH for seeking child support through the courts.", "Under no circumstances is she an asshole for expecting the child’s father to pay for his share of the child’s needs. If he doesn’t have money, he needs to get his shit together and find a way to make some.", "Gtfoh.  If he couldn't afford a child, he shouldn't be spreading his seed.  They both made this decision so piss off with this \"you shoulda done better\" crap.\n\nHe should do better.", "No. Even if he was broke as shit and starving, he should be giving his child money. In no way would a parent be an asshole for expecting child support. Ever.", "Thank you for pointing this out!  I just edited to fix it.  I gave the wrong initials.", "NTA, he has a legal and moral responsibility to provide for his child, court ordered support is fair as it’s taken on his wages.", "NTA but he will likely bring up that you didn't mention anything about child support until you saw him get a new car. Also if he pays child support please be prepared for him to be in the child life way less or not at all. Than gotta take in the fact if he and his boss have a cool enough relationship and he discuss the situation with his boss he could probably talk his boss into pay him under the table and he could easy just say he got fired or quit that job so he has no source of income which could end up with the courts just asking him to pay a couple of hundred dollars a month", "> I feel like he knows a healthy coparenting relationship is important to me and holds that over my head a bit\n\nNTA. You don't have a healthy co-parenting relationship when one parent is shirking his financial responsibility to the child. You don't have a healthy co-parenting relationship when one parent doesn't keep agreements, for example paying for half of childcare costs. Regardless of your inheritance, raising a child is expensive and both parents should chip in. If your ex isn't mature enough to uphold his responsibility then take him to court and let the state enforce it. He needs to step up and contribute to his child's upbringing. Your family is right: you've been way too nice. Stop letting him manipulate you and let the courts deal with him.", "Z", "NTA Honestly you would be a huge A to your child if you didn’t get this sorted out", "Best practices is a court order. Even if he was generous as heck, it's still good to have this locked down.\n\nFor instance, from what I can tell, at least in some US jurisdictions, a child support order also covers you in the event he falls under a bus. His estate would have to pay it out, regardless of what other inheritance arrangements he may have made.\n\nYou really want all that kind of thing very clear. This is your child, to the best of your ability you should want their future assured. The law is there to cover exactly these kinds of eventualities.", "To add on to this, OP:  Accept the full court ordered amount and get it automatically deducted from his paychecks.  Don't try to be nice and accept a lower amount because you feel guilty.  You are entitled to every penny that the court orders and if you feel the amount is too much, then put any excess into your daughter's college/house fund. NTA", "Yes, this. He says they will suck him dry, that means he knows he has been severely underpaying. Also, OP is not doing this for herself. This is for the child and it needs to be done. This is the money the daughter owed. OP you are NTA and if you bend this time, he will have you on the 'good coparenting' leash and keep pressing until it will be completely irreparable anyway. He also isn't being a good coparent already. What kind of father cheaps out on providing for their child? He is not being a good father, the least you could get from him is the money your child is owed.", "Nta…. To achieve a healthy Co parenting relationship you need to remove the stress of money so you let the courts decide what he should pay to supporting your child and then you can focus on your child’s relationship with their father …. Also go for back child support", "NTA. If co-parenting is only civil when he gets what he wants, it's not healthy", "NTA. I hope you didn't give the kid his name. He sounds like a deadbeat who doesn't deserve it.", "NTA. You have tried the non court way. But he has failed to keep to his end of the deal. So far he's barely paid for anything. \n\nTime for him to step up. So court it is...\n\nGood luck. This is about your child, not you.", "INFO\n\nDid he want to become a father ?", "NTA", "Does he think the cost of living has only increased for him?", "So you're not okay with him being 'sucked dry', but you're okay with yourself being sucked dry X2, as you will be paying whatever he isn't?", "NTA\n\nBut you are overthinking this. You are worried about his struggles and the peace between you. But the only thing you should be worried about is your kid. Child support is for the kid, period. And its your responsibility to get your kid what your kid owns - its NOT your responsibility to worry if the dad can buy yet another luxury car in a few months. Stop making the dads luxury struggles your priority bc you don't want to rock the boat and start priorising your kid. If he is unhappy about it send him a spreadsheet with everything you pay for and his contribution so far and tell him if he would take his responsibilities towards his child serious, court actions wouldn't had been necessary. Therefore this was his own choice.", "nta", "You would be if you didn't ask for the child support. You are both parents, he must help. If times are tough and he struggles, let a judge look into it and decide. \n\nNTA", "NTA  \nAlso you aren't being \"nice\". You are shorting your child. Your priority should be the well-being and security of your child over that of the ex-partner.   \n\n\n Even if you could pay for 100% of the costs, the other parent should contribute. If you don't need the funds for the immediate care of the child, put this towards an education fund.", "NTA please take him to court and watch him get his ass handed to him on a plate. Thankfully your child has you, that's one lucky kid 😀", "NTA.  He did 50% of the baby making here and he can damn well pay the court ordered support, because without that court order you're not going to see any more than you already do.  Why is it that so many non-resident parents think they can get away with not paying anything for the maintenance of their child.", "ESH YTA", "NTA. Take it from someone who fell for the sob stories for too long. Just be done with it. Get it in black and white paperwork. There's zero need to argue it beyond that. He's not struggling with his bills. He's struggling with not wanting to part with HIS fair share of support. (And from someone who hasn't handled another part just to avoid the drama... stay on top of filing the increase paperwork when it comes due. Don't make excuses for someone who doesn't care about your financial situation in the slightest.)", "NTA, and if you're in Australia not having child support impacts how much FTB you can get.", "I hate parents who don't go through the courts. Yes as a child in this situation I hated the whole back and forth and constant shrink appointments (the reason I don't trust them now) and court appearances but as an adult I have seen a mate have issues of spending more than what he would in child support and having time with his child held from him by the mother.\n\nYou can still co parent well with a court order, all the order does is set the rules and guidelines for the parents to follow and what they can expect from eachother, much like any board game. When we agree to play the game \"Parenthood\" we all know the rules, when we decided to separate the courts provide the \"house rules\" as an addendum to the normal rules.", "Bold of you to think that his motorcycle or his fishing boat isn't actually the next thing after the car...", "Yeah cause when it comes to a man,  his well-being doesn't matter? Give your head a shake.", "Lol he makes 100k and bought a brand new car that man is not struggling, he just doesn't want to pay for a child he created. And yes when he has a child the child's well being matters more than him finding it unfair that he as to pay for the child.", "Nta it his child.to and he has to pay for his responsibility first not fancy cars go to court", "NTA. He can completely afford it he just doesn’t want to pay you.", "NTA. His kid and he's refusing to pay and gaslighting the hell out of you. Make 100k and so is struggling. 100k isn't what it was 20 years ago sure, but it's more than enough to live comfortably if you're not just wasting all your money.\n\nIf you're making 100k and are living in an ultra luxury 5k a month apartment that's you being stupid, downgrade to something sensible and wow, you have more money. A kid trumps a new car, it trumps having a nicer apartment, it trumps an overly large mortgage on an oversized house. Spend less, pay for your damn kid. If you didn't want a court order, be fair, if the court order ends up giving you more than you ever asked for, that's his fault.", "YWNTA. He helped make the child, he bears responsibility. Also, this idea that the only way you can have a healthy co-parenting relationship is without legal involvement is ridiculous. A legal agreement protects both parents and especially the child. And if you are both engaging in the process, as long as you are in agreement and not fighting, the courts will usually go with any arrangement you set up rather than imposing one.", "NTA.  Your jurisdiction should have some soulless form to fill out that will spit out a number of what he should be paying you. Imo it's not worth arguing for more than that. For taking on primary custody you'll get a higher share until 50/50 custody but you'll need to decide how to share expenses. We decided on proportional to income so I pay 30% to his 70% regardless of who has custody for regular care and activities but for optional stuff like day camp on a national holiday when schools close is 100% up to the custodial parent since you could choose to take the day off instead.", "NTA. The court order would be based on his income, if he thinks it would \"suck him dry\" then he's probably not making fair contribution to his child's costs at the moment.", "NTA. He needs to step up. File for support now", "NTA. He will soon learn what an idiot he is. Half of daycare is cheap compared to what he really owes. \n\nWhen it comes to these issues, it’s all about what’s best for the child. It is very much in the best interests of your kid that his income help pay for her daycare and other expenses rather than is luxury car.", "He clearly doesn't want to pay and has got away with it this far by making you feel grateful for him being so supportive when what he's actually being doing is being a parent which is expected.\n\nAre you not being \"sucked dry\" on your lower income while he lives it up with his luxury cars. He may get annoyed and angry because he knows he can't get around a court order but once he realises it's not going away he will back down if he wants a relationship with his child and is the good parent he claims.\n\nGood luck 🤞", "No you’re not. He’s a deadbeat. NTA", "NTA. Please file immediately. It will only get worse from here and he already owes you money.", "Wha?? No no no no no NO NO NO NO NTA! Never let the bastards make you feel like this OP this is how they win. He gets to treat himself to nice cars while you struggle to bring up the child he helped create, and then makes you feel guilty, that's a form of abuse and gaslighting right there, don't let him do it. Get out there and claim your rights, I'll be in the back here cheering you on", "NTA. You dont have to let the courts decide, you can go in making a statement of what you would like hime to pay. I.e 50% of day care health insurance and future school fees as and when they are needed. Go i with a figure out what this is. For argument sake $600. The court order will just enforce him to legally make the payment. If you let the courts decide you will get more but this will only piss him off and ruin the relationship that already sounds like it is starting to fray", "NTA. You had an agreement that you would share financial responsibility, and he failed to meet his end of the bargain. If he ends up resenting you or letting this affect his relationship with the baby, that's on him, not on you. Child support is in the best interests of your daughter's financial future,  as her parent you have to put her needs and interests above that of your ex. You can still have a good relationship with him on a personal level and leave the financial arrangements up to the court - that may actually help you to keep the financial issues separate to your relationship, so you don't have to keep asking him for money directly but instead let the court sort it all out.", "NTA. You tried. He bought a luxury car instead of paying for day care, as he SAID he would. Then tried to gaslight you into thinking that you, who make roughly HALF of his salary, has more financial security than he does.", "NTA supporting your child financially is not optional for you, and it shouldn’t be for him either. Don’t even argue with him about it. Get a lawyer and let the court decide what’s fair.", "Screw that noise, he should’ve been paying.  If your ex can afford to pay support they should, and a custody agreement and support agreement enforced by the court is the proper way to go.  NTA.", "NTA. In my state child support is figured my a formula based on parenting time and both parents' income. Unless there's a huge shift, like a new job or something, it stays the same after it's set. Also what my ex is supposed to pay doesn't even cover half my youngest tuition for preschool (and he pays for 2 kids) By no means will it bleed him dry. Go for the child support and get a detailed parenting plan in place (something that can grow with the child, nor just something that works for now)", "NTA. Child support is an obligation to the child. You're never TA for filing, only for not filing.\n\nETA it's important to have a custody ruling too. Have it spelled out who's the custodial parent, what visitation looks like, who makes medical, legal, travel decisions-'no out of state/out of country travel without your agreement.", "NTA - file child support! I hate that women struggle with this decision because men who don’t support their children don’t struggle with the choice to refuse to support their children.\n\n… if you do not file for child support then, YWBTA", "NTA, but you would be an asshole to your baby if you didn’t do this. Your baby deserves financial support from her father. If the court orders him to pay more money than you currently need for her expenses, you can set it aside for future expenses or add it to her college fund. But, infant care and daycare expenses in particular are pretty pricey and court ordered support usually actually falls short of the child’s needs. You NEED to do this.", "NTA. Get court ordered child support and hold him to it. If he can afford a luxury car then he can afford to be a parent.", "NTA. Honestly I didn’t even read your whole post. You do not have to justify holding her father accountable financially. for her well-being. Full stop. In a perfect world both parents would acknowledge this and nobody would have to use the court system to make it so. \nWe are not in a perfect world and this is why the legal child support system exists. File. Don’t feel guilty.", "NTA and remember this is for the benefit of the child you are BOTH responsible for. You are doing nothing wrong no matter how much he wants to pout about it and your family is right: you've been too nice and he's taken advantage of that.", "NTA. He can actually lower support by taking on more responsibility for his kid. Because he's never had to take care of a kid, not even his own, he doesn't understand the struggle. You can't wait your whole life for him to empathize with you when he's shown no sign to be willing to.", "NTA\n\nHe is taking advantage of you. Go to court.", "NTA he could have avoided this and this whole situation is his doing. You are doing the right thing.", "NTA he had the chance to financially care for his child without the courts being involved and he found every excuse under the sun to not pay.\n\nHis wants are no longer the priority. Put him on child support and under no circumstance should you take him off.", "NTA\nAnd he is a manipulating bastard. He doesn’t want to coparent, he doesn’t care about your baby. He cares that you dont nag him and his lavish lifestyle if he’s buying luxury cars.\nTHE COST OF LIVING AFFECTS YOU TOO. And your daughter. \nIf he didn’t wanted court ordered child support then he should’ve payed for it voluntarily.\nHe is not going to do this. He says it will ‘suck him dry’ hey honey, you are sucked dry right now without support.\nHonestly forget the thought of friendship or friendly coparenting, he clearly doesn’t care about you at all, he’s giving you just enough to keep you content This will not change and this is classic manipulative partner behavior, giving you the minimum to keep you interested or calm and you keep convincing yourself is enough so you dont bother him again. \nHe’s acting like the biggest AH here like its such an inconvenience to have to pay child support.\n\nDO THIS FOR YOUR DAUGHTER. Its about her, not about him, you need to fight for what he owes HER.", "NTA. Child support is not for you. It is for your kid, to give her a better life. It doesn't matter if you need it or not at the time. You can always save it for college, emergencies or something else. If the kid has two parents, both should be contributing to their expenses.", "Stop \"being nice\" to him!! This is not about your money or his - this is about your kid! \n\nIf you do not do the responsible thing and in turn hold him responsible by establishing this support, I would say E S H, but I am gicing you the benefit of doubt and saying NTA for now.\n\nWhatever the court decides - TAKE IT! If it is more than you need, put it in a savings account for when kiddo is old enough to need it. If he attempts to get you to pay him back some of it \"because his life is so tough\", ignore him and remind him that this kid is his too. And remind yourself that he is not making choices to reflect a desperate situation on his part.", "NTA. He is responsible for half of your child's costs. Your financial position shouldn't come into it, especially your home.", "NTA\nYou each have a duty and responsibility to support your child. Child support isn't \"helping you\" or \"paying your rent\" or any of those canards. It is financial support for the child. Your baby has the right to it. Going to court is you advocating for your child. Child support will never cover all the costs. It won't cover providing a safe and stable home, appropriate supervision and support of the child while away from the parent's care, and the many other needs for safely parenting the child. You have no obligation to account to him about how you use child support money, nor to keep it separate from regular household expenses and only used for \"the child and not the mom\" expenses. \n\nYour life as a single independent adult, responsible only for yourself, is over. You are a parent. Your choices and obligations will be influenced by your duties to your child now. You might have been happy in an efficiency apt. You need a home with bedrooms now. You might have been happy with employment with long or odd hours. Your primary duty is to your child now. That imposes limits on your options that weren't there before.\n\nThis guy seems to think his life hasn't changed very much, and \"chipping in\" without impacting his lifestyle is perfectly fine. His obligation is far more than sending a little money after he's covered his own selfish lifestyle.\n\nYou need consistency and financial stability. Your child has the right to support from both parents. He is trying to keep himself first, and \"helping you out\" as flexible and optional.\n\nGo to court. Defend your baby's right to regular consistent child support payments.", "My ex-wife and I divorced when our daughter was 2 years old. As the father of that little girl, I recognized that I had a duty to provide support for her, and I personally think that men who fight against paying child support are assholes. You are, legally, entitled to support for your child from her father, and you are absolutely NTA for filing for that support with the courts.", "Courts don’t give custody based on socio-economic factors, the use the best interest of the child standard. He hasn’t been in contact with his kid at all, at best he’ll get a few hours of visitation a week.", "And if he’s only friendly to you when he’s not paying child support, then he’s not really your friend at all. Trust me, he is laughing all the way to the bank because he has a golden situation right now. He gets to have all his toys and his lifestyle, while you struggle to raise the child and spend every dime you make on just making ends meet. He gets to be a single bachelor and a fun dad when he feels like it. That’s not a good coparenting relationship", "At this point even if she did use it for herself it would take him quite a while to pay back his share of what she’s had to pay on her own to raise their child.", "Does it matter?", "If you feel like you don’t need the full amount, use what you need and put any leftover into a savings account for your child. When the support stops at 18 you can give it to her for college, or a down payment of some kind. It’s your child’s money, it’s not fair to deprive her of that due to her fathers greed or your pride. Plus, it would be beneficial to have a rainy day fund if times get tough for either of you.", "Yep!", "No, because when it comes to a *parent* (which is what he is) his well-being matters less than *his* child's *needs*. Him being a man is not the issue.", "NTA and you DO NOT HAVE A HEALTHY COPARENT RELATIONSHIP. He's holding something that doesn't exist over your head. (As in doesn't exist for you at this time. Healthy coparent relationships do exist in the world in general.) \n\nWhat you have is a coparent who thinks that his wants are more important than your daughter's needs. If he won't step up morally, legally is your only avenue.", "NTA. He was there when your baby was conceived, so she’s his responsibility just as much as yours. If he wasn’t ready to step up to parenting costs and responsibilities he should’ve been more proactive.", "NTA- if he can afford payments on a third vehicle but not childcare, it's because he never bothered to try and add childcare to his budget. Because you are the primary, you have no option but to figure out how to pay childcare along with all of your other bills and he knows that. \n\nTake him for child support. They only garnish a percentage of his wages and even take into account how much he earns and what his monthly expenses are so that he's not left broke. They also take into account how much he's already paid you when calculating back-child support.\n\nHe's under the impression that, being the primary, you *have to* pay for these things, so he doesn't need to because it's already taken care of.", "In my state if you have 1 child, the non custodial parent pays approximately 20% of their gross income. At 100k you're looking at over $1500 a month he should be paying. That's money to help with expenses in raising the child.", "NTA\nIf the judge feels that his paying child support would be unfair the judge will decide accordingly \n\nI am going out on a limb and thinking the judge will not rule that way", "> I feel like he knows a healthy coparenting relationship is important to me and holds that over my head a bit.\n\nThis is in itself is not healthy coparenting. He knows he should being doing more to support his child and is using your preference for peace as a tool to keep you from fighting for your daughter and yourself. \n\nHe hasn't followed through on his promises of support, going through the court will bind him to that\n\nNTA, but stop being naive about your ex", "NTA. He told you he doesn’t plan on actually supporting his daughter, because she’ll “suck him dry”. He’s already gone back on the basic promise of daycare. Without a court order and the teeth behind it you will be chasing him down for money until you finally give up and take him to court anyway, so there’s no point in waiting. Let the courts be the bad guys “sucking him dry” and take that resentment off your baby’s shoulders.", "I have been through this. It was disguised as « we get along too well » but in fact it disrespected me. When I mentioned child support for the 65th time he replied « what do you mean child support? »\n\nI wrote him an email saying I give him by x deadline (two months out) to start paying before I go the legal route. From then on, I just shrugged whenever he brought some excuses up\n\nIt took me like half an hour to put all the papers together and since then, I’ve been getting all the child support like clockwork. It’s taken out of his salary. It even adjusts automatically to the child’s age", "NTA- if he isn't doing right by the kid without involving the court, then it's time. He helped make the kid, he helps support the kid.", "Don’t be nice. You deserve to have the parent pay half of costs. It’s his kid too.", "Go to court. Get back pay. He’s steam rolling over you. What a joke", "NTA if he can’t continue healthy coparenting with a set child support order it says a lot about his character. OP is basically doing everything sad only vists 24 hours a week but pays virtually nothing while having plenty of luxuries. The cost of daycare itself is absolutely insane then there’s the cost of a child’s daily needs. OP you are absolutely being taken advantage of", "It's your Childs money, you should go legal for her sake.", "NTA. It's your child's money. She's entitled to that support, even if you just put it into an account for her.", "Have you ever watched Judge Judy? Try to search the cases where a father says \"but I pay diapers\". And watch how Judy handles them. I can't do it any better.\n\nHe has to pay child support, period. He had fun making the child, now he can have fun supporting the child. If that jeopardizes his relationship with his daughter, then he was never a good dad to begin with.\n\nNTA", "NTA. Child support is the right of the child,  your child deserves it and her father is responsible for it.", "\"AITA for providing for my child\" - NTA\n\nThat is what you are asking. He clearly has no intention of keeping up his end of the responsibility. You gave him more than enough chances to do his duty, he didn't.\n\nThe courts aren't going to \"suck him dry\", they're going to make him pay his fair share of childcare based on your incomes and custody times.", "NTA because at some point he will just stop doing anything for you and will have a plethora of excuses as to why he can't give you money spend time or do anything for his daughter. and dont let him get a new SO then it'll be he can't support his lifestyle and support his daughter. go to court and get what you deserve for your daughter otherwise you'll be sacrificing your whole life and he'll get to be the fun parent and make you look bad", "Your family is right. You will fully BTA if you let this slide.", "NTA. The only people who complain about child support are people who want to shirk responsibility.", "NTA. As the primary caregiver, you're likely to have a lower overall earning capacity, less chance of a promotion, less employment flexibility, less saved for retirement, more weekly expenses (even if you're mortgage free, you still need to save for repairs), and all this before considering all school and extra curricular expenses. Her quality of life will be heavily affected by not receiving child support. Also, without it, he gets to play \"rich dad\" while you play \"getting by- mom.\" You owe it to your daughter but also to yourself.", "NTA.  A child is a shared responsibility.  If he isn't helping on his own, there exists a process to remedy that.", "Stop thinking of child support in terms of you and your feelings. I mean that in the nicest way.\n\nChild support is the right of your CHILD. It’s what is in her best interest.\n\nSounds like your ex needs a reality check. They don’t care that your house is paid off. In fact, he most likely will end up paying more for daycare than you will. Where I am, extraordinary expenses are split based on income, not just 50/50.\n\nPlease go get a legal child support order. It has nothing to do with you being greedy or demanding. It has to do with making sure your daughter has what she deserves. Your ex isn’t doing you a favour, don’t let him act like he is.", "NTA, and I say this as a step-mother whose husband had 15 years of child support for 4 kids with an ex who did NOT want to co-parent.  And support and parenting time are two different things, really.  Parenting time only figures in to the cs rate to establish where the burden of care is.  \n\nI was relieved we didn't have to worry about it, in all honesty.  The court figured out the numbers and set the support rate.  They withdrew it automatically from his checks.  And, if there were any issues, we could tell her to take it up with the support office.  It took one thing she wanted to fight about off the table.  \n\nI'd recommend every split couple go the legal route for support because then there really is nothing to argue about.  And, with 1 kid, they are not going to \"suck him dry.\"  It's time for him to grow up and support his child.", "NTA at all. When I asked my dad to pay for half of my university fee, he said it was a big sum and he would have to pay with his savings, when he had just paid for his second wedding, his 50th birthday and had bought a new house in a very expensive area. Meanwhile, I was a student, I didn't have a lot of money to live each month. He never made me or my sibling a priority in his life, and we always had to make him take his responsibilities towards us and pay.", "NTA. You're NEVER TA for filing for child support. It's not for you, it's for your child, and she is legally entitled to it. Advocate for your kid. Go to court and protect her rights.", "NTA. He is avoiding his responsibility to provide for his child, and he has only made excuses. He said inflation was hitting him, yet he went and bought a luxury car? That's BS.", "He is 100% taking advantage. NTA", "Don’t be fooled by his bs stories. You should 100% go to court and get a legal enforceable child support order. It’s for the well being of your child and yourself. He is trying to guilt you on the one hand and not pay a fair share on the other hand. As you can see the “ friendship “ is based on him not paying his fair share.", "If he had kept up his end of the deal, you wouldn't be forced to take this to court. This is all his own doing. As of right now, he is indeed taking advantage of you. If he cares that much about it being off the books, he wouldn't be trying to convince you that his mortgage costs less than rent(lol, very much not likely) or that he can afford to buy a nice new car with nice new insurance but not afford to pay for HALF of his kids expenses. He had his chance to keep everything tidy without utilizing the law and he decided that wasn't worth it. The KID deserves to be taken care of and if he wont step up willingly, he can be forced to step up by the courts. NTA", "NTA! And go thru the courts. If he is being dodgy now then he will NEVER pay voluntarily!", "He's gonna pay about double what he was paying you. His cheap ass cost him way more.", "My mom had a similar issue with my dad, and it only got worse. First he missed a couple, then he'd miss a few and pay it all back at once, until finally even trying to get one payment out of him was awful for my mom. She finally took him to court and they took almost double what they agreed upon, and he didn't get the \"option\" to not pay anymore. \n\nNTA, take him to court and let them \"suck him dry\", if he didn't want that he wouldn't have FAFO", ">Many of my family members think I'm being too nice and in turn being taken advantage of.\n\nThey are right. NTA.\n\nHe doesn't even coparent at this point.", "He is unwilling to commit to his responsibilities as a father. Makes up all kinds of excuses and manipulates you into acquiescence. NTA. Absolutely file for child support.\n\nHim buying a car reminds me of this guy who, for years, paid for the drinks - and perhaps even meals - of this one friend when they and their mates would go out, because this dude was always strapped for cash. Until the guy funding him was told by this 'poor' bloke that he actually bought his new girlfriend a super expensive - yes, diamond - engagement ring and booked the two of them a luxury vacation to ~~Egypt~~ Thailand.\n\nSo, if the child's father claims he cannot pay you right now, he's bullshitting you.", "NTA, you tried to do it out of court but he's not playing ball. \n\nChild support is for your child and they will need it, it's not being greedy, it's being a parent and looking out for your kid", "NTA. You need to do this for your child.", "He is taking advantage of you.\n\nNTA", "NTA You need financial help. He doesn't seem to get that. He's getting all of the advantages and none of the responsibility. He is taking advantage of you.", "Not only moving forward but back child support also. Judges don’t take kindly to people who make decent money shirking their responsibilities. The court order will make the payroll deductions happen regardless, and then you’ll find out for real if he’s actually interested in coparenting or was just taking you for a ride.", "NTA\n\nI recently got divorced. I pay child support *plus* most of the daycare. I'm paying about $2200/month for my two kids, plus whatever I have to spend on them during the 50% that I have them. I'm earning a bit less than your ex.\n\nPaying for *one* child isn't going to \"suck him dry,\" even if he's paying the full daycare cost plus child support. *You* are getting sucked dry.\n\nThat is his child and he should be paying you child support *and* 50% of daycare. (That's at least what the Utah child-support calculation expects)\n\nIf he's unwilling to pay his measly portion, then he's not a good father and it's probably not worth trying for a healthy co-parenting relationship.", "NTA. it’s heartbreaking you even need to ask.", "I’m a lawyer who represents children in Family Court (NY, USA). That money is not yours. It’s the child’s. The child is dependent upon you to file the necessary support petition to get the support for HER upbringing. She needs diapers, child care, food, health insurance if you’re in the US, uninsured medical costs, then extracurricular activities, clothes, shoes, a roof over her head, more school costs, etc. His obligation is to pay 17.5% of his income (US) unless there is some reason to deviate from the child support standards act. Do the right thing for your daughter.", "Even now it doesn't have to go to court. but a legal agreement is clearly required", "NTA. He’s contributed about $43/month since the birth of his child. There’s a word for that. It’s deadbeat.", "I agree completely, and i must say your username is epic!", "This. What would happen if, goodness forbid, something happened to him? OP, you need a legal court order.", "It’s all money to help you take care of her. Raising a kid costs $1,000,000", "I agree. Always get the court order. Without one the other party has too much control. Start seeing someone else?  He can not pay. He doesn’t get his way?! Not pay. Don’t give him the financial power.", "[removed]", "[removed]", "He is 100% taking advantage. NTA", "This absolutely make sure it’s setup automatically he already thinks he can manipulate to not pay it’s better to put it all in the hands of the courts. And when he complains about the amount keep in mind court sets the amount based on what’s realistic for his income.", "Yup child support is a math problem. There's no reason to be nice.", "#10/10", "Put any excess into an education fund for the kid.", "Put any excess into an education fund for the kid.", "Bot, partial comment stolen from u/2ndof5gs", "Yep! If paying his share ruins the coparenting relationship, then it was never a good co-parenting relationship to begin with.", "It still says Y T A, your edit didn’t stick", "Not as much as the child he created. The same goes for a woman. No matter how much you have, your child is entitled to a portion of it. End of story. Anyone who doesn’t agree with or understand that can find a way to not have a child in the first place. \n\n\nThis has nothing to do with gender, it’s moral and legal for men and women."]}