{"id": 2255, "submission_id": "yufksc", "title": "AITAH for telling my wife to fuck off and walking away", "selftext": "So whenever it gets cold ouy my wife CRANKS the heat...I don't mean turns it up a little, there will be a slight chill in the house and she cranks it up to 80. Then forgets about it until the house is swelterng. I constantly tell her there's no reason to turn it up more than a couple degrees at a time.\n\nShe tried reasoning to me that \"she's trying to warm the house up faster\". I explained that's not how that works....doesn't mater if move it from 68 to 70, or from 68 to 80 the house is going to warm up at the same speed. She keeps arguing that no, that's not right the more you turn it up the faster the house heats up.\n\nAt this point I start explaining how a boiler works and she responds with \"I don't need you to mansplain things to me\". I about lost it, just because I'm explaining something doesn't mean I'm  'mansplaining' espcially when she cleary doesn't understand how it work. I stood there for a solid 15 seconds not sure how to respond. I was just so pissed I ended up saying \"You know what, go fuck yourself\" and walked away.", "created_utc": 1668376272, "permalink": "/r/AmItheAsshole/comments/yufksc/aitah_for_telling_my_wife_to_fuck_off_and_walking/", "score": 1577, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Telling my wife to fuck off because that is generally frowend upon.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I just want to leave this here: https://www.reddit.com/r/mildlyinfuriating/comments/wjcrth/my_father_set_a_password_to_the_fucking_thermostat/", "I'm going NTA. Her trying to hide behind a buzzword like mansplain when she's just WRONG is lame. \"Go fuck yourself\" is a bit harsh but she's being pretty shitty so here we are.", "Well, while I certainly understand your frustration and know the satisfaction you derived from your action, sadly, in the end, you are the one who will ultimately be fucking yourself...", "NTA.\n\nI'm a woman. OP's wife is wrong – completely, totally, and in every imaginable way – about how their HVAC system works. Mansplaining occurs when a man who *doesn't* know what he's talking about \"explains\" it to a woman who *does*, which is the opposite of this situation, so it simply cannot be mansplaining.", "ESH. Her for accusing you of something you weren't doing and you for how you reacted.", "ESH like I get hating a hot house, I really do. I’d rather be chilly and put on another layer than have a hot house. But there’s no reason or excuse to speak to your partner or spouse that way, especially for something so stupid. Just turn the heat down when she isn’t looking. If her argument is it’s to get the chill out she won’t have a reason to object once it’s (too) warm. And she’s the AH for not knowing how heating works and not caring about the comfort (expensive) of everyone in the house.", "It's going to be an NTA from me.\n\nThe communication breakdown began and ended with your wife digging her heels in like a child and accusing you, wrongly, of mansplaining a subject when she was clearly ignorant about it. You telling her to go fuck herself was just the consequence of her shutting communication down, because there was zero point in talking to someone that ignorant. Sometimes, people don't have the spoons to deal with people who choose to behave that foolishly.", "ESH, you both need to learn to communicate better", "ESH. A programmable thermostat is cheap. You shouldn’t be having stupid arguments about the house temperature. \n\nSomething tells me this is just a proxy for a huge communication problem. Good luck.", "You were technically correct but man, did you handle that wrong.", "ESH", "I know I am going to get downvoted here. And I am going out on a limb but this had really nothing to do with you explaining how the heat works to your wife. I think you explain it right. But I think it is how you explained it and and how you explain things all the time.", "I think she might have a point 😅\n\nhttps://youtu.be/P4_6e5IaQXM\n(Peep Show - Jez tricks the boiler)", "NTA my husband explained this to me more than once before I finally got it!", "YTA\n\nYour wife is being annoying, but that just doesn’t justify being so aggressive toward her.", "NTA. She was being obtuse.", "ESH", "This is a normal domestic squabble.   If you tell her to go fuck herself whenever you fight you won't be married long.  Yta.", "ESH, wow you majorly overreacted. Your wife is TA because she's objectively wrong, it absolutely will not heat the house up faster but it can make your system break down faster to change it more than a few degrees at a time because it's overworking. This is coming from a woman who's always cold. Get an electric blanket and thank me later.", "YTA. This is definitely not the right response", "YTA what a massive overreaction. This has been an ongoing issue for… how many years? And you two haven’t found a better way to deal with the thermostat? Like get an app to deal with that, good night.", "YTA not for “mansplaining” but for your reaction. Your wife doesn’t understand it, but I’m sure there was a much better way for you to explain. Or maybe don’t explain it and let her continue to set it to 80. And then you can follow behind her a couple minutes later and set it down to 68 or 70. I bet she won’t even notice and you’ll both be happy. You just need to find a compromise and find this as just a quirk that your wife has.", "YTA. Scary husband", "ESH - your wife doesn't listen and you said unpleasant things to her. \n\nSit down calmly with her and explain clearly how this bothers you. Failing that, open all the windows!", "Seriously? You are obviously a giant AH.", "Gendered terms? Really? That's your issue with this? Please, run along, I'm sure there must be some other post in greater need of your condescension.", "I mean... do you really think we, the strangers of the internet, are going to say that of course you are a skilled commincator who need change nothing and that your wife is the one who's an ah?\n\nI mean I don't want it to be 80 degrees in my house, but this is not it, my guy. YTA", "Sounds like the couch for you. You can explain things without it being mansplaining though. I would just pick better words next time because ultimately you will be the one paying for it. NTA", "Is your wife my ex-husband?\nSoft YTA. Don’t tell your wife to go fuck herself, that’s beyond rude.\nBut also, you are right, that’s not how houses warm up, and it’s super wasteful and ridiculous. Thus, you also get my vote for “that’s not mansplaining”", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo whenever it gets cold ouy my wife CRANKS the heat...I don't mean turns it up a little, there will be a slight chill in the house and she cranks it up to 80. Then forgets about it until the house is swelterng. I constantly tell her there's no reason to turn it up more than a couple degrees at a time.\n\nShe tried reasoning to me that \"she's trying to warm the house up faster\". I explained that's not how that works....doesn't mater if move it from 68 to 70, or from 68 to 80 the house is going to warm up at the same speed. She keeps arguing that no, that's not right the more you turn it up the faster the house heats up.\n\nAt this point I start explaining how a boiler works and she responds with \"I don't need you to mansplain things to me\". I about lost it, just because I'm explaining something doesn't mean I'm  'mansplaining' espcially when she cleary doesn't understand how it work. I stood there for a solid 15 seconds not sure how to respond. I was just so pissed I ended up saying \"You know what, go fuck yourself\" and walked away.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, honestly I don't think the conversation would have gotten that heated if your wife hadn't been such an asshole about it. Like in normal circumstances I hope you're not cussing at your wife, but her trying to pull out some gender terminology to paint you as a villain when she has been fucking with the house in a way that is detrimental to you, and wouldn't listen to you on this matter, something that acutely affects you, is bull.", "NTA, she's wrong and doing that not only makes it uncomfortable she's also ratcheting up the energy bill for zero reason.", "Yta for marrying someone who does t understand basic concepts.", "Sorry, but “hold withdrawal of affection and sex over your partner so they’ll accept shitty behavior” is a terrible life philosophy.", "Better to be fucking yourself in peace than fucking someone who pulls out gendered terms to hide her lack of knowledge", "Sadly.", "I've read enough to coincide ITAH here. This was also a few years ago and we are still maried BTW, 7 years at this point. I had just read somthing that made me think about it.\n\nFor me it wasn't so much about the heat. It was being told I'm \"mansplaining\". Admittedly my reaction as shit, but using that word just set me off because I really didn't feel like I was.", ">But there’s no reason or excuse to speak to your partner or spouse that way\n\nHard disagree here. OP was trying to have an open communication, and his wife is using buzzwords to win the argument and shut him up when things aren't going her way. These are the same people who claim disagreements are homophobia or racism. Its an insult to anyone who had to put up with actual homophobia or racism, and is a shitty way to try and win an argument.", "Lol", ">Sounds like the couch for you\n\nWhy?\n\n>You can explain things without it being mansplaining though\n\nIt's just not mansplaining when OP is right and the wife is wrong though", "But it's not mansplaining. She's wrong and he's right. Turning it to 80 will not get to 70 any faster than turning it to 70. It's not an opinion situation.", "He's not the asshole for explaining it; many people don't understand it's the length of time the heat is on and not the temp it's set to. It's pretty clear she doesn't.\n\nHe's the asshole for fighting over something stupid, and telling her to fuck herself because she didn't *want* his explanation.", "So he can't tell her when she's just plain incorrect without mansplaining?", "Does he not need to start first, to be able to stop?", "I agree, you weren’t mansplaining. She said that specifically because it shuts down the argument. Just as someone whose parents spoke similarly to each other, it’s something I don’t accept under any circumstances. That’s why I said it seemed like a both in the wrong situation.", "I get it, being told you are mansplaining is not great. That said, there are way more productive ways to convey to your wife that she crossed the line than seeing that line and leaping over it yourself and giving her the middle finger from the other side of it.  You lost the moral high ground. \n\nGood for you for recognizing it, sounds like you’ve both done better since.", ">These are the same people who claim disagreements are homophobia or racism.\n\nOh boy, and what \"disagreements\" would that be lmao", "Right which is what I said he explained something it wasn’t mansplaining though. It is probably the couch because he told her to go fuck herself.", "Agreed. I had a partner who spoke to me that way. HAD. \n\n&#x200B;\n\n  \nShe shouldn't have said that, but neither should you.", ">Right which is what I said he explained something it wasn’t mansplaining though.\n\nOh mb I thought you were telling him to explain in a way that she can't call mansplaining\n\n\n>It is probably the couch because he told her to go fuck herself.\n\nShe can go sleep on the couch for saying it's mansplaining", "I mean yeah either way I don’t think they are sleeping in the same room tonight. She can sleep on the couch if that is how it works at their house.", "Yeah I just hate the stereotype that the man sleeps on the couch while the woman gets the bed", "Fair enough. I just don’t think they will be sleeping together.", "I'm gonna go with NTA. \n\nMy SO adjusts to Temps well... and I don't.  So he let's me be in charge of the thermostat ( I also pay for the heating and cooling as part of my share in bills as a result/compromise) but I usually adjust 2 degrees at a time.\n\nI try to make both of us comfy when I can! We also have plenty of blankets for me and the cats if he starts feeling too toasty. I don't mind turning down the heat for some extra snuggles :)", "ESH I can't imagine being married to someone who tells me to \"go fuck myself.\" I'm sure she understands what you're telling her and just wants it at 80.", "I don’t think OP handled it wrong.  There are times that things need to be said to get the point across.  NTA.", "YTA: You're the one writing it and you clearly come off as TA", "Esh both of you need to work on communicating better.", "YTA. That's how you talk to someone who you love. What is wrong with you?", "ESH. You both sound kinda childish.", "How about deciding what the temp should be and setting the thermostat to that.  \n\nLetting the house get cold and hot and cold is inefficient.  \n\nWhere you work; where she works, do you constantly adjust the temperature or is it comfortable all day and you don’t have to think about it.  Why is that?  It is because the temp is constant.  Takes a lot of energy to warm up a cold house.\n\nBTW, women feel cold much more than men.  What is a slight chill to you is really uncomfortable for her.", "ESH yeah she insulted you and that sucks because you weren’t and you’re right.  you should’ve turned it down and told her to google it if she thinks you’re wrong or something, not saying go fuck yourself. saying you’re mansplaining and you telling her to go fuck herself are not equal. i can’t imagine telling my husband to go fuck himself like that, i can’t imagine saying that to anyone you love in anger, like jokingly sure but it’s obvious that’s not the context here. \n\nin short, you both suck and need to communicate better", "ESH. Her, much more so. However, that is not the way you speak to a partner nor is it away to resolve a conflict.", "I’m gonna say NTA.\n\nShe tried to invalidate you as a male person by accusing you of “mansplaining” and that is so unfair, and you reacted out of being upset by your wife invalidating you.\n\nThat would be like you making comments about “you must be on your period” when she is grumpy.", "NTA. I did commercial property management for a couple years and I had to put thermostats under lock and key in some of the buildings. No matter how I explained to people that no it didn’t heat or cool faster they didn’t get it. We once had an air conditioning unit freeze over in the middle of august because the damn people had it set to 7 degrees Celsius. It just ran for weeks till it froze over.", "NTA. You were not \"mansplaining.\" You were simply explaining, no gender involved, and she was refusing to listen. The mansplaining accusation was a cheap shot and unworthy.", "ESH. I’d die if my husband put the heat on 80 and would be pissed. And then when I tried to explain to him that it doesn’t matter what temp, it heats the same rate and he proceeds to just shit on what I’m saying, I’d be even more pissed. However, i would never ever cuss at him. He’s my partner, not some a hole off the street. So that’s why y’all are both A holes in my opinion.", "NTA. But she is only mostly wrong. The heater turns off when the thermostat reaches the set temperature not the house. So if the thermostat is located near the heat register the heater may turn off before the house heats up.  Also is it a two story house with dual zone heating? How are they keeping the heat downstairs if it’s a two story?\n\nAnd that is mansplaining!", "Oh NTA lmao\n\nladies, I don’t know who needs to hear this, but there is a very important difference between explaining something when you clearly don’t understand it and mansplaning.\n\nTelling a doctor how medicine works? Mansplaning.\n\nTelling a doctor, how local state voting works when she’s only voted once in her life? Explaining.", "yta, first mistake, never tell your wife she is wrong.", "It sounds like you were frustrated and not trying to be AH. \nI don't blame you for being upset, I hate myself when people try wrongfully accuse men. Just because you were explaining something doesn't mean you were \"mansplaing!  I hate the current culture of de-masculating etc.\nYou should try and talk to her instead of cussing at her.  Sounds like she rather accuse you instead of listening to you.", "not exactly the asshole, but you couldve handled it better. it just dounds like a misunderstanding", "You definitely escalated a very casual situation. Like that’s a very aggressive response for something so unimportant. Like what’s the real issue?", "NTA. As a woman, your wife can rightfully screw off. I need to remind myself some days that the bell curve exists… can’t even hear your spouse out on how a boiler works ffs. Yep your reaction was harsh but if this is the only time you’ve lost your cool after her doing this for so long and then saying you’re MANSPLAINING… justified AH.", "NTA. I mean, she is partially right in that some systems (but maybe not yours?) will turn the heat on SOONER if you crank it up higher. But the places I've lived that worked like that I could crank the heat to 80, stand there for a sec listening for the heat to go on, and then put it back down to a reasonable temp. I wonder if it isn't just an issue of her wanting the house warmer faster but actually considering 80 the ideal temp? In which case I suggest an electric blanket for Christmas 🤣", "Yeah, YTA for saying that because that's not the most emotionally responsible way to handle conflict. However,  I will say I don't blame you for getting upset.\n\nAlso it's only mansplaining when a man is explaining something to a woman that is a) commonly understood  or b) the woman has demonstrated a knowledge already.\n\nI would have been inclined to say this would have fallen under 'a' but your wife clearly demonstrated a failure to understand how it works.", "ESH. Instead of manspaning things to her, the correct way to settle the debate is say, \"Let's google this. Looser makes dinner.\" Now go apologize to your wife for telling her to fuck off. And make her a nice dinner of her choice.", "Cold blooded wife with a hot blooded engineer spouse here, If it wasn’t for the last line I’d say n t a but that went to ESH. I think we’ve had this same argument before. Is her lack of understanding how this works your frustration, or the neglect to keep the house at normal temps that might pump up the electric bill? I think a compromise is in order. Agree to times of day to set the thermostat to, and maybe invest in some thicker curtains for doors and windows.", "YTA for telling your WIFE to gfy", "YTA. There is a really limited number of circumstances that telling the person you are married to to \"go f**k\" themselves and then walk away, and this does not rise to that level.  \n\nSince you know from what your wife says, she is very cold, why don't you work on ways to help solve that so she doesn't feel a need to turn the heat up to 80º.  \n\nBut if that's how you talk to her, maybe what you're really trying to do is get her to leave.", "You're the asshole. You don't have very good self control if that's all it takes for you to swear at your wife. : )  I agree with you that she's not understanding how the boiler works and I realize that's frustrating. Can you perhaps come to a compromise with her? Find a number she can live with and stick to it then turn it down once the house is warmed up? Say, she can turn it to 75 but no higher. That gives her the feeling she's made it warmer faster and gives you some relief from the sweltering heat. You can then turn it down from there. Eventually, you may be able to convince her to turn it to 72 or lower depending on your comfort.", "ESH", "ESH but I can relate. My spouse and I have this dispute once per year!", "No she's not wrongs she's cold . Her understanding of how fast the house will heat up is wrong . She's not in the wrong for turning it on or up . She's in the wrong for saying \" mansplianing \" and having the wrong understanding of thermostats .", "YTA for reacting childishly and saying that, of course. Sure she was also in the wrong but like why would you react that way? There is a wrong way to be right", "NTA. people who dont know how heating works sucks. The tstat should be adjusted by a few degrees only. Period. She should be required to take and PASS a course on HVAC before she is allowed to touch the stat again.", "[removed]", ">Mansplaining occurs when a man who doesn't know what he's talking about \"explains\" it to a woman who does, which is the opposite of this situation, so it simply cannot be mansplaining.\n\nThis, word for word, is what OP should have said to his wife when she accused him of mansplaining.\n\nIt'd have ended in divorce, but I still feel as though it would've been worth it.", "This.  NTA", "If his wife is really that shitty, maybe it’s time to rethink things. Withholding affection because you lost an argument js abusive,", "I think you missed the point. The reason OP got angry was because his wife accused him of “mansplaining.” It wasn’t about the heat per se. I see his point. OP is NTA.", "What’s the point of saying “go fuck yourself”?\n\nThere’s no point being made there. It’s just hurtful. \n\nCould understand if OP had said “you’re f**king wrong” and then walked away, because at least that communicates something.", "It’s not about the heat. It’s about the insult she hit him with because she was too immature to lose an argument with grace.", "Again, turning it to 80 when you don't need it to be 80 doesn't achieve anything. It doesn't get warmer any faster by turning it higher. So she could get literally everything she wants without doing the inconsiderate thing she keeps doing by forgetting it if she'd just turn it up by a couple degrees.", "But she's 100% wrong.  Cranking the heat to 80 or 70 doesn't heat any faster or slower, it just doesn't turn off and costs an ass load of money.  Mabey stop reacting to the genders and try to read.", "Why not both? Cold AND wrong.", "It turns out the laws of thermodynamics don’t cease when OPs wife is cold", "Umm, no.  She was wrong.  Are you the wife?", "Umm, no.  She was wrong.  Are you the wife?", "No shes wrong. And she's hiding behind BS in this situation.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "“Mansplaining” would be if she literally IS a plumber, knew exactly how boilers work, but you spent ages condescendingly explaining boilers to her.\n\nIn this case, she knows nothing about your heating system. What you were doing was regular explaining.", "I'm not gonna lie, I likely would have had a similar reaction. The most important thing is what you do now. Go apologize and talk it through. I hope neither of you will let your pride take the wheel here.", "Your point is so nonsensical that I genuinely don’t know how to respond. If you think it’s ok to speak to your spouse/partner that way just because you’re frustrated that’s on you and between you two. I don’t tolerate it and my partner would never speak to me that way.", "Thank you for that unnecessary explanation, I’m keeping my vote and opinion the way it is. There’s no excuse to speak to your spouse that way so he still sucks too.", "Yeah that too but even without that she's still TA in my opinion because she can't bother to actually check and see if what she's doing is helpful or harmful.", "https://www.youtube.com/watch?v=P4\\_6e5IaQXM&ab\\_channel=PeepShow", "So how is OP in the wrong?", "On occasion there's an AITA post where a coworker is getting punished for well documented reasons and they say its racism or homophobia. When others point out no, its because of X, coworker cries they are racist too.", "There are often posts in this sub where an OP is accused of being homophobic because someone cheated and broke up a marriage (sometimes it's their parent and sometimes it's their spouse) and the cheating occurred with someone of the same sex. Then the cheater gets mad and claims homophobia when the OP refuses to forgive or support them because of the fact that it all came about due to cheating.", "You missed the point, it wasn't about the frustration. Its making ridiculous claims to shut your partner up. OP was clarifying his point and was accused of mansplaining. It wasn't mansplaining, but he now can't say anything because his wife will just wave away anything else he says as further mansplaining. Its B.S. and needed to be called out exactly how he called it.", "I agree with you. She was dead wrong and there’s no excuse to use that language/tone with your spouse. My husband would never.", "I’ve explained several times now in my other comments if you want to read them", "I really think you need to read OP’s comment to me saying he recognizes he was also the AH and stop telling me I missed what YOU think the point is. You sound like exactly the kind of ah that would speak to their partner that way and then be SO shocked when you get left.", "From your response to OP:\n\n>I agree, you weren’t mansplaining. She said that specifically because it shuts down the argument.\n\nSo you agree with me at least partially. The point we disagree with, and the point of my first comment that you missed, is that OPs response was justified in my opinion. People who use these ridiculous claims need to be called out on it.", "I didn’t miss it just because I don’t agree with it. And considering I will not change my opinion on how partners should speak to each other and what’s acceptable, I’m not sure why you’re still arguing with me. I wouldn’t accept it from my bf and he wouldn’t accept it from me.", "ESH. Your wife for not listening to you and assuming it is mansplaining, you for telling her to fuck off. I’ve never ever told my partner to fuck off in our years together and I never will.", "**ESH**\n\nThe way you speak to EACH OTHER, with total disdain and dismissiveness, is horrifying. It sounds like you don't even like being around each other, much less love each other or have any kind of mutually respectful relationship. Why are you even together, if this is how you treat and speak to each other?", "NTA, show her some examples of bills for new furnaces and boilers. If she wants to go all out she needs to see what can happen plus it won’t go at a convenient time it will go when getting a replacement will be days away or a huge emergency cost. Her choice", "NTA and would your wife take it from another woman that is not how the hell that works.  Claiming to mansplain is her getting mad because she doesn't want to hear it. This Old House has a female contractor that has handled boilers. See if you can pull up her YouTube. I am drawing a blank on her name right now.", "NTA - it’s not mansplaing just because she’s wrong and you’re correct. The correct answer doesn’t care about your gender. The real victim is your heating bill.", "it’s actually hilarious she used mansplaining in that situation.  She thought she knew how it worked. :) Why get so irate over that, that your cursing out your wife ? Besides she’s just turning up the heat so you’ll get naked ! It’s oldest trick in the book ! Lol", "I’m going definite YTA, you can’t yell stuff like that at your spouse just because you don’t like how high she set the thermostat. 🙄", "She was feeling defensive. If my husband spoke to me the way you did to her, it'd be buh bye for at least awhile.", "YTA open a window if it gets too hot and don’t curse at your wife", "ESH. What you said was a little harsh, but to call it mansplaining when something is blatantly wrong is ridiculous.\n\nNext time, let her leave it on 80, and you head out to do something. Send her the power bill at the end of the month.", "Your wife doesn't know what mansplaining is.\n\nIt's not 'a man explaining'.\n\nNTA.", "Esh but more her than you. She’s wrong and should be able to admit it. She shouldn’t accuse you of mansplaining and you shouldn’t have cursed at her in response.", "ESH. You just have to be the adult and not talk to your wife that way. But I voted this way because you’re not wrong about the HVAC and the way she wrote you off as “mansplaining” was ignorant and intellectually lazy.", "ESH.", "ESH. Being rude is rarely called for, and that is especially true when interacting with your spouse. You need to sit down and talk about a better solution when she is already warm though. Digital thermostat? New windows to reduce drafts? A space heater or electric blanket to warm your wife while she waits for house to catch up? The problem is she’s cold!", "ESH big time", "ESH. ESH. You two need to sit down and have a long, serious talk about communication skills.", "Ugh. My husband does this with the house and his van. He thinks if it’s higher it will be hotter heat coming out. He’s gotten better in tte house as he has seen out heating bills. But in the car I’m always dying of heat stroke", "ESH, the \"mansplaining\" comment was unnecessary and wrong, but your reaction was way out of line. I wouldn't want to be married to someone who straight up tells me to go fuck myself when I make a dumb comment. Also is your wife okay with you looking for \"online fun\" with \"younger women\" on here? Username checks out lol", "ESH. Your wife needs to open her mind and learn what you’re trying to TEACH her, not mansplain to her. You should never tell your spouse to go F themselves; that is soooo incredibly disrespectful. I’m astounded that people will say things to their partner but would never dream of speaking to a friend that same way.", "NTA. That’s not how mansplaining or science works. Probably could’ve worded it better but we all can lose it a little especially in the heat of the moment.", "ESH\n\nJesus get counseling if your response to your WIFE is to tell her to go eff herself. What are you, 15? This is NOT how mature adults behave. Next time, ask her to google it, or even bring it up in front of friends and have them help prove it to her. It would embarass her, but it's better than responding like an angry teen.", "i got nothing, you can't fix stupid.\n\nNTA she didn't even try to understand what you were saying.", "Nta but I’m guessing I know who she’s not going to F’k", "Damn you married one of those. Fack. Id honestly say throw the whole thing away, but im just kidding at least you got one that allows you to walk away. Get a thermo with a pass code if they exist, then point to the closet with the throw blankets lmao. NTA\nEdit: 90% of the time a women uses mansplain, its incorrect. But it does exist. Explain to her what it is in a long drawn out monotone voice and dont look her in the eye.", "YTA. She was wrong no doubt but telling your wife to f herself was so unnecessary in this situation. Spouses shouldn’t speak like this in an age. It’s one thing to curse in play but this was in anger. Not cool.", "YTA Couples frequently have issues where they disagree over a particular thing. \n\nI cook and like the dishes kept in certain drawers for easy reach. My husband washes the dishes and he puts them away in different drawers that he considers to be within easy reach. We drive each other crazy with constantly reorganising the kitchen on each other.\n\nWhat we don’t do is swear at each other and insist that each of us correct.\n\nCos ya know that doesn’t lead to a happy marriage…", "ESH.", "It’s probably best to avoid conversations to the extent that’s possible.", "NTA - you were way nicer than I would have been in that situation.", "NTA if you don't like it then you don't", "NTA - I had the same issue, more in the summer when my wife would turn the AC to 60. I pay the electric bill. I bought a smart thermostat and I set limits on it so she cannot go below 68 summer, above 72 winter. Now she even jokes about it, the service man was over doing an annual service on the AC and she told him to call me so he could go below the presets....lol", "NTA, Get a thermostat only you can control.", "NTA. I had a similar conversation with my husband's best friend a couple years ago. He was staying with us for a bit and turned the heat up to 78. In January in the northeast. I told him heat doesn't work that way and knocked it back to 70.", "My wife and I agree, NTA.", "NTA.\n\nConsider moving on", "NTA. She said it first.", "NAH, but I can see where she's coming from. \n\nI always figured that because cranking the heat in the car makes the car warm up faster, the same concept should work in the house. I don't have much firsthand experience with a furnace, so it took me a minute to learn that it doesn't work the same way as a car heater. Perhaps your wife could see the same comparison when you've both calmed down?\n\nI get why you're frustrated and mansplaining has def become a trigger word. Your words were a bit harsh, but I still say NAH.", "Nta", "NTA. Clearly being reasonable didn't work.", "My brother. I had this exact same convo with my wife tonight. The struggle is real.", "Its not mansplaining if you actually have no fucking idea how something works. Its one thing is she repaired or built boilers for a living and he was like 'oh hey babe this is how it works'. But she doesn't so that's not mansplaining, thats literally explaining how a thing you don't understand works.  I'd have told her to fuck off too.", "My wife has given up on arguing with me anymore. If I tell her she's wrong, she googles it, and if I end up wrong she tells me. If I'm right, the conversation is done and we can move on to what we are eating next lol... NTA", "NTA it's not mansplaining when you are explaining something you know about to someone who doesn't. Her hiding behind buzzwords is stupid.", "Ggs love to see it", "Sweet Christ! What does it matter? She's an adult and can put the thermostat to whatever she wants in her house!", "Saying someone is \"mansplanning\" is about the same as \"go fuck yourself\" If she doesn't believe you, she can google it. How does she think the AC at your house works? When you set it at 78, 75, 72, whatever you set it at, and she stands under the duct and is freezing, does she think that's the temp she wanted?", "It is so hard to explain things to people who just won't believe you.  I (F73) used to try and explain to my mom that her almost empty 17cu. ft freezer ate up a lot of energy, and they use less energy when they are full.  Since I couldn't get through to her, I finally had my brother tell her the same thing and she finally agreed to stop using it.  In her case though, she never believed anything that came from a woman, just men.", "Idk, she may be wrong, but she genuinely thinks that’s how a boiler works, she doesn’t mean any malice. OP on the other hand told his wife to go fuck herself, rather than saying, “I am not mansplaining it to you, I’m explaining it. If you don’t believe me, look it up, it’s basic thermodynamics”. There are some words that just don’t belong in a marriage, and “go fuck yourself” is one of them.", "I feel this in my bones. My girlfriend accuses me of mansplaining when I'm just trying to move us toward the best path forward. I've had this same conversation about the thermostat about 30 times.", ">OP's wife is wrong – completely, totally, and in every imaginable way – about how their HVAC system works.\n\nActually she'd be 100% right if she were talking about my HVAC system.  It has a smart thermostat that adjusts the gas input and blower speed based on how big the gap is between the current and desired temperatures.   \n\nMost older systems don't work that way, but it is becoming more common.", "Ok not to be the village idiot here but I do what she does because in my mind, if I turn it up to 80, the air it’s gonna be blowing out is hotter than if I turn it up to 70. So if it raises to the desired temperature at the same rate, like say ten minutes, to either 70 or 80, I can get the house to 70 faster by blowing out air aimed at 80 cuz it’s hotter. Like in 5 minutes. Is that really not how it works? \n\nSeems like it’s how it works in my car and also my house. When I over turn the temperature, the air that comes out is hotter and my coldness is solved faster. If this is wrong I would be curious to know an explanation.", "Disagree.  She’s a grown ass adult and can easily a) understand, if she doesn’t *already,* understand how heating a HOME works and/or b) put some fucking warm clothes on.  \n\nMy husband runs hot, I used to run “warm” but have lost enough weight that I’m generally chilly now.   I put on warm loose lounge clothes.  Wear socks.  I’m going to sit on the couch with a blanket anyway.   \n\nThe only time I actually force the issue is when I want to take a shower and shave my legs without slicing the top of my goosebumps off.  I bump the heat up, wait a little while, shower, and the heat comes back down to a reasonable temperature.  \n\nBoth of these people are fully functioning adults.  You can put on all the layers you want to, but you can’t just take off all your clothes.  \n\nNTA.", "How are you supposed to react to someone insisting on being so fucking dumb? Esp in a way that costs money. NTA", "Isn’t it just an extra work for him to do? Then is it okay for him to leave dishes unwashed because it’s a trivial thing to get into a fight into? Wife can just clean up after him right?", "If she wants it at 80, then she can own that and say “I turned it up to 80, because I wanted the house to be 80 degrees.”\n\nI don’t think there’s any evidence that she understands that turning the thermostat to 80 doesn’t heat the house faster.\n\nBut really, if she wants it at 80, she should say so.  Then they can discuss the real issue.", "It was casual until she accused him of mansplaining. That was really disrespectful and I understand why he told her to fuck off if that is the level of respect she shows her husband.", "To your second point, that's especially true if a thyroid condition is involved. This time of year I'm not at a comfortable temperature if I don't sit down three feet from the heater wrapped in a blanket with fuzzy socks. Otherwise I feel the same way I would feel if I was standing out in the snow in shorts and a t-shirt. And that's when I'm medicated for my thyroid issues.", "Opening a window to counter the thermostat being set to 80 is a terrible solution", "I get the same thing from everyone.  If I say it, it can't be right.  If a man says the exact same thing, I hear \"really, wow, I didn't know that.\"  Ahem, I did.", "I'd say mansplaining is too. It's condescending as fuck. I'd rather be told to go fuck myself.", "Accusing OP of mansplaining when she's the one who doesn't understand how it works is absolutely filled with malice.", "You realize she was shutting down the conversation, right? She was straight up telling him to shut up by throwing around mansplaining at him. That is basically telling someone to shut the fuck up, you don't care. That you will not listen to them and are unwilling to carry the conversation on in any conceivable way.", "He was exasperated, when is it eve ok to give him the same grace you’re giving her and cut him some slack. The line between misandry and misogyny is pretty thin.\n\nNTA", "Using the term mansplaining equals malice. While I don't really condone telling a SO to fuck off over something so stupid, she deserves it.", "At this point in the world, I think clinging to ignorance is malice.", "And saying that he is ‘mansplaining’ when he clearly is not is one of them too. She needs to fuck off", "No, when the word, \"mansplain\" is thrown into conversation there's virtually no communication to be had any further. The person saying it has already, in lieu of saying it outright, made it clear they're not listening any further and would take your line of dialogue badly as it would be seen as more of the same.", "Why would you persist in being reasonable when the other person has shown they don't care?", "Mansplaining what counts as mansplaining? Whoaahh, that's meta", "Insanity is repeating the same thing over and over and expecting a different result\n\nI would say that your assumption that your way is \"the best path forward\" moves towards mansplaining/patronizing territory", "Do you even understand what telling someone \"go fuck yourself\" means? \nDefinition of \"go fuck yourself\"\nVULGAR SLANG\nan exclamation expressing anger or contempt for, or rejection of, someone.\n\nNo one is withholding affection.\nI swear, the stupid is strong here today...", "Ouch. Shaving off goosebumps is why I turn into Sasquatch in the winter.", "You're not the AH here... she was rude as hell so you responded back.  If you insulted her and she said f-u back, no one would support you.\n\nMansplaining is insulting and purposeful action of turning the boiler up causing OP to be the temperature police is inconsiderate. \n\nShe's the AH", "You are NTA you could’ve been nicer but you tried explaining instead of listening or educating herself she insulted you and used a societal term most men are scared to be called out on to get you to shut up cause she was wrong. It like when someone yells rape because someone else pushed them away it devalues the actual term and is not okay", "I have no idea if you were mansplaining or not but very few people who are mansplaining actually realize what they are doing", "Buzzwords is a buzzword", "Telling your wife to Go Eff herself is a terrible solution . Opening  the window to cool yourself  off is AWESOME alternative \n🎶 😃❤️🥰😍", "As is saying that someone is mansplaining. I would say they are about the same level of insult.", "Yea I'm a woman and I think mansplaining is super condescending, I'd only use it when a man is actually mansplaining (which is absolutely not the case here), and not to an SO.", "I agree. Telling him not to “mansplain” was a hostile brick wall.", "Imagine being so mad about being wrong vs being willing to be reeducated", "I'm sorry but if the argument is something like this post, there can definitely be an objectively best path forward.", "Yes, he responded with contempt to her disrespect and use of a gendered insult. Maybe not the most mature thing to do but I cannot blame him.", "He didn't lose moral high ground, he lost patience.\n\nWhat don't people get about how inconsiderate it is to consistently screw with something (the temperature) and not listen to why they are doing something wrong.", "You must have missed           \n           \n> This was also a few years ago and we are still maried BTW, 7 years at this point. I had just read somthing that made me think about it.", "OP clearly wasn't because his wife very obviously didn't know how boilers work.", "I hate the word mansplaining.. how about womansplaining when they boss you about stuff...\n\nYou either explain something or you tell someone something they know.  \n\nIts sexist to define a topic or person as mansplaining..", "Same as how OP's wife thought this was sexism.", "My nephew was disagreeing with a guy, who happened to be gay, about something like carbon taxes or climate change, and the dude got mad and called him homophobic. People DO pull out the racism/homophobic/transphobic accusations in situations where they are pissed off about an argument. Trying to shut the person down. \"I'm gay, and you are arguing with me, so you must just hate gay people\" nah dude, I hate you for your shitty personality! Luckily, the vast majority of people don't stoop to that level.", "She wants to try to trick the boiler!", "Are you all perfect saints who have never ever reacted at the moment? Also, he was accused of mansplaining and being belittled. Do you mean to say you would be perfectly calm and never ever pop off after trying to explain something you know and being told you are wrong? You would be oh so gracious at the moment? Spare me", "So she gets a \"heat of the moment\" pass for being completely unreasonable and rude, but he doesn't?", "There are different levels of “popping off” and OPs level is unacceptable in my relationship. I don’t speak to people like that and wouldn’t tolerate being spoken to like that. Everyone has different boundaries and levels of comfort when it comes to these things. I don’t think he was wrong for being exasperated or verbally expressing his frustration that was just too far IMO.", "NTA, I work with thermostats and you're 100% correct, cranking up the heat doesn't do shit, the boiler can't generate more heat just because you put a higher setpoint and I kinda think you're allowed to say that to her given that she doesn't want to listen to logic or how the heating system works.\n\nmaybe get a heat pump and put it where she spends more time or get some dampers so she only heats the place where she is instead of heating the whole house, even the empty rooms.", "Is your wife 18 years old or something?  She sounds like the maturity level between the 2 of you might be pretty wide.  You are NTA", "NTA, but you're gonna pay for it.", "Buy her an oodie. I barely used my heating all winter", "I'd make her pay the heat bill and see if that doesn't give her an attitude adjustment", "This is weaponized incompetence in a different font. She blasts it and expects you to turn it off. Then she’s playing stupid. NTA.", "You have my sympathies for the sweltering heat. NTA.", "ESH. She’s wrong and didn’t want to admit it so she accused you of being sexist. You could have just walked away and cooled off, but you had to be hurtful. Perhaps you both need to learn how to pick your battles.", "YTA\nYou chose to be rude to your wife when you didn't need to be.", "Woman bad, woman dumb, woman says bad thing which is what is happening in society and even though she is ignorant how can she point something which is probably im already doing in another scenario, woman bad.", "ESH \n\nshe should at least have looked it up to see whose version was correct before blowing off your explanation. So many disagreements can be solved before the escalate by agreeing to look up the answer together. You can’t rub it in when you’re right though. That’s key.\n\nAlso, it’s really never acceptable to speak to someone you supposedly love that way. At least in my marriage, it’s a very firm boundary. If my spouse felt comfortable speaking to me that way in anger, it would feel like a slippery slope to name calling and other abusive language. I can’t tolerate it, and I really encourage others to keep that language out of their loving relationships also. It’s unnecessary, unhelpful, and completely avoidable. You could have said “you know what, I can’t do this right now” and walked away just the same. You would have set the boundary just the same, but in a way that all maintained respect on your end.", "NTA wifey is being unreasonable & it's only mansplaining when a man is trying to tell a woman something about women, when they are obviously not a woman themselves. Since she is behaving like a child, you will just have to follow around behind her & change the thermostat.... or you could get a programmable one & set it to reasonable temps for the time of day. Tehn maybe put a lock on it?  LOL", "ESH, but that's pretty funny. Just Google it or ask Alexa and let the internet tell her what she won't accept hearing from you. And program the thermostat to go no lower/higher than you want. Guaranteed she won't know or bother learning how to change it. 😆", "Lmaooooo I'm dying. I can imagine this whole convo.... NTA.", "NTA but does turning the heat up high not actually make the house heat up faster??? Like if the heat is on higher there's more heat entering the space so the time it takes to heat up should decrease right? Can someone give me the keywords to google this?", "ESH\n\nShe was sexist.\n\nAnd you told her to fuck herself.\n\n&#x200B;\n\nOn another note, does it really not? Im so confused. When I set my heater to 25 it definitely feels warmer than when its set to 22.", "ESH. Her for not listening, and you for your harsh response.", "NTA", "NTA\n\n&#x200B;\n\nI (F) would have said the same thing in your shoes.", "Nta.  That is not mansplaining. And that is not how a boiler works.", "I’m gonna say that he is the a hole cause it’s clear that his wife just is sensitive to cold and it was pretty extra to tell her to f herself", "ESH and you know why", "JFC, I can't believe all the NTA votes. Really? It's okay to tell your spouse to go fuck themselves instead of using your words to have an adult conversation? Your wife was wrong but maybe you were being condescending while explaining the boiler, I dunno. Seems likely considering how irritated you were with her.   Next time, just walk way and calm down.   Maybe have a convo about setting the temp a little higher--many women freeze at the temp that guys find comfortable. \n\nYTA.", "ESH, weird anyone is saying N-T-A. Your response was over the top and unnecessarily aggressive. You are having a basic agreement due to each of you having a different understanding of something. Both of you handled it in an uncooperative, inconsiderate way and it's obvious there's other issues here. Pay attention to the real issue, it isn't the thermostat.", "YTA", "ESH. Your wife doesn’t know how A/C and heating work, but she thinks she knows that claiming that you are “mansplaining” means she can dismiss what you’re saying. The thing is, like others have noted, for it to be mansplaining that would imply that she doesn’t disagree with what you’re saying because she already KNOWS that. And yet, she very obviously doesn’t know. However, you telling her what you did makes you a grade A jerk. If you love someone, that should never be the words that come out of your mouth. Your wife has some growing up to do, but so do you.", "I think ESH but I do appreciate you posting this, it reminded me that I forgot to turn the heat back down before I went to sleep.", "ESH. Learn to communicate properly. This is childish.", "NTA. She is acting like a child. Words you picked were harsh, though.", "Obviously she is wrong about the heater, and that is something that also drives me crazy.. nothing worse than waking up boiling in your own house but what you said is not okay either and I think you know that! ESH I guess but you two should have a civil discussion about this and decide on a max temp you’re both okay with. You were completely right until you said that so you basically screwed yourself.", "ESH. You for talking that way to her instead of just walking away and her for handling being wrong the way she did.", "ESH she’s ridiculous and sounds like a child but losing your composure and cursing at your wife is cringe too", "ESH", "Agreed with NTA. Also we've had this exact argument in my house before, then I went and googled it bc I wanted to prove him wrong. I only turn up the thermostat a couple of degrees at a time and that argument has never been spoken of again 😂😂", "100% NTA", "Can you tell me how the heating system works? I don't think I've ever seen one. If you set it to 80 instead of 70 from 68 it would heat at the same rate but it would be warmer right?", "What OP did was not mansplaining, the google bet is a good solution but I get the sneaking suspicion it wouldn't work and OP, even if proven right, would find himself in the doghouse regardless because wifey gets butthurt and defensive.", "I'm in your boat. I have that argument with my husband all the time. Yet when the weather turned cold this week, I walked in and saw that he had cranked the thermostat to 84. But what do I know? I'm just a woman.", "Mansplaining is when a male plumber wants to explain the solar system to a female nasa scientist. \n\nMansplaining is not every time a man explains anything to any woman for any reason.", "When I was a teenager I though if you set the temp higher then it pumped out either more hot air, or hotter air (it was a long time ago!) and so it would warm up faster. So I get how she might think that. But then I learned better. \n\nMe, a woman who does not think this was mansplaining", "...how are they the same thing at all? Like that is crazy. One is an observation and criticism whereas the other is just a volatile and meaningless attack.", "> If you don’t believe me, look it up, it’s basic thermodynamics\n\nI'm pretty sure that would make her double down on the mansplaining part. \n\nSomething tells me this isn't the only thing they fight about. This is the straw.", "It's about the same to be honest. Although if she went that low I would of problem said something like \"you're ovaryacting\" which is equivalent in the terms of offensiveness imo.\n\nBut I'm just petty.", "Unrelated, but Nair makes a great hair remover that lasts days longer than shaving. So much easier!", "Telling someone you love to go fuck themselves over simple argument is not \"fully functioning adult behaviour\". \n\nESH.", "Oh no no no, please stop with the \"you can put on the layers you want\", it doesn't work like that, specially with a lot of women. When a house is cold, even if you wear gloves, your face remains uncover, the air you breathe is still cold. \nAs someone with poor blood circulation I can tell you that I have a very low threshold for cold temps (they don't need to be that cold) and sometimes the only way I warm up is under a boiling shower. It's 30⁰C where I live, my house is at 25.5⁰C and I'm wearing long sleeves and trousers.\n\nI don't agree with OP's wife, but women in general need higher temperatures than men to feel comfortable (scientific fact, not anecdote), and \"putting more layers on\" simply doesn't work.", ">You can put on all the layers you want to, but you can’t just take off all your clothes. \n\nBeg to differ. If they are in their own home, they most certainly CAN take off all their clothes. We do it at our house all the time. If you're not comfortable being naked in your own home, where CAN you be naked comfortably?\n\nAlso, as someone who only has space heaters to warm our house, blasting the heat on high does warm the room quicker than letting it slowly heat up on low heat. Not sure how it works with built in heating, having never had it as an adult. \n\nThat being said, OP is the asshole for his language, and his wife is the asshole for turning it up on high and walking away - multiple times. Not a great look on either of them. Best compromise would be for wife to either put on a timer to remember to turn the thermostat down, or get a space heater to warm the immediate area without overheating the entire house.  And for OP not to be a dick when he's angry or walk away SILENTLY if he thinks he can't.", "Just because someone is wrong doesn't give you the right to treat them with disrespect.  And I suppose you could argue \"Well, she started it\" except that's what a child would say.  Not an emotionally mature adult in a serious relationship.", "By being an adult and walking tf away?", "Maybe realizing what mansplaining is will help you to feel better? It doesn’t mean you are wrong. It doesn’t negate your point. It simply means that your explanation is coming off in a dickish way. You are being dismissive and/or condescending. I’d also say passive aggressive would fit here. If she never asked for your explanation and then you delivered it like she was dense it would be considered mansplaining. You can be 200% right and still be mansplaining. And if you ended with cursing her out maybe you were closer to that mark then you realized. \n\nIt’s not a knock to you. My brother is like this. Dude is smart as hell. But he’s a shitty teacher and talks to you like you are second grade levels of stupid. He will make you feel dumb while looking at you like you’re dumb. He doesn’t mean it. He’s autistic and he doesn’t understand sometimes how his level of excitement or eagerness can come off. Doesn’t negate if he’s explaining something it’s rude and condescending and 100% the definition of mansplaining. It happens. How you react after it is more important.", ">OP was trying to have an open communication\n\nBut was he really? Or was he trying to explain why she was wrong to get her to do what he wants?  Open communication would be something like:\n\nOP: Babe, its hotter than the hottest circle of hell in here when you forget to turn off the heater.\n\nOP'S WIFE: I know, but turning it up makes it heat up faster.\n\nOP: Whether that is or is not the case, when you forget to turn it off, it gets way too hot in here, plus our electic bill is, you know ... Can you set a timer for 20 minutes after you set it to 80 to remind you to turn it back down?\n\nOP'S WIFE: Oh ... I guess I can do that. Sorry, didn't mean to make it like hell in here 😅.\n\nTHAT is an example of open communication. What OP did was explain why his wife was wrong rather than try to fix the problem at hand. Is the explanation going to help her remember to turn down the heat? Probably not - which was the whole purpose of the exchange. Of he wanted to school his wife in how the boiler works - something she obviously has her own beliefs about, then he is not resolving the problem at hand, just trying to make her feel dumb.", "If I'm mad at someone, why on earth would I sleep with them?  That's not \"withholding affection\" - that's not wanting to be intimate with someone I'm angry at.\n\nIf you're not in the mood, you're not in the mood.  No one is \"owed\" sex.", "If she refuses to change her behavior after having it explained to her and doesn't want to continue the conversation then I would assume she wants it at 80. And I agree that if that's what she wants she should say so. But if the husband is clearly unhappy with it being that hot she may just be making excuses as to why she sets it that high.", "Exactly. A male plumber explaining to a woman why a toilet needs replacing isn’t mansplaining, it’s just explaining (unless he’s talking to a woman with plumbing experience).", "Don't forget it requires that you are talking down condescendingly.", "Please tell that to all women.  But only if you’re a woman. Otherwise you’ll catch shit for mansplaining", "How at all her telling him he’s “mansplainning” an observation and criticism?", "We don't know what his tone was though. And the way he was explaining it. The tone changes something from explaining to mansplaining real quick", "To be fair, I don’t shave my legs all that often anyway… but my husband also doesn’t mind me turning the thermostat up for a shower.   I try to be mindful of what I can do to maintain my own warmth anyway.  I think it boils down to compromise:  I shouldn’t have to make my significant other uncomfortable in his own home so that I can be comfortable when there are a plethora of other options available (like… warm clothes).", "Also being autistic I'm much more sensitive to temperature. I have a sweet spot of around 10-15 degrees depending on the type of clothes I'm wearing where I'm comfortable. Anything outside that and it's physically painful and actually sometimes effects me emotionally.", "Hahaha, I like this.  Fair.  But her husband shouldn’t have to resort to being naked in order to be comfortable.  \n\nAssuming OP lives in a home with an HVAC system — he doesn’t directly mention a thermostat but her “cranking the heat up” is indication enough.  It’s not the same as space heaters, or even baseboard heaters, wood stoves or fireplaces (and I do know each of those options very well).    You can choose a temperature for an individual room with most/all of those options, but it’s not so easy when you home runs off of a central air/HVAC unit.   You can close a vent and open a window but that’s specific to a single room the same way a space heater is.    And I can’t even imagine what their electric bills must look like. \n\n\nACTUALLY, QUESTION:  OP!!! What’s she like in the summer???????????", "Agree this was just regular explaining. But regular explaining can still be done condescendingly, which I bet was the case here.", "Like, if someone who's gay or bi or lesbian etc. is acting like an asshole, and is called out for being an asshole, and their immediate reaction is to yell \"you are homophobic!!!\"", "> Is the explanation going to help her remember to turn down the heat?\n\nNo his explanation was an attempt to stop her turning UP the heat so high, because it doesn't do what she thinks it does.", ">What OP did was explain why his wife was wrong rather than try to fix the problem at hand\n\nHad she tried to understand what OP was explaining, then it would have fixed the problem at hand. Once you realize that the house heats up at the same rate then you realize turning the heater to 80 when you want it to be 72 makes no sense. Instead of openly communicating and checking to see if she could possibly have been wrong, she shut down the communication and claimed mansplaining.", "Not exactly awesome if it's completely counter-productive\n\nWife gets chilly and turns up thermostat\n\nOP starts sweating and gets pissed, opens a window\n\nHot air escapes, temperature drops, wife turns up thermostat \n\nContinue ad infinitum until wife closes window and scolds OP and sparks another fight or husband gets fed up with sweating inside and confronts wife, same result.\n\nAnd this whole time, the HVAC bill gets higher and higher and higher.\n\n\nA truly awesome alternative would be wife putting on some layers or ordering an oodie rather than subjecting the rest of the house to an unavoidable lake of fire.", "Or maybe you can listen to us when we say men \"explain\" the most basic shit to us constantly and expect us not to know literally anything. And it's not the explanation, it's the tone and assumption that we know nothing. I've had men \"explain\" to me something *I* taught *him*, he just forgot I was the one that trained him.", "if she used it correctly it would be an observation and criticism of how he's treating her. she used it wrongly to shut down the conversation bc she can't admit she's wrong", "The poster above me is broadening the comparison beyond the context of the original post. I’m not talking about op or his wife.", "Yep, saying \"don't mansplain to me\" was her way of completely shutting down the conversation, because anything he said after that in her eyes would be more mansplaining. I honestly don't know how you're supposed to respond in good faith to that statement. (I say this as a woman who has genuinely had men \"mansplain\" my own body or job to me; this ain't it though.)", "Yeah, we did have central heating growing up, but my mother was one of those, \"no higher than 68 in the winter, no lower than 78 in the summer\" people. I spent most of my childhood either too cold or too humid (swamp cooler) to be comfortable.  \n\nNow that I live on my own in a solar powered apartment, I currently have the heat cranked up to 80, with the doors open for a cross breeze (we're at that awful time of year when its too cold to not have the heater on, but not cold enough for the heater to not be too hot regardless of what temperature its set at), and wear little to no clothing. In the summer its AC at 72 with the door open so we don't get too cold (we do close the door when its hotter than 90, since the AC can't keep up).", "Seems like that's an argument they've had a number of times to no avail. A better compromise would be to let her do her thing, as dumb as he might think it is, then have her turn it down after a specific time period. Or to invest in space heaters that do warm the immediate vicinity when blasted on high.", "But she doesn't HAVE to understand why her way doesn't work to remember to turn down the heat. \n\nIf the end goal is to keep the house at a bearable temperature, telling her why her way is dumb and doesn't work isn't going to win his argument, its just going to piss her off (which it obviously did). Telling her what the problem is and how can they address that problem is the best way to fix the problem - not telling her that she doesn't understand the mechanics of why her way doesn't work. \n\nDo you want her to understand why she's wrong, or do you want to find a compromise on keeping the temperature at a bearable temperature?  What OP did may not have been mansplaining, but it didn't add anything constructive to the conversation or the problem at hand. \n\nFor example, if OP'S wife had a habit of running the gas tank to empty and running out of gas on the side of the road, and her explanation for doing that was \"well, i want to make sure i get my money's worth off each tank,\" would the best course of action be to break down how it costs more for them to have to call AAA everytime she's stranded, or just come up the compromise that she needs to get gas when she's at a quarter of a tank? Does OP want to be right, or does he want the problem solved? Because it seems like he wanted to be right more than he wanted the problem solved.", "I would never swear at someone, no.  I've been angry and and upset with people, and I definitely yelled at my mom when I was a teenager, but swearing AT someone (as opposed to yelling an expletive when you hit your head or whatever) is incredibly disrespectful and rude.", "Not at all, but I can recognize and admit that I'm acting like an asshole when I do.", "Ah yes, because there is no grey area between perfect saint and aggressive swearing! Moot point, but classic reddit. Coming from someone with a terrible potty mouth, no, it is not a proportionate reaction to tell your spouse to fuck themselves over something this stupid.", "She doesn't have to understand to fix it, but if she *did* understand the  the problem would fix itself. OP had asked in the past not to do it, presumably telling her every time that it was blazing hot every time she forgot to turn it back down. That obviously hasn't fixed the issue, so why should OP keep doing it?\n\n>Do you want her to understand why she's wrong, or do you want to find a compromise on keeping the temperature at a bearable temperature? \n\nObviously there is no compromise because she keeps doing it. And for your example, if she still kept running out of gas wanting to get her money's worth and refused to stop? *Yes*! You should absolutely break down how much extra she is costing you because its obvious words just aren't working! You keep bringing up wanting to be right or wanting the problem solved, but OP tried it your way previously *and it didn't work*. At what point do you stop doing the same thing and expecting a different outcome?", "Agree. I would not tell someone I love to fuck off and I would not tolerate being told to fuck off. People are allowed to feel their feelings — be annoyed, exasperated, whatever, but this is isn't it.", ">but OP tried it your way previously and it didn't work.\n\nI mean ... no he didn't? Based on what OP wrote, it sounds like he kept saying she doesn't need to do what she does because that's not how it works instead of offering a viable compromise like turn it down after 20 minutes. \n\nIf instead of saying \"it doesn't work that way, don't do that\" he said \"can you turn it down after 20 minutes\" it might work. I have a manual washer and ADHD. i have forgotten on a few occasions to turn off the water when filling the tub. Husband asks why I don't just stay by the washer ... cuz its boring and I want to sit. Husband doesn't tell my my way is dumb, we work towards a solution i.e. setting a timer for 5 minutes when filling the tub so I don't forget. \n\nOP hasn't done anything like suggesting a solution, only telling her her way is wrong and not do it. Dude - have her set a timer for 20 minutes and turn it back to 75 when the timer goes off. DO YOU WANT TO BE RIGHT, OR DO YOU WANT THE PROBLEM FIXED? \n\n>At what point do you stop doing the same thing and expecting a different outcome\n\nAt what point will OP stop explaining her her way is wrong and work towards a solution?\nLike, seriously. Solutions, not explanations. Isn't this basic problem solving skills? Explaining to someone why their way is wrong when they are obviously not receptive to the explanation is not helpful. Providing a solution you both can live with is.", "If you were condensing at all, it was mansplaining. Doesn't matter if you were right or wrong. The definition of the term doesn't care about the accuracy.\n\nI'm shocked at how many people on this thread have come up with their own definition of it instead of looking it up. Ironic. \n\nESH", "YTA. It’s NEVER ok to tell your spouse to go fuck themselves. NEVER!", "YTA, why would you ever talk to your wife like that? Yes, she’s wrong, but if my husband did that we’ would be divorcing. That’s not okay. What you is was 10x worse.", "ESH mansplaining is literally when a man explains a simple thing to a woman to feel superior right? In this case she just...generally didn't understand how a boiler worked and was hiding her pride using soke buzzword. And I understand you were frustrated but telling her to fuck off isn't exactly mature my guy, and you shouldn't be surprised that she's upset at that.", "ESH -- yes she made a mistake and yeah she's getting defensive about you trying to explain something, but neither of those things are an excuse to talk to your wife that way", "Sounds like your marriage is going great. Esh people shouldn't do this type of stuff to people they love. Both of you are doing things that are Not very smart.", "There's certainly an objective path forward in many situations but that path might not be his", "Just perused your post/comment history...just...ick....", "NTA.  This is literally something everyone should know.\n\nThermostats are _stupid_ little devices.  All they have is a set point and a thing to tell them when they've hit the set point. That's it, it's purely binary.  They just send an on or off to the HVAC.\n\nMy point of view on being corrected is that if you don't want to be corrected, not being wrong is a marvelous place to start.", "I'm gonna say ESH. She's an adult who doesn't know how a thermostat works (kind of scary how many people think it works like that) and assumed the worst and lashed out when you corrected her.\n\nYou reacted pretty badly. I've said worse when I'm angry, but you overreacted.\n\nMake her watch a YouTube video of how thermosts work or just program the furnace so that the house doesn't get cold enough for this to be a problem.", "I'm going with NTA because I hate the word mansplaining. I could see if it fit into the word smoothly like \"Tomplaining\" or something... But you're just taking a random word and sticking Man Infront of it so you can try and get away with whatever dumb ish you did this time. \n\nNot to mention it costs money and depletes resources to run the furnace, so she's definitely in the wrong to an entitled extent.\n\nNTA she's being ridiculous.", "Not only does your wife not understand how a furnace works, she also doesn't know what mansplaining means. NTA", "**When she bakes chicken in the oven does she turn the oven to the highest temperature possible and when it’s warmed to that number then turn down the oven to the right temperature to cook at?**\n\n**NO, because she would burn the chicken!!! The oven temperature rises at the same rate of speed, regardless of what the temperature is set to**\n\nNTA!", "Is your wife a fan of [The Peep Show](https://www.youtube.com/watch?v=P4_6e5IaQXM) by any chance?", "When you turn the heat up higher it has to pump out hotter air. So it does warm up faster. \nI’m going ESH because she shouldn’t have claimed mansplaining but you shouldn’t have cursed at your wife", "ESH. You massively escalated it. You guys have no business being married if you can't deal with this kind of thing. Both need to grow up. Don't tell your wife to fuck off. Silly behaviour.", "Clearly NTA.", "Actually changing my view to YTA. \n\n>I'm a happily married 36 year old male looking for some online fun/chat/flirt. Zero chance of a IRL meet up. I'll share pics/video once I know you. Ill never ask for more than I give.\n\nYeah, you're just not a trustworthy person and therefore anything you represent here is probably false.", "Doesn't really matter who's \"the AH\". Whenever I have a disagreement with my husband, my question is- \"is this worth it?\" Is it?", "I, as a man, will tell you what is and is not 'mansplaining'.\n\n(Just joking.)", "ESH. Your wife is an idiot and you had a disproportionately aggressive reaction to such a petty dispute. You should never verbally abuse your partner by cursing at them like that.", "tell her she has to pay the heat bill (as a gesture if she has no income.)", "Info. Are you 100% sure your heating system works the way you explained it?", "NTA\n\nBuy her a space heater with a fan and tell her to take it everywhere with her. \n\nI'm perpetually cold and its what I do (admittedly I have 3 and just keep them in the rooms I'm at most often & turn them on when I'm in there.) I'm also Canadian and it's cold 8-10 months out of the year. So.", "ETA you shouldn't talk to her like that and she should consider you in when using the thermostat", "NTA. I have the same issue with my husband and the oven, he'll try to warm up food at 200°C (warm up, not cook!), forget to turn it down, and burn it. I don't know how many times I've explained to him that it *doesn't* make the oven heat faster, it just doesn't stop when it hits 100°C (appropriate temperature to warm up food).\n\nAlso, and I'm a woman, *mansplaining* is explaining something as a man to a woman *when she knows more about it than you do, under the assumption that women can't possibly know more about it than men*. The second part is pretty crucial.", "That would only be mansplaining of you don't know how boilers work. Since I don't know if you do or not, I m thinking ESH.", "nta", "NTA - it isn’t mansplaining when they’re wrong.  And playing that card to shut you up deserves an equally harsh shutting down..", "NTA your wife is literally stupid.", "NTA - there is nothing more infuriating than overheating a house to the point where it is a suffocating inferno.", "Hmm.\nNTA from me.\n\nI mean, I can sort of understand the human need to raise the temperature in hopes that it warms faster - like building a bigger fire makes me warmer. \n\nBut leaving the temperature at that is just weird and lazy. Not knowing how thermodynamics works is sort of acceptable, accusing someone who is trying to explain it to you as mansplaining is ridiculous.\n\nShe might as well just stick her fingers in her ear and sing lalalalala..", "NTA", "NTA. Anyone who accuses someone else of \"mansplaining\" [fucking stupid word] should fuck off.", "I don't think \"pretty harsh\" covers it, that's a big escalation from what they were talking about", "Yup. Both are the AH.", "NTA. Dumb wife", "Whoa, I didn't know that about freezers!", "Our mothers must be related.", "I don't think they're on the same level of rudeness at all.", "That's _kinda_ true. In the larger case of going from, say 50F to 72F, though, it's just gonna hit the top speed of the blower and stay there, pedal to the floor, basically.", "> Disagree. She’s a grown ass adult and can easily a) understand, if she doesn’t already, understand how heating a HOME works and/or b) put some fucking warm clothes on. \n\nand he's a grown ass adult and can handle someone arguing with him who is clearly wrong without insulting them/being a jerk about it\n\nwhy is she the only adult in the convo? she should know better, so should he. thats why its ESH", "You was NOT the asshole here.", "If my wife still wants it at 80, I'm just going to be grateful.", "The heat coming out of the unit is same temperature regardless of what you set it on. To go from 68° to 70° just takes less time than going from 68° to 80°.\n\nAt least that's how our units work. With the old units we used to have (from the 1960s-70s), you could feel the difference in temperature at the different settings.", "Damn same, I tell people something and they will not believe me, then boom! 1 week later my boyfriend will say the same exact thing and they´ll be like ´I didn't know that!´ \n\nSooooo frustrating.", "It’s caused by the items in it — because once the items inside are frozen, they help to keep the entire thing cold, so less time is required for the freezer to be “on” to maintain the cold temp it’s set at.\n\nIn an empty freezer, there are fewer cold items so the freezer has to be “on” longer/more to hold the same temps.", "I wouldn't.\n\nMy son's father told me to \"shut the fuck up\" over a dishwasher and from personal experience, especially in front of your child, it makes you feel so small and worthless. \n\nIt was a similar situation as OP described with the thermostat; I explained to him that a dishwasher uses less water and electricity than washing all dishes by hand and that it's nasty to have dirty dishes everywhere because he doesn't clean them until 24h later and I won't clean everything by hand when there's a functioning dishwasher right there.\n\nSomeone who goes nuclear during small disagreements lacks the emotional maturity and communication skills to regulate their own emotions, see the situation from someone else's perspective and understand and express themselves in a functional manner. \n\nThere are times when I understand cussing and *fuck yous* but it's not house appliances territory.", "Okay, but up to a certain point it *is* true. In a house that's heated-but-not-quite-enough, you're not actually breathing *cold* air. For most people, if they're a bit chilly, putting on a sweatshirt and some socks *will* warm them up. Cranking up the heat to t-shirt temperature isn't necessary.\n\nI sympathize with your situation, but obviously that's not true for everybody.", "[deleted]", "Shutting the entire argument down by using the word mansplaining isn't \"fully functional adult behavior\" either. Because ANYTHING he says after that would just get dismissed under that umbrella anyway. She's in the wrong, he isn't.", "What if the genders were reversed? Would you say that? What he did wasn't correct, but it is preposterous to believe you wouldn't do that too", "In the car, it's different, though... the air/heat comes out at the temperature we set it on. \"Oh, you want air that's 75°? You got it.\"\n\nIn the house, the air/heat is a set temperature, and the temperature setting indicates the temperature at which you want it to stop blowing. Like, \"OK, the room has reached the 75° you asked me for. I'm shutting off now. I'll come back on when it drops below 75° again.\"", "That’s a great explanation!  Thank you!", "There can be an objective path forward but it might not be the path the poster espoused", "You know, I didn't know this could be an autistic thing. Me and my partner agree that I might have some mild autism and now this just adds to it - I always say that being cold is painful, makes me withdrawn and sometimes makes me cry. Thanks for your comment 🙏🏽", "The thing about going outside is that when you're outside you're generally moving.\n\nI can hike in below-freezing temperatures, but if I'm sitting indoors then 19C is absolutely the minimum, even with a vest and a cardigan.", "Nobody said women aren't able to function and turn to icicles at cold temperatures, women are LESS COMFORTABLE. Meaning during the winter in cold climates, women experience more discomfort than men. But that said, nobody is comfortable at -20c, so at least outside there's some equality. The difference comes into play in what temperature a home should be heated to.", "no he is, for his rebuttal. it's an ESH situation", "Oh fuck off", "Or it could be and they*are* right about it.", "If she can't remember to shut off the heat, what reason is there to trust her to remember a timer? OP has suggested a solution, in fact its *the right solution*. Stop turning it up so high, because life doesn't work how she thinks it works. \n\n>At what point will OP stop explaining her her way is wrong and work towards a solution\n\nWhy does OP have to stop being right and compromise because his wife wants to cling to ignorance? She's wrong, end of story. This isn't a difference of opinion, she is wrong. Her inability to address the issue is the root of the problem, and the problem won't be magically fixed until she realizes that. That she can't be receptive to the explanation is a personal failing.\n\nThere is a time and place for compromise. This is not one. OPs wife will stand there and demand compromise, and OP will meet her halfway. Then she'll take a step back and demand more compromise, and do it again and again. That's what happens when one side is wrong and refuses to hear any evidence to the contrary. That attitude should not be coddled or.encouraged."]}