{"id": 22559, "submission_id": "152x16t", "title": "AITA for asking wife to take “her turn” of parental leave?", "selftext": "My wife and I have a child together already. We both work - I have a high pressure corporate job and she runs her own successful small/medium sized charity. We are financially comfortable but reliant on my income - I earn 77% of our income and my wife the remaining 23%.\n\nWhen we had our first child, my wife returned to work far earlier than planned (5 or 6 weeks after the child was born). I took 7 months of parental leave.\n\nWe are discussing having a second child, and my wife is non-committal about taking parental leave. I have changed roles and do not have the job security to take a substantial amount of parental leave this time around (6 weeks would be the upper maximum).\n\nAITA for asking my wife to commit to taking a substantial amount (3-6 months) of paid parental leave before agreeing to have a second child? My fear is that if she doesn’t take leave the responsibility will fall to me to do so, and we will not be able to pay our bills if I lose my job as a result of that.", "created_utc": 1689683027, "permalink": "/r/AmItheAsshole/comments/152x16t/aita_for_asking_wife_to_take_her_turn_of_parental/", "score": 330, "replies": ["NAH.  You have different ideas of leave time following birth.  However you need to come to an understanding BEFORE pregnancy.", "NTA, you should definitely sort out expectations around caregiving before committing to another child. I don't think you need to frame it as an ultimatum though, just have a mature discussion about it and see what she says.", "Where are you that you got to take 7 months of parental leave?", "… don’t have a 2nd child.  problem solved", "This is the kind of problem that is solved with math.run the numbers and then you'll have the only answer.", "NTA...\n\nAre the two of you really on the same page about having a second child?  From what you're saying, it doesn't seem like she's into the idea.", "Facts:\n-She is the one asking for the second child \n-Her job is not as relevant as OP job and that’s because he pays 77% of everything. \n-OP took a prolonged leave that he cannot afford for the  second child, so he is asking his wife, the one wants the second child, to take the prolonged leave. \n\nNTA. If she wants the second, she need to compromise. I wouldn’t have sex until you both come to agreement.\n\nEd: OMG thank you for the awards and the upvotes!", "NTA but something else is going on here, you need to figure out why your wife wants to go back to work so quickly. There's nothing wrong with her wanting to work, of course, but if she has the ability to take 3-6 months of paid leave, and taking more than a few weeks would threaten your job stability, then just waiting to see how she feels about taking the leave until after your child is born is not a viable option.", "NAH - you need to have a conversation about this with your wife.", "INFO: Why does one of you need to take parental leave for 3-6 months?  Is other childcare not available?  Also, who would run the charity in your wife's place for that long?", "You need to have a concrete plan for how you'll handle childcare, but YTA if your plan is for her to take an amount of leave that would irrevocably damage your wife's business. \n\n A third option exists where you pay a caregiver - is that on the table?", "I mean this isn't really an AH situation, you pretty much said it yourself, if you don't have room in your lives - for whatever reason - for .second child, then dont have one. \n\nThat said, it is kinda strange to me that you NEED her to commit to months off? Why is that? You would need to figure out a different structure to having a newborn but 6 weeks isn't that short, many people do this both by choice and obligation (no im not american before anyone says that), what is it you're worried about if you both go back to work? If I were you I'd keep an open before having a conversation with her.", "You can ask, but your wife is telling you that she doesn't want a second child, and you aren't hearing her.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I have a child together already. We both work - I have a high pressure corporate job and she runs her own successful small/medium sized charity. We are financially comfortable but reliant on my income - I earn 77% of our income and my wife the remaining 23%.\n\nWhen we had our first child, my wife returned to work far earlier than planned (5 or 6 weeks after the child was born). I took 7 months of parental leave.\n\nWe are discussing having a second child, and my wife is non-committal about taking parental leave. I have changed roles and do not have the job security to take a substantial amount of parental leave this time around (6 weeks would be the upper maximum).\n\nAITA for asking my wife to commit to taking a substantial amount (3-6 months) of paid parental leave before agreeing to have a second child? My fear is that if she doesn’t take leave the responsibility will fall to me to do so, and we will not be able to pay our bills if I lose my job as a result of that.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You can’t be angry that you chose to stay out longer than she did.\n\nDon’t add any more kids.", "NTA", "A country other than the USA probably.", "Most Balkan countries have minimum of 9 months leave. Some of them have up to 12 months.", "The uk is 9 months paid to some extent", "Germany or somewhere in Skandanavia probably. \n\nNTA, op, but if your wife takes more time off is this hurting her business? Does she have employees to step up during that time? If you job doesn't pay bad, maybe a nanny wouldn't hurt?", "She is the one who is asking for the second.", "The question is: does she have the ability to take that much leave? Or is he assuming she does?", "This is wild to me. Here in the UK, parental leave is usually around 9 months long. And you're here asking why just 3-6 months is required.", "So wife pushed for a second child, he says ok but now you need to take parental leave and he is the A H? BS", "My wife is asking for the second child, not me", "In this case, yes her work IS less important because his job contributes 77% of the household income. Without his income, there is no household.\n\nAnd no he isn’t holding his second child “hostage”. It’s called planning. Most people like to have a set plan for bringing a new child into this world and not just wing it and see what happens. If the wife is able to take an extended period of time to spend and bond with her child, and doesn’t, then childcare is required. And Idk if you’ve seen how much childcare costs these days, but it’s borderline ridiculous what daycares are charging (and infants are typically up-charged because they require much more attention). OP is looking for equal effort put in from his wife, which is perfectly understandable. \n\nOP is NTA", "That’s fantastic. We are so far behind in the US.", "From his post it seems like she does.", "Then DON’T HAVE A SECOND CHILD!!!", "You are not in a position to have a second child.", "NAH\n\nYou as your wife seem to have very different expectations regarding child care. If you are still the majority earner of the household then it makes sense for her to be the one to take leave or take longer leave. Less financial impact, better for your household *and the child you already have a responsibility towards.*\n\nHowever, if she is unable to or unwilling to take that leave, as she is running her own business (doesn’t matter if it’s charity or for-profit) that’s a valid concern for her to have.\n\nThe solution is to *not have more children* until and unless you and your wife can find the middle ground. If you two have a second child without resolving this difference of opinions, it becomes retroactive E S H.", "Do you have enough income to hire someone for the childcare? Just thinking about other options.", "NAH - but why does she need to take off 3 to 6 months? I mean, that's really nice but at least here in the US, people don't often have that amount of time. Can she take off two to three months and use childcare after?", "Let's spice this up a little. I'm the wife of Evidence-Obvious and while he showed me this post as he posted it (Good! We need perspectives!) I did point out to him that his post is a little skewed.\n\nI'm honestly not bitter (well maybe just a tad lol) but let's add some more information here:\n\n1. My role is also incredibly high pressured, leading a medium - large sized organisation (not small), while our household benefits from his salary, I have 40+ employees who depend on a job that I provide them. We also exist to improve health outcomes of our clients, an important service for the community. Economically, my role generates far greater financial and social return for the wider community.\n2. On a monthly basis my salary represents approx 35-40% of the NET income. My husband does get a great bonus once a year, but his post used gross salary figures. He pays a significant amount of tax whereas I don't being in the social services sector.\n3. Yes he took 7 months of parental leave, but our child went to daycare from 4 months onwards... his remaining 3 months parental leave gave him a chance to have a career break and reset (which I was encouraging of).\n4. I've never said I wasn't committing to taking parental leave, I said I need to decide what is best for my situation. His response was always 'show me a plan', putting the mental load of planning (and burden to make it work) on me.\n5. I've said that I recognise we would need to outsource help if he still has to work long hours and I'm managing my job, 2 kids, cooking and managing the household\n6. He also said he won't take more than 2 weeks of leave this time around... but here he said 6 weeks - that's awesome, because he deserves more time with his child, if you can take 6 weeks, why wouldn't you want to (and be a positive example in your workplace!).\n7. This post all started when he walked into the room a few hours ago and said he was ready to start thinking about baby #2, we equally want a second child but are trying to work out how best to go about it.\n\nWhat isn't necessarily mentioned here is how I accept (regretfully) that having a second child means the increased mental and physical load on myself. Some facts from our first child:\n\n1. Since the day our child was born, I have done 95% of the night shifts (and still worked a full-time job)\n2. I do 70% of the cooking (which sucks because he's a great cook but I do the weekday cooking for the family).\n3. I work full-time but have to leave work early to do the daycare pick up and make up the hours from 9pm - midnight, meaning I get less sleep than him and more interrupted sleep.\n\nSo are you an AH for asking me to sacrifice and take \"my turn\"? Buddy, I have my turn, every single day.\n\nLove you :)", "NAH - why can’t you guys get childcare instead of her being gone for longer?", "If she won't budge, you shouldn't have another because your household income depends on it.\n\nNAH of course, unless you agreed to something else prior and someone is backing out now.", "NAH. Have you considered that it’s not the time for a second kid? You don’t have to keep having them, that’s not like, a requirement.", "Nta", "NAH. Wait until you’re financially ready for this and both agree on how maternity/paternity/childcare will work.", "NTA for wanting to get on the same page before bringing another life into this world.", "NTA.  For my wife and I, the salary split is more 90+% for me and <10% for her.  When we had kids it wasn’t even a discussion.  I have friends where it was flipped and clearly the guy stayed home. Financial solvency trumps other concerns regardless of gender.", "Info : is it possible for her to take that amount of time in parental leave without risking her job security ? \n\nIs having a second child something you both want?", "NTA\n\nYou need her to agree on parental leave or there is going to be issues.", "NTA. Sounds like you’re carrying the burden in this relationship, financially and by being a caregiver. Your concerns are valid and I’m curious what your wife’s logistical plan is or her reasoning to contribute less in the relationship", "NTA. But do either of you HAVE to take prolonged leave if neither of you wants to?  Is childcare an option?", "NTA\n\nNothing wrong with asking but it’s not a requirement to take parental leave you could both go back to work after a few weeks and hire someone to watch the baby.", "NTA", "NTA if she doesn’t want to care for the child why have it.", "NTA but y’all need to plan first, if neither want to stay home the other option is daycare.", "Straightforward, pragmatic response. Prepare for downvotes. Lol", "Exactly, she wants the second child, she wants OP to pay the majority of the bills, and she wants to prioritize her career. She needs to pick which two of those things she wants the most at this moment because all three are not possible at the same time.", "Just for future reference:  \nIf you want to make a new line to separate each bullet point, add two spaces at the end of the line before hitting enter/return. Double spacing at the end of a string of text is how to create a line break so you can  \nseparate lines  \nlike  \nthis.", "But she runs her own business and he doesn’t.", "[removed]", "How is the wife not TA? It’s okay for OP to take prolonged parental leave, but it’s not when the same is being asked of her? That’s garbage especially when marriage is about compromise.", "And she is allow to be a complete ass and change her mind (again).", "Canada allows for 61 weeks between the parents (and pregnancy leave on top) but the benefit payment is 55% of your average weekly wages and maxes out at $650 a week (less if you take more than 35 weeks) so many people don't take anywhere near that", "In Germany it's up to 3 years.", "Germany has 12 months, 14 months if both parents take some leave. \nSo 7 months does not even sound that great to me!", "Sweden has 480 days of parental leave so about 20 months (if my math is correct)", "You have a minimum of 3 years that you can distribute between the parents however you want + some additional weeks of protective time for woman right after and before the kid drops.", "My friends work at big tech companies here in the US and all took 6-12 mos off, paid.", "Why?  “she runs her own successful small/medium sized charity“\n\nSmall ships often sink when the captain disappears for six months.  Especially nonprofits/charities since the staff are usually more overworked and have fewer backups than corps.\n\nEspecially in countries that don’t mandate long parental leaves for absolutely everybody, so the companies aren’t structured for it.\n\nHeck, my nonprofit is Large and has 80 ish employees and We would flounder if the Director was gone for months.  We’d have to appoint someone internal as Interim Director (most likely our head of finance) who would have to dump most of her duties on three people, who would offload theirs onto others and so on.\n\nIt’s far easier to accommodate long absences from someone less integral to the functioning of the business.", "She runs the thing. She can’t just quit for a year.", "I'm with you, daycare is the solution here rather than leave. I'm going to assume the wife's leave wouldn't be paid and that they can afford childcare because they're going to need it after the leave anyway.", "It sounds like you have a lot on your plate, so why do you want another child?", "Please don't have the second child yet. Esp since you both sound resentful and even a tad passive aggressive toward each other, despite the love yous :p", "Or, hear me out, hold off on having another child for the moment? Seriously, you guys are adding more unnecessary stress.", ">YTA if your plan is for her to take an amount of leave that would irrevocably damage your wife's business.\n\nBut if the leave irrevocably damages OP's career, that's somehow ok?", "Hahahaah I saved some karma for this moment", "yes, anything that is realistic, common sense and put a 'man' in the spotlight will be downvoted on this sub. \n\nMen: exist \n\nAITA sub: downvote", "Yeah the downvotes are for how ridiculous it is to frame a relationship and having a child as something that has sides.", "My friends work at big tech companies here in the US and all took 6-12 mos off, paid.", " But if he gets fired their are not gonna be able to afford their basic expenses with her job.", "So her boss can approve her leave? Fantastic.", "She doesn’t make enough for the two of them. Full stop. She doesn’t run Amazon, it’s a charity. Financials come before “I’m a business owner” nonsense.", "But his job is the one that’s actually important", "You're not the OP. Why are you acting like you are?", "Then the timing doesn't seem good (not that it's ever great).  Maybe wait a year?", "1. OP didn't say he was forced to take extended leave. He was in a good position to do so then, and now he is not. That's not his wife's fault.\n\n\n2. OP didn't say she was against taking the leave, just noncommittal, and that he was afraid she would be. They're still in the planning and negotiating phase. She apparently doesn't expect him to do it and she hasn't said no to it, either.", "The difference is OP chose to take 7 months leave.  That was his decision about his job.  He can't choose for his wife to take that long a leave.  That's her decision to make about her job. Compromise would be working together on a solution.", "Hold up - do either of them *have* to take the time off? Can they afford childcare? Is that an option? Plenty of people, women and men alike, do not want to take extended breaks from work to do childcare. It's common. And just because OP's wife isn't the primary earner doesn't mean her career is not important to her or that taking time off appeals to her.\n\nThat said, OP shouldn't take the leave if they can't afford it, they absolutely need to compromise.", "... my cousin got 7 months he is in the USA. Really, all my cousins' jobs give both the men and the women leave all based in the USA. And sometimes, a few other countries. (LOL the first thing they all did was get a nanny).  But they have higher paying jobs.  I noticed that with jobs that pay higher wages, employees have better benefits.", "Canada has up to 18 months available for parental leave.", ">It’s far easier to accommodate long absences from someone less integral to the functioning of the business.\n\nIt's also far easier to support a family with more money available.\n\nYou seem to have missed the fact that his issue is her job can't support them alone, this doesn't change just because it's easier for him to take time off.", "OP seems confident that his wife can take 3-6 months of paid leave and return to her job after that time. If he's wrong, then that changes the situation. But from the information in his post, he's NTA, and either way since he cannot take as much leave this time around, he and his wife need to have a frank discussion about what sacrifices they're willing and able to make to make this possible.", "If she runs her own charity, then she can theoretically take indefinite leave, or step back to just an indirect supervisory role for however long. But rather she is comfortable doing so or not is a separate question. And then of course there is the fact that OP covers greater than three-quarters of the household budget.", "With him making the majority of the income and her being the one asking for the second child, it's up to her to make this work, post-birth. She doesn't get to have her cake and eat it too. If she was making most of the money I could see it but that's not how the situation is. It's unrealistic all around.", "You are allowed a year but only get statutory maternity for 9 months and the other 3 unpaid.  You can also use accrued holiday to extend it.", "I don’t think they were questioning the practice or duration of available parental leave.   \n\nIt seems like the wife *wants* to go back to work sooner than that—so they were asking “What other options do you have, besides one parent taking that much leave?”", "Plenty of other solutions - daycare, nanny, potentially parents or other family (if they are amenable).  Even part time.\n\nI just don't see a situation where someone running a small charity can just fuck off completely for 6 months especially with how hard fundraising is.  It's great that OP was able to swing it with the first kid, but that doesn't mean that his wife can or should.", "Yes, the correct response would be “okay, but I am unavailable to take leave like I did last time - what are our other options, and of those options, what makes the most sense?”\n\nHe is completely entitled to say that he can’t take leave, but he doesn’t get to command that she takes leave.", "oh PLEASE. \n\nMost of the men who get downvoted are being so obtuse around the concept of emotional labor I would assume they were alien princes who have had every single one of their needs met in every way by some woman until he crash landed on earth and already in a relationship.\n\nThe women on this sub get treated like absolute trash, especially ones who will no longer accept emotional or financial abuse. Every fake story is about the evil MIL, SIL, wife, etc. \n\nThe misogyny on this sub is real and palpable. There is a bit of misandry, but most of the time the men absolutely deserve the dressing down they get.", "There are sides to every decision. Anytime two people have differing opinions on how something should work, you have two “sides.” Doesn’t mean one person has to be “wrong.” But it would be unwise to proceed if they can’t agree on how. Or if you don’t prefer “sides,” call it options and ramifications.\n\nThe point is, they both need to consider what the other is comfortable with as well as the practical considerations of how this will work for them as a household unit. If it doesn’t work for both of them, then it won’t work for either of them.", "Which shows how ignorant the downvoters are, because people do not fuse into a new person when they get married, or have a baby.\n\nPeople can have legitimately different opinions on a correct course of action, and both be right.  They then, as a partnership, need to come together and figure out the best way to resolve the difference and accomplish the root goals.\n\nFor example, one parent wants both parents to work, and the child to go into childcare.  The other parent wants to be a stay at home parent.  There's legitimate discussion to be had about the tangibles, for example, what will this do to household income?  There's also legitimate discussion to be had about the intangibles; is it better for the child to be socializing with other children?  Is it better for the parent to be socializing with coworkers?  Will it potentially affect a career trajectory?", "She he shouldn’t take 6 months", "That’s not how it works", "They're probably a comment copying bot.", ">When we had our first child, my wife returned to work far earlier than planned (5 or 6 weeks after the child was born). I took 7 months of parental leave.\n\nIt's pretty clear mate. \n\nHer returning to work earlier than planned meant OP had to take time off in her place.\n\nShe forced him by going against the agreement, someone has to be with the baby.\n\n\n\n>We are discussing having a second child, and my wife is non-committal about taking parental leave. \n\nNo, you're wrong. \n\nHe has asked his wife to take time off, and she's non-committal. And given she previously changed her mind he's obviously doesn't trust her unless she commits. \n\nDid you read the post before you commented?\n\nEdit: Great, you've edited your comment removing all mention of \"he hasn't even asked her\". Now I look like a twat.", "I gotta ask, if mom is going back to work faster what was dad suppose to do? Leave kid alone? Take them to work with them? By going back early she forced his hand into having to take leave and to your second point, if you ask someone on a date and they are noncommittal on going on said date would you assume they aren’t against going out and continue to ask and harass them? Same thing, not being committed to it is more than enough to not be willing to have a second child and she’s an A H for not taking turns, that’s literally marriage. NTA op", "That’s fair I hadn’t considered that he hasn’t asked her yet. I’m not trying to devalue his wife’s work, but if my income was 23 percent of the household income I’d make sure that my partner is able to do everything so they keep their job. If OP loses their job then their standard of living and ability to take care of their kid let alone another kid would be greatly diminished.", "It wasn't a choice he had the liberty to make. She went back to work sooner than their agreement, and you can't leave a baby home alone so he was forced to take leave.", "Probably.\n\nI do always wonder, what happens with closely spaced children. Like your out for a year with the baby, you come back and then you out for another year. You could be out two of three years, so I wonder how much of a strain that is or isn’t on a company. Or is there a government subsidy or similar that make it possible.", "Some countries in Europe has up to 3 years such is Germany or Czech Republic. However they pay you less every year and you can go back to work earlier if you want.", "> you need to figure out why your wife wants to go back to work so quickly.\n\nThat’s the point I was making.  The Wife is likely more concerned about the charity she nurtures and runs floundering or collapsing than her husband, yes. That’s probably why She doesn’t want to take long leave.  Or she just wants another kid but doesn’t like being solely responsible for an infant for long periods, who knows.\n\nIt’s not a dichotomy.  Neither of them Have to take long leave if Neither of them want to/think it’s doable.  Short leaves, shifting which days or hours are worked so somebody is home each day, part time hours for a while, hiring help, asking a family member for aid, there are lots of options besides “either you take six months off or I do.”", "> If she runs her own charity, then she can theoretically take indefinite leave, or step back to just an indirect supervisory role for however long.\n\nOr if she stops spinning plates for 2 months, the whole thing collapses because small organisations come apart at the seams when the person running them steps away.", "what emotional and financial abuse? He makes 77% of the household income. Their lifestyle is mostly supported by his income. Logic dictates that his job is more important than hers. Not everything is about misogyny and misandry", "If it doesn’t work for both of you then it doesn’t work for either of you. And it may not be best to proceed. Yep", "He can't even take 2 months. They're relying on his income, so she needs to be the one to take time off.", "It can be. \n\n9 months is a no long time just don't take on any more work. He earns the most and j am assuming if he pays 80% of the bills be could pay 100 % if needed.", "You do realize that most people, at least in the US, don't get 7+ months of parental leave, right?", "I can tell you (roughly, I’m not an expert) how it works in my country, as long as you have a contract (most people do).\n\nEverybody pays into a kind of national scheme. You don’t notice it, it’s a percentage of your salary and comes out with your taxes. The employer also pays into it.\n\nMaking these payments allow you to access social security. This applies to your state pension, but also unemployment benefit, sick pay and parental leave. These are paid by the state as long as you made the appropriate contributions (I think the company pays them and claims them back technically).\n\nI can’t go into much more detail than that. I know that for sick leave, the doctor inserts your data into a system that notifies your company, so they know you’re sick but don’t know what you have, to maintain privacy.\n\nAt least in theory, it shouldn’t be too much of a burden on a company to have multiple long-term parental leaves, they give someone a short-term contract to replace you while you’re out, but they’re still only paying one salary, not both (leaving aside costs of finding and training a replacement).", "The company has to lump it. Statutory maternity pay from the government isn’t a lot (depending on the country) and you’ll find that it’s only companies with financial stability that tend to offer excellent maternity packages. If a company cannot handle it then they offer the legal minimum and the government pays the statutory “wage”.  And they hire someone else to to do the job in the interim. \n\n\n\n\n\n\n\nUK specific now, it’s also the case that you must come back to work for a certain number of weeks to ensure you keep the maternity pay. If you don’t come back or quit your job too soon afterwards then you’re required to pay back part of the maternity pay.", "My 2 siblings had just over 2 years between each of us.\n\nMy parents managed. Although it was the 90s and life was affordable back then", "My coworker at a small nonprofit brings her baby to work. It's insanely frustrating for me, specifically, because I'm often saddled with her care when my coworker is with a client cause apparently no one else can do it for some reason, but it works really well for my coworker.", "Edit: my mistake I see you mean that's what the comment you replied to said. \n\nThat still changes nothing about what I said. \n\nIf they can't support the family on just her job, you can't expect him to take time off. It's unreasonable. \n\n>The Wife is likely more concerned about the charity she nurtures and runs floundering or collapsing than her husband, yes. That’s probably why She doesn’t want to take long leave. Or she just wants another kid but doesn’t like being solely responsible for an infant for long periods, who knows.\n\n\"Likely\" and \"Probably\" are doing a lot of heavy lifting mate.\n\nAlso, none of those assumptions make her look better.\n\nImagine a man saying \"I want another kid, I just don't want to take care of it\", that's not a reasonable argument.", "I said absolutely nothing about the current situation, I was 100% replying to the ignoramus above me who made such a jackass remark I had to say something. \n\nFor the record, OP is right here and his wife is wrong, but they both need to look realistically at the situation if neither is willing to take time to be with the kids.", "It’s a nonprofit. Without her it won’t make it.", "Basically yeah. This is how it works. It could be a strain if you are highly qualified and they can't find proper replacement. However, they can't deny you a parental leave, it's simply their problem. Where I live 40% of the salary goes for taxes. Some percentage of those 40% goes for parental leave, so technically I pay for it now and when/if I have kids the goverment will pay me back by paying me salary instead of the company. \nIt's the same for healthcare. You pay it now and you get free treatment when/if you need it.", "I feel like he meant more along the lines of how companies manage when someone isn't in their position for that long. Like my hotel would crumble if I took that long off and I wouldn't have a job to go back to.", "Where I live the goverment pays you 80% of the salary for 12 months. And the company pays 100% of the salary for your replacement.\nEdit: 80% of YOURS salary", "Same with my family. And the grandparents were involved with some extra childcare help. And yeah, inflation with wage stagnation has definitely done a number on cost of living.", "Are you indentured?\nRefuse.  Tell your direct supervisor before you refuse that childcare is not part of your job and it is interfering with your work.\n\nShe’s not your CEO who will fire you for Not doing something that is Not your job, right?\n\n“Here Aoike, you watch my baby while I do things.”\n\n“No, I can’t do that.”\n\n“But I need you to!”\n\n“No.”\n\n“I can’t do my job if I carry my baby into the meeting!”\n\n“Have you looked into hiring someone?  Interns are often looking for side jobs because we pay them terribly.”", "Of course it’s reasonable.  MANY people want a kid but don‘t want to care for an infant for long stretches, it’s exhausting.  If their partner is willing to, yay.\n\nIf not - that’s when the partner says “Hmm, no.  I don’t want to do that.  Here’s some options.  If none of those work for both of us then we won’t have another kid.”", "Ok,\n\nThen she gets a normal job.... If she wants another child she has to take time off to care for it equal to her partner. \n\n\nIf she had cancer it would continue or not. You don't live your life for a job especially one that doesn't pay the bills", "But, they are finding a replacement while you are gone. What happens to that replacement when you are ready to return to work?", "> Like my hotel would crumble if I took that long off and I wouldn't have a job to go back to.\n\nThis is an example of inherently bad management and business planning, not an issue with parental leave.\n\nBy this logic, if you get a severe injury, or a severe illness, your hotel will 'crumble.'  There's no redundancy built in.", "They know that this could happen, especially when hiring young women, so they probably have some strategies. They have few months to prepare because women usually tell they their managers about the pregnancy early enough. Some companies will hire replacement earlier (like a month or so) and ask the pregnant employee to teach them the basics. It's not the ideal solution for companies but yeah...", "I thought that too, until I got to the mention of a government subsidy, which made me think they were talking about paying for maternity leave.\n\nAnyway, even if you’re right, I’ve written it now anyway! 😂", "That sounds amazing!! Much better for new parents!! \n\n\n\n\n\nThis is our deal in the UK: Statutory Maternity Pay ( SMP ) is paid for up to 39 weeks. You get: 90% of your average weekly earnings (before tax) for the first 6 weeks. £172.48 or 90% of your average weekly earnings (whichever is lower) for the next 33 weeks. You can take a full 12 months off and your workplace must allow you to return to the same position you left, but weeks 40-52 are unpaid.", "No, that's not reasonable. I'm sorry, it just isn't.\n\nIf you're unwilling to parent an infant for stretches by yourself, you aren't ready to be a parent.\n\nBeing a parent is a 24/7 job, if you can't accept that, kids aren't for you.", "The replacement employee knows that the position is temporary. They know exactly for how long they are staying. So, they either start looking for another job few months before the replacement ends OR they file for unemployement. Sometimes, in bigger companies, they don't hire new person but they rather give your job to the other employees with similar position.\nEdit: grammar", "Oh you're not wrong at all! We're a ship with no real captain. Just me and another front desk agent pretending to be management... 🤷 \n\nWe get by, but real talk if me or her got taken out of the picture for any reason for too long, the other would jump ship and then, well some billionaires would die 100 years later trying to see it! \n\nBut until then we're enjoying splitting the extra pay while slowly going insane 🙃 I ordered a new exhaust for my dad's Mustang, don't know when I'll get to drive it and hear it...\n\n3 edits to fix the typos, I'm not burnt out at all....", "Right, but then while she/he (some of these countries have it men and women) gets pregnant while on/right after paternity leave, going back on it almost immediately. Like we all know that couple that just kept popping kids out like they were rabbits. \n\nTbh y'all have been doing this so you've probably figured something out, but it sounds insane to someone who's never heard of it before. Like if my other manager or me did that, 😳 we would HAVE to train them ourselves before taking leave, and then, what? They just stay in that job until we're back? And then? But again you're country probably has better social safety nets so my temporary replacement wouldn't be fucked while they look for another job. \n\n\nAnd the back to back kids thing might be less common there? \n\n\nIt's just a foreign concept, needs more guns, freedom, and fryer oil for me to fully grasp it, does it come in a biggie size?", "It was a bit of both. Where does the money come from and how do companies manage to hold positions open for the return of a parent after a year.\n\nThe reliance on temporary workers to fill in the gaps makes sense. Thank you for explaining.", "Here you don't have the unpaid option. It's 12 months for everyone and that's it. But I think it's nice to have unoaid option too especially for parents that struggle to find childcare.", "Well the replacement person knows that that position is temporary. Actually they know exactly how long they are staying so I guess that most of them start looking for a job few months before they leave the replacement position. About the kids...well most of the people in Europe have 2 kids max. Those that have more are either very rich or very poor (this is different problem and I won't go into the details because I don't want to insult anyone). \nBut I feel the same about the US. I was just telling someone the other day that not having maternity leave would scare the shit out of me 😂\nEdit: spelling"]}