{"id": 22575, "submission_id": "153220d", "title": "AITA for asking my friend to not bring her toddler to our girls night out?", "selftext": "The \"girls night out\" in question is an outing we usually hold once a month or so where we go out without children and partners, just us girls doing girl things. \n\nWe are a group of seven friends, five of which are mothers. My friend \"Mary\" (27f) was happy with the concept of girls night out when we decided what to do, but the last three months she has been taking her 4yo along, even though all the other moms always make sure to have someone to take care of the child for the night.\n\nObviously having a four year old with us means having way less freedom. We can't go drinking or dancing because no one lets us in with a minor, he gets tired easily, complains a lot and he runs off whenever he feels like it - essentially what started as a night to unwind became unpaid babysitting for three months in a row.\n\nI belive that it's needless to say thay we are all pretty annoyed at this, especially the other moms who want to relax a little.\nWe don't understand why she can't leave her son with her partner, or ask her mother to watch him like she does when they want to go out on a date.\n\nSince we have been organizing this month's GNO (we're going to a salon, then to the movies to watch Barbie and eat pizza on the beach if we have time) we also decided to tell Mary once and for all to not take her son along.\n\nI was tasked with telling her and she didn't take it well, she thinks this is something I came up with alone and that I am just being an asshole because I am not a mom and don't understand how painful it is for them to leave their children alone. But she seems to have no problem doing so when it's date time.\n\nI am just wondering if we are exaggerating? Are we being assholes?", "created_utc": 1689695253, "permalink": "/r/AmItheAsshole/comments/153220d/aita_for_asking_my_friend_to_not_bring_her/", "score": 89, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We might be TA because we're forcing our friend to leave her son at home\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nHave your other friends back you up, especially the ones who have kids. No need for them to leave you out to dry", "NTA, but one of the other moms should have told her so it didn’t look like the childless person didn’t understand her struggle. (So they’re kind of the AH’s)", "NTA\n\nYou are really in a no win situation...\n\nThe best solution is to just stop inviting Mary to these \"Girls Night Out\", then plan another outing that allows for the children in the group to come that way she can still be part of the friend group and not be isolated.\n\nBefore the next \"GNO\", send a GC reminding everyone of the plans and that this is in fact a child free event and that if any children are brought they (mother and child) will be left behind. If she still tries to bring her child to the \"GNO\" event, when she just shows up with child in tow, just say how very sorry you are, but she can't come with and go on with your plans. She will throw a tantrum and make a scene so be prepared for it by reminding her that this has been planned as a C.F. night and that you are sorry, but she can't stay if she has her child with her, then continue on with your plans.", "NTA. However I do think your friend group is suspect for making you be the one to deliver the news.\n\nYour friend should not be dragging a 4 year old out at night when they should be sticking to a sleep structure so she is at fault. \n\nHowever, if your friend group wants her there and her partner is unreliable why can't they help find a babysitter?", "Well especially since it’s only once a month and everyone agrees no kids no partners, no you’re not the asshole. If she can’t make it this one month because she has her child then that’s ok.. but she shouldn’t try and change the dynamic by bringing the kid especially when everyone already agreed to not lmao\n\nNot the asshole!", "NTA\n\nYou want a night to decompress, relax, and just talk about nothing or everything.  It's hard to unwind when the 4 year old wanders off and bangs their head on a table.", "NTA - if she's having separation anxiety, she needs to seek help.", "NTA Your friend was not going to take the news her 4 year old was no longer welcome at the girls' night out regardless of who delivered the message. If it's to painful to leave her four old home (🙄), she can stay home. It was easier to scapegoat you because you don't have children.", "NTA - It's Girls Night Out.\n\nTell her she can plan a night with kids if she wants, but this isn't that.", "NTA if this is how she's going to be may be time to stop inviting her along for GNO and let her learn there are consequences for her actions", "Nta it's called girls night out not toddlers night out", "NTA: You and your friends have had this agreement for months and Mary doesn't think the rules apply to her and her son. Every evening is ruined because of it.\n\nNow that you've broken the bad news your friends need to step up and collaborate. A group text of \"Yes, we all decided this is how it has to be\" would be fine.\n\nIt doesn't matter why she doesn't get a babysitter - that's on her. She's not the only mom in the group so she could have at any time asked if she could share a babysitter.", "NTA Is she okay?", "NTA at all. But why didn't you all go to her as a group and let it be known none of you were with this for your GNO? It shouldn't even be hard to comprehend that GNO means no kids. It's a few hours, not days or weeks. If she has that much of an issue being away from her son, she should create a mom's day out for Mom's and kids to hang out and not go against the grain by bringing a 4-year-old to a night out that's also a break from the kids. You aren't the AH here. It's wack that your 5 other friends didn't back you up on this.", "NTA. Maybe it’d be different if she was a struggling single parent or something, but you mentioned that she has a partner. It seems odd and a little unhealthy that she apparently doesn’t want to leave the kid with him.", "NTA.\n\ni would've just made plans for the bar anyway. then she KNOWS she can't bring her kid, otherwise she'd be effecting the entire group. or she'd try to be all \"oh, can we go somewhere else?\" and your group could refuse.", "Probably her husband demanded to take their son to GNOs,just to be on the safe side.", "NTA. Why aren’t the moms in the group organizing joint babysitting? That seems like an ideal situation and the kids have someone to play with…", "NTA.  Didn’t even have to read past the title", "NTA- None off the other mothers being their children. Everyone in the group should let her know how her son runs the spirit of the night.", "NTA. Mary is imposing her preferences on the rest of the group without even having the courtesy to ask if it's ok. \n\nThe rest of the group needs to communicate to Mary and let her know that you're not the only person thinking this way; you should not be thrown under the bus.", "NTA but your friends need to actually go we all feel this way instead of putting you in front of this bus.", "NTA, you need to remind her exactly what GNO means.", "NTA I think everyone realizes a girls night out means no kids or partners! \n\nYour friend should not expect to be able to bring her child. I think it was kinder to tell her not to bring him then not invite her. If she continues to bring her child not inviting her may be the only option you have.", "NTA\n\nThis started out as GIRLS Night Out and \"Mary\" knew this and participated in this until 3 months ago.  As you say, she has no problem with leaving her child for other reasons but not for GNO.  Mary can't use the I don't want to leave the child when she does it on other occasions.  She likes that you plan out an activity for her and her child.  Guess what, she does not view GNO the same as your group and is a different kind of get a way for her.  Seems she is the AH for changing the rules but she needs to know your friends feel the same.   If \"Mary\" wants to have a Mommy and me night out, let her put it together and whoever wants to go, .... can.   I love visiting certain friends and their families, but there are times when I really want to do it Adult style.", "NTA", "\"I was tasked with telling her and she didn't take it well, she thinks this is something I came up with alone and that I am just being an asshole because I am not a mom and don't understand how painful it is for them to leave their children alone.\"\n\nOh well, somebody has to be the bad guy. No, NTA", "NTA. Girl's night out is for you to have a fun night without worrying about kids and that clearly doesn't work if someone brings their kid.\n\nI would try to figure out why Mary insists on bringing her son, especially if she otherwise leaves him with her husband or parents (in law). That's odd and something must be going on.", "NTA but you say she has no problem with her mother watching him while she and her husband go on dates so i don’t think she has separation anxiety, now the question why doesn’t she want her kid stay with her partner (i assume he is also the father)", "NTA", "NTA. Girls night out means just that. No kids or guys.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThe \"girls night out\" in question is an outing we usually hold once a month or so where we go out without children and partners, just us girls doing girl things. \n\nWe are a group of seven friends, five of which are mothers. My friend \"Mary\" (27f) was happy with the concept of girls night out when we decided what to do, but the last three months she has been taking her 4yo along, even though all the other moms always make sure to have someone to take care of the child for the night.\n\nObviously having a four year old with us means having way less freedom. We can't go drinking or dancing because no one lets us in with a minor, he gets tired easily, complains a lot and he runs off whenever he feels like it - essentially what started as a night to unwind became unpaid babysitting for three months in a row.\n\nI belive that it's needless to say thay we are all pretty annoyed at this, especially the other moms who want to relax a little.\nWe don't understand why she can't leave her son with her partner, or ask her mother to watch him like she does when they want to go out on a date.\n\nSince we have been organizing this month's GNO (we're going to a salon, then to the movies to watch Barbie and eat pizza on the beach if we have time) we also decided to tell Mary once and for all to not take her son along.\n\nI was tasked with telling her and she didn't take it well, she thinks this is something I came up with alone and that I am just being an asshole because I am not a mom and don't understand how painful it is for them to leave their children alone. But she seems to have no problem doing so when it's date time.\n\nI am just wondering if we are exaggerating? Are we being assholes?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We might be TA because we're forcing our friend to leave her son at home\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but you and your friends went anout this in a stupid ish way. You don't have one person tell her you can't do it at the start. You ask hey why do you always bring your kid. She is 100% in the wrong here but you could have done this better.", "Nta if shes like this now with her son god help him when he gets older.", "NTA.", "NTA- but your friends kinda are. Why did you get this task?", "You are NOT exaggerating everyone’s feelings… if she doesn’t want to follow the GNO rules than she should not be invited. Having a kid with you negates the reason for a girls night out. If her behavior continues and she brings her son on the next outing- than maybe that would be time for her to hear the other girls opinion. Your NTA for telling her to NOT bring her kid.", "NTA.  Girls day/night is just that.   The dynamic is completely changed when a child is present.  It is rude and wrong for her to bring her child to your outings that she KNOWS are supposed to be child free.", "NTA. Stop inviting her to GNO.", "NTA! I’m a mom and always miss my toddler when I’m away from her (and rarely am), and I still see the value and importance of time spent with just your adult girlfriends. The crux here is how you present it to your friend, it’s important that she doesn’t feel her toddler isn’t welcomed/loved by you guys, but instead that you would love to spend time together with and without kids, and that this girls evening thing is an occasion for adults only. The other moms in the group should back you up though. Best of luck with this, it’s a delicate situation but really nobody is being an ah here.", "NTA, but tbh I'd  have made one of the other mothers be the one to tell her or said something along the list of \"hey, the other ladies and I were thinking you should start leaving (gremlin) home with either your SO or your mum, nothing against (gremlin) but we all want to be able to cut loose and have fun WITHOUT kids around\"", "NTA\n\nAnd the other mothers in the group should help OP out with making this point. They all got child care for the evening, why aren't they mad as hell? Getting a sitter and then hanging out with someone ele's 4- year old.", "I’ll say that it was a mistake for them to make OP do it. Of course if she didn’t take it well, she would resort to saying it’s because OP doesn’t understand the stresses of being a mother. Have one of the other moms, or all of the moms of the group do it.", "Tell her she can plan a night with kids if she wants, but this isn't that.", "True, I think this is the one mistake we made but generally speaking I am the most patient and the others were pretty fed up, so they wanted to avoid an escalation if it makes sense", "We don't only go out on GNO and everyone brings their children when we do, Mary included. I think I will do as you say, though! It's a great idea, and it will give her an ultimatum", "My friends only chose me because I am the most patient and the moms were fairly fed up with her attitude, so they didn't want the situation to escalate too much. As for the babysitter, I'm afraid we never asked because we just assumed she could leave him with his grandparents like she does when they go out on a date", "This is what I said, if we all agreed on one thing you can't just decide to bend the rules to fit your needs. No one is forcing Mary to go out with us, she can just say no and no one will be mad, but she can't force us all to give up this one night of the month because she feels like taking him with her", "To be honest I doubt she has that, she has no problem leaving him with her mom when she and her husband go out on dates", "Usually leaving a 4yr old home is **not** painful 😜 Source: me, mom of 2.5yr old & 6.5yr old.", "We have them too haha, we go out with partners and children often", "Yeah, she is. We never saw signs of anything strange going on with her or her relationship, they always come out with us whenever invited too", "It's possible tbh", "Because when we decided on GNO we also agreed that everyone would take care of their own children, and Mary agreed. We just never foresaw this as an issue since she leaves her son with his grandparents often", "Sounds like they didn’t want to get branded the bad guy.", "Good luck! \n\nIt's a tough situation.", "No they wanted you to be the bad guy.", "Then it makes no sense...unless her husband won't have their son one on one?", "I did not find it painful either and some days I wanted to dance a jig on my way out the door.", "It's possible, I thought of it but didn't want to pry into their private life like that", "Haha absolutely. My eldest likes to ask why he can’t come when I meet a girlfriend for coffee or dinner & I just say “because mommy needs a break from taking care of kids.” And then I wave and smile and drive away fast 😉", "If you're at grandma's house I'm dancing out the door full force with a \"have fun\" and a kiss on the cheek. Sounds like Mary and her husband have some issues they need to figure out. Does the son come along on guys night out? Or just when Mary leaves? & if the anxiety is that bad then Mary shouldn't be going out to begin with.", "I think this is the only explanation, since you say they leave their child behind for date nights.", "The husband doesn't want her going alone because she might end up cheating that's his thinking.", "I’d say it’s more likely that she doesn’t trust husband with the kid or husband refuses to be left alone with the kid"]}