{"id": 22602, "submission_id": "15355wa", "title": "AITA for attending the birth of my ex/bf child", "selftext": "This is complicated, I apologize in advance. I32f was married to my “boyfriend” for several years. We dated through highschool, and married in college. Have 3 children together. We divorced about 4 years ago. During this time he had a few girlfriends, including his most recent he got pregnant. They split up during the pregnancy, due to her toxic ways. A month or so after the breakup, was our daughters birthday, which he attended. We talked a lot and decided to reconcile our marriage. There has been talk from time to time the past 4 years, but we really decided to make an effort this time. \n\nObviously his baby mama wasn’t very happy about this, and although I had many confusing emotions about her pregnancy I was supportive of my husband through it all. Last week we got a call in the middle of the night saying his ex was being taken to hospital for emergency c-section, and she was having medical complications. My husband was an emotion mess, we rushed to the hospital. They wouldn’t allow him back, since we got there too late and due to the severity of the situation. We waited patiently, until allowed back to her room, in which I was already getting dirty looks from relatives there.\n\nThe baby was brought back first, then her, which she was very doped up. I sat there for awhile silently, respectfully while my husband held his child, and tried to make small chit chat with his ex. Everything went smooth, we stayed for a few hours, before we had to head back due to the kids and work. The next day we planned to visit again, but my husbands ex called my husband screaming I had no right to be there, and if she wasn’t o so doped up she wouldve have security take me out. My husband tried to explain that I came for support, but she hung up on him. Then I began getting angry text from her saying I have no right, and she didn’t want to see me at the hospital again. I said I only came to support my partner, and that I didn’t want any drama. She said I wanted the drama the minute I stole her baby father. I told her I didn’t steal no one, I had a life 10+ years with him, and 3 kids. That I came to make sure her and the baby were okay. She then called me a nosy bitch, and said if I stepped foot in her hospital room again she’d have me removed. \n\nI came honestly for my partner. I didn’t want any drama. It was for support. Aita?", "created_utc": 1689702395, "permalink": "/r/AmItheAsshole/comments/15355wa/aita_for_attending_the_birth_of_my_exbf_child/", "score": 177, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I showed up to my husbands ex birth. She said I was out of place and had no right to be there and called me a nosy b*ch. maybe I am the Ah bc I showed up without being asked\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Going to the hospital to support your husband was acceptable.  But you could have done that from the waiting room.  Going into the birthing room to see the baby was not.  At all.  YTA.", "You know YTA.  There's no way on earth you didn't know showing up at the hospital would cause huge drama.", "YTA\n\nHonestly I can respect that you wanted to support your husband, but the reality is that when someone gives birth they set the rules. Period. \n\nThere are no exceptions to that. Not even for the father of the baby. Hell even if the person whose giving birth decides that they don't want the father in the hospital room, that is their right.\n\nFor you to decide you have the right to invade someone's birthing space is the ultimate level of entitlement. Especially after they have had such a horrifically traumatic birthing experience. \n\nThe fact is that you should not have been anywhere near that room for any reason. You forcing your way in there, because it's your partner's baby is inexcusable. Do not go back to the hospital. That is not your baby, it is their baby, and you being his wife means absolutely nothing in that equation.", "YTA. How would you have liked it if he’d have brought one of his girlfriends to one of your births?", "YTA, you could have supported him from the waiting room, that is a major privacy violation on your part. \nShe just had a complicated birth, on top of being abandoned after becoming pregnant by her ex. Your boyfriend/ex husband is an asshole, and your acting like it’s no biggie. I hope she gives y’all hell.", "YTA. You were staking your claim on your ex husband and you know it.", "YTA. Was there something wrong with the chair in the lobby?", "YTA You know you did not belong in the new mother's room hospital room after she gave birth via emergency cesarean. You were not invited or welcome. If you want to \"support\" your philandering husband, do it from the waiting room.", "YTA - why on earth were you in her hospital room? That's extremely intrusive. I understand you wanting to support your husband, but the mom giving birth takes priority. You could have supported him by being at the hospital and waiting for him in another visitor area or a coffee shop.", "YTA. Her child birth isn’t about you. He shouldn’t have allowed you to be there and i wouldn’t be surprised if/when you break up he does similar slime ball crap with the next girl.", "YTA\n\nYou had to know she wouldn’t want you there.\n\nAlso talking this much shit about this woman isn’t setting yourself up for a good relationship with your new stepchild.", "If you were the one giving birth, would you want her there?", "YTA. You waited until this woman was at her most vulnerable (toxic or not) to try to flex your \"winning the prize.\" Invaded a private moment, and the only information you have about her is what your greasy husband told you. You know. The guy that ditched a pregnant woman. He WILL bounce between the two of you like a tennis ball.", "There was absolutely no reason at all for you to go back into the room. YTA majorly", "YTA. You may not have intended to be, but the only people who should have been in the room with the mom are the people she wanted there. You could have driven him to the hospital and waited in the lobby to see if it was okay to come up.", "YTA.  It was great that you were there for husband,  but why didn't you wait in the lobby? It was tactless to go up to maternity.  No wonder her family was giving you dirty looks. Don't interact with her.", "YTA\n\nAlso, you may want to consider that your ex-husband is the toxic one. It's clear she wanted/expected some level of commitment from your ex, and he left her. While that isn't your fault, showing up to the birth of her child is just kicking her while she's down.", "YTA OK, you were there supporting your partner but you didn't need to be in the room with him. \n\nThe mother's family clearly didn't want you there, I'm pretty sure if she wasn't out of it on whatever drugs the hospital gave her, the mother wouldn't have wanted you there, your partner was too interested in his child, from what I can gather from your \"sat quietly in the corner\" comment, to even acknowledge you were there so why did you stay?", "YTA it’s obviously a tense relationship between you and his ex.  This was an intimate and scary moment for them.   Sorry but you didn’t need to be in that room.  It’s his child not yours.  It was highly inappropriate to be there.  Should have stayed in waiting room or at home.", "YTA you had absolutely no reason to step into the room with his ex. You should have waiting in the hallway or waiting room or frankly, not have come in the first place", "YTA, even if you drove him there you should have waited somewhere else or driven back and gone and picked him up again later.", "YTA. Why would she want you there? You wanted to support your husband, you could have dropped him off, or gone to hang out in the cafeteria.\n\nWay to start off on such a great foot with his ex who has his child.", "YTA no question. How is this appropriate? You had to drive him to the hospital cool, stay your behind in the car. \n\nYou have three kids, you should know how stressful giving birth is. Why would she need you there?\n\nYou didn’t want any drama? You took back a man with a baby on the way that JUST broke up with a pregnant woman. That is the plot for a juicy soap opera if you ask me.", "YTA. She had just delivered, the focus should be on her and her needs, not on your husband.", "I'd prefer to be neutral cuz I like to believe everyone has good intentions, but if I have to pick then YTA. You should've stayed in the reception area.", "Wow, you're not going to have anything BUT drama here on out.", "“I don’t want any drama”\n\nReconciles with ex husband right after he gets another woman pregnant.", "Yta, what a train wreck you two are.", "YTA. You could have waited in the waiting room if you were there to support your bf. You've experienced labor 3 times, so you know what a toll it takes - what a roller coaster ride of hormones and all sorts of stuff. You know how special those first moments are to bond with your baby. There isn't any logical or ethical reason for you to be there in that room. You know better, so be better. She told that she doesn't want you there, respect that. This is just the first few days of a lifetime dance you are going to be doing with his other family. Respecting each other will make it a lot easier. Life is complicated, but so much better when we respect each other and show each other kindness.", "YTA are you kidding", "YTA stop being so self centered this isn’t about you.", "YTA! A woman’s birth is one of the most personal and challenging things she can go through. Not only that, but it’s a private medical event which everyone has a right to preserve. I’m surprised the hospital even allowed you in the vicinity without permission from the mother. You likely ruined this woman’s birth experience which already sounds traumatic. Your husband is an asshole for too for even thinking to invite you to “comfort him” when his baby mama is in major surgery to give birth to THEIR child. I desperately hope this is a shit post. Absolutely insane.", "YTA - How can you be some oblivious and not read the room.", "As most have pointed out, you could have supported your boyfriend by going to the hospital with him, waiting with him in the waiting room, then STAYING THERE when he was given the all clear to go to the mother's room. Not sure if you did it on purpose with malicious intent or you were just super naive about this, but being in the mother's room when he met the baby for the first time, and while she was completely doped up after a complicated birth was completely out of line. And what makes it worse is that in a way, you were able to see the baby before even she was because she was still completely drugged at the time and might not have been able to see/function/remember correctly. Imagine if you gave birth to one of your children after you and your then husband broke up and he showed up with his then-girlfriend. How insensitive is that? Very. YTA.", "YTA. You asserted your dominance, now look at this from her perspective. There ain't no way in hell you would have been okay with the situation. How you don't see how fucking wrong you are is baffling.", "Of course YTA. You’ve had children yourself. You know how that feels. To then turn up and be in the room after she gave birth is awful. You’re trying to force your way in, and you don’t need to. He’s back with you. Absolutely zero need to rub it in her face like that.", "YTA.  I get that you wanted to support him, but this woman thought she was going to have a life with him & now she's not.  You're the woman who took him away from her (in her eyes).  Now she's having an emergency c-section with possible complications.  The last thing this woman needs is to see you.  You had no right to go into that room, causing her unnecessary stress when she just gave birth.  You should have either waited in the waiting room or stayed home.  You really had a lot of nerve going into her room to see the baby.", "YTA! \n\nBut why are you even with him.\nHe knocked up someone else! \nDoes no one have any self respect anymore.\nDo you really want to help him raise this baby with his crazy ex. \nSounds like a life of drama, tension and stress. \nGet a paternity test either way.", "ESH, but you more than her.\n\nIf you wanted to go just for support, wait in the waiting room or your car. You shouldn't have gone into the room. She is the one who had a terrifying traumatic surgery.\n\nI said \"ESH\" because she's wrong for accusing you of \"stealing her man\" and trying to start drama. But you are the much bigger AH for going into the room when you already knew she wouldn't want you there.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis is complicated, I apologize in advance. I32f was married to my “boyfriend” for several years. We dated through highschool, and married in college. Have 3 children together. We divorced about 4 years ago. During this time he had a few girlfriends, including his most recent he got pregnant. They split up during the pregnancy, due to her toxic ways. A month or so after the breakup, was our daughters birthday, which he attended. We talked a lot and decided to reconcile our marriage. There has been talk from time to time the past 4 years, but we really decided to make an effort this time. \n\nObviously his baby mama wasn’t very happy about this, and although I had many confusing emotions about her pregnancy I was supportive of my husband through it all. Last week we got a call in the middle of the night saying his ex was being taken to hospital for emergency c-section, and she was having medical complications. My husband was an emotion mess, we rushed to the hospital. They wouldn’t allow him back, since we got there too late and due to the severity of the situation. We waited patiently, until allowed back to her room, in which I was already getting dirty looks from relatives there.\n\nThe baby was brought back first, then her, which she was very doped up. I sat there for awhile silently, respectfully while my husband held his child, and tried to make small chit chat with his ex. Everything went smooth, we stayed for a few hours, before we had to head back due to the kids and work. The next day we planned to visit again, but my husbands ex called my husband screaming I had no right to be there, and if she wasn’t o so doped up she wouldve have security take me out. My husband tried to explain that I came for support, but she hung up on him. Then I began getting angry text from her saying I have no right, and she didn’t want to see me at the hospital again. I said I only came to support my partner, and that I didn’t want any drama. She said I wanted the drama the minute I stole her baby father. I told her I didn’t steal no one, I had a life 10+ years with him, and 3 kids. That I came to make sure her and the baby were okay. She then called me a nosy bitch, and said if I stepped foot in her hospital room again she’d have me removed. \n\nI came honestly for my partner. I didn’t want any drama. It was for support. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Of course YTA, why would you ever think you aren’t? There was absolutely no reason for you to have been in that room. You couldn’t have waited outside? Or in your car?", "YTA", "YTA in what way were you being supportive by sitting in the corner?  You could have stayed in the car or waiting room. If you were her, would you want you there? Seriously, that's very disrespectful.", "YTA for going into the room.", "You shouldn’t have went into her room. How would you feel if the situation was reversed? I understand your reasoning, but going in to her room was wrong! YTA", "YTA, you shouldn't have gone in her room without her permission. You could have stayed on the waiting room so that you were nearby if your partner needed you.\n\nIt's a hard situation for all involved, try to appreciate that she just had a baby though, her baby with your partner. Don't try to step on her toes.", "They split up \"due to her toxic ways.\" I've got news for you. Your ex/bf is the toxic one. And maybe you, too. YTA", "YTA.\n\nYou've done thus rodeo 3 times. You had no business in her hospital room. You should have been at home, in the car, or in the lobby waiting room. Not even the delivery waiting room.\n\nEnjoy the life you're going to live. You've chosen it and deserve everything that comes.", "“We talked a lot and decided to reconcile our marriage. There has been a lot of talk from time to time over the last 4 years…” So you’ve been flirting with him while he’s had other girlfriends and decided to put the blame on a pregnant woman instead of the dude that can’t help giving cream pies. ESH I feel bad for all these kids that have these absolute trash adults raising them.", "I believe that you didn’t realize how intrusive your presence in that hospital room would be for your partner’s ex, and I can see that you wanted to help your partner by staying with him during a crisis, but clearly it was not ok. Now that you know you messed up, what are you going to do to mend the situation? Treating the new mom with respect (and polite distance) even when she’s not giving the same back to you is a good place to start. It’s not true that you “stole her man,” but it is true that she’s the one who got dumped. She had to go from thinking she had a committed boyfriend to looking at a new life as a single mother. I’m not saying she’s not toxic, I’m just saying she’s having a hard time. Have a little sympathy, apologize, and learn from this situation next time it seems like you could be overstepping.", "YTA . My first thought is she got pregnant on purpose to hold him down. So yeah she is mad that her plan didn’t work. Here is the part you are not going to like. It’s up to the birthing mother on who comes to the hospital. You can’t pretend you didn’t know she didn’t want you there. It’s clear as day she wouldn’t want you there. You ignore a clear boundary. She may not have said it but one would have to be the lowest of intelligence to claim not to know. Apologized and move on for the sake of your co-parenting relationship.", "Eh, you wanted to rub it in her face. You know that. How any of you are parents...well. Anyway ESH, basically, but also, YTA.", "Soft YTA.\n\nWhile I understand that you were going to be there for your husband, you forgot that this moment wasn't solely about him. \n\nConsider that this woman was in the middle of birthing a child for a man who chose to end their relationship. No matter what that reason was or who was at fault. She was birthing her child under circumstances that weren't optimal on an emotional level, let alone the physical complications she was experiencing. Your presence only aggravated a pretty delicate situation.\n\nAt some point, the three of you are going to need to come to a place of peace and cooperation, but that day was not the day she gave birth.", "ESH, this whole relationship sounds like a trashy mess and now you guys are putting an innocent baby in the centre of this drama. Way to go. This poor kid sounds like it’s going to have an extremely dysfunctional upbringing.", "ESH\n\nYou didnt need to go into the room, her for the \"stealing\" comment regarding your husband.", "[deleted]", "NTA. You helping out your SO.", "YTA. Come on. She was in an incredibly vulnerable position and you have to have known that she wouldn't want you there. This 'I came to support my partner' nonsense is nothing more than territorial bullshit from you.", "Yta hugely for being in the room. It was her birth and you violated her space. He’s a grown ass man, he didn’t need ‘support’ to see his child for a short time.", "YTA. You didn't have to stay with him to be sure she knew he was off limits... Unless you deep down worry about making sure you put your \"stamp\" on him.", "YTA", "YTA and you did that on purpose. You had no place there and you know it.", "YTA.  You had no reason to go to her room.  No reason to sit around and try to 'make small chit chat' with her either.   You could have stayed in the waiting room.", "YTA\n\nStop and think. If you were her, just given birth via major abdo surgery, would you want your ex's partner in that room?\n\nYour not as kind, gracious or lovely as you are pretending to be. You have given birth enough to know how stupid you are being and you are grown enough to know how petty and nasty you are being to this woman. \n\nYou and your partner are assholes. Self absorbed assholes.", "You could have stayed in the waiting room but other than that I think you were in the right", "I would say that going into the room with him and whatnot was questionable. You can support him without literally having to be in the room with them all and I fully support her not being OK with that.\n\nYou know it's an emotional situation and it would have bene graceful to stay less visible by being in a waiting room of something, physically removed from her. \n\nShe has made it clear she doesn't want you there now and ignoring that for sure makes YTA.", "Why he knocking up all these women", "Wow. Put yourself in this woman’s shoes for longer than a second. The man you love and impregnated you left you while pregnant for his ex wife… who then showed up in your delivery room right after having that man’s child. \n\nYTA. a huge dense one.", "YTA, And a very trashy, especially the very poor grammar \"﻿﻿I didn't steal no one\".  Your BF can make babies, he can deal with a birth that has to do nothing at except hold her hand or sit in a chair. What exact \"support\" did your BF need. Does he think he is giving birth?", "YTA-\nYour husband might have been an emotional wreck but imagine how she felt actually giving birth via emergency c section. \n\nOn top of that, you're already portraying her as \"toxic\", she's probably worried you'll make a case for custody for the kid.\n\nYou didn't need to be in the room and could have just sat somewhere else in the hospital.", "YTA. \n\nAre you kidding? Like seriously despicable. Your bf needed support? Come off it. She had a severe, emergency situation arise during childbirth. I can’t imagine how scary that must have been for her. She doesn’t like you, you knew that. Yet you and your ex insisted on forcing your presence on her in a super vulnerable, scary state, even though you *knew* your presence would be additionally emotionally distressing. \n\nYes, you three all need to figure out how to coparent together. But no, you **absolutely** should not have forced your presence in that moment. Completely inappropriate on the timing. The absolute nerve.", "YTA, you know what you were doing", "YTA. I'm surprised her family didnt stop you from going into the room. I would've walked your a$$ down to the lobby.", "Yeah this is an easy one. Op knew exactly what she was doing. Her presence in the hospital room without prior discussion/permission from the patient is incredibly disrespectful. She made a stressful and already uncomfortable situation even worse.", "Going to the hospital was not even appropriate", "And who was at home with your kids under 10?\n\nWhy wasn’t this discussed in advance between birthing person and baby’s father?\n\nOP you have no right, and it’s not like you’ve got much a prize to stand beside sooooo YTA!", "🛎️ 🛎️🛎️🛎️🛎️🛎️", "Yep.  Next time, just pee on his leg if you feel you need to mark your territory.", "What an absurd question. Of course, there was something wrong with it. It wasn't near the ex so she could see her. Silly rabbit.", "I do wonder how toxic she actually was. What OP and her boyfriend/ex did was pretty damn toxic…\n\nSounds more like what you said - he’s bouncing between the two of them, OP knows it, and went to stake her claim.", "Let's not pretend OP isn't toxic as well.", "Pfft. More like a plot for trashy reality TV shows.", "This.", "Nah, I’d bet money that she knew full well how intrusive she was being. She went to stake her claim because she doesn’t trust her ex-husband/boyfriend/soon-to-be-ex, and rightly so.", "He has absolutely NO say in who goes into HER hospital room. None. She should never have gone in there.", "Nope not her birthing room she had no right to be there.  It’s an intimate moment and she doesn’t get along with his ex.  No reason for her to intrude on their intimate private moment after such a difficult birth.", "🤣🤣🤣", "Maybe she was afraid he was going to knock up his ex again...", "YTA\n\nSupporting your partner is fine, but you know damn well you had no business being in that hospital room. Why did you have to be in there, *trying to make fucking small talk after she’s just gone through traumatic surgery,* when you already know she has issues with you???\n\nYou really fit the stereotype that the more you say you don’t want drama, the more you actually relish in it. Her life, health, and kid are none of your business. I know you want to show off how you got your man back but a hospital room isn’t the time or place.", "YTA\n\nCome on now! If the roles were reversed you can’t honestly say you’d be thrilled seeing her there marking her territory!!", "I can’t believe a mother of 3 thought it was appropriate to go into a room where a woman just gave birth. This woman is not your friend and you had no place to be there.  Your ex husband/bf‘s job was to support the mother of his child while giving birth and afterwards, you had no place in this story. You probably ruined her birth experience. YTA", "You have NO right to invade another woman’s birth experience. I don’t care who the father is. You had no right. And you robbed that experience and memory from her. You should be ashamed quite honestly.", "YTA. Seriously, OP? One word for you: SONSA. \n\nYour husband sounds like a really gift from the gods 🙄🙄. At least I hope his ex will be way more intelligent than you, and she will see soon enough she dodged a bullet. And you will certainly soon regret your decisions in all this mess.", "Your BF has a type, lol. You're not so different to those you're pointing the finger to.\n\nI can just imagine what you all look like.", "YTA. As for “complicated”, have the two of you even bothered to address and resolve the root causes for your divorce? \n\nI feel so bad for all of the kids involved.", "Wtf. YTA. Wtf.", "YTA\n\nThere's no way you didn't know what you were doing.", "Yta", "Girl wth? YTA 😅 if I was her family I would have threw hands cuz who does this?", "Whatever way you want to look at it the birth mother is the queen of the world when it comes to who comes into her hospital room after giving birth.  Regardless of your intentions (which sounds fine to me) you shouldn't have gone into her room, the rest of the hospital is fair game, but not her room.  Any patient can control who is or isn't allowed in their room.  YTAH.", "YTA. You should have considered the feelings of the one who just had surgery. She’s the one who really needed emotional support.. You probably made her birthing experience even more stressful and terrible..", "Yeah that’s a soft YTA. You have zero rights to be there in the room. You can support him in the waiting room but going into the room crosses the line as you know she’s postpartum and needs to focus on her baby. Yes, it’s his as well but not your child", "YTA, you knew what you were doing. You were there to rub it in her face that you two were back together.", "YTA this is a rather complicated situation, but you going to the hospital is already questionable, and then going into the room with him? Absolutely not.", "Sorry, bringing him to the hospital if he genuinely needed you for support is fine, as long as you are discrete about it, find an out of the way spot and try to avoid being seen by her family if he insists on you being there. However, going in the room of an exhausted and probably scared brand new mother was absolutely an AH move. Those first moments are for mother and child. It's probably difficult enough for her to accept you will be part of this child's life but those moments right after your child is born are precious and you never get them back. Nobody wants people they don't care for there in those moments. You stole that from her by going into that room. Maybe that wasn't your intention so maybe you were just being incredibly thoughtless. Either way, if you want to have ANY hope of not having 18 years of a really contentious relationship with the ex (and probably the child) you need to apologize and own that what you did was hurtful and that you realize you stole something from her that she can never get back. I'd also tell her that going forward, you will be more respectful of her feelings...and then follow through on that commitment.", "Have you considered that maybe now isn’t the best time to reconcile? And maybe he has a lot of chaos going on in his life that he should be focusing on instead? I get why you did it, because I would never be okay with a SO being at the hospital for the birth of his child with another woman, but that’s the reason I would NEVER date someone who had someone actively pregnant with their child.", "This is why having babies with different people all over the place is such a bad decision. No wonder kids are so messed up these days. I’m afraid it is only going to get worse. Why do people want this drama in their lives…", "Of course, you wanted drama. On what planet do you live, to think that your presence in the hospital room of his ex, who had just given birth, wasn't going to cause an issue. You just wanted to make it clear that this is my man, and I'm here to stay. \n\nThis baby, his parenting of this baby, and his co parenting relationship with the mother is nothing to do with you. You might be his wife and the mother of some of his children, but you are the visitor in this situation, and visitors are only welcome if they are invited. YTA", "YTA\n\nbro nobody cares how complex or who the what wa wee wa hoo, you knew what you were doing so just stop it.", "For *hours.*", "Said the same thing without reading the comments. Waiting room only!", ">the reality is that when someone gives birth they set the rules\n\nThis right here. Ignoring the ridiculously complex situation... It doesn't matter who you are, if someone is in hospital and vulnerable, they have the right to say who is allowed to visit them. \n\nWhen my sister gave birth (and when she will again), she banned our mam from the delivery room because our mam has untreated anxiety issues and would absolutely not be helpful or supportive but rather flap and be worried. \n\nShe understood/understands it's my sister's choice, even though she'd like to be there. \n\nI can't imagine the extra audacity of someone's \"new\" or \"returning\" partner showing up.", "They all sound toxic, and this is just going to continue to be a toxic co-parenting situation. I know some people will disagree, but adoption might be the kindest route here for the child.", "The postpartum mother was the one trying to start drama? Come on. The woman was one day postpartum with a baby from a man who impregnated her and then left her to go back to his ex wife. She could've said a lot worse.", "I feel this is a grey area, it does not sound like there was anyone from his side of the family at the hospital to support him we do not know why. If he wants her there as a support person while his child is being born especially given there were complications that seems reasonable. I can understand that she would be unwelcome by most people on the mothers side but the only people who matter here are the parents and had she stayed away from the mother I would think it was a reasonable compromise. If something awful had happened he would need someone there for support, at the very least it sounds like he was in no condition to drive himself there", "Don’t pee on my leg and tell me it’s raining!", ">I do wonder how toxic she actually was. What OP and her boyfriend/ex did was pretty damn toxic…\n\nOne of the most important lessons I learnt from my own most toxic ex, was - it's not the \"other woman\" who is toxic. Regardless of gender, it's the cheater or the one who wants to \"keep their options open\" and tries to return to you that is toxic. Every damn time. And they're the ones telling you the other person was toxic... Hmmm... I wonder why. \n\nLike I said, I had to learn this through experience but I never got to the stage of turning up in a fucking delivery ward! This is next level! Now, nearly ten years on, I'm in a happy relationship, and I pity the people my ex cheated with and then abandoned to come back to me when it felt convenient for him, but not in a condescending way, in an \"I'm sorry he fucked you over too\" way. \n\nHopefully OP learns this eventually.", "Why is he called your boyfriend after you say you're married but called your husband when he's having a child with another woman? Bad writing is bad. \n\nYTA.", "Yeah YTA - you had no right going into her hospital room and attempting to make small chat with her after her emergency c section.", "YTA - you should have stayed in the waiting room. It’s ok to be there for your partner but this was his ex’s medical event and you didn’t have a right to be in the room without her consent. You should have given them space.", "YTA. Not appropriate at all.", "Yes YTA big time. The mother is the one who needs the support during the labor and delivery, and the father is the one who's supposed to be providing it. Definitely not your place to be there.", "YTA\n\nYou didn’t want drama - yeah right. As someone with 3 kids you knew better. You even said she was doped up. You both took advantage of a woman who is drugged up who just gave birth? \n\n\nThat mom is gonna come at you guys for every penny and she deserves it after this bullshit.", "It sounds like you might actually he the toxic ex, not her. YTA.", "I could see staying in the waiting room being okay but that’s it.  You now have to decide if you want to be with you ex enough to deal with this kids mom because from the looks of it she is going to be a issue.", "ESH\n\nSupporting your bf was fine but both of you should have had the presence of mind to have you wait outside.\n\nThe ex should have been mad at your bf rather than coming after you.", "NTA - but you and her are gonna have to get over this bullshit.", "ESH.  That witch is going to be a part of your life forever…….I hope he’s worth it.", "I’m going to say NTA. This is ridiculous and I highly doubt any of these people have kids but let me tell you something I learned in state mandated custody training you take when you file for divorce or custody. The child comes first. You already have three kids with this guy. That is your children’s half brother/sister in there. Even if you weren’t together, you’d have to coparent with your ex and her if THEY were together. You can not control your ex, their partners, or anything in their life and it sounds like she wanted to. If you and your ex stay together, that’s your step child. Sounds like you were there for him, and if that’s true you’re Nta. Now, if you’d burst in with a worlds greatest stepmom shirt on demanding to take selfies, that’s different.", "YTA", "YTA Everyone involved is yuck but you're the most yuck here.", "Of course YTA and I don't see how you need someone to explain this to you.  I bet she dumped him and he manipulated you into taking him back because living with you is more cost effective than trying to support three households- his, hers and yours.  You two deserve each other and the woman that gave birth is  better off without him.", "YTA\n\nThere's no way for you to be anything but the asshole here. You don't get to show up to someone's emergency medical situation without being explicitly invited. \n\nAre you deliberately trying to sabotage your boyfriend's relationship with his new child? Because this is how you do that. \n\nStaying for a few hours, making 'chit-chat' with a heavily drugged post-surgery patient...\n\nI wouldn't be surprised if this shows up on AmItheDevil.", "YTA \nBeing in the waiting room to support your partner is fine.  Going anywhere near the birth mother, her family or the baby was completely out of line. Your partner is an AH, too. He should have known to keep you in the waiting room.", "YTA\nApologize and move on. You did not have to be in the room while she was going through all that. \n\nThis woman is going to be in you and your husbands lives for a long time. It’s better to make peace than to be right.", "YTA. There was no reason for you to have been where you were. You've had three children, you should understand the intimate nature of birth. You were out of line, and very rude.", "You don't know that she was abandoned or why they broke up. He could have had valid reasons. Letting her into the room was an asshole move though.", "Showing up to the hospital was fine, going to her room was not.", "How is the mother toxic exactly?", "No he isn't the patient he doesn't need a support person.", "The mother got pissed when OP and the ex got back together, it might not be as egregious as OP and the ex, but it's definitely toxic— it's not really her business to be concerned about.", "Wait what? Oh yes, all those people in hospitals with dying loved ones don’t need support, only the patients…\n\nI agree that OP should have stayed in the waiting room far away from sight.", "He'd have needed support if his child had died.", "Father's need support just as much as mothers during birth. I had normal healthy births but emotions and everything were still high for my husband, especially after my one labor that was 19+ hours. I can only imagine what he would need if i had complications that deemed an emergency c-section necessary. Men are allowed to have emotions and need support too.\nHe dropped every thing to go to his child's birth, regardless of his relationship with toxic baby mama.", "YTA and damn do you have a lot of nerve to call someone else toxic. I think everyone here knows exactly who the toxic one in this situation is.", "Going to support your husband, 100% understandable. \n\nGoing into that room, 110% YTA.", "You are either malicious or have spectacularly poor judgement. And either way the harm is the same. YTA. You had no business going into the *hospital room* of someone recovering from *emergency surgery* without their express permission. You should have stayed in the waiting room while your partner met his new baby.\n\nI actually cannot believe the hospital let you in to her room.\n\nIf you and your ex-husband/boyfriend are actually going to stick it out this time you are going to be *coparenting* with this woman. And you started that relationship by being invasive and inappropriate.\n\nYou owe her an apology. And patience if she decides not to get over it.", "YTA. And pretty much how dare you? 😬😬 you really, really had no right to be there.\n\nTHEN. THEN!! When she texts you, you can’t just be a bigger person and say “I can see that I’ve upset you, and that was never my intention. Not a problem - I’ll stay home. Wishing you and the baby well.” \n\nYou argue!?! This lady just had a traumatic birth. Her hormones are reeling. Take many steps back, ma’am.", "This all sounds terrible. Girl you should’ve stayed in the waiting room or maybe even the car. No right to go into her room at all! YTA", "UTA big time", "YTA\n\nHow would you have liked it if your ex was still with his gf and brought her to see you vulnerable just after giving birth? You keep saying you were there for him, but you completely overlooked her, the actual patient. Say sorry and stay away from her. And your ex or current bf or whatever he is, is being a great big dick too, bringing you there and planning to do it again.", "I agree they need support, but it is certainly not just as much. Only one went through medical trauma.", "You are the BIGGEST AH. You wanted to stake your claim to your second hand husband and it is disgusting that you went into the room. You’re not fooling anyone with your innocent bambi act", "Yta. How could you not be?! You showed up in her room after a traumatic birth. Jfc. Even if it wasn’t it you’d still be TA", "You're no saint OP. You yourself said she wasn't happy with you both reconciliation and yet you went there. Idk what emotional support he needed the support who needed the most was the mother who was giving birth to his baby. \n\nYTA", "YTA.  She did not give you permission to be in her room before during or after the childbirth.  Therefore, you should have stayed in the waiting area or gone home. \n\nI am STILL salty AF that my ex brought his sister to our son’s birth without any prior discussion.  Just because my sisters and friends were there did not give him the right to invite anyone else.   Our son is 21 and I am still angry about it ,as it was such a violation of my privacy.", "YTA That sure was some flex you did to her.  It was HIGHLY inappropriate and completely wrong to force a woman, to after just giving birth, to tolerate you being in her room. You sure wouldn't want it done to you, and you know it", "YTA. \n\nShe was in a vulnerable condition and you had no right to be there. She didn't want you there and didn't give you permission. If you want to support your whatever (your post is confusing and your relationship even more so) then that is what waiting rooms are for. You did not have to set a foot past those doors to support him. Maybe keep your distance from her so that your whatever can develop a co-parenting situation for his child without the step-mother forcing her way into situations she shouldn't be in.", "You really didn't mean to. But you did make an asshole move. You should have known the feelings from his ex weren't kind to you. And she wasn't in a state to advocate for herself. \n\n You should have come to the hospital for your husband to calm him down during everything. But you should never have entered her room.\n If your husband had needed you, he could have come back to you in the waiting room. Now you (unwillingly) distressed the mom who had a very difficult time as well.", "YTA. Google boundaries OP. You're gonna need to put them on yourself.", "There is nothing more pathetic in this world than women fighting for a man!!!!\nYTA\nHe is going to leave you again one day.", "Yep. She’s only getting his side of the story while he’s tom-catting all over the place", "Such as?", "A couple of people are calling the new mother toxic. They sound like they like drama too", "Uh huh. When my daughter had her last child, my son came to her closed door and knocked. The nurse inside asked who he was then asked my daughter if it was ok. And she had a normal birth", "Second hand is right", "Boyfriend/ex/back to him being the husband", "His CHILD was one of the patients. He absolutely had the right to have support there. She should have stayed in the waiting room but there was no reason he should have had to be there alone.", "YTA.. completely and absolutely. In fact you make me feel nauseous. You also describe this woman as “toxic” I can tell you without a shadow of a doubt you and your vile husband are the toxic ones. I really hope he gets you pregnant and brings his next gf to see you in the hospital post partum 😂", "YTA", "YTA. You don’t go into the room unless you are invited.", "Of course YTA. You should have kept your butt in the waiting room. All you're doing is causing drama.", "YTA this whole thing is nothing but drama!", "YTA. And you're lying about not wanting drama because YOU did not behave like someone who doesn't want drama. You have THREE children which means you've experienced multiple childbirths. Would you have wanted the woman your child's father left you for there? While you're feeling exhausted and vulnerable from having gone through that ordeal? I highly doubt you would have and the fact that you couldn't show this woman that level of compassion makes you sound mean and petty.", "YTA go to the hospital but you should have not gone into the room and I am surprised anybody let you.   I suggest you are insecure and worried he will suddenly bond and want to be with her, which I can understand but the way you handled it was giant AH.   You just had to ensure she knew you were his priority, you just had to ensure that you stepped over her boundary.  The fact that he bought you into that room shows he is massive AH as well.  It is not his decision on whom can enter her hospital room she is not his belonging.  \n\nHis thought should have been his child, his thought should been thinking of a healthy co-parent.  \n\nHow do you know that had split up his word yes ha ha.", "YTA. Sorry but you are. You could’ve stayed in the car if you needed to drive your husband to the hospital. Her birth sounds like it was very traumatic and now she has the added pain of having a stranger, someone she didn’t give consent to be there in the room while she was recovering from major surgery and still under medication. Not to mention you saw her baby before she did. Nothing about what you did was ok and you know it. You just went to assert your place in his place and make sure she knew it. You’re lucky I’m not her family bc you would’ve been kicked out of the waiting room from the start.", "If you went in and actually saw the baby, YTA. You can support him by driving him there, getting him a coffee etc while you're in the *waiting room*. You didn't have any business seeing her, or the baby, when she had just had a traumatic birth and probably just wanted family around.", "Genuinely asking, how is the ex the witch here? We have no idea how toxic she really is, and OP inserted herself into the recovery room of a woman who had just had emergency surgery and met her baby before she did. She has very right to lash out at OP.", "This."]}