{"id": 22603, "submission_id": "153elg9", "title": "AITA for telling my cheating wife’s other man’s wife about what was happening?", "selftext": "Long story short, I had reason to think that there was something going on behind my back, so I checked her texts. Between her and my step daughter, they were talking about a man that she has carpooled with for about two years. It started off saying that he was so depressed after she stopped talking to him for 3 days, that he got really depressed and lost 7 lbs in those 3 days. My stepdaughter said “that would be cringe, if it weren’t for the relationship you guys had, that’s cute”. \nMy stepdaughter then told her that if he makes her happy, she should go for it. My wife then said there’s too much at stake with our 4 year old son, and the house we own together. She said that they met at the wrong time, and maybe down the road they would get together. \n\nI was absolutely devastated. I texted her and told her that her bags were packed, she needed to find another place to live, and that our son would be staying with me. \n\nWhen she got home, we talked about what happened, and she admitted that it was an emotional affair, but nothing physical happened. She has been feeling depressed for some time, and liked the attention that she was getting from this man. Things that night ended rather amicable, and we agreed that we would go to counselling and work on our issues. \n\nThe next day, I wanted to hurt this man who was trying to get with my wife. I wanted to make sure he would stay away. I went to his house (got address from a mutual friend), not sure who I would find. His wife was sitting on the porch and I explained the situation and showed her the pictures of the texts I took. We talked for awhile, and I left. \n\nMy wife called shortly after and I told her where I went. She came home angry that I disrupted her work life. She said that people would talk. She felt like this was a direct attack in her in retaliation for what she had done. I told her this was not my intention, but that I wanted to hurt him and keep him away. She has decided that I was too spiteful and petty just to leave things how they were between us and has begun looking for apartments. \n\nI did want her to feel like there was consequences for cheating, but I did not intend to ruin her reputation at work. \n\nAm I the asshole?", "created_utc": 1689724277, "permalink": "/r/AmItheAsshole/comments/153elg9/aita_for_telling_my_cheating_wifes_other_mans/", "score": 445, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > She feels that I was acting spiteful and petty for telling the other man’s wife about what was going on. I don’t disagree, but I never meant for her to face any backlash at work.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  That woman had a right to know.  Your wife is just pissed she got caught and had consequences", "NTA it sounds like she was just going to stick to the plan she already had until you let the cat out of the bag.", "\"I was caught cheating, lets get counseling\"\n\n\"You talked about it?? IM LEAVING\"\n\nWhat the fuck? Doing it and telling about it arent even on the same plane of equivalence..\n\nNTA", "NTA\n\nI would have paid to take out a full page ad exposing them in the local paper.", "NTA. She ruined her own reputation by being a trifling b*^ch.", "NTA maybe is she wasn’t cheating you wouldn’t have done it. Sometimes people need to be shamed to realize the hurt they have caused.", "NTA his wife has a right to know. \n\nCan you really trust your wife when she said it was only an emotional affair?", "You are NTA. She's a cheater looking for a reason to leave you. You gave her one, because you freed up her other man. Hang on to all your texts, you might need them for court.", "NTA you did the right thing letting the other wife know their partner is a cheater. Also your wife is most likely lying about it just being emotional, she’s trickling the truth to you. She was willing to cheat on you before, don’t be fooled that she won’t be willing to lie to you now. The fact that she can’t own up to her actions and is now trying to make you the bad guy shows she hasn’t learned anything and isn’t actually sorry", "\"... and maybe down the road they would get together.\" \n\n'Nuff said right there. \n\nShe didn't cheat cause there was \"too much to lose.\" Not because it was wrong. Yuck. Sorry... very sorry. \n\nLet her move. They got the bill for what they ordered.  NTA.", "If she can have an emotional affair with the husband, surely you can have a conversation with the wife. It's not like you went to your wifes work and made trouble.\n\nConsequences suck alright!", "Nta. Sounds like she's more upset everyone knows how nasty they are.", "NTA. \n\nIf my husband was carrying on having an emotional affair with someone that was so intense that he lost weight, I would want to know. You did the right thing. Hopefully you and the wife of that man can move forward with your lives and heal. As far as the cheaters go, karma has its kiss for them.", "NTA the wife deserves to know too", "NTA. Her choices are the only thing hurting her, you did nothing to her reputation. Not your fault she acted trashy and people are going to find out about it.\n\nSorry you are suffering, op. It is going to be tough, but stay strong. Soon, you will turn the things around. Let the wife go and start over with better people in your life.", "NTA. Her husband was cheating, or at the very least trying to cheat. His wife should know this so she can act accordingly.\n\nCounseling won't fix it. She didn't even feel shame in her behavior as she was openly sharing it with her daughter. She is a cheater and will always be one. You'd have to be incredibly naïve to believe it wasn't physical. Move on dude. Don't try to get her back. Keep the evidence for court so you don't get bent over too badly in court.", "Emotional affairs are worse than a fling. I would know. \n\nHis wife deserved to know, but you're being disingenuous if you think this wouldn't piss your (future ex) wife off. \n\nAlso, now they're both free to continue with their relationship. Keep records of all your communications, you're gonna need them for the divorce settlement. \n\nNTA, but man...your stepdaughter is also something else. Apple doesn't fall far from the tree I suppose.", "King.....her and stepdaughter's choices had consequences....the trash is taking itself out.", "NTA.  She has a right to know. Zero sympathy here for cheaters.", "NTA FAFO", "NTA. You did the right thing. The AF's wife was in the same place you were in, and you gave her the ability to make an informed choice the way you did. \n\n>She has decided that I was too spiteful and petty just to leave things how they were between us and has begun looking for apartments.\r  \n\r\n\nSo your wife cheated on you (an emotional affair is still an affair), and she's so angry that it might negatively affect her in any possible way that she's moving out? I think you should call a divorce lawyer. This marriage isn't worth saving, and your live is wasted on this woman.", "NTA.  She did this to herself.  If she thinks no one at work knew already then she is blind.  I can guarantee that work was already talking.", "“I did want her to feel there are consequences for cheating.” \n\nYes, there are consequences. But, she was hoping to rug-sweep the whole thing so she did not have to face the consequences of her choices. \n\n“I did not intend to ruin her reputation at work.” \n\nYOU did NOT ruin her reputation! SHE ruined her reputation by choosing to have an affair! \n\nThis is a woman who has lied to you, who has disrespected you, who has been having a relationship with another man, who felt it appropriate to involve her daughter in the cheating, who is trying to blame you for her facing the consequences of her choices, and who is not remorseful or taking responsibility in any way for the choices she made. \n\nNow that she may face consequences, she is acting out, blaming you, and angry at you. She will have a more difficult time continuing the affair now that his partner knows, and is likely afraid the AP may choose to stop the affair and stay with his wife. She is upset by the possibility of losing him, not by the threat of losing you. That should be all you need to know. None of this is your fault!", "I’m lost, it seems they met via a carpool? Does he also work with her or something, or does this dudes wife just happen to work for her, how does this ruin her work reputation, even though of people find out she’s a cheater that’s still ultimately her fault/responsibility. \n\nEither way if that’s what made her decide to leave then I assume she was just going to keep seeing him in secret still, because this just doesn’t add up. That doesn’t seem like the reaction of someone who is apparently “sorry” and trying to regain your trust. \n\nIt kind of sucks that she’s apparently also raised her daughter in the same way, so now it’s more than just her, but it is what it is I guess.", "NTA.  An emotional affair is far worse than a physical one.  You lose their love.", "NTA I would want to know if my husband was cheating.", "NTA- “I disrupted her work life. She said that people would talk”\n\nCode for : Now that everyone knows ,we won’t be able to keep messing around .\n\n\nShe never intended to put a stop to things OP. And she’s only with you because “there’s too much to lose”.\n\nI wonder if the other dude still plans to be with your wife now that his wife knows .\n\nThey deserve eachother .", "NTA. She was already thinking of leaving.  The road to hell is paved with good intentions!\n\nShe played a stupid game and lost.", ">She said that people would talk.\n\nCheater: *Does something shameful.*\n\n*Shameful thing gets found out and people talk.*\n\nCheater: Surprised Pikachu\n\nAmazing how these people feel no shame in the act but suddenly discover morality and decorum when they get called out. NTA", "NTA, cheaters gonna get what they get", "NTA - his wife absolutely deserved to know that her husband was having an affair. She now gets to decide her future with or with her cheating husband.\n\nYour wife is just mad that she has to face consequences for her own choices. You also likely just cut her off with her affair partner, which means she was in false reconciliation with you. She was probably trying to see if there was a future with AP while keeping you thinking she was working on the marriage. The fact she was sharing her affair with her daughter means you should be planning your exit.\n\nQuestion - how did this wind up ruining her reputation at work? Did his wife work with her? Or did her AP?\n\nOP contact some lawyers and get divorce/custody started asap.", "She wanted to make peace with you for the subsidized accommodation, while still keeping her boyfriend.  The fact that her daughter is in on it is gross and even more disrespectful to you than \"just\" an affair.  Spiteful and petty?  Who gives a shit--she earned it.  This would have gone nuclear at some point down the road anyway, so better to cut your losses and move on.  NTA", "Not even close to the AH. She’s mad you blew up her game. No doubt she intended to keep him handy just in case.", "Pretend to get along and file for divorce first", "NTA. Fuck your wife's reputation.. she didn't care about your reputation or the reputation of your marriage did she? Leave her..", "Nta\n\nLol", "NTA. \n\nIts best she went out herself. You already lost her at carpool. And your stepdaughter is even siding with the other guy.", "NTA\n\nIt’s even messier when both cheaters are married. The other innocent person deserved to know. \n\nI don’t understand how you messed with her work life and why people would talk about it since you talked to the wife at her home. If the paramour goes around blabbing about it or acting crazy that’s on him\n\nThey shouldn’t have picked workmates to cheat with if they were so concerned with appearances", "NTA.  I get your intention was to hurt this guy but you ended up doing the right thing by telling the other betrayed spouse.  If she would have found out before you, you would have wanted her to tell you.\n\nAs for your wife, I think it's telling that she got upset at you for exposing her cheating partner, it tells me that she's wasn't really wanting to reconcile to begin with of she couldn't take responsibility to come clean herself.", "NTA - the wife deserved to know.  There's an old saying here about workplace relationships \"Don't screw the crew\".", "NTA - her actions resulted in these consequence. The wife deserved to know and whatever consequences happen after she finds out is on your wife and her husband. \n\nMy manager always used to say you don’t you dip the pen on the company ink because when you do shit gets messy. \n\nShow your wife this point is she’s so convinced that you’re petty. She’s an AH that willing threw things away and it willing to disrupt her 4year old child’s life because of her selfishness.", "NTA. The wife had a right to know. Any blame here falls squarely on the adulterers. Be prepared for her to try to come crawling back if the AP won’t leave his wife.", "NTA. She’s upset she can’t just smooth things over with you and continue her behaviour. She’s really upset she now has to deal with people knowing. I think perhaps your impulse to hurt him wasn’t chill- it’s your wife who broke a promise to you- but telling a cheated on partner is pretty much always fine.", "There’s no fixing a relationship with a cheater", "You are fine. You are not the a******.", "NTA. You wife sounds like a narcissist. It’s now your fault she had an emotional affair because how dare you be honest with the other spouse!!", "NTA, the other guys wife has a right to know. So what if you wanted to hurt him, he cheated on his wife, so now he has to live with the consequences.", "NTA, they both suck and deserve to face the consequences of their actions.", "you did the right thing", "NTA she cheated, not you", "She’s the asshole. Cheaters are cowards.", "NTA, I'm sure everyone at work were already talking about them.", "NTA.  The wife deserves to know and you didnt ruin her work life, she ruined it herself.  Your intentions are a little sketch (you wanted to hurt him), but ultimately she deserves to know the truth.", "NTA. At all. Of course she deserves to know and make her own decisions. These are the consequences of cheating. Hopefully it does follow them to work (I’d be telling there too).\n\nAnd, I’m sorry. Why do you believe it’s only an emotional affair. That’s almost worse. And the fact that your step daughter is aware? You’re second choice based only on your son and finances.\n\nYou deserve to be happy and in a healthy relationship with someone who is a full partner.\n\nFile first for divorce so you control the process and narrative. You can serve her at work and name him;)", "You’re not the asshole. I literally caught my husband in an affair on Sunday night. We have been together ten years. We have a two year old son. I don’t want our son to grow up in a broken home. There no way out of the situation but through it if you want to keep your marriage intact. Definitely the more difficult choice and the end result might not be pretty. My first move was to call his mom and my second was to protect the roof over my baby’s head. Save all messages/pics/videos to an iCloud SHARED Album (privacy and securities are different and you don’t have to “share” it with anyone, just skip that step in setup). If you have alienation of affection and criminal conversation laws in your state it might be something you want to look into in the future, maybe not now when you feel so raw. Statute of limitations in NC is 3 years. The law exists in like 7 states. I don’t know where you’re from, OP, but good luck to you and take some time for yourself to process. It’s a shitty shitty road.", "NTA. She disrupted her work life by having this emotional affair. Not only that, but the other partner deserves to know what her husband was doing. Actions have consequences, this being one. It's not like you made a scene at her job. Best of luck and well wishes to you in this situation.", "NTA. She was cheating, and the husband she cheated on you with was also cheating. His wife deserved to know", "NTA you wanted to know, I would want to know too. Thank you for giving her all the facts so that she can make an informed choice about how she wants to proceed.", "NTA", "NTA", "Haha, your wife is getting what she deserves. Hopefully her coworkers call her a whore behind her back at work.", "Lmao dude she cheated on you you are the A hole for believing her", " NTA lol u blew up her road to freedom prote t your son \nNaje sure u cut the step daughter off \nAs well.\nGood luck", "All the ESH people suck.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong story short, I had reason to think that there was something going on behind my back, so I checked her texts. Between her and my step daughter, they were talking about a man that she has carpooled with for about two years. It started off saying that he was so depressed after she stopped talking to him for 3 days, that he got really depressed and lost 7 lbs in those 3 days. My stepdaughter said “that would be cringe, if it weren’t for the relationship you guys had, that’s cute”. \nMy stepdaughter then told her that if he makes her happy, she should go for it. My wife then said there’s too much at stake with our 4 year old son, and the house we own together. She said that they met at the wrong time, and maybe down the road they would get together. \n\nI was absolutely devastated. I texted her and told her that her bags were packed, she needed to find another place to live, and that our son would be staying with me. \n\nWhen she got home, we talked about what happened, and she admitted that it was an emotional affair, but nothing physical happened. She has been feeling depressed for some time, and liked the attention that she was getting from this man. Things that night ended rather amicable, and we agreed that we would go to counselling and work on our issues. \n\nThe next day, I wanted to hurt this man who was trying to get with my wife. I wanted to make sure he would stay away. I went to his house (got address from a mutual friend), not sure who I would find. His wife was sitting on the porch and I explained the situation and showed her the pictures of the texts I took. We talked for awhile, and I left. \n\nMy wife called shortly after and I told her where I went. She came home angry that I disrupted her work life. She said that people would talk. She felt like this was a direct attack in her in retaliation for what she had done. I told her this was not my intention, but that I wanted to hurt him and keep him away. She has decided that I was too spiteful and petty just to leave things how they were between us and has begun looking for apartments. \n\nI did want her to feel like there was consequences for cheating, but I did not intend to ruin her reputation at work. \n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA your wife sucks not reading story divorce her ass and leave her with nothing", "NTA. Wish my X GF husband would have came to me, instead he contacted me during my divorce and helped with information ( their canoodling) everyone knew but me. 2 kids and 15 yrs. Guess what , actions have consequences emotional affairs ( bc that’s what it is , stealing time from a marriage) are affairs", "NTA. I'm sorry, OP. You deserve better.", "She trying to flip the script on you.. (you've done no wrong)  if she wasn't pursuing other dudes.. this wouldn't of happened.  Actions have consequences.  Sorry bro, I would consider her gone if I was you.  Don't bother reconciliation,.. you're just going to drive yourself crazy thinking that the other guy is at her new apartment.. and he will be.  Time to split", "Nta, she wasn't planning on stopping but didn't want to lose her sugar daddy", "NTA, in the older days you would have beaten him to a pulp , would she have preferred that ?   Why is she prioritizing his feelings at this time? Shows where her loyalty lies.\n\n* is his wife hotter?", "Honestly you didn’t do it because she had a right to know. You did it out of spite. That’s usually going to be the wrong reason for doing anything. \n\nIdk long term the right answer but it feels like you did it to rip the bandaid off fast. That’s your choice but it’s not a great look.", "You should visit r/AsOneAfterInfidelity", "NTA", "NTA", "Sooo your wife caught feelings for someone she was carpooling with then ceased communication. You too mutually decide to seek counseling in order to get to the root cause of whatever had left her feeling depressed and subsequently leading her to develop feelings outside the marriage. Is that the jist if itt? \n\nUnless there were other communication/meetings external  to car pooling and work, yeah YTA.", "ESH…. Obviously. She’s a cheater…..You know who goes to someone to beat them up because they’re mad?  9 year olds.", "I don’t think you intended to be TA, but I also don’t think you thought through the repercussions of what the result would be.\n\nI’m not excusing what your wife did, but you now have to live with consequences of what you’ve done.\nYou had a chance to keep it private between you and your wife, to go to counselling and make your marriage strong..What you’ve done instead is ruin your wife’s reputation at work ( which is unlikely to recover ) simply because you wanted to hurt someone else.\nWomen rarely get off lightly when an affair, whether physical or not, is made public.\n\nOh well it’s done now, good luck.\n\nESH", "[deleted]", "ESH except possibly the other guys wife.", "NTA.  But I’m not much for blowing up other families, especially when nothing has happened yet.  If you want to save the marriage you need a good councilor and your wife will need to stop carpooling or preferably change jobs.", "*”I did want her to feel like there were consequences for cheating, but I did not intend to ruin her reputation at work.”*\n\nThat’s not the entire truth tho. You also say that you “wanted to hurt him and keep him away.” \n\nESH", "NTA you gave him exactly what he deserved although I think it'd be a pretty funny twist if you and his wife hit it off and got together", "YTA not because of WHAT you did but WHY you did it.", "ESH. You should have packed her bags and stuck with kicking her out and moving on. Instead, you lashed out and hurt everyone out of spite. That man’s relationship with his wife is none of your business. Leave your cheater and move on.\n\nYou’re both being terrible role models for your 4 year-old.", "ESH it seems a little over the line to show up at their house. While your wife was very much in the wrong, taking this step doesn't make it feel like you're invested in trying to move past what happened because you did just mess with her job. Which is going to further impact your relationship since she sees it as retaliation when the plan was to try and salvage things.", "[removed]", "NTA. She’s reaping what she’s sown. It’s only right that his wife knows as well.", "Lol! So strictly speaking the want for revenge is kinda a A H move, but I really love that you didn’t try to say “I went over cause I felt his wife deserved to know” you get double points from me for the honesty\n\nNTA", "NTA, she’s trying to turn this shitty situation back on you rather than taking responsibility for her actions.", "NTA", "So she’s upset that there were consequences to her and her APs actions??\n\nNTA - there was someone else being effected by what was going on, and as two liars, it’s doubtful they would be truthful with her.\n\nI do however want to pull over for a moment, because while this is new and I get the snap decision making somewhat, you need to decide if you’re actually willing to forgive her. If yes, you have to eventually get back to a sustainable sense of trust. *But if you know you can’t, then let this and her go.* You’ll never be able to punish her enough, and ultimately you’ll be punishing yourself.\n\nI am very sorry.", "NTA", "NTA. She cares more about office gossip, more than she cares about her husband. I’m sure work husband will be weekend boyfriend in 2 months.", "You went scorched earth on the emotional affair partner. Yes, that's going to stir up even more drama between them since they work together. I don't know what you were expecting to happen here...\n\nYou're more dumb than an asshole.", "NTA - You’ve done nothing wrong. They’re just reaping the consequences of their own actions. And on the light scale of consequences I may add. There’s nothing you could or would do if nothing had happened.", "NTA, and I would file for divorce on her. I also seriously doubt that they never got physical.  She had a right to know, and the problems in your marriage were her problems that she never shared with you.  You ruined her secret affair, and she wanted to continue and protect him.  Talk to an attorney and get advice.", "NTA-she deserved to know.", "Let me make sure I understand this correctly she is angry because people going to talk at work about what you did but not the fact that she was cheating with a married co-worker. NTA get rid of her", "Why does this sounds suspiciously familiar?", "> he got really depressed and lost 7 lbs in those 3 days.\n\nLol. This had me in splits. You were absolutely right in informing his wife. Your wife needs to accept the consequences of her actions. She just can't hope to get away scot- free and come out smelling of roses.\nNTA", "NTA - wedding vows are sacred. Even emotional cheating is cheating!", "NTA. You did what any person who’s tangled involuntarily in an affair would do. You told the cheaters spouse that they were being cheated on. If I were in her position, I’d be grateful you made me aware of what was happening. I’d also pack all their stuff and set it out by the curb with a sign that says “needs new home, free to grab” because if they want to share themselves with others, they get to share everything.", "NTA, his wife had just as much right to know as you did.", "Not an asshole, but…\n\nWhile it is understandable that you were hurt and wanted to hold the other man accountable, intentionally seeking him out to hurt him and disrupt his life can be seen as spiteful and petty. It is important to remember that your primary focus should be on resolving your own relationship issues rather than seeking revenge. Additionally, it is important to respect your wife's  boundaries and feelings during this difficult time. Going forward, it would be beneficial for both of you to continue seeking counseling to address the underlying problems in your relationship.", "She thought counseling meant she could get away scot-free with her affair, so long as she pretends to have changed for a year or two. She's angry at OP because now she might have consequences for her actions.", "Emotional cheating is at least the same as full on affairs. Time for divorce,  you can never trust her again.", "I’m much pettier. I would have targeted ads at her, him, and anyone I could identify who was associated with them on all the social media platforms for a week so they were all they saw.", "And even if it was just emotional it likely would have escalated at some point regardless if it hadn’t already.", "She had the nerve to stay with OP as a placeholder until she could do something about her new romance!", "Yes.", "I’m sorry, I didn’t see where he did anything to ruin her reputation at work. He talked to the guy’s wife at their home. If the wife says something to the workplace then that’s on her. It’s obvious his wife wasn’t really serious about working on the marriage, the very first step would be distancing herself from the other guy, which would affect her work. Long story short he was able to work past a huge fck up and she’s running for the door after a tiny one. It was already a done deal.", "The only way her work would know is if her or her partner talked about or if the wronged wife showed up... NONE OF WHICH WOULD BE OPS FAULT.\n\nReap the future you deserve. NTA.", "Not exactly his repercussions to deal with. It’s funny the wife is mad now that OTHER people will talk about it. \n\nIf you were ever cheated on, you want to know. Most people have that reaction.  Who knows if you have but MOST want to know. This man is not an asshole. He told someone the truth about a situation that their spouses dragged them into. She deserved to know. \n\nWho was gonna handle it? The ones that emotionally cheated? Emotional cheating is sharing secrets and telling things. I guess wife doesn’t like the taste of her own medicine because now people are talking about HER. \n\nShe did it to herself OP IS NTA", "What? He told that man’s wife that her husband was cheating. She had a right to know and he deserved having “things ruined for him” because he was trying to cheat.\n\nThis is not an example of “hurt people hurt people.” A true example would be something like an abused child bullying other children, NOT telling someone that they’re being cheated on.\n\nShe probably planned to get with him after OP and that’s why she’s mad.", "… even if his intentions were not pure he was absolutely in the right to tell the other wife.", "How does ESH? The dude had the wrong intent: wanting to “hurt” another person, but the wife should definitely be in the loop.", "Ummm it's already happened.  Doesn't need to be physical to be cheating, and the wife was already considering leaving \"down the road.\"", "He didn't ruin her reputation, if her reputation suffers for her actions she ruined her own reputation.", "Wrong. But thanks for your time. Cheaters cheat. As such, the only way to ensure one's own sanity is to remove yourself from the situation entirely and let everyone know why.", "Exactly what should happen. So he gets a free pass. You suck just as much as him.", "The Romeo's wife should know that he's supposedly loosing weight over other woman...", "So the side guy's wife doesn't deserve to know she was being cheated on? Hell's wrong with people?", "Are you kidding me. He king flexed and you suck.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yeah and people must be missing the part where she said if it wasn't for the 4y.o. son and house she would have left with the guy...that shit is past cheating to me ..I wouldn't need counseling for that because we would never work it out when your just counting down the time", "OP should have followed his first instinct. \"Your bags are packed. You need to find another place to live. Our son stays with me.\"", "\nHe obviously wanted to save his marriage, but now that may not happen, so that’s on him.\n\nYes, she did this to herself which is why I said ESH", "1. Never said she didn't have the right to know or shouldn't be told. I asked if it felt good doing it. Those are 2 different things. \n\n  \n2. He literally said: \"I was absolutely devastated\" and \" I wanted to hurt this man\" and \"I did want her to feel like there was consequences\" so I'm OK with what I said.", "I guess you didn't understand my comment. Have a good night!", "That's what I'm saying, she is the only one who AFAIK didn't do anything wrong.", "I'm with you.  Relationship over at this point.", "Yes. Because people who don’t agree with you must not understand your vast profoundness. Got it."]}