{"id": 22622, "submission_id": "153i4nl", "title": "AITA for giving my son's car away", "selftext": "My son(17m) has been dating my friends daughter(18f) for the last couple years. Their relationship has been solid and their relationship started getting pretty serious. Last month my friend called me and he was upset because my son had cheated on his daughter. I was taken aback and thought there had to be some kind of misunderstanding. \n\nMy son tried to explain that everything was a lie and she was just trying to ruin his image. I initially believed my son and went to go and confront my friend. At this point, his daughter showed us an entire folder of evidence against him. It looked really bad and I went home ashamed to even show my face to them. \n\nMy son eventually admitted that most of what she was saying was true. I also pulled up the text logs from our phone provider to check the validity. I put off dealing with the situation as I had to travel overseas for work and didn't have time to investigate this. After I got back in town, I decided that I would take away the car that he had gotten on his 16th birthday. I decided to gift the car to his ex and I contacted my friend to fill out the paperwork. \n\nHe agreed on a time for us to deliver the car and I made my son come with me to hand deliver it. When we got to my friend's house, his daughter had her new bf and a few friends over. My son begged me to not make him give the keys in front of all her friends. I didn't really care and wanted to make sure he was shamed for what he did. He is complaining that this ruined his life but that was kind of the goal. He can no longer drive to work so he had to quit his job. He doesn't need the money as I pay for everything. He will have to wake up an hour earlier for school to catch the bus and he has to wait an extra hour to catch the bus back home. I wanted to show him what could happen if you cheat in a more high stakes relationship. AITA here? \n\n&#x200B;", "created_utc": 1689733783, "permalink": "/r/AmItheAsshole/comments/153i4nl/aita_for_giving_my_sons_car_away/", "score": 78, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I may be TA for giving away my son's car after I discovered he was cheating.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Yeah YTA. Humiliation and having him lose his job is not the way to go. This may destroy the relationship you had with your son. You and your friend should have left these 2 deal with it on their own, they are not little children.", "What the fuck is wrong with you? YTA a hundred times over. You're not a parent. You're a bully.", "YTA\n\nHe received the car as a 16th birthday present? I get that technically you would be the R/O but you gave it to him as a gift. \n\nThe ex has moved on from this relationship. You made your son hand her the keys in front of her new bf and friends. You humiliated him. This was not shaming him for cheating. This was you trying to save face with your friend.\n\nHe either learned his lesson about cheating by losing the relationship or he didn't.\n\nDo you seriously think in future relationships he's going to think, \"I shouldn't cheat on this person because I might have to give her my car.\"? Betray my girlfriend? 🫤 Find myself single? 🤷‍♂️ Give her my car as a consolation prize? Now that's a bridge to far!", "Yta. Extraordinarily so. WTF. This is your kid. Kids make mistakes. Way to ensure your kid knows you will never have their back and to hide any mistakes from you forever going forward. Never going to you for help or guidance. You are 100 times TA he ever was cheating as a teen in a teen relationship that was never any of your business to investigate or get involved in whatsoever. You stole a gift, intentionally humiliated him, etc. You never made any mistakes as a teen? What the hell kind of ungracious and sadistic arrogant person are you? You valued trying to impress your equally busybody friend over your own son. This could’ve been handled so much better, privately, with a real conversation about integrity and asking him what kind of man he wants to become. Then you stay the heck out of it. You should be his soft place to fall, the person he can go to when he makes mistakes and needs support to best learn from them. Your behavior was genuinely shameful.", "YTA cheating and lying about cheating is not ok. However, you and the other parents need to stay out of their relationship.  Teenagers are often stupid. They are figuring out how to be in a relationship, which means they will screw up. Make him go apologize in person? Sure. Give away his birthday present car???? Too much", "YTA and an awful parent", "YTA.  Gifting his car to his ex when she has a new boyfriend already?  Seriously?  Sounds like she got over it pretty fast.\n\nSure he was shitty with what he did, but this was not your business - it was their relationship, and his life - if he wants to be a shitty boyfriend he will soon learn that no one will want to date him - this action was more about you saving face for yourself, not for him.  If he is old enough to be in an adult relationship, then he is old enough to deal with his own messes.  He is still growing up - he will make mistakes, as we all did at that age.", "YTA. \n\nThis was not the way to handle a teachable.  Yea, your kid had shitty actions. Humiliation was not the move. You were supposed to be the adult here. You and your friend should stay out of children’s relationships.", "These are kids.  He was in a 2 year relationship at 17? Yeah this was never going to break cleanly but this is when you can make these mistakes and learn from them. \n\nBut you took an expensive present and made him give it to an ex in front of her new bf and her friends, at an agreed upon time which she (ex-gf)  purposely stacked to humiliate your kid. And you allowed it. He then had to quit his job and lose sleep to take public transportation? HE’S A KID. \n\nYou did this to save face with a friend that won’t matter in a few years anyway. And you broke and humiliated your son over something that could have been taught in a million other ways. You need to fix your relationship with your son, because in the end, it’s the only one that matters and you did everything wrong. EVERYTHING.\n\nYTA.", "YTA. Your sons relationship is not actually any of your business. Yeah, cheating sucks. But this is not the way you teach a kid.", "YTA for the bad fiction. Based on the completely evil protagonist here, I’m guessing you’re a teen.", "YTA. If the car was his birthday gift, giving it away was a duck move.\n\nAlso unbelievable that you got into his high school relationship; this isn't something to punish, it's something to talk about.\n\nOften people model the behavior they see.", "YTA.  While you can and should talk to your teen about why cheating is wrong, your punishment was over the top.  Public humiliation, taking away his property, taking away his ability to work, taking away his independence…that was a lot.  The punishment should be related to the wrong and proportional to the wrong, and this was neither.  You could’ve temporarily taken his keys and used your words to explain that if he cheated in a marriage, that could cause a divorce and the permanent loss of his security and possessions rather than the temporary loss of his punishment, instead you tried to make things as bad as if he’d cheated on a spouse in an adult relationship.  You’re supposed to teach your kids with lower stakes than if they make the same mistake with the rest of the world - enough to learn, but not permanent losses.", "YTA\n\nTheir realtionship is none of your business. Way to alienate your child.\n\nAnyways, you'd be a theif and a bad parent if I didn't think you were a straight up liar about taking their car and giving it to their ex. \n\nThe repercussions alone between those two would be terrible. If I was your son not only would I tell everyone about this but any time I saw the car I'd damage it.", " YTA you just proved to your son that your friendship was more important then him.\n\nYou didn’t teach him a damn thing other when push comes to shove you will humiliate him to make yourself look better. I hope like hell your friends daughter takes care of your ass because as soon as your son is able he will go no contact with you.\n\nYour no more than a bully! Congratulations this show of friendship to your buddy lost you the respect of your son!", "YTA.\n\nHe screwed up, and lost his girlfriend. YOU, on the other hand, have likely lost any hope of a good relationship with your son. You and your friend should have kept your noses out of their business, except to counsel each of your respective children on how to handle these situations later in life. You really, truly fucked up!", "YTA Why are you punishing him? He didn't cheat on you. It isn't any of your business.", "YTA . Your his parent your suppose to love him unconditionally. His messed up that’s true, but when that happens as the parent you’re supposed to turn it into a teachable moment and explain the impact of of his actions. \n\nHe’s a teenager he is going to make mistakes you need to be the safe place he can turn to in order to learn from them, you could have made him apologize to her, and grounded him for lying to you , cause it was their relationship and him lying to you made you potentially get in a fight with a friend but that’s about the limit of what he should be in trouble for. instead you went way too hard and now all you showed him was you don’t have his back, that you prioritize your friend over him and not to come to you in the future, cause you will publicly humiliate him without care for his feelings.", "YTA. Give it time. Because soon enough your son is going to cut ties with you and never speak to you again. What you did wasn't parenting. It was a BS move that has all the hallmarks of a bully. You humiliated him on purpose. What does that teach him other than the fact that his parent is an AS and that he won't ever be able to trust you again? As I can guarantee that he won't. So don't start crying when he drops you like a bad habit.", "YTA. Your son did an immature thing, and you gave away something that DID NOT BELONG TO YOU. (I mean, if it was a gift for his 16th birthday, it was his.) You irreparably damaged your relationship with your son to give a car to a girl that already had moved on with a new boyfriend. Who's to say she did have that boyfriend earlier, too? \n\nYes, he was an idiot to cheat. But you were an AH to treat your own child that way. Yell at him. Tell him he's a fool. Make him publicly apologize to her. But to take away a car??? That is too much. Ridiculous. You care more about shaming your son than about teaching him what love looks like.", "YTA", "YTA. Someone needs to punish and publicly humiliate you for such horrible parenting. \n\nThe second your son can, he'll be gone and you'll never hear from him again. I hope your friendship was worth losing your child.", "YTA. punishments need to fit the crime, so to speak. the car was unrelated to the cheating. i think a better move would’ve been making him apologize to her (maybe even on social media because social backlash is arguably relevant enough) and ground him for a period of time (so he can’t find another girl to cheat on as easily, idk).", "YTA, this isn’t real. it can’t be. Lol", "YTA--your son is 18 and can make mistakes, he's an adult.\nI can't see how you trust you again.\n\nAnd I would think as a parent you would want your son to grow up to be sufficient.  Using proud of the fact that he lost his job as he doesn't need his money.", "YTA and I think you provided all the details here because you thought you’d get a bunch of applause from internet strangers. You had the opportunity to talk about this with your son and teach him about proper behavior but you seem to enjoy the humiliation you put him through.", "YTA this was a situation between your son and his ex, there was absolutely no reason for you or your friend to get involved, nevermind giving his ex his car as a consolation prize.", "Man I honestly appreciate and understand the sentiment but you took it too far so YTA... I have been cheated on by my spouse and it was devastating so I get that you wanted to show him how seriously damaging his actions can be. I also get that your point was that if he did this in a marriage he could easily lose half of his assets in a divorce.\n\nBut man the stakes aren't that high right now, he's a kid and kids need a whole lot of grace. I do believe he should have been punished, and yes you should use this as a teachable moment, he needs to realize there are consequences to his actions but you went nuclear!  I also think how far you went has a lot to do with it being your friend's daughter, I feel like you were trying to save face rather than teach your son how to treat a partner. \n\nYou can show your disappointment for your kids actions but he is still your kid and he needs you on his team, that doesn't mean supporting his bad decisions but it does mean you won't make the situations he puts himself in even worse, like you did in this instance. \n\nAlso did you really listen to your son when he tried to tell you the full story? The girl has already moved on which does happen with highschool relationships but it also says she could have been just as unfaithful as your son (not that it's an excuse) but he could have been trying for some kind of revenge. You gotta listen and give the best advice you can, your job is to steer them in the correct direction and make the path they are on easier not more difficult.", "YTA. This was not your relationship to get involved in. Nor to shame your son because you were embarrassed. Your role would have been to be a *father* to your son and have discussion around why cheating is not something solid, respectful people do, why an appropriate reaction would be for him to apologize - in private - to his ex, how he can work on himself to be a better person, etc. This was such an egregious action on your part, I don't know if your relationship with your son can ever come back from it.", "Hope you enjoy the shitty nursing home you end up in. This was a teachable moment but you are only concerned with loyalty to your friend. \n\nYTA, and a terrible parent.", "YTA, this is the worst one I have read. Hopefully it is fake", "You’re a horrible parent wtf YTA YTA YTA. A simple scolding wouldve done it well or just making him apologize to the girl.\n\nWas he shitty for cheating? Absolutely. But you stretched it to the point he has no job, a ruined social life, and now has to struggle to get to school. You couldve gone so many ways and chose the worst possible “life lesson”. YOUR the asshole.", "YTA and your relationship with your son is effectively dead. Since you decided that humiliating him for cheating was the way to go,  good luck getting him to do anything for you from now on unless you're willing to do more disturbing and depraved things in an effort to coerce him.", "YTA - your his father, this was grossly I inappropriate.  You didn’t reach him a lesson and this was grossly out of proportion. You gifted him that car, even if it was in your name, it was ethically and morally your son’s car you stole.  You then publicly humiliated him like this is the scarlet letter.  You then proceeded to screw him over professionally by making him lose his job and income.  Then you screwed him academically, as losing an hour of sleep and an hour to do academics due to transportation is going to hurt him.\n\nThis wasn’t a high stakes relationship, it was high school, and the girl has already moved on real fast.  This was just about you saving face with your friend and intentionally hurting your son(not teaching him).\n\nYou’ve likely ruined your relationship with your son.  He 100% won’t come to you or tell you the truth going forward.  I expect him to go NC.\n\nYour friend is great tho.  He got his daughter a new car to go with her new boyfriend, and probably ruined the rest of your sons highschool life.", "YTA \n\nCongratuliations on losing your son and future grandchildren. Great Job.\n\n\nWhat made you Even think this was appropriate???", "YTA, because DAMN, SON. You should have had him apologize and then scrub all the floors in the house, but give his CAR to his EX? Are you kidding me? \n\nDude. I get it, cheating is awful, but he isn't going to remember that cheating is bad from this. He is going to remember to be more sneaky with you because you will show zero amount of mercy to him fucking up. \n\nThe only high stake relationship at here was between a father and his son, and bro, you have really risked it with this move.", "Look, I can see why you did what you did, but it really wasn't your business to be getting into.  And giving the car to your son's ex who had already moved on was a really assholian move.  Are you going to be getting into his business in ALL his future relationships?  YTA.  A massive AH.", "YTA\nI get that what he did was wrong, but he's a kid. Which means he gets to make mistakes and do things wrong", "YTA\n\nAnd you openly admit that ruining his life was 'the idea'.\n\nYou are not fit to be a parent.\n\nWhat has your son's behaviour got to do with your friend?. Their child is 18!  And their own boss.\n\nYour moral judgements are NOTHING to do with the car that you GAVE him.\n\nIt is his property and you have stolen it. And thus have arranged for him to lose his job!\n\nI wonder what your history in sexual relationships is and what you are projecting on to your son.\n\nI feel so sorry for your son.", "YTA. This is the time where people experiment and relationships do come and go. You wanted to show him what divorce is like - lose your job, lose your possessions - in a teenage relationship. Lucky, lucky GF - she's moved on and got a free car too. You made the stakes unrealistic. \n\nHe's likely learnt two lessons. Having possessions gives you power over him so why bother and don't get married. Suspect a few years later, there will be a post saying why doesn't my son settle down. \n\nInfo: are you divorced and bitter about it?", "YTA.   Don’t get involved in teenagers love lives.   You can certainly give guidance and ask him to see things from others point of view, but it sounds like you were more embarrassed because it was your friend’s daughter.    I foresee you son eventually getting another car and driving far away from you.", "YTA.  Instead of a teachable moment, you created what might be a permanent wedge in your parent-son relationship.\n\nWas your goal to punish him as hard as possible, impress yourself friend or help your son become a better person?", "Yta. And deranged. They were not engaged or married. His whole friend group are now going to be alienated from him. Dick move.", "Sounds like the gf was cheating and your son returned the favour. She was just so low to keep the evidence of his indiscretion where he was the better man. Why else would she already have a new bf when you went to deliver the car? Probably the one she was cheating on your son with. \n\nWay to go teaching your son to never get into a serious relationship again and just to use women for his own ends and treat them and throw them away like trash. \n\nAlso taught him to never accept, or give, a gift again for fear it would be taken away or that the meaning behind it is worthless. \n\nKeep going, maybe he will choose to cut you off because of your toxic, controlling behaviour when you need him most. \n\nYTA.", "What. The. Hell.", "YTA. You are way too involved in your son's personal life. The consequence for cheating on his girlfriend was losing his girlfriend. You attempting to ruin his life because you don't like how his relationship went is incredibly f***** up.", "YTA\n\nAll you’ve done is cement his hatred of you. Hope you won’t need him for your end of life care. \n\nThe relationship was between the two teenagers, and it’s up to them to resolve it. You stepping in and *bull elephanting* your way through the situation is garbage. He’s old enough to cheat, he’s old enough to live with the consequences. Those consequences should NOT include losing his job!", "YTA. Man, this is the kind of thing your kid is never going to forget. You’ve simultaneously taught him not to open up to you and not to take responsibility for his actions because the consequences might be insane. On top of humiliating him, forcing your way into his relationship, and making it to where he will probably never be comfortable around anyone involved in this situation again. This was extremely messed up.", "YTA. Who takes away a 2 year old gift from his son causing him to lose his job? He is 17 years old! He has many life lessons to be learned, but I hope he doesn’t learn anything from you", "YTA. He is 16. A stern talking to about how to behave and treat women is sufficient at his age. You massively overreacted, and you cost him his job. Your friends are AH too for accepting the car and allowing such an extreme form of punishment, over something that has nothing to do with you. I guess your relationship with your friend is more important to you than your relationship with your son. I look forward to the update on how you intend to fix it.", "YTA! OP, you were right to punish your son for his actions. However giving away his car to his ex, when her new boyfriend was around is pretty low. And what is lower is that your friend and his daughter accepted this. Your son may have set this in motion but your friend and his daughter are also enablers in the unwarranted consequences.", "YTA, also they weren't married", "yta - its one thing to teach your son about what happens to cheating etc but its quite another to do it to the point he had to quit a job because he cant drive there and now has no means to earn a way to buy himself one.  or move out when he hits 18 but i surmise he will find away to leave on his 18th bday whether he got money or not but i think u wont care by then anyway.\n\nfyi the only reason u did all that is because it was your friends daughter and u wanted to prove urself to the friend hope it was worth it", "Wtf yes YTA and the fact that you even have to ask makes you even more so. You are a horrible parent and one day you’re going to wonder why your kid doesn’t speak to you. I hope you go out and buy him a new car, like, yesterday as an apology.", "YTA. You can expect your son to move out ASAP, and stop speaking to you about 0.000000001 seconds after that.", "YTA,\n\nKids do stupid stuff. Just because you’re embarrassed you give them his car? What’s your thought process? It’s really none of your business if he cheated on his GF in the first place. Not condoning the behavior, but yeah you’re totally the a hole here.", "YTA good luck having a kid who’s gonna go no contact with you the moment he can.  Thanks for showing me what not to do if I’m in a similar situation with my son later on when he’s this age.  If I was your kid, I’d move far away the second I had enough money.", "YTA\nGifts of any value are not given conditionally. That’s why they are gifts. To arbitrarily take them away, and in such a humiliating manner too. Jeepers.", "Id like \"well, that escalated quickly\" for 500, Alex.\n\nYTA. Vastly disproportionate punishment", "YTA. He's young and stupid. You gave HIS car away. Sure you might have been the legal owner but fuck.... your son now has no job, is extra tired, miserable and is going to resent YOU. Get that car back today. Scratch that, get off your rear end NOW, get the car NOW. Then you give the car back. There are other ways to show your disappointment. Either get the car back or buy him a better one. People like you get to their 70s and wonder why their kids don't talk to them.", "Good lord do you always suck up to your friends like this? Is this friend going to be around to give you access to your grandchildren or decide whether or not to put you in a care home? \n\nYour teenage son cheated. He needed to learn a lesson about that because he’s at the age to learn about relationships, communication, how to have hard conversations, how to extricate yourself with minimal harm when you are over it. But you didn’t teach him anything but what humiliation feels like and that he cannot count on you or look up to you. \n\nAnd this broken hearted princess, having already gotten mummy-n-daddy involved in her business, has now moved on with a new boy and, triumphant, had a little party come around to watch her victory lap, sponsored by you. To humiliate your son. For teenage cheating on the kind of girl who would do that. \n\nYTA and an over-dramatic, arse kissing one at that. You made her day but he’ll remember this for life and will never see you the same way.", "Something tells me you wouldn't have done this to a daughter.", "E s h but mostly yta for involving yourself in your son's relationship.", "Fuck around and find out. NTA", "While what your son did was shitty, well done for ruining your relationship with him for your friend.\nYTA", "yta", "I've read this BS before.", "This is why friends children shouldn’t date because the parents get involved too much. He cheated that’s sad but let them work it out by themselves", "You realize that one day your kid will be in charge of caring for you and will be deciding on whether of not to dump you in a nursing home? The memory of having his car taken from him and given away in front of his peers may have seriously unpleasant consequences for you. YTA.", "YTA. You really did ruin his life.", "ESH. Your intentions are good however,\n\n-Taking away the car is too much. \n-Publicly shaming him is too much.\n-Forcing him to quit his job and making it harder to get to school is too much.\n\nYet You did all 3 combined. \n\nHe made a mistake, and whilst yes its your responsibility to teach him life lessons, you also have to support him through his mistakes", "YTA\nAnd super weird for getting in the middle of a teenage breakup.", "YTA if your son ever goes NC with you don't be surprised.", "YTA absolutely and utterly. This was not about teaching or correcting your son's actions, this is entirely about you trying to save face in front of your friend; by destroying your relationship with your son.", "YTA, I guess this is the beginning of the end of your relationship with your son. You won't be able to live this one down lady.", "YTA.  Are you seriously wondering why he lied and cheated when you act like this?  You are unhinged and should apologise to your son for being such an asshole.  And no doubt not just on this occasion.  What the hell is wrong with you?    The fact you say ' it's kind of the goal ' to ruin anyone's life let alone your own son is psychotic.  Get yourself to a counselor to unravel your own warped psyche and view on relationships which are in desperate need of a conscience.  Your friend is just as much of a weirdo for accepting the car.  Seriously I hope your son gets the hell out of dodge and away from you for the rest of his life.", "You have one out; if the car was yours, that he was using as his, you have the right to take it back. If the car is HIS (whether by gift or he bought it) you have no right to take it. Maybe legally, but not morally. Giving it to Ex/BF was a completely unnecessary \"f@ck you\" to him.\nI don't think \"asshole\" is strong enough.", "YTA.  Buy your kid a new car, apologise to him for putting your profile ahead of his wellbeing.  How you  could think humiliating a kid in front of his friends was a good idea just proves what a crap parent you are. I would never trust you again if you were my Dad. A 17 year old in a two year relationship?  Give the kid a break.  He had a job and you have flubbed that too. You are a major and total AH.", "\"He is complaining that this ruined his life, but that's kind of the goal.\" YTA, your role is to teach him that cheating is wrong not to destroy his life, what he did, and the lying was a big thing, but what you did was over the top just to make you look good to your friend. With parents like you who needs enemies?", "Yta least be honest this was about making yourself look good to your friend cause you are embarrassed. You taught your son nothing", "Ummm I'd say YTA for raising him but in the given situation you are NTA", "Bro wtf. 100% YTA. Obviously cheating is terrible but he’s a kid, this could have been handled so many different ways that might have actually provided a learning opportunity for him. If my dad pulled this shit I would cut contact as soon as I moved out.", "YTA. He’s 17. He’s young and stupid enough to make his mistakes but he’s old enough to sort his own messes out. It’s none of your business. It’s a huge over reaction.", "r/amithedevil", "YTA. Obviously you are proud that you ruin your relationship with your son.", "YTA", "YTA and strangely over-involved in these kids lives.", "YTA. Why tf are you so invested in your minor's son relationship with a minor girl?!? Congratulations, you appeared magnanimous to your friend, but you lost your son. I hope your friend finds and pays a good nursing home for you, because your son for sure won't", "YTA why are you so involved in your child’s relationship, that is so weird.", "What The Actual Fuck. Your son isn't a Saint, but you're an absolutely horrible human being and a failure of a parent. I hope this post is fake.", "You said it yourself: your goal was to ruin his life. This is not something a loving parent would ever do. It's clear you hate your son. YTA.", "YTA, there’s no way this is real right? Cuz if it is, I would never talk you again.", "YTA What the hell is wrong with you?", "YTA should have stayed out of it. \n\nNot condoning cheating but she already has a new boyfriend. What does that tell you about her as a person?", "YTA", "Yeeeaaaaahhh uh... YTA dawg. Absolutely zero question about it. \"oh I failed to raise my son better so I'm going to teach him a lesson that um uh um if you're a bad person someone will give your things away! That's the lesson here!\" like how do you read what you typed out and not think that you overreacted immensely???", "YTA. Don’t get involved in your kids love life. He’s 17 for gods sake.", "YTA they are teenagers you and your friend needed to stay out of it! Giving away his car really?", "YTA- teens have drama. Why are you allowing yourself to be sucked in? Let them handle their own shit. Your job as a parent is to help launch your kid into self-sufficiency and I don’t see how taking away his car and making him quit his job is accomplishing that.", "NTA. Honestly idk if this is true but if it is, the little cheater learned his lesson. He can buy himself a new car", "Nta", "NTA. More parents need to be like you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son(17m) has been dating my friends daughter(18f) for the last couple years. Their relationship has been solid and their relationship started getting pretty serious. Last month my friend called me and he was upset because my son had cheated on his daughter. I was taken aback and thought there had to be some kind of misunderstanding. \n\nMy son tried to explain that everything was a lie and she was just trying to ruin his image. I initially believed my son and went to go and confront my friend. At this point, his daughter showed us an entire folder of evidence against him. It looked really bad and I went home ashamed to even show my face to them. \n\nMy son eventually admitted that most of what she was saying was true. I also pulled up the text logs from our phone provider to check the validity. I put off dealing with the situation as I had to travel overseas for work and didn't have time to investigate this. After I got back in town, I decided that I would take away the car that he had gotten on his 16th birthday. I decided to gift the car to his ex and I contacted my friend to fill out the paperwork. \n\nHe agreed on a time for us to deliver the car and I made my son come with me to hand deliver it. When we got to my friend's house, his daughter had her new bf and a few friends over. My son begged me to not make him give the keys in front of all her friends. I didn't really care and wanted to make sure he was shamed for what he did. He is complaining that this ruined his life but that was kind of the goal. He can no longer drive to work so he had to quit his job. He doesn't need the money as I pay for everything. He will have to wake up an hour earlier for school to catch the bus and he has to wait an extra hour to catch the bus back home. I wanted to show him what could happen if you cheat in a more high stakes relationship. AITA here? \n\n&#x200B;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don't really think you had anything to do with a 17-year-old's relationship. Ex was also an AH for going to daddy whining. You can express how disappointed you are in him, but that's all you can do about it. I really think this was a huge overreaction from you.", "YTA. OK, firstly you are WAAAAAYYYY too involved in the relationship of two teenagers. \n\nBut what did his car have to do with this?! It feels like this is more about your reputation with your friend than your son.\n\n'He is complaining that this ruined his life but that was kind of the goal'\n\nThis is simply psychotic. \n\n'I wanted to show him what could happen if you cheat in a more high stakes relationship.'\n\nIf not married, he'd keep his car. Simple. Hopefully next time he won't have an overbearing parent to contend with.\n\nYour reaction was hysterical. Do you have some unresolved trauma from being cheated on in the past or something? Because this level of drama is not normal.", "YTA!   Ok. He’s 17, and this is why those relationships break up: she couldn’t say no to the quarterback, and he couldn’t resist one of the cheerleaders. It’s not about shared values and where to live once they get married.\n\nAlso, you and your friend should not get involved in their PERSONAL relationship. For you to punish him because he cheated on her is jumping the shark. For you to discuss things and give him insight, would be the appropriate thing. \n\nAs to taking his car and gifting it to the girl, YTA!! I can’t believe that the girl’s father took it… it’s almost like you tried to prove yourself to your friend, and kept beating down your kid, for something that was none of your business. What exactly were you trying to teach him? Yes, he lied to you, about something that you had no right to ask or get involved in. You and your friend are both AHs.", "……", "YTA\n\n1. If your son cheated on his gf, this is smthg between them and them only. You as a parent can support your child or not support them bc you think what they did was wrong, but you are not a part of the relationship so you don't get involved. And thats exactly what you should have told your \"friend\" - this is a thing between our kids, let them handle it. \n\n2. A punishment needs to be related to the  crime to be a lessons learnt. The car had nothing to do with the cheating, therefore your son will learn nothing out of this punishment - or at least not what you wanted him to learn. \n\n3. What your son DID learn is that at least one of his parents is not reliable (giving gifts to your kids and then taking them away is the epitome of bad parenting) and he should better keep his distance as soon he is able to move out. Who knows what else you will do if he messes up again - better to not be more dependent on you than absolutly necessary. \n\nLets be honest here, you didn't really care about the girl (or did i missed the part where you contacted her to offer her support?), you only cared about losing your face to your friend. You acted like a headless chicken, running around cackling and making a mess. I hope your last 17 yrs of parenting were a little better. Smh.", "ETA lol. extreme but all the kid had to do was not cheat. It’s like, really easy.", "YTA. wtf", "Yta and honestly abusive", "Nta", "Wow, YTA. What your son did was wrong but if this is how you handled something that was entirely not your business  I can only imagine he learned to be an AH from you.  But it sounds like you're proud of yourself for tanking your relationship with your son so I don't know why you're bothering asking for judgment.  You know it was a crappy thing to do and you're happy about it.", "it must be nice to just have cars lying around to give away.  if you are so well put together, why are you here?", "YTA\n\n>He is complaining that this ruined his life but that was kind of the goal. \n\nWith that out of the way, there's something.\n\nThe ex has an \"entire folder of evidence\"?  An 18 year-old high school girl compiled a \"entire folder of evidence\" on her cheating BF? \n\nYou seem to have forgotten to share what this evidence was and how it was obtained.  But if I may take a wild stab in the dark, this evidence you speak of wouldn't by any chance be a series of text messages between your son and one of his ex's friends at all, would it?  The friend let it go on long enough to get an \"entire folder\" of messages and then turned them over to the ex?\n\nYou also seem to just gloss over how exactly this girl - a girl apparently so devastated that she needs her ex's dad to give him his car - *already* has a new BF.\n\nThat last isn't just a red flag; it a flashing red neon sign.\n\nIt seems highly likely that your son was doing something he shouldn't have.  \n\nClearly, if your son participated in such an exchange, he's at fault.  But the first thing he said was that his ex was trying to ruin his reputation.\n\nMaybe try to find out what really happened.  Because this smells to high heaven.", "YTA. Cheating is wrong, but forcing him to give his car to his ex?! That’s bonkers..", "YTA. Your son’s relationships are nothing to do with you. And to decide to both interfere and give his car away is a seriously AH move. He’s 17yo and even if he wasn’t WTAF?", "YTA, no wonder your son turned out like this. Prepare to be abandoned.", "Sounds like you’re punishing your kid because YOU’RE embarrassed. Jesus Christ. And why were you meddling anyway? You went over there to confront the girl? Why? She moved on and has a new boyfriend. \n\nThey were dating, not married. This could’ve been a lesson learned with you having a discussion. You embarrassed him and stripped him of his independence. \n\nYTA.", "NTA.  The world needs more fathers willing to be the bad guy to teach their kids there are consequences of their actions.  \n\nThat you are getting so many YTA votes shows how spoiled kids are nowadays.\n\nWell done for choosing to parent your kid.", " YTA What you did was over the top. Teaching him about cheating, and letting him know how disappointed you are in him—the classic guilt trip—would have gone a long way. \n\nThe ex girlfriend should not have accepted the car. She should have publicly told him off, but not taken the car.", "YTA, your punishment was wayyy too far. Your kid is probably gonna be traumatised and never want to speak to you again. And you said your goal is to ruin your kids life? What kind of parent are you?? Yes cheating is wrong but Jesus Christ taking away his car and making him lose his job is fucked man", "YTA", "I’m gonna go with NTA. I know everyone is gonna jump on me and shove their opinions down my throat but it’s the job of a parent to teach their kids right from wrong and that actions have consequences so yeah he sure did that lol bet he won’t be cheating again. He’s also a liar as he lied right to his dads face and could have potentially destroyed his dads friendship", "What sort of phone provider just gives random parents their kids text message logs? Phone providers dont even do that for criminal cases sometimes", "YTA - Your son's relationship issues are none of your business. Yes, he is an AH for cheating, but you are an even bigger AH for giving his car away, and humiliating him in the process. It is a sure-fire way to make your son go NC with you.", "NTA. Nip that shit in the bud now. He will be upset but now he understands actions have consequences. He lied to his girlfriend, cheated on his girlfriend, lied to you about it and tried to ruin HER image, then he let you go over to your friends house to embarrass yourself all to save his own ass. \nI’m sure you’re trying to raise your son to be a good man and now he knows this is not something good men do. You stopped him from leaving a trail of broken hearts well into his 30’s. \nDon’t feel bad. It sucks that he lost his job but like you said he doesn’t at this time actually need the income. Now he can look for a job closer to home an save up for his own car. \nPeople are way too gentle and dismissive when it comes to raising boys. Letting them off the hook for every bad thing they do because “boys will be boys “ is not how you get boys to grow into men.", "NTA.  He needs to learn that actions have consequences, and making him hand her the keys in front of her new boyfriend was just icing on the cake.", "Fuck around and find out, cheating shouldn’t be lessen just bc of age. On top of that lying about it and stating she just wants to ruin my image, means that this was his excuse/lie. The dad is teaching his son a lesson that’s important. His son is losing his spending money/car, he lost a privilege. If he wants to go out ask a friend, need money yard work, want another job find one in biking distance. And the dad is right being in high stake relationship with a person cheating will end with the other person taking everything. He’s young now so all he’s losing is spending money and a car that was gifted. He was on his son side until he realized he lied. He’s a teen so mistakes are meant to be made but that doesn’t mean he shouldn’t be punished.", "YTA. His relationship is non of your business even if it's your friend's daughter. You posted here after, did you think to ask before signing the car over?", "YTA the car had nothing to do with his relationship. Whether you were close friends to her family or not. He’s still a kid, they aren’t married yet you gave her his asset???? WTF???? Great way to set him up for future relationships!!! Wow, just WOW!!", "Yes, OP is a terrible parent.", "He was more worried about saving his friendship then what mental and emotional damage was done to his son! \n\nOp son learned how not to be loyal to the people you love from op! Value only the people who get you places!", "This was totally about looking good to their friend! They shouldn’t really be punishing him for his relationship, but if they were going to, they should have just taken the keys away from him and make him find a way to work. \n\nBtw OP if you couldn’t tell YTA, you didn’t reach your son to not cheat, you taught him that you care more about what your friend thinks of you than your son. You taught him that you care more about your friend than socially traumatizing your own child. I wouldn’t be surprised if your relationship never fully recovers, and once he gets his life together I wouldn’t be surprised if you are no longer in it.", "YTA, there was no reason to give away his car.\n\nETA:\n\n>>He is complaining that this ruined his life but that was kind of the goal.\n\nOP did you read what you wrote? Your goal is to ruin your kid's life?", "Far better than a parent being this awful though IRL, though, eh?", "Because her friendship and social standing is more important than her relationship with family. \n\nYes. He cheated but that relationship isn’t with you, they weren’t married, and whilst it makes him a shitty shitty person, you upped the ante and went nuclear.\n\nThere was no need for this action - the girlfriend has a new boyfriend already and your son will be ostracised already. Your friend should not have accepted and neither should the girl.\n\nEnjoy your old age on your own. \n\nYTA.", "It’s absolutely your business to raise an upstanding kid. It’s your job as a parent to teach your kids ethics and morals, so if absolutely is his business.", "He’s 17. Not an adult. Read the post correctly. And even if he was 18, while yes that’s a “legal adult,” an 18 year old is still a teenager and practically a kid.", "I got the impression the mother wrote this which is actually even worse to me", "Maybe the friends daughter will care for him since he likes her better than his own son.", "[removed]", "The son already showed he wasn't gonna go to them as he lied when they asked him if he cheated, and made the parent look dumb when they went to confront the friend and they provided proof, so I kinda think he deserved the punishment.", ">Sounds like the gf was cheating and your son returned the favour. She was just so low to keep the evidence of his indiscretion where he was the better man. Why else would she already have a new bf when you went to deliver the car? Probably the one she was cheating on your son with. \n\nI've had friends who were cheated on - that stings and if they're even entertaining other men it's casual NSA at best for a while\n\nI've had friends who were \"cheated\" on - both her and him were equally as shitty as each other - they were the ones that waltzed straight into a new relationship seemingly within hours of the old one finally being pronounced dead", "Maybe he should’ve been smart enough not to be a cheating loser then", "Is this a joke? OP is clearly AH", "This is how you go about your children not trusting you anymore. If I was this woman's child, I would do my best to distance myself as much as I can from her. Yes he did a bad thing  but he didn't need mommy to teach him a lesson. He's 17 and the girl is 18, they are not children anymore", "What a bully that likes to humiliate their kids? Or just the meddling parent that gets involved in their child’s social life when it isn’t any of their business? Or should parents steel back a gift to regift it to other?", "By giving away something he received as a consolation prize?", "Good luck being alone for the rest of your life.", "I think you're looking for ESH.", "I hope it was worth looking good to their friend. I am 100% sure OP’s son goes completely no contact the same minute he turns 18. OP ruined his life, no car, no job, no money, no fun. He will never forget this. OP will be here in 10 years time posting about being uninvited to the son’s wedding, not allowed to see the grandchildren etc. This is just one of those things that a child will and can’t never forget, the humiliation and embarrassment handing over his car keys to his ex in front of so many people. This is no way to punish a child. OP is beyond cruel and inhumane. She will regret this deeply once the son turns 18 and never look back.", "He and his friend were way too involved in this relationship. He can express  disappointment in his son. But what he did was out of shame he felt. And to get back into the good graces of his friend. They are teenagers, the girl moved on. And what does it say that these people accepted the car? What a messed up group of people. He destroyed his relationship with his son over a high school relationship gone bad. It’s a ridiculous over reaction. And it’s twisted he mentioned wanting ruining his kid’s life. I hope the kid goes NC with his dad. His dad showed his love was conditional and subject to humiliation.", "He did not parent.\n\nHe was his son's procecutor, juror, judge and executor and in an extent prison guard in one person.\n\nWhat he should have done is sit down and have a serious convo about the situation.\n\nOP YTA a huge one!", "Yeah and OP failed miserably in this regard.", "You can't prevent everything with good parenting. There are a lot of assholes in jail who had loving parents and none of their siblings turned out as criminals. \n\nAt some point you are not the main environment for the kid anymore and other stuff and ppl start having an influence on them. And they are thinking individuals who do their own decisions, good or bad ones.\n\nYou can blame parents for a lot, but not for everything. Or would you be fine if we publicly shame your mom bc you got a speeding ticket? How dare she didn't raised you better? HR calling your mom from now on to sue her when you do a mistake in your job, bc \"her lack of better parenting made you do a mistake and the company lost money so its her responsibility to pay for it\"? If you get in a barfight, shall we put your and your opponents parents in jail instead of you bc they obviously raised you bad? \n\nWhere does the responsibility stop? Think very hard about everything you messed up in life - are you willing to let your mom and dad take the blame and get punished instead of you? Bc obviously they did a bad job raising you...\n\nThere is a reason in most countries kids are considered \"mature\" from a certain age and if they mess up the law is punishing the kid and not the parents. But sure, we can try out your approach, maybe its better. From now on lets just all not pay in shops, stores, bars etc, not driving by the rules and in general just taking what we want - and if someone is not fine with it, we just say \"pffff, i don't care, blame my parents for not raising me better\" - this is gonna be fun :)", "Once again ethically not legally.\n\nWhen you “give” someone something, it implies it is there.  He didn’t loan him the car, didn’t let him borrow it, he gave it to him.  So yeah, while legal, it looks like legal, ethically and morally he took something that belonged to his son.\n\nAnd your own statement is contradictory.  Your implying he was gifted a car, but it’s also not his at the own time?  Is that how a court of law works?  If your an asshole you lose your car, job, publicly humiliated, and have your future career negatively impacted?  Also the dude is a child.\n\nThere’s more then enough studies showing how even losing an hour of sleep can negatively affect academics for students.  They are still developing and it can really mess them up.\n\n\nhttps://www.washington.edu/news/2018/12/12/high-school-start-times-study/\n\nhttps://med.stanford.edu/news/all-news/2015/10/among-teens-sleep-deprivation-an-epidemic.html\n\nDo the world a favor and don’t have kids, they’ll probably end up scarred", "What a pathetic comment. What did his ex do to \"deserve\" the privilege of a free car? This person isn't fit to be a parent.", "I guarantee you he won’t be honest with his parents or come to them in the future when he has issues.  Had too much to drink at a party? Better drink and drive then call his parents for help, who could make him lose his job, take away his car that was supposed to be his, humiliate him in front of his entire social network, and damage his professional life.\n\nThe issue is this is not even remotely proportional.  He could have him deliver a hand written apology, set a curfew, and/or required him to start paying for his car. Which wouldn’t have been nearly as damaging but still proven his point.  He wasn’t an adult, and this was a teenage relationship with the girlfriend literally already having a new boyfriend.  And the only lesson he learned here is to not involve his parents, lie better and don’t trust anything his dad gives him.  The punishment didn’t match the crime.\n\nAnd the parents shouldn’t have been that involved.  This wasn’t an arranged marriage.  This was two children dating.  This was their own mess to handle, the parents choose to get involved to this degree in a teenage/high school relationship that wasn’t that close.  I mean he drove to the girlfriends house to what? Fight them? And he choose to argue with them without getting all the facts? That’s OPs own fault.\n\nOverall tho, this was a vastly out of proportion.  And OP should get all the facts straights before he goes to fight(?) his son’s ex’s father.\n\nEdit: honestly thinking about it, it’s even worse. The son is 100% going to feel victimized due to this(he is probably to a degree right given how overly severe it is) and is likely going to make the lessons he learns from this even worse\n\nEdit 2:\nAlso now he has no way of ever buying his own car or being self sufficient.  He can’t even get to school without a bus, he won’t be able to get any job and make any money to save up for literally anything until he moves out(and probably goes NC).", "What an odd comment.  The child is not the problem here.  Stupid is as stupid does 😁 and its not the 17 year old in this scenario.", "thanks, i’ll make a note for next time!! i’ll think i’ll keep it tho, just in case haha", "Get cheated on by OPs lowlife son?", "Your party situation it's not nearly equivalent, something closer would be the son drinking, driving, crashing/damaging the car, and lying to his parent saying he was sober, for them to learn afterwards he was drunk.  \nHe never intended to be honest until he didn't have the choice. \nAnd the parent tried to have the facts, but their son lied, I'm not sure what you wanted them to do, making him pass a lie detector test maybe? and even after getting the proofs they still went and checked the phone records to be sure, so they really tried to support the son which is even more disappointing.  \nOP could maybe have done a better parenting job in the past so the son would have admitted he cheated, maybe they went too far giving away the car but he deserved some kind of punishment.", "Yeah I’m pretty sure it is the cheater/liar that’s the problem lmao", "Seek help lol", "It’s not about equivalency, it’s about the lesson he learned.  Which is if he messes up, or god forbids embarrassed his parents, his parents will destroy his life.\n\nHe didn’t need to do a lie detector test. His teenage Dione as just caught and out on the spot, we don’t know if he intended to lie or not forever.  The dads response was not to call his supposed friend and have an adult conversation and ask for evidence(because at this point it’s entirely he said she said, if he acted maturely he would’ve looked for evidence first) before rushing over to confront his friend and I’m guessing his plan was to fight him for sullying his sons honor?\n\nAlso he checked the phone logs AFTER he was shown evidence and his son admitted it.  It wasn’t about defending his son, he was personally embarrassed at jumping to conclusions and wanted to save face.\n\nWe agree he could’ve done a bad job parenting his kid.\n\nAnd if you look, zero people are saying punishing him was wrong, what people are saying(myself included) was this was grossly out of proportion and taught the wrong lesson.  And the reason it was out of pot proportion was OP jumped to conclusions in the literal heat of the moment , looked for zero evidence, then instead of having a Rational conversation with this friend, went to confront him instead.\n\nHonestly, OP messed up here as a parent in more ways then one\n\nBut I’m not seeing anyone not think he deserves a punishment", "You don't need to cry into your teacup because people cheat .... I get major bunny boiler vibes from your comments.  Weird.", "Oh I ain’t crying. And I mean yeah better that than being a cheater like you almost certainly are 😂 weird to cry about cheaters getting punished rightfully, must be feeling some type of way about what would’ve happened to you if you had good parents", "O.k....weirdo.", "Okay cheater :)", "Let me guess, you got cheated on in the past and are taking this personally. Seek thereapy"]}