{"id": 22639, "submission_id": "153o1xt", "title": "AITA for being honest about what my brother was doing with his friend?", "selftext": "My (16M) brother “Wolfe” had his 18th birthday the day before yesterday. We were supposed to go out for dinner but Wolfe was late so my dad asked me to check on him and tell him it's time for us to go. I went upstairs and he and his friend are kissing in front of his bedroom door. I announced myself and then told him we're ready to go, and that he can bring his friend too if he wants. He looked kind of embarrassed but other than that, no big deal.  \n\nWhen I go back downstairs my folks ask me what Wolfe was doing, so I told them. Again, seemed like no big deal, but yesterday Wolfe took me aside and said his friend is “restricted” from the house now thanks to me. I was like, it's not my fault they were kissing in the open where anyone can see. He said it was an accident and that he's not even in a romantic relationship with his friend, and I said maybe tell our parents that, I'm not obliged to lie for him.\n\nSince then he's just been staring bloody murder at me and won't really talk to me when he sees me. I don't think I did anything wrong but hey, it can't hurt to ask. AITA?", "created_utc": 1689752021, "permalink": "/r/AmItheAsshole/comments/153o1xt/aita_for_being_honest_about_what_my_brother_was/", "score": 178, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my parents that my brother was kissing his friend. Might be the asshole because me telling them lead to his friend being \"restricted\" from our house.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. First of all, if he seemed embarrassed why would you fuel the flame? Second of all, you had no idea if that was something he was ready to talk to your parents about or not. You don’t even know if he ever wanted them to know and that is not your place to step in and share. Wolfe deserves an apology from you and a sincere one.", "YTA. Idk why would you tell your parents about it. There's honesty and then there's intentionally getting someone in trouble. You did the second one.", "YTA. Yes, you were being honest and you didn't care whether that honesty hurt him or not. But that disregard is what makes you the AH.", "YTA come on now you outed him on purpose which is a really shitty thing to do. \n\nDid you know your parents were homophobic? \n\nYou clearly did this to make his life difficult and I really hope that one day karma catches up with you. You are a truly awful person, I’m really glad you’re not a part of my family.", "YTA and you know it. You didn't have to disclose his intimate moment.", "YTA - And I wish more people would comment on the fact that your parents are bigots", "YTA why bother giving details. why not just say “i dunno, i just told him it’s time to go”. This sounds a lot like you were trying to cause issues when it simply wasn’t necessary", "YTA and well done you are 16 and I can promise you will need some help from your brother within the next 4 years. I don’t think you will be getting that help now", "YTA it was honestly completely unnecessary to say it.", "YTA. When someone asks you in a few years why you don’t really have a relationship with your brother, you can show them this post!  Great job being a terrible brother.", "YTA. It is not your place to tell your family that. You could have just said he was with his friend and left it at that but you went out of your way to not respect his privacy. In front of his door or not, it's not your place to tell.", "YTA. You didn't have to lie, just keep your damn mouth shut. It will be interesting for you next time you do something your parents won't like, and your brother knows about it.", "YTA. It's not dishonest to not share someone's private information.", "YTA. You don’t put people like that. Wtf is actually wrong with you?", "YTA. It’s none of your/or your parents business what Wolfe is doing.", "YTA...you knew what the outcome would be and used this as an opportunity to shame your brother.", "YTA. I mean outing someone is an incredibly shitty thing to do and you’re shocked that your brother is pissed off? Grow up.", "YTA. You could have just said they were hanging out. Why would you think it's appropriate to tell your parents that?", "Seriously was this  a everybody needs to know or did you just need to be a tattle tail \n\nYTA", "YTA. If you don’t realise why outing your brother is wrong, there’s no helping you.", "fucking little snitch wondering if they are the asshole for snitching.\n\nYTA mind your own business and stop snitching, Snitches gets stiches.", "YTA.  It's not necessary", "YTA that wasn't your information to share, it was extremely inconsiderate.", "YTA. it would have been more considerate to keep it to yourself", "YTA. If it were you, what would you want Wolfie to do?", "YTA. you have no idea how traumatizing being outed is and you were incredibly short-sighted and inconsiderate. I find it difficult to believe, even given your age, that you genuinely didn’t think there could potentially be negative consequences for this. Everyone pointed out how easy it would’ve been to *not* do that. You owe him the worlds biggest apology and do not expect to immediately win his trust back, if ever.", "YTA. Coming from a someone who also has a LGBTQA+ sibling you have to let them come out in their own to your parents. It is hard enough hiding who you are and being forced to come out is even tougher", "OP:  \" Hey Look, that mans been mugged and they've stolen his trousers\"\n\nAlso OP:  Dials 911\"  Hi Police, there's a naked man on my street\" \n\nOf course YTA OP. You knowingly created a situation of conflict and mistrust and now conveniently hide under the flag of honesty. It's also BS to suddenly say \"I had no idea\". People know how their households are **AS THEY GROW UP IN THEM**", "YTA. General rule of good behavior: we don’t our other people. Period.", "YTA\n\nYeah you fucked up.\n\n\"He's with a friend\" that was all you had to say instead of outing him to your parents, something he should have decided to do.\n\nI've seen your comments doubling down because he was \"out in the open\" (so you're even more of an asshole), your parents weren't there right? You caught them by accident, he wasn't kissing in front of everyone.\n\nHe deserves an apology from you, and you need to mature and understand why you should not blabber everything to your parents.", "Would you like it if the roles were reverse?  I recommend sincerely apologizing. Maybe get him a small gift as well. You outed him on his birthday.", "You know damn well you were itching to say it and it didn’t take much to get it out of you lol. Just apologise to him and move on", "There’s a time to be completely honest about a situation with parents and there is a time to cover for a sibling. Your brother was not being abused, was not abusing anyone, was not hurt, and was in no danger in this situation. This was a time to cover for him. If he wants your parents to know about who he kisses, he will tell them when he is ready. YTA.", "YTA. Don't our people. Just say he was with his friend would have been basic and simple. Then have a conversation with him later about it.  Outing him was just a really awful move and your brother has every right to be upset.", "you outed your brother and youre here asking if yta, go freaking apologize and also do some self reflection jfc \n\nYTA", "YTA You never out someone", "Come on. You know this is different. You didn’t have to describe the kissing detail. You meant to cause the drama. YTA.", "I'm an only child and even I know who don't snitch like that!!! OMG YTA \nDon't assume your brother's sexuality, as I see you doing in these comments! It's none of your business you little brat", "YTA. If he wasn’t out, then I suppose you just outed him, which is horrible. But even if he was kissing a girl, why are you sharing that information? Maybe I just dislike discussing my siblings’ romantic life, but idk I’d just tell my family that he was just chilling on his phone 😭", "To be fair OP is only 16. Since it's not a big deal to him, maybe he assumed it wasn't going to be a big deal to his parents. Also since the incidents happened in the time it takes to walk down a flight of stairs, it's likely it didn't even occur to him that his brother could get into trouble.  He just answered honestly. \n\nI'm covering a very soft YTA because OP is old enough to understand that certain things are private and should be kept that way", "\"I outed my brother without knowing if he was even ready to tell my parents. Does that make me an AH?\" Yes it does, YTA", "YTA!!!! You will be lucky if he ever speaks to you again !", "YTA. OP is a bad brother.\r  \nUsing honesty as a noble excuse to disclose someone's privacy is a despicable act.", "YTA. You’re 16, not 6. You don’t have to blurt out every single thing you think.", "Quote from Glass Onion:\n\n\"It's a dangerous thing to mistake speaking without thought for speaking the truth.\"", "Do you have a learning disability? Or autism? Asperger's? That's the only logical reason for you telling your parents, if you don't have any disabilities and aren't autistic or Asperger's then logically you should have known not to say anything to your parents. You're 110% TA grow up", "NTA. Wolfe made no mention of keeping it secret to you before you went downstairs, just looked a bit embarrassed.\n\nYou didn't \"out\" him as other have claimed because he didn't confide in you in anyway, did you even know it was a factor?\n\nSo many people on reddit are quick to jump on the current trend they forget simple logic it seems -how was OP meant to know bro wanted it to be secret when bro said nothing when OP saw them and was open about it?", "Unpopular opinion idc but ESH, kind of.\n                          \nYou, for outing him. Come on, you could have been a good accomplice out of respect for your brother.\n                         \nYour parents, for being bigots. I assume it will be hard for them to change their minds anytime soon sadly.\n                \nAnd your brother, I wouldn't say he's an AH, but he's definitely not the brightest tool in the shed. If you want to keep something a secret, then try your best to keep it a secret and don't make a surprised Pikachu face when things come out because you weren't more careful. Kissing someone openly when you want to keep the relationship or whatever in secret was not very smart. I wish the best luck, poor dude.", "NAH....\n\n&#x200B;\n\nOh no he was kissing his girlfriend... how dare he do something that's totally natural... for shame...\n\nUgh, who cares, there's worse things to be dicks to each other about.", "NTA - You were just \"kissing\" the truth! 🤷‍♂️🌈", "These people are all wrong. You are nta you are correct, you're not obligated to lie for your brother or anyone. You shouldn't lie to your parents either. Even over something small. Good job!", "It shouldn't be an issue that a 18 year old was kissing his friend in his own house, so it shouldn't be an issue that a 16 year old answered his parents question about what his brother was doing. Therefore it's the parents who are the assholes for being homophobic.", "NTA wanted to get caught", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (16M) brother “Wolfe” had his 18th birthday the day before yesterday. We were supposed to go out for dinner but Wolfe was late so my dad asked me to check on him and tell him it's time for us to go. I went upstairs and he and his friend are kissing in front of his bedroom door. I announced myself and then told him we're ready to go, and that he can bring his friend too if he wants. He looked kind of embarrassed but other than that, no big deal.  \n\nWhen I go back downstairs my folks ask me what Wolfe was doing, so I told them. Again, seemed like no big deal, but yesterday Wolfe took me aside and said his friend is “restricted” from the house now thanks to me. I was like, it's not my fault they were kissing in the open where anyone can see. He said it was an accident and that he's not even in a romantic relationship with his friend, and I said maybe tell our parents that, I'm not obliged to lie for him.\n\nSince then he's just been staring bloody murder at me and won't really talk to me when he sees me. I don't think I did anything wrong but hey, it can't hurt to ask. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA - You never out someone like that without their consent. You need to apologize profusely.", "YTA and should probably start doing some serious self-reflecting before you lose (what you will realize later are) cherished relationships over it.", "I def understand what you're saying but if he didn't want anyone to know he could've been more careful, if he's that open about it I don't see why I should have to lie. I do get what you're saying tho.", "I get it but I didn't know he was gonna get in trouble. He is 18 now and he was just kissing his friend who he's known like forever, i didn't think it would be a big deal.", "OP:  \" Hey Look, that mans been mugged and they've stolen his trousers\"\n\nAlso OP:  Dials 911\"  Hi Police, there's a naked man on my street\"", "Based on how my reply to this post is getting downvoted I'm sure this will as well, I genuinely think the OP just answered his parents question not thinking anything was wrong, for the OP his answer was the same as saying he's upstairs making out with his girlfriend. The OP is actually being non homophobic.\n\nIt's the parents here who are the issue. I understand all the 'you outed your brother you monster' replies, but acting as if the OP is the bad guy is actually feeding the narrative that two guys making it out is wrong.", "Reading op comments makes me think he actually had no bad intentions and is just geniunely a stupid person.", "luckily being a shit person isnt a dna thing", "[deleted]", "[deleted]", "OP's friend is male", "You don't out people. \n\nPeriod.", "Or you could have used a modicum of discretion and not blabbed his personal business to the whole house.  You could have said, \"He's with his friend.\"  It would have been true and you wouldn't be a shit brother.", "Is it possible that he thought he was safe for that brief moment because it was a kiss? Either way it is not your place to just repeat stuff like that.", "Your logic is giving me \"if you don't want men to sexualize you then why are you wearing a dress that exposes your cleavage\".\n\nIt's obvious it was in the moment and they were being a little scandalous. Seriously you say it's not your place to cover for him? Well it's not your place to expose him.", "info: are you autistic? Is that why you don't understand that you betrayed your brother for literally no reason?", "And this is why you never ever in any circumstances out anybody to anyone", "Yeah you did.\n\nYou knew exactly what would happen, stop lying, dude.", "What you thought is irrelevant, it wasn't your place to say anything.", "This take is incredibly bad. OP likely knew what would happen considering its his own parents. Put simply it's dangerous to he part of the LGBTQ community in many places. Even in places it's accepted you can have parents who will oppress you for it. Like if OPs brother is bi now what?  Will the parents ban anyone coming over because he might sleep with them.", "No it isn't, they're legal adults.", "Name checks out for this kind of shit take.", "You're very young, then? Older folks know you don't out someone else", "No, that's not correct. \n\n**Outing** someone is anti-gay. \n\nSome of us grew up seeing the bigoted consequences of outing people, as OP is.", "I don't know why no one is tearing into the parents for essentially banning this friend from coming round because of a homosexual experience. When they're adults!", "I get it. I mean it's not like he was doing anything wrong, he was literally just kissing somebody. But yeah I guess I didn't have to tell them.", "How can I have outed him if he's not even gay??", "[deleted]", "[deleted]", "Exactly 💯", "Because the parents aren't here asking if they're AHs.\n\n**OP is.**\n\nThey are too, but it's not relevant.", "But you wanted to, to get him in trouble, so you did.\n\nYTA.", "Its more like you shouldn’t have told them instead of didn’t have to. Outing him to your parents was not your decision to make", "Sounds to me like you were trying to start shit.\n\nAre you jealous that your brother can get some and you can't?", "You can out people who aren't gay.", "Oh, I misunderstood that friend is a dude", "It's not that I'm making it a taboo. \n\nIt's that I'm **protecting people in an age where being gay doesn't have to be a crime for people to discriminate against you.**\n\nIt's perfectly legal to discriminate against gay people doesn't make it **okay** or mean their **protection** and **choices** don't come first.", "But it’s still a risky subject to bring up because you don’t know how people will react. There are plenty of shit parents that will not accept their child being gay.", "I'm much more concerned about the homophobic adults with two children than a 16 year old not thinking things through properly.", "Reddit brain rot.", "How??", "His friend is a guy but they're not gay, they both have had girlfriends so at most they'd be bi but prolly not even that tbh.", "Great.\n\nThat's not the subject.", "By telling someone that they are “doing gay things”. People who hate gays don’t care if it’s not true", "So you outed them", "Just wanna make a point of, 2 good mates of mine, both men I have had sex with and one I dated for a time, both by 27 came out as fully fledged gay men. \n\nBoth have since apologised to me, for sleeping with me and the like, as they did use me as a beard and a like see, see I'm with Roo, can't be gay at all if I'm sleeping with this real life woman in the friend group. \n\nI also think I was aware deep down. But hey, it ended well for them. I've got a wedding to go to in 2 months and the others bach parties come November.", "So you outed them as bi, not better.", "So he cheated on his girlfriend?", "I guess so.", ">have had\n\nThey're not dating anyone. OP is saying that in the past the guys had girlfriends, but don't have anymore.", "Yta op. Omg this is just awful, you never fucking out someone op!", "YTA and a disingenuous one. No way did you not know what you were doing.", "YTA Outing someone is never okay. Doesn’t matter who it is. From a sibling perspective, you’re also a snitch. Being a sibling is like being a therapist. Unless someone is in danger, you don’t snitch (unless they eat your leftovers or something).", "You’re 16 so I’m going to give you the benefit of the doubt - 18 is an extremely young age. Your brother may not be gay, maybe he is, maybe he’s one of the many other sexualities out there, but right now he (and you) are learning a lot everyday. YTA for outing him, unintentionally or not. Just take what folks are saying here and use it as a learning experience. You can be honest without telling every detail of a situation. \n\nAnd go give your brother an apology. Clearly it’s hurt him.", "YTA.\n\nYou basically outed your brother. *On his freaking birthday*. And now you're sitting on Reddit saying *what did I do?!\" \n\nOP, if you're old enough to function on Reddit, you're old enough to know *exactly* what you did.\n\nNot cool.", "YTA you outed your brother without his consent. That’s not okay", "YTA - No one likes a tattle tale, you could have told the truth and held back the kissing part. You just enabled your parents to be homophobic. I am SURE your parents allowed your brothers girlfriend over just fine.", "YTA", "YTA. Incredibly inconsiderate thing to do.", "yta and an awful brother lmao. i would be bending over backwards for him now. a friend who he’s known for years is no longer allowed at your house because you decided to out him. Idk i think even i had more common sense at 16.", "YTA for reasons already stated.", "YTA. Outing someone is absolutely unforgivable. This may permanently affect your relationship. Don't be surprised if he never trusts you again. Hope it was worth it...", "YTA. Even if it wasn’t a guy he was kissing, why would you just say he’s in the hallway kissing so and so. Your parents don’t need to know that.", "YTA you outted someone without their consent", "Bro whyyyyy would you do that 🤣 I genuinely hope the first time you're in bed with someone he rushes up to y'all, gasps loudly, and runs out to tell the world 🤣 YTA, learn to mind ya own damn business and cover for him, you know, like what A BROTHER DOES lmao", "YTA \n You never out anyone,  ever. There was absolutely NO NEED to share that piece of information with your parents, unless you wanted to stir shit.\n\nIf you are old enough to be on the internet,  you are old enough to know that your parents would have had SOME KIND of reaction, and that it might not be good.  And if you honestly want us to believe that you're so naive you don't know that,  then you're probably too naive to have unsupervised access to Reddit", "YTA. And I wish people would stop assuming that somebody being out of order/doing something careless automatically means they may be autistic...not exactly encouraging for those of us who are autistic and wouldn't dream of doing something like this in a million years.", "Based on what this sounds like, Wolfe’s friend sounds like he is a male and the fact that the friend can’t come over seems like there is homophobia in your family. \n\nNot sure if I am right but regardless YTA. It wasn’t any of your business. You could have said “he’s busy”. You might not feel like it’s a big deal, but it was.", "NTA, you are not obliged to lie for him. You only told the truth. You are In the clear. Ignore all the Y.   T.     A’s", "YTA. Drama queen.", "this is crazy YTA wow", "You are the asshole.", "YTA. \n\nWhat you should have done was say to your parents 'they'll be down in a minute. \nThere was no need to just expose him like that.", "Another “ it’s just the truth” guy. Do you know what discretion is? Look it up. YTA.", "INFO Why did you say anything? YTA for sure but if you can think of a good reason why you said something maybe you'll reflect on why you're such an AH.", "YTA. Your brother is 18 and y’all need to mind ya business.", "Yta you did this to show up your brother", "YTA \n\nBut I am afraid you need a few more years to understand the damage you caused, mostly to your relationship with your brother", "YTA \"he's ready soon\" would have been enough and no lie.   \nYour parents are A too imo but thats not the question here so...", "YTA big time. Damn this sucks so bad dude. Siblings are supposed look out for each other. Your immaturity  and ignorance here probably just set your brother back so far. \n\nThis same thing happened to me before I came out - I was in your brother’s position. My brother walked in, I was mortified. He told my mom and their response was homophobic and sent me to therapy to “fix it”. \n\nYou’re 16. Grow tf up. Use common sense. Your brother is going through something. Seems like you just wanted the attention.", "OP is an AH, and I'm not buying the naive act.  He's intentionally playing stupid to round off the corners of how harshly he's being rebuked.", "Lol \"Wolfe\"", "NTA\n\nIf you saw your brother kissing a girl...and told your parents no one on here would care. But also...you wouldnt be allowed to have that girl up in your room. If youre gay the same rules still apply. No boys in your room. Hang out in the common spaces. Being gay doesnt mean you get to have a sexual free for all and people have to lie to cover for you. Asking someone to lie is a dick move.", "NTA You weren’t asked to not say anything so weren’t betraying anyone.  As you said, they were kissing in the open.", "Before saying things about others, ask yourself:\nIs it honest?\nIs it necessary?\nIs it kind?\n\nIf TWO of these don't apply, keep your mouth shut.\n\nYou are a teenager, mumbling I don't know and shrugging is probably your go to when your parents question you. Should have stuck with that.\n\nYTA.  Hopefully just a thoughtless teen and not vindictive, but go apologize to your brother.", "YTA 100%. Don’t out your brother out of random. Even more so by outing his friend as well.", "YTA.\n\nRegardless of him getting into trouble, why tell them that? It’s none of their business at all", "YTA and good luck having a future relationship with your brother. This was huge.", "YTA. Learn to read the room. What if their reaction wasn't \"just to bar entry\" to his friend, but also physical violence and kicking out of the house into being homeless? You do not out someone. And you are just using the excuse of \"being truthful\" to your parents because deep down, you just wanted to cause a reaction.", "YTA and this relationship is probably over indefinitely between y’all two.", "You are ABSOLUTELY the ass hole. What the hell is wrong with you? You don’t “out” anyone like that! I almost feel like you KNEW how your family would react to that news. You’re more than an asshole. This was just awful to do to anyone … but your own BROTHER? Yikes. \n\nJust say you hate that your brother might be gay. YTA", "YTA. If you didn’t mean any harm then apologise. It also has nothing to do with lying, it wasn’t your thing to tell", "YTA and you owe him an apology for outing him. \n\ni get that you were just trying to be honest and that it wasn’t your fault you stumbled upon them, but one of the things you learn in life is that you don’t have to include every detail to be honest. take it as a learning lesson for next time that you’re better off being vague than risk unintentionally outing anyone.", "YTA? you easily could've made it less awkward by saying he was just with his friend. instead, you added more to his embarrassment by straight up telling your parents? there's no way you thought it \"wouldn't be a big deal\" if you noticed he was embarrassed. there's a good chance he wasn't comfortable talking about that with his family", "YTA you shouldn’t have told them because you should’ve read the room on why they jumped when you caught them kissing.", "Dumb ass", "YTA. Big time! It was none of your business first of all. And secondly, it seems like you are jealous of your brother for some reasons. Are you older or younger to him?", "NTA you didn’t do anything wrong. If he was that worried about being caught he shouldn’t be doing it where he can be. Your parents seem like they suck", "NTA he didn’t tell you not to tell. You are not responsible to lie for others", "Nta. He did it out of his bedroom. If OP isn't the one to check on him, his parents will. So either way, they will find it out. His brother need to be careful if he didn't want everyone to find it out.", "Everyone here is insane. NTA!! The bother should have been more careful. It could have easily been the dad or mom that walked upstairs to get him and seen. It would still be this outcome. The parents asked what he was doing OP told what he was doing. That is not the OP's fault for answering his parents question.", "Nta", "This has to be satire…. There’s no way someone can be so damn dense 🤦🏽‍♀️", "Lmao are you autistic or what\n\nIf the friend is a dude then you just outed your brother and that’s so dangerous, you don’t know how your parents will react to that\n\nIf you want a relationship with your brother then being a suck up to your parents isn’t the way to do it\n\nIdk YTA", "You didn’t even have to ask this one you know you are wrong. If he did the same to you you would be mad. You’re just being that sibling. You knew exactly what you was doing,getting your brother in trouble.", "How can you be this obtuse at 16?", "Sounds like you’re a well raised kid. Don’t listen to people that tell you to lie. Lies in relationships are what brings trouble and they know it.", "YTA and your parents are bigots. You owe your brother an apology big time", "YTA and you know it.. I assume your the tattletale of the family… did you accomplish what you wanted? YTA", "OP must be doing all of his making-out sessions in front of his parents, since he seems to think all teenage boys should let their parents know who they're kissing.", "Am I imagining this? OP doesn’t mention gender of the friend, just the brother? \n\nIf it was a person of the same gender, that was a really insensitive move and you have essentially just Outed your bro to your parents (if they didn’t know already)… if it’s a person of the opposite gender I don’t think it’s such a loaded tattletale. \n\nWhen I was a teenager I was never allowed a person of opposite gender in my bedroom without the door open. My parents were not homophobic, they just didn’t want any unexpected teenage pregnancies occurring in their house. \n\nIn any case. Snitching on your bro is never nice. For that reason alone, YTA.", "YTA. (Assuming this is even a true story. \"18th birthday\" plus \"16M\" raises a few doubts. Or it might be a typo.)\n\nWe never, ever, EVER, under ANY circumstances whatsoever, out someone without their permission. You just don't do it. You especially don't out your brother to homophobic parents. What on Earth were you thinking?", "YTA - you don’t snitch on your siblings unless they are truly in danger/potential danger.", "Hey, I think there’s a typo in your post. You wrote 16M, but clearly you meant 5M, because no 16 year old is oblivious enough to not realize when to keep their mouth shut about that. So, since you have no filter and just blurt out everything you see, I have to assume you’re actually 5.\n\nYTA.", "YTA It’s never okay to out someone", "NTA if he’s trying to keep it a secret maybe shut the door", "YTA. Never snitch on sibling period.", "YTA -  and disposable to out your brother like that.  Very likely ruined your relationship forever", "YTA and congratulations you just destroyed any trust your brother had in you. I have a little sister like you too who did something similar and guess what? We grew up to hate each other for a long time. It took us YEARS to be cool again.", "[deleted]", "My guess is that OP knew it would get his brother in trouble, I’m getting some strong homophobic vibes from OP and his parents, and so he wanted to start shit. Maybe he was jealous of his brother for getting attention on his birthday or some other childish reason.", "Tattling", "Why was the brother having an ‘intimate’ moment in his parents hallway and not even in his room?\n\nHe is not entitled to privacy while in the public areas of the house, he could have done it in his room if he wanted to kiss his friend so bad.", "snitchhhhh", "I'm trying to shift the narrative off ripping into the child onto to the parents, but I guess I'm doing a terrible job because I'm getting mass downvoted.", "Reminds me of a poster I went thru with summer camp kids about \"telling\" vs \"tattling\". Telling is done with the intent of keeping yourself and others safe, i.e. because something happening is dangerous, something is broken, someone is hurt, someone hurt you on purpose, or you can't solve the problem on your own and need help. Tattling is done with the intent of getting someone in trouble because no one is hurt, there is no danger, you don't need help and you could solve the problem on your own. OP was out here being a 16 year old tattle tell and def an AH.", "Was that a comment I missed or something? I didn't see OP say anything about that", "This was my thought process honestly. Especially since commenters had to explain to OP how exactly he actually had outed his brother. Like...this reads like OP has no concept of social cues and rules and a drive to tell the truth even when it's not warranted. He still doesn't seem to understand the gravity of outing his brother either. Even with a disability though, OP is def the AH, and owes his brother a massive apology, which OP should expect his brother to potentially not even accept.", "anybody with half of a braincell knows that you don't run to your parents when you brother starts kissing his friend!", "Didn’t need to be that specific though. Could have just said that he was with his friend and he’d be down in a minute or two. Means he’s still telling the truth and his brother would still have his friend come over without issues.", "They didn't have to lie. All they had to do was respect the fact that the brother is not not out to the parents. OP is DEFINITELY the AH and you would be too if you ever outed someone who wasn't ready to come out. That is so wrong and gross. YTA.", "Do us all a favor. Since you don't seem to know this yet. Don't out people who aren't ready to come out. NO ONE SHOULD OUT ANYONE UNLESS A LIFE IS IN DANGER. So if this ever comes up to you, DON'T OUT ANYONE. Period. YTA if you do and so is OP for doing exactly that.", "OP's brother's friend is male and he may have not been out yet.", "At what point in this story is the brother's friend's gender revealed?", "Outing someone is literally never okay. For many it can be dangerous but even if that wasn’t the case here, that was not OPs place", "Yeah, I guess his only real mistake was trusting his little brother to have his back.", "You said he looked embarrassed when you saw him. You were given enough feedback to understand if he was embarrassed at you seeing, that it would’ve been more if your parents knew also.  In other words, it’s like you are saying “Well, you made this decision to kiss where I caught you, so I am telling.”  \n\nHow has your relationship with your brother been growing up? Did both of you tell on each other a lot? Did you brother use to tell on you a lot? Did you both have a rule with each other never to lie to your parents or “cover” for each other?", "he should have been more careful, but that doesn't mean you're not an asshole for outing him", "Why do you suck so much?", "I'm not going to be harsh like others. You're a genuinely clue person from what I've read so far. And your brother was also kissing quite openly.", "YTA", "I could see this reasoning if you were 6 not 16. I’m sure your parents have had the what’s acceptable behavior in their house discussion. Their stance on dating, bf/gf privacy expectations. Also if your brother hasn’t come out yet, how are you oblivious to the fact you shouldn’t out someone. Your actions had to be more intentional than your letting on and I’m sure your brother knows that.", "Perhaps you're right in the respect of \"get more privacy,\" but you're stupid wrong if you think that just because he made an oopsie in that regard means that you should tell everybody his business. Do you want your brother to hate you? I mean, if you don't care then why would you come to this subreddit in the first place, bro? Learn some respect lol like dang", "That’s actually more concerning though lol 🤦🏻‍♀️🤣", "Idk I think OP might be trolling. I mean OP is young-ish, 16….but they are brothers, right? Presumably told on each other growing up and covered for each other…..OP’s gotta know. The only other thing I thought was younger generations are far more accepting of same sex stuff, and taught by media and society that that sort of thing is “no big deal” (every tv show ever, today, coming out is shrugged off and warmly accepted)…I guess if you watch a lot of tv and somehow miss the parts where parents still think same-sex stuff is wrong, you might be non-challant about it too….but I think deep down he knows.", "Nah, OP is going *HARD* trying to prove he’s not an a-hole, he definitely is. His replies to someone explaining that he outed his brother are slightly homophobic and *very* contrary to the original post", "Nah probably just autistic tbh", "If OP is genuinely that stupid, than they don't need unsupervised access to the internet", "no, it fucking isn't. who he's dating or not dating is no one's business but his", "Even if he's making out with his girlfriend you just don't say that shit. It doesn't matter boy or girl he's with,  a decent person wouldn't say \"oh, they're kissing\". You'll say they are together, they will soon be here but you don't have to specify.\nOP YTA", "I understand your perspective. If OP responded in an innocuous manner based on the perceived normalcy of his brothe making out with a guy that’s very non homophobic however he’s still a shit brother and TA. He shouldn’t have said he was making out with anyone. That’s like answering the phone and saying your parent is on the toilet. It’s just bad form.", "Dude I have female friends maybe I am daft but I just assumed friend was female and that still made my decision YTA if friend is male that makes op look like he was trying to stir up trouble and an even bigger ah than I thought", "you sound like someone with no idea how the real world works. not everyone is safe coming out to their family. pointing that out is not 'anti gay rhetoric'. frankly, you're the one being more harmful to gay people by insisting that there's nothing wrong with outing them.", "Unfortunately the subject of this post and place is \"Am I the Asshole\". He may be 16, but he came to ask and he is getting an answer. If the parents were to come here and ask they'd get the same thing. And honestly even if he asked \"Am I the Asshole or are my parents\" everyone's response is going to be both, because at 16, in 2023, OP should know better than to out his brother, and his parents are homophobes, which no one with any decency is. OP is tattle tell and TA and if that's hard for him to hear, I guess he'll consider his words and how much truth really needs to be told in the future.", "nobody here is defending the parents. ripping into them doesn't change anything. you don't out people. end of story.", "I understand what you are trying to say. But are you gay? You don’t have to answer that here. It reminds me of people that go way overboard trying to be open-minded and inclusive, so much so that they start promoting ideas that are actually harmful to the group they are trying to help….because they personally have no actual idea what it’s like to live in their shoes. When the younger generation today becomes parents, I think “outing” will naturally dissipate as a need…but until then, it’s a very real consideration for actual gay young adults.", "In fairness the question of the thread is whether or not the OP is an asshole, and he is an asshole regardless of the parents.", "They”child” posted on the internet for strangers to judge his judgement …", "Agreed, he definitely owes his brother an apology. \nI have a ton of mental health issues, and am currently on steroids for a bronchial infection, man do I get angry at the moment, but goddamnit do I apologise once I realise that I've made a mistake", "So? Two people that like each other kissed... OOoooeeee big whoop... Does anyone really give a shit if they're both dudes? Isn't it 2023?", "Oh shit your right, I think the mountain of pronouns and calling the friend \"his friend\" over and over just made me think male. Deleting comment now.", "And he is 16!  It was impulsive moment probably.", "Just to let you know, we autistic people are capable of understanding the concept of betrayal, and why that is not a good idea.", "Right, so let's go after the people who make it dangerous. Let's tell the OP to go up to his parents and call them out and ask why his brothers mate isn't allowed over anymore as they weren't doing anything wrong. This shouldn't be brother vs brother, they should team up to shame the parents.", "Obligatory I'm not gay but a lot of my friends are response. My best mate is a lesbian, I don't have to worry about saying to someone else she is gay as it's not a secret and there's nothing wrong with it, I realise it's very privileged to be able to say that. That's what I don't like about just ripping into the OP  and barely anyone is pointing out to him that it's actually his parents that are the real bad guys and not him. These parents had their children in about 2004-2006, it's not the 1980s anymore, unless they are actually from the middle east, OP shouldn't have had to worry was he actually about to out his gay brother (who possibly isn't even gay) to his parents and put him in danger. It shouldn't have been anymore serious than saying he's just finishing a level on his PlayStation. Obviously the OP should have just said something like that and not said he was kissing anyone.\n\nMy big issue is that my post saying the parents are the real bad guys has about 40 downvotes, and the past saying you outed him on purpose has 40 up votes. I don't think that's the right narrative.", "Exactly. Disabilities and mental health issues can def explain bad behavior, but it doesn't excuse it and when you mess up you have to own it and apologize just like anyone else would and should.", "Do we know that his friend is banned? Or is he just restricted from brothers bedroom?", "It wasn't OP's place to out them. That makes OP a HUGE asshole. They could have said ANYTHING, but wanted to out them. Learn to respect people's privacy, or you and OP won't have any friends left. YTA.", "OP is 16. Brother is 18", "So why did you have to tell anyone? Are you always a snitch?", "Homie…. Are you just dumb! Are you seriously not understanding the fact the he was making out with his friend, who could be more than a friend, and was embarrassed he was caught. Why the eff would you blab that to your parents?! Gay or not! Bi or not! You literally could have said he is with his friend. And he could still be gay even if he has had gfs in the past.", "he was kissing a guy. your brother certainly isn't straight.", "You seem intellectually challenged... YTA", "you think that outing a gay person before they’re ready is a good thing because letting them come out on their own time is making it taboo…? sorry, but you don’t really get to choose to share someone’s secret that could genuinely harm them in the name of #pride or whatever.", "\n\n>You're reinforcing negative stereotypes that it's shameful to be gay.\n\nnobody is reinforcing anything. it wouldn't be any of their business if his friend had been a girl either.", "So if you went to the middle east and pointed out a gay guy and he was killed you would just go \"Well you should be against the people who hate them not the person pointing them out.\" I'm sure you are going yo say that's extreme example, which it is. But it points out the fact outing someone can be dangerous and is still someone's responsibility to not out someone who's not ready. It's why the \"if kids question their sexuality at all you should instantly tell parents\" laws are considered so bad since parents have a lot of control over their kids (even when they are young adults)\n\nMore than one person can be problematic for different reasons. Nobody is saying OP is worse than the parents, but he made a very bad move, likely on purpose.", "my mom is violently homophobic. if one of my siblings did something like this i'd be beat and kicked out the house. you're fucking ignorant and ridiculous if you think people aren't homophobic nowadays. OP is TA 200%", ">I'm old enough to know that a lot has changed since I was a kid. It's not shameful to be gay.\n\nbut clearly not smart enough to know that just as much has stayed the same. seriously, the Supreme Court just ruled that it's legal to discriminate against gay people. the wrold is not fucking sunshine and rainbows. we still live in a time where this shit is dangerous. you're woefully naive and your attitude will get people hurt.", "Have you not heard of discrimination towards gay people? People wanting to keep their orientation or romantic life private until a time of their own choosing? These aren't wild concepts. If his brother wanted his parents to know he could tell them himself, and if he didn't want them to know then why should his brother out him? It's a very clear case of being an asshole to disregard manners and basic decency like this. OP could have simply said \"brother is with his friend\" and not even have to lie to his parents.", "I understand what you mean and in a way you are coming from the right place, but I think people are downvoting you because it’s as if you are encouraging children to be part of an experiment *right now* of telling parents without discretion that they or their siblings are gay. Because of modern day climate it’s still very dangerous and harmful to young adults to be subjected to this *without their consent*….I think that takes priority in this situation here. \n\nOP’s brother is 18, so he is an adult technically. OP, if encouraged, could do a lot of damage to his brother’s self-esteem, and even put his life in danger if he followed the advice you seem to be suggesting, and started telling everyone in the family and all of Wolfe’s friends about what he saw. Wolf could have an abundance of bad friends and not know it yet. He could become completely ostracized and sink into a deep depression and become suicidal. This kind of thing happens today **still**. That’s the danger, that’s why the downvoting, that’s why it’s a caution and “not outing” anyone without their consent is still a thing. \n\nDo you see what I am trying to say here? I did also think and wrote in another post that the only reason I could think OP might’ve acted that way was because he is so conditioned to view same sex kissing as “no big deal”….as every tv show shows someone admitting openly to friends that they are gay and everyone applauds or brushes it off positively. Media is telling us that is the *goal*…to normalize it to the younger generation, so that when they are parents there is no issue…but we are not there yet as a society, far, far from it. Those same tv shows show plenty of “villians” as the newly gay teens’ own parents…so there are still plenty of warnings of the reality of what I am saying. \n\nYou don’t know the parents, OP is only 16, and advising he tell his parents against brother’s wishes, and then to tell brother they gang up against bigot parents, you have no idea the consequences of that either. Parents could withhold college tuition, financial support etc…point is, it’s the brothers decision alone. And OP at most you could encourage them to keep that open mindedness….but to most of us here, any “support” has to stop there and a very clear warning given about the real, practical dangers of what they did.", "True enough then. Changing the rating to ESH now, because people can't find anything better to do with their time except be dicks to each other over stupid shit. There, now no one is singled out and everyone can get on with their day.", "Oh. Read it wrong. Thanks.", "Or OP didn't think his parents were homophobic and didn't see the big deal in his brother kissing someone? If it was a girl he'd have likely done the same as sibling teasing. If he thought their parents wouldn't care he had no reason to think it unsafe or to think they didn't know given from his pov this was out in the open.", "I don't agree that OP did it on purpose, I genuinely feel he was being naive or just answered without thinking. It's 100% the parents who are the issue and all these y-t-a posts against a child are creating the wrong narrative.", "That's the point. \n\nThat's why you don't out people, because you never knew how they'll react.", "fr", "You really need to hear what people are telling you. I don’t think anyone believes you that you didn’t understand the significance of what you did. You both are brothers and presumably have “told” on each other growing up and understand exactly what that means. \n\nAre you really that unaware of what same sex kissing means to older generations? Do you know anything about gay people? That many young ones have girlfriends as “covers” for a very long time. Regardless of whether your brother is actually gay or not…Not your business. You broke your brother’s trust. All you had to say was…nothing.\n\nIf you don’t want to lie to your parents, you say “they are in the hallway”….you don’t have to say what they are doing. If you were an older brother and your brother was 7 years old kissing his friend, male or female, then I think your parents would have a right to know, because there may be conversations about age-appropriate behavior in general that need to be had. But your brother is an adult now. I think you know deep down what you really did.", "\"How can I have outed him if he's not even gay??\"\n\nonly one is true, either you knew it would get him in trouble or you didn't know, you can't be both smart enough to realize he can be bi yet think doing what you did isn't outing him", "Bruh...if your brother and his male friend are kissing, but have had girlfriends in the past, the chances they are bi or potentially figuring out they're gay is more likely than \"for shits and giggles\" like you saying \"prolly not even that tbh\" implies. Straight men who are confident in their sexuality as a straight man don't usually go experimenting by kissing their male friends.", "Yeah man this is a massive YTA. No matter if he has a gf there is clearly something and you did out him. \n\nBest case is you seriously need to start considering how your actions impact others because you did not even consider how telling your parents could impact him. Worst case is you told deliberately to start shit.\n\nJust because he 'was not being carefull enough' does not give you the right to spread info. Imagine how you would feel.", "Straight guys dont kiss other guys man. Your brother is gay", "He was experimenting with his sexuality with a friend he trusted, you knew he was embarrassed about it, and you still outed him. I’d wager you also knew your parents are homophobic & would ban the friend. How hard you’re going trying to stand up for your friend just goes to show that you *knew* it was a horrible thing to do.", "Answering without thinking still makes him an asshole. If you don't have any consideration for other people's feelings or act without any consideration for the negative effects of your actions on other people's lives that still makes you an asshole.", "Many people who post don't believe they are the asshole that is kinda the point. They are doing things without thinking or knowing. It is pointing out that it was a bad thing to do regardless of direct intent.  If we just excused everyone who didn't intend to cause a negative outcome then very few people would be called out.", "Yeah but everyone's treating this kid like an evil mastermind who did it on purpose when he's just someone who didn't think and assumed it was safe because to him it's no big deal? He's not an asshole just a bit of an idiot who still should apologise.", "Who told you he just didn't think? \n\nThat's not what his comments say.\n\nThere isn't an American teenager out there that doesn't know this stuff is a big deal - it's a huge part of the Gen Z cultural zeitgeist.\n\nHe was fully aware that outing someone is a shit thing to do. \n\nYou can be an AH without being a mastermind.\n\nHe did something shitty *and he's refusing to accept responsibility* for that. \n\nEven if he didn't mean to be one then, by refusing to acknowledge the *real* consequences of his actions - which served zero purpose, he's an AH.\n\nMost teens are.", "YTA.", "YTA", "You are a bad person. Hope this helps 👍🏽\n\nEdit: Also, YTA", "YTA and a terrible brother", "YTA bro c'mon now..."]}