{"id": 2264, "submission_id": "yuj7co", "title": "AITA for refusing to spend holidays with my younger brother’s wife?", "selftext": "I (31f) refuse to spend holidays with my brother’s wife(BW). I told my family it was her or me.\n\nThey lived with my parents after my niece was born. They didnt pay rent, or for anything really. BW had untreated ppd, so she struggled to care for the baby from the start. She refused to seek treatment. My mom took on the caretaker role niece, & did the sleepless nights & everything in between. My mom raised her, because they offered little to no help. This was until December ‘21. A fight broke out between them all. Niece was sick, & BW complained about being constantly woke up, & never offered to help with her daughter. The fight escalated, & she left with niece. Afterward, she wouldn’t let my mom to see my niece, & the fights go on for months. This ripped my mom apart, & caused a subsequent nervous breakdown. To her, it was as if she had had her own child taken from her. \n\nThis was made worse by BW telling my mom that she was “too crazy” to care for my niece, & could not be trusted alone with her. BW enjoyed using niece as a tool to manipulate my parents. The last 6 months or so, she has purposely tormented them, because she knows my parents will do anything to see their granddaughter. They make plans to see niece, & drive 45 min to pick her up to then have BW change her mind when they get there & say niece can’t go. Her favorite thing has been to allow niece to come to family functions, but call right as everyone is together to make them bring niece home immediately. \n\nA few months ago, she filed serious charges against my brother while he was out of state for work. We found this out when the police showed up at my parents house looking for him. She dropped the charges after he agreed she could quit her job, & he would pay her to stay home and take care of their daughter. They were separated at the time, but were & are still married. \n\nThe holidays are coming up, & brother has asked me to try to get along with her to keep the peace during holidays. My parents agree I should be the bigger person. Everyone has decided to let her get away with everything she has done, for the sake of being able to see my niece & the new baby in the future. They don’t see any way of her ever facing consequences for her actions, because she is so good at lying & manipulating. So their solution is to just suck it up, & let her wreak havoc whenever she feels like it. She has never apologized or acknowledged any wrongdoing, and if she is challenged on it, she uses her daughter as a weapon. \n\nSo, AITA for not giving in?", "created_utc": 1668384143, "permalink": "/r/AmItheAsshole/comments/yuj7co/aita_for_refusing_to_spend_holidays_with_my/", "score": 77, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m making my parents choose between seeing me or their granddaughter for the holidays.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. And why is your brother having more children with her?", "NTA there is no way I could be in the same house with someone who emotionally abused my parents so I don't blame you.", "NTA and you shouldn’t give in.\n\nThere is seriously something wrong with your BW* other than ppd. She’s a leech and she knows she has everyone where she wants them. You guys should be documenting everything she’s doing in case of a divorce and your brother seems like a pushover so maybe don’t tell him even though it will help him later. \n\nIf you invite the baby anywhere, don’t let your family react upset when she changes her mind because she wants to see your mom begging. Carry on as usual. She will call when she wants free childcare. \n\nYour mom is not going to give up on her grandchild so I doubt things will ever get better for her, but the rest of you can be smart and prepare of the inevitable divorce.\n\nEdited to make vote clear", "NTA.  You are supposed to be happy at the holidays as well.  Find something that will bring you joy.", "NTA and of course BW will never change. There are absolutely no consequences for her crappy behavior.", "NTA.  But you alone seem willing to protect the child and your family.  Is it possible for you to record these interactions to build the case against her?  If so, go for the purpose of protecting the fam.", "NTA. Sounds like a very toxic situation", "NTA. Absolutely not! And that poor child will wind up dead by her own hand with a mother like that and no family to fight for her. Them rolling over and allowing, the human is going to take the child and go to another state or further. They need to start fighting in the courts to get that child away from her.", "NTA", "NTA but it sounds like you will have to spend the holiday somewhere else", "“niece & the new baby”\n\n***NEW BABY!?!?!?***\n\nFFS. What is wrong with your brother? How could he let this happen?These children are human beings and they deserve not to be born to a lunatic and a spineless fool who negates his responsibilities.\n\nAnd by the way, ~~YTA~~. You’re not helping anything by making things harder and more painful for your parents. They will always choose to see their grandchildren, whatever that means. your principles need to take a seat. Support your parents, attend Christmas.\n\n&#x200B;\n\nETA: Judgement amended upon your answer. You are in an impossible situation. NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (31f) refuse to spend holidays with my brother’s wife(BW). I told my family it was her or me.\n\nThey lived with my parents after my niece was born. They didnt pay rent, or for anything really. BW had untreated ppd, so she struggled to care for the baby from the start. She refused to seek treatment. My mom took on the caretaker role niece, & did the sleepless nights & everything in between. My mom raised her, because they offered little to no help. This was until December ‘21. A fight broke out between them all. Niece was sick, & BW complained about being constantly woke up, & never offered to help with her daughter. The fight escalated, & she left with niece. Afterward, she wouldn’t let my mom to see my niece, & the fights go on for months. This ripped my mom apart, & caused a subsequent nervous breakdown. To her, it was as if she had had her own child taken from her. \n\nThis was made worse by BW telling my mom that she was “too crazy” to care for my niece, & could not be trusted alone with her. BW enjoyed using niece as a tool to manipulate my parents. The last 6 months or so, she has purposely tormented them, because she knows my parents will do anything to see their granddaughter. They make plans to see niece, & drive 45 min to pick her up to then have BW change her mind when they get there & say niece can’t go. Her favorite thing has been to allow niece to come to family functions, but call right as everyone is together to make them bring niece home immediately. \n\nA few months ago, she filed serious charges against my brother while he was out of state for work. We found this out when the police showed up at my parents house looking for him. She dropped the charges after he agreed she could quit her job, & he would pay her to stay home and take care of their daughter. They were separated at the time, but were & are still married. \n\nThe holidays are coming up, & brother has asked me to try to get along with her to keep the peace during holidays. My parents agree I should be the bigger person. Everyone has decided to let her get away with everything she has done, for the sake of being able to see my niece & the new baby in the future. They don’t see any way of her ever facing consequences for her actions, because she is so good at lying & manipulating. So their solution is to just suck it up, & let her wreak havoc whenever she feels like it. She has never apologized or acknowledged any wrongdoing, and if she is challenged on it, she uses her daughter as a weapon. \n\nSo, AITA for not giving in?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Brother needs to grow a spine. All of this should be documented so if they divorce you have records showing her true side.  I’d keep all emails and text messages.", "ESH - except your niece and maybe your parents.  Your SIL sounds like a real AH.  But all of the AH things she is doing haven’t directly affected you. They have really hurt your parents and I feel terribly for them.  I assume you are so angry at your SIL (deservedly so) because of the pain she has caused your parents.  But your ultimatum won’t help your parents, it will just hurt them more.  You are correct to want to help your niece and parents.  I don’t know how you can do that.  But the ultimatum won’t help.", "I’d wait till she was out the house and call out for it all because she’s still cause drama anyway  but that’s me \n\nNTA", "Grandparents should apply for grandparents rights citing that they cared for her as an infant.", "YTA for the way you are looking at the situation. If you don't want to be around her or witness the bullshit she causes, fine. I can understand that and would react the same way. \n\nYou refusing to see her is not punishing her or holding her to account in any way though since everyone else accepts her behavior. If that's your intention, you will fail miserably, and only cause you more aggravation.", "Confusing perspective, have you talked to BW to hear her side of the story? There’s too much going on here and too much one-sidedness for this all to be exactly how it happened.", "That’s a great question, but I found out she was pregnant when the gender was announced online. I’m not certain this child belongs to him, since he has been working all over the country this past year and is rarely in the state.", "I understand your perspective. I’m trying to avoid the inevitable fight, and BW telling my parents that my niece can’t go anywhere I am and tying my parents hands. They don’t want to have to choose between myself and their granddaughter, so I’m trying to make the choice for them now.", "We consulted a lawyer a few months ago, and in the state we live in, grandparents have no legal visitation rights until the parents of the child are divorced.", "It’s not that I am refusing to see her. I saw her in October, and we just avoided each other. But when things ultimately go up in flames on Thanksgiving day, I will be the one left holding the matches and to blame for not kowtowing to her demands.", "She doesn’t want to speak to me, and I can’t make her.", "This is an absolute clusterfuck. Your brother is married to a very sick woman. I feel so bad for your parents, you, and those kids.\n\nETA: A couple days ago I was excoriated and accused  of supporting  eugenics because I firmly believe parenthood should be a privilege and not a right. And here is a perfect example of why I think the way I do.", "Well, NTA, but your family has made their choice.  They are obviously all choosing to be around BW regardless of your threats. I totally get why you are making a stand but I hope you aren't hoping they will all suddenly side with you. \n\nIt's pretty rich of your brother to call you an AH after how he allowed his wife to mistreat her parents.  He's as much of a villain here as she is...", "INFO:\n\nWhat were the serious charges?\nWas your brother guilty of what he was being charged with?\n\nJust wondering as if it was sexual assault or domestic violence, the proportion of women who falsely accuse men of these crimes is incredibly small. \n\nIt is an enormous ordeal to go through, and incredibly challenging to convince the police anything actually happened in the first place. Her ending up back with him, with promises of a better life, is a common outcome in cases of domestic abuse.\n\nYou're N T A if she is legitimately a blackmailer, N A H if she is acting erratic because she's been the victim of a crime.", "You are NTA, but at the same time, this seems like you're punishing your parents as much as you're punishing her. Or, to put it another way - your BW probably doesn't care if you're there or not. She probably couldn't care less about you, and you not being there will mean absolutely nothing to her. You not being there will hurt your parents though. You are NTA, you are never TA for deciding not to spend time with unpleasant people, but you are also not showing her anything because she is probably too horrible to even understand that's what you're doing.", "Please don't go to this unholiday.\n\nNta", "NTA.  Next  time the fabricated serious charges could be against you.  Tread carefully.  If this new baby is not his, he should ask for paternity  test. Otherwise he could be on the hook for yeats for child support on a kid that isn't even his.  Even if he stays with her now, that may change.", "NTA. They may still give in to her, but you may find it less stressful just making other plans if that's the case.", "NTA, maybe you could have your parents over for your own get together before or after the holidays. Give them a bit of a break and not put them more in the middle of it all.", "I have been begging since she was 6 months old for them to do something about her behavior. They’re afraid of her. I’ve consulted lawyers and exhausted my options. Since I am not directly involved in any of it, there’s nothing I can do until one of them decide to take legal action. The safety of my niece is my main concern, and I’m afraid of what will happen as she gets older.", "When I posted this originally, I added what the charges were and the post was removed. These comments may well be removed as well. \n\nThere was a sexual assault allegation, and a protection from abuse order. Is he guilty? I don’t know. I’ve watched enough true crime to know that you have no way of knowing what someone is capable of doing. I have asked him if he’s guilty and he said no. It’s not for me to say. The circumstances surrounding the entire situation don’t lead me to believe that the allegations were true, but again I can’t say that with any certainty.", "This isn’t to punish her, or to prove any sort of point. If I don’t show up because she’s there, she will see it as a win. I said this in another reply, but I am trying to avoid a fight with her, that will inevitably cause my parents to have to choose between myself and their granddaughter. I have no doubt that she will give them an ultimatum, and decide my niece can’t be anywhere I am. \n\nI told them I would bow out and not go, because it’s better for everyone involved. They want me to go anyway, and just ignore her if she picks a fight with me.", "Thanks for answering!\nYou're right, this will probably be removed.\n\nBecause of what you've said, especially that a protection order was granted, I'd advise you to treat her with as much grace as you can muster. \n\nI don't think you're going to find out the true story, but if your mother and brother are urging you to go on as normal then I wonder if they are trying to do a bit of damage control. \n\nI think you're too far from the actual problem for any strong feelings or response to be appropriate. That being said, if the situation makes you that uncomfortable, you shouldn't feel compelled to go.", "Because your mom stepped up as a parent and provided that roll, you may..  check a few other lawyers."]}