{"id": 22733, "submission_id": "154s1pc", "title": "AITA for refusing to attend my friends destination wedding?", "selftext": "\nMy (23F) friend, Sarah (25F), and I have been close since childhood. We've shared many memories and experiences, and I consider her like a sister. Recently, Sarah got engaged to her long-term partner, Mark (28M), and they began planning a destination wedding at a luxurious resort in a tropical paradise.\n\nWhen Sarah first announced the destination, I was excited for her and congratulated her wholeheartedly. However, as the wedding details unfolded, I realized attending the wedding would be a significant financial burden for me. The cost of travel, accommodation, and other expenses would eat into my savings and disrupt my budget for the foreseeable future.\n\nI work a stable job and can afford my everyday expenses comfortably, but splurging on an extravagant destination wedding just isn't feasible for me at this point in my life. Moreover, I have other financial goals, such as saving for a down payment on a house, that I need to prioritize.\n\nWhen Sarah asked if I would be attending, I expressed my genuine happiness for her but explained my financial constraints and regretfully declined. I assured her that I would be there in spirit and would celebrate with them during their reception back home.\n\nSarah didn't take my refusal well and accused me of not caring enough about our friendship to make an effort. She argued that if I truly valued our friendship, I would find a way to be present on her special day. She pointed out that other friends were making sacrifices to attend, and it hurt her that I wasn't doing the same.\n\nI tried to explain my position, emphasizing that it wasn't about not caring, but rather about being responsible with my finances. However, Sarah remained upset and distant, making me feel like a terrible friend.\n\nNow I'm conflicted, wondering if I made the right decision. I don't want to lose our friendship, but I also don't want to put myself in a difficult financial situation for a one-day event. Reddit, AITA for refusing to attend my friend's destination wedding?", "created_utc": 1689862317, "permalink": "/r/AmItheAsshole/comments/154s1pc/aita_for_refusing_to_attend_my_friends/", "score": 88, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My friend is very hurt about my decision to not attend her wedding. I feel as though I should be able to put myself and financial stability first and not be penalized for it. However, this whole this is making me feel like I should just suck it up and go even though I cannot afford it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. If they wanted more people to be able to come, they should have a local wedding and save the tropics for the honeymoon. Guests should not go into debt or risk financial insecurity just to attend a wedding.", "NTA.\n\nIf she says you don't care enough to make the sacrifice, tell her she didn't care enough to make her wedding affordable; one statement is as silly as the other.\n\nAn invitation is not a summons. You are not required to appear.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nMy (23F) friend, Sarah (25F), and I have been close since childhood. We've shared many memories and experiences, and I consider her like a sister. Recently, Sarah got engaged to her long-term partner, Mark (28M), and they began planning a destination wedding at a luxurious resort in a tropical paradise.\n\nWhen Sarah first announced the destination, I was excited for her and congratulated her wholeheartedly. However, as the wedding details unfolded, I realized attending the wedding would be a significant financial burden for me. The cost of travel, accommodation, and other expenses would eat into my savings and disrupt my budget for the foreseeable future.\n\nI work a stable job and can afford my everyday expenses comfortably, but splurging on an extravagant destination wedding just isn't feasible for me at this point in my life. Moreover, I have other financial goals, such as saving for a down payment on a house, that I need to prioritize.\n\nWhen Sarah asked if I would be attending, I expressed my genuine happiness for her but explained my financial constraints and regretfully declined. I assured her that I would be there in spirit and would celebrate with them during their reception back home.\n\nSarah didn't take my refusal well and accused me of not caring enough about our friendship to make an effort. She argued that if I truly valued our friendship, I would find a way to be present on her special day. She pointed out that other friends were making sacrifices to attend, and it hurt her that I wasn't doing the same.\n\nI tried to explain my position, emphasizing that it wasn't about not caring, but rather about being responsible with my finances. However, Sarah remained upset and distant, making me feel like a terrible friend.\n\nNow I'm conflicted, wondering if I made the right decision. I don't want to lose our friendship, but I also don't want to put myself in a difficult financial situation for a one-day event. Reddit, AITA for refusing to attend my friend's destination wedding?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but it is Sarah who doesn’t care enough about family and friends. She is more concerned about her aesthetic than celebrating with family and friends regardless of their financial situation.", "NTA. Destination weddings are ok as long as the couple isn't mad at people for not attending.", "NTA. \n\nNo one has to \"sacrifice\" to support their friend's wedding. \n\nWhen I get a wedding invitation, I look at my calendar and my finances and decide if I can make it. Of course for people I am close to, I move things around, save a little money here, whatever I need to so I can make it work. But that isn't a sacrifice, just like being asked to go on vacation and having to take time off work and spend money isn't a sacrifice. \n\nIf you can't afford to go, you can't afford to go. You shouldn't be going in to debt or putting off your future for an event like this. Is Sarah going to spend the same amount of money on you to celebrate your \"special day\" when you buy a house? Doubtful. \n\nHer wedding is HER special day, and it is lovely to invite people to celebrate with you, and it is lovely to be able to celebrate with a couple. But, when you have a big event, some people can't make it for various reasons- work, competing event, travel- and when you make your wedding harder to attend with a destination that requires lots of people to travel, less people can make it. That's just how it is. \n\nLet Sarah be distant. You can send a card/present and tell her you still want to help out with anything you can, you simply cannot afford to go to her wedding AND pay your bills (she doesn't need to know about your savings account or other money, and she doesn't get an opinion on how you spend or save). This way, you are extending an olive branch AND being clear that you can't attend because you can't afford to. Now that you have been clear, it is up to her to make the next move.", "NTA.\n\nI’m all for destination weddings but they have to come with the expectation that some people won’t be able to make it due to the cost. Unless she can help pay, she has to accept that it’s just a lot of money.", "NTA. All weddings are a ridiculous waste of money but destination weddings are the worst and automatically exclude people who don’t have the time or money to burn", "NTA. It is ridiculous to expect guests to shell out enormous sums for travel and lodging for a six-hour fete. I missed my niece's destination wedding as it would cost $1300 just in airfare. I chose to give a generous monetary gift instead.", "NTA. Destination weddings mean some of your desired guests can’t afford to come. I wouldn’t propose this to her, but if she wanted you there that badly, she could pay or help pay for your travel.\n\nShe has no right to ask you to put yourself in financial hardship, including potential debt, to come to step one of her party. Do not screw yourself over for her.", "You should suggest a zoom attendance, I bet she’d reject it. NTA", "NTA\n\nI personally don't mind a destination wedding. I have been to a couple and have always had a great time. However, the bride and groom were always aware that some people wouldn't be able to attend.\n\nUsually, the couple will have a small party near their home before or after the trip, for people who can't go to the destination. From what you wrote, it sounds like they are doing something like this.\n\nI think it is unreasonable for someone to get angry because everyone doesn't have the money to go to their destination wedding. \n\nIt's great that she wants you there, but she shouldn't put that pressure on you. If you have a good relationship otherwise, maybe mark it down to wedding nerves.", "NTA, when I got married a million years ago we were all starting out, some still in college,etc.. the bridesmaids dresses were clearance, everyone wore their own accessories, my shower was in my friend's basement - I would have never put them in the position of paying out money they didn't have. I would re- evaluate your friendship with her - it's fine for her to have her dream wedding, but to demand you come, knowing what a financial hardship it would be? Don't do it.", "When you plan a destination wedding, you take the risk that a lot of friends and family won’t be able to make it.  NTA - you have to do what’s best for your budget.  You can still attend shower and bachelorette if those are local.  She’s probably just hurt and not mad.", "When you choose to have a destination wedding, there should be NO OBLIGATION for anyone to attend.  It is a HUGE expense and it is unreasonable and selfish to expect/demand people attend.  We did it with my daughter (her choice) and I was very clear to everyone that I completely understood if they could not make it.  You should have to give no reasons for not attending.  It's a big ask.  \n\nThat being said, I'm not against destination weddings.  They are magical and wonderful to celebrate with the friends and family who are able to make the trip.  My point is it should be 100% their choice and there should be no guilt trip if people can not make it. \n\nNTA!", "NTA: If you plan a wedding with a big financial burden on your guest you have to live with most of them not comming. You don't even have to not have enough money. Even if you have enough and can pay it easily you cannot expect that. Especially becuase people have to use their vacation days too... which is not really a matter of financial standing.", "honestly nta. your decision is understandable and reasonable.", "NTA.  Just as she is making your attendance about whether or not you're really a friend, you could just as easily say that if she truly cares about having her friends there she could've planned for a more affordable option.  \n\nThis is the consequence of her decision - there are some who can't attend.", "Other people don’t get to tell you how to spend your money. Maybe if it was *so* important for you to be there SHE should be helping with the cost. \nNTA", "NTA, if your friend cared about you, she would understand that if you can’t afford to go, you can’t go. That’s the problem with destination weddings, they get too expensive for guests to attend.", "NTA.  If care and effort had dollars attached to them, we'd all be caring and make the effort to things we simply can't afford to do.  Who expects anyone to make \"sacrifices\" to attend their wedding?  That's not a friend you are losing, that's a leech you need removed from your life for being so utterly selfish.", "NTA\n\nWhen someone chooses to be married in a destination, they need to accept that many people can’t attend.  She is being the AH here for expecting you to somehow find the $$$ to travel.", "\"You are cordially invited to spend all of your savings on my event \".\n\n??some people.", "NTA your \"friend\"  sounds incredibly shallow.", "NTA. I would never have a destination wedding without offering to pay guest's way. She's a shitty friend.", "She's the idiot thats holding a destination wedding in this financial climate. Just living is expensive at the moment.\n\n&#x200B;\n\nNTA", "NTA and this is why I hate destination weddings.  It puts many people in a financial situation they can't handle.", "NTA. I’m sorry, I would never get mad at my friends for not being able to afford travel somewhere else bc I wanna get married there. Don’t go into debt over someone else’s wedding because it’s not your wedding.", "NTA - she should know better, she scheduled a destination wedding. That means not everyone can go. \n\nIf this is how she treated you, she’s not that good of a friend. Maybe not a friend at all.", "If your friendship costs 10k just to see her say I do…you already lost your friendship.", "NTA.  Anybody who responds to \"I'd love to attend your destination wedding, but I can't afford it\" with anything besides, \"We'll miss you, sorry you can't make it\" is a grade A jerk.", "NTA, don't plan a destination wedding unless you're wealthy to the point you can pay to fly guests out. Sounds like she's a selfish friend honestly", "NTA... I don't know why people do that.\n\nHave the wedding somewhere easily attendable by friends and loved ones.\n\nTake the honeymoon in the tropical paradise.", "NTA, and you could argue that friends don't make friends pay for destination weddings.", "NTA\n\nI realize that destination weddings are a growing trend but generally most people that would attend a wedding locally, either can’t afford how expensive it will be or the time off from work. \n\nI don’t understand why someone would get mad that someone can’t go! \n\nWe have been invited to a few friends kids weddings that were destination weddings such as Disney, Aruba etc. \n\nIn one case the bride was very angry that only a handful of ppl could go. I offered a possible solution and said you could always get married wherever you want but then have the reception back home after, if you wanted more of your friends and family to attend. I thought it was a good compromise since she seemed upset so many people would not be there. She didn’t like my idea and said if people truly loved her they would be there. I explained people can still love you but not afford to be there if they don’t have the money. \n\nNeedless to say we sent them a card with cash.", "NTA.  If she truly valued your friendship, she’d pay for you to be there.", "NTA, sure it would suck a bit but it’s unreasonable to except people to make sacrifices for a destination wedding.", "Friends don’t push other friends to extend themselves beyond financial boundaries, NTA", "NTA. Your friend is being selfish.", "NTA - Bridezillas are real.  I hope she will return to a more normal frame of mind once she is past all this hoopla.  You shouldn't have to sacrifice the down payment for your house for her dream wedding.  I would think less of you if you sacrificed the down payment for your house for YOUR dream wedding!", "NTA. How do people not understand that when they choose a destination wedding they are probably eliminating a lot of their friends and family?  I'm sorry that this has been an important relationship to you but her thinking is messed up.", "NTA, destination wedding typically have less people because a lot of people can’t go to them. Your friend needs to get over herself", "NTA She doesn’t sound like a very good friend and needs to understand having a destination wedding almost always means there’ll be people who simply cannot afford to attend. Do not let her or anyone else guilt you into breaking your bank. Financial responsibility is incredibly important and at a young age impacts your future.", "NTA. It’s an invitation not a summons. If Sarah was getting married around the block from your home you aren’t required to attend. Don’t let her bully you into spending time and money on something you aren’t comfortable with. Maybe the other friends that are attending have more money than you, maybe their parents are helping them, maybe they aren’t as fiscally responsible as you and have no plans to ever save money.", "NTA\n\nHaving a destination wedding does mean that people who don't have a lot of money, people who are ill, etc can't go. You do limit your guest list down a lot.\n\n You gave congratulations and were genuinely happy for her. She is being very entitled.", "NTA.  It sounds like your friend is putting a price on your friendship, and wants you to pay up to prove you deserve to be her friend.  That's a really crummy worldview for her to have - selfish, entitled, and extremely materialistic, not to mention shallow, with a complete disregard for anything other than her own desires.  Expecting you to ruin your financial stability for her one day event is just plain wrong, and shows a serious lack of maturity on her part.  Hopefully, she'll grow up and realize just how selfish she's being.", "When someone plans a destination wedding that requires travel; they should expect even some of their closest family and friends to miss the occasion.    Their big day is great to plan how they want.   Hosting it in exotic location will cut into the guest list", "NTA - one of the downsides of a destination wedding is that a good chunk of people will not be able to attend due to budget/ time constraints. If it were that important to her that you be able to attend, she’d have a local ceremony. As we get older, we outgrow some friends, and its okay.", "NTA\nIf she wants you there bad enough she’ll pay or have a wedding at home.", "NTA. If having her friends there was more important to her than the location, she'd have planned it closer to home.", "NTA.  And honestly, a TRUE friend would not treat you like that when you said you wouldn't be able to make it.", "NTA\n\nA good friend wouldn't demand that you screw over your finances to attend a one-day event.", "NTA. she is being a bride-zilla", "Why is she not covering your expense to attend? Is she a bad friend?", "NTA. Couples who plan destination weddings should realize many people can't/won't be able to attend.\n\nThere might be more nos than they anticipated since she is attempting to guilt/threaten you into attending. A good friend wouldn't do that to you. Maybe she got a discount promised if enough people booked rooms.\n\nBut the only thing that matters is that you can't afford to attend. Wish them well and don't worry about it.", "NTA. You shouldn't have to put yourself into debt for her decision. Destination weddings are selfish. That's what honeymoons are for.", "NTA\n\nMy best friend of 20 years is getting married at a destination wedding next year and it's costing me $3500 to attend (but I will get a week on the island for that so it's a full vacation for us). It's a lot of money for me. I'm going to have to sacrifice a lot. But I'm okay doing it. I am absolutely 100% sure though that if I said that the financial burden was too high, he would be okay with that. He would be sad, but totally understanding and I know he would put any hurt he felt over me not being able to make it to one side because he knows I would be there if I could. \n\nThat is something people have to take into consideration when booking a destination wedding.", "NTA, its a DESTINATION WEDDING!!!! Destination weddings can have as little as one guest, due to the expenses. The point is to have as less people as possible. Its meant to drive people AWAY from attending, unless they are super rich or is family. Why are they expecting anyone to attend after making a destination wedding.", "NTA", "NTA at all, me and my gf wanna do a destination wedding hopefully, we know that probably means not everyone is going to be able to come. I'm not gonna get mad or even give any slight pressure to anyone of my friends or family if they can't make it. I feel like you should've expect this sort of thing. And if she is so hurt, how come she doesn't help finance your ticket/accommodations?", "NTA. Sarah invited you to her wedding, she didn't, and doesn't get to, command you to attend. Kudos to you for making the sound financial decision not to derail your plans for her princess cosplay playdate.", ">She argued that if I truly valued our friendship, I would find a way to be present on her special day\n\nSarah is emotionally manipulating you\n\nSarah is the a-hole in this scenario. Not you.\n\nIt is completely unreasonable of her to bully you into forking out thousands of dollars just so she can be happy. She seems like a very entitled, spoiled child\n\nYou have definitely made the right decision. And even if this harms your friendship with her, just remember it's only a selfish friend that you'll be losing", "NTA\n\nYour friend appears to be a person who has never saved a penny or had to pay a bill ever in her life.  \n\nIf your friendship with her doesn't survive a real-world issue, what have you lost?", "My childhood best friend (since we were 4) was going to get married in Cuba in 2021  then have reception in Canada. I was a bridesmaid but I financially knew I couldn't afford to go to Cuba for it. I told her right away. She absolutely understood because not everyone can afford to go to a destination wedding. Unfortunately, due to covid she had to cancel and got married in our home city instead. \n\nPeople have the right to get married anywhere they like. But., they do not have the right to demand people to come or treat them like dirt because they can't afford it, can't get time off, etc. If they do they are not friends worth having in my opinion.", "NTA!  My daughter had a destination wedding in Italy.  All her close friends and family were told 15 months in advance and save the dates went out 9 months in advance.  All of the accommodations at the villa were paid for.  Guests would be responsible for travel and some food/drink.  She didn’t expect anyone to attend and didn’t pressure anyone.  Even with this much notice some of her siblings struggled to pay for it and we covered some of their trip, as did their sister because she wanted them there.  Of course, all of their friends were in their 30’s with established careers and most of her guests made a vacation in Italy out of it. You are very young to be expected to go to a destination wedding and if she really wants you there then she can help cover the cost.  A real friend would not expect you to sacrifice or go into debt over this.", "Sarah doesn't get to spend your money. Period.\n\nNTA.", "NTA if you have destination wedding you must understand that not all people you invite will attend the wedding.", "NTA\n\nWhen you book a destination wedding, especially at a pricy resort, you need to understand and expect that a good amount of people can't afford to go to your wedding, or cannot take the time off for travel. If she really wants you there, then she can foot the bill for it. But trying to guilt you and expecting you to take a big chunk out of your finances to attend isn't reasonable.", " NTA. People who throw extravagant destination weddings should expect to have a small number of guests show up. People have to deal with limited finances, limited vacation days, and the general inconvenience of traveling to a destination chosen for the bride and groom’s convenience.", "NTA.  I have a smilar issue with friends who move away and then complain when you don't want to spend your few vacation days a year visiting them in a place you would never go to if they didn't live there.", "NTA. If she thinks it's so important you'll be there she could pay a fair share of your costs. You cannot expect people breaking the bank for your wedding. Pretty self-centered even.", "It’s an invite, not a summons.  Your friend wants you there bad enough she can pay for your travel.", "Didn’t even have to read the details.  Based on the headline alone NTA.  Destination weddings are just a bullshit game of “show how much you’ll inconvenience yourself for my self absorbed narcissism”.", "Nta\n\nShe planned an expensive destination wedding, that means that *she* needs to accept that not everyone (friends and family alike) are going to put aside a couple months of wages, and burn up vacation time, to go to a party all about her.", "NTA.  You found out Sarah is not a true friend.  You can't afford it.  Full stop.  You are not a terrible friend.  She is.", "NTA. She has no right to try and make you feel bad that you can't afford a super pricy destination wedding. If she really wanted you there she would have the wedding at home or pay for you to go.", "NTA. As someone who had what would be considered a destination wedding (our invitations went to 10 states and 13 countries, so almost everyone was going to be traveling from somewhere), it never occurred to me to be mad at those who did not attend.", "NTA - people who have destination weddings should expect many people invited not to go. It's a huge financial burden to put on people and guests also usually have to take days off of work - not everyone can do that or even wants too.", "Tell her you'll catch the next one.  😜. But seriously it's unrealistic for people to expect that all these people can participate in something so expensive.  It's entitled to me.  I would have said I can't go as well in the same situation.", "NTA\n\nDo not let this self absorbed child get under your skin.  If she really cared about you and her other friends, she would have had the wedding where the maximum number of people could attend.  Suggest that you would be happy to go if she paid & you will see how valuable the friendship is to her.  \n\nIt's ok to have a destination wedding, but not ok to expect people to come.  If this costs you her \"friendship\", you have saved yourself further months of abuse.  Also, don't let her suck you into the preparations.  This will just drain your wallet and increase your blood pressure.", "Nta if you can't afford to go then they should understand especially in current financial climate", "NTA — Destination weddings are limiting by design.  You were gracious in your congratulations. One thing to keep in mind when declining anything, though: No explanation is ever needed.", "NTA.  She's as much as putting a price on your friendship: the cost of your going to the wedding.  A true friend would, at least pretend to, understand that not everyone can afford their high-cost parties.\n\nI'd send her a wedding gift, and be done with it.  Sooner or later, if she's a real friend, she'll contact you.", "Nta. A friend had a wedding a 4-5hr drive outside of my city and made sure to say on their invitation that when rsvp to say if you require accommodation and they booked rooms and paid them for anyone that said yes without expecting their guests to pay them back. Can’t of been cheap especially given how fancy the reception venue with an open bar alone was. But they wanted people to come and took steps to ensure everyone got home safely. \n\n\n\nIf you’re going to have a destination wedding you can’t expect everyone can attend if all the costs are coming out of their own pockets.", "NTA, Sarah is obviously not mature enough to get married. If you have an expensive destination wedding, you have to know that several guests are likely to decline.", "NTA.  You don't owe it to anyone to defer your own goals, spending money you can't afford, to attend the lavish, exorbitantly expensive wedding she has chosen to have. You declined graciously. She is being anything but gracious.", "The AH is your friend is a mega AH.", "NTA\n\nThis is the trade-off for a destination wedding! A lot of people can't afford it!", "NTA\n\nHonestly people should really take a consideration when planning a destination wedding. They should be prepared in case one of their closest can not come due to reasons, especially money and time. These kind of people are just selfish af.\n\nYou are not obligated to do sacrifices for other that will sacrifice your own good. Period.", "NTA. I hate destination weddings.", "NTA  \nIf she truly valued your friendship she wouldn't be forcing her friends to shell out thousands.", "NTA.\nDestination weddings are a big ask for everyone invited. Wedding couples get such blinders on and think that their wedding is as important to their guests as it is to them.\nThese things are not cheap; I’ve done several and declined several because the cost and time.\nHer response is not uncommon for brides and weddings often cause a whole lot of damage because of this kind of drama.\nIf it doesn’t work for you then in doesn’t work for you.", "Anyone planning a destination wedding should be prepared to graciously accept any and all refusals - without questions.\n\nAttendance at a destination wedding should not be used as a friendship or relationship test.\n\nCouples should understand that they aren’t merely asking guests to attend their wedding. They are asking for significant  time, spending, and effort beyond that. As such, they should expect some guests who would happily attend their local wedding to not attend their destination wedding.\n\nNTA", "NTA. Ironic that she accused you of not caring about her, when she obviously doesn’t care about you and what a financial burden she’s trying to saddle you with. \n\nIt’s been said many times - AN INVITATION IS NOT A SUBPOENA!", "NTA - Not everyone can afford destination weddings, and your friend is being selfish, not understanding your financial situation.", "NTA.  We discussed a destination wedding when we were planning and intentionally tossed it out because we knew it was placing too great a financial burden on the people we wanted there.  It was an important day in OUR lives, not the most important day in anyone else’s.\n\nPersonally I’d point out that she choose a wedding with a lot of built in challenges and if she really wants me there she should cover all the expenses.  \n\nBut I’d only say that if you’ve made your peace with blowing up the friendship.", "NTA\n\nIf *she* truly valued your friendship she wouldn't have planned an expensive destination wedding her best friend couldn't attend.", "NTA. When you plan a destination wedding, you need to consider that there will be people who can’t attend. My husband and I didn’t do a destination wedding for this very reason- his side of the family wouldn’t of been able to attend.", "It always floors me that people like Sarah epically fail to take into account the reality that others live in, and insist that their wedding day is the most important day in the universe. Yes, it's important to the bride and groom, but your attendance is not a measure of the value you place on the friendship.\n\nIt's not difficult to understand that you have personal goals and that spending a ton of money on a one-day event doesn't mesh with those goals. Her other friends have their own financial situations to deal with, but their finances have nothing to do with yours.\n\nNTA", "NTA. She chose a venue that is out of your financial reach (could does not mean should). If she ends the friendship over her own choices....I'm sorry. She really is asking too much of you.", "NTA. Avoid that situation", "NTA...She chose a destination wedding and those are expensive. Hotels flights food transportation. It's called a invitation for a reason. She wants you there that bad she can cover your expenses.", "NTA at all.  Your \"friend\" shouldn't expect people to go into financial ruin for her big day....if she wanted people there, she shouldn't have done a destination wedding.  You can't put yourself in a financial hole for someone else's big day.", "Sounds like your friend is trying to guilt and manipulate you into wasting all your hard earned money. This may be a good time to reevaluate your friendship to see if there have been other red flags that you may have previously missed", "Do not take on debt for someone else's wedding.", "NTA I'm engaged. We've had relatives say they can't afford to come. And we are fine with that. We aren't even having a fancy destination wedding, it's close to where we live. But some family would need to pay for 2 nights in a hotel as they live maybe a couple of hundred miles away. We knew some cousins don't have a well paid job and they don't go on holidays. So we weren't disappointed or surprised when some of them said they couldn't make it.", "She said it herself -other are making sacrifices to attend- that to me says it all she has no consideration of others so don't worry of she's upset it's not worth it, she'll come around when she needs you again and you get to decide if she's really your friend, that's usually how it works NTA", "NTA. \n\nYou aren't a terrible friend, however she sounds as though she's working on that title for herself.   Not everyone can afford to go to destination weddings and the cost all of that entails- this is just a given.  The expectation that you should do so at a detriment to your personal finances speaks volumes, not to mention the guilt trip you're being given for being a *responsible adult\\**", "NTA.  funny how she says your inconsiderate while she is expecting you to pay $$$$ to attend.", "NTA, when one has a destination wedding, one must be prepared that not everyone can afford to go. Your friend is being a bad friend by trying to guilt you into putting yourself at financial risk.", "NTA. If she NEEDS you there so badly why doesn't SHE pay for your trip?", "NTA if you plan a destination wedding, you have to either pay for guests to attend or expect only the rich ones to be able to afford to", "NTA.  This destination wedding trend is ludicrous.  It can put financial burdens on guests and wedding party members plus people not the bride and groom paying for it. \n\nRemind Sarah this is the 21st century and she should set up a livestream so people who can't easily afford to attend can share her day.", "NTA, if she was such a friend she would be sympathetic with your situation and accept that you have lots of demands on your money etc. I bet others are pushing themselves to afford it but not being as upfront as you.", "NTA. \n\nPersonally I think people who book destination weddings are AHs. They *know* that many people in their social circle won't be able to attend (mainly financial reasons, but also time constraints and other obligations) and it makes it all about them. (My feelings on weddings are that it is a *family* event - to be shared with and celebrated with family, much like a birthday or graduation) \n\nIf it were that important to Sarah to have you there, she'd pay some of your expenses to attend. If not, then she's just being entitled and expecting everyone to carve out a large chunk of money and time to see her wedding.", "If she wants you to be there this badly then let her pay for it", "So much this ^ \n\nPeople that have destination weddings need to realize that not everyone will be able to come and just accept it\n\nNTA", "In my experience people do destination weddings specifically so they have an excuse to not invite big crowds of people… OP’s friend doesn’t have the right to be upset that someone can’t attend her wedding when she specifically chose to host it in a way that makes it difficult for people to attend.", "well spoken!", "Indeed. This situation says more about her priorities than OP’s. NTA", "This.", "Exactly this. Any friend who wants you to take a financial baton to the knee to attend their wedding isn't a very good friend. If she really wanted certain people there she would either help pay for you to come or choose a location that wasn't financially crippling. NTA", "I always thought that was the point 🥴 lol"]}