{"id": 22787, "submission_id": "155cswa", "title": "AITA for not allowing my FIL to meet my son until he apologizes to me?", "selftext": "I (24F) and my husband (26M) live 2500 miles from his family. I do not care for them, his dad specifically. I am 1/2 black and 1/2 white and this has been the main issue for him. My husband and his whole family is white. \n\nWhen I was pregnant, his dad went on a racist rant about me to my husband within my earshot. He called me many names and racial slurs. He said things about our unborn child as well. My husband never defended me and it caused a huge fight that lead to me leaving for a week. He begged me to come back and told me we could move to a new city and start fresh. I haven’t spoken to my in laws since we moved and have no desire to. They’ve made 0 attempt to contact me and only speak to my husband.\n\n\nNow, my son is almost 2 and my FIL isn’t doing great health wise. He wants to meet our son but I don’t want my son around him, even if it’s just once. My compromise was that they can meet if his dad apologizes to me. My husband thinks I’m being petty and that i can’t “hold our son for ransom” for an apology. He thinks our son should meet his grandfather,especially since he’s sick. I don’t think being sick is a good enough excuse to not apologize so I gotta know, AITA?", "created_utc": 1689912152, "permalink": "/r/AmItheAsshole/comments/155cswa/aita_for_not_allowing_my_fil_to_meet_my_son_until/", "score": 247, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I’m not letting my FIL meet our son until he apologizes for what he said about me 2+ years ago. \n2. I might be the asshole because he’s now really sick and has never met our son. My husband thinks I’m being petty and that I need to move on.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Hold up,\n\nYour FIL said fucked up shit about his sons unborn child and he (your husband) thinks you’re acting petty? You should probably divorce his dumbass. NTA", ">When I was pregnant, his dad went on a racist rant about me to my husband within my earshot. He called me many names and racial slurs. He said things about our unborn child as well.\n\nNope he doesn't get to see the kid, ever.  Unless he demonstrates understanding that what he felt, said, and did was wrong and that he shows actual remorse.\n\n>My husband never defended me\n\nAlso you don't have a FIL problem.  You have a husband problem.", "NTA\n\nYou do get that you should be more concerned about your husband's behavior than the FIL?\n\n FIL is an AH, but that your husband never showed you any loyalty at a critical time that ANY decent person would have spoken up, and calls you \"petty\" for expecting an apology is beyond understanding.\n\nIf FIL still has strong feelings about race, why would you be willing to expose your son to him?", "NTA. You are allowed to do what you want with your child. If your FIL can’t apologize, that’s on him. Shows how shitty he is.\n\nSide note: shame on your husband for being a coward.", "NTA - It's really not an outrageous request. \n\nI'll  even write a script for your husband to relay to his dad:\n\n\"I'm sorry that I am a racist prick\"\n\nFIL can practice that phrase in the mirror until he feels comfortable saying it to you.", "Divorce your husband for condoning his father's racism against you and your son.", "NTA, OP. Your FIL and DH are, though. FIL for obvious reasons and your hubby for not backing you up with his nasty relatives. Your husband knows that your son, at two years old, will not remember meeting racist grandpa. The proposed meeting is 100% for his dad. Eff that. If FIL is not willing to apologize, then he's as much of a racist ass as he's ever been. Your husband needs to step up or he will be an ex, paying child support and jockeying visitation schedules.", "Sorry to suggest the nuclear option, but I think you need to leave your husband. He a) did not defend you against his racist father and b) wants you to bring your child around his racist father. Your husband is racist for being okay with all of this", "NTA\n\nYour racist bigot FIL has no right to access to your son. You don't need to subject yourself to that either. Even if the bigot apologizes, he's still a bigot. Trash is trash, and keeping your child away from that is a valid decision to make.", "Nta. Your son will not remember him , ever.  So there is zero benefit for your son to meet him.   Your fil can go to his death bed knowing he didn’t get forgiven , and not seeing your son. And you h is a dick.", "Has your husband apologized for being an AH? I think you may need to revisit that if not. \n\nBut if your FIL isn’t willing to apologize it must not be that important for him to meet his grandson. \n\nNTA.", "Why did you continue staying with a racist who won't push back against his racist ass dad when he was apparently saying literal slurs about you? NTA but also figure out an exit strategy and get away from this man.", "Why are you putting up with your spineless husband.  My husband and I are a mixed race couple, although I do pass. If my husband heard his parents calling me slurs, he'd have cut them off entirely.  There are a couple of things about my family culture that my husband has trouble understanding, but he has always been helpful in my trying to pass on my culture.  Love isn't enough there has to be give and take. Nta.", "NTA and even if he apologizes it doesn't change his view on what you are. Protect your son, let this man leave this world living with his hate. Death is no reason to give him what he wants and no guarantee he'll be respectful in any way. And your husband...I can't even.", "Nta but your husband is.  He didn't defend you against his racist father.  He won't defend his son.  WHhy would a father want his son to met a racist who could say something to hurt his son.", "NTA. Your husband didn't learn a damn thing.", "NTA\n\nThere is no “until he apologizes” because he shouldn’t be in his grand kids life period, he says racial slurs about the same UNBORN child so why should he be anywhere near him?\n\nAlso please OP take this as the red flag it is to either divorce your invertebrate husband or have a sit down conversation about his clear enabling of his father.", "NTA! Why on earth would you expose your baby to a racist?? He owes you an apology for sure! Then decide from there. You don't owe that man nothing And tell your husband the next time he doesn't stand up for you and your child against racist remarks you'll leave his ass too.", "Tell him you’ll bring the kid to his funeral", "If he is SO RACIST that he can’t even apologize for racist slurs, then does your husband truly believe his dad is going to love his little black grandchild?  I think not.\n\nHe can’t even apologize? Seriously?\n\nNTA", "Does the FIL know about the ultimatum or is this something you've only spoken to your husband about so far?\n\nIt's understandable that you don't want your son exposed to someone who is obviously racist, especially considering that your son obviously has those elements in him as well.  I would think of your son before anything else (which I'm sure you do).  How would he feel if his grandfather died and he never got to meet him?\n\nMy grandmother was abusive towards my mom, but was wonderful with me.  My mother allowed me the opportunity to have my own relationship with her outside of their abuse and IF for some reason my grandmother hadn't been wonderful to us, I'm sure she would have taken us out of the picture.\n\nI would give your son the same opportunity because maybe their relationship can be different.  But ultimately, whichever way you choose it's reasonable and understandable.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24F) and my husband (26M) live 2500 miles from his family. I do not care for them, his dad specifically. I am 1/2 black and 1/2 white and this has been the main issue for him. My husband and his whole family is white. \n\nWhen I was pregnant, his dad went on a racist rant about me to my husband within my earshot. He called me many names and racial slurs. He said things about our unborn child as well. My husband never defended me and it caused a huge fight that lead to me leaving for a week. He begged me to come back and told me we could move to a new city and start fresh. I haven’t spoken to my in laws since we moved and have no desire to. They’ve made 0 attempt to contact me and only speak to my husband.\n\n\nNow, my son is almost 2 and my FIL isn’t doing great health wise. He wants to meet our son but I don’t want my son around him, even if it’s just once. My compromise was that they can meet if his dad apologizes to me. My husband thinks I’m being petty and that i can’t “hold our son for ransom” for an apology. He thinks our son should meet his grandfather,especially since he’s sick. I don’t think being sick is a good enough excuse to not apologize so I gotta know, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Your husband is still the same spineless AH who is okay with his parents racism. They have refused to acknowledge OP in anyway. They have refused to acknowledge their racist beliefs were wrong. They have not shown any even the smallest indication of change but your husband wants to expose his mixed race child to his parents hateful views. He diminishes their harm by calling OP petty. Nothing has changed from two years ago except now there is a child for the parents to abuse as well as OP while husband makes excuses. \n\nGiven the husbands history of not protecting OP, do you 100% trust him not to take your child to see his parents behind your back?", "NTA. \n\nAsk your husband why your biracial son should be exposed to a racist. Ask him to explain in detail how your mixed race black son benefits from meeting a man who hates black people? \n\nAn apology is literally bare minimum. \n\nYour husband is a dumbass. \n\nWhen the only argument is “they are family!” it’s a trash argument for trash people.", "NTA", " NTA. It’s not hard to say ‘I’m sorry’ - it took me a few seconds to write it and even less time to say it.", "NTA. Your husband needs to take your side or you need to set him straight first before any FIL talk.", "NTA your son is 2 and will never remember his grandfather (thankfully)\n\nAnd it's *leverage*  not ransom. Too bad he doesn't have some of his own.... Like love or kindness", "Yes, this", "Doesn’t feel the same for fil is sick so there really wouldn’t be a chance to grow a relationship to benefit the child. Plus dont live near each other. It would only be fil benefit to meet his grandchild.", "That is true he is very young.  Whatever you decide wouldn't make you the asshole.  Good luck!  I hope hubby supports you in the future!", "i would ask your son and do what he wishes.", "NTA. Your husband needs to grow a spine and stand up for his family. Why should your child be forced to meet his hateful racist grandfather? \n\n\nSome of my family was the same way. I was kept away from them to the point that they literally did not recognize me standing behind them in the same line at target. I am beyond grateful for that.", "NTA.  You are protecting your son from a racist a-hole.  This world can be so cold and cruel, children don't need to hear hate speech from their own grandpa.  It's concerning that your husband is willing to chance introducing his child to his racist father.", "Info: \n\nHow do you think your racism-tolerating husband will do at preparing your mixed son for the realities of this world?", "NTA FIL is still a racist even if apologizes. He’s still going to be one when he dies. Protect your baby, mama.", "NTA.\n\nForget the apology, tell the FIL to rot in Hell and tell your ball-less husband to either stop his wimpy behavior or you'll divorce him.", "So instead of confronting his dad and being an adult your husband ran away from the problem by moving? This is a situation of his own creation.  \n\nNTA, I would do the same. Just keep in mind that if FIL dies without meeting your son your husband will likely hold it against you for the rest of your life. \n\nMy situation is eerily family, in my case we had a distant and formal relationship my racist FIL (I'm a WOC) so they did know one another.  But after he died my ex blamed me and that plus several other issues, is what ended us.", "NTA. I'm sorry, you are 1/2 black, and your husband is white. That makes your son 1/4 black. And your husband thinks its ok to take him to meet his racist grandfather? Oh hell no. Apology or not, I wouldn't subject my son to that mess.", "FIL won't apologise as FIL not sorry, so yeah, he's just gonna say something awful direct to your boy.\n\nIf FIL was sorry an apology would be easy to offer, and the rewards great. \n\nSeems like a low bar tbh. NTA", ">i would ask your son and do what he wishes\n\n\n\nYou will ask the 2 year old what he wishes? 😒", "yes.  so when he grows up and ask OP, did he ever meet his grandfather, OP can tell him what his decision was.", "I'm half-white, half black just like you and I think you're 100% on the right. What I would do is repeat all the slurs your FIL called you and your son to your husband until he understands what his father did.\n\nAlso, I think your husband is quite a bit racist himself. NTA.", "YTA for taking your husband back. He didn’t defend you or your son against his racist dad and it took him a week to ask you to come back? Face it. It’s not you he missed. It was what you did for him.", "Your husband not defending you means he partially agreed ith hs dad , him calling you petty confirms this. Im sorry for you and nta", "NTA.\n  \nYou didn't ask this question, but I'm going answer it anyway.\n  \nYour husband is, at best non-confrontational (and a bit spineless), or at worst he is an AH.\n  \nFamily members have disagreements. But how they handle disagreement says a lot about their beliefs and morals. \n  \nI'm not saying your husband is secretly racist. But I am saying that when it comes to standing up for what's right, he would rather keep his head down instead of risk being caught in the crossfire. \n  \nHe should have been your ally that day. Had it been me, I would have shut down that conversation immediately. I would have told your FIL that his speech was unacceptable and that he couldnt speak to my loved one that way. \n  \nThat's not me just spouting \"what if's\" for clout. I have actively done this before. To family members. \n  \nPeople argue. It's natural. But some people don't know how to do it so that you come out the other side having learned something. If you're ranting and lecturing, that's not an argument. \n  \nYour husband moved 2500 away so he didn't have to have the painful conversation with his parents. He's hoping you'll cave so he doesn't have to have the painful conversation with you.\n \nSo now let me ask you this question. Who is going to have this painful conversation: you? Or your child? Because if you cave, this won't end. It will just be passed along and your child will have to deal with this mess.", "Whenever drama comes up between parents and grandparents over a grandchild, I say the same thing. \n\nThere is something called PARENTAL rights. There is no such thing as grandparental rights. Nta", "NTA. Oh and your husband is a disgrace.", "Maybe this is why you don’t get married and have kids at 24. You’re really going to be tethered to this racist family for decades to come? Really?", "Si, because he's sick he gets a pass for bigotry? I didn't know that's how it worked, your husband is either an doormat or an huge AH. I would really think about the marriage if he can even defend his own child from a racist", "NTA. The reason you want an apology is not to make yourself feel better, it’s to be assured that your FIL has reconsidered his attitude. As it stands, he might take one look at your son and go - he looks blacker than I expected take him away. Or something like that", "NTA", "NTA. He can apologize.", "NTA, you aren’t being petty whatsoever. Just because he ended up sick doesn’t give him the green light to meet your son. He disrespected you and I’m proud of you for maintaining the proper boundaries.", "NTA. You definitely have a husband problem if he doesnt see racism against HIS WIFE as a problem and thinking you are being petty about it", "ESH\n\nThem, obviously - but also you. You’re an asshole to your son for even staying in this situation. Not sure what’s worse here; your shitty, spineless husband or your disgusting FL\n\nYour marriage is dead and it’s just a matter of when. My guess, when the old racist dies & his son goes full Momma’s boy and turns his ire on you because …he’s shitty and spineless and that’s how those people roll.\n\nGet out …fast", "NTA. As a rule of thumb: In-laws who cannot respect the parents, don't get a free pass to be grandparents. Furthermore I'm going to say you have an SO problem as much as a FIL problem. If anyone--I don't care how close a relative they are-- went on a racist rant about my wife, I would probably had the self control not to deck them, but I would sure as hell would have cut them out of my life until we received a genuine and grovelling apology.  Stick to you guns on this one.", "NTA\n\nAnd why does your husband want to expose his multiracial child to a racist in his own family?\n\nHubby needs to grow a pair.  His father used racial slurs against his son!\n\nEven if he does apologize...it is too late.  This man should not be allowed near your child.\n\nYou have a husband problem.", "NTA. Keep your son away from the racist family. Period!!! If your husband continues his mess leave him and take your son with you.", "Yeah, based on this story the apple doesn’t seem to have landed too far from the tree. He’s ok with his father in his life and never defended OP because he most likely agrees with his father. I’m concerned for when their son gets older and what he’s going to do.", "Yes, this! He didn’t say anything to his father when he said that horrible shot about you?! I would have divorced him then. \n\nThis is 100% a husband problem. You are owed an apology and tbh even then I’m not sure I’d allow him to meet my son. Do not under any circumstances leave your child alone with your in laws.", "Yeah, what's the point of the FIL meeting the grandson? So he can call the kid nasty names and further insult OP? Just because he's ill doesn't mean he's suddenly transformed into a saint. He hasn't even apologized. Not to be a pessimist, but racists rarely, if ever change. Sure, occasionally you hear of the inspirational story, like the guy who wrote a book about being raised in a KKK leader's family and he parroted their beliefs until he went away to college. Then he met some black people, realized they weren't the enemy as he'd been told all his life and actually became friends with them and renounced his family and their hate group. But those stories seem few and far between.", "That’s a really complex question for a 2 year old. He’s going to try to guess what the right answer is so he pleases them and not even understand what the question is. 2 year olds need protection from awful people.", "2 yrs old are not stupid.  maybe you should be around smarter people.", "Yta", "NTA And why are you still with your racist husband? People who defend and support racists ARE racist. I'm sorry you gave your husband a second chance and he proved you were correct in leaving the first time.", "NTA \n\nYour being generous to come up with this compromise. His family is a bunch of toxic racists and shouldn't be around your son at all. Don't budge. \n\nNTA", "NTA. How difficult is it for someone to apologize for their actions ??  \n\nWhy won’t FIL apologize?   Because he feels he has nothing to apologize for.   \n\nDying or not don’t let this person near your son \n\nYour husband needs help if he’s calling you petty for not forgiving a racist attack … THAT HASN’T BEEN APOLOGIZED FOR … \n\nMaybe a surgeon can remove your husband’s head from his ass for you …", "NTA. Considering your husband's behavior in the past, be aware that he might try to take your son to racist grandpa behind your back. He seems like a confrontation avoiding people pleaser.", "NTA you are owed an apology.", "NTA- divorce your husband if he’s still defending his father .", "Your husband didn't have your back more than 2 yrs ago.  He doesn't have your back now.  You have a husband problem,\n\nI understand where you are coming from.  Your husband does not.  He wants you \"to get over it\" as FIL is sick.  \n\nI think there are consequences to extremist behavior.  \n\nNTA", "NTA for not wanting your son to meet his racist grandfather but why did you stay with a husband who didn't have your back when his father started insulting you? Now he is calling you petty. This does not bode well.", "NTA- but you have a husband problem.", "Nta, holy shitHow tf are you gonna love a black.woman and keep your racist family in your life?\n\nI'm so sorry. Good job protecting your child from that family", "Why isn't he telling his *father* to stop being so petty? If it's just an apology, why isn't he telling his father to suck it up and say the words?\n\nNTA.", "NTA your husband sure is! You need an apology for sure but the things he said can’t be unsaid.", "NTA! Your husband sure is, being ill does not give him a free pass to not apologise. Your FIL was beyond awful, I wouldn’t want him around my child either", "NTA.  But be prepared, your husband is probably planning to bring your son to see him no matter what you say.", "So you're half black, I'll assume your baby daddy is white? \n\nMeaning your child has African blood. Just like you. So\nI'd be worried about what this racist bigot is going to say to your child. An apology is the least he could do for the horrible things he's said. \n\nPersonally, I think your kid doesn't need to meet these kinds of people. Hate is learned, not something you're born with. \n\nYou don't need to forgive him, and I sure as shit wouldn't. \n\nNTA my friend. That's your FIL. \n\nAnd your baby daddy sounds like he could use a serious reality check too.", "He’s not deathbed sick, he’s more of a “he can die next week *or* in 6 years”", "My husband and his dad have a very weird trauma-bond sort of relationship. He’s definitely scared of his dad and does a lot to avoid confrontation with him. We’ve talked *many* times about not allowing our son around him and he’s called out his dad for the rant since we moved away. I don’t know why he’s backtracking now, I can only assume he’s trying to avoid confrontation again. \n\nWe’re starting marriage counseling next week for this reason.", "Even if he doesn't think he agrees, he prioritized not upsetting his racist dad over the emotional health and safety of his wife and baby. \n\nNo, OP, you do not owe unrepentant toxic people anything, and that goes for their enablers too. NTA", "That is CLEARLY the case for you lol", "Really? When I was 6, I got to meet, only once because she was dying, my maternal grandmother. I didn’t know why I’d never met her and it was frankly terrifying.\nWas I not smart? No, I was a 6 year old who didn’t understand this complex situation.\nI’ve had 2 year olds. They would not have known what they would truly were saying yes or no to.", "NTA the kid is under 2 and won't even remember. This is 100% for the FIL. No, he needs to be doing some major apologising before he is in your lives even a little bit.", "NTA - nope!", "NTA for your opinion. However, what good is an apology when you know the guy isn't sorry?\n\nAlso, if your husband decides to take \\*his son\\* to meet \\*his father\\*, that's every bit his right to do so both morally and legally.\n\nIn either case, your husband is awful for not defending you. I think he's the biggest AH of all here.", "NTA. your husband needs to grow some balls and stand firm behind you in situations like this. it’s not like his father was up to old man shenanigans, he said prejudiced and disgusting things about you and your child. instead of insisting you’re petty, your husband should be seeing how petty his father is for not simply apologizing. he also needs to remember he CHOSE you. he MARRIED you. he REPRODUCED with you. not his father. wild to me he said you’re holding your child for ransom when all you’re doing is keeping him safe from a racist. and it’s wild he waited til he was sick and dying to express a wish to meet your son.", "Nta", "NTA, but uhh, why did you get back together with this man? He didn’t defend you or his son to his racist dad. You rightfully leave, and he begs and begs to be let back in. But instead of actually protecting you from his racist father, his solution is to just hide for alittle bit. \nNow that the same issue has come up again, he’s still on his racist father’s side. The fact that your husband seems to not only not understand why you don’t want this and isn’t actively protecting you two from your racist FIL should tell you everything you need to know. When push comes to shove, he is again pushing you and his son under the bus for his racist father.", "NTA, a sick racist is still a racist. Your husband is a spineless asshole. He can't even put his child before his father. That is a sperm donor not a father. I would never speak to your In-laws for the rest of their days. Let your FIL die knowing his racist behavior cost him the chance at meeting his grandson.", "NTA, why doesn't your husband think his father should apologize?", "I think your husband is right. You absolutely shouldn’t hold your son to ransom. You should get an apology because your FIL was racist and disrespectful towards you and he should apologise because he was out of line and a reward for that shouldn’t be getting to meet his grandson. I appreciate he’s sick and I can see why your husband would want him to meet his son but a condition of that shouldn’t be the apology it should be because you have both discussed it and are happy with decision you have made by listening to each others point of view.", "NTA, but I suggest you make it 100% never.  The man **hates** your son.  What's the value in giving him one last chance to hurt your son?\n\nAnd why doesn't your son's father want to protect him?", "Your husband did not defend your child. Is this really the man you want to be with? \n\n&#x200B;\n\nNTA", "10 bucks her husband goes behind her back and meets with racist daddy", "He knows he should apologize but he’s also aware that his father isn’t sorry.", "That's okay! Next week, 6 years, either way, the statement still works!", "You should teach him about the \"block\" function that phones and social media have.  If he doesn't want a \"confrontation\" with his family's enemy, he can just take away the old monster's ability to confront.", "My cousin promised me 1 billion dollars when we were like 4 yo, should I hold him accountable since it was his decision?"]}