{"id": 2287, "submission_id": "yurpyu", "title": "AITA for not letting my fiance throw a gift for my mother away because my MIL believes it's brought a demon in the house?", "selftext": "I (24F) live with my fiancé (27M) and his mother (52F). \n\nLast month, my fiance and I went to my hometown with my sister to go shopping. We stopped at Goodwill and I found this really awesome dragon statue that I wanted to buy for my mother, who collects dragon-themed stuff, but my sister is NC with our mother, so we decided to hang onto it until the next time we came into town and would give it to her. It's just been sitting on a headboard in the back bedroom until we get around to going back, but we can't afford to make regular trips. \n\nApparently my MIL has been experiencing some problems that she says is from a demon, but neither myself nor my fiance noticed anything different until she told him last night. I still don't notice anything besides the tension this has caused. We're all Christians, but his mother is extremely superstitious, and my fiance believes everything she tells him.\n\n So tonight after my fiance got home from work, she told him that last night, she saw a tiny dragon fly by her window, and that therefore, the dragon statue brought the demon in and it needed to be thrown away. My fiance told me this and I told him that we can be rid of it when we give it to my mother. He told me no, it had to he thrown out, and if it was given to my mother then I would be responsible for anything that happened to her, and the sin would be on my hands. \n\nI told him that I don't believe that it is the dragon, and that it was a good thing repentance was a thing because if it started on my mother, she could throw it away and I can repent. But I'm not throwing it away, and if he did, there would be issues. He said that there would be issues, then. \n\nI told him if he's not going to stand up for me about a stupid dragon, then how can I trust that he will stand up for me later? He said that was ridiculous, and when I pointed out to him that hes not exactly showing me that I can trust him, he got really quiet and went to bed.\n\n I already have had to pass up the opportunity to safekeep my grandfather's collection of vinyl records because she believes that they somehow host demons, too, and a lot of them were irreplaceable, rare copies. I haven't been able to admit this to my grandpa, who asked me to keep them safe and make digital copies for him because he now lives with my uncle and is being cared for by my family, and he had to get rid of most of his belongings because there wasn't room for all his things.\n \nShould I just throw the dragon away just to keep the peace? Or should I insist that my fiance get off his mom's tit and start standing up for me? Am I in the wrong here?", "created_utc": 1668409908, "permalink": "/r/AmItheAsshole/comments/yurpyu/aita_for_not_letting_my_fiance_throw_a_gift_for/", "score": 95, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole because I feel I might be disrespecting my MIL's beliefs.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "> Should I just throw the dragon away just to keep the peace? \n\nNo, you should throw the fiancé away. This is not a family you want to marry into.", "NTA - MIL is literally crazy and bf is (at minimum) enabling. Get out while you can. \n\nSorry about your granddads vinyls. That sucks.", "NTA but wow look at what you're allowing him to turn you into. Momma's boys don't change, he already has the woman he's going to put first forever. You're for passionate hugging and convenience.", "NTA. Demons don’t exist. Dragons don’t exist to fly outside windows. Is this really how you want to live?\n\nPack up the dragon to send to your mother, then pack up your things and move out of crazyland", "The only demon is your MIL, and your fiance is an enabling momma's boy. I cannot believe you allowed them to get rid of your grandfather's vinyls. Get out of there, op; do not marry this man!\n\nNTA", "The time to stand your ground was with grandpa's records. What a break of trust to get rid of them when he entrusted them to you. I'm sorry that happened.\n\nI think you'd better move on from this relationship. Your fiancee isn't going to suddenly shake off years of his mother's fantasies and he isn't standing up for you now. If you stay, this will be your life and worse yet your possible children's lives forever. Don't let that happen.\n\nDo you have a friend who can hang onto the dragon for you until you can give it to your mom? Best to get it out of the house. Hey, I know, move away from these nuts.", "NTA, sounds like MIL doesn't like something and wants to make changes using fear of the supernatural to her advantage. \nFuck with it, play a recording of someone reading the exorcism, pour salt in strange places and tell her that \"Demons can't cross salt\" \nHell, buy her a pentagram necklace for protection and a bottle of holy water or something, take it as far as you need to go!", "A bat. Your bonkers MIL saw a bat out the window, not a “tiny dragon”. \n\nThis is only a little thing now, but absolutely (imo) a hill to die on. Honestly, it should have been your granddads vinyl collection as that was irreplaceable, but it will only get worse from here if you can’t rein her in with BFs help.\n\nYou need to have a serious talk with your BF about her mental health, this is not normal and he shouldn’t be indulging her flights of fantasy. NTA.", "NTA.\n\nAs you are not yet married, I would say run. Run fast and run far. Anyone truly believing a statue brings a demon into a house is a nutjob. Are they also going to ban any mention of the three little pigs in case a wolf appears and blows your house down?", "NTA but your MIL would have fit in well in Salem a few centuries ago. “Demons” have become her scapegoat for anything she doesn’t like- does she do this with anyone else’s stuff or just yours? Sounds like she’s trying to end your marriage by either driving you away or convincing your husband that you’re demonic.", "NTA run you do indeed have a demon MIL...thia her way of controlling you", "You could also hide it and say you threw it away", "whose house it it ? \n\nDid she see the dragon before ? \n\nI wonder if she is kindda jealous of your family for specificly wanted to get ride off their stuff because they are demonic . \n\nDoesn't your MIL has someone else she can stay with? I mean if she feels unsafe in your house she can leave. Why is she causing problems.\n\nMamaboys are the worst. Make him grow up or leave this relationship .", "She is suffering visual hallucinations- this is serious psychosis and needs to be under appropriate medical care.  NTA", ">I already have had to pass up the opportunity to safekeep my grandfather's collection of vinyl records because she believes that they somehow host demons, too, and a lot of them were irreplaceable, rare copies.\n\n\n\nINFO: what happened to the vinyls, then?\n\n\n\nThis is not really a case of religion / supertition, I think, but of your FMIL being interfering and trying to cause trouble in your relationship.\n\n\n\nShe obviously has you fiancé under her thumb, which is sad to see.\nThink about what will happen IF you have kids / a pet / anything that is *really* important to you and your MIL pulls up one of these \"it's demonic\" cards.\n\n\n\nShe is trouble, and unless there are firm boundaries set and respected, you are in for a hard time.\nYour man has to step up, or else.\n\n\n\nKeep the poor dragon safe!\n\n\n\nNTA", "NTA - if ur MIL is seeing Demons every where then she is a whack job - lordy and ur Fiance is believing her. Pls reconsider marrying in to this family MIL will only get worse", "If  your MIL saw a tiny dragon fly outside her window she is having visual hallucinations and needs psychiatric care and medication.  If your fiance believes this claptrap he needs help as well.  Personally, I would distance myself from the  whole lot of them but if your fiance supports his mother with this nonsense I can't see your life with him/them getting any better in the future.  You are NTA but you seem to be living with some people who need a medical intervention.", "Look on the bright side, if you fill your home with enough of this demonic stuff, your MIL will stop visiting! Quick, go grab a Buddha or two!!", "ESH, run far far away from them. If you spend any amount of time arguing about demons with people, holy shit that’s a bad sign.", "ESH.   Remember what happened when Bobby Brady threw the Tiki God into the ocean!  https://www.youtube.com/watch?v=4i5yTaIiFfY", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24F) live with my fiancé (27M) and his mother (52F). \n\nLast month, my fiance and I went to my hometown with my sister to go shopping. We stopped at Goodwill and I found this really awesome dragon statue that I wanted to buy for my mother, who collects dragon-themed stuff, but my sister is NC with our mother, so we decided to hang onto it until the next time we came into town and would give it to her. It's just been sitting on a headboard in the back bedroom until we get around to going back, but we can't afford to make regular trips. \n\nApparently my MIL has been experiencing some problems that she says is from a demon, but neither myself nor my fiance noticed anything different until she told him last night. I still don't notice anything besides the tension this has caused. We're all Christians, but his mother is extremely superstitious, and my fiance believes everything she tells him.\n\n So tonight after my fiance got home from work, she told him that last night, she saw a tiny dragon fly by her window, and that therefore, the dragon statue brought the demon in and it needed to be thrown away. My fiance told me this and I told him that we can be rid of it when we give it to my mother. He told me no, it had to he thrown out, and if it was given to my mother then I would be responsible for anything that happened to her, and the sin would be on my hands. \n\nI told him that I don't believe that it is the dragon, and that it was a good thing repentance was a thing because if it started on my mother, she could throw it away and I can repent. But I'm not throwing it away, and if he did, there would be issues. He said that there would be issues, then. \n\nI told him if he's not going to stand up for me about a stupid dragon, then how can I trust that he will stand up for me later? He said that was ridiculous, and when I pointed out to him that hes not exactly showing me that I can trust him, he got really quiet and went to bed.\n\n I already have had to pass up the opportunity to safekeep my grandfather's collection of vinyl records because she believes that they somehow host demons, too, and a lot of them were irreplaceable, rare copies. I haven't been able to admit this to my grandpa, who asked me to keep them safe and make digital copies for him because he now lives with my uncle and is being cared for by my family, and he had to get rid of most of his belongings because there wasn't room for all his things.\n \nShould I just throw the dragon away just to keep the peace? Or should I insist that my fiance get off his mom's tit and start standing up for me? Am I in the wrong here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. is your future mil contentious is any way towards your mom? i wonder if she's really just jealous and/or using the demon as an excuse to add negative energy to a gift for your mom.", "NTA. Pretty sure your future MIL thinks you are the demon and she wants to be rid of you. Watch your back.", "My ex mother in law was like this too. Also movie theaters, you could not go in there because they were full of demons. Demons sound really bored all the time. Always near you when you have a drink or hiding behind little statues of things. Kinds sucks for them to be so mentally unstable. NTA and you should consider this union — will she live with you after marriage? Cause that does not sound like a good idea.", "Your MIL is crazy and your fiancé is well on his way. They are trying to force you to give up your things. You’ve already given up your grandfather’s vinyls. Do not get rid of the dragon (except to gift to your mother). Get rid of the fiancé and MIL. It will only get worse. NTA.", "NTA I would hold on to the dragon but drop the other soul sucking demons in your life.", "NTA.  Tell your DH that YOU had a dream and his mother is the demon and she needs to go.", "NTA... Geez Louise..what are you gonna do if your brand new car is possessed by \"demons\".  Or you have a child and she decides that because the kid is crying he/she is possessed.     I wouldn't trust that woman with a box of fruit loops.   Don't let her in the house and seriously think about your SO's attaude.  You could come home one day and all your stuff be gone because it was possessed.", "NTA. Honestly, I would just hide it until you get to leave. Hopefully the things you’ll throw away is your spineless fiancé and his superstitious mom. You’re right, if he can’t stand up for you to his mom about something small, how do you know he would with any other issues? As my mom always says, don’t go for the mommas boy. Living with them long term is not a good situation if she can’t even let you have a stature in your bedroom.", "NTA. Your MIL needs serious medical help, but it's also not on you to work that out for her. This honestly sounds pretty scary. Do you have somewhere you can stay if her behavior escalates?", "NTA\nBut you should have left during the vinyls problem and taken the vinyls with you.", "NTA. You should move out before she tells your BF there's a demon in you and he needs to  burn it out of you.", "NTA get his mother into mental institute asap demons and dragons don't exist. nothing against religion but if the church she goes to preaches this crap, then she sure is off her rocker", "nta why are you married", "NTA but really - if my husband or his mother brought up demons and dragons I would push for a psych evaluation. If it turned out they weren’t in psychosis and genuinely believed in that crap I would be out of there.", "NTA. MIL needs to talk to a doctor.", "It's funny how your future MIL only feels the demons in items you personally own.\n\n\nNTA. If you're gonna throw anything out, throw out that mommy's boy before you're tied to him.", "I want to watch the horror movie version of this.", "WTF did I just read", "NTA \n\nTell your fiancé that you had a dream of your MIL \nflying through the air chasing you with red eyes \nTell him your sure it means something and she has to go now! Then just to be sure she bis okay he should go with her!!!", "NTA. \n\nAnd I think MIL finds demons only in your or your families belongings. OP, you need to wear your best shoes and be prepared to run, before MIL plans to exorcise you.", "INFO is it just items to do with your own family that just happen to be 'possessed' ...has anything you and your partner brought for his demon fearing mother all OK then?", "I would've kept the records and lost the MIL", "Tough to hear but true nonetheless.", "I suppose komodo dragons fly occasionally, if they're being transferred from one zoo to another . . .", "Grandpa didn't tell me to take the records. I made a remark that I wanted to keep them, he said I was welcome to them, but if I did, I had one stipulation from him and that was to make him digital copies. If he did tell me to take them, I would have stood my ground then.", "Or just break up with the fiancé.", "To be fair, we live in Southern Idaho, and bats aren't really a thing out here. Especially not in November. \n\nI think she may have dreamt whatever she saw--or she saw a bird.", "I've considered it, to be honest.", "We're renting the house, and all three of us are on the lease. In this regard, I'm at a disadvantage because my fiance and I spend our finances together because I'm in college at the moment and because of my anxiety, I can't balance work and school. I'm also technically a second semester freshman who's already dropped out of college once, so I definitely do not want to drop out again. It's not HER going anywhere, it's me, and I don't have anywhere to go--my own mother and I have a huge traumabond issue so me moving in with her is a no-no. My sister is 17 and lives with my cousin, so that's not happening either.", "Also, she's seen the dragon before--we showed it to her when we bought it and she thought it was cool! She likes fantasy stuff like Harry Potter and Lord of the Rings, we've bonded on that before. She's never had an issue with it before.", "Regarding the vinyls, they were in my grandpa's storage unit. He and my grandmother were leasing two storage units full of their things. Grandma passed away from cancer in 2019 before I met my fiance. Us, my grandfather, and my cousins all cleaned out the smaller storage unit and we sorted through things we would keep and things we would throw away--mostly my grandmother's things. I got a lot of things--3 out of my grandma's 4 Christmas trees (she had 3 small ones and one large fiber optic one that my cousin wanted to have in exchange for me keeping the smaller ones), my favorite porcelain doll from my grandmother's collection, a hot chocolate machine, a chocolate candy maker set, some crafting materials, and her Christmas xylophonium.  My grandpa also gave us some of his camping gear he can't use anymore plus his weed eater. We own a jeep and stuffed that thing full and were originally going to come back foe the records and a box spring to replace our broken one. However when we told MIL about it, she said that we are not allowed to even bring the vinyls on the property--not even the shed. We decided if she was going to put her foot down it wasn't even worth it to go back. Grandpa stopped paying for that storage unit in July of 2021, so the vinyls have likely been auctioned off. I don't think I could ever forgive myself, my fiance, or my MIL for that one. \nHowever I should clarify that my grandpa did not tell me to take them. I mentioned that I wanted them and he said that if I do decide to take them, then he asked me to convert them to .mp3 files because he didn't know how (I don't either but I'm a much quicker learner than he is. Also, he's not as tech-illiterate as most folks his age. Except when it comes to smartphones.)", "Unfortunately, we live with her. Her name is on the lease, just like my fiance and just like me.", "To be honest, I don't believe there's a demon at all especially because my fiance and I have literally felt nothing weird going on besides the fact that we have mice in the house we're trying to get of without hurting our little dog. My fiancé has made small remarks that indicate he doesn't believe there's a demon either.", "My MIL and my mother have never met. Also, she didn't know it was supposed to be a gift for my mom, she thought I just bought it for myself.", "I'm sure a bearded dragon or two have snuck aboard a hot air balloon.", "Did you get a chance to make the digital copies?", "Where's the fun in that? Have satanic ritualistic sex with the fiancé and tell him that he brought demons into the house through it 🤷‍♂️", "Or she’s making shit up to manipulate your fiancée into alienating your family.  Do demons ever come into the house on things *she* or *fiancee* bring home, or is it JUST things that would benefit your family that are infested?\n\nNTA", "Hold on.. Are you guys living with his mother - at her house?\nYikes!\n\n\nThat sounds like trouble; it will certainly be her way or the highway!\n\n\n\nEdited to add that I somehow misread the first line of the post, d'uh!", "For this YTA. You could have spoken to your grandad and figured some other option or paid to have them converted. But you have been  essentially lying to him for no reason.", "That doesn’t negate the fact that you are arguing with people about demons possibly existing in items from goodwill… it’s not normal at all. What the hell do the mice have to do with anything? His mom is going to run/ruin your life.", "Maybe the mice are demons!", "I know this, and I feel absolutely horrible. My grandpa wants to go out to dinner with us on my fiances next day off to celebrate the engagement. I'm going to tell him then with my fiancé present so he understands how hurt I am over this.", "They're tricky little buggars to get rid of and we can't afford an exterminator. We all can hear them scurry around at night and I have considered---what if she's hearing the mice? And as far as the dragon she says she saw goes--when I was 10, I had a dream that a man in all black clothing wearing a hockey mask tried to break into our house--after my mother, cousin, and I had a horror movie weekend. It was so real to me, but it was a dream. Even now thinking back, it still feels so real", "Buy No-Kill traps off amazon or somewhere. Use peanut butter as bait. Take the mice at least two miles away and release them somewhere with plenty of fields etc. Repeat until all mice are gone.\n\nETA. Look up if you have something like MouseMesh wherever you are and get covers on the air bricks to stop more coming in to the house.", "I've told my fiance about this--it's how I've caught mice before. But he doesn't listen to me.", "F’k me, but that’s a marinara flag if ever there was one. He doesn’t listen to you? Sounds more like you’re a roommate with benefits rather than a fiancée.", "Is FMIL residing in the art studio by chance?", "Update: the dragon is gone. Fiance threw it away when I wasn't looking. I've decided that I'm going to find another one online and send it directly to my mother when I have the money to do so. Even if I pulled the dragon out of the trash now and hid it, I can't afford to send it to her. That thing was rather heavy. I also think it might have been one of a kind.", "You should throw out a partner who treats you this way. Guarantee you EVERYTHING you ever have that he or mummy don't like will be possessed. NTA And keep that statue somewhere lockable and secure like your office or car or friend's house! Then get a dragon tattoo!", "NTA, and if you're looking for something to throw away to get some peace may I suggest it be the fiance not the dragon.\n\nI'm so sorry about your grandpa's records.", "NTA for the dragon, but you're definitely doing yourself a disservice by marrying this man and his mother who apparently comes as a package deal and believes in magic. Fuck that there's no such thing as demons, she's just a manipulator and he's just a fuckin mommas boy.\n\nYou should run the fuck away from these people.", "Oh lordy. \n\nI recognise this type of doctrine, and it's some of the most toxic and horrible nastiness you'll ever have the misfortune of accidentally stepping in.\n\nI know it's not as easy as *just leave*, but when you find chances to move yourself towards getting out of there, please do.\n\nNTA, but I think expecting rationality might be unrealistic. Often people preaching this stuff are very big on the *people who disagree are being used by Satan to attack you* kinda logic.", "NTA your fiance on the other hand is. Listen to yourself when you say 'How can I trust you?' to him. You can't. He'll always choose his mother's made up nonsense over your logical thinking every time.\n\nWhat's to stop his mother telling him the Demon is in you and him kicking you to the curb? You deserve more", "NTA. But mil is right a demon is in the house. Only it’s neither the dragon nor you. \n\nI’d get out before you let it’s influence infect your free will and sound mind.", "NTA\n\nmail the dragon to your mom.\n\nsit down and have a serious think about if you want to really have a relationship where\n\n1) MIL comes first.\n\n2) Both BF and MIL seem to be delusional.", "NTA but this relationship isn’t going to work and you should get out now.  This isn’t about you bf “being on his mom’s tit”, this is about core religious beliefs.  You two aren’t a good fit and you’ll never be able to talk sense into him because of his superstitions.  You’re also never going to be able to trust either of them to leave your things alone and some day they could even start to believe YOU’RE possessed. Please reconsider a future with this man.", "NTA but are you really really really sure you want to marry into this family?", "NTA, but you know this is going to be your life for however long his mother lives. She saw the statue shortly after you brought it home, that's what started all of this. Don't tell her or let her see anything anymore. Hide things from her.", "NTA\n\nYour FMIL is showing you who she is - controlling - and so is your fiance (enabling mama's boy). Think long and hard about whether you can bear to live for perhaps 40+ years with this woman dictating every aspect of your life - job, kids, possessions, holidays, etc. Go to r/JUSTNOFAMILY and r/JustNoSO to see the kind of crap you could be in for. They also have useful reading resources.\n\nBest of luck, OP - you're going to need it.", "You should’ve been left when they threw away your grandpa’s records and his mother is very controlling and gods behind it by saying it’s demons and your dealing with a mama’s boy leave while you can because they’re both unhinged people", "As a practicing Christian, your mother in law is nuts and controlling. I remember years ago before becoming Christian I was given a merlin statue for volunteering at a shelter. Someone donated it and they didn't want it and asked if I did. I said sure.  One volunteer tried to convince me it was cursed. I had that thing for years before losing it in storage lol it wasn't cursed. Having a dragon statue doesn't make you a sinner. Everyones already a sinner, we just have to accept Jesus and do our best.  Plus the word dragon is mentioned kn the Bible too. Just stand your ground.", "On the offchance this is true: keep dragon, discard relationship.\n\nNTA", "NTA… but are you sure you want to commit your life to this brand of crazy?", "NTA. There are no demons and the random dragon statuette is neither evil nor cursed, magic isn't real. FFS.", "Can you imagine marrying and bringing kids into this! If OP doesn’t share these beliefs she needs to go. Funny how she has to chuck out things that are meaningful to her family eh?", "You could almost say:\n\n> Throw away the fiancé, and keep the piece.\n\n(before gifting it to the mother)", "He’s still your fiancé? That’s cringy", "And you are really staying with that man? He doesn't value you or your opinion at all! \n\nHis behaviour raises so many red flags! He is being emotionally abusive and manipulative.", "It's getting even better: Fiance already threw the dragon out too. What a manipulative, emotionally abusive AH.", "I, unfortunately, no longer have any ground to stand on. The dragon's gone.", "Imagine once a future grandkid started acting up or fussing, FMIL would cry demon possession, it won’t end well.", "If your position were stronger I would say stay your ground . But in this case it is maybe better to keep the peace . You could still hide the dragon and just say it is gone and maybe even do some cleansing to appeace her . Sometimes it's wise to pick your fights.\n\nBut I would still talk with your hushand about your needs of support , maybe not about the dragon . But ask him in what situation he will or won't stand by your side against his mom so you know when you can count on him . \n\nof course guys hate to be between the most important women in their life. His mom raised him so her values are also partly his so in this case he maybe doesn't even take his mom's side but because he was raised by her also fears some demons .\n\nIt sucks because it's you and your believes against them and he obviously spent more years with his mom. \n\nI guess you both need to talk about boundries and where you expect his support and maybe also about you different values . Sometimes he can be on his mom's side just because he also believes it mainly because he did grew up with it .", "then that is a bit odd. Did she felt some demonic energy from stuff she bought ? \n\nIf she really has such a strong believe then tell her that her postiv energy will overpower any darkness so she has nothing to fear , Objects only keep the energy you give them", "Damn it’s time for her to leave", "I'm sorry 😞  people like your mil really give the Christians who aren't fanatics in that way a bad reputation.", "Never got the chance to. MIL demanded they never came on the property and we never went back out to the shed.\n\nAlso, the dragon's gone. I'm feeling numb. I've also decided that I'm going to find another one online and just ship it directly to my mother, but I think it was unique. \n\nI'm honestly just so broken. I have nowhere to go, and I have lost so much trust and respect for my fiance and mother in law.", "GET OUT! Start planning, it doesn't matter if it takes you some time to get everything in order.\nBe very very diligent with your birth control.\n\nMIL will most likely sense demons in every single thing in your life she doesn't like and you found out than means your fiance will throw away your property or your kids property, because mom's fantasy is more important.", "OMG get out! This is horrendous behaviour! Just imagine you might have kids with this man one day!", "Or hear me out. You don’t stay with this asshole and you leave him. You’re at best being emotionally abused by him and his mom. You need to get out of there."]}