{"id": 23008, "submission_id": "1587c1b", "title": "AITA for excluding a co-worker when I was giving a lift to others?", "selftext": "I have a weekend job at a warehouse where most people can’t afford cars. They mainly rely on public transit which isn’t reliable when most of us ends our shift. Most of them used to walk 5 miles to the train station or stay at work for few more hours (unpaid). The train station is literally on the way to my second job and house, so I offer them rides. I drive a F-150 so the truck seats 5 people including myself. 3-5 people (including myself) usually clock out at 2 in the morning, so I drive everyone in my shift to the train station. I don’t mind, my truck can fit them all and it’s fun to drive with others. But there’s this one woman I don’t care for that much, she has a reputation for being lazy. While everyone would be working, she’s usually in the office or outside speaking with the supervisor who’s into her (I think). She also never thanked me or even says please, it’s like she’s entitled to a free ride. So all of us clock out at 2 am, I said out loud the names of the people and said come with me, I’ll drop you guys off at the station. As we’re walking outside, she comes up to me and says “Can you drop me off? I’ll be ready in few minutes, have to change my shoes”. I said “sorry but from now on, I don’t want to give you rides anymore. You should ask for a shift change”. She got visually upset and talked about how dangerous the streets and how I’m petty for not giving her a ride. I changed my tone and said “enough, it’s my truck. You can find your own way home, i’m not the city bus”. Caused a bit of a scene but my co-workers agreed with me, it’s my truck, I can choose who to let in.", "created_utc": 1690196307, "permalink": "/r/AmItheAsshole/comments/1587c1b/aita_for_excluding_a_coworker_when_i_was_giving_a/", "score": 572, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Yes, the area our work is at is dangerous. There has been murders and other violent crimes, and it happens every other week. City bus doesn’t come around until 8 am, so it’s either a 6 hour wait or 1 hour walk through dangerous streets. It would have costed me nothing, in time or in money. I just didn’t want someone who takes advantage of everyone and gets away with not working and burdening everyone else. Whenever she’s in, we have to pick up her slack. So I just couldn’t help some one like that.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH you because you made a scene over it instead of just letting her know quietly that you're no longer going to give her rides and her for being ungrateful and entitled for the rides you already gave her while also being a bad coworker.", "YTA\n\nIf it was about choosing whether or not to give her a lift in isolation, it’d be a different verdict. But it’s everyone, and you’re taking everyone else. You used to include her. You’re now actively excluding her when it’s no extra effort to include her. AND by dropping off everyone else, you’re removing her 2am safety net of being able to walk in a group instead of on her own.", "YTA not for refusing her a ride, but the way in which you did it. You could've spoken to her privately and told her that you won't be dropping her at the train station anymore so that she could arrange something else. Instead, you specifically called out the names of people you were giving a ride to, waited for her to ask and then was rude to her in front of everyone. Fair enough, you don't like and don't want to give her a ride, you didn't need to be a dick about it though.", "NTA this sub loves to say no is a complete sentence and it is your truck after all. The y t a are really only because the coworker is a woman.", "ESH I can see why you wouldn’t want too because she’s not appreciative, but if you’re going that way anyway and could fit her in, why not. It is pretty dangerous for someone to be walking that distance on their own in the middle of the night, but I suppose it’s not your responsibility.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a weekend job at a warehouse where most people can’t afford cars. They mainly rely on public transit which isn’t reliable when most of us ends our shift. Most of them used to walk 5 miles to the train station or stay at work for few more hours (unpaid). The train station is literally on the way to my second job and house, so I offer them rides. I drive a F-150 so the truck seats 5 people including myself. 3-5 people (including myself) usually clock out at 2 in the morning, so I drive everyone in my shift to the train station. I don’t mind, my truck can fit them all and it’s fun to drive with others. But there’s this one woman I don’t care for that much, she has a reputation for being lazy. While everyone would be working, she’s usually in the office or outside speaking with the supervisor who’s into her (I think). She also never thanked me or even says please, it’s like she’s entitled to a free ride. So all of us clock out at 2 am, I said out loud the names of the people and said come with me, I’ll drop you guys off at the station. As we’re walking outside, she comes up to me and says “Can you drop me off? I’ll be ready in few minutes, have to change my shoes”. I said “sorry but from now on, I don’t want to give you rides anymore. You should ask for a shift change”. She got visually upset and talked about how dangerous the streets and how I’m petty for not giving her a ride. I changed my tone and said “enough, it’s my truck. You can find your own way home, i’m not the city bus”. Caused a bit of a scene but my co-workers agreed with me, it’s my truck, I can choose who to let in.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "wtf?\n\nOf course it's your truck and you can choose who rides it. But the way you did that is completely AH material.\n\nInstead of talking to her and saying you wouldn't give her a ride anymore, you embarrassed her in front of everyone. And if this is something that has become a custom then it's natural for her to be expecting it on that day (because you said nothing before) and you just left her hanging.\n\nBecause of the way you did that (and also because how much she works shouldn't affect this) and will go with YTA.", "YTA\n\nHer job performance has nothing to do with getting a ride. I firmly believe no one is entitled to a ride, its a privilege and not everyone at my job will get that offer. You don't like them, you don't want to give them a ride, fine. But, \"she's lazy at work,\" isn't a good reason for me.\n\nI also don't make a thing out of it and loudly call for my co-workers who I do give rides to draw attention to the fact I'm doing it, just to have an opportunity to tell off the people I won't give a ride to. \n\nWhat you're doing is creating a toxic work environment.", "At the end of the day its your car but cmon man you really gonna let her walk 5 miles at 2am cause you dont like her? Dont be so petty, Shit man atleast make her pay for gas money or sum like that\n\nYTA", "ESH.\n\nIt's your truck, and you give rides to whoever you want.\n\nBut you didn't have to make a public spectacle out of it.  \n\nAnd she should learn to grease the wheels a little with some please and thank yous.", "YTA\nI agree with some of the other commenters. You definitely don’t need to give her a ride if you don’t want to but the right thing would have been to talk to her especially since you seem to have taken her along before. So letting her know in a one-on-one that this would be the last time you take her to the satiation since you personally do not feel like you get along. \n\nBut letting her spontaneously go in the middle of the night and making it very public simply bec you disagree with her work ethic (or that the supervisor might have a thing for her) is pretty douchey.", "NTA. I’ve had co-workers before where they don’t pull their own weight and cause more work on others. You said you don’t want to give her a ride, she escalated and accused you of being petty.", "Why are you giving co workers a ride? Is it to help them out or for the clout. I get you don’t like her and she’s a bit lazy as you say but at 2am at night you’re leaving a woman make her own way home even though it wouldn’t be putting you out of your way. Cmon man. She should’ve been more grateful for sure but you dealt with it in a really bad way. Your coworkers agreed with you cos they don’t want to rock the boat and end up without a ride too. They could be calling you a pr|€k behind your back for all you know.", "NTA. You’re a guy with a truck, not public transit or a $0 Uber. You get the final say on who rides in it. And like you said, this wasn’t some one-time situation where her car was in the shop, this is her assuming you’ll be her ride every day.", "NTA.\n\nPeople tend to get the treatment they give out. You do not have to give a ride to someone who never says thank you. Or anyone, really.\n\nI don't agree with the other commenters about your method. I think there is a benefit to being that blunt--it shows that your decision is irrevocable.\n\nI suppose I think you should have given her a reason.", "He can choose who he wants to let in his OWN truck. It’s not a public bus. And if she’s a good person, people would have volunteered to stay back to walk with her.", "I give them a ride because it’s on the way and some of them are my friends. No one likes her at work because her slacking off means more work for us. Whenever she’s here, we have to pick up her slack. Today was the last straw, we were short staffed to hell and while everyone worked like dogs, she’s sitting in the office with the supervisor.", "This is one of those posts where you’re NTA for your decision, but you are TA for the way in which you communicated your decision. \n\nSo many people think that being brutally honest means they’re off the hook because, “well I was just being honest!”. They need to learn that honesty + empathy should go hand-in-hand. It would’ve taken 5 seconds to explain the same reasoning you explained to us.", "It will be funny if she gets promoted and you will have to report to her..,\n\nYTA for how you did it. You creating toxic “ us vs her” situation.", "\nWhy doesn’t the shift manager she spends all her time with give her a ride?", "YTA. I was about to say you're not, because you definitely don't have to give anyone a ride and even *if* you're give a person a ride one day you don't have to do it the next day. So you're not an asshole for any of that. And this co-worker may be an asshole with their approach to their work, coworkers, and entitlement to the free ride.\n\nBut the moment you unnecessarily call this person out in front of everyone, you became the asshole. You don't have to give them a ride but you also don't have to be a dick about it or put her down in front of others.\n\nA much better way to go about things may have been:\n\n\"Can you drop me off? I'll be ready in a few minutes\"  \n\"Sorry, I can't.\"  \nAnd leave it at that.", "INFO: Why did you exclude her? Because you don't like her or because she's making you wait every time?  \n\n\nIf it's just that you dislike her it's a soft YTA. If she's always late, it's NTA because waiting 15min for someone to be able to do them a favor sucks.", "Eh....   seems like kind of a petty reason.  It's your truck and all so you don't owe her a ride, but you should have given her a heads up.  \n\nNone of this is something she did suddenly or anything that would change you'd mind instantly.  These are all things you knew in advance.  \n\nShe shouldn't have expected the lift either.  \n\nESH \n\nShe should have been appreciative and asked.  You should have let her know waaaaay before you're just about to leave.  You established a precedent so you needed to give her several days heads up to make accommodations.  If you had told her today that you'd stop giving her rides starting next week then you'd be totally in the clear.", "Esh", "YTA\n\nin the UK it would be seen as bullying by HR and could be a case for a disciplinary. You can't single someone out in the way you did. ID argue too that your co-workers only backed you up as they also wanted a lift and not because they necessarily agree'd with you.", "NTA.  She took the job knowing she had no transportation to get home or to the train station.  Add into that her laziness, lack of manners and all-round shittiness, she can sort it out herself.", "No Ive been the person giving lifts , no one is entitled if they dont offer anything or even thanks say no , not the AH  I would never be rude enough to ask", "YTA", "YTA. You aren't doing yourself any favors by starting drama with someone who has the supervisor's ear. You should have thrown something big in your backseat and told her you didn't have room for her and she shouldn't depend on you in the future. Use your brain or you'll never get out of that factory job.", "YTA for how you handled it.\n\nGood on you for creating what could be a toxic environment now. You and your workmates vs her. Lovely. \n\nMaybe try having an actual civilised conversation with her instead of showing them up like that.", "NTA. Incredible entitlement from so many responses.", "NTA", "ESH like many have said.\n\nYou are a grown man and should be able to handle \"confrontation\" and disagreement with a coworker better than a middle schooler. \n\nNo one can force you to give rides of course, but doing that in front of everyone and being a dick about it is why you are an asshole. You could have had the exact same conversation privately or just left it at \"no, sorry\". \n\nGoing at her like that could be a justified hostile workplace report if it continues since you went out of your way to be rude and directly disrespectful to her when all she did was ask for a ride. \n\nGrow up dude.", "I mean, I'm gonna go with YTA, I know it's *your truck* or whatever, but it's not putting you out to just give her a ride, you're going there anyway and have the room.", "NTA. It doesn’t actually matter why you don’t want to give her a lift. It’s your truck and you are in no way obligated to drive anyone let alone people you don’t like that are also ungrateful and lazy.", "Didn't have to be such a jerkwad about it. \n\nWith this attitude, you will be driving a Mercedes G Wagen in no time.", "YTA OP. it’s your car and you decide who to give rides to. nobody is entitled to rides. however you made a scene and made someone else feel absolutely horrible on purpose", "This sub can't hide it's biases for even 5 fucking minutes. \n\nA man is an asshole if he cares about the safety of a woman, and a man is an asshole if he does not care about the safety of a woman.\n\nThe other day guy was TA because he did not want his pregnant wife to go on a trip to Mexico without him, but now the guy is the TA because he allows a random coworker to walk 5 miles to the train station. \n\nNTA", "ESH. You made much more fuss than needed. You could've just declined when she asks. Otherwise I agree she doesn't deserve the ride.", "YTA you’re perfectly entitled to give rides to whoever you want but that’s not the question here refusing to give just her a ride when you are perfectly able to is an asshole move. You’re allowed to make it but  you’re still an asshole. You’re retaliating because you feel you have unfair workloads, take that issue up during work don’t retaliate outside. Discuss it with supervisors or just deal with the fact that she’s getting by doing less, unless it’s making your job harder it’s not really effecting you, It’s frustrating and annoying but it’s not your business. If it is increasing your workload then yeah you need to complain about it, find some way of documenting her lack of work if you need proof. I don’t like you so you can’t ride in my car is juvenile", "NYA. If she spent her whole shift fucking off instead of working she’s got plenty of energy left to walk her ass to the train station.", "NTA - your ride your rules. Moreover all the pushovers that are arguing about leaving a poor woman stranded dont get the point. Before you went there her ride was not your responsibility, tomorrow if you go/let go that won't be. That woman is mature enough to figure her own transportation methods.", "NTA you basically said  “no rides for you”!", "NTA period she got the job knowing the requirements to get to and from.", "I'm a boomer but what's up with the \"but she's a woman\"?                    \nI've lived through a lot of crap and as females, we've worked too hard for that to still be a thing.", "YTA this is such a dick move.", "YTA - Put this post in the dictionary next to the definition of the word 'petty.' She's a woman walking outside for FIVE MILES at 2 in the morning and the reason you don't want to give her a ride is because you don't like her very much? (And you assume she's trying to throw herself at the supervisor instead of oh, idk, the supervisor is harassing her and she's playing nice to keep her job? Just another possibility). You should apologize and give her your truck as recompense.", "NTA but damn your delivery could've been a little better. You job sucks for not providing a van and/or shuttle to the train station.", "NTA but just rude for the interaction\nIt just creates more problems but I suggest u dnt give a ride to anyone some days so as not to set some precedence that you’ll always be giving rides .", "YTA\nYep. You went out of your way to be a jerk. It literally costs you nothing extra.", "NTA\n\nI wanna say you are, but people tend to cling as hard as possible for free rides. I feel like telling her in private woulda just made the whole situation really prolonged and only more frustrating. Like yea, you definitely coulda handled it better. But you got the result you wanted.", " H", "Yta \n\nFor making a scene, being rude and leaving it to the last minute in the middle of the night to tell her. If you'd said even at the start of the shift, once you dropped her off or anytime outside of work via text or something she could've sorted something out. Planning and waiting till 2am when she's just finished her shift that's stone cold absolute AH. \n\nLeaving anyone stranded at night is shitty. Especially with a 5 mile walk probably meaning she's missing her train too. \n\n\nNTA\n\nFor not wanting to give her a lift. Your reasoning is kinda shit imo because you're not HR so why care but at the end of the day it's your truck 🤷🏼", "YTA. i had a manager that i used to just HATE and whenever i saw she was going to walk home late at night i would insist on giving her a ride home. because no matter how much i hated her, i hated the thought of anything happening to her more", "Soo since she isn’t into you, you don’t want to give her rides? YTA", "It could have been communicated better. But NTA.", "NTA. I've had coworkers like this, entitled after just one favour. Uber exists. You can't be lazy at work and expect 0 repercussions, formally or otherwise.", "ESH. Yeah she's a slacker but you took away the people she might walk with & dumped this on her last minute. And if she's buddies with the supervisor you'd better have your ducks in a row for the potential fallout.", "YTA for this specific occasion. Whilst her work ethic makes her an AH in that regard, and nobody is entitled to a free ride... you did not give her any notice whatsoever that you weren't giving her rides. As has now become the norm given your previous behaviour... everyone on your shift now expects rides to the station. Everyone else is heading there so it wouldn't be going out of your way especially for her. At night, women's safety is at huge risk, and she had no time to ensure a back up plan would be in place. Nobody else offered to walk with her so she would not be walking alone. Her work ethic might be shitty, but she doesn't deserve the risk of being harassed, sexually assaulted, kidnapped or murdered.\n\nYou need to communicate your boundaries with sufficient time for people to be able to plan accordingly. Actually... your coworkers need to be prepared regardless, because some day you might call in sick or be on vacation leave, and they would need an alternative. They are grown adults who took on a job and should be able to get themselves to and from work independently, however they need to plan for this.", "ESH. Her for not pulling her weight and feeling entitled to a free ride and you for not communicating it privately. Now she has to walk miles alone at 2am. Ideally give hear few days to get a shift change before cutting her out.", "This sub loves to say no is a complete sentence. No is a complete sentence. NTA", "NTA", "I think ESH. Her for her attitude, but you for the way you did it. You're absolutely not entitled to give anyone a ride if you don't want. You even had the right idea in saying she should get a shift change since she wouldn't have reliable transportation to get to the station. However, you know that you work in a dangerous neighbourhood with violent crimes. You know that it's unsafe to be in the streets, especially at that time of night. You absolutely should have given her notice that you would not be driving her from a certain point onward SO she could arrange for alternative transportation. Because 5 miles to the train station is fairly long walk, and you gave her no notice to figure out how she would be getting home. \n\nI get working with someone like her can be super frustrating, but the way you wouldn't have been an asshole would be telling her \"this is my last ride I'm giving you to the station. After tonight, you will have to find alternative ways to get home, as I will be unable to drop you off.\" Just a little advance warning would have completely changed my judgement.", "Nta, no one is owed a ride unless they pay for it. \n\nLots of entitlement from other comments. Acting like it's your job to give rides, making you feel bad for not considering out of work factors and her need to be given a heads up. \n\nDon't listen to a word these people are saying. It's your truck, and you decide who gets the free rides.", "Didn't have to continue giving her rides but didn't have to go scorched earth, either. Grow up and quit swinging your d!@k around cuz you have a vehicle. You knew you were going to stop giving her rides. You also knew she would be left in a really bad situation. You could have pulled her aside and told her tonight would be the last ride and why, giving her information she probably needed to hear and a chance to find a safe way home. A man who is not honest and leaves women at risk, for whatever reason, is only pretending to be a man. I hope she doesn't get hurt.", "YTA for making a scene unnecessarily.  It was a way to retaliate against her perceived work ethic. If it wasn't, you wouldn't have mentioned your perception of her laziness.", "Info\n\nWhy the change now? \n\nAlso, separately, have you ever had a romantic interest in this person?", "Doesnt owe her anything", "It could have been communicated better. But NTA.", "I think telling him in private really prolonged the whole situation and made it more frustrating.", "Not only did he embarrass her, he also took away the people she used to walk with. It used to be a group of 3-5 people walking together, now it's 1 woman walking alone though a dangerous area at 2am. There's safety in numbers and, although reddit sometimes likes to pretend otherwise, women are more vulnerable than men in this type of scenario. He gave her no notice to make alternative plans.", "Also, her point about it being unsafe is so completely valid. There used to be a large group of people walking the path to the train and now she is alone and easy to pick off. If she turns up missing it’s on OP", "NTA this sub loves to say no is a complete sentence and it is your truck after all.", "NTA. I’ve had co-workers before where they don’t pull their own weight and cause more work on others.", "NTA. She took the job knowing she had no transportation to get home or to the train station.", "I'd say he would still be TA if he refused her a ride in the most gracious way possible. Singling someone out like that for fairly trivial grievances is an asshole move. It's literally no added effort or anything to take her, you don't even have to acknowledge her existence because there's 3 other people to talk to. It's just common decency in this sort of group situation to give everyone a lift even if you don't particularly like one member of the group. You'd probably get done for workplace bullying for exclusion if you did this in my country.", "I’d put this as ESH, but your points are valid.", "There are some people for whom the only way to make them back off, is public embarrassment.", "He may be giving her a different ride...", "He doesn’t want the evidence of his affair in his car", "Short staffed and she spent half the time in the office joking around or outside smoking. Everyone was working non stop, picking up her slack", "To be fair- OP admits that they’re being petty.", "I agree with your overall thinking, but this does sound strictly out of work hours and premises. If work is not laying transport on for staff, this feels like outside their remit", "I was looking for someone to say this! She took the job without reliable transportation in a dangerous part of town that works late hours into the night. She knew what she was getting into the second she had in an application let alone an interview. Turn around and she expects op to take her regardless of the above fact that it's her own mess just because he's taking everyone else and she is in good with the boss so she feels entitled to do nothing at work make things harder and then have op drive her with no thanks or appreciation. I've worked those jobs as a woman myself you either have a plan not related to your coworkers or you don't take the effing job simple. \n\nOp was a bit of an ass in telling her but she fling her shit first by calling him petty and doing it in front of everyone.\n\nEdit: I don't drive either so she should've had someone to call or some kind of thing for protection for her walk before op ever gave her a ride. She has a phone and if Uber is a thing doing so for one night isn't gonna kill her bank she needs to be an adult and figure it out. Downvote me idgf but that's the part that pisses me off the most.", "I’m not forcing her to walk 5 miles. There’s Uber and waiting.", " Not his problem?", "I didn’t start drama. I said I don’t want to give her a lift and she called me petty.", "This! OP has greatly hurt his standing at work.", "Looks like the supervisor created a toxic work environment by enabling one worker to slack off causing others to pull her weight.", "I’ve read already 5-6 ESH and YTA, and haven’t seen « a woman » reasoning.", "I’m laughing at their justification for that verdict lmao. “Made a scene”, “embarrassed her”, “made her unsafe”. OP didn’t even talk to her, she approached him. She accused him of being petty. She made the scene and embarrassed herself.", "Projection I’m assuming. Or never worked in an environment where one person slacking off means more work for others", "How about NO is a complete sentence and it's only because she's a woman that you are saying this. Stinks of sexism.", "I didn’t make a scene, she came to me when we were walking to the parking lot. I said I don’t want to give her rides and that I was sorry. She called me petty", "I did decline. I said “sorry I don’t want to give you anymore rides, maybe change your shift schedule if you need a car” something along that line. She said I was being petty, that’s when I changed my tone.", "We do discuss it during work hours and it leads to no where, we brought in the union. I’m not retaliating against her, I’m just not going to interact with her outside of work related matters", "Tbh, she did move one pallet into the truck", "He didn’t go out of his way. He literally ignored her lmao", "He didn’t make a scene. She came to him lmao", "I think you need to improve on your reading comprehension. I’m not even going to bother lmao", "She's not owed a free ride but as a human person she deserve a little politeness and not to get humiliated in public.\n\nAlso you can do things for people not cause they are owed but cause you're a nice person.", "We all owe each other a basic level of politeness. She's not owed a lift, but a polite no would have been better.", "Everyone deserves a certain level of respect and dignity.", "Yeah, one one hand I get it. Who wants to do favors for someone that acts entitled and rude about it. On the other hand this is much bigger than just not getting a ride. And putting someone’s safety at risk is a major no no! If it was only not giving a ride, fine. But it’s not. And also if something does happen to her, because she is walking, alone, in the middle of the night, Op will most likely feel guilty and will have to live with that on their conscious.", "This is what I was thinking as well.\n\nFor this reason, I probably would have spoken to her quietly and told her that he does not want to give her rides anymore because she shows no appreciation. She has been treating him like a free bus. If she apologized and showed a change of attitude, I would take her again.", "Again he's not the AH for not wanting to give her a ride. He's an AH for how he did it. Had he told her 'tomorrow I'm not giving you a ride\" he wouldn't have been an AH.", "Bot", "Oh, I don't know. I've worked with people like her over the years. People who somehow manage to do sod all and the rest of the team gets to do extra because they're not pulling their weight so I can understand OP not wanting to do her any favours. I'm not sure if I would refuse to give her a lift but I can understand why someone wouldn't want to go out of their way for her especially if their 8 hours has been made more challenging through her laziness. But I think your point is valid.", "One of those afraid to ask questions... but what is ESH?", "Or he may be sexually harassing her? She might not like spending all of that time with him but feel like she has no choice in the matter if she wants to keep her job. Now she’s doubly isolated because her coworkers have iced her out. \n\nI’m offering this opinion from the perspective of the odd woman out, who’s worked in a totally male dominated field. Especially in warehouse or other physically demanding work, it can be a challenge.", "She's riding the D-Train to Pound Town.", "The Bologna Express", "Maybe all of you individually bring it to your boss that she’s not working as hard as the rest of you. Do it via email so it’s documented and CC HR or someone above your boss. If you say he’s into her he’ll do nothing if only he hears the complaint. If someone higher up knows and the complaint is from several staff something will have to be done. Stand up for yourselves.", "Yes OP, stand up for yourself in a proper way.  If your colleagues’ performance is not good and affecting others, you should solve it through the company channel, like HR, also the supervisor you “think” have a thing on her may actually not true.  If your manager is half good at his job, you and your other colleagues complaint together will have an effect.   You can definitely solve this at a more professional way but you singled her out like this is creating a toxic work environment.  You are dealing it a petty way.", "INFO: This seems like a problem the supervisor is enabling. Have you spoken to him about it? It's not like she's shirking off behind his back.", "Do you know why she is sitting in the Office? How do you know she even wants to be there? Or that she doesn’t have a real reason to be there?", "How does that have anything to do with the situation at hand? Your coworker being lazy means you get to embarrass them in front of everyone? Have you ever heard of professionalism?", "I'd still go with a soft YTA. She doesn't know why she's being excluded, so it'll feel just like bullying and there's also zero chance for her to 'fix' the issue. But I'm not convinced she'd want to try if she knew. \n\nI guess this is the case where YTA, but you did what's best for everyone.. A justified asshole basically.", "Not really what you said originally", "Was there space for her and was she the only colleague who clocked out at that time that you didn’t give a ride too?    If so, then yeah it’s your truck and you can give whoever you want a ride-  but picky on one person going to the same place and saying no is some petty high school bullying bullshit:  Yta.\n If who work attititude is causing you problems speak to her about it.", "Or the supervisor you think might be in to her.", "You said they cannot afford car, so why you think she can afford Uber?", "You're out of your mind BONKERS if you think people would willingly walk 5 miles after an entire shift at 2am when they have a much better option.", "Cos you are mate", "Just because it's not said out loud, does not mean it did not impact the verdict in any way. Biases on this sub can really be something else. In one moment men will be judged for not treating women like someone who needs protection and in another moment they will be judged for not providing protection. \n\nThe other day husband was judged for not wanting his pregnant wife to go to trip inn Mexico without him, here man is judged for treating coworker like independent adult.", "Excellent points, really excellent points.\n\nDown vote me you bellend blue haired incel losers of vague gender.\n\nI wear my down votes like a crown of thorns!", "Nah, you can’t admit to being petty and then keep adding to your narrative as the YTA votes come in. That’s BS.", "People feel sorry for her because she's a woman in what sounds like a male dominated field. So they immediately jump to \"what if the supervisor is harassing her.\" If she can't handle her own transportation she shouldn't have accepted the job. And it's really rich of her to expect a favor after slacking off all day. NTA.", "Way to assume things.\n\nThe only people making this sexist are the ones demanding it is. \n\nIt's called workplace conduct and common courtesy. If I needed to have that conversation I would have done it privately.", "You should have talked to her ahead of time instead of as you were leaving. That is petty.", "And it took 8 hours? Hope she didn’t pull a hammy", "He made it a point to be a dick with his words. That's what I was referring to. He could have said, \"I'm sorry, there's no more room.\" And walked away.", "He said out loud all the names excluding hers so there must have been a good number more than the 4 of them there otherwise he wouldn't need to right? To call all the names out loud and say \"come with me\" 🤨", "I would say he did make a scene because he could have not, you know, yelled out who was allowed in his truck beforehand. I think, when he did that, it caused her to realize she wasn't being included in the carpooling situation as she usually was.\n\nHe started it by yelling out the names of the coworkers he was going to drive to the station.", "Shes already acting entitled, isn’t appreciative, and causes problems at work. He shouldnt have to", "Everyone sucks here. It's a vote people make when you believe people on both sides of an issue are an asshole.", "everyone sucks here", "Everyone Sucks Here, as opposed to picking one AH", "A lot of assumptions here.", "Bologna *", "Eh I would start just the boss and escalate if no action taken.", "Who said we didn’t file a complaint?", "We complained to the weekend supervisor but he either ignores it or tells us that it’s not our business. Main manager always takes the supervisor’s side. One of my co-workers contacted the union representative, we’re going to have a meeting next week.", "Usually just jokes around and shares videos with each other. Most of the time she’s scrolling her phone while he does paperwork and manages people. Her job is to be an order selector.", "She must be really dumb if she doesn’t know why she was excluded.", "Well then maybe she can reflect on her behavior on her 5 mile walk and wonder why she is being excluded and why their is a union complaint against her", "Who said we haven’t filed a complaint? It’s a union job, takes time", "That is not my problem.", "Part of having a job is that you have reliable transportation to and from work. Expecting handouts is not reliable transportation", "What do you think he is an unpaid chauffeur?", "I'm one of the YTA votes. Nothing to do with her being a woman. He's an AH for how he handled the situation and for leaving her with no ride at 2 am alone and without any time to make other plans.", "What?", "Should have clarified that a good 1/3rd of the workers here are women 😂", "It’s also common courtesy to do your damn job and not burden others", "You wouldn't say y t a if the worker was a man.", "Why? He’s not harming her, he’s not harassing her. He’s just ignoring her and wants nothing to do with her.", "She didn't ask until he was leaving. You can't have it both ways. OP is allowed to be petty, that doesn't make him an AH.", "Looks like he offered them a ride. That’s not causing a scene.", "She wasn’t invited because she slacked off and other people had to pull her weight. Justified", "Thank you for the response and the extra clarification for it's use in the sub.\n\nI had just assume it was a esssshhh axkward. Haha.", "Thank you.", "Thank you", "Ok, you did, to who and why it is not working?", "Seems like your story is changing, my dude.", "You filed a formal complaint against her and she still wants a lift from you?!   Does she know?  Probably relevant information.", "So your solution is not giving her rides?", "You really sound *delightful*.", "Guys, please follow the flow here,  ppl saying OP let the woman walk alone in 2am for 5 miles,  OP replied: well she can get Uber, I then ask you think she can afford a Uber ? It seems not possible for her, then OP: not my business.  I am not saying OP needs to take her because that’s definitely his truck.  I guess I am just trying to say OP gave reply just to move the focus from he let a woman walk in 2am for 5 miles.  Of cause at the end, like OP said, it is definitely not his problem, I understand, adult fend for themselves.", "Huh?  What do you mean?", "She didn’t have a ride to begin with, nothing changed.\n\nOP isn’t the staff bus, she only received a ride as a courtesy and her work ethic ended that courtesy.\n\nClearly NTA.", "Bull.", "Telling her ahead of time allows her to make accommodations. Purposefully waiting until the literal last minute is rude and does negativity impact her. Sure, they technically don't have to give her advanced notice. But that makes them an asshole.\n\nI'm not saying she isn't also rude. Just pointing out OP was indeed \"petty\" since they had issue with the use of the word.\n\nEta: it also is far more unsafe for her to walk alone at 2 am vs walking with a group. OP is not directly harming her, but is putting her in an unsafe position.", "And your argument was that he didn't make a scene, I'm just explaining that he did.\n\nWhat you're trying to argue now is a completely different point.", "you're welcome!", "What’s wrong with me not giving free rides to people I dislike? I’m not harming them, simply not helping them.", "He does, doesn’t he?", "Yeah, I guess it’s from the thanks I get for dropping off my buddies after work"]}