{"id": 2300, "submission_id": "yuxe46", "title": "AITA for refusing to help my classmate and blowing up at him after he insulted my parents in the groupchat?", "selftext": "I (f19) am in university studying radiography. I have a classmate, \"Steve\" (m19). Steve and I went to the same high school, and we were friends. Not exactly close friends, but we did hang out from time to time.\n\nOne of our classes is human anatomy, and Steve is on the verge of failing the module. He's not the only one though, it's a really difficult class and has a lot of content.\n\nOne of our assignments for human anatomy is worth a good chunk of our grade and it's a powerpoint presentation. Steve asked me if I could help him with the presentation since I understand the module's content, and I agreed.\n\nThe day before I was supposed to meet Steve in the library, Steve made a rude comment in our class groupchat about my parents. \n\nFor context, my parents are Christians who are super enthusiastic about their religion, and they help run a chaplaincy service in the university, where students of all faiths or none can go pray, meditate or relax and talk to someone about any personal problems they're having. My parents are really passionate about it and sometimes go around the university handing out leaflets to students about the service. I'm an atheist and my parents accept that, but I still think they're doing a nice thing for the university.\n\nAnyway, Steve sent a photo he sneakily took of my dad handing out leaflets, and called my parents annoying as fuck Bible-thumpers, and some other rude remarks about their appearances. I was livid.\n\nWhen Steve texted me to confirm if we were still on for the next day, I told him not to bother coming, since he thinks it's funny to make horrible comments about my parents. Steve started profusely apologising and saying he didn't know they were my parents and that he was just making a joke, I blew up at him and told him that I don't want to help him with the assignment and he can go fail the class for all I care. Steve said I'm being petty and that I'm childish and unkind for refusing to help him over a silly joke.", "created_utc": 1668427640, "permalink": "/r/AmItheAsshole/comments/yuxe46/aita_for_refusing_to_help_my_classmate_and/", "score": 217, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I blew up at my classmate and went back on my agreement to help him with a difficult assignment\n2. I said some unkind things to him and I was possibly being petty, and I went back on an agreement I made to help him\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nYou were under no obligations to help him to begin with.\n\nNot to mention he’s such an ill-mannered asshole.", "NTA\n\nSteve needs to learn that actions have consequenses. He was a complete AH, said mean things about people he did not know behind their backs, and now he has to pay for that. Maybe he will learn yo keep his mouth shut in the future.", "You should tell him that when you said you would help him it was just a \"silly joke\" and that his life is also a \"silly joke\".\n\nNTA", "NTA I am an atheist too but I think that your parents are doing a nice thing for the community.\n\nConcerning Steve: it was not a joke. It became a joke because it was your parent. He said that to make you feel guilty.\n\nDo not care about him. Ignore is message. He can work harder and you would be better off without him.", "You're NTA. He can reap what he has sown and maybe he will have learned not to mock people,  especially those who have done him no harm.", "NTA. Steve wasn't \"just making a joke.\" He was insulting your parents. You are under no obligation to offer him help.", "I hate people trying to hand me pamphlets, but it's very easy to say no thanks. I'm an atheist too but still think your parents are doing good :) you don't owe him anything. NTA", "NTA, actions have consequences and ignorance isn't an excuse.", "NTA\n\nur parents are better christian’s than most that they don’t promote the chaplaincy just for christianity but for people of all faiths and are also accepting of you being atheists. Tbh they’re just being good people and he finds it okay to make rude comments about them. It doesn’t even matter that they were ur parents he’s just an asshole who doesn’t deserve ur help", "NTA, I call bullshit, yall went to HS together there is no way he didn't know those were your parents", "NTA!! \n\nThis guy is a tragic weenie and deserves to whistle in the wind. \n\nI am an atheist but have known lots of wonderful Christians who are incredibly compassionate and dedicated. Your parents sound awesome with hearts of gold and I love that you are clearly proud of them despite your religious differences.", "NTA  I guess Steve needs to learn to hold his tongue and not spread hate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f19) am in university studying radiography. I have a classmate, \"Steve\" (m19). Steve and I went to the same high school, and we were friends. Not exactly close friends, but we did hang out from time to time.\n\nOne of our classes is human anatomy, and Steve is on the verge of failing the module. He's not the only one though, it's a really difficult class and has a lot of content.\n\nOne of our assignments for human anatomy is worth a good chunk of our grade and it's a powerpoint presentation. Steve asked me if I could help him with the presentation since I understand the module's content, and I agreed.\n\nThe day before I was supposed to meet Steve in the library, Steve made a rude comment in our class groupchat about my parents. \n\nFor context, my parents are Christians who are super enthusiastic about their religion, and they help run a chaplaincy service in the university, where students of all faiths or none can go pray, meditate or relax and talk to someone about any personal problems they're having. My parents are really passionate about it and sometimes go around the university handing out leaflets to students about the service. I'm an atheist and my parents accept that, but I still think they're doing a nice thing for the university.\n\nAnyway, Steve sent a photo he sneakily took of my dad handing out leaflets, and called my parents annoying as fuck Bible-thumpers, and some other rude remarks about their appearances. I was livid.\n\nWhen Steve texted me to confirm if we were still on for the next day, I told him not to bother coming, since he thinks it's funny to make horrible comments about my parents. Steve started profusely apologising and saying he didn't know they were my parents and that he was just making a joke, I blew up at him and told him that I don't want to help him with the assignment and he can go fail the class for all I care. Steve said I'm being petty and that I'm childish and unkind for refusing to help him over a silly joke.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Steve is the one being petty, childish, and unkind. It actually doesn't even matter that it's your parents that he posted like this about (though of course it matters to you that it's your parents). The fact that he's happy to post it about anyone says exactly what kind of person he is. Just another AH hiding behind \"it's just a joke\" because he can't admit he's an AH. I wouldn't want to help him either and he definitely deserves the consequences of his actions.", "Nta Steve has alot of nerve to tell you your being childish and unkind. When he was the one that did a childish and very unkind thing to your parents. I wouldn't want to help him out either. If he doesn't like people passing out pamphlets of whatever kind he doesn't need to take it. His actions have consequences and you have every right to not help him.", "NTA - That was kind of petty though.  Sometimes people need to learn that talking shit about people they don’t know tends to backfire.", "NTA.", "NTA. It wasn’t a “silly joke” to you. Steve fucked around and found out, you were doing him a favor by offering help in the first place.", "NTA", "If Steve had said this about people who were not your parents, how would you react ?", "NTA\n\nHe was being a bully, doesn’t matter he didn’t know they’re your parents. Making fun of people maliciously is not okay. So taking the familial aspect out of the equation, why should you help a bully? I’d distance myself from a person like that too.", "NTA.  If you guys have been acquaintances since high school, there's no way he didn't recognize your father.", "NAH\n\nI cannot fault you for getting upset about your parents being insulted. That said, Steve is right. People peddling their religion on campus are annoying af. \n\nWould you have cared if the picture was not of your parents?", "In no way was his post \"a joke\"!", "Fatality lol that's such a savage clap back. I love it.", "That’s what I was wondering, though it’s possible because I don’t know many of the parents of people I went to school with but I was a bit of a loner so…", "Most of the people I went to school with didn’t know what my parents looked like. Only my best friends. I would find it way more uncommon for others to know them.", "NTA. Maybe he should have spent the time harassing your family doing schoolwork", "NTA - remind Steve that jokes are only funny if both people think it's funny.\n\nIt doesn't really matter that the picture was of your parents, you took issue with his behavior and no longer want to help him.  That's fair.\n\nSteve needs to take advantage of the resources available to him (tutors, office hours with the professor, the TAs, etc.) if he wants to pass the class.  Getting your help on a single presentation won't do it.", "NTA\n\n\nSteve needs to learn that his \"silly jokes\" (which are actually him being a judgemental so and so) have consequences.", "Fuck steve he can do his own shit on his own. Nta", "NTA . Doesn’t matter if they are your parents or not, he had no call to be going off like that about anyone.", "NTA, you offered to do Steve a Big favor and have just as much right to change your mind. This is a 'him' problem.", "Now, I would be absolutely mortified by my parents if I was in your shoes, but you have such a good attitude about it. You are totally NTA.", "NTA !!!This is that perfect situation of “f**k around and find out”.   With a dose of “play stupid games win stupid prizes”", "NTA You just found out how mean spirited and nasty he is. Even if it wasn't your parents I would think that he is a negative person I don't need to be spending time with. Mocking others for no good reason is not a good look on anyone.", "NTA\n\n\nHow very Christian of you though.  He did something you didn't like so fuck him let him suffer.  Jeebus would be proud.", "ESH. Steve shouldn't be engaging in bullying tactics like comments about appearance. But also, what your parents are doing is likely intrusive and unwelcome for many students. I get that it's not a big deal for you since you were raised in their faith even if you don't practice it now, so it probably feels normal to you, but for kids of other religions having to deal with Christians coming at them with pamphlets when they're just trying to walk to class is equally if not more obnoxious than what Steve did. I hear you saying what your parents are doing is non-denominational but I've noticed frequently Christians and former Christians describe things as non-denominational when there aren't overt mentions of Jesus but there still is a clear Christian bent...so are you really sure about that? As someone raised in the faith do you have a good idea of what a non-Christian influenced religious space would look like? Do your parents routinely work with other faith leaders to make sure their space is actually an equally welcoming space for all? And since you're defending your parents without considering Steve's likely valid perspective, ESH.", "Possibly gonna get downvoted here but ESH.\n\nSteve's an asshole and can deal with his own shit. There was zero reason to insult your dad's appearance. Easy as.\n\nBut what your parents are doing is likely also incredibly invasive, and yes, annoying as fuck. I know that what they're doing is non-denominational, but lemme tell you something. People trying to get others to go to a religious service is incredibly unwelcome.", "Really depends how big the school was and how close they were. My highschool had about 300 students in my grade, and I couldn't have matched parents to classmates in most cases.", "Lol", "The OP did say she was atheist......", "This, all of this.\n\nI wasn't raised with any particular religion, neither were my siblings, but we all turned out as atheists or neopagans. We're also all queer. My brother is specifically gay and trans. My sister and I are bi and ace respectively.\n\nA LOT of Christians are using their religion (or are philandering with others with a less religious framing to further their cause) to basically make it so my family can no longer go to the states to visit my dad's family, at risk of my parents being slapped with child sexual abuse charges for letting my brother socially transition, lobby for bringing similar laws to Canada, and are lobbying on both sides of the border for our reproductive rights to be stripped away from us, and also just general rampant queerphobia.\n\nAnd a LOT of the Christians who are doing the things I described above are also the types who would hand out literature to everyone.\n\nYou can't exactly blame us if we don't exactly take kindly to some random Christians inviting us to church with a leaflet. It sets off red flags for US, and we were raised in a family that accepts us for being queer and has always been chill about gender.\n\nImagine how this would feel for ex-Christians who've left the church due to the rampant homophobia, transphobia and misogyny, or for non-Christians who've experienced racist and xenophobic policies due to the influence of the church, or for queer Christians or Christian women who've had to deal with a religion that largely does not love them back.\n\nI understand OP's parents probably have good intentions, but the facts are that shoving leaflets at everyone is a dick move. Religious trauma is real, and people have a negative view of Christianity, and the types of Christians who hand out leaflets, in the English-speaking world for a reason.\n\nAlso Steve is an asshole. But that's obvious.", "And I  wasn't being sarcastic.  The Christians I know fully believe humans are disposable the moment they do something contrary to what they want."]}