{"id": 23037, "submission_id": "158fyca", "title": "AITA for not inviting my girlfriend to a congratulations dinner my parents treated my friends and I to?", "selftext": "I(26M) have volunteered with a local community outreach organization since I was a teenager. This year the group was one of the sponsors for one of our town's festivals. I was really excited and nervous about this because I was helping organize and run our booth, and speak to raise awareness about what we do.\r  \n\r  \nI was picked as one of two people to speak during our stage time and that had me extra nervous on top of everything else. The festival was free admission so I did ask my friends and family for some support, especially the day I was going to be speaking and to please just give feedback about how we all did.\r  \n\r  \nUnfortunately, 2 weeks ago my girlfriend(27F) had to put her cat down and she's been really depressed about it. I've been doing all I could for her to be there for her, support her, and get and do nice things for her while also juggling getting ready for the festival. I asked her if she'd come for a little bit during one of the festival days and she said she would try.\r  \n\r  \nShe didn't make it any of the three days and said she just wasn't up to being around a lot of people still. My parents and some friends did and were great with support. When the festival wrapped up, my parents said they'd take us (me, my friends that showed up, and the other person working the booth) out for dinner for a job well done.\r  \n\r  \nHere's where I might be the a-hole: I didn't invite her since she had said she wasn't up for being around people and my parents had only mentioned those they saw at the festival any of the days. While we were eating she text asking me if I wanted to pick up dinner to eat at her place with her. I told her I was already eating out with my parents. She got mad that I didn't invite her along. I offered to bring her something from the restaurant and explained my parents had only invited the people they saw at the festival. She's still mad at me and says I should've invited her by default so AITA?\r", "created_utc": 1690217186, "permalink": "/r/AmItheAsshole/comments/158fyca/aita_for_not_inviting_my_girlfriend_to_a/", "score": 563, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) My action: I didn't invite my girlfriend to the congratulatory dinner my parents took my friends, colleague, and me to after the festival closed down. (2) Why it might make me an asshole: She is my girlfriend and I probably could've invited her and let her decline the invitation if she didn't feel up to it and without my parents having mentioned inviting her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nShe point blank told you she wasn't up to be around people.  She can't get mad at you  for her inconsistencies.  She owes you an apology for not supporting you. Finally, your parents didn't invite her.", "She wanted you to invite her to something you were invited to? That's wild. You were neither hosting nor paying, so that would have been completely inappropriate. She needs to check her privilege at the door. NTA", "NTA. I get that her cat died, and that is tragic, but she said she didn’t want to be around people and didn’t show up at the festival. She had three days to show up to support you and didn’t.", "NTA Your parents invited you and your friends to dinner. It really wasn't your place to extend an invitation to your girlfriend on their behalf. If your parents wanted to invite her, I am sure they would have told you, give Gertie a call and see if she'd like to join us.", "NTA You were not the host. It's that simple.", "NTA. She wasn't up to going on any of the three days and she told you she wasn't up for being around people. And your parents invited the people that were there at the time. You offered to bring her something from the restaurant and that's good enough.", "NTA. You were invited as a guest, you were not the host. You were also giving her the space she (indirectly) told you she needed at that time. The fact that she's still upset with you for having dinner with your parents without her makes me wonder if she's looking for a little extra attention.", "NTA, she made a decision that was believed to be right for her at that moment.  She doesn't have a right to be angry at you because she chose to be alone.  She would not share in your moment, therefore she was not asked to attend the celebratory dinner.", "NTA. She was raw over her cat, and took it out on you. I bet she knows what she did, and is probably not proud of it.", "NTA your reasoning is sound. \n\nShe sounds like she will only come if it benefits her. She is currently mad at you because deep down she knows that she is wrong.", "NTA, your girlfriend needs therapy or something. It sounds harsh but she can’t expect everyone to pitter patter around her just because she’s depressed - you did nothing wrong", "Girlfriend need to realize your parents did the inviting, so it was never up to you who did and didn’t go to dinner. You can’t just invite her along when someone else is treating. NTA, and she has some maturing to do.", "NTA. She communicated that she wasn’t in the mood to be around people, and you had no control over who your parents invited.", "NTA... She didn't want to be around people.  You aren't a mind reader.  Sounds like she could be around people if there was something in it for her.  Seriously, in relationships, you have to show up for each other even when you don't feel like it.  The people that show up for you are the ones you should keep.  \nAlso... it was your parents who invited, not you.  They didn't extend the invitation to her.  So I don't see any way that you are at fault here.", "NTA.  She sounds like she is looking for things to be upset about.  She didn’t want to be around people, you respected her wishes.  Your parents took out the people that showed up, you honored their wishes.  If she wants to live by “shoulds” then she should have said in advance, even if I don’t come out, I would still like to get dinner with you afterwards, but she didn’t.  \n\nI see her in full victim energy here.  Don’t let this bother you.  This isn’t your problem.", "NTA. It was a spur of the moment dinner request. I honestly wouldn't have thought to stop and invite her.", "NTA. It was an oversight not to invite her but understandable considering the circumstances. And you offered to bring her dinner, which is what she originally wanted.", "NTA.  Your parents issued the invite to you and your friends.  Funny that GF wasn't up to attend something important to you but was totally on board for dinner.", "It comes across to me as \"You're spending your attention on other people? How dare you!\" I absolutely adore my animals and have been devastated anytime I lost one, but I would still have made sure to make an appearance for my husband at something that important. Her needs are not the most important ones in the relationship. NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI(26M) have volunteered with a local community outreach organization since I was a teenager. This year the group was one of the sponsors for one of our town's festivals. I was really excited and nervous about this because I was helping organize and run our booth, and speak to raise awareness about what we do.\r  \n\r  \nI was picked as one of two people to speak during our stage time and that had me extra nervous on top of everything else. The festival was free admission so I did ask my friends and family for some support, especially the day I was going to be speaking and to please just give feedback about how we all did.\r  \n\r  \nUnfortunately, 2 weeks ago my girlfriend(27F) had to put her cat down and she's been really depressed about it. I've been doing all I could for her to be there for her, support her, and get and do nice things for her while also juggling getting ready for the festival. I asked her if she'd come for a little bit during one of the festival days and she said she would try.\r  \n\r  \nShe didn't make it any of the three days and said she just wasn't up to being around a lot of people still. My parents and some friends did and were great with support. When the festival wrapped up, my parents said they'd take us (me, my friends that showed up, and the other person working the booth) out for dinner for a job well done.\r  \n\r  \nHere's where I might be the a-hole: I didn't invite her since she had said she wasn't up for being around people and my parents had only mentioned those they saw at the festival any of the days. While we were eating she text asking me if I wanted to pick up dinner to eat at her place with her. I told her I was already eating out with my parents. She got mad that I didn't invite her along. I offered to bring her something from the restaurant and explained my parents had only invited the people they saw at the festival. She's still mad at me and says I should've invited her by default so AITA?\r\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH. I think it was a misunderstanding. She said she was not in the mood to be with a lot of people, but she would have liked to have dinner with you and your friends. OP couldn't know this. It would have cost him nothing to ask, but that doesn't make him TA.", "Sounds like she just wanted you to bring her food, honestly...\n\nNTA.", "Your communication with your gf sucks", "Do you two normally eat dinner together like is it a daily thing?", "I was so ready to tell you that you showed her she wasn't important for you enough for you to want her to be there to celebrate. However nope nope nope. NTA\n\nI get her sorrow on her lost. And so often people don't get how loosing an other species friend can hurt so deeply. \n\nHowever, the invitation was made from your parents for those who were participating in your achievement.  \nYour girlfriend made it clear she wasn't up to see anybody. Not even to show you support for days. So why would you ask her to go to the celebration diner?\n\nFirst you would have had to ask the others, if they didn't mind her coming. Then ask her if she wanted, without making her feel obligated. Anyway you were respecting her wishes.  \nShe insisted and showed she was not willing to be around people. To the point she wouldn't show you support for days. If you had asked,  I have the feeling she would have said you tried to pressure her. Accusing you of making her feel guilty.", "NTA\n\nIt is really rude to invite people when you aren't the host. I have a friend who does this and it is so obnoxious.\n\nYou could have asked your parents if she was included, but considering the circumstances it's understandable that you didn't.", "NTA. It is sad to lose a pet. But if your gf has decided life is now going to be shut down until further notice (unless she can get a free dinner), perhaps you should go your separate ways.", "NTA\n\nIf she wasn’t up to being around people she wasn’t up to being around people.", "NTA-  she can’t support you at a festival but she can go to a free dinner?  That’s says it all.", "NTA.  If she's not up to support you at the festival, I don't see why she would be invited for a meal your parents are paying for to celebrate it after.  If she had been at the event, she probably would have been invited.  Maybe a text saying won't be home for dinner would have been nice, but that's about all.", "What kind of audacity is this! NTA", "NTA. It wasn’t up to you to do the inviting. But if your parents asked if you wanted to invite her and you didn’t bother to ask her because you were salty, well, then that would be a different scenario potentially.", "NTA overall but do you actually want her to come bc I kind of feel like your parents would not mind...", "NTA. She was too depressed to come and support you, but not too depressed to go out for a free meal?", "Why a few people she knows at a dinner is a much different crowd than a huge festival of random\npeople you don't know with loud noises all around.", "I think she’s TA not necessarily for her lack of support but for deflecting his event success to focus on her disappointment over something he could not have foreseen.", "Not daily, we eat dinner together 2-3 nights a week.", "You're right. A festival is MUCH EASIER, because you can wander around, barely speak, and leave when you want.", "Yikes. So my line of thinking was she was angry because it's a daily thing. Wow she really couldn't be bothered to show up one day for you but expects to be treated for work she didn't do. And you were kind enough to offer to bring her dinner! Grief affects us all differently but selective socializing is a new one for me!", "NTA - she can’t have it both ways.", "NTA, but you could've communicated better with her.", "It was an off-the-cuff dinner for folks there and, she was not there. Also, it was your parents hosting the dinner and they set the guest list as it were - it wasn't for you to change it.\n\nNTA", "NTA", "NTA, she wasn’t at the event. She didn’t want to be around people, which is very okay. The people, who she would have had to be around, were at the event. You also were not the one inviting people. It was a last minute thing to go have dinner by your parents, it wasn’t a planned outing. Significant others are not always invited by default especially if they are not there. You offered to bring her something.\n\nAlso, was the event actually close to where she was or would she have had to travel a bit to meet you? Was she ready at that moment to leave the house for dinner?Even if it was close, still NTA. I’m just curious.", "Thank you for bringing up a great point.  Unless Op is a mind reader, how is he supposed to know she’s too upset to attend the festival for moral support, but when it comes to being with people at dinner, she’s all in.", "I came here to say this. Sometimes people are looking for a fight (maybe in her case it’s because she’s hurting and looking for some way to vent those negative feelings). \n\nWhatever the reason, you are NTA - she was not invited by your parents and you were honouring her wishes to not be around people.", "The festival area was about a 13 minute drive from her apartment, and where we went for dinner was 15 minutes the other direction. We live in a pretty small area. I don't know if she was ready to leave the house for dinner, I'm guessing not since she had wanted me to pick up food to go to her house to eat with her.", "Still NTA, I’m also guessing you don’t live together since you said her apartment and she asked you to come over for dinner, which means she was not actually expecting you for dinner like if you lived together. She is overreacting a bit which is probably due to being depressed but not cool to be angry with you over something that happened that was not your plan and didn’t cancel anything you had planned with her.", "Too depressed to be around people? Unless there’s a free meal involved I guess. NTA", "NTA Has it occurred to you that your parents are relieved she wasn't there, out they would have reminded you?  She sounds exhausting. I don't want to go honor and support you, but if it's free food, call me.", "NTA she wasn't up for being around people but was up for dinner? Sounds like just a reason to be mad. Y'all young she will be fine.", "She said she didn't want to be around people, so you carried on accordingly. Clearly, she actually just wanted to pick and choose which event she said yes to. Which is fine, but she doesn't get to now be rude because she changed her mind. NTA", "I'm going with NAH, depending on some factors. How long has she been your gf? A long time? Like more than a year? Has she met your parents several times? If so I think it would have been perfectly appropriate to ask your parents if it was alright to see if gf wanted to join. I know people are saying you weren't the host but these are your parents and it's a dinner for you. I know she said no to the festival but a dinner is different, I would have advocated checking in with her, especially if she expected you see you later.\n\nBut it's also totally understandable that you assumed she wouldn't be up for it, and you offering to bring her food was also very kind. \n\nIf she's a much more short term relationship and hasn't spent much time with your parents then I'd lean a little more towards N T A, she would be kinda overstepping there.", "NTA. She said that she didn’t want to be around people. You took what she said and respected it.", "Fuck That - NTA", "NTA IF it had been you doing the \"treating\" then she might have a leg to stand on but she didn't participate, claims she can't be around people, and wasn't invited.  I'm sorry about her cat, but unless she has some serious underlying mental health issues 2 weeks of social isolation for the loss of her cat is a bit much.", "I’m so confused. She literally told you she didn’t wanna be around any people. Wouldn’t there be a bunch of people at dinner?? Def NTA", "NTA Too distraught to be supportive yet not too upset to be treated to dinner...funny how that works.", "NTA \nIf she’s too upset to be around people to the point she can’t make an appearance for 5 minutes over 3 days, why on Earth would she be upset she wasn’t invited to dinner with everyone who did show up for you? Her being upset would make me look at her all kinds of sideways", "Honestly the amount of posts I read of wives and girlfriends being so high maintenance is starting to give me a headache. \n\nGoodness. \n\nNTA. You didn’t intentionally set out to hurt her. Nor can you read minds. You were actually trying to be considerate of her current situation by not pressuring her to go to the event when actually you should have wanted your partner to be there and supportive of you.", "NTA. I could get that maybe she didn’t want to be around crowds, but being around friends and family would be different and okay - maybe even helpful. Often when I can’t be in public spaces, I still like to be around people I’m close to because it feels safe. It’s not your fault in any way, nor were you an asshole, but it may make a difference to her to say that you’ll make sure to check next time to see if she wants to come. She’s grieving right now - if she’s usually not like this, I can totally see her being a bit irrational and emotional. Good luck!", "NTA she is using the cats death as a crutch to not go out with you.", "NTA\n\nIt sounds like she wanted the free meal but not to help out at all. I would tell her it was for people who worked at the festival. If she wants the meal then she should have helped.", "You could have asked her anyway , after all she is your girlfriend.  She might have said no , that she wasn't up for it, but the thought counts .", "I’m really not up to seeing people* right now. \n\n* unless they’re bringing me free food. \n\nNTA", "NTA, you respected her wishes, she said she didn't want to be around anyone. But from a girls perspective she's probably upset that she missed out regardless and just wanted to spend some time alone with you (have you two been getting this recently?). And she's grieving, she's going to be set off easier for a while, even if it's not justified", "NTA- while she might be heart broken, this sounds like it would have been a happy escape for a few hours. Pity she missed it, but life happens when you opt out of things. You had a fun, impromptu dinner with friends and family. I can see how she wouldn’t have crossed your mind. She didn’t want to go out earlier.", "NTA!\nShe doesn’t sound like a very good girlfriend!\nYou asked for support and she didn’t give it.\nYeah it’s sad her cat died, but I still think she could have been there to support you.\n\nShe specifically said she didn’t want to be around people so why would you invite her!", "NTA. But it also sounds like she feeling better. It was your parents’ invite and hosted it. I thought it was generous of you to pick something up for her.", "NTA your parents were inviting as hosts to an occasion were the invited people took part in. She wasn't there so there is no reason to invite her.", "You are NTA. She wasn’t invited because she wasn’t there. It’s not a hard concept to grasp. This is coming off very entitled. Like she only wants to be there if she’s gaining something in return, in this case, the food.", "NTA\n\nFirst off its not your place to invite *anyone* to a dinner your parents are hosting.\n\nSecond, the audacity of your girlfriend to think she gets an auto-invite to *every peripheral event in your life* by default! My gosh!\nRomantic stuff, where you need a \"date\"? Yes, its her. Casual social stuff, sure, ok. But everything, everytime? She wasn't a part of this! This wasn't romantic or social. This was a specific event related to an event she hadn't attended.", "NTA. When my cat died it was the most horrible time ever and I was so totally drowning in grief I wouldn’t have wanted to go to a restaurant and make nice with people.  She couldn’t drag her ass out to support you but wants you to invite her out dinner nope not a chance. She’s out of line.", "She wasn't up to being with people at dinner. She was only up for getting a free meal. NTA.", "There’s no way for you to read her mind. There were people at the dinner and she just said she didn’t feel like being around people. NTA", "Don’t fall for this manipulation OP, you did nothing wrong. You were there for her when her cat died and I understand the bad timing she wasn’t there for you when she had 3 days to. Also the dinner was a spur of the moment thing for people who your parents were around, it’s not like they planned this days in advance. She owes you an apology for cussing you out.", "NTA, damned if you do, damned if you don’t.", "NTA. She sounds entitled from what you say. She can’t manage to be supportive and help you out and be around people but can suddenly be ok with being around people if it involves being invited to dinner. Naw dawg. Sounds like a straight up biatch.", "She should have supported you at least for an hour one of the 3 days. Now she’s up for being around people and wanted to go to dinner? NTA", "Hindsight you could’ve checked in.. but she was not up to being sociable and it was spur of the moment. You didn’t plan to not invite her.. you’re not an ass", "YTA.", "NTA. She said she wasn’t ready to be around people.", "NTA. You've done nothing wrong. Don't let her convince you otherwise.", "NTA. Your parents were the hosts and invited the people they saw at the booth. She didn’t show up and even said she didn’t want to be around people.", "NTA \n\nThe dinner was a part of the festivities she chose to not attend. \n\nAdditionally, it was not your dinner to invite her to- it was a dinner your parents paid for- and it seems that it was a  spur of the moment invitation for those in attendance to celebrate. \n\nShe can be pissy all she wants, but it seems she’s just in it for a free meal. If she was equally upset that she did not attend your speaking event, I’d understand a bit more. But no, she’s mad she didn’t get a free meal delivered to her or invited to a sit down meal she didn’t have to pay for.", "NTA. She told you she wasn’t ready to be around people yet. Now because you are not a mind reader she is mad? Your GF is the AH here. She failed to support you and then expected to basically be supported.", "NTA. She said she didn't want to be around people. You listened to her.  She is just mad because she wanted to go to dinner. She cannot have it both ways. \n\nPay attention to this type of behavior.", "NTA", "NTA.  your parents were the hosts and invited people they had seen. It was Very reasonable for you to assume that if your girlfriend was not up to being around a lot of people, she would not enjoy going out to dinner with a group.", "NTA. I would be absolutely heartbroken and depressed if my cats died, but I'd absolutely show up for something my boyfriend worked hard on, especially when you have 3 opportunities.", "Your parents made an invitation to people who were at the festival.  She wasn't there.  Did you parents say you should invite your GF?\n\nIt sounds like she wasn't invited.  In fact, I may have been awkward for her to be there, as she wasn't at the festival.  I can't tell.  You would know better than I.\n\nNTA", "NTA you don’t get to invite anyone to a dinner your parents are hosting because it’s rude. But it’s weird how GF couldn’t be bothered to come out and support you for an hour or two and couldn’t be around anyone but she can go out to a group dinner no problem. She’s being selfish and entitled.", "No, NTAH.", "NTA. You did invite her along... to the festival. She wouldn't make time for you and your speech and inturn missed out on the generous meal with your friends and family who did. Wow. NTA!", "NTA - she both wanted space and didn’t want space. You’re not a mind reader.\n\nAlso, she is making everything about her. You had something you asked for moral support for and she couldn’t be there two weeks after your cat passed away? And then instead of congratulating you on a success - turns it into you not inviting her?\n\nCongrats on crushing it. Glad you have awesome people in your life to support you. I’d start slightly paying attention to whether or not she falls in that category. \n\nNo need to decide right now, but I’d keep an eye out", "NTA, \n\nI'm sorry but if she couldn't support you for one day, 2 WEEKS after her cat passed away, that's not right. You had the right thought she didn't want to be around people so why invite her to a dinner with a large group. When she messaged you about food you never said get your own you offered away to organise her food. Plus it's kind of rude to ask to add people to the list I know it's your girlfriend but it's also a large group of people. A very polite gesture Of your parents for the people who came out to support you", "NTA\n\nYou didn’t plan the dinner, she told you she didn’t want to be around people, and it always a celebration/gift for you. Not to mention, how is she mad at you for eating after a long several days?\n\nI’d ask why she is upset. “Not being invited to dinner” doesn’t feel like enough. Is this something that’s happened before? Has she been wanting to spend more time with your family? Was the restaurant a special place? I don’t understand.", ">She didn't make it any of the three days and said she just wasn't up to being around a lot of people still\n\nHer words. She can't pretend she didn't say this and turn it around on you and say you're the AH. Offering to bring her food was kind. NTA.", "NTA. If she can’t suck up her depression to support you during your actual event, I don’t see why she can suck it up now that a restaurant, of all places, is on the table. And I say this as someone with enough depression to prevent me from doing things. It is unreasonable for her to expect an invitation when she already turned down participating in the day, even if she’s unhappy with herself for already having turned down the invitation.", "If you had reached out to her ahead of time and let her know your parents invited you out for dinner and you wouldn’t be coming over, do you think she still would have been upset? I wonder if she just isn’t feeling upset because she didn’t know where you were and was expecting you to come over. Seems like she’s pretty emotionally reliant on you right now. I don’t think you did anything wrong so you don’t have to apologize to her. But if you want to smooth things over with her then you should just acknowledge her feelings and continue to offer your support of her like you have been doing. Maybe invite her out to dinner with just the two of you for as soon as she feels up for it. She probably just wants some positive emotions and distraction to latch onto.", "I think it might have more to do with not being asked, then actually going out to dinner. He mentioned her calling him about getting dinner and eating it at her place. So that means she was clueless about his whereabouts. So to hear he was out to dinner it probably stung a bit learning where he was. Maybe she felt a bit forgotten", "I thought this too. I love my dogs so much but I could absolutely pull it together to be there for my husband, especially after two weeks.", "Even so, he did not have the right to invite her since he was not the one who paid for dinner but his parents, I consider it rude to invite a person to something that you are not paying for", "We've been together a little more than 10 months. She's met my parents before, and my parents have invited her to some outings but not all of them. They didn't invite either of my brothers and they're local as well they kept it strictly to people who showed up for the festival. We didn't have any plans to meet up later in the evening or else I would've told my parents that that evening wouldn't have worked.", ">It would have cost him nothing to ask\n\nShe told him explicitly she was not up to being around people. So much so that she was unable to support OP on any of the three festival days.\n\nIf he had asked her and she reacted the way she might just as likely react, she'll get mad and ask, \"I already said I'm not ready to go out. Stop pressuring me just because it's your precious parents' dinner!\" Then he'll be blamed anyway.", "You can’t mope around for weeks and not be a supportive girlfriend for a big event and then get catered to. She wasn’t invited because she didn’t show up for him. \n\n\nI understand she’s grieving, but the world doesn’t stop for our pets, that’s just a fact.", "Forgotten? That would be ridiculous on her part. She was invited to go out to be part of the support and she declined. Citing she didn’t want to be around people.\n\nThat “congratulations dinner” is part of support, which she declined to be a part of.\n\nThat dinner is taking place at a restaurant with people, which she also declined to be around.\n\nShe already turned down the dinner without even knowing about the dinner. Even if she was invited, after 3 days of non-support, showing up to the dinner is a bit like writing your name down on a card for a gift you had no part in giving.\n\nGF would only be forgotten if OP ignored her wishes and actually sent an invitation, because she already made it crystal clear she didn’t want any part of it. Until she found out there was food involved. It’s just selfish.", "Or just for getting invited. She might still have declined but getting invited while you're feeling down can make a difference.\n\nI think NAH. It makes sense that OP didn't invite her, especially since she said she couldn't be around people and she wasn't part of the group. It also makes sense that the girlfriend wants to know she is being thought of even when she can't make it.", "It's okay to feel a little left out in this situation but ultimately it's up to the GF to be able to reflect on the situation even a tiny bit and understand she put herself in this position. Feeling a little left out initially is fine, getting mad and continuing to stay mad at OP makes her an asshole."]}