{"id": 23036, "submission_id": "158ehlq", "title": "AITA for offering to take my daughter grocery shopping, but NOT just giving her money?", "selftext": "My kid got a full scholarship to a great school that’s about 2 hours away, and we told her that if she needs help or money from us, to just ask. She has always been mostly responsible and we figured she would be smart enough to not abuse our kindness. She knows how to cook, how to budget and meal plan.\n\n&#x200B;\n\nShe did great during her first year, asked us for $50 here or there, no problem. But during year 2 started to develop some bad habits. She wasted her money on crap like fast food and door dash, pizza and all that. A treat once in awhile isn’t an issue. Getting pizza once a month is fine. Getting an iced coffee here or there, fine. But being so lazy she has garbage like taco bell and mcdonalds *DELIVERED* TWICE A WEEK is insanely wasteful, decadent behavior.\n\n&#x200B;\n\nHowever, it was none of our business UNTIL she asked for money.\n\n&#x200B;\n\nWe told her that we’d be happy to take her grocery shopping if she writes out a list of what she needs. Or if she’s busy, I’ll drive up and get her groceries for her. But she pushed back and asked for the money so she could do it on her own time. We said no, we want to make sure that if we are giving her money, it’s for GROCERIES, not for trash. A bag of rice, some frozen veggies, some fresh meat or whatever else.\n\n&#x200B;\n\nShe claims we were fatshaming her and went on a huge rant about how I was always an almond mom. It’s got nothing to do with her body/size. She could be 200lbs for all I care, so long as she’s actually taking care of herself and making smart financial decisions.\n\n&#x200B;\n\nAccording to her, we’re huge assholes. Are we?\n\n&#x200B;\n\n**Her job is 40 hours a week IN THE SUMMER** not when she is in class.", "created_utc": 1690213944, "permalink": "/r/AmItheAsshole/comments/158ehlq/aita_for_offering_to_take_my_daughter_grocery/", "score": 142, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We are refusing to just send money to our daughter for food and are telling her that we will buy her groceries, not just send money. This can be seen as us trying to control what she's eating, and she's a grown woman. Plus it can be seen as us judging her for indulging in treats like fast food too often.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Send her a gift card to a local grocery store near her. \n\nPart of learning to adult is learning how to grocery shop. If she chooses top Ramen and box mac & cheese, so be it. She's a college kid and it's part of the learning experience.", "NTA. She's grasping at straws for a way to blame you for this, and what she came up with his body shaming. You never said anything about her body, just her financial choices because honestly ordering Doordash once a week is excessive for a college student. That shit is expensive, and if she wants to order it multiple times a week then she can pay for it herself. You said she has her own job, she can pay for it with that.", "NAH  \ni think it's reasonable to say if you're giving her money, she needs to spend it responsibly and on less takeout, but also try to cut her some slack. Ordering takeout twice a week isn't lazy decadent behavior. College eats up all your time.  It can easily take up significantly more time than a full-time job between classes and homework you can easily spend 16+ hours a day on school. it can be hard to make time to add in cooking and everything else.", "NTA.  If she really needed groceries, she would have accepted your offer.  She just wants the money.", "NTA\n\nI would just buy some essentials for her and not give her the choice.  She has proven she cant be trusted to budget properly and treats are fine but if they mean you cant afford the basics then something is wrong.", "If something is conditional, it isn't a gift.  If you want credit for throwing a few dollars at her, then make sure it's really a gift and not just another way to pass judgement on your \"lazy, wasteful, decadent\" daughter.  Be honest but realize that this is the way she--and clearly many of the rest of us here--will view you for it.", "NTA. She proved that she knows how to manage and did so last year. This year, she is developing bad habits that do not save her money. Taking her grocery shopping is helpful and useful and you are giving her what she needs, but this is not what she wants. \n\nPerhaps have a conversation with her about stress/depression though. Being away at college can be tough, and perhaps this is her coping mechanism (in a short-term not-very-helpful-in-the-long-term way)", "NTA, your daughter is privileged to have parents willing to pay for here groceries. She can either accept it or deny it and get a job to work for cash. \n\nYou’re paying for it, you have a right to know where your money goes, if you don’t want to finance a junk food lifestyle then it’s okay to refuse to.", "Decadent?\n\nThat's a little over the top, don't you think? \n\nNAH, but maybe lighten up on the dramatics, huh?", "Try sending her monthly gift cards? One for food and one for takeout services. College stress + trying to manage your money + diet is never fun. I don't know your daughter but when I was at uni my ability to plan my meals got worse the more overwhelmed I was.", " Not sure you’re teaching her what you think you are.  Tell her that you’ll give her and extra $50 every other month or quarterly or whatever you think is fair (were she spending her money “appropriately”) and when it’s gone, it’s gone. \nThat’s teaching budgeting, what you’re teaching is food shaming.", "No you're being frugal and reasonable and are modeling that behavior.  \n\nAs a college student I would of been beyond overjoyed if anyone brought me groceries.  I starved my ass off half of the time.", "NTA Your daughter needed money for groceries. You offered to take her shopping or drop off food if she gave you a list. You let her know your not going to hand her cash to spend irresponsibly. She didn't like it, so she resorted to playing the victim. Either she wants the groceries or she doesn't but if she wants to order food, she can do it on her own dime.", "NTA - if she made an argument that she doesn’t have time to cook than maybe, but she’s not going to learn financial responsibility with “your” money unless you attach some strings", "NTA. This is about teaching frugality, not judging what she eats. The Bank of Mom and Dad offers an excellent interest rate (0%) and great repayment terms (never), but in place of fees you get a few lectures on responsibility. Comes with the territory and she should be smart enough to know it’s still the best deal in town!", "\"But being so lazy she has garbage like taco bell and mcdonalds DELIVERED TWICE A WEEK\"\n\nOh THE HORROR. I don't see anything wrong with that at all.\n\nNTA. Your daughter misinterpreted the reason, and you do after all get to set the rules of your home.", "INFO\nAre you limiting her grocery list to certain types of foods?  Or are you willing to buy any groceries she puts on the list including \"junk food\"?", "NTA! I did the exact thing with my son when he was in college. I was not about to contribute to his fraternity’s beer fund!", "She wants to live on door dash and your dime.  Sorry, but that's a huge waste of money.  Your money.\n\nNTA to have a sit down with her and tell her no more door dash.  Get off her ass and pick up her food if she must have it.\n\n\"She claims we were fatshaming her \"\n\nAlso, classic redirect.  Not accepting responsibility.", "NAH. First off, it's reasonable for you to want to make sure your money goes to groceries and not take out. Luckily, there's a simple solution: most major grocery stores offer gift cards. You don't often see them, but they exist. \n\nHowever, I get where your daughter's coming from. Her first foray away from home, naturally she wants to be able to buy food that *she* wants without feeling like she's being judged by her parents. (And she does feel judged by you, based on her comment.)", "Maybe give her a gift card to the grocery store? NTA", "It's fine to limit your financial support to causes you support, like proper food. \n\nHowever, YTA for shaming her. Take a look at how you describe her behavior: All caps, exaggerations, assuming she's lazy, assuming decadence. I am sure she can sense where you are coming from. \n\nAn example: While I may agree that it is wasteful to have junk food delivered at your door twice a week, it is not insanely wasteful. *Insanely* wasteful is things like flying your own private jet all the time for no other reason than being seen as high status. You are shaming her in your own mind. \n\nInstead, be real. Drop the shaming crap. Be a mother. Tell her you're worried about her health and that you don't want to support unhealthy food. Ask how she is. Ask what's changed between last year and this year.", "Slight YTA. You offered to give her money for food, no strings attached. Now that you don’t like what she’s eating, you want to control it. I get wanting her to stay healthy and not overspend on delivery, but she’s an adult and you’re being overly controlling. I do give you props for offering other help, though.", "NTA. My parents have said that they are happy to buy groceries for me, even if it's microwave meals and such, but they won't pay for takeout or snacks (chocolate, chips). It's reasonable for you to help them survive, and the occasional snacks and treats are okay, but if she wants to live above that, then she should get a job to pay for extras.", "INFO: as a result of these \"habits\" is she now asking for more money than before? Or about the same and you don't want the money going toward delivery?", "From your replies, it's clear that she's making her own money. Why can't she just use her own money? Clearly she's not budgeting properly.\n\nNTA and don't let her use you as an ATM.", "Whoa, yeah, YTA.  You want her to be a monk.  You want her to make the decisions you would make.  Either help her or don't, but don't be a dick about it.", "NTA. If she had a true need and not just a want, she would have been delighted that you’d help her with groceries and even bring them to her.", "YTA.  She's in college, did you forget what that's like?  If she has a full ride, that means her class load is pretty intense and she must maintain a certain PGA level, meaning she must spend many hours studying, meaning she doesn't have time to cook full meals.  And if she does have spare time, you best believe she's not gonna waste it in the kitchen, but hang out with her friends.\n\nShe calls you an almond mom, **not** a compliment.  If you keep nagging her about her food choices, you can create problems for her mentally when it comes to food and body weight.", "Ordering food is \"decadent behavior\" ?\n\nYTA.\n\nYou either agree to give money so that she can buy whatever she wants or you don't agree to give her money.\n\nShe's not a kid anymore. She's an adult who is apparently perfectly capable of dealing with her own life and her own money.\n\nThis sounds like controlling behaviour on your part.\n\nEDIT : That girl is in school and is working 40 hours a week. When is she supposed to have time to cook ?", "Yes, YTA. You don’t have to pay a cent for college tuition or housing? Send her a little bit of gd money every month instead of being so controlling.", "NTA.", "NTA but explain clearly why you’re doing what you’re doing. If you have the money I would say it’s ok to give a small amount but make her promise you it’s for grocery shopping only and it won’t be a continued thing", "NAH. I get it. Can I suggest a compromise? Can you send her gift cards for her local grocery store? That way your daughter wouldn't feel like you were monitoring what she eats, but you still know the money is going toward groceries rather than take out/delivery.", "YTA\n\nIf you want your child to become responsible HELP then learn to responsible. You’re babying a college kid, who had their act together enough to get scholarships. Part of college is to stair step into adulthood. If you don’t approve of their food choices, then disengage entirely and tell them to go to the dining hall, get a job, whatever. Driving to monitor what they buy at the supermarket isn’t a compromis. It’s helicopter, controlling parenting. If you are an almond mom, all the more reason to step back. Your kid needs to eat.", "check for a new friend with these new ideas.  that fast food diet is way unhealthy", "YTA. Seriously OP. She’s a grown woman. You’re infantilizing her in a way. That’s a form of abuse.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy kid got a full scholarship to a great school that’s about 2 hours away, and we told her that if she needs help or money from us, to just ask. She has always been mostly responsible and we figured she would be smart enough to not abuse our kindness. She knows how to cook, how to budget and meal plan.\r  \n\r  \nShe did great during her first year, asked us for $50 here or there, no problem. But during year 2 started to develop some bad habits. She wasted her money on crap like fast food and door dash, pizza and all that. A treat once in awhile isn’t an issue. Getting pizza once a month is fine. Getting an iced coffee here or there, fine. But being so lazy she has garbage like taco bell and mcdonalds *DELIVERED* TWICE A WEEK is insanely wasteful, decadent behavior. \r  \n\r  \nHowever, it was none of our business UNTIL she asked for money.\r  \n\r  \nWe told her that we’d be happy to take her grocery shopping if she writes out a list of what she needs. Or if she’s busy, I’ll drive up and get her groceries for her. But she pushed back and asked for the money so she could do it on her own time. We said no, we want to make sure that if we are giving her money, it’s for GROCERIES, not for trash. A bag of rice, some frozen veggies, some fresh meat or whatever else.\r  \n\r  \nShe claims we were fatshaming her and went on a huge rant about how I was always an almond mom. It’s got nothing to do with her body/size. She could be 200lbs for all I care, so long as she’s actually taking care of herself and making smart financial decisions.\r  \n\r  \nAccording to her, we’re huge assholes. Are we?\r  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: Does she have a job? Is it a matter of her not having time to cook? Or is it really that it's just *easier* to order up some Taco Bell from Door Dash?", "What is an almond mom?", "NTA.  When I was in college, I had an allowance.  If I ran out of money, that was that. I got nothing until the next time. She's not going to do well after college of you keep bailing her out, and that includes taking her grocery shopping. She has to learn to budget.", "NTA ~ fiancé’s son eats at restaurants once a day as a college student.  He declined our offer for a meal plan which includes off-campus food and groceries.  So he can work and spend that money on food, I guess!", "This seems pretty YTA.  She's a young semi-independent adult.  You can put dollar limits on how much you'll contribute to her upkeep, you don't get to say \"Why are you buying the Zesta saltines when the Premium are $0.50 off this week!?!?!\"", "YTA. Might be controversial, I’ve been the daughter in this situation so my opinion is probably biased but I think what you’re doing is food shaming and overbearing. It may come from not understanding her situation well enough, or perhaps having too high of expectations for her. Have you asked her if she has time to cook as often as the first year? Study load increases from 2nd year onwards. Calling it decadent and wasteful is harsh- isn’t it better that she’s eating at least? She isn’t going out to expensive restaurants, or wasting the money on trivial things. Food is a necessity. \n\nMy own parents offered to help me with money when I moved out (I was 17 at the time), and they would complain I was spending too much on delivery or junk food but when I explained that it was either I organise the junk/ easy food or not eat at all because I didn’t have the time/energy with my studies, they were more understanding. However, their initial response caused me to eat less, or avoid ordering at all because I’d felt bad about my inability to cook for myself and the fact that I had to ask them for help. I’d worry that putting this kind of pressure or restriction on something like food could spiral into a larger problem, and I can maaaybe see how in this situation it could come across as restrictive or that you’re implying she ‘indulges’ too much which ties in with the weight based reaction from her. \n\nDelivery twice a week and pizza is not that bad - pizza can be reheated and eaten for follow on meals for example. Pizza can also be cheaper than a lot of grocery meals too as they have student deals (this is in Aus though- not sure if it’s the same in the US). The mental drain of preparing a meal on top of an increased workload is sometimes just too much.\n\nI think being so strict with the grocery list and accompanying her to the grocery store is toxic and goes back on your trust of her. I think a gift card is a fantastic idea, it enables her to keep her autonomy without her feeling trapped or like you’re trying to dictate what she can/can’t eat. If she chooses to use it on junk food then that’s on her, but it’s not fair to offer support and help and then put restrictions on it because it’s not turning out exactly how you expected. \n\nI hope this helps offer an alternative perspective! I said YTA for some of your wording, high expectations, and controlling behaviour. I understand you’re parents, but gifts and support like this shouldn’t have parameters, as long as she’s able to eat and she’s healthy as a human, that’s what should be important.", "NTA. Adults buy things themselves if they want to splurge. Is she an adult, or a child? I'm not asking you, I'm telling you to ask her.", "On the fence with this one. I get that you want her to make good choices and it’s your money and you don’t have to help her but it kinda seems like  you’re trying to dictate her diet and implying you don’t trust her ability to make decisions as an adult. \n\nIt’s a little controlling on some level but I get it and you’re NTA. \n\nHowever, I do have to ask how you know what she’s been buying if she’s over two hours away. Are you monitoring her accounts or does she tell you willingly ?", "Huh. Never thought I would see the word \"decadent\" used to describe Taco Bell and McDonald's. \n\nStill, NTA. Send her a gift card to a local grocery store (not WalMart, even if it's a Supercenter)", "NTA\n\nWhat is normal to younger kids these days is pretty nuts. My friend's niece orders Starbucks to class. lol\n\nAnyhow it's one thing if they can afford to spend their own money in that manner but it's certainly fair that you do not want YOUR money spent in that manner, end of story.", "NTA - this isn’t fatshaming and she’s taking a perfectly valid excuse and using it as a weapon because she doesn’t want to be responsible. Send her gift cards for local grocery stores (most have them). Don’t send prepaid credit cards, just grocery gift cards.", "Perfect answer.\n\nShe's only upset because she plans full well to spend the money in a way her parents won't approve of. Otherwise this would not be a fight at all.\n\nLearning how to budget is honestly about the most important adult life skill one can have. Wasting money having garbage food door dashed to you is not something to be encouraged or rewarded.\n\nGive her a grocery gift card and offer to help teach her budgeting and food prep.\n\nAlso, NTA.", "Gift Cards is the best idea!", "I gave my niece a gift card to Starbucks (which I upload biweekly) and one to Trader Joe’s. She was beyond grateful. \n\nOP NTA but start giving her gift cards to grocery chains. Not VISA because I promise your little college person will spend it on crappy stuff.", "I used to do this with my little brother until I figured out that you can turn around and sell said card for cash and it accomplishes nothing.", "Agree. Also, classes can get significantly more challenging after the first year as you get into more upper-level work.", "That is straight up not true. \n\nI have an undergrad and a grad degree - university has some crunch time (papers / exams) but is largely extremely chill. If you’re taking a full course load of 15 to 18 credits you are in class less than 20 hours a week. You can do your homework EASILY in another 10-20 hours. Not to mention spring break or fall break or whatever time you get off. Plenty of time to socialize, have a part time job, do sports, and cook. You have literally no other obligations (no spouse no kids). That’s why university is fun. Hours and hours of time to do whatever the heck you want.", "Agreed", "NTA. I don’t typically use food delivery services. By the time you add delivery fees and a decent tip you could have purchased 2x the food if you just pick it up. I certainly understand the convenience, especially on the rare occasion where you might be pressed for time, but I agree that on a regular basis, it seems terribly wasteful.", "But they live two hours away from her. Doesn’t that seem a bit odd  for them to offer to drive all the way out there just for groceries ?", "Delivered though? I mean the whole point of going to McDonald's is to eat hot fries in your car. I cannot imagine paying a premium to have it delivered. Coldish. Ew.", "We wouldn't just buy her a cartful of crap, but if she has SOME junk food included that's fine.", "She's asking more often, and for more money than before. The first year he asked for $50 maybe 4 times the whole year. Now it's ever month.", "If she has time to spend with her friends, she has time to cook for herself. If she chooses to spend with with her friends, that's her choice and I don't think that falls under her needing help.", "Capable of dealing with her own money but asking mom and dad for cash? \n\nOP is fine to offer to buy groceries. Daughter doesn’t have to accept that. If she’s working 40 hours a week and has a full ride scholarship she should be able to cover food.", "In the summer it's 40 hours per week. Not when she has class.", "If the daughter is a grown adult, she should be able to pay for herself. I have NEVER asked my parents for money because I'm a financially responsible adult and don't eat out to eat all the time, I make my own food, which is way healthier and way cheaper. Parents shouldn't have to fund everything and it's understandable that they don't want their hard earned money going to waste on junk food and doordash. If they were to continue just paying for it, how will the daughter ever learn to manage her own life?", "Infantilizing her/abusing her by paying for groceries?  If she’s a grown woman she can use her own money any way she likes but money from other people comes with strings and conditions. Grown women don’t need mommy’s cash.", "Lol if she is a grow woman, why she is asking for mommy and daddy to pay her bills? Grow adults take care of their own needs don’t they?", "Even ordering deliver is a waste of money, paying 30% extra of money you dont have so you dont have to pick up the food\nSmh", "She does have a job but it's a very normal 40 hour a week job that's a very short commute and nothing very strenuous or stressful. She has plenty of time to cook.\n\nSorry editing this to add that it's only 40 hours a week during the summer when she has no classes.", "She's saying her mom is shaped like an almond.", "Right why else would she not allow her mom to take her and/or even bring her groceries. She obviously has other plans in mind. NTA OP. However you referring to her eating/getting delivered Taco Bell/McDonalds TWICE A WEEK as decadent and wasteful behavior is a bit dramatic. Did you go to college? Did you experience how time consuming it was to be in class then having to spend so much of your time studying upon studying? So maybe your daughter doesn’t have the energy for cooking and honestly ordering out twice a week is not completely unreasonable; only thing that would make this better is if she picked healthier choices.", "During covid, reusable gift cards were how volunteers in my area got the shopping done for the elderly, instead of taking cash. It was a game changer in those early days", "Eh. It depends on a number of factors. \n\nI think for 2 years my undergrad experience was chill. \n\nThen there was one year where I stretched myself too think. I did, I think, 18 credits where two of the subjects were very hard and required a lot of out of class work. I did an internship that was 15 hours a week, while I was also working 12-16 hours a week retail across the city.... all without a car. \n\nI ran myself ragged that year and my diet was complete crap. So it really depends on what the daughter is studying, if she's working as well and how she's getting around.", "That HIGHLY depends on your major. I had to schedule time with my friends or else I would spend the whole time studying and working.", "This is only your experience and really only applies to your major at your university and well, you. Some people struggle with the essays you can easily crunch out, spending hours in the tutoring center. \n\nThis idea that it’s just a few hours of class is also wildly bullshit because majors like the sciences, nursing and the likes require that you do labs and clinicals. \n\nSenior year clinicals at my schools nursing programs are 12 hours straight 7 am to 7 pm, anywhere between a 14-45 minute drive each way. \n\nLabs for sciences are 2-3 hours long, per lab, not including the additional weight of the lab reports and prelabs (microbio makes you write a 40 page lab report) \n\n\nA friend of mine had to do unpaid internships for her major because if she didn’t, she basically had no chance of getting a job in the industry.\n\nThese are all the struggles of able bodied, mentally well students, because god forbid you have any disabilities it’s brutal. Had a teacher spend her first day of class telling us how the building didn’t have elevators and how every year if anyone was in a wheelchair or otherwise can’t walk up 3 flights, she had to fight admin to get them to change classrooms (this was a science course)", ">course load of 15 to 18 credits you are in class less than 20 hours a week. You can do your homework EAS\n\nNot true for YOU doesn't mean not true for the whole world.  \nI had more free time working 60 hours a week in summer internships than i ever did in college. Classes took up, up to 10 hours a day. I had single classes that were 3-4 hours long, the same day i could have another 3-4 classes an hour or two long each. homework as another 4-6 IF you weren't writing papers. i had many days where i spent 15+ straight hours working on papers  I never spent less than 40 hours a week on schooling.\n\n\"you have no other obligations\" Also BS plenty of people are working 20-30 hours a week in addition to schooling because they aren't privileged enough for their parents to just give them money and college in the US can cost you upwards of $50k a year.  \n\n\nMaybe your university takes it easy on students but in the states it's a different story.", "So if she wanted to buy nothing but quick cook frozen meals and snacks you'd have problem with that?", "I hate to break it to you you, but in college \"SOME junk food\" probably means fast food at least twice a week and pizza more than once a month.  (We're not going to even *talk* about how many beers and seltzers it probably includes...)", "Okay, that helps put it into perspective. To be very honest with you, I am 26 and I'm going to assume that you are probably a bit younger than my mom and I will say (sorry for generalizing) women in your generation have a tendency to talk about food in a way that can be judgement and damaging to their daughters. It can be very subtle but I have plenty of girlfriends and we compare notes 😆. I do not think it's your fault, i know MY  mom doesn't mean any harm to me there but I have still felt it. but it IS a pattern.\n\nConsidering your daughter has a full ride and you describe her as generally responsible and she really is not asking for much - I would give her $250 at the start of each semester (about $50 per month) and tell her it's up to her to budget it. I'm assuming that scholarship has strings attached and school will continue to get harder as she progresses.\n\nI would honestly just leave the food thing alone and let her manage herself, and just let her know what the budget is. I'm sure it's stressful to ask ad hoc like that, not knowing what the limit is. \n\nBTW I do not think you're an asshole, I just think the best thing is to drop it.", "I want to be on your side really bad but this attitude will really damage your relationship with your daughter. She's definitely under immense pressure if she's maintaining a full academic scholarship. She's paying her way through school with her hard academic work and the money from her summer job. $50 a month is very little for her to ask of her parents to help her through this time in her life. And socializing is very important. Please give her a break.", "Well to be fair they did offer and she’s on university and a lot of parents help their kids out during this time because they are focused on their studies", "Agreed, but that only works if she has a car at college. A lot of kids don't.", "40 hours a week ON TOP OF school?  If so, that's A LOT!\n\nSomeone told me that you need to plan for 3 hours of homework every week for every unit you take. So if she's taking 15 units AND working 40 hours, that's an 80+ hour week. ~~If that's the case, YTA.~~", "Wait, is she in school full time and working a 40hr/wk job? Because that's a lot. Not saying you should be paying for door dash taco bell, that's just wasteful, but if she's doing both school and work I can understand needing easy options. Maybe talk over what would fill those needs, like a stash of frozen pizzas/burritos?", "I don't know if you order McDonald's DD or Uber or not, but I can buy one meal at McDonald's through door dash for $30 or go to the restaurant and order myself for $10. It's wasteful if it's not needed.", "Having fast food delivered twice a week is definitely very wasteful. \n\nIf you're going to eat food that unhealthy to begin with(no judgement, but lets be real about it), then you may as well just buy frozen meals at the grocery store which are still like 1/4 the price at the end of the day.\n\nAlso kind of x to doubt on the whole being busy thing... yea school is work but it's sure as hell nowhere near as busy as having a full time job with a family.\n\nThe fact that OP's daughter made this work perfectly fine for the first year confirms that it's not a matter of being unable to make it work. It's just being lazy/taking the easy solution.", "As long as she has some semblance of a healthy diet, if she needs to rely on the occasional processed prepackaged meal, that's not a huge problem.", "True walking distance would be the way though.  Ordering take out all the time gets expensive.  Or get food from campus", "It's only 40 hours a week during the summer.", "It's 40 hours a week during the summer.", "Whoa seriously? In UK I can get a mcdonalds delivery for around £8-9 (burger, chips, coke & delivery).", "But does she have the time to handle cooking herself some meals? I’m all for healthy eating habits, but even as an adult who sometimes gets overwhelmed with work, I can’t always cook if I’m too busy.", "I think this still has the same underlying issue. I think it's awesome that you're willing to help your daughter with expenses while she's in school.\n\nAnd I'm okay with saying- we're willing to pay for this and not that. But you raised her- you presumably taught her healthy eating. How to make good food choices.\n\nYou need to trust that you did that.\n\nYes, by all means talk to her about whether she needs things like cookbooks to make it easier to cook for herself so she can make a healthy meal for 1 or 2. \n\nBut the end is you still need to trust your child.", "So why isn't she paying for her fast food trips then?", "When I was her age, getting taken grocery shopping by my mom was enough to make me cry tears of joy. If I knew she was driving in to take me, I’d meticulously meal plan and make my list ahead of time. She’d also buy me a few snacky/junky treats too. \n\nMy part time retail paycheck wasn’t stretching far enough and I was always super grateful for the help, especially because I knew money was tight for my mom, too. \n\nI would treat myself occasionally (maybe once every week or two), but this was pre-DoorDash, so I would pick it up myself, so it wasn’t as big of an expenditure. Granted, I was in a very walkable city, so I didn’t have to walk more than a mile to pick anything up. Shit, even as an adult in a DINK household where we make pretty damn good money, I still don’t order delivery more than once a week. More than that feels like I’m throwing my money away. \n\nIf she feels like you’re judging her food choices, I agree that grocery store gift cards are a great idea!", "NTA - But it does sound like she is using junk food as a coping mechanism.", "Info can you send her a gift card to a local grocery store?  Or a chain, like Walmart thats near her?  Does she have a meal plan on campus? Does she have transport to the store?", "Why not just get her a gift card to her local supermarket?  Do you really need to make a 4 hour round trip just to control what food she buys?  I can see not giving her cash for her Door Dash habit-- such a total rip off, but what's wrong with letting her have some amount of choice in what she buys from the grocery store.", "INFO: Have you tried to talk to her about why she’s eating like that and not cooking, or have you just told her she’s eating wrong and has to change? \n\nThere might be issues with sharing a kitchen with someone, managing dishes and cooking and schoolwork, or something else you’re just not seeing. The way you’re going about it does lean more into shaming than helping, especially because you didn’t tell her beforehand that you had those restrictions for paying for her food.", "On my last visit to college DD, I asked if she wanted me to take her to dinner or buy her groceries. She chose groceries.", "I would have loved that when I was broke!", "NAH. I understand you don’t want her ordering junk, but insisting on doing the grocery shopping for her is micromanaging. Send her grocery store gift cards.", "NTA, its your money", "YTA\n\nYou don’t get to tell your adult daughter what she gets to eat. If she wants to go buy a cart full of nothing but coke, cake and ice cream, that’s her business.", "NTA.  Fast food twice a week isn’t that bad, but having it delivered is ridiculous.", "NTA, not wanting her to constantly waste money on junk and get unhealthy isnt fat shaming.", "YTA for thinking it’s so you can control her “taking care of herself & making good financial decisions” you want to control how you’re money is used, that’s fair. Your kid is a kid and they should have an opportunity to make bad choices and do dumb stuff and still have parental support/love. \nYou need to make clearer boundaries - you have raised your kid to expect financial help from you they are throwing a tantrum because they can’t get what they want. The fact that they were honest with you about how they used their money and you are using that information to control what they eat, is YTA moves. There’s something fishy in this situation, I doubt you would miss the money, if you’re willing to go shopping for her, this isn’t about money. It’s about control. \n\nThat she is not prepared to work full time and cook for herself, is a lack of training and preparation on your part. That she’s calling you names, shows that she could do that and get away with it before and have it work. \nYTA for wanting her to learn these live lessons but not prepare her with the tools needed. \n\nNTA for wanting to take your kid grocery shopping instead of giving them money.\nBut that’s not what this is about.", "u/HourDare7683,\n\n>She knows how to cook, how to budget and meal plan.\n\nI'll get to your fundamental question in a moment. First I want to thank you for good parenting. I'm so sick and tired of kids showing up on cooking subs and Facebook groups moving out or graduating college who can't feed themselves. \n\nSo you have a behavior problem with your daughter, not a knowledge problem. \n\nNTA. Not even close. \n\nSpeculation on my part, I wonder if the \"fat shaming\" comment is because she is gaining weight and feels bad about it, but not bad enough to change recent behavior. \n\nI think you're being good parents and responding to poor behavior. She's been lazy. That may (*may*) indicate a time management problem on her part that you should (<-opinion) be alert to. \n\nA thought for your quiver is to set up an account at her local grocery story with your credit card for curbside pickup (the silver lining of COVID). She can shop from home and then go pick things up and you get receipts. \n\nShe knows better but isn't acting better. \n\nYou really don't need my support, but frankly there is simply no excuse for DoorDash and UberEats et al for college kids. \n\nBest wishes.", "Only problem is that this might get spent on booze. Unless it’s possible to put restrictions in grocery cards somehow", "I agree with you but when i was at uni i found ot significantly easier and quicker to boil some pasta and add pesto, or throw some veggies and a piece of fish on a tray and bake it, than ordering food.", "Twice a week is not living off it. Let's exclude breakfast and just say 14 meals a week, 2 of them being a quick delivery while studying is not that big a deal. I think the parent is NTA for not wanting to give her money for it but I do think they have blown it out of proportion and need to relax.", "it's fatty, sugary foods, not cocaine or other drugs. YTA, not because you  (OP as \"you\" henceforth, not you, deefop) won't give her money, but because you *are* kinda fatshaming her, deciding what she gets to eat. if you were **actually** concerned about the spending of the money, you would've stated it like \"it's getting expensive paying for all this take-out so often,\" but you didn't.", "You missed the /s right?  From what I read so far, OP doesn't mention the daughter's major. Some majors are more intense than others. \n\nI was a music education major. 18-21 credits were the norm, but the kicker was, my most time intense classes were only one credit and were 7-12 hours a week (orchestra, wind ensemble, marching band). Not all majors are classes two days a week and party the rest of the time.", "The daughter may not have a car at college and there may not be a grocery delivery service in her area.", "The daughter may not have a car at college and there may not be a grocery delivery service in her area.", "Oh that time is gone. \n\nThat food is no longer cheap, it’s the same as a normal restaurant. No dollar menu and serving sizes are smaller and expensive.\n\n You gotta have money to eat there. Got breakfast there the other day and it cost the same as a restaurant. \nImho lol", "Because her parents live two hours away and that seems very odd to drive all the way there just to do that", "Yes, its tiring, but she needs to be learning to manage it. When she gets a job, how will she stop the habit?", "Wanting to drive two hours to supervise your college-age daughter's grocery shopping is some heavy helicopter mom energy.  Maybe she has a good reason to want some space", "We are talking about OP here. She says her kid has a full scholarship and if she needs money “just ask”. No mention of being an athlete (major time commitment), no mention of being in science (labs are a major time commitment), no mention of “additional schooling” needed, no mention of financial hardship requiring a job. \n\nThe person I replied to said in a blanket statement that collage eats up “all” your time and bases her judgment of OPs situation on that. Based on our limited knowledge of OPs kid, that isn’t reasonable to assume here. \n\nI know what university costs. I put myself through university and worked the whole time. I also still cooked my meals. OP needs to know that college does not eat up “all” your time.", "I hear you. I also worked throughout my degree (no car) but worked on campus mostly so thankfully no commuting from school to work.", "Ok, is OPs kid in sciences? You’re right, my friends who did sciences were busier than me. \n\nThe majority of other majors were not. If OPs kid is in history, arts, political science, business, finance, linguistics, computers or any other number of specialties internships and labs may not apply as you describe. \n\nPresumably if time was an issue, or the situations you talk about applied, OP would have mentioned it. They didn’t. The “average” collage student (the 85% who aren’t in science) has time to cook.", "Jesus doordash charges that much! Holy heck I had no idea never have I used that kind of service☠️", "Yeah, my housemates (grown adults) who work the least end up getting fast food delivery the most. It's definitely a waste and gets expensive real quick.", "OP offered tho that’s why I’m surprised", "Indeed but also once you move out is kind of your choice what you do and what you spend money on tbh but I get the mom just wants healthier eating habits for her daughter", "You got a point 🤔", ">eout twice a week isn't lazy decadent behavior. College eats up all your time. \n\nI am the person you responded to. I also said IT CAN take up more time than a full-time job. you CAN spend more than 16 hours a day on school. not a blanket it always does.  key words being \"CAN\"\n\nYOU are the one making blanket statements. YOU are the one saying \"that's Bs college only takes 20 hours a week max and you have no other obligations and tons of free time\"    \n\n\nClearly, you aren't reading a thing being said.", "I tried but I couldn't find close work. \n\nIIRC, that year, I lived on the central campus. Three of my classes were there/online. My internship was a 10 minute walk away. I had a math class that was on the west campus, which was a 30 minute shuttle. And then I had my retail job in the city to the east, which was an hour away by public transit, technically an hour and a half because I would go early so I'd have a buffer if I missed a bus or it was late. \n\nIt was... not a good time lol.", "I mentioned sciences as one of the possible things that may take more time.\n\nMy friend who was expected to do all the unpaid internships is an English major. \n\nThe computer science majors all have to take classes like physics which have the 2-3 hour labs, at least in my school. Same with the various engineering kids in one of my other friends school. \n\nAs one of the other people mentioned, the musics require lots of practice. And unless your roommates are okay or you have soundproofing, the hours are limited", "USA here, where the prices are garbage, schools are burned to the ground, and healthcare doesn't exist.", "Come to Scotland, we'll keep you right."]}