{"id": 23070, "submission_id": "158ym7u", "title": "AITA for sleeping through the entire flight and not helping a mother?", "selftext": "[removed]", "created_utc": 1690262368, "permalink": "/r/AmItheAsshole/comments/158ym7u/aita_for_sleeping_through_the_entire_flight_and/", "score": 438, "replies": ["Your post has been removed. \n\n#Do not repost this without [contacting the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) for approval, including edited versions. Reposting without [explicit approval](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_can_i_repost_a_thread_you_removed.3F) will result in a ban.\n\nThis post violates Rule 7: There is no interpersonal conflict here for our community to make a judgment about. \n\n[Rule 7 FAQs](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_rule_7.3A_post_interpersonal_conflicts) ||| [Subreddit Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n\n\n###Please ensure you have reviewed this message in full. We will not respond to PMs to individual mods. [Message the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) with any questions. \n\n####Please visit r/findareddit to see if there's a more appropriate sub for your post.####", "Was it your child?\n\nDid you know her?\n\nNTA obviously.", "Reasons why you didn't need to help : not your kid, she didn't ask for help, but most importantly, NOT YOUR KID.\n\nNTA", "NTA. What Mom expects a total stranger to help with their baby?! Your cousin is nuts to say that you were an AH", "NTA\n\nWhen I fly with my kids they are my responsibility and nobody else's.  \n\nYou have no connection to them other than sitting next to her on a flight.   You weren't causing her any problems in fact the exact opposite by being asleep next to her.", "NTA. The mother was being inappropriate and weird.  It's not your responsibility and it's none of her business if you sleep.", "NTA. Just crazy how she thinks her baby is your problem.", "NTA. Even if I was wide awake I wouldn't be assisting someone with their baby. Did she offer to pay you to be an in- flight nanny?  If not, she can get bent.", "NTA - but, holy mackerel, I envy your ability to sleep on a plane.", "NTA\n\nWho the hell does that mother think she is.  Maybe you've worked for 48 hours straight, maybe you've been traveling for 24 hours, maybe you haven't eaten and are exhausted, maybe you have a sleeping illness or maybe you're just living your life.  She has no idea.  I would have yelled right back at her.  Fuck her entitlement.", "NTA and DUDE you are my god. I want to sleep like this on planes.", "NTA in what world would that be ok LOL. I’m speechless.", "NTA. Being in the same row on a plane does not make you a nanny or mothers helper. You have no more obligation to her than if you were an accountant and the person next to you was doing their taxes wrong.", "NTA, of course you could help the mother, but you were SLEEPING, how could you know she needed help? Also you are not the child's father, so you don't have any obligation.\n\nPeople are really weird, I've seen unknown people getting angry because you smile to their babies, I've seen people get angry because you don't help them with their baby.\n\nI mean, how can you guess they want help from a complete stranger?", "NTA. Not your kid, not your problem", "NTA. I'm glad you rested well, feel free to forget about the upset mother. You don't owe her anything.", "NTA. \n\nIf she desperatly needed help, she should have ASK you politely when you wake up (you can still refuse too). Or better, she could ask the stewart.\n\nShe just needed some victim to vent on.", "NTA cos not your kid of course \n\nbut you are TA for bragging about how easy you find it to sleep on a plane, I envy you!", "God some mothers are so entitled. Not even them feeling burnt out excuses this. \n\nIf you’re tired from mothering, find ways to help you and your child. Because your kid learns to self soothe by what’s shown and given to him.", "Parent here who has traveled with fussy kids. It has never occurred to me that I was entitled to random acts of babysitting on a plane or anywhere else for that matter. If she needed help, she should have asked. NTA", "NTA if she can't manage her kid alone she shouldn't fly alone with the kid.", "NTA\n\nThat woman is wildly inappropriate.", "NTA...unless she's paying you for child care, she can fuck right off", "NTA\n\nYour cousin got problems.", "I am a mother of two and I also sleep like that on airlines\n\nShe should have just been happy that you weren’t bothered by the child fussing, and I’m sure she was just out of pocket because she was stressed, which isn’t a you problem\n\nWhen mine were young I just quietly hoped everyone around us were parents or had beloved nieces/nephews. I’d have killed for a seatmate that just…slept through any apocalypse.", "NTA you are not some strangers babysitter on the plane. I cannot understand why that women or your cousin think you need to stay awake to help a stranger who choose to have a baby and then bring it on a plane.", "NTA\n\nNot your monkey, not your circus.", "NTA you have zero obligation to help a stranger in the capacity", "NTA\n\nWtf why would anyone expect a random stranger to help with a baby?\n\nShe got lucky how unbothered you were as a lot of people would have thrown her so much attitude", "NTA. I'm a single father and so I always traveled alone with my baby. Fortunately he was good most of the time but I'd have never expected any help from anybody. If he'd been fussy, I'd have been relieved if the person next to us was asleep because that would be one less person I'd have to worry that he was disturbing. What did she expect you to do, anyway, change the baby's diaper?", "NTA - wtf not your kid, not your problem!", "Totally NTA. At all. I am extremely jealous of your sleeping ability though. Were you by chance in the military at some point? Every one of those people I’ve met can do that too lol. \n\nThat mom needs to get over herself, you’re not the child’s parent, it’s not your responsibility.", "NTA And, I am SO jealous that you can sleep on planes, and SO deeply that a crying baby doesn't wake you up! Kudos\nAnd the mom was 100% the AH...", "Uh, it's not your baby... so why would you help. Honestly, the sleeping and unobtrusive seat partner is everyone's dream for flights. Hands down NTA", "NTA. It would be different if that was your child but it wasn’t. It’s the parent’s responsibility to look after their children. Being seated next to a random baby and mother doesn’t mean you need to help with anything. She didn’t even ask for help either sooooo 🤷‍♀️\n\n(Also I am jealous of your deep sleeping skills)", "r/entitledparents\n\nAbsolutely, unequivocally NTA.", "Wait what? Why did she expect you to help? What could you possibly have done?", "NTA  You were \\*asleep\\*  Pretty valid reason IMO You certainly weren't obligated.", "NTA\n\nHow is it your responsibility to help her with her baby? I’ve done that lots of times on flights—but I’ve always volunteered. I never have gotten the sense that the mother *expected* strangers to offer assistance.\n\nI’m sure this woman had a rough time, but that’s not your fault.", "NTA. Holy crap the entitlement of the woman.", "NTA, the audacity of the mom though!", "NTA, it wasn’t your kid.", "Mother who travelled long distances alone with two under two on multiple occasions - NTA\n\nI fully understood my kids are my responsibility alone when there dad isn’t nearby.", "Unless you helped make that baby; it’s not your responsibility to help. NTA . If the mother couldn’t cope, she should have either found another way to travel or had a friend/family member/nanny with her to navigate the difficulties of traveling with an infant. To expect a total stranger to help is entitlement in its glory", "No you weren't, she was. People today entitled.", "WTF? Are you kidding me?  You are NOT responsible for other people's kids.", "NTA\n\nyou are not responsible for someone else's kid. The mum and dad are, of they chose not to pay to sit together it doesn't automatically become someone else's problem!", "NTA. \n\nUnless you are on the birth certificate or share some sort of familial bond, you don’t owe her assistance. \n\nA little jealous that you can fall asleep so quickly. I long to be able to just sleep through long flights.", "NTA I m so borred by those parent who makes children and after complains that stranger or even family won't help. You did not ask us to do your child so do the same when it's time to raise them. And we will help if we wants, when we wants.", "Lmao should have said I’m sorry but it’s not my baby 🤣", "I have a travel pillow and my process is get to my window seat, set pillow just right, close my eyes and I am out for the count. Unless the plane is crashing or terrorists are on board leave me the hell alone. You are so NTA.", "NTA you are not responsible for anyone else's child, unless you volunteer to be.", "NTA, that kid is not your responsibility in any way, and she should be relieved that you slept through everything and weren't troubled by her and her kid. She's got some audASSity to be upset with you!", "NTA.\n\nNot your circus, not your monkey.", "Your cousin is stupid. I don’t know why moms feel entitled for help especially towards strangers. Like should they be wary of a STRANGER handling their baby?", "As a mum who flew solo on a 12hr flight with my 5/6month old, NTA. I was scared shitless and stressed out the whole time worrying (unnecessarily, she was thankfully an angel) but at the end of the day, if you need support then take a companion or stay home. If that’s not possible, then you just gotta suck it up - you can’t rely on the potential help of others.", "NTA. Not your kid, you don’t know the mum so it’s not your problem. The entitlement of some parents is shocking.", "NTA. Though your cousin and that mother who vented her frustrations on you are.", "NTA! I’m a mom and have traveled many times overseas with infants. It’s really nice when a fellow passenger offers to help (which while always grateful, I’ve politely declined) but it’s not their job to care for a stranger’s infant.", "NTA. Not your child, not your relative, not your problem. Expecting strangers to help is effed up. She chose to fly alone with a baby, she needed to be prepared to take care of the baby for the whole flight. I think you were amazing, that you slept, you didn’t complain!\n\nI have once held someone elses baby before take off, so that they could get situated better, get everything they need from their backpack etc. And they didn’t ask, I offered. I offered multiple times, that it really is no bother. They were so grateful.", "NTA given you're not that child's parent. The nerve and entitlement of that woman, God...", "I'm just curious here, what kind of help was she possibly expecting?? Definite NTA. You travelled alone, did your thing and didn't bother anything.", "NTA, you had absolutely no responsibility in this situation.", "NTA\n\nNot your kid, not your problem. That mother is incredibly entitled if she expects a complete stranger to entertain/placate her child on a flight. You had every right to sleep through every moment of the flight if you wanted.", "NTA, your baby, your problem.\n\nIf you can fuck without a condom, you can calm down your baby without help. BTW where's the father?", "I read the title wrong and thought you were the asshole because I was like bro its your mom help her. NTA", "NTA. Not your baby, not your problem.", "NTA a complete stranger isn't responsible for her baby baby don't tend to enjoy flying", "NTA. In my opinion, it's rude to expect random strangers to do anything for you. What makes it worse is that she didn't even ask you to help; she just expected you to do something. The baby is HER responsibility, not some random stranger's.", "Absolutely not. You are NTA.", "Wtf? That is some of the most entitled ass behaviour Ive heard of in a while. I flew solo with my son when he was an infant 6 times and not once did I ever just assume or expect the complete strangers sitting in my aisle to assist me? Ive accepted it when they have offered, but never once EXPECTED it... lol NTA AT ALL", "Unless you were there helping her make the baby, I genuinely don’t see how it has anything to do with you. NTA", "Ok so if I got this straight, you have no relation to this lady on the plane and you're just some stranger to her. But she wanted you, a complete stranger, to attend to her child? Not only are you NTA, but that sounds like a mother who should be investigated by CPS. Who knows who she leaves her kid with?", "I have helped moms with babies while traveling but I never felt like it was expected. They were usually surprised and grateful. I never needed help with mine, thankfully they were good travelers and their dad was mildly helpful (jk).\n\nnta, glad someone got some sleep", "Nta", "NTA, and wtf is saying your cousin? In which seat was her that she couldnt help that poor mom in distress?", "NTA she should be grateful you slept. She was just letting out her frustration from her sleep deprived brain.", "NTA.\nUnless you are one of the parents, not your responsibility. If she asked for help and you obliged, it would be nice of you. But it's not your obligation.", "I was waiting to confirm whether you were in the aisle seat, which you weren't.\n\nNTA\n\nAs the other passenger put it, she snapped and decided to take it out on you. She didn't ask for help either (which would be weird imo) so where is this expectation coming from?", "NTA I have two kids and luckily have not had them on planes as babies but I would have apologized for being noisy and thanked you profusely for not complaining", "NTA she's so entitled and why would she want a random man holding her baby anyway? That's a really scary thought. I would worry how many strangers this woman is giving her baby to when she wants a break.", "NTA. Was she hallucinating? Did she think you were somebody else? Did marry her in your sleep (like sleepwalking)?", ">I told my cousin (she is a mom), she told me that in this situation I was the AH.\n\nYour cousin is wrong. NTA.", "NTA, and wtf is saying your cousin? In which seat was her that she couldnt help that poor mom in distress?", "If you didn’t play any part in conceiving that baby, you are NTA to ignore it and sleep.", "NTA\nI'm a mum and you are NTA. If she wanted help she asks the flight crew!", "Big NTA - The level of entitlement! I flew a few times with my kids when they were small. It never would have occurred to me to ask a perfect stranger to help. My kid, my responsibility! It‘s not your fault that this woman can‘t cope with her naby!", "I would be so glad if the person next to me sleep like that when my kid is crying.\n\nThe other person is right. Its not your fault. She is just letting out her frustration on you.", "NTA, why would this woman think she would be entitled to help with her baby from a stranger on an airplane? I wouldn’t have offered to help if I had been awake because THAT’S NOT MY BABY. The thought would never even occur to me.", "NTA\n\nIt may have been courteous to ask if you could help, or if everything was okay, when you saw she was angry/frustrated and the baby was crying but you were under absolutely no obligation to do so! \n\nAlso, asking that question to a stranger on a flight could open the world's biggest can of worms on you unexpectedly, so don't blame you for not doing it either. \n\nMy second ever time flying, 9 hour flight, the dude next to me was drunk as hell and offered me his newspaper. I accepted just out of courtesy and casually placed it on the floor since I didn't have anywhere else to put it. This made me his absolute worst enemy and he threatened to \"bite [my] nose off\" when we got off the plane. Never engage with strangers on a plane.", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I slept through the entire 8 hour flight with no regard for the mom who was sitting next to me and frustrated with her baby.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA at all. She just expected you to magically know she needed our help?? Why in the world would she expect that. The entitlement of people!", "NTA. Entitled mother. You are not her husband, relative or her friend.", "Unless your swimmers made that kid, ain't your business, ain't your problem. NTA. mom was being a dick for something that was in no way your responsibility. Don't sweat it.", "WTF! The person on the plane is clearly demented. Even if I was awake I wouldn't go near another person to \"help\" (??) - especially a child. Extremely strange", "NTA... I've travelled alone with my kids.. I would never expect someone to help me.. my kids, my responsibility.. \n\n\nPlus, not your baby, not your responsibility", "Your cousin and the mom on the plane are both AH. They shouldn't expect anyone to help them on a plane. The other passengers aren't the child's parents. As the parent they should have over compensated when it comes to flying with a baby; extra toys, snacks, things like that. I understand it's difficult traveling with a baby I've done it and it wasn't fun but never assume you are going to be getting help and then get pissy because you didn't get it.", "Nta. It’s not your responsibility to help a stranger with their child, and the mother shouldn’t be expecting/demanding a stranger help with her child. Mothers who do are wild to me because like, why are you going to trust a stranger with your kid? Would it been nice if someone offered to help her? Sure. But nobody *has* to. Don’t listen to your cousin", "NTA. Why were you expected to help a random stranger with her child ? Surely, if you had offered would you be regarded as intrusive or worse ? The woman was out of bounds to even expect anyone’s help…completely ridiculous and so is your cousin!", "NTA. Not even close to being your responsibility. \n\nAlso is this fake because what flight serves not one, but two meals lol", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am the type of person who falls asleep immediately when I settle into the seat of the plane, to the point that on several occasions I fall asleep before takeoff. Being a heavy sleeper, it doesn't bother me that there are children or babies on the plane. Yesterday I had an 8-hour flight and a mother with her baby sat next to me, the child was calm and it seemed that the flight was going to go without complications. The takeoff was delayed for a few minutes in which I fell asleep and woke up when they were serving the first meal. I looked to the side and saw the mother who looked frustrated then I saw the baby who was sleeping peacefully so I laughed at the cuteness but when I saw her mother, she looked at me with an angry face. I didn't understand why she was angry and I just put on my headphones and watched a series on my phone and then went back to sleep. The same thing happened for the second meal but this time she looked angrier but I thought it was understandable since the baby was crying and the people around looked just as upset and made some awkward comments, I didn't choose any meal because I didn't like the options so I went back to sleep. At the end and I was waiting for the mom to come out so I could get out (I was at the window) when the mom moves the baby and he starts crying and out of nowhere the mom starts yelling at me saying how come I slept the whole flight and I couldn't help her with her baby who cried almost the whole flight, that I was inconsiderate and couldn't help a mother in despair. I was speechless until a lady from the same flight told me that it wasn't my fault and that I shouldn’t  feel bad, that the mother just let out her frustration with me. Those words encouraged me but when I told my cousin (she is a mom), she told me that in this situation I was the AH.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, you didn't make it. You're not responsible for it. It's one thing to offer help, but it should not be expected, especially from a stranger. I feel the same about pets, it's very rare I ask a family member for friend to watch them (Cat and dog).\n\nMost of the time, I will precooked requested meals for the caregiver if they choose or buy the groceries so they can make what they want, if they just want to be paid cash thats also fine. I live on my own so they gernally just stay at my place until I return. The longest I was ever gone was one time for 7 nights, generally it's only 1 or 2 nights a year.", "NTA, I'm a mom too and I would never expect a stranger on a plane to help me with my baby. That is just ridiculous. I do understand her frustration, but she was wrong to take it out on you", "Nta.\n\nShe made that, she decided to fly with it, Is 100% her problem to deal with it.", "My defensive strategy in situations like this is to pretend that I speak only Spanish and very little English.  “Salmon, vino blanco, agua.”  Then I scarf my meal and go back to sleep, pretend sleep if need be.  If someone like her pesters me, I’ll say: “No comprendo, no comprendo, espanol” until she shuts up.  Plus taking a Xanax helps.", "NTA", "NTA\n\nThough I'm sure plenty of people on that plane envied your ability to sleep through it all.\n\nAlso...they still serve meals on planes? Last time I was given a meal on a plane was flying internationally across the ocean. No domestic flight I've been on served a meal.", "NTA wth you’re not her partner?", "Not your child not your problem. People who can’t handle their own kids should be be having kids.", "N T A seems so obvious. It seems like we’re missing something here. Does your cousin know something we don’t? Why do you think she sided with the lady-you think any mom would agree that you should have helped? Or was there something else that made your sister side against you? What were the awkward comments?", "Long story short, NTA\n\nAt first I read the title as 'my mother' and NTA...then I read the third sentence as my mother and her baby and was like 'why not say your brother or sister?', then I noticed my mistake.", "Absolute BULLSHIT written just to get everyone in the comments to shit on women. I’m a mom who flies alone with my toddler all the time. Last thing I would expect is some random person next to me to “help” me. \n\nI know I’m not everyone but honestly I refuse to believe you encountered a mom who legit wanted you to help parent her kid to the point where she “yelled” at you for sleeping on a plane. That’d be blatantly insane. Such a thing wouldn’t be confusing for you and you wouldn’t need the internet to help you. \n\nGuys please fuckin don’t take the bait. There’s enough shitty parents out there without this dude making up fake ones. \n\nYTA", "INFO: were you in the aisle seat? \n\nThe only possible (*possible*) reason i can think of for anybody to be upset with you would be if they needed to use the restroom for some reason and you were sleeping too soundly to rouse and let them by. The mom would *still* be TA in that situation because who expects a stranger to parent their baby for them??? Insane. But I'm assuming that, since you knew you'd be sleeping soundly the whole flight, you probably did the sensible thing and booked a window seat so as not to block anyone in.", "I wouldn't touch a screaming baby with a 10-foot-pole, let alone a screaming baby that is not related to me, no matter what the mother expects of me or thinks she is entitled to.", "Plot twist he is the father.", "Hmm. This is kinda like asking if the average person is also an asshole? I don’t believe it was your individual responsibility to help that mother, but I do believe that it’s our collective responsibility to help each other. As a mom, I appreciate the occasional unsolicited help from others. A simple, “can I do anything to help you?” might have gone a long way here. But I think it was super weird that she waited until the end to make you feel bad about it, when she could have just been like “excuse me, can you get xyz for me?” Etc.", "INFO: Why did your cousin think you're the AH?\n\nThe story doesnt make sense", "NTA\n\nBut you should've at least offer to watch the baby while she go poop.", "NTA. I’m so confused. This woman is under the assumption that total strangers should be ready to jump to help her with her child purely because they won the lottery and got seated next to her???", "Of course you are NTA. Why would she expect a stranger to help her take care of her baby?", "As a mom who has multiple children, you are NOT the asshole! \n\nIt was not your responsibility to look after a strangers kids! Lol! If she couldn’t handle them or bring entertainment for them, how’s that your problem!?!?\n\nIf you were awake, or even aware that she was struggling, it would have been kind to help her out, but either way, you weren’t obligated at all to help her with her kids!", "NTA it is pretty bold on the mother's part to chastise you for not helping her, you are a stranger who paid for a seat on a plane not to be a babysitter or a nursemaid, personally when I am on a long flight, I take a muscle relaxer and nod off if I am not too fond of my seatmate.", "NTA - simples. Can you imagine if you just randomly walked up to someone in the street and offered to help with their baby?? Why is it different when you are sat next to a random on a plane?? If she had asked it would have been different but you aren’t psychic! Her taking her frustration out on you makes her an AH though.", "NTA. Unless this was your baby, it wasn't your responsibility.", "NTA. WTF, your cousin thinks you're TA? 1. not your child. 2 you don't even know the woman.", "Why should the mother expect a complete stranger to help with her kid? That makes no sense, you did nothing wrong, you don't know her, she needs to pay a babysitter or take a willing family member/baby's father maybe?  Crazy days! I hate flying, there was no way I would be helping a stranger, I would be too fixated on trying to lower my anxiety about flying. You definitely were in the right.", "NTA why would a stranger expect your help? Some things I can see it would be kind like if she dropped stuff you could pick it up but I am a mother and had easy and not so easy journeys with my children I would in no way expect a stranger to help me", "NTA unless you left out some important detail such as you being the other parent of the baby. \n\nI think she was probably stressed out, embarrassed and jealous of your responsibility free flight (source: have taken screaming baby on flight)\n\nEdit to add: yes it would have been kind of you to help her out so she could go to the bathroom or eat her meal in peace but you are absolutely under no obligation to do this. Still NTA", "NTA jaysus, the entitlement by some people. You’re not the father. She should either take someone with her to help out or shut up.", "NTA\n\nThe mother needs to travel with another adult and/or purchase a seat for her child. \n\nYou did nothing wrong.", "NTA.\n\nMom of 4 here, never would I ever expect a stranger to help me with my kids!!!!!!!!!!!!  Ever!!!!!!!!!!!!!!!!!", "NTA. She wasn't your wife, that child wasn't yours. You didn't even know them.  \nBtw your cousin is an AH for saying that.", "NTA, you did absolutely nothing wrong. Not your baby, not your responsibility. There are plenty of people who freak out when strangers try to help with their babies. If she needed help that badly she could have used her big girl words and asked someone.", "Idk people seem to misunderstand the definition of being an asshole. If something completely unrelated to you is happening, it doesn't matter what or how bad it is, not to mention you have no idea about it and you are passive about it, then you are never an asshole. So, NTA.", "not your pig, not your farm. NTA", "NTA in the least bit. Her baby. Her problem.", "NTA. Not your kid, not your problem. You don’t know her, you don’t owe her anything.", "I’m completely jealous of your ability to fall asleep so quickly & soundly!\n\nNTA", "NTA. What help would you have actually been able to provide beyond, maybe, agreeing to watch the baby while she uses the toilet? \n\nNot your responsibility, so no obligation and there shouldn’t be an expectation. Unfortunately as a man you’re in a lose-lose situation here. She thinks she can take her frustrations out on you because you didn’t offer to help. But no doubt if you’d offered help it would have been rejected and you’d have been treated like you were a creep.", "ABSOLUTELY NTA, I had 3 kids under 9 on a 4hr flight when i was single. I over prepared/packed so my kids wouldnt be an issue to anyone else. If they were i was just going to figure it out and try my best. Never would i have yelled at a freaking stranger for *gasp* sleeping through a child screaming who is not theirs?! The audacity of that mother, exhausted or not!", "NTA. There is absolutely no expectation for you to help.", "NTA. Not your kid so it's not your problem. Also, did she actually ASK for help? Ever? Or did she expect a complete stranger to read her mind?", "I’m so confused. You’re a complete stranger to her. Why would you be expected to help with her baby? I’m a mother and while I’d be grateful if someone else on a plane helped me if needed, I’d never expect a stranger to help! Wouldn’t even occur to me to ask let alone be annoyed that the stranger didn’t offer! \n\nNTA for sure! Although I’m very jealous of your ability to fall asleep so easily on a plane. I’d love to be able to do that!", "NTA. You sat next to a completely delusional stranger.", "NTA. You shouldn’t be expected to take care of some random person’s kid.", "NTA. You didn’t even hear the baby cry. How in the world are you the AH. She should be happy that you weren’t up and complaining about the child crying.", "NTA, not your problem. lol how could you ever be TA here?", "NTA of course.\n\nThe other side of this is, I (man) was lucky to spent a lot of time with my kids on my own when they were little. Very now and they you would get some random old woman who would not leave you alone “helping” without me needing it or asking.", "NTA - not your child, not your spouse. Not your problem. Some people are just extremely entitled and just assume someone will help them because they're there.", "NTA. I started traveling with my kids when they were babies. At no point did I ever expect any passenger to assist me. The entitlement of airplane passengers these days is out of control.", "NTA. As a mom who has two young kids and flew with my oldest when he was one by myself. Its so frustrating. I was prepared for I thought everything except the fact he wanted our seat neighbors blanket. I had someone waiting in line for the bathroom ask to old him to give me a short break. Is it nice when people want to help? Absolutely! Do i expect it? Abso freaking lutley not. He is my son. My responsibility. I absolutely believe she let out her frustration on you and she shouldnt have done that. So you are not to blame for her being resentful that you are able to relax and sleep on your flight.", "NTA and not even close to being one.\n\nNot your child, she may have been frustrated but you don’t take it out on someone who you don’t even know", "As a father, I'd rather wrangle two babies that threw tantrums while having explosive diaarieha than let strangers touch them. I hardly accept strangers TALKING to them. Definitely NTA, and the mom needs to temper her expectations, because people will not offer her help, unless there's an emergency. That's not how society works.", "the audacity of that woman to expect you, a total stranger, to help her out with her kid. you didn't father that child and its not your responsibility. she also never asked you to help. she was an asshole and your cousin is also an asshole.", "NTA", "NTA and I must ask, what is the help they believe you could have given if awake? Genuine question. Trying to distract the baby enough to calm down? Like, would she have given you a toy to shake at them, have you join in on a song? I am bewildered", "Your cousin is a very, very, very big AH and so is the mother on the flight. Are you easily impressed by other peoples' intimidation tactics? NTA", "NTA obviously.", "NTA. Not your child. Not your problem. I mean if you wanted to help sure. But you were sleeping. And, again, not your child. If the mother wants to fly with her baby then it’s her responsibility.", "NTA someone else's kids are not your monkeys, not your circus. Reverse the situation - if you, a random stranger, offered help unsolicited you would be getting called a creep.", "NTA. In that scenario as the mother I would just be happy you were sleeping and not shooting me judgemental looks or commenting on my child's behaviour which a lot of randoms for some reason feel a need to do", "NTA. The audacity 😂", "NTA.  \n1. Not your child.  \n2. You had no idea there was even a problem, as you were asleep.", "Man, what entitlement from that mom. I'm speechless wtf. NTA obviously", "In what world do people really think you're TAH... that's insanity! You aren't the babysitter. Maybe if she had asked you politely rather than giving you angry looks all flight you would have helped her but instead of using her words she got angry and expected you to care for her child... a stranger. lol wtf", "NTA not your job to help her.", "NTA use paragraphs", "My son would have been 10 times worse if a stranger even looked at him.  Rest peaceful you are not the AH.", "You could have been the seat mate who got annoyed at the baby and started making a stink about it. Give me the sleeping neighbor every time. Not your kid or your problem. NTA", "NTA. Not your kid, and it doesn’t matter how frustrated that mom was, she’s an AH.", "As a parent, never in a million years would I expect, or even want, a complete stranger's help with my children. Some people are just weirdly entitled.", "NTA\nIf she can't handle her own crotch critter, that's on her. Not your kid, not your problem", "I genuinely feel like it would be creepy for a stranger to start helping with someone's baby.", "NTA, I have twins and wouldn't expect a stranger to help. Just because I have to handle two kids doesn't mean others have to jump to my side to help. They are my responsibility. I would have been happy to see that at least one person wasn't annoyed with me and my kids.", "NTA. \n\nNot your pig, not your farm. Sure, it would’ve been nice if you could’ve helped but by no means should you have been expected to help out.", "this is crazy other mothers expect people to genuinely help. i was opposite the aisle from a mother and baby on an 8 hour flight too. ofc i'd be willing to help if i needed to catch the baby if it fell or something. even when its pacifier dropped i was ready to get it for them but the mother was like oh no he can get it and she lifted him up which he went to get it. but to fully expect everybody will help is not on ofc nta.", "Not your baby not your problem. NTA.\n\nSource: Father of two.", "Plot twist: it was his wife and child. But no seriously NTA and your sister is wrong. How strange to expect someone who paid to fly in the seat beside you to help with her little creature.. it’s her responsibility not anyone else’s.", "NTA. I have flown with my kids countless times, even when they were under a year, and have never asked for nor expected help. I get that small children are hard work and sometimes an extra set of hands is a god send but you don’t get to demand that strangers give you their hands.", "Not your monkey. Not your circus.", "NTA why should you look after some random kid?", "Firstly NTA, secondly who the fuck are all these people that make commenst about babies on flights. Seriously, get the fuck over yourselves.", "NTA\n\nNot excusing, just explaining, there is a very high possibility that mother had lost her mind at that point. What she said made no sense. She was completely wrong.\n\nYour cousin is more worrisome, you don't mention that she was at the end of a long flight dealing alone with a screaming baby, so her insanity is more likely to be permanent.\n\nI'm very much of the school that we live in a society. That means if we see a person in danger (including a child) we should intervene, it means we have to accept that some people (including children) will be louder than we like, it means we should help people who are struggling if we can. None of that means that you should have stayed awake just in case a random woman might want you to help her with her baby, who was never in danger.\n\nOn the other hand, I am so envious of your sleeping power on planes, never lose that.", "Not your circus. Not your monkeys. Not your child, not your problem. I didn't know buying a plane ticket entitles a mother to a free babysitter. 🤷🏻‍♀️\n\nNTA..", "Are you supposed to whip your tit out and feed the thing or what?", "People's children are not the responsibility of others without prior arrangement. While I sympathise with the mum for stressing out, her offspring are her problem.", "NTA\n\nHow is this even up for debate? \nSounds like an absolutely bizarre and unreasonable expectation", "NTA, what entitlement. Unbelievable.", "Nta it would be super weird if you did", "How could you have helped anyway, cooing like an idiot? Mom needs to get a grip", "This has to be fiction.", "Was there anything in the fine print, on your ticket, about babysitting being included in the ticket price? No?\n\nNTA", "I was waiting for OP to say it was their child or they were somehow related to the mother and child. The audacity the mother has to assume a total stranger would help with her child is unreal. I have a 13 month old and know how frustrating it can be traveling with young ones especially alone, but would never expect strangers to go out of their way to help me. NTA OP, but the mother is TA for having such unrealistic expectations and not being prepared for a long flight with her child.", "It’s almost weird if op tried helping? Somehow I think that could be viewed as more insulting or embarrassing?", ">What Mom expects a total stranger to help with their baby?!\n\nProbably, as the other woman said, one that had basically lost all sense of sanity by that point in the day. After 8 hours of not being able to calm your kid it's hard not to be a little irritated at basically anyone around you.\n\nNTA obviously, just try not to take it to heart. Imagine the alternative, strange person sits next to you on the plane. \"Hey, why don't you sleep, I'll look after your baby\". Yeah, that'll also not go down well.", "Exactly. I can’t even imagine thinking a total stranger should help me take care of MY child, let alone get upset and yelling at them over it.\n\nEdit: NTA", "Sleep deprived and frustrated perhaps, but still not the OPs problem or responsibility.", "I read it as the flight attendant said: not OP's fault but she was, according to her words in despair so probably needed to vent and blame someone else. Not to be taken personally. I mean, when you have a breakdown, you will likely scream at random people 😅", "From the entitlement she showed, it almost seems to me like she had planned to offload kid-minding duties to whoever was unlucky enough to end up next to her regardless.", "I envy the ability to sleep next to a crying baby!", "Planes??? I want to sleep like that at home without hearing the neighbors 😭", "Or if you were a nuclear physicist and the person next to you was doing their taxes wrong", "I agree. OP might have been a slight AH if the mother had asked for help and he had refused.\n\nWhen I was travelling with a baby I actually preferred everyone ignoring the fussy baby. It was so much worse if people tried to \"help\" by telling me why they thought my baby was crying.", "Ikr! I’ve flown with a baby and would’ve been so relieved if those around me slept through the fussy times", "Yeah, I once flew with my (at the time) 4 yr old and I was absolutely done. I had been up 24 hours, we were on our second flight out of 3 (12 hours total + 5 hrs by car) and I struggled to keep my son entertained (he had had a full blown meltdown in the airport during our layover too and refused to eat so was hungry on top of that, testing my patience to the limit). The lady in our row (I had window, my son middle, her in aisle seat) was an absolute saint and told me to nap while she coloured with him as she could tell I was barely holding on, but I wouldn't have said anything if she hadn't offered. \n\nIt's my child, not hers, and it was my job to make sure he was entertained, but when offered a chance to take a power nap in flight, hell yeah I'll take it (only slept like an hour, but it was enough to recharge), but if she hadn't, I would've manage like every other sleep deprived parent.", "I was on a flight and had severe travel sickness. It didn’t even occur to me to ask a total stranger to look after my baby. \n\nI get the frustration, but look after your own child or don’t travel.", "They can both be stupid considering how stupid this question is", "Don’t take the bait", "she *expected* it. didn't even ask for help and then has the audacity to get mad at a stranger that didn't even know she needed help, let alone wanted it.", "I was waiting for the twist ad the end to be that OP was in the aisle seat, or that OP was the father. LOL. \n\nAgree NTA the mother snapped and wanted someone to take it out on.", ">when you saw she was angry/frustrated and the baby was crying\n\nWhy the fuck do you want to help a person who is angry with you for their children crying.", "Have you never taken a long flight?", "Two meals on an 8 hour flight? \n\nSure, Jan. 🙄", "Yeah. I wish I could sleep like that😴", "Yeah, reality doesn't work like that. I think everyone with kids has been in a situation of despair. Kids are hard.\n\nNTA", "Yep, the OP said she was in the window seat. \n\n>At the end and I was waiting for the mom to come out so I could get out (I was at the window)\n\nI feel sorry for that poor baby. The mother seems unbalanced.", "OP should have asked a stranger if they want to poop?", "Ah, the old nonrefundable baby nanny discount seat. That's how they get you.\n\n/s NTA OP", "agree, NTA but give the mum some grace. Those of us who've been there travelling with a challenging child and losing our minds don't always act rationally!", "I envy the ability to sleep in minutes", "not even. OP can refuse as he is not beholden to the woman or her baby and should not be considered potentially or slightly an asshole in any case.", "We got 2 meals Australia to Sri Lanka and the same return. It was a bit over 8 hours I think.", "I never said kids are not hard, but if the parent just expect strangers to help them and act all entitled about it then yeah, that parent can go fuck themselves. Just screams “I’m a parent and it’s *sooo* hard so everyone, especially single people, should fall over themselves to help me”\n\nSame people who think having kids means theyre more deserving of coffee and try to cut in line at Starbucks.", "ah thanks, i missed that! then yeah, completely and in all ways NTA, no possibility for any reasonable person to have any issues. Unfortunately, you're right - that mom was NOT being reasonable.", "I envy the ability to sleep", "If the mother had asked for a small favour, like \"could you please hold the bottle while I get the bib out of my bag\" and OP had refused, I would consider that a slight AH. I'm not talking about bigger favours. Those are of course okay to refuse."]}