{"id": 23074, "submission_id": "158x75f", "title": "AITA for calling my mom a pos?", "selftext": "My wife has been sick for almost two years. She’s had pain in her stomach, chronically constipatied, vomiting, bad periods and recently rapid weight loss. \n\nShe’s been unwell enough that she quit work almost year ago. My mom had it in her head that my wife was using me or was lazy or mentally ill. My wife called off thanksgiving at our place that pissed my mom off. She didn’t cook anything at Christmas because she felt ill. The dumbass doctors kept saying shit like female problems and dismissing my wife’s pain. My mom told my wife at Christmas that at all women have periods and she needs to women up and help out on Christmas. \n\nThings started to take a turn for the worse when my wife started rapidly losing weight 45 pounds since February. Finally the doctor’s stated doing more test and this week it turns out it’s intestinal cancer and they want to remove a large chunk of her intestine and chemotherapy. \n\nI was going to tell my mom and she starts off with “what’s wrong with her now” \nI immediately yelled at my mom and called her a heartless POS. I refused to tell he what’s wrong and blocked her. My family is trying to get me to speak to her again and my grandmother actually said to me “how was she to supposed to know your wife was really sick” every single family member that is trying to defend my mom is getting blocked because I feel like all of this time she been acting like a total pos and I’m done. My family thinks I’m awful but everyone is mad at me on how I’m being disrespectful to my mom because she didn’t know 😤", "created_utc": 1690258079, "permalink": "/r/AmItheAsshole/comments/158x75f/aita_for_calling_my_mom_a_pos/", "score": 322, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Maybe I shouldn’t have blown up on my mom and called her names and blocked her. I could have explained nicely about my wife’s cancer\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "That's exactly the point, isn't it? She didn't know your wife was sick. But she assumed and made comments as if she wasn't.\n\nNTA, your mother should have kept her judgments to herself.", "NTA. Good on you for supporting your wife and caring about her.", "Honey, I’m so sorry. Of course you’re NTA.", "NTA - sounds like an accurate assessment. Sorry about your wife and hope her treatment is successful.", ">grandmother actually said to me “how was she to supposed to know your wife was really sick”\n\nReally? Your wife told her she was ill. You told her your wife was ill. Even when she started rapidly losing weight, your mother dismissed it just like the asshole doctors did before it got so bad they couldn't ignore it. I find it hard to believe that your wife didn't look sick this entire time. I suppose your mother is one of those who is never sick & thinks things like migraine pain are grossly exaggerated. NTA, and keep right on blocking the lot of them. They refused to support you and your wife the last couple of years. They do not get to cry and say they're sorry now.", "NTA. Your mom was being a jerk the entire time. Shame on her. Being your mom doesn't give her an excuse to be a jackass.", "We all want you to recreate the GOT scene SHAME with your mom and upload it reddit. SHAME ON YOU MOM.", "NTA - I am so sorry for what your wife (and you) are going through, being sick and not believed is the worst feeling in the world (I have a super rare blood disease and went through this myself). It sounds like they jumped on the chance to call her lazy and dramatic, and unfortunately in our society that is the first thing people do. \n\nHowever, other comments have pointed out that you will need support during this time and they’re right. Maybe once you’ve had time to process you can attempt a conversation with them, and if they apologize give them a chance to help. If they double down on their behavior then screw then, but I bet they feel like huge AH’s and deservedly so. Definitely get your wife’s opinion on this too, but cancer is so terrifying and draining, you guys shouldn’t have to go through it alone. \n\nBest of luck ♥️", "NTA.  Sadly this is still true even in the 21st century - that women are routinely dismissed by medical professionals.  I really hope your wife gets through this.  Best wishes OP.", "You’re a great husband, your wife is very lucky you take her pain, and sickness seriously. Which is kind of bare minimum but hey your family is proving otherwise. You’re NTA, I hope your wife has a speedy recovery, and you live the rest of your lives is bliss.", "NTA\n\n>“how was she to supposed to know your wife was really sick” \n\nBecause you told her so. With your words. Mom just choose to be dismissive and assume the worst. F*ck her", "Nta, your mom had no empathy for your wife. Why should you have some for her? \n\nEven if your wife was faking it your mom comments were not okay", "NTA..She is your wife. In sickness & in health. You're standing by her & your vows. She is lucky to have you in her corner.  You & your wife followed your instincts & knew something wasn't right. And OP, I'm sorry to hear about your wife's diagnosis. She has a long road ahead & I'm sending good thoughts to both her & you. \n\nYour family is owed no explanation. They didn't take your wife's illness seriously & instead berated & judged her for not \"keeping up with holiday traditions & all that bs\". They are toxic & not the type of family your wife needs in her corner currently.", "Firstly I am sorry to hear your wife is so ill and I hope that she comes through the treatment and gets better.\n\nNTA.  \n\nI understand that you are angry at your mum and rightly so.  She wasn't very supportive or kind.\n\n But at this point you both need and deserve as much support as possible during her treatment.  I cannot imagine how tough this must be on you both.\n\nHow does your wife feel about this ?\n\nI would suggest, when you feel less angry, that you speak to your mum and explain how her comments have been hurtful to your wife at a time when she was trying to get doctors to understand she really was sick as well.    Give her a chance to apologise and be there for you.  This could maybe teach your mum to be a little less judgemental and a bit more kind in future ?", "NTA but two wrongs don’t make a right. Now’s the time to be your wife’s voice and tell her exactly what she’s put your wife through. drive the point home that she’s been telling-hell yelling- at everyone that something was wrong and they let it go. She should feel guilty for how she treated your wife. Talk to her and tell her she only gets to listen until your done and if she doesn’t then go NC.", "I'm going to say NAH, but you all should've looked for better doctors months ago (if not years ago). If you didn't encourage your wife to find better doctors to diagnose her issues (after over a year of pain!!!), then how do you expect your mom to take the sickness seriously?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife has been sick for almost two years. She’s had pain in her stomach, chronically constipatied, vomiting, bad periods and recently rapid weight loss. \n\nShe’s been unwell enough that she quit work almost year ago. My mom had it in her head that my wife was using me or was lazy or mentally ill. My wife called off thanksgiving at our place that pissed my mom off. She didn’t cook anything at Christmas because she felt ill. The dumbass doctors kept saying shit like female problems and dismissing my wife’s pain. My mom told my wife at Christmas that at all women have periods and she needs to women up and help out on Christmas. \n\nThings started to take a turn for the worse when my wife started rapidly losing weight 45 pounds since February. Finally the doctor’s stated doing more test and this week it turns out it’s intestinal cancer and they want to remove a large chunk of her intestine and chemotherapy. \n\nI was going to tell my mom and she starts off with “what’s wrong with her now” \nI immediately yelled at my mom and called her a heartless POS. I refused to tell he what’s wrong and blocked her. My family is trying to get me to speak to her again and my grandmother actually said to me “how was she to supposed to know your wife was really sick” every single family member that is trying to defend my mom is getting blocked because I feel like all of this time she been acting like a total pos and I’m done. My family thinks I’m awful but everyone is mad at me on how I’m being disrespectful to my mom because she didn’t know 😤\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Ask your wife what she thinks about this riff between you and your mother.  Ask her what you should do or not do. She will point you in the right direction", "I agree with many comments about talking to your mother.   If she apologises and grovels good.   You and your wife could  use some help with meals and washing,  cleaning etc.  I'm petty , so I'd be asking mummy dearest to \"woman up\" (in her words) and help out.", "Nta.\n\nI really, really dislike people who judge women for not being well. Periods hurt like nobodies business, and women have different experiences with pain or no pain for that time.", "NTA.\n\nDamn when you listed her symptoms in the first paragraph, I was like, oh no. This is a bad cocktail of symptoms.\n\nHope things work out for you and the wife.", "Yeah, the assuming that her sickness was fake really irked me the wrong way. NTA, your mom needs to evaluate her attitude towards your loved ones though.", "No, she did know she was sick, she didn't *believe* it though and used that as an excuse to attack her. \n\nShe isn't owed proof of anything and if she needs a reason to treat someone kindly then she can expect the same in return. She surely hasn't given op and his wife any reason to think she's not a horrid judgemental person so by her own example she can be treated in kind. (Not that OP is abusing her.)\n\nShe just doesn't like having a mirror held up to her own behaviour. OP is doing the right thing by concentrating on his wife and ignoring everyone trying to make this about his mother.", "It’s only 1 wrong. Op reacted correctly", "Nah let the mom learn from another family member the diagnosis. OP can be the bigger person if they want but they did absolutely nothing wrong. They shouldn’t lift a finger at this point unless they feel inclined to.", "Dude this stuff takes time, I'm chronically ill and it took going to different doctors for 3 years before they figured out one of the things wrong with me. I also had a lot of family like his mom and she is behaving horrible. NTA at all.", "Yea I agree, I still feel like he should speak to her though. He’s not wrong for his reaction, but telling her would be closure in some sense.", "Mommie Dearest doesn't deserve closure, it's not she actually cares, she's just gonna want to save face", "NTA Love to see a partner properly defend their SO.", "NTA. Don't make assumptions if you can't beck them up.   \nAlso, here's to your wife: \"*Hello there, hope everything goes fine, cancer sucks, we all know that, but rest assured that you are going to be okay. Have fun with the things you CAN have fun with, dye your hair, learn a new language, eat lot's good food when you can, and so on. Make sure to read as much as you can!*\"", "The correct behaviour when you find out that someone you've been mocking and belittling for months for their supposed malingering has had cancer the whole time is, without exception:\n\nAbject. Grovelling. Apology. \n\nAbsolutely NTA. Your mom and your family should really consider digging up.", "Youre moms an AH from the get go. Good decision to cut her out.", "NTA- I am so sorry. I hope your wife feels better soon.\n\nNo matter what, your mom had no rights to dismiss whatever your wife was going through.\n\nYour mom is a massive AH. Keep her away from your wife.", "NTA…..the blood of the covenant is thicker than the water of the womb.", "I know people like this. As long as you breathe- you must be healthy enough to indulge whatever fantasies they have in their heads. It's not really \"illness\" unless it's cancer or something extremely serious.  \nF them all I say.   \nAlso, nobody is entitled to know about your medical issues.   \nOP, not just NTA, keep EVERY SINGLE ONE who has every questioned your wife or you blocked. Stress is bad for both of you, you guys don't need this nonsense. Just focus on getting her the help she needs.   \nAll the best. Sending positive vibes your way.", "My grandmother worries every time I have bad (not that bad, very uncomfortable but tolerable, think less than migraine, more than a bad headache) period cramps, phones to check in and insists I do nothing (i.e. if I had plans to help her)\n\nOPs. mum made poor assumptions based on nothing, and to compound it, the reality is much worse than (I presume) anyone anticipated.", ">how was she to supposed to know your wife was really sick\n\n\"because my wife told you so.\" She could have known, if she listened to you.\n\nYou are a good husband for believing your wife, even when the doctors told her off. It happens too often!\n\nNTA", "OP, I'm not sure you'll read this, but in case you do:\n\n1. Sending you and your wife much love, many hugs, and healing vibes. Cancer is A LOT to deal with. In fact, your opening list of your wife's symptoms immediately made me think cancer. They're very similar to mine and my sister's symptoms that turned out to be endometrial cancer for both of us.\n\n2. Your mother did this to herself, being cold, rude, and projecting her beliefs onto your wife instead of being concerned and supportive. Your wife could've been suffering from any number of issues and deserved to be listened to and supported, your mother chose not to. Turns out your wife has a very serious illness, and your mother wants forgiveness because \"she didn't know\"!? No. How has she earned that forgiveness. She needs to find ways to support you and your wife during this time, make up for her behavior, do better.\n\n3. Go LC/NC with anyone who isn't willing or trying to help you and support you. It may be cynical of me, but I learned (after my cancer diagnosis) who truly supported me and were worthy of my time/effort/energy. Yes, it may hurt to cut others out of your life, even if they're family, but sometimes it needs to happen. You'll always have 2 separate divisions: the life before cancer and the life after cancer. I had to go LC with my mom a few years before my diagnosis because of her and her husband's treatment of me. My mom wasn't present for any of my cancer treatments (I even nearly died and got no support from her.) In fact, her husband said \"Cancer!? But we've already done that!\" It's not a competition, it's not about others, it's about your wife and you and doing what you can and need to do to live life each moment as it comes. No toxicity allowed!\n\nI hope you and your wife have the support you need going through this. If you're in the US, the American Cancer Society has a ton of resources, so I'd highly recommend looking at their website and speaking to one of their patient advocates or counselors. If not in the US, look into seeing if your country has something similar. The ACS was such a gift during my treatment, and one of the things they offered to me gave even bigger blessings that still affects my life to this day!\n\nGood luck, remember you're NTA, and don't forget to simply breathe. Cancer us a lot, but you can make it to cancer-free for your wife if you take it with hope, goodness, and doing everything just one step and one breath at a time. Hugs!", "NTA my friend. You are a good husband. I hope your wife gets better quickly and you have all the help you need.", "NTA\n\nyour mum is certainly heartless for making judgements.\n\nbut more so your wife’s doctors are clearly negligent to have missed cancer for 2 years. I am not a doctor and I guessed this diagnosis by the first paragraph.  Her symptoms are textbook symptoms of stomach and/or bowel cancer.\n\nbest of luck with her treatment, I hope she recovers soon", "NTA she was horrible to her for being sick. Even if it wasn’t cancer her response is just bad", "I hate how women’s pain isn’t taken seriously and I am sorry your wife had to suffer so long before getting treatment.", "NTA I suggest the reply \"I have been trying to tell you all that I knew it was serious for months. That you chose to ignore me and belittle my wife is not my responsibility and frankly I don't forgive Mom for her behavior, nor just now but ongoing. This isn't a reaction to one bad comment, but to months of bad treatment.\"", "how was she to supposed to know your wife was really sick” ?  ANSWER: Because she said she was really sick!", "So because she didn’t know you wife was sick it was ok for her to assume your wife was healthy? What a crock of shit.", "NTA, and good on you for having your wife’s back.", "NTA", "NTA…your wife has been sick because I’m assuming she has had cancer for a while. She may have only just got the diagnosis so acting like this isn’t a new thing. You’re family is just too ignorant to connect the dots.", "NTA\n\nAt all. Please continue protecting your wife from your Mum. Your wife is more vulnerable now than ever. She doesn’t need your Mum’s comments as she goes through an awful medical crisis. Protect her. \n\nAnd protect yourself too. This is a stressful and traumatising time. You don’t need extra heartache.", "NTA. As someone who has struggled with chronic \"invisible\" illnesses for most of my life, I've had plenty of people and medical professionals not believe the pain I'm in, and I really feel for anyone who goes through anything similar. Your mom is incorrect. Pain is not just part of being a woman. Any pain that doesn't get better with ibuprofen or paracetamol should always be investigated.", "NTA, you are a wonderful partner who stands up for his wife. Good luck with the difficult time ahead of you.", "NTA your moms an asshole though also sorey to hear about your wife", "NTA and good for you! I’m so sick & tired of women shaming/disbelieving other women just because they’ve experience periods, cramps, birth, etc… no two women’s experiences are the same! It’s so disgusting. I hope your wife recovers quickly. I’m so sorry she’s had to endure this for so long.", "You sir are an awesome husband. I hope your wife will be ok.", "She knew his wife had symptoms, just not what she was sick with. She knew. \n\nNTA, not at all. i hope your wife gets better soon.", "I am so sorry for what you and your wife are going through. I can only imagine how terrible and draining it must be to know something is wrong, and not only be continually dismissed by doctors, but then dismissed by your own family. \n\nI am perplexed and horrified as to how the doctor's not test/catch this sooner. 2 years is so long in terms of cancer progression.  I am not trigger happy in terms of suing, but if you're in the US, I would definitely start gathering my paperwork, make sure I have all instances where I were ignored, and go seek a plaintiffs lawyer. To not even test for it at any point in 2 years with those symptoms is malpractice", "NTA. She knew that your wife was sick, because you and your wife told her. She just chose to not believe it.", "Would you really want someone that said you were faking or thoroughly dismissive around you while dealing with cancer? Even if they apologised for being heartless? I say this as a survivor...NO. Sometimes those people just make it worse. Also notice these people aren't upset that the mom was cruel and asking her to apologise. They are putting the emotional work on OP, they don't want to help, just make sure mama's fee-fees are ok. Please don't advocate that people should allow family like this back in. Boundaries exist for protection. OP has chosen his boundary. OP is NTA", "Hell no, relations that cause stress is way worse than not having their ”support”. Going through cancer treatment usually means having limited energy; cutting away negative influences is one way to make the situation easier.", "Bingo! You nailed it"]}