{"id": 23099, "submission_id": "15985o4", "title": "AITA for not waking up my boyfriend for work in time, even tho I could?", "selftext": "My (29F) boyfriend (35M) has been living with me since he landed his first engineering job 2 months ago. I have been the one to wake him up several times when I notice he's sleeping in. He has his first alarm at 7, then one at 7:10, he has to leave at 7:45 max if he wants to get to his workplace by 8am.\r  \n\r  \nI work from home, I'm a freelancer, so I have no need to wake up that early. On the times I realized he hasn't moved from bed and it's past 7:30, he would get really mad when I woke him up, yelling \"Why didn't you wake me up sooner???\".\r  \n\r  \nToday I woke up at 7am by his alarm clock, as we sleep together. He woke up, turned it off, and went back to sleep like he usually does until the 7:10 alarm. Then he turned off the 7:10 alarm and went back to sleep again.\n\nI wasn't really paying attention to the time, but I was using my phone as some clients were texting me already. I kept looking at my boyfriend from time to time, and he would open his eyes at me, smile, and nod, then close his eyes again. \r  \n\r  \nHere's where I might be the a-hole... I checked the time and it was already 7:37. I look at him calmly, he smiles, and I ask \"do you know what time is it?\", to which he answered \"probably 7:25 or so\", then he took his phone and saw it was 7:37 and rushed off to the bathroom, slamming the door.\n\nAs he was putting his clothes on, he was arguing \"It's an a-hole move of yours to not tell me the time earlier, because of that i'm going to be late and will leave without even brushing my teeth!\".\n\nI told him that I didn't mean to make him pissed off, but that being on time for HIS work isn't MY responsibility, to which he said \"if you are awake and capable of helping out, but you decide not to, then you are an a-hole\".\r  \n\r  \nI get that we are a couple and should help each other, and he's the one paying for all the food and half the bills, so the last thing I want is for him to lose his job because of tardiness.\n\nI was not troubled about being an a-hole until the moment he retaliated back at me in a pretty nasty way: before leaving for work in a rush, he blew his nose on my favorite towel (leaving boogers on it) and said \"you have that white towel on the bathroom to make it look pretty, right?\".\n\nHe's in a general a very good partner, so I was appalled that he would retaliate like that, which made me rethink if I should just keep waking him up if he sleeps in, as I'm already awake and I'm capable of doing it.", "created_utc": 1690290698, "permalink": "/r/AmItheAsshole/comments/15985o4/aita_for_not_waking_up_my_boyfriend_for_work_in/", "score": 5645, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for not waking up my boyfriend to be at work on time, since I was already awake?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. He is an adult and is capable of getting out of bed on time. I would tell him if he ever retaliates in such a disgusting manner again that he will be packing his bags and leaving. That is not acceptable behaviour under any circumstances. He is punishing you for his inability to get himself up on time. This type of abusive behaviour will escalate.\n\nedited to add, he is teaching you that you will be very sorry if you don't do what he wants.", "NTA\n\nHe's snapping at you and blaming you for his childish behavior.  You didn't sign up to be his mommy.  When you alarm goes off, you get up.  You don't put the burden of waking you up on your partner.  BF is an AH.", "Is he 35 or 12? Cause he sounds like a child. I'd just leave him sleeping until he wakes up, if he wants to get fired that's his choice. There's morning I fucking hate my alarm but get my ass out of bed anyway because I'm an adult and I have to work.", "NTA - Your BF is being an AH. He is an adult and he is responsible for getting himself out of bed in time to get to work. It is not your job to wake him up. That is what alarms are for. What if you decide to sleep in one morning? What if you are awake, but busy with your own job and not paying attention to the time? Is he just going to be late? Will it be your fault for not being awake to wake him up? \n\nIf he had accidently forgotten to set an alarm and you noticed and didn't wake him up - that would be an AH move. But he seems to have unilaterally decided that making sure he gets up on time is now your responsibility and he doesn't have to worry about hitting snooze on his alarms or keeping an eye on the clock in the morning. \n\nYes, couples should help each other - but that does not mean that he can just decide that you are responsible for something without your agreement and then get pissy when you don't do it.\n\nAnd him using your nice towel as a snot rag in \"retaliation\" is beyond petty and a pretty serious red flag.", "NTA. He's looking for a mommy, not a partner. The petty retaliatory behavior with the towel is a major red flag. He just disrespected you in a major way.", "Nta.  Break up with him. AYou're not his mom and he's not a 5 year old. So many red flags. I'd be worried about how he will retaliate in the future when you won't/can't do what he wants.", "NTA. While helping each other in a relationship is important, it's not your responsibility to ensure he wakes up on time for work. You have tried to help in the past, and he has reacted negatively when you woke him up earlier. \n\nHis retaliation by being rude and disrespectful is not acceptable and shows a lack of maturity in handling conflicts. \n\nHe should take responsibility for his own punctuality and not take his frustrations out on you.", "NTA.  How did he get to work before he moved in with you? He can do that now. You're not his mommy.", "NTA. You're his partner, not his mother. If it happened on occasion, I'd be fine with a gentle poke and telling him the time. But it sounds like this happens all the time and he genuinely thinks it's your job to wake him up if he's sleeping in too late. His response was also super childish and petty.\n\nI'd have a calm conversation with him about this and let him know you won't be responsible for him getting up on time. Also, pay attention to his reactions to irritations in the future because if he makes a habit of \"retaliating\" when he gets upset, I'd be reconsidering my relationship.", "NTA. He’s 35. As in he has been an adult for more than a decade. He should be able to get up on his own. And blowing his nose on your towel just to be petty, again he is 35, not 5! You should not change your behaviour because of his retaliation! He should not retaliate like a child! You two need to have a proper conversation about this, because this can’t go on.", "I am amazed at people who point some horrible red flags in their partners and then say but in general they’re good. Nobody is perfect, but no good person is lazy, entitled, and vindictive. Gather his stuff and change the locks. He moved in with you and put the burden on you . Please don’t say he doesn’t contribute to the household chores because “it’s an engineering job” and he’s so tired. Please please don’t say he doesn’t contribute financially. NTA.", "NTA. You’re not his mommy and he’s not an 8 year old going to school. It’s not your duty to make him get up and get ready for work. He’s an adult who should be taking care of his schedule. I’d suggest sleeping in separate rooms if his alarm waking you up is a problem for you.", "NTA he's a grown up. Do grown up things", "NTA. Being on time for work or anything else is a personal responsibility. It’s time to sit him down and tell him that you will no longer notify him of the time and if he oversleeps it’s his responsibility to deal with the consequences. There’s absolutely no reason why he cannot set an alarm and get out of bed on time. I would also tell him if he ever does anything as petty and disgusting as blowing his nose on your towels again he can start looking for his own place to live.  He is an AH for expecting you to get him out of bed and for such childish behavior.", "NTA\n\nWouldn't it be great if there was a device that could remind us its time to get up.... Like a clock or a phone.  Then you can be self-reliant.  Oh he has this!!!!!  Instead he goes.... I know I need to get up, I set an alarm and hit snooze and then do it again BUT it's your fault for not waking up!!!!!  Nope!!  You are not his insurance policy against self inflicted stupidity/laziness.  It's like when someone says remind me to do something important, that you have NO RESPONSIBILTY to do, and then they blame you if they miss their deadlines.\n\nHis reprisal was soooo low class and disgusting as well.  He needs to go to sleep earlier, or get some sleep therapy if he is unable to wake up when he needs to.  (Best practice,.... Don't use snooze, just shower.", "NTA, he is a grown man who doesn't need mommy to wake him up.", "NTA. It' s quite worrying that his first thought was to retaliate. Especially in a way that I'm pretty sure is not appropriate for a 35yo man...", "NTA  I agree that blowing snot on your pretty towel is a red flag. I had an ex like this. He stole my favorite shoes and threw them out of a car window. He went to retrieve them only after I called his mom and told on him lol. You might need to call your boyfriend’s mom. He seems like he’s still at that level", "NTA. Your boyfriend is though. He wants to sleep in and not be on time, which is his fault. If he wants to turn to pettiness, tell him living together isn’t working out and you want to live separately. Punishing you for his tardiness and inability to manage his time is not your fault.", "NTA.  He's a grown man, even if his actions would seem to indicate otherwise.  If he can't get up to his alarm, then he should ask you to wake him.  And he should ask nicely.", "ESH. He for obvious reasons. You for, yes, not waking him up sooner. Many here are talking about how you're not his parent and that's true. But in a relationship, you communicate and compromise. Sit him down and ask him what exactly it is he wants you to do and at what time. Then you can decide if that's something you're willing to do. 'Okay, so you want me to wake you up if you're not in the bathroom by 0730. If I'm awake, I can do that. But I'm not going to set alarms to make sure I'm awake at that time.' Or whatever you both decide. But sit down and talk about and decide what you both want to do. Or not.", "ESH. His retaliation was childish and repulsive but as a partner you should care and keep your SO from tripping as much as possible.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (29F) boyfriend (35M) has been living with me since he landed his first engineering job 2 months ago. I have been the one to wake him up several times when I notice he's sleeping in. He has his first alarm at 7, then one at 7:10, he has to leave at 7:45 max if he wants to get to his workplace by 8am.\r  \n\r  \nI work from home, I'm a freelancer, so I have no need to wake up that early. On the times I realized he hasn't moved from bed and it's past 7:30, he would get really mad when I woke him up, yelling \"Why didn't you wake me up sooner???\".\r  \n\r  \nToday I woke up at 7am by his alarm clock, as we sleep together. He woke up, turned it off, and went back to sleep like he usually does until the 7:10 alarm. Then he turned off the 7:10 alarm and went back to sleep again.\n\nI wasn't really paying attention to the time, but I was using my phone as some clients were texting me already. I kept looking at my boyfriend from time to time, and he would open his eyes at me, smile, and nod, then close his eyes again. \r  \n\r  \nHere's where I might be the a-hole... I checked the time and it was already 7:37. I look at him calmly, he smiles, and I ask \"do you know what time is it?\", to which he answered \"probably 7:25 or so\", then he took his phone and saw it was 7:37 and rushed off to the bathroom, slamming the door.\n\nAs he was putting his clothes on, he was arguing \"It's an a-hole move of yours to not tell me the time earlier, because of that i'm going to be late and will leave without even brushing my teeth!\".\n\nI told him that I didn't mean to make him pissed off, but that being on time for HIS work isn't MY responsibility, to which he said \"if you are awake and capable of helping out, but you decide not to, then you are an a-hole\".\r  \n\r  \nI get that we are a couple and should help each other, and he's the one paying for all the food and half the bills, so the last thing I want is for him to lose his job because of tardiness.\n\nI was not troubled about being an a-hole until the moment he retaliated back at me in a pretty nasty way: before leaving for work in a rush, he blew his nose on my favorite towel (leaving boogers on it) and said \"you have that white towel on the bathroom to make it look pretty, right?\".\n\nHe's in a general a very good partner, so I was appalled that he would retaliate like that, which made me rethink if I should just keep waking him up if he sleeps in, as I'm already awake and I'm capable of doing it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Him waking up is not your problem.. he is a child. NTA", "Is he 35 or 5? He shouldn't need anyone to wake him up. If he's that bad at turning off his alarm then he needs to set several alarms, get one that shakes the bed, get one that makes him solve a math problem, etc. Y'know, what an adult would do.", "He wants a mommy as a girlfriend and it won't stop at expecting u to wake him up on time. Soon he'll start expecting you to make his lunches, take out his work clothes the night before etc etc. \n\nYou need to have a conversation with him about how you're not going to wake him up or mother him in any way shape or form, if he still expects you to do this then idk I'd dump him. He's 35yo and still acts 12, he needs to grow up and respect you as a partner not his mom.", "NTA - couple things, first and foremost it’s not your responsibility to make sure he wakes up in the morning on time. He’s an adult he can figure it out. Second, blowing his nose on your towel? That’s just petty and extremely immature. Based off the little information provided I’m gonna assume you can do better.", "NTA.\n\nHe’s an adult. He’s responsible for getting up on time. You’re not his alarm clock or his mother, and the fact that he gave you attitude when you tried to help before? No. \n\nAnd blowing is nose on your towel? Yeah, I would definitely rethink my living situation.", "NTA.  Your boyfriend is a freaking jerk.  It's his job.  You're not his mother & you're not responsible for waking him up.  His first alarm goes off at 7, he s/b getting up on his first alarm.  He is an adult acting like a spoiled child.  And him blowing his nose in your towel is disgusting.  I wouldn't let him get away with that.  This man owes you an apology for blowing up at you like he did.", "NTA. Don’t give in. In fact, really consider if you want this in your life.  You can get a man with every good quality that he has, plus he will get up on his own and not feel the need to destroy what you love.   \n\nSeriously. He can set 30 alarms if that is what it takes to get up, the last one being a civil defense tone, but instead he sets 2 and then plays victim because his servant doesn’t cover for him. His victim energy is going to show up in other places too.  Start paying attention to his other excuses for why things don’t go his way.", "NTA. Move out so him waking up on time is no longer your problem.", "NTA has he thought of setting his first alarm earlier instead of always leaving it all till the last minute my come back would have been you have an alarm maybe stop snoozing it and relying on me to get you up and just get up\n\nAnd blowing his nose on a towel because he's too lazy to get up himself is pathetic honestly", "NTA He needs a mom not a girlfriend. Also, don't justify what he did because he is in general a good partner. A good partner would not do what he did. That was mean, deliberate and meant to disrespect you. Rethink this relationship. Find a partner who respects you and is not an immature brat who needs a mommy to wake him up for work. One who does not \"retaliate\" because of their short comings. This is all on him. He is a 35 yo man, not a child. Time to move on.", "NTA. As an occasional occurrence, yes, you should wake him, but not every day. That’s just replacing his alarm clocks with you. \n\nThe snot on the towel is disgusting! He needs to apologise and clean it or go, because wrecking your stuff because he’s angry is not okay.", "NTA, when did you give birth to him? Congratulations on your child!", "NTA - you are not his mother. He needs to get up when his alarm goes off.", "NTA - sounds like everything is everyone elses fault. \n\nTell him its an iss-YOU, not an iss-ME.", "Nta, this dude needs a mother not a girlfriend.", "A 35 yo man who can't get up on time? And then has the audacity to yell at you that you are not acting like his mom? And then smearing his boogers on your nice towel like an angry 14yo? 35 you said? Are you sure? \n\nI'll be honest with you. I would have lost all sexual attraction to this guy the first  time he demanded i have to play mommy and wake him up after he ignored his alarms. I'm not interested in dating oedipus and i definitly do NOT want to have sex with a 14yo teen.", "NTA. This dude has been clearly catered to by his mother who would have taken the snot-on-towel move. You’re his partner… not his maid, or his mother. \n\nWhere has this guy been if he’s 35 and only getting his first engineering job now?  Honestly, this relationship isn’t worth it if he’s going to keep treating you this way, and taking no adult responsibility for himself.", "Congrats on the son. NTA, he wants you to be his mommy.", "Big red flag if I’ve ever seen one! Time to cut this one loose and get a roomate to pay 1/2 the bills", "NTA\nA 35 year old man hasn’t figured out how to stop snoozing the alarm clock is not your responsibility. If he has issues waking up, that is his responsibility to deal with that.\n\nOf course it’s nice to help with waking up, I’m super sleepy in the mornings too and snooze the alarm a billion times, but in the end still manage to get up on time.\n\nAlso blowing boogers in your towel? What is he, 5?", "He's a grow up who needs to learn how to getup for work. NTA.", "NTA it's his responsibility to wake up, put on his clothes, brush his teeth and hair etc, not yours.", "Yep, I agree.", "This is definitely a hill I would die on. I ain’t nobody’s momma. If you can’t manage to hold down a job without me holding your hand, we’d be done.", "[removed]", "I wouldn't even wait for a habit, that retaliation was petty and disgusting. I'd be reconsidering the whole thing today.\n\nAgree with the NTA and your reasoning.", "Vindictive is the quality that she is overlooking the most.  It isn’t going to get better, it will get worse.", "Mommy would ground him for his disrespectful behavior. In the case of a bf: kick him out!", "Bruh, he woke up, multiple times obv, he should just get up the first time, get ready, then lay back down. This should not even be an issue", "He is an adult, capable of getting up on time and she is not his mom.", "No. He's an adult and perfectly capable of getting himself up on time. This wasn't a once off thing, he purposefully decided to not pay attention to the clock anymore and just expects his SO to wake him up without asking her to agree to doing this and feels entitled to her time. He wants a mommy for a gf and I sincerely hope OP dumps him because this behaviour only gets worse with time", "Yea, honestly me too, but I see so many people on here jumping to break up immediately and I wanted to put it nicely, haha", "Understandable! I always expect push back when I am on team \"unacceptable, throw the whole person out\", but I only ever say it in cases where I'm passionately sure. It helps a bit to feel like I'm not just doing the reddit relationship thing because everyone else does.", "Usually I’m not a “break up is the first/only solution” type of person. But he’s staying with you? Rent free? Not to mention that the second a grown adult man I was seeing blew his nose on a decorative towel I had out of spite *and* yelled at me because I didn’t wake him up for work…\n\nGirl his shit would be on the doorstep when he got back home.", "Men. Always looking for either a nurse or a purse. Sometimes both.\n\nYou are not his Momma. Make that very clear to him. \n\nSpeak to your landlord about the lease; I feel things are going to escalate here and he will be destroying more of your property before long. Start making a plan to get out of there safely. Just in case.", "NTA He is old enough to wake himself up, it’s not your responsibility to do so as you have your own work and responsibilities to deal with.\n\nHis ‘punishing’ you by blowing his nose on a towel is not only gross but also a huge red flag as to how he is going react everytime you fail to do something that he sees as your job. \n\nLeave him.", "NTA I read the title and thought, “Let me guess. The OP doesn’t want to act like their adult boyfriend’s mother.” Yep.", "If it only happened once in a while it would be a different story. We should look out for our SOs. But this is a pattern and you are not his mother. NTA", "Your boyfriend is 35 and expresses his anger (at his own irresponsibility nonetheless) by ruining your belongings? Yikes. 🚩\n\nEdit to add judgement. NTA", "He is a 35 year old child.", "NTA. He's a big boy who can get up on time. Was he consistently late before moving in with you or is he just going to depend on you from now on because that's your new \"job\"? Also, that disgusting towel trick he did? Yeah, be prepared for that to escalate when you \"disobey\" him down the road. That is a major red flag. If financially feasible for you, I'd consider having him move back out.", "NTA - if this had happened once, then I could seem him being slightly justified in being upset. However, he’s an adult and this is a pattern. It’s not your job to make sure he gets out of bed on time. What would he do if you were still sleeping? It’s not on your that he likes to set and ignore multiple alarms. You’re not his keeper and he’s not a child.", ">which made me rethink if I should just keep waking him up if he sleeps in, as I'm already awake and I'm capable of doing it.\n\nTHAT'S what you think you need to rethink!?!?\n\nNah, you need to rethink if you want to be with someone who can't be responsible for getting themselves up and to work on time. \n\nYou need to rethink being with someone who is so petty and immature that they feel the need to retaliate when you don't do something that THEY are responsible for. \n\nNTA btw", "NTA\n\nIf he needs Mommy to wake him up in the morning, he can move back home with his parents. He's supposedly a grown ass man. He could try putting his phone out of reach so he has to get out of bed to turn off the alarm, or you know, any kind of problem solving that doesn't involve you being somehow at fault for his irresponsibility.", "NTA \n\nI’m sorry, my boyfriend is in the same profession as yours, gets up ten minutes before he needs to leave and manages to get dressed and sort his lunch out (while also brushing his teeth) \nHe’s a grown ass man he can get up for his alarm, and if it means he’s got ten minutes then he’s got ten minutes. He better rush.", "~~ESH.~~\n\n~~You knowingly lied;~~\n\n>I checked the time and it was already 7:37. I look at him calmly, he smiles, and I ask \"do you know what time is it?\", to which he answered \"probably 7:25 or so\"\n\nHe took out his frustration on you and was disgusting and petty;\n\n>On the times I realized he hasn't moved from bed and it's past 7:30, he would get really mad when I woke him up, yelling \"Why didn't you wake me up sooner???\".  \n>  \n>he blew his nose on my favorite towel (leaving boogers on it)\n\n~~This spiral will get you nowhere and will just make the relationship worse for both of you.~~\n\n~~Communicate with each-other and respect each-other like adults.~~\n\nEDIT: Woops I misread and thought you had said it was 7:25. In which case my bad. I retract the ESH.", "Bro....\nHes a 35yr engineer thats probably tasked with solving relatively conplex problems and he doesnt have the discipline to get up on time? \n\nYeah thats an engineer that shouldve been weeded out in a statics course.", "I has a MIL who did this. She couldn't even wake up on time to see her dying father and got mad at everyone else for not waking her up in time to be ready. It's just sad and childish when an adult can't figure out how to wake up. NTA.", "NTA he's an adult who can get up by himself like a big boy. He also can stop slamming doors in your house or get tf out", "I have seen way too many “AITA for not being a human alarm clock for my grown assed boyfriend?”\nYou’re not his mom, and he isn’t 10.", "NTA. You are not the mother of a toddler, although you wouldn’t know it because blowing his nose on a towel is something an angry toddler would do.", "Quite frankly dump him. He is toxic narcissist. Not your responsibility to wake a grown ass man.", "Girl. RUN. Also NTA.", "That's a slippery slope right there. That's a ticket to being 100% responsible for making sure he's uo, which he already seems to think. \n\nThen, to continue his trend of grown up behavior, he snots a towel? He's showing you who he really is, and you should believe him. NTA", "NTA and go get yourself a better boyfriend.", "ESH it's not your responsibility but you can help him to wake up bc you're awake, just say \"hey, it's 7:30\" that's all, it won't trouble you, it's not more work for you, it's just a simple help that won't cause any inconvenience for you but would help him a lot. His behavior towards you was disgusting and way too much. My partner brings me coffee every morning bc I can't wake up, and I call him to bed and tidy up every night when he sleeps on the couch, it's just partnership and empathy we take care of each other even tho it's not our responsibility.", "Yes you are the asshole. You live together, his job affects your life. You have an interest I'm making sure he has a job.\nOf course you should wake him up if he is going to be late.", "You are an AH.\n\nHe is disgusting.\n\nYou, two, deserve each other.", "ESH. I think you should have woken him because you don't want him to get in trouble at his job.  Some people just have a hard time waking up, me included. Dragging myself out of bed can be a monumental effort. Helping him to wake up would be helpful for him.  However, he didn't need to be nasty about it. We have a 30 minute rule in our house.  There is to be no conversation for 30 minutes after I wake up because I'll either be incoherent or snippy.", "YTA. He's an adult and should be responsible for getting himself up on time, etc. However, if you're sitting in bed, awake, and know he's running late, why cant you nudge him and tell him what time it is before it's too late? I don't get it. Sure, it's not on you to do it, but he's your boyfriend, right? Don't you love the guy?", "Yes", "NTA adults incapable of getting themselves to work on time are fucking ridiculous. Your bf is an overgrown child", "NTA and tell him to either grow up or move into his own place. Just gross and stupid", "NTA.\n\n\nMy husband and I were in a similar situation until a few weeks ago. He doesn't wake up when his alarm goes, while I'm already up with the children, and I often hear his alarm ring for 3 minutes straight without him turning it off.\n\n\nBut with my husband, this changed when I told him in a calm moment that waking him up makes me feel like a) his mother, b) his maid or c) living with my teenage brother again. - Now, he (usually) gets up in time, and he NEVER blames me for oversleeping.\n\n\nYour boyfriend's reaction is horrible, and I'd make HIM do the laundry with the towel he wiped his nose on, and THEN break up with him for blaming you for HIS mistakes.", "NTA.  This is an issue he needs to deal with.  I ised to be like that, it sucks, the only way to fix it is for him to get up himself.", "NTA. Some mornings I'm too sick to work. Sometimes my bf will check that my sleeping in was intentional if I hadn't been exhibiting illness signs the night before, but largely he assumes I'm an adult managing my own work schedule. Likewise sometimes my bf works a late night due to a midnight tech deployment and takes off the next morning as comp. Again, occasionally I'm not sure and softly checkin with him, but largely I assume he's sleeping late on purpose. \n\nThe fact that your bf expects you to be his living alarm clock already made him an AH. But then he f-ing snotted your towel!!!! I would seriously be looking across this relationship as a whole to see if there are other red flags you've been ignoring. He sounds like an insufferable petulant child.", "NTA. You should tell him “you got time for boogers, you got time to wake your ass up. Here moving forward I’m not lifting a finger to make sure your ass gets up. Don’t get fired because rent is due muthafaca. Love you sweetie.”", "NTA he’s an adult", "Look, any excuse you could think, he is immature, he was angry, he doesn't know how to deal with confrontation, parental issues or any kinda issues, nothing justifies what he did.  \n\n\nLets look through a lens shall we?At surface it seems like something childish or something that doesn't matter and even pathetic, blowing his nose on your favorite towel as payback. \n\nMaybe you can think it could have been worse or it wasn't a big deal, but that's how it starts. Something happened that he didn't like and he doesn't want to happen again and doesn't want you that a say in this. He maliciously went after something you like and soiled as retaliation, he choose to attack you personally.  \n\n\nI am not going to advice you to outright break up, but I would suggest to spend sometime remembering your relationship with him and see if he did similar behavior in smaller doses and to confront him about what he did and gauge his response.  \n\n\nMy suspicion he will be very defensive, saying that it's something couples do, that you are being selfish, that it's not a big favor to ask.", "NTA being so whiny and entitled about you not waking him is an annoyance but not necessarily a deal breaker. The spite required to retaliate the way he did would be a one hit end of relationship for me.", "HES 35?! 35!! Let him move tf back out. NTA", "If I read one more time: he/ she is generally a good person/ partner I throw up. No these people are not generally good otherwise they would not do these things to a person they love.\nIn this case, think about the whole relationship. He is 35 and not able to get up once the alarm goes off? Retaliates with such a nasty gesture? If you talk to him, setting boundaries, remind him he has to wash the towel.\nNTA", "He is grooming you to be his perfect mother.\n\nEdit to correct? I meant partner?", "NTA. You are not his mom; he is not a child. Tell him that you want a partner, not a dependent. He's been getting away with it up to now, I think you should tell him point-blank that you're not going to be his wake-up monitor now, or ever, and he has to stand on his own 2 feet.\n\nI can get why he'd be mad a bit about how it went down, but I'd bet money his phone, that has a freaking clock on it, is within his arms reach. Time for him to grow up.", "NTA- he is an adult, if he isn't capable of waking up on his own that's a him issue. He's acting like a child who needs their Mommy to wake him up and you are not his Mommy. The blowing on the towel to retaliate against you is also big baby behaviour... what a loser", "NTA and this would be a dealbreaker for me. I’m not your mom, get up and go to work like a grownup.", "Wtf. My husband has to be up by 5:00 for work. I’ve had to wake him up (in four years of marriage) for work only about 3-4 times. Never once when I’ve slept through his alarms and he overslept as well (maybe 1-2 times when he was overworked/overtired) did he ever turn around and blame me for it. \n\nYou’re not his mother. My husband knows I’m not his mother but if I’m awake already and he’s not moving by the first alarm, I’ll just ask if he needs to get up and then he’s moving. \n\nAnd blowing his nose on your nice towel as payback? WTF. You’re NAH. His behavior is unacceptable. How was he waking himself up before you? Because it sounds like he needs a firm reminder that you’re not his mommy and he’s a grown man.", "Wow, this guy is thirty five? You might want to check his birth certificate. I’m thinking twelve.", "He’s 35 and can’t manage to do the basic of get up on time for work … tell him to go home to his mommy", "At 35 he still can’t reliably wake himself up? That’s utterly pathetic. NTA", "I have been  using an alarm clock to wake myself up since I was like 12.", "NTA, i have the same issue sometimes and i stopped trying to help my boyfriend wake up too. I found myself unable to relax on my mornings off as i was too worried he wasn’t moving to get up", "NTA- don't wake him again.  You did say 35 and not 3.5 right?\n\nAsk yourself if you are really going to be catering to a toddlers demands because if you don't he will blow boogers everywhere?\n\nWeaponized incompetence comes to mind. And it's a slippery slope.", "OP, he’s lazy, vindictive and gross. You deserve far better than this loser.", "NTA. And anyone who is nice until they don't get their way isn't a good partner.", "NTA -Andhere's an idea - next time hisalarm rings. wake him up. I mean WAKE him up. don't let him sleep til 7:10 - because then he'll be late and angry with you - so make sure he gets his ass out of bed before 7:05 - He asked you right?  \nBut if he decides to sleep in after that - then it's on him.  \nThat will probably make him shut up about it.", "NTA and I know I’m going to be the classic redditor who’s all like “leave him!” But…leave him. Srsly. Up until point he blew his nose on the towel, I was thinking you could just nip this in the bud and have a convo and solve his responsibilizing you together.\n\nNope. This guy has only been living with you for two months. This is around the time you find out what someone is REALLY like. He blames you for things that are his fault and in his power to correct.  Not only does he blame you, but then he gets petty and retaliatory. \n\nThis won’t be the last thing he blames you for. When he loses that engineering job, it’s going to be your fault and you’re still going to be stuck paying the bills. When you get pissed and won’t sleep with him for a week, he’ll find a chick at the bar to bang, and that’ll be your fault too. \n\nDump this petty MF already.", "NTA\n\nI would definitely place a firm boundary that you are not an alarm clock. It is not your responsibility to get him up for work. This would be an example of women having to take on extra mental work for their partner when their partner could just be an adult and wake up on their own.", "NTA. 2 alarms and grown adult...", "NTA. You're not his mommy. Time for him to grow up and follow his alarm clock and stop inconveniencing you by putting a burden on you to monitor his time or waking you up constantly by just being inconsiderate and disrespectful by the demands of sharing a living space.\n\nI would flat out tell him \"I am not your mother. If you want to be in a relationship with me, you need to get up on your own with your alarm clock and go to work. The way you treated me was unacceptable and I will not tolerate it.\" If he were embarrassed and broke up with me over it then that's his loss and your gain.\n\nHe needs to act like an adult. Honestly, reading the retaliation part I think I would just break up with him and tell him that was the reason why and he can go or you can go - (not sure who is on the lease here) but you don't need this in your life.", "NTA and WTF?\n\nHe's a grown-ass adult.  He can get up on time his own damned self.  And if he continues to lash out out at you for something he should be able to handle on his own then consider that a red flag.", "NTA \n\nHe's an adult. Part of being an adult is being responsible for getting your butt out of bed in time to be where you need to be when you need to be there.\n\nStop letting him make you his mommy. Tell him you're no longer his wake-up service. If you need to, go out for a 30 minute walk when his first alarm goes off.", "NTA:  \nAdults don't retaliate when their bad behavior back fires. And tha tis what happened. He will escalate. At the absolute best you will fill the role of mother. Where you wake him every day. And every day he will push it.   \nThe worst is... you will fill the role of mother and housekeeper and more. He is looking for a caregiver. Not a partner", "NTA. You’re not his mommy, you don’t need to wake him up for school in the morning. Does he also expect you to pick out his clothes, help him get dressed and pack his lunch?", "Nta, wow hes immature, are you really ok with him disrespecting you like that? You were right its his responsibility to wake his own ass up and hes using you as an excuse to shift blame onto you. Honestly you should never wake him up now because hes a big ass to you. You need to have more self respect and not take his immaturity anymore.", "YTA. That job he needs to wake up for is feeding YOU as well. You were spiteful when you saw the time and let him risk his job. He was spiteful with a towel. YTA, and you’re a pretty shit partner as well. You began it with spite. I don’t tell people they need to break up, but you’re a bad partner. Imagine sitting there like the Cheshire Cat to the person you claim to LOVE, and just enjoying his panic.", "What. The. Fuck. \n\nHe blew his nose, on purpose, on a hand towel before storming out? \n\nGuys a keeper.", "The retaliation is the last straw. He's a petty AH. This could have been a conversation about how he needs support in getting adjusted to his schedule with a reasonable request, not demands.\n\nIf he was yelly when he was stressed about getting to work on time, I might have chalked it up to stress and had a conversation about how I won't be spoken to like that later in day. But intentionally blowing his nose on your favorite towel? No. Just no. Put him and his stuff out.  Leave the towel on the top of the pile and buy yourself another. \n\nNTA for not waking him up.", "NTA. Sounds like you’re his mommy and not his girlfriend. His behavior to get back to you also is that of a child and not of an adult.", "NTA..my ex was like this too. My anxiety of worrying about him getting up and getting to work on time wore me down. He’s not your child, he’s an adult and he needs to start acting like one. Tell him to get a grip and grow up, you’re not his mommy.", "He’s not a good partner in general, he’s fucking up your sleep with infinite alarms every day because he can’t get up like a normal adult.\n\nNTA, but y’all need to either sleep separately or *live* separately. You are not his mommy. Did he live with his mommy prior to moving in with you rent free? Did his mommy wake him up every day? Send him back cause she did a shit job.", "NTA\n\nHe's a grown adult. He can wake up on his own. Or use an alarm.", "NTA. He's making you responsible for the mental labor that is getting up on time. Do you want to be his mother? Because that's where this is going. Dude is on the way to 40 and can't be up before 730", "NTA\n\nWouldn't be the asshole even if you weren't working but you were. Hes been at the job a few months and its his responsibility to be there on time. Dont let him outsource the blame for his fuckups to you. You would not have even been in the position to \"let him down\" if he hadn't failed himself first. Its fine for him to be pissed at himself but id be wary of someone who's instant reaction is to blame someone else for something that is so clearly their own fault.\n\nIf he is capable of using his phone and getting a job, he is capable of setting an alarm and not turning it off/going back to sleep. If its hard for him, he needs to see a doctor or try other alarm solutions like the one that fills the room with light one that requires him to get out of bed to turn off. Choosing not to do that is an asshole move and it would have prevented any conflict with you.\n\nThat last petty retaliation has me suspecting he's not as good of a partner as you think he is. He went out of his way to disrespect/needle you. So much so he wanted you to know how disrespectful he is. Ive never had a partner decide to be an asshole then point out how much of an asshole they are, like a toddler. If you trust him to wash it, id ask him when he's doing laundry to clean up the mess from his tantrum (assuming this is a one off, but it doesn't seem that way as you mention he's previously gotten mad for not waking him up). If you don't trust him to do that, i don't know how you expect to continue a relationship with someone untrustworthy. If you stay, dont wake him up again. He lost that privelege when he blamed you for his own failure. \n\nThis guy doesn't respect you and expects you to be his mom and wake him up. That doesn't sound sexy.", "NTA\n\nI'd say he's an adult and is responsible for getting himself to work, but that towel move was straight bratty, so I'm not sure about the 'adult' part.", "He’s not a teenager, he can manage his own time. NTA.", "Are you sure he's 35? He acts more like 15. NTA", "NTA. mad at you for him not waking up for his own job, and then blowing his nose on a towel?? so ridiculous and immature. i don’t know you or your relationship but that is a big red flag. you say he’s a good partner otherwise, but i would carefully reflect on possible past behavior that might need questioning.", "NTA. You're not his mum.", "Sorry, I'd toss him out after that and revaluate the relationship.  He;s generally a good partner when he gets his way.  You're not his momma and it's time for him to grow up. nta  And anyone who sets an alarm to go off multiple times disturbing others is an ah.  Here's how I help my husband, if he wants a diet coke, I go out and get him one.  He had to go into the office this morning and had to get up at 7.  Do you think I was waiting by the bed to haul his butt out of bed?  No.", "NTA he is abusive and he needs to leave", "You. Are. Not. His. Mom.", ">He's in a general a very good partner\n\n>it's past 7:30, he would get really mad when I woke him up, yelling \"Why didn't you wake me up sooner???\".\n\n>he was arguing \"It's an a-hole move of yours to not tell me the time earlier, because of that i'm going to be late and will leave without even brushing my teeth!\".\n\nGirl...no he is not a good partner. He knows when his alarms are set to go off. He blames you for not getting up when he should. He found something you liked and made a point to mess with it because he's unable to be responsible.\n\nAgain...he is not a good partner.", "Nta. If it was very occasionally, then I would just wake him up, but you are no-ones personal alarm clock. My partner struggles to wake up to his alarms, so I set alarms as well so he has 2 different sounds to wake him up, but he doesn't get annoyed if I don't, it's just a nicety.", "NTA Hell no. Don't start this. He'll expect it every single day then, and as soon as you don't do it one day, he's doing this bs again. He needs to set 1 alarm and get up when it goes off. I want to say it's even proven, multiple alarms does more harm than good.", "NTA\n\nGood news! Since you work from home it will be easier to schedule a stop at your local bank (do it in person, no internet trail) to open up a secret bank account to funnel money into. This is your escape account. If you want to go extra fancy, try something with a high interest rate.\n\nHigh chance his behavior is going to escalate. He's already setting up a pattern for abuse. You're going to need to GTFO one day. Having your own funds will make it a lot less stressful when you're on the run.", "NTA and he is seriously disgusting", "NTA. You’re not his mom and he’s acting like a spoiled brat. You didn’t get him up for work so he blew his nose on your favorite towel. That’s petulant 10 year old behavior, not grown responsible 35 year old behavior.\n\nIf he wants to act like a child, send him back to his mommy.", "I made it as far as \"My (29F) boyfriend (35M).\"\n\nNTA", "Hahahahahaha. Check your contract with him. Does it mention you being his alarm? No? Does it mention you have to be like his mom? No? \n\n\n\nNTA OP, he is a spoiled brat for asking you this.", "NTA - he’s a grown man. Tell him to act like one, grown men also don’t slam doors and blame their partner with a tantrum, you sure you want to be with this person?", "What is this?\n\nOf course you're NTA\n\nHe's 35 and an engineer but can't wake up on his own? How did he manage before moving in with you?\n\nYou can try talking to him when he's calmed down, telling him you aren't his parent and you won't be waking up no matter how late it gets.\n\nYou also need to tell him that he needs to learn to communicate and not resort to childish retaliation", "NTA. He wants you to be his mom, and wake home up. He has alarms and keeps not waking up to them. Don’t let him treat you like this and can always start working from a Starbucks so he has to rely on the his alarms. If he keeps blaming you, then kick him out or leave.", "Whoa whoa whoa NTA and he’s retaliating against you by ruining something good of yours?  That’s on him totally.  You did go tell him what time it was when you thought about it and weren’t working. I’m not sure why it’s your responsibility to be his alarm clock though? \n\nI can say that I probably would not do what you did and probably would wake them up.  Because my own son has a really hard time waking up but he also deals with it well so if he gets in trouble over it he accepts it as his own fault you know? Like he doesn’t blame it on others. He’s not blaming it on me for not waking him up earlier.  In a relationship I probably would also try to wake them up at a regular time and if they didn’t do it then that’s on them. However relationships are about reciprocation and it’s about give-and-take. Maybe you both need to have a hard conversation about your wants and needs and his wants and needs and how you both can compromise. This might make you closer even though right now it sucks. So just work on growing and learning from this experience for the future.\n\nIt’s NOT your fault though.  He sucks ass for telling you that.  You know how he should’ve approached you? He should’ve said “next time can you try to wake me up at such and such time if you notice?” And then just go on about his day and go to work. Like there was no expectation prior to the situation for you to wake him up. He’s doing a dick move with acting like that to you.  \n\nI would dump this dude. I wouldn’t even go further than that because if he’s doing this type of behavior blowing his nose in your good towels what else is he doing? That’s really messed up.\n\nEdit: redid last paragraph", "\"I am not going to take the responsibility for making sure you pay attention to your alarm to get yourself out of bed so that you are on time to your job every day.  That is on you and I will not accept that role.  Figure it out.\"\n\nNTA\n\nIf it was an unusual thing, with extenuating circumstances, I might feel differently.  But he's asking you to executive function for him, and that's a hard no.", "NTA. You'll be an AH to yourself if you put up with this for much longer. If I were you, I'd never wake him up again and I'd tell him that as soon as he gets home so he knows. Done.", "NTA but he is. And he acts like he's 17.", "If the alarms went off and he didn't wake up, then you should make sure he gets up since you were awake. If he turned off the alarms and overslept, its mostly on him. Then again considering you were awake using a device that shows the time, you could have woken him up. I work a job where I don't get a lot of sleep and I set multiple alarms to make sure I wake up when I need to. Ive only ever had my phone not wake me up once or twice when it updated overnight.", "NTA.  You need to leave this guy because he is trash. Not only did he falsely blame you for his own mistake but then he does such a disgusting attack on your stuff just out of malice.  This is absolutely the hill to die on.  \n\nThe issue is a lot bigger than just waking up late.  The failure to accept responsibility, redirect blame to you when your innocent.  The anger to retaliate right away instead of leaving quietly and trying to give himself time to cool off.", "If I were you and could stand getting up early, I d wake him up at 5 a m. \n\"Oh honey you told me to help you making sure you rise to get to work in time:.\"\n\nMore than once.\nBe careful who you try to fuck with.", "NTA. Wtf did he do prior to moving in with you? 🚩", "🚩🚩🚩🚩🚩", "NTA. Its not your job. He sets his alarms for a reason. He needs to actually get up.", ">I was appalled that he would retaliate like that, which made me rethink if I should just keep waking him up if he sleeps in, as I'm already awake and I'm capable of doing it.\n\nGirl, that is definitely not what you should be rethinking right now.\n\nOthers have said it, but he is training you to do what he wants, how he wants and when he wants or else. He is not going to stop at waking him up in the morning. Next time it will be making him a lunch, since you are home and you have time. Or not making sure you know in advance what shirt he needs clean tomorrow for work. Or anything, really. He is teaching you to be controlled.\n\nI say that because instead of rethinking a man that would blow his nose on your towel as retaliation, you are rethinking whether it would be better just to give in and be his mom.", ">\"if you are awake and capable of helping out, but you decide not to, then you are an a-hole\".\n\nHaha, no. He's a raging asshole here. He wants to frame his responsibility for waking up on time as YOUR job rather than his own. You ain't his mama. He's a big boy, time to wake up himself like literally every adult on the planet does.\n\n>I was not troubled about being an a-hole until the moment he retaliated back at me in a pretty nasty way: before leaving for work in a rush, he blew his nose on my favorite towel (leaving boogers on it) and said \"you have that white towel on the bathroom to make it look pretty, right?\".\n\nThis is wildly inappropriate, petty, and immature. Are you sure this is the person you want to spend the rest of your life with? \n\nNTA", "What a f***ing child he is. Total ass. Have an adult conversation with him about the final chance he’s getting, don’t ever wake him up again, make him buy you a new towel, & if he pulls this childish vindictive BS again, broom him. \n\nNTA.", "Sounds like my exhusband.  He refused to get up like a big boy and Mommy (I mean me, his wife at the time), had to get him up.  But gently!  I couldn't be stern with him.  God forbid.\n\nNTA!  He's not a kid, he's a grown man.  He needs to start acting like it.  Oh, and he is definitely NOT a \"good partner\" if he is doing this stuff.", "He sounds like an immature a-hole.  It is not your responsibility to make sure he gets out of bed on time to make it to work on time.  Does he expect you to make sure there is toilet paper there for him when he takes a crap?", "That is so revolting. I would honestly have his stuff packed and on the doorstep. He is a 35 year old man expecting someone else to be responsible for him getting up for work in the morning, and then when they don’t, behaving in that manner? Sooooo many red flags here, and I bet that if you sit down and have a good think, you will be able to find many more examples of this awful behaviour. Don’t accept this.", "NTA, you’re not his mother and he’s not a child, even though he behaves like one. Aside from blaming you for his inability to wake up, the bit about the towel is worrying to say the least.", "NTA. However the fact that he thinks you’re his mommy and is willing to act out in FILTHY and spiteful ways when he doesn’t get what he wants would be the most unbelievable ick for me personally. I don’t know if his mindset is something I could live with. Even if other stuff was great, that sense of contempt would be poisonous IMO. Please don’t give in - it teaches him that this is how he gets his way.", "Nope. I’ve had more than one relationship like this. I now have 2 rules:\n\n1) I WILL NOT be responsible for making sure another adult gets out of bed on time on a regular basis\n\n2) if you get up much earlier than I do, you get up at the FIRST alarm. I’m not losing hours of what little sleep I get so you can hit the snooze button 400 times. \n\nI don’t really care if someone thinks it’s unreasonable. We all get to decide what’s acceptable to us, and this is absolutely a deal breaker for me.", "NTA. As someone who press the snooze a lot, it’s his responsibility to get up on time and make his job. I could see you helping him out the first couple times, but he needs to get up himself. He’s not a child. He’s a responsible adult,…at least he should be. Not the asshole but make it clear that you’re not gonna keep waking him up that he needs to wake up because it’s not your responsibility because what happens if you get busy in the morning and forget to wake him up… is it your fault? He loses his job… it’s your fault? He’s the asshole for retaliating, but I get why he’s upset but he needs to learn this lesson now. He should’ve learned it along time ago.", "ESH. You were right there - you could have told him. And by your account you are open to helping out and it would’ve been almost effortless. You just decided not to. That makes you an AH.\n\nWhat your bf did was totally wrong too…for obvious reasons. However, since he did this after you did your AH move, you don’t get a pass in my book.", "NTA\nBut in only two months he shows you, what the future holds.....a lot of 🚩🚩🚩🚩 and 🤮🤮🤮towels", "NTA. Not even close. You live with a child.\n\nTell him if he can't get up in the morning then he needs to start going to bed earlier, because this is no longer your responsibility. Then enforce that boundary.", "NTA.\n\nEwwww. Ewwwwwww. And more ewwwwwwwwww. Who acts like that? Ick.", "Nta. It would be kind/nice/cool is you wake him up when he occasionally oversleeps. But he is an adult and if he need to get up and go to work he needs to just get up and stop playing snooze tag like a teenager.", "So if you don't play mommy and wake him up for work on time, he's going to punish you in some way?  Cuz that's the message I'm getting. \n\nIf he is having trouble getting up in the mornings, he needs to find a solution, not put the responsibility on you.  He needs to talk to his doctor, examine his sleep habits,  find a working solution... like an adult and he should be embarrassed by his childish behavior.", "My husband regularly sleeps through his alarm. But he stays up late doing homework or housework etc and he’s tired. So I don’t mind waking him up. But you’re NTA for expecting your grown boyfriend to be a grown man. Could you have, yes. Are you wrong for not doing it? No. And his reaction cemented it.", "Nta I have a lot of trouble waking up in the morning and as such I can say you earn that judgment. Mainly because if your bf needs to be at work by 8, he should probably set alarms up much earlier then 7.", "ESH. I don’t know why you’d want him to be late. Yes he needs to grow up and start waking himself up, but if you know about the problem and just ignore it? That kinda makes you an AH. \n\nI’ve had friends who have sleep issues and issues waking up. It’s not my responsibility to monitor them- but also if I happen to see them still asleep I’d help them because I care about them. \n\nYou also acknowledge that it hurts you if he loses his job so you probably could’ve nudged him awake.\n\nI changed it to ESH because he was a moron for retaliating like that and for not waking himself up. But as long as you realize there’s a problem and ignore it, that’s wrong for you to do.", "NTA. It’s only been 2 months living together, right? That’s meant to be the honeymoon phase. Cut your losses. If it happened one of twice, then fair enough. \n\nNow blowing his load (sorry, nose), on your towel because he was throwing a tantrum? Do you really want the spend rest of your life to be like that??", "NTA. You're not his mom. Can you sit down and make a list of other ways he places adult responsibilities on your shoulders or does things that make you feel like the bad guy in the relationship?\n\nFirst it's your towel, next what will it be?", "NTA. Run away as fast as you can. This will only get worse, and one day, you will wake up next to a fat slob that throws his clothes on the floor and will expect you to take care of his every need. It's obvious his mama didn't stop breastfeeding early enough, and his dad didn't show him how to man-up . Find a real man that takes responsibility for his actions and can manage to get his lazy ass out of bed when he needs to.", "NTA, what he did was disgusting.  I'd be seriously re-evaluating if this is the type of person I want to be with. Unless he gives you a very sincere apology and starts to change his ways, Run girl, run.", "NTA, it sounds more like he’s passing the blame off to you rather than that you did anything wrong", "Nta. His job requires HIM to be responsible. Not your circus, not your monkeys.", "I never use this term, but it's what popped into my head as I read through your post. \"Hell no!\" He is a 35yo grown man. He is responsible for his time. Do you think \"my gf forgot to wake me up\" is a viable excuse to his boss? Most likely not. He needs to be an adult and take accountability. NTA", "Nta, stop being his mom, you're his partner", "ESH. He has a point, you're up, you could wake him up. But also, he's an adult and should be able to wake up on his own. You are both behaving childishly here.", "NTA.  He has set you up to where you cannot do the 'right thing' by him either way.\n\nIf you do try to wake him up he is nasty to you.  If you don't wake him up your the AH.\n\nHim retaliating is just petty BS.\n\nIt's time for a conversation - He's an adult and he is responsible for getting himself up.  Ask him if he wasn't living with you, what would he be doing to get up in time??  Then ask him why he isn't doing that exact same thing NOW.\n\nHe is (supposedly) an adult.  This is HIS responsibility and not yours.  He retaliates again, then it's time to start looking at getting out because there is no respect left in this marriage.", "Run. No seriously. He absolutely is 💯 percent going to escalate his behavior. Next time you don't do what he wants the \"lesson\" he teaches won't be something you can just wash out. NTA.", "I was going to say N T A because you said you didn't have to get up that early.. so I figured you didn't. Can't blame you for not waking up to his alarms. BUT that's not the case. You are up. You could easily have said something sooner but didn't. Instead, you let him start his day off anxious about being late. I don't even think my husband sets alarms anymore because he knows I will wake him up (since I am already up). How hard is it to lean over and say \"time to get up\". Yes, YTA. It is not your responsibility but your actions do not foster a healthy and loving relationship. Its not like its an inconvenience..", "NTA, but please, tell us, how is he otherwise a 'very good partner'. This man, in the span of a morning:   \n\\- held you responsible for getting him out of bed, despite his having set multiple alarms for himself, then yelled at you, and called you an asshole for not making sure he was up   \n\\- deliberately defiled something he knows you like, in retaliation for your not having gotten him out of bed and off to work on time\n\nPartners should absolutely help each other out - If he's running late because his alarm didn't go off, it would be the decent thing for you to wake him up, and throw breakfast/lunch together for him while he's getting ready. If your partner consistently chooses to not get up on time, and has to rush to make it to work, you're not responsible for that. Also, please take this red flag - damaging your property when he's angry - seriously. Right now, he's being gross, and blowing his nose on your towels to punish you. This behavior will escalate to him doing stuff like deliberately breaking your things (like phones & tablets), throwing stuff at you, and eventually striking you to exert control.", "NTA he’s an adult and you aren’t his mom. And honestly, after what he did in retaliation, I would have left", "You are not his mother and it's not your job to wake him up. And blowing his nose on the towel is childish AF. I'd demand he do the laundry and inform him that if he ever does something that disrespectful again he'll return from work to find his stuff packed and sitting outside by the door. As it is right now he's telling you that it's your job to make sure he meets his responsibilities\n And he has no respect for you as a partner or person. You are his servant. \n\nIt's your decision to decide if you want to live the rest of your life like that\n\nDefinitely NTA", "Kick him out of bed when his alarm goes off. Tell him as a full grown adult you aren't giving any more help than that. You can also swy. \"THERE, I helped!\"", "NTA. He has multiple alarms and chooses not to wake up. And you wake him up multiple days of the week one day you don’t he blames you. Seems like he treats you like a teen boy treats his mom in the morning. 🚩🚩🚩🚩 especially how he reacted. Deflected and blamed you this is his problem and his fault. Job must be 2-5mins away if he leaves 15 mins before his shift or he loves cutting it close. That’s all him problems though.", "NTA- it’s his responsibility to get to work on time. He should set earlier alarms and get into the habit of being up by 7. Snoozing it until the last minute regularly is his problem. Not to mention that if he only lives 15 minutes away from where he works it’s even more immature to be cutting it that close. I have days I need to be in the shop by 5am to open up. So I wake up at 4:15 I wish I could sleep until 7. He needs to grow up", "NTA - as a functional adult, it is his responsibility to get up and make it to his job on time. You are not his mother nor his alarm clock. His retaliation method was childish.  Are you sure you want to spend the rest of your life with this man?", "NTA.  He's a grown ass man and you're not his mother.  If he's having trouble waking up, he needs to move his phone to the other side of the room so that he has to physically get up to turn it off.", "NTA. It sounds like you wake him up once, you shouldn’t have to give him multiple prompts. \n\nBut if he insists you wake him up each morning get creative. Maybe cold water splashed on him. Put spiders in the bed. An air horn. The sky is the limit for your new wake up service. \n\nBut if I were you my wake up service would start with putting that snot towel on his face.", "I wake up immediately on the first ring of my alarm, which usually means I’ve gotten about 5-6 hours of sleep.  Tell him to be an adult and get himself out of bed.", "I hope you are reading these comments and really taking consideration. You are not his parent. You do not run his life. The level of vindictiveness is a true color he just showed you. That won’t go away. Best of luck.", "I worry about my wife getting up on time constantly. Like OP, I work from home and she has like a 25 min drive in. So her many alarms wake me up super early and then i’m up! She keeps going back to sleep!\n\nYou’re NTA. Tell him you’re never warning him again and that he needs to rely on himself.", "Good grief.     He simply needs to break the habit of not getting vertical the second the alarm goes off.    \n\nAnd holy shit.... The boogers on the towel.....  That needs to be addressed.   Quietly and calmly if you are not both on the same page that behavior cannot ever be justified.   The relationship is doomed.   End it now before your just another statistic\n\nNTA.", "Young lady you deserve better. He’s not a adult worth partnering with.", "NTA  my roommate woke me up one time I had called out sick because she thought I would be late. I felt awful that day and had finally fallen asleep after a whole night of being sick. I told her never to do that again. I can take care of myself thank you.", "NTA the towel thing is a dumpable offense. Beyond unacceptable.", "If he wants your help waking up, he needs to not be an a hole when you help him out. His alarms already wake you repeatedly before you need to be up, which is inconsiderate, but you don’t complain - and when you DO notice he has once again overslept, you have to decide whether you want to risk him blaming you and yelling at you for not having noticed his failure to get up earlier. He could move the alarm further away so he can’t turn it off, but chooses instead to rely on you, but doesn’t even thank you for this chore he expects you to do - he instead yells at you!\n\nI say this as someone who sleeps through alarms and is always late - NTA and I would tell him you are starting this new routine where you don’t use your phone and mediate without access to a clock or speaking for the first hour you are awake, or exercising or going on a walk - whatever gets you away from him and out of being responsible (in his immature, inconsiderate, and self victimizing mind) for waking him up. Let him know you will be unable to help him and he should set another alarm he can’t easily turn off because he WILL NOT be woken up by you. When he insists you not have your mourning routine in seclusion and insists you need to build your morning around waking him up, say he gets one wake up call and that’s when you get up - if he chooses to go back to sleep that’s on him. \n\nAlternatively, start telling him “this is your wake up call, it’s 7:20, I’m not waking you up again” and maybe be annoying or wake him up earlier because frankly he’s acting like he’s not an adult and can’t be treated like an adult who is expected to run his own life. He will still get mad at you, for not letting him sleep in or the way you wake him up - there is no winning here until he realizes you are not responsible for waking him up and he SURE AS HELL should not be yelling at the person who is consistently saving him from sleeping through his shift.", "NTA leave him immediately", "Your BF is an AH. \nNTA\n\nAn adult is solely responsible for getting up on time for work. The same way he needs to wipe his own ass. This is the basics of being a grown up.\n\nHis retaliation was agressive and rude and immature behavior. \n\nYou need to make it clear that 1.Apologises for being a jerk after he cleans or replaces the towel\n2. He owns up to the fact that as an adult he looks after his adult responsibilities \n\n?? DOES He stay up late gaming?", "NTA.  He's a fucking adult and you aren't his mommy.  He can get himself up.  And tbh I would just dump his guy.", "No no no! NTA - he’s a child and he’s a spiteful child ( blowing his nose on a towel in a fit of pique - wtf?) \nSuggest he get his own place so he can grow the fuck up.", "I'd have to throw the towel out...and make him pay to replace it.", "NTA and anyone getting on her obviously didn’t read the part where, when she’s woken him up in the past, he yelled at her for not doing it earlier.* Why on earth world she want to subject herself to that? \n\n\n*And yes, perhaps she could have woken him up earlier than 7:30 on the morning in question to *maybe* avoid his wrath, but since he was cool about it being 7:25, I can’t imagine how that five minutes matters that much.", "NTA, but you could be given more context. If this is a reoccurring thing that annoys you, you should have had a talk with him sooner. It’s still immature of him to assume you’re fine with it, but if you didn’t like it, you should have brought it up with him. Still pathetic of him to retaliate the way he did in any circumstance.", "NTA\n\nThe \"retaliation\" IMO crosses a line, and shows you what kind of person he is.  If it was me I would leave now before you have kids or get married and its too late.\n\n> so I was appalled that he would retaliate like that, which made me rethink if I should just keep waking him up if he sleeps in, as I'm already awake and I'm capable of doing it.\n\nActually I think the opposite. By responding to it you're showing him that the retaliation is effective, and that would encourage him to do it next time for your next fight.", "NTA... A 35 year old should not require someone to wakey wakey him from his nappy nap. Dude needs to grow up.", "Leave, end it now.. don’t look back and don’t accept excuses… don’t waste 5 seconds of time, because before you know it, it’ll be 15 years of this and have 2 kids as well", "NTA.  You are not his mommy.", "NTA.\n\nThe asshole move is to set several alarms and snoozes instead of just getting up at the first one; especially when your partner doesn't need to wake up that soon.\n\nArguing with you over this and then tarnishing your favorite towel is also an asshole move, and is actually abusive.", "NTA\n\nHe's an adult and should be able to get himself up.  It is not your responsibility.  If he loses his job, it won't be your fault.", "NTA - date an adult and not a child. \n\nI used to pull a milder version of this with my now wife when we started dating, and she killed it fast.\n\n“If you ever want to have sex in this bed again, don’t ask me to treat you like my child”\n\nHard to argue with that.", "NTA- you’re dating a 12 year old.", "Girl you should pack his bags and leave them at the door when he comes home nta", "You’re not his mother", "Yeah no. Breaking or dirtying your things in retaliation for not being his alarm clock is bullshit and abusive.  NTA.", "Yes unless habitual", "Unlike the majority of commenters I do think you’re an asshole for not waking him up. If you were aware of the time and chose not to, that is. But him blowing his nose on your towel is psychotic lol. Is this really the only time he’s ever done anything like that? If I were you I would be willing to apologize for not waking him up but I would expect a sincere apology for yucking up your towel like that, and for him to wash it. Also for him to find another solution to waking up in the morning because it shouldn’t be on you.", "NTA. You’re not his mommy.", "NTA.\n\nLet him fall on his face. You're not his mother. He's 35 for fuck sakes. I would be embarrassed to be him.", "NTA does he want a partner or a mommy?", "NTA at all. He’s not a preschooler. He can get himself out of bed. He chooses not to.", "He should get a watch with vibration alarm.", "Maybe I'm an AH but I have no patience for waking up grown adults. Set your own alarms and wake up when you need to, just like I do.\n\nWhenever my partner asks me to wake him up at a certain time, I tell him to set an alarm. It is not my responsibility to manage someone else's sleep and schedule and I don't want to.\n\nNTA\n\nI'll be honest and say that disgusting and petty retaliation on his part would be a \"see ya later mfer\" moment for me. Nasty af.", "My gf will fall asleep throughout the day, and it's next to impossible to wake them up. Like one moment they're awake, the next moment immediately deep sleep. No matter how I try to do it, if they are asleep they are not going to wake up until their body wakes them up. I could be making food, asking them questions, anything, and they'll kind of respond but then stay lying down and close their eyes again and its like we never had that interaction. \n\nIn a very very vacuous sense, yes being able to help someone and not doing so makes you an AH. But if he's similar at all to my gf, trying to wake him up might be a waste of effort. \n\nHe's an adult with a real actual career. He needs to be able to wake up on his own, or to find some other job or shift schedule he can work later if he needs to sleep in. Overall NTA", "NTA I would tell him if he ever does something to retaliate again he can gtfo.", "Omg, so NTA!!\n\nHe is a fully grown man and getting up on time is a fundamental adult responsibility. His outsourcing that to you is reflective of a deeper reluctance on his part to take responsibility for himself. That should be a huge red flag!\n\nHold your ground. You’ve done nothing wrong.", "You’re only living together for two months and you’re already become his mom? How did he wake up before he lived with you? NTA but he is for leaving boogers on your towel.", "NTA. \n\nSorry how long ago did you have this 35yo child? Needs mommy to wake him up in time for school cause he refuses to do it himself and then smears boogers on your belongings? \n\nGirl. Take him back to the adoption agency. You can do better.", "WHAT THE FUCK WAS THAT, HE DID WHAT NOW. Fuck that, that's fucking disgusting.", "Nta. Do you identify as an alarm clock or as his mother ? If the answer is no then why are you writing this post?", "Wait...OP didn't think she was necessarily being an AH until BF deliberately blew his nose on her favorite towel...and convinced OP it was her fault he did it? NTA\n\nTalk about gaslighting. That's only a couple steps away from the abusive spouse who convinces the victim that the abuse hurts the abuser as much as it hurts the victim, and the abuser wouldn't be abusing the victim if the victim just instictively knew what abuser wanted.\n\nThe fact that OP brings up, \"he's the one paying for all the food and half the bills\" leads me believe BF believes the relationship to be transactional and reminds OP of that fact all the time. \n\nI get times are tough so if OP doesn't mind being a commodity while she saves some money and figures out next steps...but I wouldn't get too emotionally invested or expect to spend any more time than necessary seeing this guy.", "NTA. He is a grown-ass adult. He needs to take responsibility for his own actions. And he took it out on you by being a vindictive ass. You’re not his mother, you don’t have a responsibility to wake him up.", "Absolutely unacceptable. On a side note, i read about an alarm that is a mat you stand on. You have to be standing to turn it off. I’ve also read that there is some kind of neurodivergence that can cause this. Since I have ADHD myself and am mostly on time or early, I tend to be impatient with those who use it as an excuse. (Or blame others) NTA", "NTA.  He is a child.", "Did a 35 year old seriously booger over your stuff as retaliation in a purely verbal argument?\n\nNTA\n\nwhat a freak", "what are you his mom?? tell him if he wants his mom to wake him up for work he can move back home", "NTA. Your boyfriend is a grown man capable of getting up for work on time, he chooses not to and that’s on him. You need to seriously rethink your relationship with him, behaviour like what he displayed will escalate. The yelling and threatening will get worse, and the fact that he blew his nose on your towel is so incredibly disrespectful and disgusting, not to mention completely juvenile. What is he, 12? Good Lord.", "Plug in an alarm across the room. At 7am, he has to get up to turn it off. \nOr ice cold water bath after the first alarm. Claim it's the only way to wake him up.", "NTA\n\nThat's a break up offense, girl. He acted in a disgusting and juvenile manner to punish you for failing to do something that isn't your job in the first place. He's showing you that unless you cater to him and take care of things for him without him asking or being grateful, you'll be punished. Listen to him, before it becomes something a lot worse than a ruined towel.", "NTA.\n\nYou are not his mother and he is a grown man and incredibly petty one at that.\n\nLook my husband will gently make sure I’m getting out of bed in time to go to work when I’m feeling sluggish, but I fully acknowledge that it’s my responsibility to make sure I’m on time for work and I tell him that I appreciate his help.\n\nSit down after your both calmer and fed (you don’t want to be hangry having this conversation) and have a conversation about both of your expectations as clearly there is a miscommunication. What you decide to do after is up to you.", "NTA. He is weaponizing his incompetence and making you his Mommy. Nip this in the bud now. He’s a grownup and grownups wake themselves for work.", "NTA!  OP,  why is he living with you?  Did he come straight to living with you after living with his parents?  \n\nPlease have him move out immediately ... if he wants his \"mommy\" to wake him, then he needs to live with his mommy.  There are so many things here that bother me:  slamming the door *(what if you are on a call?)*, the nose blowing into your *(WTF, he is 35yrs old!), etc. W*hat did he do before he moved in with you????\n\nP.S.  At his age (35m), this would be a deal-breaker for me and I would evict him with the necessary notice.  He already had enough chances ... he was angry from previous incidents of you not waking him and has not made any effort to change nor accept personal responsibility.", "NTA and your bf definitely is TA for blowing his nose on your towel. Although it did make me laugh. Someone I know once put kitty litter on their husbands office chair during a fight, so blowing your nose on someone else’s towel seems slightly less creative, albeit just as gross and mean-spirited IMO…\n\nFor the record, I don’t believe in retaliation or punishing your partner. That sort of passive aggression definitely borders on abusive, depending on the situation. If this is a one-off and you feel like he understands that it is pretty nasty behaviour and is remorseful, I think you may be able to move past it. \n\nYou two definitely need to have a conversation about expectations in this situation. It seems like your bf expects you to be his alarm, but hasn’t asked you if you’d be ok with doing that for him. \n\nI think it is reasonable to ask a partner to wake you up at a certain time. For example, when I have a nap or if I want to sleep in on the weekends, I sometimes ask my partner if he could wake me up around a certain time. I usually also set myself an alarm in case he forgets. \n\nHowever, if he doesn’t want to do that for whatever reason, I have to accept that and make my own plan for waking myself up. It is fine for him to say no and it doesn’t matter if he “could”, that doesn’t mean he’s an asshole if he doesn’t want to wake me up.", "lmao what a piece of shit. NTA.", "Nta. He doesn’t wake up to his alarm, often snoozes but it’s your fault he’s late? My love, unless he’s also a unicorn he’s not actually the dreamboat you want him to be . He’s a dick who doesn’t take responsibility for himself and then is abusive because he couldn’t get out of bed. Not great at all.", "NTA he’s a grown ass man. He can get himself out of bed. I hate this shit- putting your responsibility on your partner is below the bar honestly.", "NTA! This guy is a grown man. He is 35 years old and he can't get himself out of bed on time? That's not your problem to solve. It's also really nasty of him to try to ruin something you like to get revenge. \n\nIt is his responsibility as an adult to get up on time. Period. You are not his mommy and he is not a child, even if he acts like it.", "NTA\nHe's not sleeping through alarms, he's turning them off and going back to bed.  He's a self centered prick that expects the world to revolve around him and his irresponsibility.  Then he punished you for his laziness.", "Girl, not only are you NAH but that last move on his part is beyond petty, he’s behaving like a child, adults take accountability for their OWN actions. I know it’s a Reddit knee-jerk at this point but this is not a sustainable or healthy relationship.", "Punishing your partner for feel slighted is sadly not that rare in men but damn is it a red flag. Wtf.\n\n\n\nHe acted disgusting.\n\n\n\nHe also is gernally getting up to late.\n\n\n\n\nNTA but no... good partner looks different.", "Tell him he is a grown-ass man who is capable of getting out of bed on time. Put the alarm by the bedroom door or somewhere he can still hear it but has to get up to turn it off. NTA", "NTA. Omg, I don’t even know why you waste your time with him. What is gonna happen if and when you’ll have kids? Hope you are not considering to procreate with this person, if he cannot wake up without kids can you imagine the nightmare after having them? Jeeeeeezz", "> I was appalled that he would retaliate like that, which made me rethink if I should just keep waking him up if he sleeps in.\n\nThis should make you rethink if you actually want to be with him. Someone who acts this way is a child and will only get worse when things don't go their way. You should get out now. Not only because on the nose blowing, but because of the yelling when you try to wake him up, the slamming doors when he's angry, and the fact that he calls you an asshole for not doing what he should be taking care of. He is paying what you mentioned, for now, but he's only 2 months into this job and I promise when he loses it due to his tardiness or his attitude, he will NOT get better. You'll be paying everything, he will be making every excuse as to why he hasn't found a new job and you'll be responsible for tiptoeing around his bruised ego.", "NTA, what would he be doing if you’re not there? It’s ridiculous that his alarm wakes you up but not him and then you’re expected to wake him up. He needs to grow up and wake up when that alarm goes off.", "NTA. He’s an adult and needs to act like one. Do you want to babysit him the rest of your life?", "Believe him now that he showed his true self and the red flags that go with it.", "NTA. You are not his mother, and he is expecting you to take responsibility for him. Retaliating that way was both disgusting and unbelievably immature.", "NTA and yuck, what a disgusting and aggressive action, run for the hills. He sounds like the classic \"you triggered my anger it's your fault\" type of abuser.", "Probably should have", "You’re not his mom! He is 35 years old! Unbelievable!\nNTA", "I'd break up with him for that disgusting retaliation. NTA. Your BF is a freaking baby. I have a hard time getting up for work and my husband will help me out but I would never get mad if he didn't. If you're not ready to dump him I would inform him that after his behavior you will never wake him up for work again.\n\nYour BF doesn't, and never will, respect you.", "ETA\n\n> If you are awake and capable of helping out, but you decide not to, the. You are an a-hole.\n\nThis is the explanation of why I think you’re an asshole. You purposely decided to not inform him to teach him a lesson.\n\nHe is also an asshole, a child one, because he soon retaliated against you.", "NTA - and it’s time to maliciously comply!! At 7 you wake him up by ripping his blanket (sorry. Non english native…) off and stand there with a water gun telling him to get up or else. Make him some kids serial and pack him a lunch box and then kiss him on the cheek when he leaves and tell him to come home straight after work and be a good boy. \n\nSeriously. If he don’t take the hint just kick him out. Blowing his nose as revenge?! Not even my 5yo does this anymore!!! Not partner-for-life material!", "So are you supposed to never go somewhere early or stay with a friend for the night? After all, it’s apparently now your responsibility to get him up and to kindergarten, sorry I meant work, on time. \nHe has time to get your towel and blow his nose, but not enough time to grab his toothbrush and brush his teeth instead? He’s trash.", "NTA, I’d this was one of the first few times I’d say Y T A but he only got this job 2 months ago and this has already happened multiple times? His terrible time management isn’t your problem and imo he needed something to go wrong to realize how much more seriously he needs to take the situation.", "I am just trying to make sure I am getting this right:\n\n1)  You have no reason to get up before 8:00 (or later) in the morning,  but you regularly do because your bf's \\***multiple**\\* alarms awaken you.\n\n2) In the past,  when bf's multiple alarms have awakened you, and yet he still does not get up, you have awakened him so that he can get to his new job,  and his response was to yell at YOU.\n\n3)  After you became gun-shy from the yelling and thus did not tell him the time as he dozed, when he awoke, he yelled at YOU,  called YOU an ahole,  and then punished you further for HIS error by damaging (temporarily) something that belonged to you.\n\nAnd now, OP,  you are wondering if YOU are the ahole?  Nopety nope nope.  NTA.  He is gaslighting you  (making you doubt the reality you know to be true--  which is that it is HIS repsonsibility as an adult to get up on time...).  You should not tolerate this.  You do not have to break up with him over this single thing,  but you should not tolerate this kind of behavior (1, 2, 3 or gaslighting).  And you should really try to look at the relationship objectively and figure out if it really is just this one thing or if there are lots of other red flags that you are dismissing.", "NTA - if it were me, I’d tell them up front I’d wake them up if they didn’t get up on their first alarm. Otherwise if I’m able to (cause you got a life/work) and I notice it’s 7:30 and you’re still not up I will, but I can’t be responsible for you going back to sleep\n\nOn a total side note, his difficulty getting up in the morning and repeated excessive “snoozing” could be signs of a sleep disorder. He may want to talk to his Dr and possibly do a sleep study", "NTA time for another Reddit divorce", "Please get out. Anyone retaliating on you for their own stupidity will only get worse the longer the relationship goes. \n\nNTA", "NTA. Your bf needs to grow up and become more mature. That includes taking responsibility for his own actions, such as not getting up for his work. Blaming your for his actions is not acceptable. Retaliating against you is not acceptable.", "Nta. You are not his mother waking him up for school everyday. He is a grown man with a job.", "You need to sit him down tonight and call out just how 100% unacceptable his behavior was today. Don't name call. Don't debate. Stay calm. Just state: \"you will not treat me like this again. This is not the type of behavior I'll tolerate in a partner and if it happens again, I will leave\". It's then his responsibility to do the hard work, learn, and grow up. Or not. But it is not your fault.\n\nI had to have a similar conversation with my now-husband. He realized I would walk away and he couldn't treat me like his friends treated their girlfriends. It is hard, but worth it", "Y'all want to give him another chance? No thank you.\n\nHe already had several strikes of not being kind to her when she was the one doing *him* the favor, but now that he retaliated in such a way, that's game over. There's no unringing this bell - he's a disgusting asshole with no possibility of redemption in my eyes. \n\nA punishment?!? for your partner?!? that's textbook abuse in anyone's eyes.", "He's also deliberately playing with words here. It's good and healthy for partners to help each other out when in a time of need. Like, if he forgot to turn his alarm on, or exceptionally didn't hear it. \nBut he is basically asking you to be responsible for him waking up every day. He's setting this up as being the new normal. \n\nAlso him retaliating is super nasty (both literally and figuratively).", "Agreed. This crossed the border into potential abuser when he retaliated. “If you don’t do what I want, I will ruin a thing you love.” And it really is just what he wants, since he was surely capable of waking himself up before OP moved in. At least it was just a towel this time. I could see it escalating to OP’s clothes, then violence toward OP or a child or pet. \n\nNTA but OP please move out now and dump this piece of trash.\n\nETA: I missed the part where it’s OP’s place, so yes, OP should be kicking him out, not moving out herself! Imagine moving in with someone and then intentionally ruining their nice things.", "I have a theory that you're from US, and everyone with the same opinion too, are you? It's just something I'm noticing on reddit and would like to know if it's true", "NTA 100%. It’s one thing to be a bit annoyed that your partner didn’t wake you up - unreasonable, and it’s not your responsibility to do it, but sure, I can understand it. But to retaliate like that is disgusting and childish and I would be really surprised if there weren’t other red flags with this guy. No otherwise normal and mature person would respond that way.", "She's not his mother....", "Yes, when someone shows you who they are, you'd better believe them.", "Nta for sure. Tell him he is grown and needs to manage his time. The way he responds to that will tell you if he is worth keeping.", "How is that a burden?? She is in bed, interacting with him already. She wakes him up already by simply saying what time it is, she just chooses to do it only when he is already late", "Even my 6 yr old wouldn't retaliate this way. He has no respect for her.", "yeah like if there was an accident and no alarm went off bc phone died/wasnt charging or something, then youd be an asshole but IGNORING and turning it off everyday is not a mistake! \n\nBUT even then if there were 10 *genuine* mistakes in a row: get it together dude wtf! NTA", "He's not even an asshole, he's a 35 yo LOSER who can't even get to his job on time.", "yeah, his retaliations will only get worse\n\ndon’t tolerate it \n\nnta", "This sub is the most overreactive group of children that always tell the OP to break up or get a divorce, but holy shit he blew snot on your towel because you didn’t wake him up hard enough? I might join the divorce train on this one.", "As an engineer this is a total load of crap. Our jobs are not so bad we can’t be nice human beings. He’s tired bc he doesn’t go to bed on time. That’s on him. If my spouse snorted on my towel like that their ass would be on the curb. If they did it before we were married we never would have gotten married. What the hell is wrong with this dude?  OP you can do better. Please do.", "You could just read the post lol, she literally mentions he pays half the bills and all of the food", "I could maybe overlook the asking to be woke up thing, *if* he were only setting one alarm and had a tendency toward being a heavy sleeper. But blowing his nose on my towel? \n\nI know people sometimes have to take care of sick partners and see some gross stuff, but this is literally like one of my sister’s kids throwing a tantrum. And I’m not sexually attracted to children.", "She said he pays for food and half the bills. So not rent free. Doesn't make it better, actually makes it harder to kick him to the literal curb legally, but FYI.", "Yeah, if my husband wants to make SURE he wakes up, he asks me to set an extra alarm and wake him up. I am a marathon snoozer, so he knows the best he'll get is a tap on the shoulder, a hug, and an announcement of the time, and then I go back to sleep.\n\nAnd vice versa if I need to wake up. \n\nBut this is an occasional occurrence. If I oversleep, he lets me. Because it's my responsibility to get up on time.", "> I checked the time and it was already 7:37. I look at him calmly, he smiles, and I ask \"do you know what time is it?\", to which he answered \"probably 7:25 or so\"\n\nThere is no lie in that statement. She just asked him if he knew what time it was. She didn’t lie about the time", "How did she lie???", "... you completly ignore that he screams at her when she does \"just say\" something...", "i hope you’re joking", "That goes right out the damn window when she wakes him at 7:30 and his response is anger and blaming her for not waking him sooner. His second alarm was at 7:10. He's showing zero effort to try and prevent himself from tripping in the first place.", "He blew his nose on a white towel like a lunatic. NTA", ">why cant you nudge him and tell him what time it is before it's too late?\n\nBecause in the past he would still be angry with her for \"waking him too late\" at 7:30. She was being helpful. He was being rude. What possible reason would anyone have to continue helping someone and only be met with insults and anger?", "So much this. Sure, he's an adult and should be getting up on his own but is it really any skin off her back to give him a little nudge and be like \"it's 7:30 you should get up\" if she's already awake?", "That’s what turned the story for me. At first I thought OP was a bit of an AH for not waking him up even though she could have (not that it’s her responsibility to do so, but if it’s easy and a nice thing to do for someone you love why not?), but then his reaction was way over the top.", "And will be useless trying to share parenting duties one day", "Definitely a hill to die on because if OP gives a pass on this he will know he can do this disrespectful bs whenever he wants.", "[removed]", "I'd have a calm conversation with him about this and let him know you won't be responsible for him getting up on time.", "Especially if you retaliate in such a childish way.", "And he is THIRTY-FIVE, well past the age he should be getting his own lazy ass out of bed.", "100% agree. My bf is terrible at sleeping through his alarms for work. He’ll set 5-10 alarms and has missed every single one of them before. We agreed that if he missed his alarm, that’s on him. I will admit, more often than not his alarms annoy me, so I’ll wake him up. \n\nYes, we talked about this and have since come up with a solution that works. \n\nLong story short, OP, def talk to your bf about this!", "I agree.\n\nHe's not a good partner \"otherwise\". \n\nThe blowing his nose on your towel is so disrespectful that if you stay, you are communicating  with him his behavior is acceptable. \n\nLeave!", "He’s already gotten mad at her in the past for waking him up but not early enough for him to get ready. And now this? There is no future with him - things will only get worse the more commingled their lives get.   \n\nUnless I’m misreading the post, she was living there and he moved in after getting a new job. So nothing  will change considerably with her life if she gives him the boot. Except having to go back to paying all the bills she seems to have been paying just fine. She’ll lose that half of the rent, but also lose 200lbs of totally unnecessary baggage.", "Right there with you. He's shown who he is and she needs to pay close attention. This is aggressive abusive behavior. He is making mistakes and blaming her, then retaliating when she won't comply with his demands. No discussion, no compromises, no gratitude. He can pound sand.", "So, in other words, you think the BFs behavior is appropriate, then?", "That and the multiple alarms. He’s making himself tired because his body is just hitting a good doze again when the next alarm goes off. Just set it for the latest time and go to bed at a decent hour.", "Right??? Where’s the lie? And it was all of 12min later than what he had hoped. Someone who cuts it that close and got super angry about those extra 12min is not going to become a responsible adult anytime soon.", "Apparently he is an adult who is INCAPABLE of getting up on time. But I completely agree with you - she's not his mom and that's not her problem.", "And get yelled at again like all the times before? Her efforts to help him in the past have resulted in him yelling at her. Thanks but no thanks.", "This right here, if OP wants children, this is not the type of man to go down that path with.  Could you even imagine?", "Redditors try not to turn \"He's not a morning person and has trouble waking up\" into \"He'll be a terrible father, proven facts\".  \n\n\nHes was lazy, and a jerk for it. Op coulda nudged him sooner, but its not their job to, and unless they purposefully stared at the time knowing he needed to be up at 25 and still wasn't, then its not their fault he didnt. Its nothing deeper then that, lets not act like we know his brain based on one singluar post from someone else.", "[removed]", "Agreed! I'd suggest next time his alarm wakes you up, get dressed and go a 45 minute walk. Bet he'll get up at his second alarm if you're not there! Maybe drop a few \"I'm thinking of going for walks to start my day off with some fresh air\" in the days before, and leave a note just so he's not worried where you are (don't wanna make that an argument!)", "Bot. Stolen comment", "I usually have to wake up earlier than my husband. I use a vibrating alarm so I don't wake him up. That's how that works.", "And it's deliberate, premeditated disrespect. He looked for something of hers that he knows she has just because it makes her happy to have a nicely decorated bathroom, and he tried to ruin that to teach her a lesson. I'd be willing to call that more than just disrespectful, that's malicious.", "Absolutely. His behavior will escalate.", "I think it's disgusting, if I was him I would just not talk to her for days and really think if I want to stay on a marriage where my partner can't even help me with saying \"hey, it's 7:30, good morning\" something that wouldn't be any trouble at all. To me ESH both of them, but I can't find my comment  to edit 😭", "Technically, if OP wants children she’s already got one", "This is exactly what I said! I just read your comment and I totally agree.", "Don't even have to imagine, we see posts like that almost everyday!", "Bot. Stolen comment", "@botcatcher", "You are absolutely correct", "And now you have met who he truly is.  An immature thirty something man who still can't wake up on time without someone to nag him out of bed.  He is an adult who is responsible for waking up on time.  He doubles down by being nasty with you if you wake him up (verbal abuse) and if you don't wake him up (blowing his nose on your pretty towels).  Act accordingly.\n\nNTA, except if you put up with this treatment.  Don't accept cruel behavior.", "NTA. He's blaming you for his inability to adult and then retaliating by ruining your things. This will get worse, because guess what happens if he turns up late too many times and is disciplined at work for it? He's going to go straight home and take it out on you. Or guess what happens if something unrelated to his tardiness happens? He's going to find a way to blame that on you too.", "This gave me the ick and I don't even know him. \n\nSuch disturbing behavior.", "NTA. He needs to grow up. \nIf my husband ever retaliated to me I’d leave him! Sure we argue and sometimes regret things but he’s never done anything deliberately meant to upset me like that. \nYou don’t go out of your way to hurt people.", "NTA. And now you know how he acts when you disagree: he destroys your property. That's abuse.", "Nta. He blew his nose on your towel to get back at you??? Wtf that’s absolutely a disgusting thing to do. If my boyfriend pulled some shit like that he’d be single so fast his head would spin. The disrespect is just wow.", "NTA\n\n\nIF a grown man of **35** can’t wake up fully by the alarms he has set, this is **HIS** problem, NOT YOURS.\n\nYour BF needs to learn to get himself up in time.\nHis retaliation was childish and gross.\n\n\nIf you feel that this is a relationship worth working on, then tonight you need to calmly sit him down and communicate you will not tolerate being expected to wake him up.\nBeing on time for work, getting enough sleep, is ***his*** responsibility.\nHe should consider, *with your permission*, setting alarms earlier to be up earlier so he can get ready for work without rushing around.\nHis disrespect of blowing his nose in your towel will not be tolerated and he needs to do the laundry, *at a minimum*, to make up for that.\n\n\nINFO OP: You said he pays some bills and buy groceries, but what else does he do?\nDoes he cook? Clean? Do Laundry?\nAre you expected to do all that because you work from home?\n\n\nYou need to make him understand that you are *not* his: mother, nanny, keeper, maid, personal chef, assistant or whatever.\nBeing a couple does not mean that you need to take care of him like he is your child.\nHe is a grown adult and it is past time he starts acting like it.\n\n\nTime for you BF to grow up!", ">I get that we are a couple and should help each other\n\n**NTA.**  Yes, couples should help each other...**also**, grown ass people should be able to get themselves up for work. If it was a rare occurrence, it would be nice for you to get him up.  But it seems like he relies on you to be his back-up alarm clock, which is not your responsibility.  \n\nPersonal story: My husband was like this early in our relationship.  Multiple alarm clocks that he conditioned himself to ignore.  Then he'd rely on me to get him up.  After a while, I got annoyed and told him that he needs to be an adult and get himself up.  He has been great since then - I've helped him out a few times (and he has helped me), but I am happy to do so now that it is a rare occurrence.", "Had a roommate like this once. He slept like a dead man. He asked me to make sure he was awake(not out of bed, just awake). I left work at the cafeteria and went to our room to wake him up. He looked me dead in the eye and said “I’m awake, AH”. I left.\nCame back after my shift to get ready for my late class. He was still sleeping. 4:00 PM for gods sake. He heard\nme come in, jumped out of bed and cussed me for “making him miss his final. F U dude. Grow up.\nSame for your partner. Grow up and go to bed sooner.\n\nDefinitely NTA", "NTA, but living with one. It is absolutely not (and never will be) your responsibility to get his ass out of bed for his job. The disgusting retaliation? Abusive. This will escalate. I was with someone who would threaten to break things of value to me if I tried to walk away from an argument. It escalated beyond that. He never “beat me up,” but he was working toward it and did his next girlfriend after we split. Please don’t invest more of your time in this guy. There are actually grownup, thoughtful men out there who will *add* to your life, not make it more difficult.", "NTA - he is an adult who is responsible for managing his own schedule. You don’t need to be up early, so it’s not like you’re up everyday letting him sleep in. And even if you were, still on him. Plus, he was awake! He looked at you and smiled. \n\nHe’s also disgusting. Snot all over your towel because he’s having a tantrum. Is he a baby? Even my toddler knows better than to do that and can use her words. \n\nSeriously, I would sit sit him down and say his behaviour is completely unacceptable. If it ever happens again, he’s gone.", "NTA\n\nIt is NOT your job to wake him. He is an adult, and needs to get HIMSELF sorted out to get to work on time. \n\nBut his response when angry with you genuinely scares me. What he did is not the actions of a loving and sane person.\n\n🚩🚩🚩🚩🚩🚩", "My wife and I wake each other up if we're already up and notice they slept in, but we've already got a family and nothing is ever 50/50, that's part of what we do...but to retaliate like a child is a no. Absolute no. My wife is my backup and I'm hers, but if stuff falls through it's not the backups fault. \n\nDon't blame the safety net for breaking when your dumbass dives headfirst into it\n\nNTA", "I’m sorry… he did WHAT ?! \n\nAdults don’t retaliate? And retaliate for WHAT? Notice how you DID tell him the time. You did tell him he was running late. That isn’t enough? You somehow have to tell him he’s ABOUT to be late? When he knows he hit the snooze on his 7:10 alarm? \n\nIt IS an asshole move to let someone be late when you CAN help. But you’ve been doing this ever since he moved in. And you DID tell him the time. He just wants to blame you. You’re his scapegoat. He needs to stop doing this to you or you guys won’t last much longer.", "*Adult men are perfectly capable of caring for their own responsibilities.* Every story like this is an NTA. He chose not to be responsible and dump it on his partner instead and got pissed when his own inaction had consequences.", "In general a very good partner? Disagree.His stuff would be outside the door when he returned.", "Your boyfriend is ***decades*** too old to blame anybody but himself for not getting out of bed in time. Maybe he should stop that snooze button nonsense and just set the alarm for whenever he actually needs to get up. When you sleep together in a room with somebody who could stay in bed longer that would actually be the considerate thing to do, but that doesn't seem to be his thing. Blowing his nose on a towel, let alone your favourite one, just adds to the childishness of his behaviour.\n\nNTA", "NTA- since when did you become his mom?   HE is 35yo, he should be able to get up and off to work on his own. HE needs to learn this.", "He is trash.", "You were the asshole up until he blew his nose on a nice towel. How childish. \n\nYou should be willing to help eachother out... But if he acts that way, you don't owe him too much until he cleans that act up first.", "ESH. Where's the communication? Seems like there should have been a conversation, \"When you yell at me when I wake you up it makes me angry. So I'm not going to wake you up at all anymore. Don't rely on me.\" \n\nBut he's seriously TA for retaliating. That's such a move a 9-year-old would do. \n\nThat said, I've been married for 22 years and my husband knows I can sleep through any alarm imaginable. He's always had my back to make sure I don't miss important meetings (since we work for ourselves in a business I run.) It seems like you guys, if you're going to stay together, need to work more like a team. Maybe waking up to an alarm is something your partner will never be good at--can you live with that?\n\nMaybe he can learn to not get angry at you for helping him get up. Maybe he can stop throwing tantrums if he's running late. Maybe you can make sure you're not deliberately letting him run extra late. But at any rate, communicate.", "You need to Run! 🚩🚩🚩🚩🚩", "I am like your BF. I have multiple alarms, love to hit snooze, and never get up on time. \nHowever,  I know that this is a ME problem.  I'd never get mad about my early bird husband not waking me up.  \n\nThere are apps that will make horrific noises and make you solve math problems or physically get out of bed to scan a bar code to shut it off.  He's a grown adult and needs to solve his own problem here. Especially if he gets angry at you.\n\nHuge NTA!", "NTA he's a grown man your not his mother.", "Jeez people how can you instantly Resort to divorce or seperating. There is a thing called working on things together instead of having a counter reaction to every small incident… NTA still would it be much effort for you to wake him? Would it affect you negatively? Could you maybe talk with your Partner how you feel? Maybe he would greatly appreciate it, maybe you can make a morning routine out of, maybe you should seperate all is possible but definitely talk. A thing we seem to forget how to do it.", "I’ve been the alarm clock for my husband for 35 years. If there is a hell, it will be a room full of people I have to set alarms to wake up.  He is not easy to wake up, although he has been trying to be better about it the last few years. I’ve dozed off and he’s been late because of it. My advice is Do Not Become his alarm clock.\n\nedited to say, if my husband ever pulled the stunt yours did, he’d be sleeping in the car. And god knows what I’d be wiping with his towel.", "It sounds like he is laying in bed hoping to get some morning booty smiling and nodding at the gf from bed still", "It’s not your fault he’s late so NTA but it wouldn’t hurt to help him out now and then. He definitely shouldn’t be blaming you, but I just could imagine watching my husband sleep in knowing he’s going to be late for work. \n\nThis is a partnership and I want to see him succeed, if he needs my help every now and then so be it.", "You lied to him. All you had to do was tell him the correct time. YATAH", "I have a housemate like this. It's like trying to wake up a corpse, nearly impossible, and you're the bad guy for waking them up,  but also the bad guy for not waking them up.\n\nWe learnt how to wake up and get ready on time back when we were in highschool. He's a grown ass adult and you're not him mother\n\nNTA", "NTA. HE’S the adult and it’s HIS job, HIS responsibility. No way are you under any obligation to wake him or make sure he gets to his job on time.\n\nAlso - if my partner retaliated in such a way I would be LIVID. Leave him - he is a child", "No explanation needed. He’s TA, not you. He’s 35 years old, he should have been capable of getting himself up like a big boy for 20 years at least. Never wake him up again. If you do it puts the burden on you, as he has shown.", "“hes a really great guy but retaliates on me when hes mad and now im thinking i should make sure i do what he wants so he doesn’t get angry”\n\nThats what im getting from this post.", "Nah, I hate people who have 10 alarms and never get up to them NTA. Youre not his mom", "Honestly, your boyfriend blowing his nose on your towel to retaliate is grounds enough to break up with him. He *retaliated* in a, in my opinion, aggressive manner. There’s no place on earth where retaliation is ok between two people in a relationship.\n\nEdit: NTA but your boyfriend is a major AH", "He is absolutely not a good partner. He’s, in fact, a terrible partner.", "How stressful. Imagine being the timekeeper forever and always. NTA", "“ I noticed you started relying on me to be your alarm clock, and I don’t wanna do that because you’re a grown ass man and I might be working and not paying attention to the time. So maybe you need to get a second clock or with your phone across the room but I won’t be waking you up anymore.”", "What kind of person acts like him?! Kick him out. Today. That is unacceptable behaviour. And no, you are NTA for not mothering him. He’s a damn adult.", "NTA.  He's irresponsible and a dick.  You know what to do from here.", "Every morning I yell “it’s 6:15!” And then “it’s 6:30” and then “ITS 6:45 YOU NEED TO HAVE YOUR ASS OUT  OF THE SHOWER BY 7!” \nAlways thinking about how I never wanted children and here I am, yelling at at a 60something year old to get out of bed! \nHowever, if I don’t wake him and he’s late, he is very aware that it’s his fault not mine. \n\n\nOP is NTA", "NTA. This guy sounds like a toddler.", "Nah I'm gonna say here YTA.\n\nI don't know why people act like its some kind of lack of responsibility to miss an alarm - some people are just heavy sleepers, or struggling getting enough sleep, through no fault of their own. Add to the fact OP, is in a relationship with this guy, apparently loves him, but knows he is going to be late and purposefully sabotages him despite being able to STOP him from being late in the first place?\n\nYTA.", "You could have woken him up. What is the big deal? If he would lose his job than You stuck paying all the bills. Both of You need to grow up or leave each other alone", "YTA. Relationships require some give and take. You had no reason not to wake him other than spite. You should probably live alone.", "YTA and he needs to grow up. When you knowingly screw someone over, yeah that is the definition.", "While he is an asshole I think that there would have been no harm in you waking him up. You know how long it normally takes him to get ready and go. If 37 after was not enough time then you should have waken him up and it was some spite in you not doing it.", "YTA if you knew what time it was and let him sleep.  You said you weren't \"really\" paying attention to the time, but only you honestly know for sure.  Dude obviously has trouble waking up and being functional.  Be a team or don't, but you need to make a call on this and go with it.  Don't help him sometimes, and not others.  Be consistent.  Either way put the towel in the wash and move on - he was clearly in panic mode.\n\nWorst case he needs to set a 7:15 alarm out of reach so that he has to physically get up to turn the alarm off.", "Both the AH. Being a couple is a partnership. No one is good at everything. Not noticing the time is fine but if you knew the time and decided not to wake him up then you arent helping your partner. You are intentionally causing and issue and either looking for a fight or tired of helping him. Either way it's a problem and it hurts the trust he has for you. My spouse is a hard sleeper and I work from home early. Have to wake her up all the time.\n\nHim retaliating like that is also pretty bad. He should own up to his mistake of sleeping in. Also throwing the towel in the wash is an easy fix. \n\nDon't listen to reddit about breaking up over this. A simple conversation can resolve the issue. If you break up then it is likely for something more going on in the background.", "This, and anyone that sets multiple alarms, is a lazy bum. If you need the extra sleep...set the alarm to that later time. Why keep having multiple alarms going off or hitting snooze 20x? He's 35 and has created a terrible habit that will continue on, not something that I know I would want to live with for the rest of my life. He needs to grow up and learn to be an adult (17 years late, but whatever) and not rely on mommy to wake him up. He can't wake up on his own that's his fault, not yours nor your responsibility.\n\n&#x200B;\n\nNTA", "I mean your not an asshole but youre not a great partner lol.\n\nIf your partner (your *PARTNER*) is sleeping when you know he should be waking up, isn't it a thoughtful idea to help the person out and wake them up?\n\nLike if YOU were in the situation wouldnt you want him to wake you up?\n\nI wouldnt call you an asshole because its his responsibility.. but I wouldn't exactly say your the best partner..\n\nIm in disbelief nowadays where theres such a problem with helping out your own partner. Like what helps him HELPS YOU & vice verse what helps you HELPS HIM. but whatever lol dont help him i guess", "YTA \n\nYou were woken up by his alarm but didn't wake him. Normally I would say he should be responsible for setting an alarm but he did. I'm sure he works a demanding, high stress job. You're partners which means you're a team. I understand that this was probably a one time thing, you made a mistake.\n\n You're human, it happens. That being said, don't make the same mistake in the future. He could lose his job which could ruin his career. I'm sure he works very hard to help support the life that you're making together. Do better in the future.\n\nEdit: I'm changing my vote to ESH. You didn't wake him up when you could have but his behavior was childish and uncalled for. Does he treat you like this all the time? Was this a one-time thing of you not waking him up? If it's not, he could be feeling some resentment like you don't care about his career meaning you don't care about him and his mind. However, his behavior was still inappropriate and uncalled for.\n\nEdit 2: I'm still going to say ESH but I mean come on, you said it yourself that he's paying for all the food and all the bills meaning he's supporting you. You should have made sure that he was up for work on time. I think that you guys should sit down and really have a discussion about this.", "YTA - why can't people just do nice things for people they love especially when that person has a hard time with it?", "YTA\n\nIf he loses his job, you guys both suffer.\n\nThis isn't some boss bitch shit of \"it ain't my job to...\" like he's your BF. Help him get out of bed.\n\nWhy would you risk that? Sure he could get up himself but he has you to help him out. \n\nLike wtf?", "I wouldn't even deal with someone's alarm going off next to me & them hitting snooze, even once. Because it makes it hard for me to go back to sleep-- I'm wondering, \"Is this person getting up? How long til the alarm goes off again? Are they oversleeping? What should I do?\" So I make my partners get up quickly & quietly if they have to get up before me.", "Blowing the nose in the towel means it's time to break up. Don't wait to find out what he's capable of, it's not worth it. There's better men out there and he needs help that you can't provide.  \nLove to know if he is has apologized yet or if he is sticking it to ya still, thinking he was right. \nObviously NTA", "The abuse will only get worse from here.  He just showed you that he doesn't respect you at all.  He retaliated in a very disgusting way for something that is his own fault.  He has temper tantrums and punishes YOU because HE doesn't get up when HIS alarms - not ONE, but TWO go off.   Someone who would do that and expect everything to be fine is going to be a good damn terror if *you* actually did something (probably *anything*) that he doesn't like that *wasn't* his fault.  You need to evaluate again what you mean by \"in general a good partner\", he sounds like the type of guy that will scold and belittle you for next to nothing.   At the very least set a THIRD alarm on his phone and tell him the ball is in his court because you won't tolerate that behavior again.  I hope you never have kids because now you know you'll be doing it all.", "Going against the grain with a ESH.  He needs to grow up, but you also plainly saw the time and lied to him as punishment for previous outbursts.  Both moves were childish. If you wanted to draw a line in the sand about *not waking him up anymore* this was not the right time or way. \n\n\nIn successful relationships, people don’t punch down on their partners - they communicate boundaries and take the bad with the good. They help each other succeed, which sometimes gets frustrating as this may require accepting your partners flaws. \n\n\nI for one am a bit like your partner- mornings are the worst thing ever for me and I’m liable to be a bit of a grouch until 1030-11. Everyone in my life knows this about me, and based on your writing, so do you for your partner.  I’ve always told people to not wake me up, so only I can be accountable for this flaw. I’d be annoyed by his behavior too, no doubt! Some people pound the snooze button way too much, and need to work on their morning routine. What you did was petty.", "YTA if you can help your boyfriend not to be late then you should.", "I don't think it's quite that black and white. I think all of the following are true:\n\na.) Ultimately, it's his responsibility to get up on time to go to work.\nb.) If he asks you for assistance in this, it is totally within your rights to decline. See a.)\nc.) But it's also weird that you'd be in a relationship where you are living together and not automatically *want* to help him wake up, if not for his sake then at least for your combined finances. \nd.) Unless this is a hill you're willing to die on and uproot your life over, helping someone wake up for a job they depend on isn't a very big deal I'm the grand scheme of things. Couples who live together do favors for each other sometimes.", "Yes. Couples help each other out. If that's a concept you struggle with then I feel sorry for you", "ESH but him wayyyy more than you. He's right that you're a dick for choosing not to wake him when you know what time it is and that he's going to be late, but holy crap you're not his mum and he should be capable of managing his own time and taking responsibility for going back to sleep instead of getting up. And as for the retaliation, yeah that's a huge red flag. Petty sadism disguised as teaching you a lesson/getting even is never a good personality trait and definitely indicates that he won't hesitate to 'punish' you in future - gtfo while you can", "[deleted]", ">I get that we are a couple and should help each other, and he's the one paying for all the food and half the bills, so the last thing I want is for him to lose his job because of tardiness.\n\nThen YTA.  You depend on his income, but can't wake him up?", "ESH\n\nBlowing his nose on a towel like that is definitely gross (lol)\n\nAnd you turning off his alarms while being awake watching him sleep is rude (I redact this comment as I misread)\n\nIt sounds like he definitely has a hard time getting going in the morning. Some people are not morning people. Yes, he’s an adult and he’s got a job with a specific start time, but just watching him sleep instead of doing something you’re capable of doing is also messed up. \n\nIt’s not your responsibility, he needs to get up on his own, but watching him fail isn’t helpful either. \n\nIs he staying up all night drinking or playing around? Does he need to go to bed earlier?\n\nEDIT: I misread the part about who was turning off the alarms, I remove my comment about that.", "Eh- talk about it. I can be an asshole in the morning, especially if I am running late.   \n\n\nI would just tell him that because he can be an ass in the morning, you aren’t willing to wake him up anymore.", "[removed]", "[removed]", "[removed]", "[removed]", "Not to mention the dick was awake every time she checked on him. He knows when he's supposed to get up, he knows when he's supposed to leave. \n\nHE'S AT LEAST 5 YEARS OLDER THAN HER. The bastard knows better, yet he's acting like it's her fault he won't get up on time DESPITE HIS MULTIPLE ALARMS. \n\nThis is not a healthy dynamic. He's treating Op like she's supposed to be Mom 2.0 or something. His behavior will only get worse the longer she puts up with it. \n\nShe needs to end this relationship PRONTO. It's only a matter of time before he gets violent.", "Op, that towel thing was a introduction to what he is willing to do in retaliation. It always starts small and he will do more hurtful things that make you question yourself.\n\nDon't let this go. Put your foot down on what behavior you're not willing to accept or he will walk all over you.", "Only caveat I’d add is it’s possible *she* will be packing her bags and leaving, depending on the lease. Agree with everything else, OP is NTA and ultimately it’s his responsibility to use his alarms for their intended purpose instead of… whatever the fuck this is.", "Seriously. Adults who cannot get themselves up on time are insufferable. Grow the fuck up.", "OP take note : This type of abusive behaviour WILL escalate. He will start to blame you for every thing that goes wrong in his life, and at some point you will believe it and change to suit him. Actually you are already starting to believe it, hence this post. Remember that every abusive AH was a lovely partner in the beginning, because no one is stupid enough to get with someone while they are being abusive. Seriously, stop his BS now or get out. You are definitely NTA, and don't let him convince you otherwise.", "I agree with what you're saying but at the same time, it sounds like he's supporting OP. I agree that the behavior is alarming and uncalled for. However, OP said that they do not want him to lose his job because of tardiness. If that's really the case, if they really cared all that much, they would have made sure he was up.", "Abusive behavior is an exaggeration surely", "Rjght? I am a night owl. So were my parents. The minute they retired, they changed their sleeping schedules to 2 AM-10 AM, and I will likely do the same. But I have been getting my morning-hating ass out of bed for 30 years to go to work in the morning because I have bills to pay, and I'm an adult.", "All I could picture was the boyfriend as a jerkier version of six-year-old Calvin from *Calvin and Hobbes*.", ">if he wants to get fired that's his choice. \n\nIf she wants to be homeless as a result of him being fired and no longer paying bills that's also her choice.", "I have a really hard time getting up in the morning so I also have to set multiple alarms but I'd never get mad at someone for waking me up \"too late\" because that's my fault. I'd be happy the didn't let me sleep in any later", "Agree 100%\n\nThe towel thing, that should not have triggered OP to think she was the AH, it should have triggered her to reflect if she really wants to put up with that toxic reaction to disagreements? \n\nEven if he thought she had done this in purpose (which was a wrong assumption on his end),  there is no justification for taking petty \"revenge\", this is not healthy.", "NTA I would also purposely get up and leave to get coffee or walk the cat so I wouldn’t be there to be his F-ing crutch. Boyfriend is a baby.", "Family vacations used to be extra frustrating for me because I did the packing for my whole family, including my husband.  (This was something I was initially happy to take on.  Our division of labor is odd in some ways but very fair.) Inevitably, he would say, \"Wellington, where is my x?\" Maybe it would be an item I did forget, or maybe it was something I had no idea he wanted.  Either way, it would be my fault.\n\nI put my foot down one trip and said, \"From now on, I am responsible for packing for myself and the kids.  You are on your own.\"\n\nMy husband is a reasonable guy, and he agreed immediately, and our vacations are a lot less stressful for me as a result.  OP needs to sit her partner down and lay out her boundary.  \"I refuse the responsibility of waking you up for work.  If you oversleep, that is on you.\" Of course OP should save her partner's butt if she can, but that is a favor, not a responsibility.  \n\nOP's partner should be perfectly willing to say, \"I understand, and I won't try to make this your responsibility anymore.\"  This sort of thing is part of developing a healthy relationship.", "Yep. It’s him saying he is entitled to punish her for not serving him. This is a bad sign.", "Calm tf down y’all never gonna find anyone expecting perfection how bout trying to talk out the issue first lmao", "::stares at distantstaticmelody in horror::", "He sets his alarm for 7:00 and 7:10 and apparently ignores them.  He seemed to be ok that it was 7:25 but gets upset when it’s really 7:37.  And it’s your fault?  He’s 35 and acts like he’s in junior high.  He’s an asshole and a child.  Don’t expect things to get better.", "Then get a vibrating alarm, an alarm that lights up or do something to fix your sleep schedule. It is not your partners responsibility to get you up.  Especially if you set multiple alarms and keep turning them off.", "OP did not knowingly screw their boyfriend over, he screwed himself over by not getting up on time to his multiple alarms.", "I'm so so so so so glad I saw this take at least once during this thread. The term 'lie' is debatable but it was wilful action with an intended consequence. He felt let down by that. His behaviour was completely unjustified, and if he's relying on her he needs to fix his shit, but seeing your teammate play games always stings, especially when you're usually a good team. Stuff like this erodes. Don't introduce it willfully.", "Not when it’s every day. Missing an alarm every few months maybe, but this is just pure laziness.  And the fact he blew his nose on her towel is insane to me. His shit would be packed and outside the door when he got home.", "Is this just a microcosm of a shitty relationship or a one off blip of two people being dicks to each other. Can’t really tell, but boy do people sure have opinions in here based off this little event.", "Oh because if a woman does anything nice for a guy, according to this sub he’s being abusive.", "This is what I don't get at all. My partner helps me wake up to my alarm all the time, and I help him, unless we both happen to sleep through the alarm. Yes, even when one of us has to get up much earlier than the other. We do it because we love each other and care that the other is able to do their best. OP acts like my mom, who will kick the shit out of my dad in bed for snoring and then brag about it. If you don't like each other, don't be together. YTA", "Did you miss the part where he yells at her when she dies wake him up and he blew his nose on her towel?", "ESH for sure. Rather than have a conversation later and say I’m not responsible for waking you, she taught him a lesson. Then he acted like a moron.", "He’s got a job but he needs another adult to get him out of bed?", "careful youll be downvoted to oblivion", "Where does it state she's turning off his alarms? Baby boy is doing it to himself and needs to grow tf up. He's 35 FFS", "She forgot once. That is not her job. She is not his mommy. And him choosing to turn off his alarm is his fault only", "OP isn’t his mother, it’s not her responsibility to wake him up. What was he doing before he moved in? Was he just constantly late for everything? What happens if she’s not there one morning? You can’t be this reliant on another person.", "All of this. I walked away from a man who thought he could treat me however he wanted. Now that I've been gone for a little over a month, he pulled a surprised Pikachu face. He didn't think that I would leave him. Of course now all the problems that existed in our relationship are somehow my fault but I'm not surprised about that. He blamed me for everything already. Before I left him, he literally said that all the problems in our relationship were my fault.\n\n If I would just change, things would be better. It was code for if you would just do what I say then your life would be easier. He accused me of slandering him because I told the truth about what he did to me. How he abused me for 5 long months. He changed about 3 months into our relationship. I would have left him sooner but I'm disabled and he prevented me from leaving. He had it in his head that I was going to marry him and stay with him.\n\nThis despite me telling him that I did not want that anymore. I found out from mutual friends that he was talking about marrying me A MONTH after meeting me!  So glad I was brought into that decision. /s He didn't respect my boundaries at all and wouldn't take no for an answer. If I said no, he would pressure me into saying yes. Thankfully he wasn't sexually or physically abusive. He was in every other way though. I'm just glad that I lost 200 lb weight off my shoulders.\n\nEdit: Come to think of it, I never even really said yes. He just wouldn't give me a choice. It was basically, I don't care what you want, this is what's happening. Fuck him.", "If he’s this abusive and gross 2 months in and at age 35, he’s not safe.  I don’t know who to tell you to call, but I think you need protection getting him out of your apt and your life.  Please be careful", "A pan of cold water will wake him.", "Sounds like she's raising a 14 year old not a grown partner", "I’ll die on this hill too, I Am someone’s momma, and I will wake her up. But not some grown adult.", "And the fact that he’s clearly not sleeping through the alarms.. he’s just not wanting to get up. That’s so irresponsible to try and out that on your partner.", "Honestly I have terrible sleeping issues and rely on my husband to wake me up.  He prefers it to me setting 17 alarms.  But on days when he has to go in super early, I set my 17 alarms and make sure I'm up like a good worker bee.  It's a kindness for OP to wake up her SO, but certainly not a requirement.  What he did afterward... I'm not in the reddit everyone should break up camp, but that seems like a red flag...", "Absolutely. My bf and I love sleeping in but if we both have our own stuff to do, we'll get up to our own alarms. Only once did I ever wake him cause his alarm didn't go off, but otherwise, we know how to function without each other while together. If he can't do that, then he shouldn't be living with OP.", "Especially at 35!  Way too old to not have the self discipline to get his ass out of bed.", "That's how I know I'm married to a man and not a boy looking for a mother. We've discussed many times how crazy it is that so many men are just looking for mothers and not partners. There are times I will wake him up and he will thank me. Then there are times he's been late and I didnt wake him up... and he never blamed me because it was his fault he didn't get up.\nNever understood how people could pass the blame to their partners for their own mistakes.", "pay for your own food.", "If OP was such an adult she could buy her own groceries lol", "Exactly, my ex used to get mad when he would get up late for work since he would stay up late every night.  I told him it was his responsibility to get himself up for work.  He was a huge mama's boy and she got him up until he moved in with me.", "I can confirm from experience that this type of behavior always escalates. My ex would *destroy* my things when he didn't get his way. He once threw an entire drawer of my jewelry at a glass shelving unit and shattered the entire unit as well as damaging most of the jewelry that was in the drawer since my rings and earrings all got bent and broken. Then he started damaging my family heirlooms, of which there were few. This was all between him screaming and wagging his finger in my face and then falling to the floor crying because I wasn't just rolling over and giving him what he wanted. He'd also take back gifts he had given me and lock me out of the room or even the apartment and then wonder where I had gone and why he couldn't find me :/", "I upvoted every word til she should move out. He moved in with her two months ago. Yeet him back out again.", "100% this.  Mature, decent people just don’t even *think* the way this guy does.", "So agree. I’ve never had a partner go out their way to hurt me. Accidentally perhaps especially if we aren’t on the same page but deliberately!? Appalling", "Agreed.  That was truly disgusting.   Who does that?  Show him the door, change the locks, and of course, throw that towel away.", "I so agree with you. His behavior is literally disgusting and unforgivable. I'd be done. No discussion, just done.", "My husband has adhd and sleep apnea. Especially before treatment, he was the exact opposite of a morning person. He’s gotten irate now and then about being late but never blamed me. But I know what it’s like to live with someone who struggles with mornings. \n\nFouling a personal care item is outrageous to the extreme and an instant dealbreaker IMO. That’s something I might expect from my 4 year old, and even that would be unacceptable. This is not a second chances situation.", "Yeah. His behavior with the alarm would have been enough, but his behavior after? I could not imagine still being physically or emotionally attracted to a man who would do that. Legit would kill any sexual drive I have for him so fast.", "My mom would’ve grounded my ass if I acted like such a little shit.", "If my son expected me to wake him up for school once he was in high school, then did something nasty in retaliation,  there would have been immediate and harsh consequences.   But I raised a grumpy but decent teen, so he got himself up and to school (mostly) on time.  Now he's been adulting since he was 19.  OP,  you can do better.  This bf is most definitely NOT a keeper.", "It’s the most childish thing. For real adults, waking up in time to get to work is non-negotiable.", "Retaliation with the towel definitely enters into abusive behavior territory.", "Actually my 6yo does, but that’s the point, he’s 6. And my response to that behavior is some kind of punishment: no screen time, get him involved in rectifying his actions (pick up after himself, wash or wipe up his mess that was created out of anger/spite).\n\nOP’s bf should wash the towel by hand or get OP a new towel.", "I dream of the day I can do that!", "She was living there before he moved in, so she will probably be fine. Good luck to him finding another person to put up with his crap.", "I started using one of those alarm apps that won't let you go back to sleep. There is no snooze, and if I want to turn it off I have to solve math problems. Resetting my phone won't help either because as soon as it boots up again the alarm will just start right up again. I downloaded this app because I used to be exactly the same way. Now, not only can I get up at the first alarm, but I've also gotten better at math.", "This! Waking up on time in the morning is so difficult for me - so many alarms! If my bf ever tries to help, even if I'm already late, I thank him for trying - I would never yell at him/blame him for something that is my responsibility", "Thats why I am a real big brain I set 4 alarms too early and wake up on the 5th so I am still early 😎👌", "Because she is not responsible for making sure he knows how to adult? I mean, sure, in this instance it wasn't a big deal but what if OP is sick or has to go away for a few days? What if she had a big project and doesn't want to get up at 7 am?\n\nAnything happens and this instantly goes from simply annoying to being a burden. Waking up on time is such a basic expectation it should be a no brainer (apart from certain conditions ofc).", "He had time to blow his boogers but not brush his teeth. That’s an offense as it is! He must be a joy to work with, too.", "Seriously that is such an early warning sign of abuse to come in the future", "I don't think it's over reactive to say you should consider breaking up or divorce someone who can't act like a grown adult. He's 35. He should be fully capable of being responsible on his own. Now if he oversleeps on accident he won't have a support system to help him be awake on time every now and then. He's mad his girlfriend won't act like his mother and make sure he's dragged out of bed and ready. This is something you consider breaking up with someone over.", "Legit, I was so outraged when I read that. Part of me wants her to pack his stuff and pin that soiled towel on top and leave it outside. \n\nI think that so many relationships that are presented here are so critically broken that the poster's \"normal meter\" is broken. The crowd here loses their sense of nuance, so they're quick to reach for the \"breakup\" hammer.", "Nah, this sub is not a representative sample of all relationships. People post here because they are having issues with their partner.  People in normal relationships with healthy communication aren't going to be posting many dilemmas.\n\n90% of the time that people say \"divorce\" it's completely justified in my opinion.", "Yes. If he got snappish because he was frustrated, I’d easily look past that. He shouldn’t rely on her to be his human alarm clock. That’s a pattern to break, but workable. The fact that he felt entitled to punish her like that is a major red flag.", "Agreed. It's a very ugly quality and not something someone suddenly changes about themselves. She should run.", "There are some kinds of red flags that are literally stop signs, and the anger, blaming, and ultimate retaliation is one of those. \n\nTake it from someone who lived it: if I'd thrown him out of my house after the first time he did something like that, I wouldn't have had to have him hauled off by the cops, gotten an order for protection, and developed PTSD about handguns (because the regularly threatened me with them. In my own fucking home). Some people may say it's an overreaction to end it now, but OP needs to take care of herself. This will only get worse. Even if he never gets to the point of physical abuse, mental and emotional abuse are very much things, and no one should put up with it.", ">It is not your partners responsibility to get you up.\n\nRight, but thats not the question being asked.\n\nIts not like OP is asking his partner to wake him up - but to be awake, know your partner is late, and NOT wake them up is a pretty shitty move for no other reason than wanting some kind of moral superiority medal for waking up for an alarm..", "I wasn't finding my comment to edit! I was unfair to her, I think both could've acted better in this situation,  and his behavior was disgusting\n I edited now", "If she forgot it's an accident and it's ok, but I understood she did it on purpose, wasn't it?", "You are right, he shouldn't be reliant on her. But it's a nice thing to do for your loved one. And being nice to each other is an important part of any relationship. It's not even a hard thing to do.  There are many things my SO and I do for each other.", "My ex would set alarms every ten minutes for a full hour and sleep through them all. It was infuriating. While he managed to fall back asleep between those ten minutes each, I laid awake at 4:30 trying to get him up so I could stop hearing that god awful alarm.", "I'll give some sage advice. Tell him to set 2 alarms. Maybe 3 maximum. You want to wake up naturally. Sleep works in cycles and if you wake up from a deep sleep you will feel very tired.\n\nIf you want to get up at 7.30 set an alarm at 7.00 at a very quiet volume, personally I have it on spotify playing classical music. This isnt loud enough to wake me up unless I'm lightly sleeping. At 7.30 my main alarm comes on and its loud & bright.\n\nI used to be a very bad-morning person and this was life changing. You wake up naturally to music which you've set to just the right volume.", "People who set off multiple alarms and annoy their partner, roomate etc are real turds. Get out of the damn bed. Stop waking up other people.", "I usually have to wake up earlier and use a light alarm. This works for us as it wakes me but doesn’t seem to wake my husband. \nIncidentally it wakes up both my children (with a slight delay).", "My partner is the same. Sets an alarm for 7, then asks google to set one for 7:15, then 7:30, 7:45, and usually gets up at about 7:55. I really, really hate it, he just drops back to sleep and snores while I can't get back to sleep after the third alarm. He tells me to just \"kick him out of bed\" but that'll end up in me being growled at. He is just the worst cranky asshole when he's tired. When I have to get up earlier I train myself, usually get up before my alarm and set my clothes out the night before so I don't have to turn the light on. If I'm really tired just stretching helps to wake up my body. But he won't even try it. And if google doesn't hear him ask for a new alarm and he just falls back asleep, too fecking bad for him.", "When I lived alone, I'd do that \"hit the snooze button\" thing.  But when I moved in with my guy, I made sure I got up with the first alarm.  It's inconsiderate to your partner to have alarms going off every ten minutes because you can't get yourself out of bed like an adult.", "97% of the time, Husband wakes himself up, just fine.\n\nThe other 3%? Usually involves me elbowing him in the ribs until he hears his alarm. And he’s always really appreciative, and apologizes for it. It only happens a few times a year, so it hasn’t turned in to a big thing, yet!", "truly.", "Not to mention well past the age of using boogers as retaliation…", "So many women never at all consider this dynamic. Especially in states now where abortion isn't available women need to start looking at their choices and pick good fathers. Doesn't have to be a rocket scientist space plumber but just a good person. Someone who'll be there when the tread comes off the tires. For his family and wife. I got so lucky that I walked into that bc I never even thought about who's waking for the baby at 3 am. It was 99% me btw lol but he works, I don't, you trade off burdens. He isn't perfect but he's a good person who tries hard for his family.", "Marbles kept in the freezer, doesn't leave the bed wet, rolls to lowest spot you can't get away from them without getting out of bed first.", "After he’s ignored 3 alarms I’d be pretty tempted ngl", "They are living together and probably eat the groceries together. Seems fair that they split the cost of groceries.", "Leave", "It's disgusting,  I could never use that towel again even after washing. OP should insist he buys a replacement.", "She should take all of the towels out of the bathroom. The only towel he now has is the one he blew his nose on. If he wants to be a pig, let him wallow in his own filth.", "When my sister divorced her lazy, unscrupulous husband, I described it as a \"marital lumpectomy,\" and she howled with laughter.", "His getting mad about being woken up late would make me reluctant to wake him up. There’s no winning.", "I lived with a man just like this. I didn't know what \"gaslighting\" meant until he moved in.  It ended with me having to call the cops and get him removed. In not saying OP will end up in the same situation, but the malicious nature he showed by purposely wrecking something she likes just because it makes her happy is a GINORMOUS red flag.", "I would call it petty, immature, childish and stupid. But abusive? Surely there must be a higher threshold to call it abusive. A person could shrug it off, a towel getting dirty? Might be an overreaction there calling it abusive.", "Is this available for android? What's it called?", "What did he do before he moved in with her? He's 35 years old. Was he just late for everything all the time? I don't understand why so many men act like they can't do basic adult things once they move in with a woman. So many stories of men who suddenly can't cook, clean, shop, or manage their own schedule as soon as they can dump it all on a woman.", "Seriously. Like, okay, he had 8 minutes to get up before leaving on time. In 8 min, you can definitely pee, brush teeth, put on deodorant and clean clothes, and then leave. No time to eat or shower, sure, but the bare minimum of hygiene and presentability can be achieved. He CHOSE to take the time to mess with her towel rather than brush his teeth. He doesn't care about getting to work on time, he cares more about hurting OP for not being his mom.", "I don’t think you finished reading my comment, we are in agreement", "This is what I do. I set my alarm for the latest I can get up and then when it goes off I get up (sometimes I snooze because I have a buffer but I very, very rarely use it. I have a little one that keeps me awake past my bedtime some nights). There is nothing worse than waking up 15 or 20 minutes before you have to get out of bed because you can't fall back to sleep and you're tired all day. Why would I want to do that to myself purposely?", "She said she looked at her phone and forgot. What she did previously was a curtesy to him not  an obligation. He has an alarm and is grown he can wake up", "I would consider having to frequently wake up my SO so he wouldn’t be late for work, and then getting yelled at every time because I didn’t wake him up sooner, to be a pretty hard thing to do.", "My ex was the same way. Then he wondered why I was pissed off and tired.", "This is not okay. I have been struggling for years because I am the kind of person who needs multiple alarms—but I have never made my husband wake up every 10 minutes even when he was off work and didn’t have to get up. I set my one alarm and deal with it. I’m sorry you get woken up.", "We both work evenings and start at 2pm. Occasionally one of us will have to get up stupid early for an early shift.\n\nWe have one car. When it's his turn to go in early, he gets up on his own and takes the car. He doesn't expect me to get up with him. And I just take the bus. (We work close to each other and usually carpool with a few of his co-workers)", "I say this in a respectful way, why would you be involved with an inconsiderate jerk who bullies you? You could get a better boyfriend, or not have one at all. Either of those possibilities would be better than someone who doesn’t care about your comfort and well-being.", "Really 🤮", "She needs to toss the towel *and* the man.", "If OP does NOT want children, this is also not the type of man to go down that path with either, as he is, effectively, a child.\n\nETA: NTA", "Or even a pet for that matter. I imagine OP’s boyfriend saying something like “Well I couldn’t walk or feed the dog because I woke up late and you should’ve done it for me!”", "I'm not a morning person. I struggle to wake up due to insomnia. My very awesome husband who's up anyway started making my coffee so I could get that extra few minutes, and will shout up the stairs if I'm not out of bed on time. \n\nIf he decides not to do either of those things anymore, I would be sad, but it is MY responsibility to wake my own damn self up to get to work.", "I’m not a morning person but I wake up between 6:30 and 7 everyday—including days off—because that’s when I need to wake up to take care of my dog.", "Or pretend to be asleep, less work!\n\n\nEdit: If you really wanted to make a point you could say \"why didn't you wake me,  I wanted to get up 7:15\"! (And the towel thing is disgusting and uncalled for btw)", "What, no, call him on his bullshit and tell him exactly what this means for the relationship.", "That's genuis!", "Do you by any chance talk from experience?", "Vindictive.", "It's also abusive", "So am I 😅😂🤣\n\nI just left a man like that on June 21st. Best decision I ever made. I lost a 200 lb dependent. It's a weight off my shoulders.", "Not talking to someone for days is manipulation. That’s not any better than what this guy is doing.\n\nYou’re defending a 35 year old man that rejects personal responsibility and blames his partner for it. \nOk.", "okay now YOURE the asshole. you sound like a terrible partner. have a damn conversation if you’re mad instead of giving the silent treatment like a coward", "Lmfao!!! Whaaaaatttt??? ummmmmm okay so you must not be a morning person, who also needs to be woken up, otherwise ya sleep through your alarm. \nDid you read the post? It  really doesn't seem like it.  I think ya skimmed.\nShe did wake him up, he wasn't late yet, she said do you know what time it is, he said 7:25?, looked at the clock and flew out of bed in a rage. He has absolutely no right to be mad, he should have gotten up at his first alarm or set it later to a time he gets up at. He's never asked her to be his personal alarm plus she don't even have to get up as early as he does.  He also intentionally blew his nose in a towel that he knows she doesn't want to be used for that purpose.", "You need to wake up at 7 (but your girlfriend doesn't need to wake up for another hour or two), so you set an alarm at 7 and another one at 7:10. You consistently sleep through both for months. Instead of taking responsibility for your own behavior, and trying something like moving your alarm clock or phone further away so you have to get up to turn it off, you blame your girlfriend for not waking you up? In your opinion, it's your girlfriend's fault you can't manage to do what most adults do every day? You think she should wake up when you do just because? What have you done up until now? Were you late for everything? Your mommy woke you up? Do you always make your responsibilities and failures someone else's? How childish are you that you'd not talk to her for days because you can't handle your own business? You're a grown man, not a child, and she's your girlfriend, not your nanny.", "But why bring up the US, then? I imagine that there are countries where the woman would be expected to act as the alarm clock, but I imagine those are the minority.", "The one I use is called Alarmy, and yes it is on Android. You can set the number of math problems you need to solve, the difficulty of the math problems, or even have a different alarm type all together. I used to have it so I needed to scan a barcode. I set three different alarms with three different barcodes, and then placed the barcodes on the opposite side of my room, in my living room, and in the back of the hallway closet so if one didn't get me up the one after it surely would.", "I use \"I Can't Wake Up\" and it's on Android. I hate it so much, but it works", "He should not have yelled at her.  But I meant she should wake him up on time.  Being petty enough to wake him up late would be a jerk move.   He would not be angry if he was up on time.", "Totally, first thing I thought was a \"momma's boy\".  Girlfriend is a replacement for when momma isn't handy.", "Lol true that.", "😂 Chef's kiss to the pithy wisdom in this comment", "Yeah a tantrum throwing toddler at that.  OP please show your 'boyfriend' these comments.  Maybe he'll grow up a bit.  (Unlikely but we can all hope for OP)", "Ditto 👍👍 Awesome answer 😁", "I do! This was my Dad’s favourite way to get my night owl brother out of bed on school days. Very effective!", "My thoughts exactly 🤔", "But I need to think before having a conversation, I can't jus talk while I'm angry or would be worse", "So I'm a terrible partner because I would always help my husband to wake up? Because I would never let him miss work on purpose?", "Again, not her job to wake him up. He has alarms, he just doesn’t get out of bed when they go off. And I agree, he wouldn’t be angry if he was up on time. But that’s on HIM, not her.", "I’m sure there’s a “if he broke both his arms” joke in there somewhere", "While I think this is genius and I love the chaotic neutral energy of it, it still puts the onus on HER to make sure this grown-ass man gets to HIS job on time.", "This isn’t a one off situation where he forgot to set his alarm or something. Then she’d be the asshole for not helping him out. This is every single day. A grown man should be fully capable of figuring out his life enough to get to work on time. He’s not a child for her to babysit and make sure he gets there on time.", "It took me a second but when I got it, oh man, why did you have to remind me of that cursed post", "😂sorry. Not sorry. If I had to think it, you all had to think it", "this is exactly my thought process if anyone ever links jolly rancher, cumbox, coconut guy etc. i had to endure reading that shit, so should you!", "Dear u/Play_Tachi, \n\nI feel part of your pain. I'm generally an early riser (about 4a). I just wake up and go work in my home office rather than wake my wife tossing around. If I have an appointment I'll set the alarm on my phone (which may be a 2a call to a customer or vendor on the other side of the planet) and when it goes off I get up. My wife however is like your BF. Multiple alarms and snooze buttons hits. It usually takes four or five cycles for her to get up. I find it frustrating although not a hill I want to die on. \n\nWe have periodic discussions about what \"ready\" means. \\*sigh\\* Usually about twenty minutes to the garage door going up. \"Are you ready, or *Dave* ready?\" has been heard in the house. \n\nSo I'm predisposed to your apparent point that the BF should just get up. You're his GF, not his mother, and he isn't eight. \n\nBased on how you describe things you are NTA and he is an A H even before he blew his nose in your decorative towel. That was mean and definitely retaliatory. \n\nThe question I suggest is whether this is a hill you want to die on. If not, you might consider a conversation that includes \"You have trouble getting up in the morning. Do you want me to provide a wake-up call from me as one of the things I do for you in our relationship? I have work also and I don't have a snooze button, so one call is all I can promise.\" \n\nI hereby license all rights to \"I am not your mother and you aren't eight\" to you for the duration of your relationship. \n\nThe towel incident was rude and hurtful but I'd write it off and just wash it. However, if you do all the laundry I'd keep that as a negotiation issue. Eight year olds *can* do their own laundry. \n\nGood luck.", "Yes YTA", "YTA, while it is his responsibility to be on time and maintain a schedule and is showing a negative pattern towards that. You would’ve been justified to want to confront that with him, but instead you made a game of the mistake and probably went down the least constructive avenue for dealing with his negative pattern.", "ESH. I think in general partners should support each other. He's ultimately responsible but intentionally being unhelpful to teach him a lesson is also childish. I think it's fair to have a conversation with him about his responsibilities to his job (and how they are not your responsibilities) but a morning rush is probably not the best time for that.", "He’s TA for this setting of several alarms because he doesn’t have the courtesy to get his lazy ass out of bed after the first alarm.  I’d never put up with that behavior in the first place.", "YTA", "Yes it’s an A-hole move\nBut \n\nESH \n\nHave a talk with him about getting up on time but remember if he loses his job he will rely on you financially 100% and I’m sure you don’t want that… \n\nMaybe get an alarm clock with the alarm at 730 and it’s across the room so he has to get up and he knows that he’s on his last minutes", "The edit is correct — to “teach her a lesson” he ruined (or tried to ruin) something that is specifically hers. That will just escalate.", "Textbook beginner abuse. It will only escalate. DTMFA. NTA.", "Hear hear. Abusive behaviour just exactly. The smiling and waiting for your response.", "I should make a collage of these, I swear to god. Where the fuck do people find these guys?!", "Why hasn’t anyone mentioned that the only reason OP is even awake at that time and able to wake boyfriend for work is because he sets multiple alarms and they wake her. \n\nIt’s a huge AH move to snooze your alarm when you don’t sleep alone. If you cosleep with your partner, you get 1 alarm and you turn it off as soon as you hear it and quietly sneak out of bed to try to disturb your partner as little as possible. Multiple alarms and snoozes that wake someone else with you is what AH do. \n\nHe’s refusing to get up and this is forcing her to get up and then he’s blaming her for his own not getting up! He’s a huge AH. Even without the juvenile snot blowing dealbreaker. \n\nNTA op.", "This^^ My marriage started like this, my ex was and still is at 41, incapable of getting up on time. This slowly escalated until I was isolated from every one and everything. This is abuse, he is not accepting responsibilty for his own actions, and soon everything will be your fault and you will constantly saying you're sorry.\n\nMy advice, get out now. NTA.", "I wouldn't even give him a second chance, blowing his nose on the towel is so far beyond acceptable that I'd have changed the locks as soon as he left for work. How appalling and deeply disrespectful. It shows a lack of respect that I wouldn't be able to forget after that.", "Agreed 100% \n\n“Helping out” is occasional, he NEEDS help, it’s one off… \n\nMaking her do it EVERY DAY is not “helping out” that purposeful incompetence then blaming his consequences on her when it’s his fault", "He is definitely NOT a keeper. Living together teaches you what the other person is really like. Most times they will not change and you shouldn't have accept living as victim just because he is paying for food. Even the smallest type of retaliation is a sign of  danger as that shows they want to hurt you in some manner (mentally or/and physically)", "and it’s the fact that he keeps waking up, smiling, closing his eyes and REPEAT💀", "I would like to add as a tiny caveat to this, that if he is physically incapable of getting out of bed on time despite consistent, legitimate effort, he should go see a sleep doctor. Sleep disorders are miserable and often overlooked.\n\nBut this guy just seems like a child casting off his responsibility onto his partner.", "> He is an adult\n\nI strongly disagree.", "Agreed, NTA. A grown man needs to be able to wake up on his own and be responsible for himself and those that he is responsible for. Granted, he probably just started waking up this early, but 2 months is plenty of time to acclimate to a new schedule. As partners we do help each other out, but one must not completely rely on the other, then get mad when It doesn’t happen. I wake up between 4:30-5a, because it is my responsibility to take care of my own. I applaud you for standing your ground, only thing wrong is lying about the time. Be honest, that will keep your relationship healthy and if all fails, at least you will have a clear conscience. Good luck to you!", "He needs some Icy Hot in his underwear . . .", "edited to add, he is teaching you that you will be very sorry if you don't do what he wants.\n\n  \nAbsolutely, OP do NOT ignore this behaviour.", "Also the way he retaliated... 1) specifically chose OP's favourite towel to ruin 2) specifically made sure OP notices what he's done and why 3)literally acted in such disgusting way where OP has to clean up his bodily fluids after him (seriously, what is he gonna do next, piss on the floor?)\n\nIt's one thing to call her an asshole in the heat of the moment, but this really raises some red flags.\n\nOP, run before it is too late! You have only lived together for  2 months, this will only get worse", "I’m concerned that he was this late to work yet still made the time to retaliate and comment on it…. But had no time to brush his teeth. Maybe he could have brushed his teeth instead of being a vindictive AH.", "I’d bet money he lived with his mom who DID wake him up every morning. This man has no sense of responsibility", "I'm that general age and have issues waking up on time... but my work doesn't care when I roll in. We've discussed before whether she should wake me up and I've always come down on: \"it'd be nice if you notice but it's my responsibility\".\n\nLike me, he's probably staying up too late. If anything he needs to implement a \"go to bed\" alarm. And not ignore it!", "Perfectly said.", "I feel like we all learn the “use your words not your boogers” lesson by age 4.", "like even blowing on it because he was in a rush and dropping it in the laundry would be forgiveable. His comment shows that he did it just to upset her.", "I find it most concerning how he was so late for work but still had the time to retaliate that way and comment on it.", "What?  Get his mom involved in your relationship?  I don't know that that would solve his wake-up problem or his vindictiveness, but would add the problem of way too much opinion and meddling from in-laws.", "It's her apartment, and he needs to get out. But good call on making the landlord aware, regardless!", "Waking up on time is a basic adult skill. This guy needs to fix his own problem before he blames his partner.", "This. \n\nHow is this not the answer. Dude was an idiot with the towel, but a relationship should be a team. \nWhy are these comments filled with so much anger and hate?", ">A simple conversation can resolve the issue. \n\nfound the adult in a healthy relationship", "> If your partner (your PARTNER) is sleeping when you know he should be waking up, isn't it a thoughtful idea to help the person out and wake them up?\n\nIf an adult (an ADULT) has the alarm going off over and over every fucking day and knows they should be waking the fuck up, isn't it the adult thing to get the fuck out of bed without a mommy girlfriend to make him do it?", "bruh she was literally already on the clock. How do you know her job isn’t feeding him?", "My Granny would have told him \"I didn't take you to raise\".", "This was my thought too. If I have to wake your ass up for work everyday so you won't be late......no thanks. And you get pissed at ME when you're late. Yeah, go back to your mama.....cause I ain't got time for that bs. AND the gross \"retaliation\" just seals it for me. 5 year olds are more mature than this guy.", "My husband is the early riser, and on the rare occasion I oversleep, he will apologize if he didn’t catch it. I tell him absolutely not. I am a grown ass adult, and he is not responsible for me getting up on time. The BF is a disgusting baby.", "Agreed. She was going out of her way to help him out and he lashed out that she hadn't woken him up earlier?! He blames the consequences of his behavior on her and then retaliates? \n\nThis is a big nope. \n\nIf she decides to stay with him, taking herself out of the morning equation by taking a long walk or sleeping in herself would return his responsibility for his own schedule back in his lap", "I've got a sleep disorder so my boyfriend wakes me up and drives me to work at 6am when my shift starts then. I thank him profusely every time and wouldn't dream of acting any other way.", "that’s a bit rash; there can absolutely be medical reasons for difficulty with waking up. \n\nthe blowing of the nose thing though? THAT shows that’s not what’s going on here & this dude is straight up child. NTA", "2 am to 10 am is the dream. I get my best sleeping between 6 and 10.", "Jesus Christ, I had to go back and look because I glossed over the age and thought he was 21. Not that this behaviour would be acceptable at any age but who the fuck was waking him up on time before he moved in?? His mom?", "Yoo not 35 but it is hard sometimes in the mornings\n\nWould never blame anyone except myself if I was late though\n\nMy sunrise alarm clock has been my blessing for the last year", "I don't know, I wouldn't be willing to have any talks with him after he wiped his bogies on my decorative towel on purpose. He can beat it.", "This comment should be at the top.\n\nBoundary. Favor (fell asleep the night before and didn’t turn on alarm) not responsibility. He is a grown adult.\n\nSuggestion for him…put an alarm clock across the room where he has to get out of bed to turn off, not just hit snooze.", "1) he has self-control issues demonstrated by his inability to get up like a grown-ass human being when the alarm goes off  \n2) he has an inability to take responsibility for his own choices and actions demonstrated by his blaming OP  \n3) he has an innate desire to harm her, her things, or her feeling when he is forced to face the consequences of his own actions demonstrated by the towel incident  \n4) he is passive-aggressive demonstrated by  the towel incident   \n\n\nThis guy is not someone to trust to be an acceptable life partner given his current, obvious lack of maturity.", "Seriously! It’s so fucking bizarre and oddly intense like…that’d start to shift my view of my bf if that happened lol", "I'm surprised he became an engineer with this kind of work ethic.", "And entitlement.  Entitlement is a huge red flag for future abuse and violence.", "See, I can not physically wake up until I'm not tired. I have to have a human voice in the room. I suck so bad at waking up it's ridiculous beyond ridiculous.  But. I have a system in place. I have set my life up around not needing to be awake at specific times.  Have I gotten pissed off at my husband for not waking me up. Sure.  But we've sat down and discussed it. Had conversations.  And in reality. Once he realized he can run a marching band through the room and it does not matter. I won't wake up. That a simple touch on the foot does it.", "The act would be bad enough, but to point out, it's one of her display towels was just twisted!", "Yeah this was how I feel now after re-reading - though I've edited my comment.\n\nI'd like to think that I'd have my partner's back and vice versa in such a situation and not let it get that far at all in terms of the yelling or whatever. But his work does need him to be there and he does have a problem with lateness so if it were my partner I'd still want to try and help if I could", "Ok. Mis read it. Thought she knew the time and didn't tell him.\n\nTIL I cannot read and maybe TA.", "I think the retaliation on his part makes him truly an asshole….beyond what should be happening. Way beyond.\n\nBut other than that….I am VERY bad at waking up. And I ended up having to do a sleep study. Issues have somewhat been solved - but if you’re awake and your partner needs to get up it’s stupid to say “what are you 12? You can’t get yourself up?”\n\nIt’s making a mountain out of a molehill. Is tapping them on the shoulder and helping them not be stressed that huge of a deal? Obviously it isn’t their job to do it, but it’s kind. And it helps the family out.", "its really not about genders.. If YOU have a partner thats there, they cant help you out? lmao honestly just selfish ass people all around.", "Learn how to fucking read, she said he pays for all the food", "this! my fiancé is the WORST with his alarms and is such a heavy sleeper. i’m a light sleeper and his alarms *always* wake me up, typically after i’ve only been asleep for an hour or so (i work until 3am and go to bed around 5am, and he wakes up for work at 6am). he got one of those “pavlok” bands and it works so well. he literally gets shocked awake and there’s no need for an alarm anymore. plus the shock jumpstarts his adrenaline so he doesn’t fall back asleep again!", "I would lose my mind. I can’t fall back asleep after an alarm. I’d be sorely tempted to just push them out of bed slowly 😂", "He'll get mad on the weekends when the kids wake up. Ask me how I know lol.", "my 14 year old ass was completely capable of responding to my alarm, no matter how much i didn't want to. this sounds more like a 6 year old.", "ILMAO 😅", "This. I take a lot of meds for medical issues which will rotate me between never sleeping and crashing hard that my alarms won’t wake me up. My hubby will help if he knows it’s important if he can ( he’s at work by 7am) but I also set myself 10 alarms with the alarms being a loud song so I know I need to wake up. This man can set more alarms or actually get up with the first one since he actually wakes up but stays in bed until she makes him get up.", "Oh. I'm so sorry that you had to deal with that.", "I'm glad to hear he's an ex. Are you with someone way better?", "Agreed. We use our words to express our feelings, not our secretions.", "Who the hell gets mad at their partner for waking up late, I've woken up late before for sure but the only person I'm pissed at is myself.  This guy is worthless.", "As of next Saturday, I will have 13 years left. Then I'm doing it. I wish you success in this endeavor as well, my friend!", "The problem with those apps is that your phone needs to be loud enough to wake you up.  😴😴😴😴", "Similar app but now I'm just really good at doing math and puzzles in my sleep lol", "Indeed it is, but you learn to live with it. Sink or swim, if you reach 35 and you need someone to wake you up in the morning then you're a loser in general. Like you said, this is the sole purpose of alarm clocks, no excuse.", "He can also move back to his place which isn't 15 minutes from his work. She's a freelancer, she has enough to keep track of.", "Snoozing is really the worst idea if you have a hard time getting up in the morning. It's simple sleep science. It will absolutely make sure you are at your most tired. I don't understand why people can't stick to basic sleep hygiene, life is so much more enjoyable if you do.\n\nAnd of course OP is NTA, that dude is unbelievable. Blowing his nose on the favourite towel is beyond disrespectful.", "Uh oh big boy words! She also said that *he* moved in with *her*. She’s providing for him as well.", "This! My ex was mad that he had to get up earlier than me so tortured me with his alarm for almost an hour every morning. Notice that he is now my EX.", "I am a person who sets multiple alarms and hits the snooze button for an hour before I get out of bed, but my partner also does this so neither of us are getting annoyed at the other (and we don’t have roommates or neighbors to get annoyed either). If it were otherwise, you bet your ass I’d figure out how to wake up without annoying the people around me. I certainly wouldn’t expect my partner to put up with it.", "I have an old school clock radio set to the PBS classical station.", "Thanks for the tip!", "Oh I’m going to try this, thank you!", "Or if OP is not yet back to talking terms, just write him a note: wake up!", "THIS!  So this !  Lol - this is what I would do", "i love this level of petty!", "This is devious behavior… I like it lmao", "Oh yeah, I married someone great. No more of that bs for me.", "Its OPs apartment, hes not even paying rent.  I'd have his shit on the front porch by now and change the locks if possible.  A good door stop works well too.  Yikes.", "OP's situation might not lead to a DV situation BUT people staying in situations where this kind of disrespect is normalized creates a society where DV is more likely. Her partner might never escalate beyond this, but other kinds of people can.   \nNormalize not forgiving this kind of shitty behavior.", "I use I Can't  Wake Up. Math, memory matching, multiple choice,  shake the phone,  etc at adjustable levels of difficulty.", "Could you plug it into a speaker or something?\n\nI'm such a light sleeper at this point I wake up before a roar of thunder, or my phone rings, or whatever sound may have woken me up.", "a person can shower in 45seconds. not wash hair, not lather head to foot, but soap on pits, ass and genitals, then rinse off.", "I can pee, brush my teeth, do a 1minute swish of mouthwash, brush my hair, put on deodorant and sun screen, put on clothes, load up my playlist and driving directions, kiss my cat, tell my cat to have the best day ever and that I'm doing this so she can have the best life, and leave the house in 15 minutes.   \nHe could have forgone blowing his nose on her favorite towel like a child and then telling her about it and had plenty of time to swish with Listerine.", "My husband tried doing that. I applied a foot to his backside and pushed him out of bed. Within a month he happened to be facing the other way so the foot was applied to his nether regions which in my sleepy state I did not register and pushed. He never set multiple alarms again.", "I have shitty qualities too. I'm cranky as all hell when I'm tired, I don't like going out much, I love doing messy art stuff. I found someone who loves me, puts up with my shittiness and we work together to try and better each other. It's irritating, but it isn't a deal breaker. I keep meaning to give him the same treatment with alarms from 6am, but it's just not worth it to me. \n\nPlus I don't know if I could find another guy who brings me warm brownie and ice cream in bed then reads to me from Tolkien's books, which I am a huge nerd for and he just casually enjoys. He has so many amazing qualities, I'd be a dumbass to lose him over this, we all have little things that others find annoying. And we will keep working together to be better.", "Indeed.  I’m just a single father, so things hit me different.  But I completely agree.", "Most my 20's was living with roommates, a few of those households we got to be good friends and would prank each other.  The general rule was no damage and nothing that would put your job, or relationships at risk.  General rule was... Will the person being pranked be able to laugh about it after?      Icy marbles worked almost too well.", "Congratulations on your marital lumpectomy! 🥳🤘🏻🙌💪🌟🎊🎉", "Congratulations!", "I do the same with the most annoying ear piercing alarm at full volume. It starts my day off like shit, but I gotta wake up. I’ve been doing it since I was a teenager. This guy is 35 and still can’t figure out how to get up in the morning.", "What thunder?  😴😴😴😴\nOh, look, that tree came down in the storm last night.  🤷🏼‍♀️", "Or just wet a cloth with soap on it and get the pits and privates. Change into fresh clothes with deodorant and you'll be okay. But, really if you're doing that badly in terms of smell, you should probably bathe the night before.", "Not liking to go out and doing “messy art stuff” isn’t shitty?", "I'm not saying that he's abusive, but every single abuse victim I’ve ever known in 58 years of life **immediately** starts on a litany of their own faults the moment someone points out their partner's bad acts. It's like the victim's been confronted with their own faults so often that they confuse their own fallible humanity with their partner's calculated, intentional malice.\n\nAlso, what you describe as his incredible caring for you? Is pretty run of the mill.", "> Plus I don't know if I could find another guy who brings me warm brownie and ice cream in bed then reads to me from Tolkien's books, which I am a huge nerd for and he just casually enjoys.\n\nIs that the sum total of his amazing qualities? Because that, at least, isn't so hard to find.", "Omg 🤣 just so you know, I will use this information wisely", "I’m going to use this on my teenager! Thank you for the great idea 😆", "Ikr? To detailed XD", "Thank you although I was smart enough not to marry him. That's what he wanted but I wasn't having it. He had it in his head that I was going to marry him and stay with him despite me telling him that's not what I wanted anymore. Every time I told him I was not happy and I was going to leave, he would say you don't mean that, you're just mad. He didn't expect me to actually leave and he was mad as hell when I did lol. He can be mad all by himself. He should have treated me better.", "Thank you 😊", "Okey doke.  Well, my therapist has no issues so I'll listen to her. My partner is an amazing human with a few bad habits. Like most people. His caring for me isn't that run of the mill. I mentioned one thing that means a lot to me, not everything he does. But that's cool, you do you:)", "Yes. One sentence is the sum of his good qualities.", "Well done! I'm SO happy for you! You deserve better!", "I'm going to NEED to read the post you're speaking of! Please??", "Do you really want to read a post about a guy who broke both of his arms and that started a sexual relationship with his mother? (I mean, I read it so I can’t judge anyone).\n\nWell, it’s your life, here’s the link to the Reddit post \n\nhttps://www.reddit.com/r/IAmA/comments/nmmjr/iama_man_who_had_a_sexual_relationship_with_his/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1", "ESH - I know I’m alone in this, but I see two petty people who need relationship counseling.\n\nOP - while waking up her partner isn’t her job or responsibility, sometimes taking on things that aren’t one’s job is part or working in partnership. The internet in general is loathe to this line of thinking, but part of being in partnership means covering for one another where the other lacks. OP’s actions point towards some lingering resentment that isn’t being discussed.\n\nOP’s BF - vindictive and lacking in personal accountability. His responsibility to get up and change his morning routine if he’s come to relying on OP to wake him up. Purposefully blowing his nose on a towel was disgusting and childish and even more hostile than OP. There’s no excusing his actions because they came from a desire to punish.", "Since I see overwhelming NTA's, I'll say YTA, just to give you some food for thought since I don't see people mentioning one thing. \n\nHe did react very poorly, yeah. That's on him and it's not-defendable. Childish behavior, definitely.\n\nHowever, what he said was not wrong. If you can help out and you choose not to, you're not a saint in this story. You were childish too, consider that. To paraphrase something others said, you're not his mom, true, but as his partner, it should be in your best interest not to cause him problems. Otherwise, what's the point?\n\n**Anyway, this is an issue that can be very easily remedied, and you shouldn't blow this out of proportion because crazed redditors tell you essentially dump his a$$.** One good talk is all you both need. Ultimately, it should be primarily his job to be on time at work, not yours.", "says he didnt have time to brush his teeth, but made  time to to snot up your property. leave.", "Because he's an engineer doesn't mean squat op. Don't know why u included that as if it excuses his childish behavior", "Whoa - I was you 17 years ago. \n\nI was with my boyfriend at the time, that I loved. We were gonna get married. We were “the couple”. Hopelessly in love and going to be together forever. \n\nUntil he graduated college, and could not. fucking. get. himself. to. work. \n\nHe said the same things to me. I’m already awake, why can’t I just help? It’s not a big deal. He just has trouble waking up. \n\nThat all made sense - until I really started to think about what he was saying. WHY can’t he get up? Usually because he was awake until ungodly hours of the morning, because that’s when he was ‘most creative’. \n\nBut that’s a choice. \n\nWhy should I care, I’m already awake? \n\nBecause instead of spending my morning doing what I needed to get ready for my day, I’m stressing about his inability to handle his own affairs. So he’s choosing his comfort over mine, no question. \n\nAnd the final point - the nasty ‘get back’ with the white towel. When confronted with a problem, it’s a real issue that needs discussion or an ‘us’ against the problem. In his world it’s him against you. \n\nPeople show you who they are. Believe him.", "My God! It is your BF responsibility to get his ass out of bed and to work on time! You are not his alarm clock! \n\nI'd rethink the relationship. Your BF acts like an overgrown baby throwing a fit because he didn't get his ass out of bed. And then to blow his nose on your nice hand towel as a form of retaliation is GROSS and IMMATURE.", "I’ve had trouble with sleeping through alarms for years. I actually had a conversation with my husband where I asked for his help and requested that if I wasn’t out of bed by 6:45, could he please wake me up. Because I was a reasonable adult and asked him kindly, he agreed. I also talked to my doctor and had a sleep study done. Now that I have a cpap machine, I don’t have trouble waking up anymore. It never occurred to me that it was my husband’s fault.", "NTA. My husband and I have a similar schedule - his first alarm is at 7am but I work from home and don't need to get up until 8 or 830am. Sometimes he gets up sometimes he doesn't. Sometimes he resets his alarm sometimes he doesn't. Every now and then I'll wake up with his first alarm and check emails/work emails to see if I need to get up and/or I just hang out on my phone until I need to get up. My husband has gotten up late several times, with me awake right next to him. Never has he ever suggested or guilted me to think it was my responsibility to wake him up on time. Sometimes I'll poke him around 750am and say something but it's always because I want to, never because I feel guilted to.", "NTA. I also hit snooze but because I know I tend to sleep in I have FOUR alarms to get me up by the 3rd one. It's not my partner's responsibility to wake me up.", "NTA \nAt first I thought it’s an argument - you work it out (he’s a grown man and should not rely on you to wake up.) but the boogers on the towel thing is a red flag behavior.  Are there other situations where he blames you for his own problems he creates?  Not only blamed you but punished you by ruining your things?  Something to think about.", "ESH, you both sound pretty juvenile tbh. He’s not asking you to be his personal alarm clock, but you were awake and you let him sleep in just to prove you could which is why you’re TA, and he’s TA for doing something absolutely disgusting and childish in retaliation", "NTA.\nIn my house, after elementary school age, you're responsible for waking yourself up and getting out the door on time. I'm sure as hell not coddling my grown-ass husband that way.", "NTA, you’re not his alarm clock or his mother", "This is clearcut. NTA. As someone who hates mornings, has often struggled with early work schedules and has a highly professional and reliable partner, I can 100% say it is not her responsibility to check my failure to adhere to my own work schedule. An occasional help is definitely part of the balance in a relationship but there's a cutoff where it's on you and it doesn't take long to reach that cutoff lol. \n\nIf the anger lasts throughout the day and isn't retracted with an apology, that's a firm talk incoming on personal accountability.", "he is \"in general a good partner?\" what's good about him?\n\nhe really doesn't even sound like a good human, much less a good partner. he's gross and he acted like a toddler. you are not responsible for a grown man getting his a$$ out of bed and into work on time.\n\nNTA. this \"man\" is draining you. dump him.", "NTA - and this Edit is God’s own truth. I would add that at 35, blaming you for his bad habits is a BRIGHT red flag — he’s that “look what you made me do” while tenderly dabbing at your black eye type. \n\nRUN GIRL!! GTFO off Reddit & get yourself an exit strategy pronto!! \n\nAlso - please don’t be STUPID. “Aaron” isn’t any different than any other abuser who wasn’t, until he was. “Talking to him” or whatever other reasonable response that occurs to you won’t change the fact that his NATURAL REACTION is to blame you & get nasty vindictive.", "I will add that if I poke you and go “get up” and you acknowledge me but don’t, I’m not going to pester you. It’s your damn problem. I’ve been in too many relationships where I did this for a while and then was expected to be their alarm clock to do this.\n\nNTA, you ain’t his mom.", ">edited to add, he is teaching you that you will be very sorry if you don't do what he wants.\n\nOP this is the most important lesson to take home from this. He's actively punishing you for not doing what he wants.\n\nWhere the want is a cover up for his inability to be an adult and think of a system to wake up by himself.", "That last edit is, IMO, a key point. OP needs to consider if this is his response to challenge/arguments - demonstrating how sorry you will be for non-obedience. That's chilling.", "I wouldn't even give him another chance. Retaliaton of any kind is a deal breaker.", "Empirical evidence suggests that he is NOT in fact, an adult that is capable of getting out of bed on time.\n\nHe is the age of an adult. OP need to decide if she wants to raise a 35 year old....", "It can be really hard to see red flags when you’ve built up in your head how your relationship is, especially because a lot of abusive people are extremely love-bomby at the beginning of a relationship. My ex threw a dining chair at our apartment wall when he was angry with me once and I stayed for months after that. When I look back on it now I literally cannot believe I subjected myself to that treatment.", "Good people can be lazy", "Seriously, reading the part about blowing his nose in the towel, that would have ended any attraction I had to him. What a nasty childish thing to do. I’m disgusted by him and I don’t even know him. If I were OP there’s no way I’d be looking at him the same way I did before the towel incident.", "OP please oay attention to this. The \"boogers are childish and icky\" takes are hiding what he did, which is expressing anger at you - for not doing what he wants - by ruining your belongings. You say he's \"a very good partner\" usually - is he really or do you always just do what he wants so he's never had to put you in your place? Ruining your things is abusive behavior.", "⬆️THIS⬆️", "I had the same conversation with my husband. When I pick up after you or I have to be a mother figure to you ... Well that's exactly that. You make me feel like your mother. So if you want me to feel like a wife, then act like a husband and adult not a child.", "statics course :)", "Nah mother works too", "NTA and this is the best suggestion imo. Unless doing so is a real pain in the ass, def just wake up at 650 get dressed and go for a walk for your mental and physical health. Be home at 8 and start your day stress free. If he complains about your new routine (that's good for you both,) you know there's major issues and not just a one off shitty morning (for which he should apologize *of his own accord* bc if he stands by his reaction, skip all the suggestions and run!)", "My wife is impossible to wake up. It's been a thing since she was a kid, and she's been to doctors who can't seem to help her.  Literally, every morning I wake her up, she APOLOGIZES despite a decade of me telling her, \"You don't need to apologize. I know you're not doing it on purpose.\"", "I find moving around helps wake me up, even if I'm not completely booted. I have a harder time going to and staying asleep.", "Nothing less sexy or less romantic than being in a mommy-child relationship with your man. Yuck.", "I’m a 43 year old woman who has almost lost jobs because I couldn’t wake up and get there on time and I’d die on this hill, too. We’re adult. Even if you got issues, you have to own your responsibilities & the consequences.\n\nI cannot believe he he tried to blame her for not brushing his teeth.\n\nNTA.", "I don't mind waking my partner every once in a while. But every, or even most days? Heck nah, you're an adult, figure it out", "I am a momma, and I stopped waking my son when he was a senior in high school.  \neta: NTA, but he is, and you should tell him to leave.", "I know everyone on here is way too quick to shout \"dump him\" to any relationship problems, but in all seriousness, women are expected to put up with all sorts of infantile nonsense that we really shouldn't have to accept. Yes, your bf who is a good bf in all other respects you say, is behaving in a childish manner. Children are not mature enough for adult relationships like dating, and it shouldn't be your job to \"housetrain\" another adult. I would encourage you to consider carefully the rest of his behaviour. Is he truly a good, mature partner? Or is it just that he pays some bills and isn't verbally or physically abusive? You deserve good things, OP, keep the bar off the floor", "Today is nose blown on your favorite towel, tomorrow it’s peeing on your pillow. \nI’d change the locks today absolutely.", "Yes! \n\nI would have been packing his bags for him with the multiple alarms. No one needs to wake others up multiple times in the mornings. Either get a vibrating watch or get up. \n\nThe towel would have been his second chance spent. I mean what is that?! \n\nHis bags would be packed when he got home, locks changed and a hotel booked for him.", "Exactly!!  This kind of ignorant nasty childish behavior would be a one and done deal for me. No one should put up with that kind of abusive behavior and disrespect from a partner.", "The \"tendency to be a heavy sleeper\" is just an excuse for people who lack self-control.\n\nI'll sleep the damn day away if I am free to. I love to sleep. I hate getting out of bed in the AM.\n\nWhen I was an immature child, I would do the multiple alarm thing. I would need my mommy to wake me.\n\nBut, on the first day of boot camp, I learned enough self-control to get my ass out of bed, because the consequences for not doing so were frankly too hideous to endure again. Since then, when I set an alarm, I get up to the alarm and get directly out of bed. Why? because I'm not a child who needs my mommy to be responsible for me any longer. \n\nUnless he has a medical condition, he is simply an undisciplined child who wants the world to conform to him.  Not wanting to get out of bed is not the same as being unable to do so.", "No, you don’t blow your nose on the nice towel that you know your partner has up as decor, especially when you’re in a bathroom where there’s toilet paper.", ">There is no snooze, and if I want to turn it off I have to solve math problems.\n\nThis would make me cry. And break my phone probably.", "I used to hide my phone so I'd have to actually get out of bed to turn off the alarm on early exam days", "My partner will hit the snooze and go back to sleep, so he has snoozer set at shorter and shorter intervals, and the final alarm can only be turned off by completing a complex puzzle task thing, which he had to be conscious enough to complete. \nI WFH and always get up before him. He takes full responsibility for getting himself up in time. LIKE AN ADULT HUMAN.", "35, with his first engineering job (first big boy job?), and can't wake himself up to go to work. Are we sure he is 35 and not 8?", "Wow.", "this right here 👆🏼👆🏼👆🏼", "Oh god yes. This man can’t even handle taking care of himself in the most basic of ways. Op should run before having a child with him", "Alarms don’t wake him up? I can guarantee you screaming babies won’t", "He'll get mad on the weekends when the kids wake up. Ask me how I know lol.", "This is the comment. 2 months in and he’s just starting to ramp up.", "Yup. OP should take this situation as a warning sign. This behavior from him will likely continue.", "You know when you have sleep issues, so you ask nicely to your husband to wake you up 😉\nThis type of behaviour is clearly a red flag!", "And it’s crazy to me that so many women take them on. I could never respect my husband if he acted like a bratty teen and then it would be all over.", "Exactly this!! My husband is one of those people who gets really snappy when someone wakes him up. He’s a very hard sleeper and he works two jobs with chronic pain and several heart conditions so he’s exhausted and will act grumpy when being woken up. It’s completely understandable for him to be grumpy when woken up (in my husband’s situation) and he’s always apologetic about it. But he NEVER retaliates for waking him up, or not waking him up in time for work. He usually gets up on his own anyways but occasionally he will over sleep. A grown adult should never retaliate or be vindictive simply because you couldn’t get your own a$$ out of bed! How did he ever manage to take care of himself when he was alone? Did his mommy have to call and wake him up?! He’s childish and she shouldn’t have to put up with his behavior. He can kick rocks!", "People have different circadian rhythms, and the world is already built to conform to people who are more able to get up early. I wouldn't accuse anyone who struggles to get out of bed in the morning of being an 'undisciplined child' any more than I'd say that someone who can't stay awake at night is.", "Blowing your nose on a towel makes you a slob. Blowing your nose on a towel and then talking like a movie villain about it makes you a fucking psycho. OP needs to run before she gets in any deeper.", "I found having my phone far from my bed helped a bit unless I was really tired. I would have to set a new alarm though if I wanted to go back to sleep.", "He seems like the type to get the kids to gang up on mean mommy with him.", "This is a good idea but I’m already annoyed that OP has to listen to multiple alarms in the morning when she should be able to sleep in.", "Or move the alarm clock and leave the place so he has to get up out of bed to turn it off", "Right?! I thought this, too. Not even past the 6 month honeymoon period and he’s already escalating.", "I'd just do it because of what he said in the OP.  He wants to get woke up by OP, she will wake him up alright.", "Does it help to put the alarm out of reach so you have to actually get out of bed?", "And just the beginning!!", "Drop the towel. Keep the cannoli.", "Nah, boogers are very water soluble. Just use some extra soap. LOL", "You forgot slamming doors and being a baby.  But yup.  Sounds right.  No thank you.  Although I am a single father with two dogs hahahaha.  Idk.  Lol", "It helps me to do that and make some of the songs the song I use as the you gotta get up now! So if I’m still in the haze I’ll hear the song and think it’s later and struggle more to get up. I’ve had times where I’ve slept through the first couple alarms like not even registered in my head and it’s playing for 10 minutes then it’ll switch to the next alarm and it’ll click I need to wake up.", "I got the ice cubes! My dad would have loved marbles!", "NTA. You need to run, OP. This was a very clear message from him: “piss me off, and I’ll wreck your stuff.” Next time, the “stuff” might be your feelings, or confidence. Then it’ll be belongings. Then it’ll be your relationships with friends and family. It will keep escalating until he breaks YOU, mentally, emotionally, and probably physically. This is not normal behavior in ANY circumstance, and his behavior will only get worse from here on out. You deserve so much better.", "NTA! He is a grown-up and knows how to set the alarm on his phone; therefore, it's not your responsibility. Before bed, causally tell him to set one.", "I hope he’s good in bed cuz damn girl, you got a handful…", "NTA, it is time for your BF to get responcible for himself. I am married 30+ years to a man who would sleep through screaming babies and barking dogs. Though seemingly somewhat coherent, hubby slept through alarms and hit snooze, but somehow managed to get to work, slightly late, everyday for 35 years. I gave up wondering what time he wanted to wake up about 30 years ago. Being on time was never hubbies thing. I hope you can get through this with BF. He is responcible for his own wake time, not you.", "NTA. Holy. Shit. The stuff before was childish and stupid but actively targeting something you love to punish you? Sorry, but if a partner does that to you, I don't care how good they are about anything else. That level of disrespect is 1000% not ok.", "ESH:  Part of being a **PARTNER** is helping them meet their daily needs and goals.  It absolutely floors me how many adults(?) are like \"He's not a kid, you don't have to wake him up!111! YOU ARENT HIS MOMMMMM\" like, grow the fuck up.   Everyone has off days. Everyone has late nights. Everyone has moments where their alarm doesn't get through the fog in their head.    \n\n\nYou should, 100%, absolutely pay attention to that sort of thing.  You should know when your partner needs to head out the door. You should know when things aren't going as normal.  You should have no problem acting, especially when him getting to work benefits everything.  You already readily admit that he pays for a disproportionate amount of household costs.  \n\n\nIt just floors me someone can be like \"I benefit from you going through this meatgrinder but I can't be assed to wake you up or pay attention to the time.\"  \n\n\nAt the same time...? His reaction? Not great.  Just like there's so many crazy people going \"YOU SHOULDNT BE EXPECTED TO HELP YOUR PARTNER!1\", there's a lot claiming this is horrific abuse and some unforgiveable sin.  \n\n\nIt was childish and petty, sure. But created a non-destructive inconvenience.  They're fucking towels and they can be washed.  It's right up there with a pissed SO not ironing clothes and letting their partner deal with wrinkled outfits.  \n\n\nStupid, super petty, not a huge deal.  \n\n\nHonestly you both sound too immature to live together.", "What an AH. This is so disgusting. Leave.", "Another sane person.", "Nice casual sexism.", "Plus his whole \"if you're up and capable of helping, you should\" is BS. She was WORKING, texting with clients. That is NOT available in my book. If I'm logged in and working, then I am not available to get your lazy ass out of bed.", "You type of people are an absolute menace to partners.", "If my wife had done that I would have unplugged the alarm or put her phone in the freezer. \n\nThough I naturally wake up at 6:40 every morning for the past 30 years, which is before her, so there's never been a need for alarms.", "I had a roommate in college who set multiple alarms every day. She never got up for the first one. It drove my absolutely bonkers. One day she didn’t get up for her alarm. I ended up getting up for my class later. I was drying my hair in our room ( a bit of an asshole move). She asked me how I could be so rude. I told her she sets ten alarms every day so how in the hell should I know when she’s supposed to actually be up or not. I was probably the asshole in that particular situation but whatever.", "Tell him to fuck off with the multiple alarms and just set one at 7:45 and he's only allowed 1 snooze. Honestly, that is torture for himself, too. Who wants to be woken up constantly for an hour before you actually need to get up? \n\nWhenever I wake up before my alarm and check the time. If I still have an hour before my alarm I'm trying to sleep a bit more. If I got 5 minutes before, I'm like \"fuck!\".\n\nI got my alarm set for 4:30 am because I have 1 hour drive to work and start at 6:30 am. I snooze until 4:40-4:45, then I gotta get up. I couldn't imagine setting an alarm every 10 minutes staring from 3:30, that would be frigging agonizing. \n\nLuckily, this day shift only lasts until September, then it's back to 1:00 pm - 10:30 pm Monday - Thursday. 5 day weeks are bullshit.", "I did go down that path with this type of guy and can agree…do not. Divorce and useless other parent later, it’s a tough road to follow.", "I'm on Seroquel for bipolar and while I'm generally able to get up on time my boyfriend is super understanding of my situation and he will get me up if I oversleep. One the rare occasions he's about to oversleep I make sure he is up as well.", "I don't think I even asked him lol, he's a light sleeper and my 49 alarms were bothering him so he just said hey you can turn those off, I got you 😂", "✍", "Which kind of gobsmacks me because it seems like there is always a \"tell\" for this kind of behavior.  See what they say about children, see how they act around children. Heck, see how they act around you in terms of housekeeping and sharing the labor.\n\nSo many men with the \"I had to babysit my kids\" nonsense or really just act like they have no interest or part in taking care of their children. \n\nMy Dad was not a \"baby person,\" and my Mom knew that, but when we got a little older he took us places and did stuff with and for us. He took care of his children. He didn't \"babysit.\"", "I know, how awesome is this?! I always used to set my alarm and place the clock across the room on my bureau and have told otehr to do the same but this, this is genius!  I just put my great-niece's marbles in the freezer. We have a guest who is making it our problem to wake them. I am disabled and use wheelchair so when my husband is busy, it falls to me. Next time that I am \"it\", i plan to go place the frozen marbles, all 20 of them, on the sofa bed where he is sleeping and wheel away. I hated having to wheel in and out of the living room multiple times to wake him because he did not get up the first time. Especially after offering him the use of a phone to use the alarm feature and an old-fashioned alarm clock. He says he has an \"aversion\". I've already told hubbie that I have an aversion to this friend staying with us the next time he has to attend seminars in our city. Just gonna remember that \"no.\" is a complete sentence.", "This. This is exactly the kind of behaviour that eventually turns into hitting you.", "He woke up several times that morning but decided to go back to sleep, hoping to keep OP on edge and attentive lest he oversleep.", "They’ve only been living together for 2 months and he’s already shown abusive tendencies and that he doesn’t know how to take care of himself. Better to rip the bandaid off early and move on instead of investing more time and energy.", "It’s been 2 months since he started the job, not since the start of the relationship", "The difference here is that the two of you have an arrangement. There is a big difference between taking the time to understand each other's various needs and throwing a temper tantrum when your partner doesn't make an accommodation that you haven't asked for.  I certainly agree that if OP and their boyfriend had discussed it prior, and set a time he needs to be out of bed by, AND that that is something they are both willing to do, it could be part of a healthy relationship.  I suspect this man has about a 30 second window between \"why did you wake me up so early/late\".  IMO: NTA", "Have you tried physical alarms? Like watches that vibrate?", "God forbid a heavy sleeper tries to account for their heavy sleeping.  Do you want them awake or not?", "Holy hell, I missed that it’s only 2 months in. That’s usually when everything is still sunshine and rainbows and everyone is on their best behavior. Can you imagine what it will be like once he gets comfortable?!", "Perhaps just leave that one towel in the bathroom, hide all the others and let him use it tonight or tomorrow when he needs to take a shower. He'll be pissed then. But it's on himself.", "I have alarmy! The only time it failed me was when I deleted the app, but that was a pretty bad time for me in life all around, and I don’t plan on ever being that perpetually exhausted/burnt out  that my subconscious figures out how to delete the app in my sleep ever again", "If dogs crawling on me doesn’t do it, I don’t think a tickley watch will. 😅", "My husband does this. So many loud ass alarms. Then I’m the one awake not him.", "I'm an April fool's asshole, especially when I had roommates I actually got along with", "I used to shower at night. I would take 15 minutes each evening to pack a drink (I do not drink coffee but when I could, set the pot to brew immediately before I woke, set out the travel mug right next to coffee pot), protein bar, piece of fruit and a napkin then place the clothing I planned to wear the next day out - underwear, bra, shirt, pants, socks, shoes, jewelry, coat, hat, gloves everything -  so when I got up in the morning, it was all right there for me. All I needed to do was pee, wash hands and face, brush teeth and hair, get dressed, grab my packed breakfast and walk out the door. Time from waking and walking out the door was 12 minutes, 7 if I was being paged for an emergency. Being prepared makes a difference, especially if you are not \"a morning person\".", "I was camping once and a bolt of lightning hit the ground in front of a kids tent. Everyone else was up and freaking out, he didn’t even realize.", "Lol I feel your pain, I have a 20 lbs monster cat that will walk all over me and make biscuits while I'm sleeping and I'm still out. Partner has been like 'wtf how even'", "There are powerful vibrating mats that can go under your sheet. My friend growing up was deaf and the hardest sleeper on the planet. The mat helped her be able to get up.", "XD ahahahaha! Shouldn't have taken that, but if you can help it after that, then it just wasn't that he couldn't help it, it's that it wasn't important enough to him before the crotch shot.", "I’m glad you have a solution. I’m not a morning person myself and responding to an alarm has never been my favorite thing. I managed to do for years but I’m mighty glad to be retired.", "Some people on Reddit immediately jump on a characteristic calling it abusive. I think some acts/behaviors do tend to come clustered together and as a whole or are actually a sign of someone who is abusive. However that one behavior (setting multiple alarms, being grouchy if you kick them out of bed) isn’t something I would consider abusive either. Maybe it’s because I’m a horrible morning person as well. \n\nYou know how he treats you overall. And you have your outside perspective with the therapist. Don’t let them bother you.", "Sounds like a bunch of basement dwellers just like to attack on everyone and everything bc at the end of the day they just want you to be as miserable as them... Relationships are give and take... Good days and bad... There's a reason why so many armchair qbs here lol if you're getting relationship advice from ppl on Reddit u got bigger issues then your post...  Glad u seen to get it tho. Good luck to you and yours future!", "This is probably in part because the people that offer red flags have ways of making the people they mistreat feel like they’re the ones doing something wrong.  They thrive off of blame shifting and stirring confusion", "Not walking the cat 🐈 ☠️", "I know this isn’t about child rearing but I would just like to point out that: if the punishment doesn’t relate to the behavior, it can cause fear about being punished if being punished is a more frequent occurrence. Just some thoughts to sit on and do with as you will.", "I had to re-read the ages after seeing your comment. What in the actual is going on. He is nearly 40 years old and needs his mom, I mean younger girlfriend to wake him up for his own job?", "I had not heard of those, just looked it up on Amazon and it is on sale for 25% off!", "I love Alarmy! If you ever want a physical alarm, Clocky is great. It jumps off your nightstand and runs around your room. You have to chase it to shut it off. \n\nI’m super grumpy in the mornings, but by God, I turn off that little bastard every time.", "Being crabby when just waking up is also one of the most common human traits. Lol.\nLike...who is in a good mood when they're brain isn't fully on yet?\n\nI am crabby but moreso silent treatment crabby if woken up...and I get woken up A LOT by a needy cat. XD", "> Nobody is perfect, but no good person is lazy, entitled, and vindictive.\n\nAnd abusers aren't 100% awful all the time. They have \"good sides\", and in a partnership you'll have good times. It's not about the good sides and it's not about the good times. It's about what he does when he's *not* good that's relevant and that qualifies as abusive. There are no scales that measure how much good there has to be to outweigh the abuse.\n\nAnd abuse doesn't start with a black eye. Destroying, damaging, but even just soiling something she values or that belongs to her in such a nasty way to punish her checks all the marks of abuse.\n\nIt's heartbreaking how well it works. Instead of reconsidering the relationship, she considers changing her behaviour.", "My 14 year old knows better.", "I feel like there's alternatives that a lot of people never tried though, besides having someone be your personal alarm.", "If anything on or in my bed vibrates I'm staying in there longer😆", "There are alarms which wake you up via light and ever increasing sounds (like birds chirping, waves, etc.). The light simulates a rising sun. By the time an actual alarm goes off, you realize you’ve been partially awake for a little bit. Like just barely conscious of the light and noise. Those lights are also nice ways to wake up.", "Maybe he's only recently been qualified as an engineer? May not necessarily be his \"first big boy job\", no need to be like that..\n\nStill absolutely doesn't excuse him from not being able to get out of bed for work. I've dragged my ass out of bed after not even 2 hours of sleep and been on time for work, and being on time is something I struggle with regularly (ADHD and time blindness that comes with it).", "Exactly! Just run now. I know what this story looks like in 20 years, when you go away for work and he puts garbage in your car for a week, just get out when it's easy.", "Finally, a sane person.", "This comment was way too far down. They should have a conversation about this (and should have before it got to this point) \n\nI can also sleep through any alarm. I even hit snooze or turn off alarms in my sleep. I can’t help it or stop doing it. My husband knows and will wake me up I sleep past when I’m supposed to be awake. I can’t imagine him looking at me calmly, knowing I’m about to freak out about being late. If I have something really important to get up for, I even message my mom and ask her to call me in the morning to make sure I’m awake.", "“LOOK WHAT YOU MADE ME DO TO YOU!!!”", "I was stunned at the age. If he was 22 and this was his first job out of college, you could chalk it up to learning to adult. How has this grown man functioned until now?", "This is her future with him after children:\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/uuhzi2/aita_for_not_waking_my_partner_up_and_causing_him/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2"]}