{"id": 23114, "submission_id": "159bck4", "title": "AITA for not letting my mom facetime with my toddler?", "selftext": "My mom (58F) and I (32F) have always had a tense relationship. For most of my life, she has had a pretty serious drinking & drug problem (i.e. disappearing for days to do crack). In 2018, I was diagnosed and treated for CPTSD bc of the way her actions impacted me. Now, I'm happily married with a toddler daughter and another on the way. \n\nMy mom has chilled out a lot thanks to finding the right medication. Although she still likes her drink. I told her about the way her behavior has deeply hurt me, and she was remorseful and apologetic. \n\nLast year, I asked her to be my nanny. I paid her $2,500/mo to watch my kid 4-5 days/ week while I WFH and sometimes she would stay on the weekends so we could go out. \n\nHer drinking makes me uncomfortable and triggers my anxiety big time. When she would stay over, she would often get a 12-pack delivered and drink the whole thing.\n\nI've told her a few times I don't want to be around her drinking and I don't want her to drink while she is responsible for my kid. She said she understands, but the problem persisted. Since this behavior peaks my anxiety, I would often get snippy and short with her. \n\nIt all came to a head\n\n. My husband and I were going to see 3 nights of our favorite band in another state where my aunt lives. Originally, we were going to leave mom and kid at home. We brought them both so they could spend time with my aunt. We set a clear expectation that my mom would only drink the first night before the concerts and that she would wake up every morning by 9 to take over toddler duties.\n\nWhat happened was that she drank a 12-pack every night, never woke up before 11and never took over toddler duties. In the evenings while we were gone, my aunt watched my kid. \n\nOn night 3 of the concerts, I got a fever and couldn't go. My aunt had other plans and left. I came upstairs to find my mom drinking again and playing with my daughter. When confronted, she told me that she doesn't think her drinking is a big deal and that I'm an adult now, and I need to get over it. That just bc she couldn't drive a car doesn't mean she can't watch a toddler. Basically implying that my feelings are not valid and that I'm too hard on her.\n\nThat was 4 weeks ago. Since then, I'm back in therapy bc of the way this is tormenting me. My kid is in daycare. \n\nMy mom has sent a few texts indicating she does not think she has done any wrong. I feel like I can't be around someone who doesn't respect my boundaries. She asked if she could facetime my kid and I told her we need space. She told me that I'm being cruel for keeping my toddler from her saying \"I should have known you would do this to me.\"\n\nI don't know that I want to cut off contact with her forever, but I do know that I'm not ready to talk to her and I don't want her as my childcare anymore. Any ounce of remorse would make me feel more inclined to facetime with her, but I don't think that is coming any time soon. \n\nSo, AITA?  ", "created_utc": 1690298121, "permalink": "/r/AmItheAsshole/comments/159bck4/aita_for_not_letting_my_mom_facetime_with_my/", "score": 85, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) what action you took that should be judged - Not allowing my mom to facetime with my toddler at this time. (2) why that action might make you the asshole - I could be considered an asshole because maybe my response to her actions is too harsh and it is too hurtful to withold contact with my child.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH.  No comment on the FaceTime.  But you let an alcoholic watch your toddler?  When she showed you time and time again that she was drunk while watching your child?!\n\nAs Pam from the office said, “When a child gets behind the wheel of a car and runs into a tree, you don't blame the child; he didn't know any better. You blame the 30-year-old woman who got in the passenger seat and said, \"Drive, kid; I trust you.\"”", "ESH\n\nAnd I'm genuinely shocked by all the N-T-A judgements.\n\nHow the hell is OP not an AH for asking the mother who gave her cPTSD with her drug addiction and alcoholism and who is still openly drinking and massively irresponsible (and barely even pretends otherwise) TO BE HER TODDLER'S NANNY?! And leaves the baby alone with this woman repeatedly!\n\nWhy on earth would you deliberately choose this person to be your baby's caregiver, knowing that she left you permanently traumatized from your own childhood? You state that you have had ongoing trust issues with her this entire time. What on earth were you thinking asking her to be responsible for your child's well-being, even with you in the house, much less leaving your toddler alone with her on the weekends while you went out? She should have been the LAST person you would choose to watch your kid. It's like you don't care about their safety at all! JFC.\n\nOP, your mother is an AH for all the obvious reasons, but your judgement is just as severely impaired if you're asking her to be your child's caregiver knowing that she is an irresponsible alcoholic who can't be trusted, and your only safety precaution despite all of this is repeatedly telling her, \"Don't be like that anymore,\" and believing her when she says she won't, despite a literally LIFETIME of evidence that she can't be trusted. The FaceTime thing is a complete red herring; it's a meaningless gesture, too little, too late. You seem to have no common sense at all with regards to your own child's well-being and safety.", "ESH. You gave your Mom WAYYYYY too many chances, especially with your kid. She needs to find a program. \n\nNot being able to have contact w/ grandkid is a significant motivator for her to get her shit together.", "ESH, u knew what ur mom was for a long time and convinced yourself she was better in hopes it would heal childhood you. Now, you are upset because she followed the same pattern of behavior, this time around your children. You let the cycle continue, and u need to stop it. Stop it for you, stop it for your kids. She’s an addict and HAS BEEN, you KNEW this, and let an addict watch your children ALONE quite often. You’re NTA for saying no, but ESH because u knew the entire time what was going on. U knew asking her to stop wouldn’t do any good whatsoever, and u still rewarded her with your kids and a check. Don’t let her near your kids alone again, before they have issues with YOU when they’re older that stem from your childhood issues with your mother.", "You let a drunk babysit your kids?", "ESH\n\nNow, why would you hire your mother, the source of your childhood trauma, to nanny your children? I feel like you definitely could have seen this coming.", "ESH- why the hell would you let your mom watch your toddler if she’s still drinking and she gave you CPTSD??!! Your mom is TA for the obvious.", "I don't think you think YTA.  I think you're looking for advice on how to handle this situation and that's fine.   \n\n\nThink about it this way:  If you hired a regular nanny - and found that she'd been drinking a 12-pack while looking after your kid - wouldn't you fire her on the spot?  \n\n\nIt shouldn't be different from your mom.  You know from first hand experience what addiction does to kids.  You have every right to set boundaries.  You have a right to let her know that she's not welcome around your children until she gives it up.  This is a safety issue.", ">When confronted, she told me that she doesn't think her drinking is a big deal and that I'm an adult now, and I need to get over it.\n\nOr, and I'm just spitballing ideas here, she can be an adult and not drink all the time while around a toddler who's mother told her not to. Just an idea here.", "????? Why would you hire this woman?", "NTA for limiting contact now. YTA for hiring an alcoholic in the first place.", "You let this go on FAR too long. This is the safety of your child we are talking about. You allowed your mother to run roughshod over your boundaries and you should have stopped this at the very first boundary break.\n\nThat said, you are now doing the right thing.\n\nYou need to block your mother. You need to stop listening to her and you need to stop explaining. She's gone WAY over the mark and is in NO place to attempt to negotiate any kind of terms.\n\nYour duty of care is to your child, not your mother.\n\nYou are NTA for saying no to the FaceTime. It's the right thing to do.\n\nHowever, you need to seriously sharpen up your NC with her. You need a break from this eternal pantomime and you need time to consider your relationship and your child's relationship with your mother going forward. Unsupervised should NEVER be an option after this. Personally, I would be seriously considering any kind of relationship after this. She's showing you very clearly who she is and that's an addict, a liar and a manipulator. Is that really who you want around your daughter, your husband, and you?\n\nNTA", "ESH. My dad was similar to your mother, although we live 5 minutes away from each other and for years even lived together when I was taking care of my dying mother, that man has never been in a room alone with my child. I cannot imagine asking him to babysit or be in charge of my child overnight, even though personality wise he is night and day from l but he was like when I was a child.\n\nEdit: if she comes to you, and apologizes, and says that she was wrong and nothing like this will ever happen again, don't f****** let her watch your kid again anyway.", "ESH.  Addicts gonna addict, but you were a horribly negligent mother, too.", "I think soft YTA.  Your mom is not fit to take care of your child.  If something bad happened because she was drinking, how would you feel?", "NTA. You set a clear boundary, your mother agreed to it, and then she violated it. If any other person you hired/asked to care for your child did these things, would you hesitate to switch providers?", "NTA. Your mother is an alcoholic, doesn't matter if she doesn't think it's an issue. She is well aware of the situation and is trying to emotionally blackmail you. Make sure your child is safe, make sure to tell daycare employees that grandma is not allowed to pick your child up under any circumstances. Go low-contact if you don't want to cut her off completely and do not leave your child alone with her.", "NTA - keep the drunk away from the kids should be a basic rule", "You have more of a problem than not letting your mom FaceTime your kid. You have a mom who's an alcoholic who replaced one addiction (drugs) with another (drinking). And doesn't see that she has a problem. You also knowingly let her drink/be drunk around your kid and watch them while you were away. What if something would have happened? Your kid got hurt? Who would take her to the hospital? Or if something happened to your mom, who would take care of your kid? You put your kid in danger. Time to cut off grandma til she gets her shit together.", "NTA. But you have a choice, adult who has children. Make it.", "NTA. In fact, because she doesn't understand what she did wrong means she has absolutely no gauge for appropriate behavior, which also means that drinking is just one thing. What's next, is the next question. If she can't gauge that drinking and driving is just as bad as drinking and caring for a toddler who needs your constant attention, then what else is she not going to consider a big deal that really is a big deal? Good for you for putting your children first and for seeking therapy.  Her feelings being hurt is not your problem. Her loss of a relationship with your children is not your problem. Finally, if she should've known you would do this to her, then she should've known not to drink so you didn't have to do it.", "NTA - your child is your first priority and safety, and you set boundaries that are REALLY MINIMAL..  A grandparent deserves exactly as much respect as they show to the parent, and she has made it clear she has none.  Focus on your child (soon to be children) and your family, do not trust your daughter's safety to the hands of an alcoholic.", "NTA. Your mother is an alcoholic, her judgment is impaired. You need to put your children’s  safety and mental well-being above all else. Set your boundaries with your mother, tell her she has no contact with your children until she is completely and 100% sober right now. It’s your responsibility to protect them from being exposed to her alcoholic behavior.", "\"I should have known you would do this to me.\"\n\nYep.  What is happening was always a possible consequence of your mom's actions.  But she did it anyway.  NTA", "You're looking out for your child's welfare.  Her always being drunk around your daughter is not healthy.  It will not produce a healthy relationship with your daughter & you would be enabling her.  The situation is not good for anyone.  If she wants to see your daughter she has to be sober.  PERIOD.", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mom (58F) and I (32F) have always had a tense relationship. For most of my life, she has had a pretty serious drinking & drug problem (i.e. disappearing for days to do crack). In 2018, I was diagnosed and treated for CPTSD bc of the way her actions impacted me. Now, I'm happily married with a toddler daughter and another on the way. \n\nMy mom has chilled out a lot thanks to finding the right medication. Although she still likes her drink. I told her about the way her behavior has deeply hurt me, and she was remorseful and apologetic. \n\nLast year, I asked her to be my nanny. I paid her $2,500/mo to watch my kid 4-5 days/ week while I WFH and sometimes she would stay on the weekends so we could go out. \n\nHer drinking makes me uncomfortable and triggers my anxiety big time. When she would stay over, she would often get a 12-pack delivered and drink the whole thing.\n\nI've told her a few times I don't want to be around her drinking and I don't want her to drink while she is responsible for my kid. She said she understands, but the problem persisted. Since this behavior peaks my anxiety, I would often get snippy and short with her. \n\nIt all came to a head\n\n. My husband and I were going to see 3 nights of our favorite band in another state where my aunt lives. Originally, we were going to leave mom and kid at home. We brought them both so they could spend time with my aunt. We set a clear expectation that my mom would only drink the first night before the concerts and that she would wake up every morning by 9 to take over toddler duties.\n\nWhat happened was that she drank a 12-pack every night, never woke up before 11and never took over toddler duties. In the evenings while we were gone, my aunt watched my kid. \n\nOn night 3 of the concerts, I got a fever and couldn't go. My aunt had other plans and left. I came upstairs to find my mom drinking again and playing with my daughter. When confronted, she told me that she doesn't think her drinking is a big deal and that I'm an adult now, and I need to get over it. That just bc she couldn't drive a car doesn't mean she can't watch a toddler. Basically implying that my feelings are not valid and that I'm too hard on her.\n\nThat was 4 weeks ago. Since then, I'm back in therapy bc of the way this is tormenting me. My kid is in daycare. \n\nMy mom has sent a few texts indicating she does not think she has done any wrong. I feel like I can't be around someone who doesn't respect my boundaries. She asked if she could facetime my kid and I told her we need space. She told me that I'm being cruel for keeping my toddler from her saying \"I should have known you would do this to me.\"\n\nI don't know that I want to cut off contact with her forever, but I do know that I'm not ready to talk to her and I don't want her as my childcare anymore. Any ounce of remorse would make me feel more inclined to facetime with her, but I don't think that is coming any time soon. \n\nSo, AITA?  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Tell her she has shown that drinking is more important than spending time with her grandson. So go drink. I send you a pic now and then.", "No hun, no.  Do not leave that alcoholic disaster with your baby!  She doesn't deserve to be a grandma.  You don't owe her a thing.", "You set boundaries and stuck to them!\nShe’s facing the repercussions of HER actions. You didn’t do this, she did. You’re rightfully not comfortable with drinking around your daughter, you drew this line- the fact is your mother is choosing alcohol over her grandchild. I’m sorry this is the situation you’re in I think you’re doing the right thing NTA", "ESH her for obvious reasons, you for asking your terrible mother to be a nanny to your child.", "ESH - Why exactly did your ask your mother, whom you KNOW has substance and alcohol abuse issues to the point where you have PTSD because of it, to be your child’s nanny?\n\nYou’re asking about FaceTiming, but in truth that question is irrelevant. Your mother’s judgement is clearly impaired, but yours is just as bad. Alcohol and substance abuse has become so normalised to you that your perspective is skewed even with the therapy. You asked your mother to care for your toddler, despite knowing that your mother drinks that amount all the time. The fault here is just as much yours.", "ESH. I also have CPTSD. Not only are you subjecting your kid to the source of your ingrained trauma, you’re subjecting her to the version of you that is *still actively being triggered by that source.* \n\nI don’t mean to be presumptuous but if I were to go based on my own experience, I’m basically radiating stress, fear, panic, and insecurity when my mom is even the topic of conversation. You don’t want a kid to deal with all that, especially directed at family member.", "op=NTA for going no facetime/low contact\n\nbut what the Feck where you thinking allowing your mother to care for your toddler REGULARLY While she was drinking a 12-pack on a daily(?) basis????????\n\nI wouldn't allow a babysitter/nanny to drink ANYTHING while on my dime! and with her history I'd be performing breathalyzer tests when she arrived each day.", "OP's mom is the kind of person you don't allow unsupervised with your child, and OP decides to pay her for childcare...", "I agree! I was shocked when I read that after everything OP hired an alcoholic as a nanny? And continued to let her BE the nanny when she kept drinking when she stayed over night?\n\nI don't let people drink near our children. I was very concerned with possibly celebration Christmas with the in-laws because of that one uncle that always get hammered. Well, we don't celebrate Christmas with them anymore, or any other holidays since all of them includes more alcohol than we want our children to be exposed to.\n\nOP, you finally did the right thing! Don't change your mind and keep to the break from your mother. Also, arrange for someone else to babysit for you when baby number two is about to be born. Don't give your mother another chance until she can prove to you that she's sober and then only supervised visits with your toddler.", "Right? I guess not having to bother looking at other childcare options and being able to go to a concert were just the most important things.\n\nThose poor kids.", "One of my parents subjected me to the other one who was a raging alcoholic. I haven’t spoken to either of them for a decade, and several decades.  This is your future.", "To be clear, when she stayed over on the weekends she usually wouldn't start drinking until after my daughter was in bed. But still, if I came home to find my babysitter completely wasted I probably wouldn't let them watch my kid again.", "Right? Like OP just let a drunk babysit her kids while going to a concert!?", "Wait OP zi’s an AH for stopping her mom from seeing her daughter now that she’s found out that her mom does not stick to agreed upon boundaries?", ">If something bad happened because she was drinking, how would you feel?\n\nWhich is kind of the reason that OP told her mother not to drink around her child. Just saying", "I have a feeling she knows *exactly* what she did wrong. I think she's gaslighting the F out of OP.", "It blew my mind.  And she’s coming here for sympathy?  Girl, you’re lucky nothing bad happen to your child or that CPS didn’t get involved", "Heck, even if it was supervised, I'd make sure it was heavily supervised. Especially if the mom is regularly downing a 12-pack in an evening", "Let's be real, it was probably about money.  $15 an hour is a steal for a fulltime nanny, but OP got what she paid for.\n\nI have CPTSD from a childhood with an addict, too.  I wouldn't let my bio dad alone in a room with my cat, never mind a human child.", "This is a great point.  I'll never forgive the people who exposed me to the adults who traumatized me as a child, either.  They're not innocent just because they were once hurt kids, too.\n\nIf you can't put your own mommy issues aside, don't have kids and subject them to your abuser.", "\"Usually\" and \"probably\", this is unacceptable! I expect MORE from friends and family that babysits for free.", ">probably\n\nSo you've got a second kid on the way and you've learned nothing from this?\n\nStop trusting losers with your babies!", "That's 100% reasonable, because something could still happen after you child has gone to sleep, e.g., they wake up, get sick, fire. You want to know the person watching your child is capable of reacting if an emergency happens, which you can't be confident about if they're drunk or high.  \n\n\nNTA", "\"I'm sure *this* will be the weekend she turns it all around!\"  - OP, a few days ago, freaking apparently.\n\nI understand wanting to pretend everything's fine, denial is a coping mechanism, but you lose that luxury once you become a mother yourself.", "Yeah, except she's been letting her this whole time.  I dunno.  I guess it's better she is sticking to some boundaries.  I hope it lasts.", "You know what, YTA. You left your innocent, helpless toddler in the care of a drunk for how long? I can't believe you'd be so foolish. You had the money for care. You just chose to go with an abusive mother instead. \n\nGood God. I'm glad you woke up, but I am BAFFLED by your decision-making.", "ESH. She is just an awful, awful human being. But to be honest, you KNEW she was drinking in your house. You let her be around your child anyway. The first time you saw her hold an alcoholic beverage would have been a great time to tell her she needs to stop coming around your child and yourself. You know she’s an addict and you know how addicts behave. Instead, you took her on a trip?! Keep going to therapy and do not give her a third chance to F up. Twice should be enough.", "I’m voting NTA, mostly bc everyone else has already made it clear that she should not have been watching your kid, ever, and it seems like you’ve realized that mistake as well. Child care is difficult, and really expensive. I understand why you made that choice, even though I think it was the wrong one.\n\nHowever, I’d consider offering her some way to have contact w/ your kid in the future. Maybe like, no in-person visits until she’s in a program? I have some sympathy for her, mostly as a former nanny myself, even though I doubt she deserves it. My heart says to let her have a brief FT with the kid (like, 10min max) every week or so, but honestly, maybe you should ask your husband to coordinate it, if he’s willing. \n\nI think you should clearly state boundaries and the conditions she needs to meet to be welcome in your life, let her do short FTs with the kid (and only the kid: literally, start the call with the kid in frame, and say “bye”and hang up with the kid. no chat before or after). Then go NC until she does better, and focus on yourself.", "YTA for letting a known drunk babysit your children. \n\nGoogle when you want a free moment: Tracey Nix", "Why would you expose your child to this. If she is not seeking treatment she doesn’t deserve to be in your child’s life. You have been very lucky that your child has not had an accident or something happen to them under her care. FFS do fucking better. YTA", "OP, what I get from your post is that you wished so much for a functional relationship with your mother that you loosen up your boundaries just to have her in your life. But as you saw history more or less repeating at the third day of the concert, you realized that your mother has not or only particularly changed. If you want advice, here is mine: don't let your mother face time with your kid, you don't know what she will say. For your toddler: if she asked, tell her that grandma has to sort things out and it will take longer. For your mother: she is denying what she did to you and what effect it could have on your kids. She has to because otherwise she has to admit her wrong found and her addiction to alcohol. Tell her she should go to the anonymous alcoholic and try to find out there what she is doing wrong. Maybe that opens her eyes. And as hard as it is: don't let her in your life until she gets it. It would only hurt you and your family.", "ESH. When you become a parent it is your responsibility to protect your children. I am sorry your parents didn’t protect you, but you knew that your parent was an alcoholic who is in denial. It isn’t like she was a recovering alcoholic who relapsed, from what you wrote she has been actively drinking the whole time and you exposed your child to that. It is your job as the parent to establish boundaries and maintain them, especially to people that pose a threat to your child. I say this as someone with children with a complicated relationship with my own mother. It is not easy, but your children need to be your priority not your mother’s feelings. Until she chooses to accept responsibility and change there shouldn’t be interactions with your daughter.", "ESH your mother more but you allowed her to continue drinking around your child when you set a boundary. She ran across the boundary and you did nothing. Of course she thinks she’s done nothing wrong, you let her do it.\nYour mom is the AH for drinking around your toddler and invalidating your feelings. \nThe only thing you need to tell your mother is “My daughter and I will not be around you when you are drinking.”  Put on repeat as many times as necessary and stick to it. There is no need to say anything else. You have to show your mom you are serious about this. If she’s good for a while and she slips you have to leave the situation or ask her to leave if it’s at your house.", "YTA. You let an alcoholic watch your baby. Did you think alcoholics followed a schedule?", "Applause, applause, applause....WTF  OP YTA.  You endangered your kids lives.", "My former step-uncle let his mother move in with him and his wife under the premise that she would watch their two very small children while they worked.  She swore she wasn’t drinking and they believed her.  Until they found wine bottles stashed in the nursery.  \n\nThis post reminds me a great deal of this and I completely agree with ESH.", "Agree", "No they're saying OP is an AH for letting a proven irresponsible drunk babysit their child. The fscetime thing is completely irrelevant amongst the shitshow of this story", "Yeah, because telling an known alcoholic not to drink works.  /s  OP is an A for having an alcoholic take care of her kids putting them at risk.", "You should not have children. You think it is A-OK to leave them with an abusive drunk. Get your head out of your butt.\n\nI am a parent, and your post is INFURIATING.", "Oh good, I'd hate for your kid to wake up from a nightmare or have an accident and find a sober adult that night. That would suck, huh\n\n/s"]}