{"id": 23134, "submission_id": "159qth2", "title": "AITA for calling the police after my neighbors stole from my garden?", "selftext": "Throwaway because friends know my main.\n\nI (F30) grow a lot of the food for my household, which is myself and my husband. I've worked really hard on my garden for the past 5 years and I'm really proud of it. \n\nI've noticed this year though that my garden hasn't had quite the yield it has in the past. I at first blamed it on our recent weather. But then I started to notice that it looks like someone, or something, had been in my plants. A couple things were knocked over, the soil was more compact, a few things had been moved. I set up some trail cams to maybe see if I had foxes or raccoons (which are frequent visitors, must to the disapproval of my dogs). \n\nWell after a couple of nights, I saw our neighbors walking through my lawn and helping themselves to the vegetables. I was pretty taken back. I don't know them well but we wave at each other when we see each other. But definitely not enough that they should think they have the right to come over and help themselves.\n\nI saw them outside the next day, and went over to talk to them. I just said \"Hey I noticed that you guys were taking some of my vegetables. Unfortunately that's food my husband and I really depend on, so I really need you to stop.\" They at first got indignant, but I told them I had them on camera. The conversation ended on a sour note but I thought we had reached a conclusion. \n\nUntil I checked my cameras again and saw them AGAIN. The first thing I did was install locks on the insides of my fence so they couldn't get in, but then I took the footage to the police. I told them I didn't want them charged with anything, but that I had already told them they couldn't do that and it was ignored, and I wanted a paper trail. \n\nWell I saw an officer at their door the next day. After he left, the woman came outside and started screaming at the house that they were hungry and had kids to feed and she couldn't believe I called the police. I just ignored her and haven't seen them since but I was talking to my friend and she said it was an asshole move.", "created_utc": 1690332653, "permalink": "/r/AmItheAsshole/comments/159qth2/aita_for_calling_the_police_after_my_neighbors/", "score": 1776, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I called the police on my neighbors for stealing from my garden.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA this is trespassing and theft! Her children are not your responsibility and she’s only mad because she got caught. Previous Redditors have solved this problem with motion controlled sprinklers designed to stop pests. Good luck.", "NTA- they broke into your backyard & stole from you. \n\nIf they “have kids to feed” I’m sure there are some food banks around you they can go to instead of stealing from their neighbors", "NTA. They were stealing. If they needed food to feed their kids, they should’ve asked for help. Based on their reaction, it sounds like their kids only “needed” the food after they got caught.", "You *gave* them an opportunity to correct their behavior. I'm genuinely curious what your \"friend\" thinks the next step would have been given that these people were unrepentantly stealing from you even knowing that they were on camera\n\nBut regardless of what she thinks the next step should have been, NTA", "NTA. \n\nTo start they were trespassing. \nThey were stealing. \nYou confronted them and gave them a chance to stop. \nThey did it again. \n\nDefinitely NTA here. You did the neighborly thing and talked to them first. You didn't have to do that. You went above and beyond to not be an AH", "NTA, why would it be an asshole move to call the cops? You asked them to stop, and they went ahead and stole again. If they have hungry kids, THEY  should garden - press charges if they do it again and for crying out loud, get another friend - the one you have stinks.", "I mean...obviously NTA, why are you even asking this?", "NTA\nWell if it isn’t the consequences of their own actions. You asked them to stop and they didn’t. At that point they knew about the cameras and continued anyway.", "NTA!! people have absolutely zero respect for plants and peoples gardens, its disgusting.", "NTA\n\nIf their kids were hungry the first time you approached them, they would have said it.", "NTA. They stole from you, you tried to talk to them about it, but they continued. This isn’t on you at all.", "NTA. You worked hard on that garden & they stole. You gave them a chance to stop & they didn't. FAFO", "NTA, maybe my conclusion could differ if they had told you their situation when you confronted them, but that is not the case.", "NTA-you didn’t force them to have kids that they can’t take care of. Your garden isn’t a food bank and you aren’t responsible for subsidizing their lifestyle. \n\nIf they retaliate, you most definitely should press charges.", "NTA. They stole from you and kept at it.", "NTA. Seriously, are you supposed to believe her kids are so hungry they'll eat vegetables?", "NTA.  If they are hungry why can't they start their own garden?  Or why not just ask?  They were stealing, plain and simple.", "NTA. I don’t care if she has kids to feed, that does not give her the right to steal from your garden on your property unless you and her had an agreement. Which you did not. Grocery stores exist. Keep that footage and make sure she can’t break that lock off the fence. After this she may definitely try to break and enter into the garden and possibly ruin your garden than just steal food", "NTA. Fuck the thieves.", "NTA. \n\nShe is hungry and have kids.  You are ALSO hungry and have a husband.  They stole from you.  You asked them not to, and they chose to keep doing it.", "definitely NTA, the garden belongs to you, not them", "NTA you asked them to stop and they ignored you, frankly you should have pressed charges then and certainly should at a third offense", "NTA... They're free to grow their own food.", "NTA\n\nIf they're hungry, they need to apply for government support and/or help from a food pantry.\n\nIf these folks are renters, send a copy of the report and video to their landlord.", "NTA. I do feel very badly for the neighbors if they are truly hungry and in need of food, though. That’s really sad if they can’t make ends meet or afford enough groceries. Honestly they probably should have been growing a garden themselves. Really sad.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway because friends know my main.\n\nI (F30) grow a lot of the food for my household, which is myself and my husband. I've worked really hard on my garden for the past 5 years and I'm really proud of it. \n\nI've noticed this year though that my garden hasn't had quite the yield it has in the past. I at first blamed it on our recent weather. But then I started to notice that it looks like someone, or something, had been in my plants. A couple things were knocked over, the soil was more compact, a few things had been moved. I set up some trail cams to maybe see if I had foxes or raccoons (which are frequent visitors, must to the disapproval of my dogs). \n\nWell after a couple of nights, I saw our neighbors walking through my lawn and helping themselves to the vegetables. I was pretty taken back. I don't know them well but we wave at each other when we see each other. But definitely not enough that they should think they have the right to come over and help themselves.\n\nI saw them outside the next day, and went over to talk to them. I just said \"Hey I noticed that you guys were taking some of my vegetables. Unfortunately that's food my husband and I really depend on, so I really need you to stop.\" They at first got indignant, but I told them I had them on camera. The conversation ended on a sour note but I thought we had reached a conclusion. \n\nUntil I checked my cameras again and saw them AGAIN. The first thing I did was install locks on the insides of my fence so they couldn't get in, but then I took the footage to the police. I told them I didn't want them charged with anything, but that I had already told them they couldn't do that and it was ignored, and I wanted a paper trail. \n\nWell I saw an officer at their door the next day. After he left, the woman came outside and started screaming at the house that they were hungry and had kids to feed and she couldn't believe I called the police. I just ignored her and haven't seen them since but I was talking to my friend and she said it was an asshole move.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, it's your garden, your property and yield. You also asked then to stop. However I call BS that you didn't expect the police to go to their house and warn them. You knew what the end result would be. Own up.", "NTA. The first priority you have is to feed your husband and yourself. \n\nYou asked them to stop. They ignored you. They're in the wrong.", ">I was talking to my friend and she said it was an asshole move.\n\nWhy on earth does your friend think this? These people are trespassing, stealing from you, have the temerity to ignore your polite request to cease and desist, and then act as if you have stolen from them. This is ridiculous behaviour. You do not owe them anything. \n\nNTA and your friend is wrong.", "ESH. I get you but remember: If yo see someone stealing food, NO YOU DIDN\"T! Its a rule. Instead of calling the cops, place a basket of what you have extra on their porch with a nice note explaining your situation without embarrassing them... Because, <See above>", "Jeepers creepers. So NTA.  If her kids are hungry, she can grow her own dang food. You can be poor, or you can be lazy.  If you are both, well, than I guess you can be hungry too.", "NTA. She’s stealing from you. If she was trespassing in my yard it woulda ended far worse than a police report with no actual charges filed", "Oh interesting! I would worry about letting my dogs out in the morning with those but maybe I can look into them if things continue. I don't think they can get in unless they climb the fence at this point.", "This the one.", "That's why I wanted to get other people's opinions. Because I do feel bad. But with grocery prices and inflation and trying to pay off student loans, we aren't exactly rolling in it either. That's why I grow so much of my own stuff.", "But why is stealing and not talking to her the first thing to come to mind? They were friendly enough before she found out they were stealing from her. I can’t feel sorry for someone who steals them uses the excuse that they have kids to feed", "Oh I knew the police would go to their house and warn them. I specifically asked them to.", "She thinks because of grocery prices and how many people are struggling that I should have been more understanding.", "You can get ones with a timer!", "So the fact that you and your husband depend on that yield means nothing? \nGive her your thieving neighbours' names and address and tell her to knock herself out with her donations. \n\nWhy are people so free with other people's money, effort, and time, but unwilling to do anything themselves? (rhetorical question). Sheesh.", "NTA\n\nThey trespassed and stole from you.  You spoke with them and they had their chance then to make some case for themselves and their need for food.  If they needed help that was their chance to ask.  Instead they were indignant and chose to trespass and steal from you again.  \n\nI’m all for helping out the hungry but there’s a huge difference between choosing to help someone out and having them just take it.  \n\nYou’re not an asshole and did nothing wrong.  Not only did they take the vegetables from your garden but they also caused you to go through the trouble of setting up cameras and adding locks to your gate.  This is time and expense directly caused by them on top of the theft.", "NTA. It's not even about the veggies to me, it's about sneaking into your property at night to steal from you. They feel justified to take vegetables,  what's stopping them from checking if your doors are locked when you are gone? They have kids which apparently means they can steal from you.", "Absolutely NTA. Such entitled behaviour from your neighbours and they're trespassing. You did the right thing.", "NTA \n\nStealing is stealing.\n\nGo inside her house and take her TV and see how she likes it.", "NTA - They boldy and repeatedly stole something you nurtured and grew for your family. They could have explained their situation and perhaps you could have created a trade agremeent (fix your vehciles in exchange for food). They are not living honestly.\n\nYour friend's comment is short sided. Their stealing to eat is not more important than your family food needs. Nothing is stopping them from gardening in their yard. This family has options: food banks (state and private), apply for nutritional assistance (which often includes local farmer markets, grow a garden, work at a grocery store with food discounts. Best to you! Protect what is important to you.", "NTA. But if you want to try to have a better relationship with the thieves, you could offer to help them plant their own veggie garden.  Could be lots of fun for the kids.  Just a thought.", "NTA. Maybe she should put as much effort in getting a better job and more food on the table then stealing from you. Shit, ironically I bet if she asked you and told you her situation you would have probably given her some, and maybe helped her start her own garden. People love to play victim when they are caught red handed doing wrong. It’s not their fault they got caught with their hand in the cookie jar. It’s your fault for catching them.", "NTA: they were rooting through your rutabaga, raiding your arugula, and ripping up the rampion!", "NTA. You are not the food bank. Gardening takes a lot of time, effort, energy, sweat, sun burns, and money. \n\nThey are stealing, trespassing, and beyond self centered.", "NTA. They trespassed and stole, were confronted, lied about it, and did it again. Calling the police was the logical next step.\n\nDo they even have kids? Not that their having any justifies or mitigates their criminal acts, but I'm curious.", "Definitely give them AAAALLLLL the extra zucchini.", "NTA They trespassed into your private property and stole your hard work", "NTA, and this annoys me so much! Most gardeners I know are SO happy to give extra produce, seeds, advice on planting. If they were decent people they could have introduced themselves and said hey, we are struggling with the cost of living, you have an amazing garden! Would you be able to give me some tips? Maybe help me set up? We could grow different fruit and veg and swap produce.\n\nNo, we will be a thief instead.", "NTA. I garden and work hard for my crop. I love to share my bounty with neighbors, but if a neighbor helped themselves I wouldn't hesitate to call the cops", "NTA. Stealing is stealing, and setting a terrible example for their hungry kids. If they had asked, you might have a different attitude. But this is just unacceptable.", "NTA, but you may have a bad choice of friends", "NTA. That said, if she really needs the food, why not offer to teach her how to grow her own?", "NTA\n\nGive her a bunch of seeds and her family can grow their own vegetables.", "Would be a much different story had they been stealing from me. Don't be a THIEF and people won't contact PD. I'm tired of people like this. NTA!", "Info: what veggies/fruit are you growing that you can’t tell whether they are being stolen by your neighbor vs eaten by wildlife? In my experience wild animals remove the fruit in a way that could never be confused with a human.", "It was a bit passive aggressive,  but she is a thief, so I guess she is more of the asshole and you are just weak", "ESH. What if you had told them you saw them taking food and wondered if they need help? Maybe you could have set up a fair trade kind of system. Maybe there's sthng they could do for you - fix something, make sthng- to \"pay\" for the produce. Getting the police involved was not a neighborly move...", "ESH. What if you had told them you saw them taking food and wondered if they need help? Maybe you could have set up a fair trade kind of system. Maybe there's sthng they could do for you - fix something, make sthng- to \"pay\" for the produce. Getting the police involved was not a neighborly move...", "NTA You asked them nicely and without authorities to stop.  They didn't listen.  So if they're not going to listen to you, the next logical step is the police, as they are trespassing and stealing.  \n\nIf the neighbor's compaint is that they need food (which they clearly know you are successful at growing) why couldn't they reach out to you earlier in the year to see if you'd share tips for establishing their own garden.  Seems like a much better approach. Good grief.", "Good Lord, that is one entitled couple.  Stealing vegetables from someone's garden and using their kids as an excuse.  I'm not sure how I would have handled it but that's what it was, trespassing and theft.  My girls and I love our garden, it's a great bonding experience for us and the dirtier they get digging and picking things the happier they are.  They would be really upset if people stole 'their' veggies.  Definitely NTAH.", "NTA, she is only claiming poverty after being talked to by the police. They didn't mention that the first time you spoke. I wouldn't believe a word they say.", "NTA, that's your hard work put into that. You tried talking to them. It didn't work. You didn't fly off the handle and accuse them without evidence. Also didn't volunteer to be a free food supply for them. And, they're trespassing too.", "NTA.  I like how they claim they need the food, conveniently ignoring that you're growing it for the exact same reason.", "NTA… if your neighbors want fruit/vegetables tell them to grow them, themselves! Stealing is stealing… trespassing on private property to take what is not theirs is against the law. \nYour neighbors are huge fucking AH’s", "NTA.\n\nHer claim that they \"are hungry\" and \"have kids to feed\" does not trump the facts that you are hungry too, the crops are yours, they are on your land and it's not okay to trespass in order to steal.\n\nWhy can't your neighbours take your crops as inspiration and plant their own rather than steal yours?", "NTA. This is theft. Your friend is the AH. Let her come over and grow your plants. She obviously doesn’t understand the work that goes into gardening. You did the right thing!", "NTA and your friend is short a couple of gourds. It takes a lot of work to grow food and it was really slimy of your neighbor to steal your food then yell at you when she got caught.\n\nGlad you went to the cops and don't hesitate to do it again. Your neighbor is a sh!thead.", "NTA \n\nAs someone that’s just beginning my gardening it’s a lot of work. They’re not just taking your food but also stealing your time, effort and supplies.", "NTA. This is some bs.", "NTA.\nIf you wanted to go above and beyond, you could offer seeds, seedlings or knowledge to help them set up their own garden but this also isn't your responsibility.", "NTA \n\nYou need and count on that food. If they needed food that badly, they should have asked for any extras you have.", "NTA. should of pressed charges. They won't learn otherwise.", "NTA stealing is wrong", "Nta- there are programs to help her feed her children.", ">...woman came outside and started screaming at the house that they were hungry and had kids to feed \n\nThen plant your own garden!\n\nNTA", "NTA  They were stealing your food and when they got caught they completely ignored you and continued stealing. Then tried to play the kids need food card when you called the cops. There are plenty of available food resources for her family. I don't understand how people can feel this entitled and brazen!   Ask your daft friend how she would feel if someone was stealing money from her weekly. Would.she call the police then?  I bet she would.", "NTA.\n\nIt is unfortunate that their family is struggling, however that does not excuse stealing from a neighbour, who for all they know, could be struggling just the same. It is also not your responsibility to ensure her children are fed, and I am sure if the neighbour was to strike up a friendship of sorts and take interest in you and your gardening hobby, that you may very well be gracious enough to share on the odd occasion.\n\nMy father has a veggie patch and when he gets a decent yield, will take some to his neigbours, but only because they are all friends and communicate regularly. You gave them a chance by approaching them first in a civil manner, and they pretty much spat in your face.\n\nYou did the right thing.", "NTA\n\nThey must be hungry given how lacking in moral fibre they are.", "NTA. Your friend has poor judgment.", "That is not your friend. \n\nThe person who told you that you were an asshole for reporting theft to the police after warning the theives and them being dismissive of you? That is not a friend person. \n\nThe neighbors stole from you. They broke into your garden multiple times to steal from you. They took vegetables that were the products of time, effort, and money from you. They stole more than a few turnips and your friend should realize this. \n\nYou are NTA here but honestly...ditch the \"friend\". They can buy veggies for your neighbor if it is such a big deal for them.", "Since it’s good YOU need, you’re NTA", "NTA\n\nThey definitely are and from the sounds of it, your friend may be an AH too.", "NTA. Literally stealing the fruits of your labor. Maybe if they had asked nicely, the result would be different.", "NTA at all! And tell your friend to shut it. I don’t see why the neighbour couldn’t have just asked you. How entitled do you have to be to think your neighbours produce is yours to take. Some people are just ridiculous. Her children are not yours to support.", "NTA I have hungry kids too. Would’ve been asking for tips", "NTA. Very clearly. They can grow their own food if they’re that hard pressed", "NTA - they are thieves", "NTA - your friend who called you TA is an AH if they’re not willing to donate to your neighbor with hungry kids. Not on you.", "NTA\n\nYour friend is kind of a jerk though. You told the neighbors that you and your husband depend on the food you grow and they willfully ignored you and stole from you again anyway. Ask ypur friend, why is *your* hunger less important than your neighbors? \n\nThere are community gardens and all they'd have to do is look on local Facebook groups for free garden yields. People are always giving away what they can't use *for free*- generally because they grow too much. \n\nHopefully they dont try to sabotage your garden. Neighbors like that are the type to dump salt into people's gardens to ruin it for everyone. Definitely look into getting some type of deterrent system.", "You were smart, not an AH. You deserve the rights to your own harvest. People share fresh vegetables with neighbors when they can and want to, not when the neighbors come over and steal.", "NTA - You didn't know their situation on feeding themselves and their children, and even if you did that isn't your problem, it's theirs.\n\nFurthermore, if they wanted some free veg from you, they could have asked for it (I suppose).\n\nFinally, word of advice, you might want to get cameras around your whole house now. If they're willing to trespass literally the night after being told not to, I can guarantee the husband and wife had a conversation to the effect of, \"Who the hell does she think she is? We'll show her and get some more!\"\n\nIf you can justify theft, then it's not a huge leap to justify getting back at you for denying them free food.", "NTA. It's stealing. You were nice and talked to them. They failed to listen. So you were nice and asked the police to ask them for you - without charges. Next time file the charges.", "NTA", "NTA. Fuck those people. They should have asked in the first place, and they had due warning.", "NTA! Sometimes the only food we had to eat was what we grew and preserved from our garden.", "NTA\n\nIs the climate vastly different in her yard? Is there something (other than laziness) preventing her from growing her own garden?", "Your friends an idiot. Definitely NTA here.", "If the woman came into your house and took food from the cupboards would your friend think it was an asshole move ? NTA . You gave her a warning , she ignored it , it’s on your neighbour and no one else", "You gotta eat too. She should have planted one. NTA", "NTA. First is your vegetables, next is your fridge, and then your house. You have people to feed too.", "NTA.  Your friend is an AH. These people were stealing from you. They are lucky you didn’t press charges.", "NTA. They could have offered to trade produce for labor or other goods. Bartering can be a win,-win. But they were simply stealing.", "100% Not the Asshole\n\n\nYou tried to talk to them. They were Dicks.\n\nYou did the right thing. And if I was in your shoes. Would have done the same thing.\n\nFuck neighbors that don't respect your boundaries", "NTA. Neighbour can grow her own food if she needs to feed her family, and not steal from the backs of others who are trying to feed their own.", "NTA. They are thieves. You did an additional kind step of asking them to stop stealing before contacting authorities.\n\n&#x200B;\n\nAlso, there's a very good chance they are outright lying about the necessity. The type of people who steal from their neighbors are the types of people who lack moral character and personal responsibility.", "NTA- any normal neighbor would have knocked on your door and asked if you had any extra veggies or if she could help weed for a barter of garden bounty. You don’t steal and continue after being asked not to.", "Only someone who hasn’t raised an entire garden from scratch would think you’re an A/H. \n\nThe amount of time, patience and attention to detail is lost on anyone who does nothing more than helps themselves to whatever comes into season that looks ripe and easy to pluck. \n\nGood for you for standing your ground by first discussing then taking action to stop them from litrespassing and stealing from your property. Definitely not the A/H but people who think it’s okay to steal from other people’s gardens sure are.", "Why are you the ah?\n\nTell your friend to provide for you in that case?\n\nNTA.\n\nYou worked hard to grow the stuff, it’s like working hard to be paid so you can buy stuff. She needs to work hard to get food, or grow her own shit. You are not responsible for feeding other peoples children.", "NTA, also tell your friend that he is dumb (you don't have to do it of course, but it would be nice xd)", "Your friend is an idiot. Who keeps doing it after you asked them not to, without talking to you.\n\nWow, the entitlement.", "NTA\n\nIf she is hungry she should ask for advice on how to grow her own garden, not help herself to yours.", "NTA. They aren't allowed to trespass on your property for any reason. What if they didn't close the gate fully and your dogs got out? Completely unacceptable and then they stole your food to boot!", "NTA She is stealing, I dont care if they have kids to feed. She needs to ask, not take. I would put an electric fence up and let her deal with that.", "Why in all these obvious nta posts. Do these people have a shitty friend that says their the asshole. Someone is literally stealing from you. Press charges and lose your shitty friend.", "NTA. Me and my family had a neighbour like this when I was a kid. We never had any proof it was her who stole vegetables from us, but she was the most likely suspect, the plot where we used to grow potatoes and beans was next to her property behind a fence. We also suspected her when we noticed missing firewood in our shed, so we put a lock on it. Unfortunately, we had no proof, so the police were not involved.", "Be careful with using a dog as security. I’ve heard horror stories of people poisoning dogs to get to pear trees 👀 sounds dramatic and I don’t think they’d go that far but you never know what desperation does to ppl", "NTA - She could have grown her own garden. She could have asked before trespassing and stealing. She could go to food banks or churches to ask for help. There are likely other resources in lieu of just taking what you want that belongs to others.", "NTA - steal from Walmart, not your fucking neighbors!", "NTA. She can't afford to feed them, they should do what nature does and unalive them.", "NTA.  Trespassing and theft.  Your friend can shut their mouth.", "If they have kids to feed, they should probably try harder to avoid going to prison for trespassing and theft.\n\nYou're NTA. Also, wtf is up with your friend's terrible take", "If they have kids to feed why don’t they grow their own? The entitlement of some people baffles me!", "If she was starving and had kids to feed, then she should've come over and asked for help, not committed a crime.  I'm calling BS on her actually being starving.", "Tell her to grow her own. NTA", "You also have a family to feed? She could just start a garden if she needs the food? This is so weird. NTA.", "NTA. They have no right to steal your food. I like the motion detecter spinkler idea. Also could add flood lights to that and some sort of noise alarm.", "THIS!  We had this going on in my neighborhood in what I dubbed, “The Case of the Purloined Produce.”  It took getting the police involved before the offenders (two elderly women who pretended they couldn’t speak or understand English) stopped.", "I miss the stories about the bucket lady. I wish there were more of them.", "The Bucket Lady thread is solid gold.", "I am so tired of people using their kids to excuse their own behavior!\n\nYour kids are your kids! No one else's! Stop depending on others and guilt tripping people into taking care of your kids!\n\nStop blaming your kids for your stupid decisions, and stop teaching them that stealing, trespassing, and whining is a way to live.\n\n\nSorry, rant over now!", "Yeah if they have kids to feed, theft also isn’t the smartest option for them, considering they clearly know it has consequences lol. NTA OP", "They know what they are doing is wrong- that’s why they were sneaking over after dark.", "Or you know, grow their own food..", "So to start, NTA, theft is theft. But many food banks don't give out perishables, the one I visited never once gave fruit or veggies but gave out block cheese and milk vouchers for Stewart's.", "Here’s a thought... they can plant their own garden!  A little late for this year, but the planning can start now.", "I would rather you steal money from me than steal my produce. The money took less effort to earn. \n\nWe sometimes get people dropping by and asking if they can pick our fruit. I get why because there are a lot of people in our area who don’t have time to do anything with their fruit trees, and asking is infinitely better than stealing. But those trees are our *babies*. I am NOT giving the fruit away after I slaved the whole summer pruning, thinning, and spraying those trees. This little red hen says “geroff my lawn”!", "maybe friend thinks op should just lay down in front of the gate like a nice doormat? nta.", "I agree, NTA. About your question on starting a garden- the upfront investment on a garden can be pricey depending on the size and soil of the area. Regardless, there are food pantries and/or food stamps to help low-income families.", "Haha I loved vegetables as a kid!", "This is an incredibly insightful point I have not seen anyone else point out!", "Or ask. \"I have two kids to feed at home and can't get any more hours at work. Is there any way I could help with the garden or do some chores in return for some vegetables?\"\n\n&#x200B;\n\nEither they were lying in the first place, which is likely, or their pride is so vast they'd rather hurt people in secret than ask for help in public, which makes them bad people.", "Our three large and not particularly friendly dogs are probably what's stopping them from checking the doors while we're gone.", "I 100% would be checking to see what else is missing, it seems unlikely they would stop at vegetables.", "Oh my gosh. That made me laugh out loud. Thank you.", "I would have happily given her some of our preserved seeds if she asked. To be honest I'm not even sure how they knew we had a garden. We have a six foot privacy fence all the way around the property because we have dogs.", "She should take the woman's firstborn and lock them in a tower. Only justifiable response IMO 😂", "🤣 this comment made my day", "After years of trying i finally have gotten my garned to the point where it actually produces. There is so much more to it than sticking seeds in the ground and watering them and it has taken me years to finally get it right. \n\nI say that now because I have huge pumpkin vines and tall corn stalks but I haven't actually had anything reach the point of being harvestable yet so I may very well be speaking too soon. There's still so many things that can go wrong.", "They do. I think they have three but it's possible the wife is pregnant again. Obviously I'm not going to ask her.", "You know, if they'd been my neighbours and I could grow a garden (unless dandelions count, you're out of luck), I'd be glad to help out. I couldn't be responsible for your entire care and feeding, but I'd be glad to donate. It's the stealing that bothers me.", "Eh. I'm not a very good or patient teacher and honestly I just don't have a lot of time.", "OP said they didn’t want them charged, not they didn’t want them to be spoken to about this.", "We have some insanely crafty squirrels. It's actually kind of amazing. I've seen them just pluck shit off the vine in the same way a human would. If they weren't such a nuisance I'd be in awe. Well actually I still am a bit in aw.", "Well I don't think it's particularly neighborly to steal from your neighbors either.... I would have happily kept the police out of it if they had stopped the first time I told them to.", "We rarely have extras. I go to a lot of trouble to plant exactly what we need and I can/preserve things so it lasts through the winter.", "If you see someone stealing food, you rely on. YOU SAW THEM. it's not like they stole from a big business.", "100% wrong in this situation. She stole from someone growing in their backyard, not a big business. She stole their time and the effort she put in. NTA", "That rule applies to big chain grocery stores, the ones that waste thousands of lbs of food every year and wont be hurt by someone who cant afford their groceries taking a few items here and there.\n\nIt does not apply to stealing food from small businesses, friends, neighbors, etc.. If the person will miss it, yes you saw. How would you feel if your neighbor walked into your house and raided your fridge?", "That only applies to big chain stores! If you see someone steal food from Walmart, *no you didnt*. If you see someone steal from YOU, *yes the fuck you did*", "They have no extra, because they were being stolen from. And that rule only applies if it’s a company or corporation, not if it’s taking the food directly out of someone else’s hands. You don’t steal from others in need to make sure you’re alright.", "Naaah !They should turn the other cheek, let them stole their property.AND ! Also gave them a free basket for extra !  As a reward.\n\nInstead of have the audacity, to think, that  between neighbor, may be they could ask direclty if they can have some ? To help ? And if not possible, some advice to do the same on their own garden ?\n\nNaaaaaah ! The second option is not reasonable.. To expect some respect and friendliness... It is crazy !\n\nJoke appart, BIG NTA !  \nYou can't carry on your shoulder all the weight from the world.   \nYou did right. You didn't press charge. It was a kind warning after a heated conversation.", "I also want something else out: the potential for liability.\n\nI am not sure what the law states where you are, but it is possible that they could be placing you at risk of liability if they trespass on your land and get injured there.\n\nYou may want advice on this.", "The neighbors don't want to do the work to grow their own food. They want OP to do the work, and let them help themselves to her produce for free.", "Haha. Maybe I should put a tip jar in the garden.", "To be honest I don't know how their yard is set up. I think they have some sort of swing set in their backyard but other than that I haven't been back there.", "I'm not worried about them out in the yard :) I'm always out there with them. But thank you!", "follow up with the police and ask them to trespass them. they will serve them with paperwork, a warning to stay off of your property. if they trespass again then they can be arrested, if you choose to pursue it. but a formal trespass is usually the first step (at least it is in Texas).", "I recall the sprinklers can be timed thus maximize your options.", "There are also some that have a night setting that only responds to the infrared camera—we use one of those on our garden because if I have to turn it off I forget to reset it, but with the night setting it doesn’t go off as long as it’s light outside.", "Read the saga of the [Bucket Woman](https://www.reddit.com/r/BestofRedditorUpdates/comments/12ok9s0/the_bucket_woman_vs_oops_bins_continues/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1); it will at least put a smile on your face. The homeowner in this situation makes impressive use of motion detection sprinklers. \n\nThis link takes you to the most recent (I think) update, which contains links to the previous posts you should read.", "Put some sprinklers that are set and aimed towards their end so if they try to move over, they’re set off\n\nOr turn them off before letting your pups out?", "\nYou can get the special kind that you can control with your phone. That way you can turn them off when you take your dogs out, and then turn them back on when they go inside. Well the dogs are out, nobody should be stealing your stuff anyways.", "I was just wondering the other day if the bucket lady was still wreaking havoc with her neighbours' bins.  I miss those stories.", "Legit. I just didn’t want to look for it.", "It would be nice if people who needed help would just ask also. \n\n“Hey, times are tough for us right now. Could you give us a pepper to cut up for the kids’ school snacks for the next couple of days?”", "This is the answer! And they had the perfect resource next door to ask for advice in how to do it, but instead just decided to become thieves.", "Nothing's stopping them from putting in the effort to grow their own.", "Ontario Canada here\n\nLots do give out fruit and veggies", "Okay? Canned fruits & vegetables are still good for kiddos 🤷🏼‍♀️", "Some of them do.  I've gotten apples, oranges, potato's, carrots...  .\n\nAlso, still no excuse.  OP said they also depended on their garden veg.  If you must steal, steal from a store, not your neighbor.  Fuck corporations, not people.", "Instead of all that, how about don't have children if you can't feed them?", "Could OP give their neighbors some seeds from their plants so they can grow their own food also?", "Definitely can be expensive to set up, but there are ways to do it cheap!\n\n-keep an eye out on FB marketplace etc for people getting rid of pots and planters, you can grow a good amount of stuff just in pots.\n\n- I use an old bathtub to make dirt, food scraps, leaves, sticks, animal poop, ash from the fire, paper waste, lawn clippings, mix in some sand and let it break down a bit, then I just buy a very small amount of potting mix and mix it through.\n\n-Buy some seeds, collect seeds from others/your own produce.\n\nI hope that helps someone!", "OP might be able to share some seeds with them for next season, and YouTube is filled with budget garden DIY videos.", "So why doesn’t your friend buy them groceries if she’s so concerned?", "Your friend’s moral compass is out of whack.", "Yes, you clearly 'understand' they are stealing from you. No one expects a neighbor to be this entitled.", "Tell your friend that she just volunteered herself to give her own food to the thieves. That'll shut her up.", "So your friend would be okay with someone going into their house and taking food out of the refrigerator or pantry at night without asking?", "Then tell her that they could steal from there then xd", "Still love them!  Lightly steamed with a little salt, pepper, and butter.", "That's even more concerning. I'd check to see if anything else has gone missing. I can't tell you how much I would be creeped out if people were sneaking around in my yard whether I was home or not. I wonder what other things they were looking for when they came snooping?", "Oh Lord. If they already have 3 kids they can't feed, having another is insane.", "Yeah, pulling the kids card only after you’ve gotten in actual trouble is one of the oldest excuses in the book. They think it’ll get them out of anything if it’s “for the kids!”", "Hey you can make dandelion wine! I don't care for it but I have a friend that loves it so I make it for them every year since we don't use pesticides in our lawn.", "Lol I meant gardening tips since you seem good at it but yes they should be leaving cash tips 😂", "oh oops, I meant to reply to someone’s suggestion of using a dog lol", "That will be my next step if they cause anymore problems. I haven't seen them since that last time.", "eta: NTA. they are ridiculous.", "And Ontario Canada", "Oh jeeze. I said, theft is theft. I was just pointing out that not all things can come from the food bank. And our food bank only had canned peaches or applesauce, which they often were out of. Plenty of corned beef hash though.", "While that is fair, there’s also the consideration that maybe when they had the kids they were in an okay spot financially and then fell on hard times later, making it difficult to feed them. \n\nI’m not excusing these neighbours’ behaviour at all, they are definitely wrong to be stealing and should be stopped, but I just want to point out that you can go from being in a stable situation to suddenly not.", "How about we advocate for a society where people are paid a living wage rather than determine who is worthy/not wprthy of procreating.", "Heck, OP might’ve even been willing to help a little, at least give some tips and such if the neighbours had asked how to start their own garden, rather than stealing.", "I made a compost bin from 4 pallets that I got for free and screwed together. I have 2 so when the first one is full, I start filling up the second one. By the spring the first one is ready to put on the garden, while the second one fills up. I always have one cooking and one ready to spread.", "I'll mention that to her lol.", "We are definitely going to get some more cameras for the house. I know they didn't get anywhere near the house. We have dogs who would not have it.", "I don't drink (even half a glass of wine makes me physically ill for days), but I could make dandelion wine and.....give it to my neighbours?", "this is the wrong move imo, a trespass is a piece of paper that will rid them of you *legally* for good. people often “let it go” cause they don’t want to stir the pot. i’d bet big money in a month or two when this dies down they’ll find a way to steal again, but you won’t have a trespass on your side already", "You can go from being in a stable situation to suddenly not, but if you don't have the requisite safeguards to ensure the children don't suffer I don't think you should have children.", "That's a relief! How bold of them to sneak around knowing there were dogs that might catch them in the act and sound the alarm. More cameras definitely sounds like a wise choice.", "If they drink enough maybe they'll stay out of your yard. You might be on to something.", "Or sabotage the garden somehow.", "So you're saying every parent should have 18 years of living expenses saved before they have children?\n\nThat or rich parents...  \n\nnothing in life is certain.  The solution is not for only rich people to have children.  The solution is a society with a livable minimum wage, etc, etc.", "I actually have really nice neighbours. I was putting myself in your shoes!", "I'd just like to ask, if you lost your source of income would it take you 18 years to get another? I don't think you should have 18 years worth of funds, but you should definitely be able to guarantee the safety of the child. \n\nI also believe in a liveable minimum wage, but that doesn't mean people will make good decisions or even get a job before they have children. My parents had a good enough income  to raise 2 children on but through their own bad decisions they fucked it up.", "You're in America... can you shoot them?\n\nCurious Aussie...\n\nNTA", "If they were that desperate for food, they could have asked you to help them set up a veggie patch of their own.", "The police came over some stolen vegetables? Tell me where you live so I can move there. Idiot bent my car door open to steal in my car and the police didn’t even bother to come lol", "NTA  theft is theft. After you saying to them to stop they didn't so they deserve everything that happens and if they can't afford to feed there children phone CPS and tell them. Then post a note saying FAAFO and enjoy visitation with your offspring you filthy thieving bastards", "NTA, OP. That's trespassing and it's not your responsibility to feed their kids. Also, your friend is fucking stupid. The fuck does she mean that was an asshole move?", "NTA- she can certainly grow her own damn garden.", "While youre not an asshole, you could have handled the situation without resorting to contacting the police. I have a veggie patch of my own and here are a few tricks I use to protect my veggies.\n\n1.) Bug nets. While made to keep bugs out, it will inconvenience anyone trying to steal. \n\n2.) A wall. Get some bricks, some concrete and put a waist high wall around the veggies, you can put barbed wire on the top foe extra security.\n\n3.) A vicious rescue dog. Go to the pound and find the most fucked up and traumatised dog and adopt it. Show it no love - you need it angry for the intruders.\n\n4.) Deadfall traps, tripwires and claymores. Easy and safe to use, these prove effective at maiming thieves.\n\n5.) Only grow poisonous fruit and berries. This will ensure that those who steal from you get severely sick or die. Regardless word will spread about your deadly garden and the ruffians will bother you no more.\n\nI have been doing a variation of these methods for 20 years and have had great success. I wish you all the best.", "[deleted]", "Would you be open to teaching her how to garden?", "Is she really in need of food for her children?\n\nConsider leaving a donation of any extra produce you might have.", "Can you offer to teach them to grow their own? The whole situation just seems sad.", "If your friend thinks your an asshole, she’s more than welcome to feed your neighbors", "NTA - grow your own garden then?!", "NTA, unbelievable how people seem to think that they are entitled to other peoples property.. it’s still trespassing and theft. Her children are not your responsibility.", "NTA!  Who does that?  I could not imagine going into my neighbor’s yard and stealing from their garden.  The neighbor behind me has a small farm & the time and effort he puts into that field is amazing!", "It was an asshole move, alright, by your neighbor stealing from you.  There are food banks everywhere for her to visit for free food.  NTA for you.  Good for you to call the cops on this entitled tool box.", "NTA that is trespassing and theft.  She could grow a garden to feed her kids.  Maybe the kids are old enough to get a part time job to help.  There is the food bank, food stamps etc.", "NTA it’s not your job to feed them.  You’re friend is probably a doormat for a lot of people.", "The most amazing thing about a garden is anyone can have their very own...\n\nNTA", "NTA and I bet that if neighbors had asked you for a few bits you would have either shared or taught them to grow veggies too. I like the idea of the motion sprinklers or how about a motion activated voice that says **get off my property you fool** in Arnold’s voice from terminator?", "That's wild. Why didn't she plant vegetables herself then? \nWhy do so many ppl seem to think that their children should be looked after by everyone? \nNTA", "The smart move would've been for the neighbor to apologize, mention that she had trouble feeding her kids and ASK OP for assistance in growing her own garden.", "NTA.\n\nCall CPS and let them know your neighbor can't feed their child and must resort to stealing to feed their kid.", "NTA", "Never ceases to amaze me when people get caught red handed and rather than be embarrassed they actually get angry at you for busting them!! Obviously NTA", "NTA. They were warned. Fuck ‘em.", "NTA. Theft is theft. If she was really that desperate to feed her kids maybe she should have come to you and asked if she could've had some veg. But, if you say no. Then no is no. Having kids doesn't give you a right to take from others.", "NTA", "Vegetables are just not that expensive.  I once had a tangerine tree in my yard and I caught a neighbor lifting her kid over the fence to get some tangerines - it was a wrought iron fence with little pointed iron attachments!   I told her to stop and not to enter my yard again  I got the same song and dance as you that I was selfish and I didn't need all those tangerines.  Again, tangerines are very inexpensive.  I'm just not sure what calls out the entitlement of these folks.  As to your neighbors, when they told you they had hungry kids to feed - I would have asked them what is preventing them from growing their own vegetables?  What's preventing them is that its hard work to cultivate a producing garden - tilling the soil, fertilizing, etc.  They just want to come over and benefit from your time and hard labor - not extend any effort themselves.", "NTA, trespassing and stealing, and if you have kids to feed, how about you get a job and buy food, or, or shocker!!!!!!!!, start your own garden and stop mooching.", "Trespassing and theft has consequences in a civilized country.  You did the right thing and your garden should be full of food once again for YOUR own consumption.  NTA", "NTA.", "NTA\n\nIf they are so hungry they can grow their own food. I partially grew up on a farm, so I understand all too well the frustration of some randos helping them to some of your labor without so much as asking. \n\nUnless they are literally starving, there is no excuse. Even then, an apology is a must. Your neighbors just ended up doubling down and being worse.", "NTA. If they were hungry and needed food, they could have said that, and asked for some of the harvest. Instead, they trespassed and stole from you again.", "NTA", "NTA\nIt was her choice to have kids she couldn’t afford.", "NTA. Trespassing and theft. If her kids are hungry, she can grow her own garden. She just rather you pay for it and do all the work. I would have zero qualms about having them charged if it happens ever again. Charge them with both.", "NTA.  That is what food banks are for.  They need to stock up elsewhere.", "NTA but are you The Witch from Into The Woods? \n\nHave you tried cursing them?", "Nope they are thieves. They could have asked.", "Like what is up these friends people have on here. Like the friends basically be enablers. They only say this because it didn’t happened to them.", "NTA. I know how hard it takes to grow anything, especially produce! And with prices rising, it’s the smart thing to do for your household. Her children are not your problem. There are plenty of resources for her to take.", "NTA \n\nFile this under FAFO. Don’t want police at your door? Don’t trespass and steal from your neighbors.", "NTA", "NTA u r hungry too", "Did you have red tail feathers this morning? (Look up the red hen fable) I would be mad if I busted my butt and someone stole the fruits and veggies of my labor.", "NTA\n \nShe should have more respect for your garden given she’s in the same position.", "Numerous churches hand out free food almost every day of the week", "NTA no, it is not an a-hole move. They’re stealing from you", "Your friend And the neighbors are the assholes, no one has any right to take your property, not even the government. Anyone who does is a piece of human trash. You need to be more assertive over your property (have police charge them) or else it's your problem. People need to be held accountable, no matter how seemingly petty the issue, give an inch, take a mile", "NTA - you are not the food bank. You can’t just steal from people’s gardens. I bet you if she asked you and told you the situation she was in you probably would’ve donated some food to her, but she didn’t go that route, so calling the cops on her for theft was reasonable.", "NTA- they trespassed on your property and stole from you multiples times and then had the audacity to try to guilt trip you about it. These people have no morals apparently.", "They are thieves.", "It was an asshole move by them. Good for you.", "NTA\n\nYour property, your food, your time and effort. They are damaging your plants to satisfy themselves.\n\nKeep following up with this. Don’t let anybody guilt you over it. Yes, they have kids, but having kids is no excuse to steal and trespass.", "NTA. Press charges on these entitled assholes", "NTA. They can start a garden and grow their own vegetables if they need the extra food. They have no right to steal from you and you have no obligation to feed them. Your “friend” should totally provide food for these people if she wants to criticize your report to the police.", "NTA.  Press charges.", "As an avid gardener myself that’s a lot of work and at the very least they could have asked or offered to pay. That right there is absolutely theft and they should be held responsible", "NTA  !!\n\nThey can grow their own food as you do if ThE cHiLdRen ArE hUnGrY. \n\nYour friend is an AH for saying you're an AH for NOT allowing people to steal from you. 🙄", "If she comes at you again, point out you’d share with a neighbor in need if they’d ask.", "If she's so worried about her kids being hungry, she should start growing her own garden instead of stealing. Then she could grow as many veggies as she wants.  NTA", "NTA. \n\nI would have pressed charges...", "I'd have helped them set up raised beds orca garden if they asked. But no asking? NTA.\n\nDepending where you are motion activated sprinklers could get you fined — we have once every other week at specific times watering restrictions here. So motion-activated spotlights? Light up the intruders! Plus it makes them easier to identify on camera.", "“i have children to feed so let me steal from my neighbors garden and blame them because my cHiLdReN!!!!!!” how entitled and selfish some parents are holy shit", "I don't see why they have to feed their kids from your yard.  That's pretty bold. If you choose to have kids, you can also feed them off your dime.", "NTA this is theft and trespass. If she wants vegetables she should grow them herself! I’d personally go back to the police and advise them of this interaction, it needs to be logged, especially if it escalates more", "NTA. She can learn to grow her own food. You could offer to teach her, maybe make a mini co-op where you trade items, but it doesn't sound like she wants to put in the effort. You told the police you weren't bringing charges, but they're trespassing and stealing from you after having been warned. She got what she deserved.", "Nah NTA you spoke to them nicely and they disregarded it. They could have apologized at the time and explained that things were tough for them at the moment and you could have replied in kind that if had a surplus you'd be more than happy to drop off some if you had extra. Why can't people just communicate properly?", "Plant some condoms, problem solved!!\nNTA.", "NTA advise your idiot friend that you will pass on her address to the thief's so they can pop over and raid her place.\n\nTheft is theft, you were actually generous by not asking for it to be taken further and just the police having a word with them. \n\nIts more than just vegetables, the time and effort invested to grow them cannot be repaid.", "Used to rent my field to a farmer. You would not believe the amount of people who would just pull over and walk right into the field and start harvesting. My favorite were the ones who would tell me that it was OK that they knew the owner or that it was their field to begin with.\n\nNTA", "They could plant a garden too you know. This post should also be on entitled beggars too.", "NTA and I don't for a second believe they were doing it for the kids. If they were, I think they would have been more apologetic or at least open about it when confronted the first time.", "NTA\n\nThat's trespassing and theft. You were right to call the police", "Drop packets of seeds off at their home with a note saying they should teach their children how to grow food, not steal food.", "NTA, you warned her once not to go into your garden. And you were nice enough NOT to press charges. Just like she has her kids to feed, you need to feed your husband and yourself. Let your neighbor start her own friggin garden .", "NTA!!\n\nYou needed that food!  That’s your money, time AND effort stealing.  \n\nShe needs to be charged as she will not stop taking from people", "If the kids were that hungry there are plenty of other options like food banks. They could also start growing their own vegetables too. I am sure if they had asked you would have given them some advice about doing that.  I can’t believe the audacity.", "If she's that worried about kids to feed, could she not plant her own garden? I realize that cultivating a vegetable garden takes time and energy... But some produce grows so well it's practically weeds.\n\nAnyway, there are plenty of ways to feed hungry kids nutritious food without stealing from your neighbor. One that I might consider is asking a neighbor with a garden if there's some kind of trade they would take for their veggies. NTA.", "NTA... it is the same as stealing food from your fridge. This is food you depend on. You even let the past robberies pass.", "NTA.\nThis could have gone like this: “Hey, neighbor, you have a wonderful vegetable patch, congratulations! I want to grow one as well to feed my family. Could you give me some advice on how to make it?”\n\nInstead they stole, denied, were told to stop, stole again. You were right to involve the  police since they didn’t respect you.", "NTA. I love to garden and grow veg, it's hard work, it's insanely frustrating when bugs attack or other things go wrong, bad yield, plants die. It takes time, it takes hours of work and that is all time and money you invest in that instead of something else. Someone coming along and stealing the results is a kick in the teeth. \n\nThey are absolutely in the wrong here.", "NTA as you are within your rights to do this.\n\n*However*, these days I am wary of calling the police for anything but major issues, because things can turn really ugly, quickly.  You call the police on your thieving neighbors and one of them may end up dead--and I wish that were an exaggeration.  It's unlikely but not unlikely enough.\n\nWhile some people might think your neighbors deserve to die for stealing your veggies, I wouldn't want that on my conscience.", "NTA. They're thieves. Friend can go help them if they're so concerned. Definitely recommend beefing up security on your garden. I'd be afraid of them using bleach or plant killing chemicals out of spite.", "NTA \n\nStand your ground", "Fucking lazy asses.  What is preventing them from growing if they need it so bad.  Just a tiny bit of planning?  No, they are entitled opportunists who can go fuck themselves.  Watch out though.  They may be trying to kill them all.", "NTA.  Your actions were perfectly reasonable and your neighbours are totally in the wrong for trespass and theft.  Motion-activated sprinklers - never heard of them but I think that would be a great way to go if affordable.  However, I would also increase camera surveillance on your property because your neighbours sound like the type of people who would retaliate in a nasty way.", "NTA. That's trespassing and theft. Life's shitty for everyone and I do feel some sympathy for them, but you don't go barging in and stealing.  (Also very Rapunzel esque. Maybe you should ask for a baby in exchange /j)\n\nI don't understand why they couldn't have asked. Not that you're obligated to give them anything but they just jumped right to the FAAFO stage and burned a bridge. Instead of the possibility of getting anything they get the police on them.\n\n(Also given their actions I would say the probably just want the produce without the actual effort...)", "Yes. If you call the police for something petty then yes.", "NTA . Food banks exist for a reason", "NTA\n\nYour friend can feel free to give them things instead of calling you an asshole for expecting to eat your own veggies.", "You arent the asshole. They stole you called the proper authorities. Now they know not to do it again", "NTA. Been a gardener for many years and have put innumerable amounts of money, blood/sweat/tears into it. Became a master gardener through my city’s extension program, put in hundreds of hours of volunteer work in the city, and when I had a surplus of anything I couldn’t feed my family or can or freeze I passed THAT along to my neighbors. If someone came over and stole from me I would be livid. \n\nIf your neighbor is in a place where they cannot afford to feed their family, there are several government programs that are designed to help with that. In the US, most city farmers markets accept EBT. There is really no excuse for stealing from a neighbor.", "NTA. It's called theft.", "NTA - what the fuck.", "NTA.  Nothing to stop them from growing their own food.  They played the kid card as an entitlement.", "NTA. I have every sympathy for people who need to steal food to get by. But if you're in that position, you target big chain supermarkets, not your neighbours.", "NTA. How could you be at fault ? Does your friend think you should give them access to your fridge as well?", "NTA, they robbed you. They could have at least asked. If I knew a neighbor needed some of my food I wouldn't hesitate to help, but if they steal from me I wouldn't help.", "NTA you didn’t grow that food for them.", "They shouldn’t have stole from u they should have asked I would have went to police too", "Shocked at the unanimity of NTA posts here. This is YTA if I ever saw one. Would Jesus have called the cops on his neighbor over this? These responses are some of the most narrow minded and provincial I’ve ever seen in this sub. You people are all assholes. Also so unstrategic - way to poison the well in your neighborhood. And don’t think they won’t get revenge in some way.", "NTA press charges. Once caught, they should have been apologetic and stopped. They continued *knowing* you had cameras. PRESS CHARGES. And expect retaliation until you do. Screaming at your house isn't where this stops.", "NTA people are unbelievably entitled and rude, and you did the right thing. I hope they got a trespass warning meaning if they come back they're automatically arrested.", "NTA and I have a garden in my fenced yard and keep locks on the gates but rarely lock the walkthrough gate for convenience. If my neighbors decided to steal from my garden I would be pissed and I have some pretty awesome neighbors who've been my neighbors for almost 30 years. It costs too much money to get a garden going and the upkeep is not something that is easy, either (especially since I'm disabled but my daughter takes care of most of the work). This is the best year we've had for production and I've actually had to share some of the harvest already and we are only half way through our season, but I would still be mad if someone thought it was ok just to take without asking! And I'd probably have to involve the cops because I would be so upset over it I wouldn't be able to speak to my neighbors in a polite manner because I'd lose all respect for them.", "How in the hell would you think you’re an AH? Like common, NTA and press charges", "NTA, as others pointed out feeding them is not your responsibility. Those are (literally) fruits of your hard work and you get to decide with whom you want to share.", "NTA Such entitlement. Let them work and grow their own food. \n\nTell your friend to supply them with food.", "NTA. They could have worked with you and fostered a relationship in which both parties trade goods they produce for mutual benefit but instead they trespassed and stole your produce.", "You are not an Ahole. Good on you though. I would have been injecting exlax into my \"crops\". Teach them to steal from a neighbor. If they want produce they could have asked for seeds or help cultivating and made a friend. F them.", "OP you are NTA but your neighbors are.\n\nI would suggest getting locking gas caps because they are not to be trusted.\n\nYou know they will retaliate.", "NTA- They are entitled and feel it is okay to steal from you. They were trespassing and didn’t care. Your friend is wrong. The fact that they act indignant when you brought it up as to being on camera shows they are unrepentant thieves and we’re willing to try to lie to your face.", "Nta. Theft is illegal. Simple as that", "NTA. \n\nI'm a gardener, and this would really piss me off. It isn't just free food. You have invested a huge amount of work into growing that food. My vegetable garden is basically a part time job. Your neighbors are selfish, entitled, thieving assholes. I'm really glad that you installed locks and reported them to the police.", "NTA (Not the A-hole)  \nYou are not the asshole in this situation. You worked hard on your garden, and it's completely reasonable to expect that your neighbors should not be helping themselves to your vegetables without your permission.", "NTA. Whatever their reason was, theft is theft. They could have at least brought up the problem with you and kindly asked if they could have some of those vegetables if they really were in such a tough position. Instead they chose to trespass and steal them and didn't even acknowledge it or apologize when you called them out but they went on to do it again. They had it coming.", " NTA. You explained that you didn’t want them on your property and taking your vegetables from your garden and they continued to do it. They don’t know your situation but felt entitled to steal food that you grown for your household and then claim they need it more. If they really needed it they could of asked but they just felt entitled to repeatedly steal your food. If going forward they need food for their kids (which I doubt) then they can grown it themselves.", "NTA. You are not obligated to grow food for others to steal while you go hungry. Your neighbors have no right to steal, especially when there are food banks and government programs and other resources available to them.\n\n> I was talking to my friend and she said it was an asshole move.\n\nYeah, of course she did. She can be as generous as she wants with your time, your work, and your food. If you bother talking to her again, tell her you found her generosity inspiring. When she asks what you are talking about, tell her that you were impressed that she volunteered to feed your neighbors. Tell her you told them where she hides her spare key so they can help themselves to the food she said she wants them to take.", "If only we could call the police on bugs and animals, too. Definitely the starving family that's in the wrong here. Yta", "You asked them to stop and they didn't why should they just take ans not even ask if you friends think you a ass then let them buy them food or let them steal from them", "Maybe give them some seeds. Tell them good luck.", "NTA\n\nthe woman should buy her own food.", "Your friend is an idiot. Please show them this comment of me calling them that.\n\nThey're quite literally stealing from you. It's one thing if you know them very well, and another if they had the decency to ask if they could take some, or EVEN give you some money in exchange.\n\nBut they didn't do any of that. You did the incredibly decent thing and asked them to stop, and you were 100% in the right to start a paper trail.\n\nFrom this point on. I'd be way more vigilant because they had the audacity not only to come and steal, but then yell at you like you did something wrong. I wouldn't be surprised if they try to retaliate against you. So, get a few more cameras. Pay attention if your dogs go crazy. And never underestimate how low people can go.", "NTA. If they don't want the police to visit, don't steal", "NTA and I mean… even if she has problems feeding her family.. she could have at least ask. I know it is difficult to ask for help sometimes, but theft isn’t the solution here.", "We had this going on in my neighborhood a few years back.  These two middle aged women would make the rounds of backyard gardens and help themselves (during the day when most people were working).  When caught they’d babble in another language and pretend they didn’t know English.  Finally, after other methods failed to stop them the police were called as the victims knew where they lived.  Two visits later from the police they finally stopped.  We called it “The Case of the Purloined Produce.”  NTA", "LMFAOOOO GENIUSSSS🤣🤣🤣🤣🤣🤣", "Gardens are not free, the soil, plants, amendments and don’t forget all the work, people pay money for fresh veggies for a reason.  They are thieves and if they are hungry there are solutions.  Hell, maybe if they had been nice OP may have even helped them start their own garden and shared or traded food for work, etc.  So many options other than theft and it was brazen at that, they knew they were being filmed.", "That was the thing I hated most about someone who stole from me. We absolutely would have given them things if they had just asked.", "Seriously, sounds like the friend is looking for a reason shit on OP", "Install a \"Tresspassers will be shot\" sign and buy a shotgun. Or just call the police.", "if they were that desperate, they couldve asked! OP mightve given them a couple things to help stretch their food budget. thievery just burned that bridge", "Or they can grow their own food.", "Or at least ask for some food instead of taking it", "They could have easily asked for food. If my neighbour knocked on my door and explained they were going hungry I’d give them some food.", "Ask - yes!\n\nBut starting your own - nah. That costs money. I genuinely don't think growing your own veg is cheaper at all than supermarket. At least not for me. The time, effort plus all the accoutrements like compost, feeds, equipment etc.\n\nSticking a couple of carrot seeds in an empty milk container is one thing, but growing enough veg to feed a family is proper hard going.", "Yes, I'm pretty sure if they had hung their heads and explained that they feel terrible but their kids were hungry and they just gave into temptation OP would have understood and maybe even dropped something over there when they had extra. But being warned off and then stealing in the middle of the night again KNOWING it's not OK and on camera is just piss-poor behavior.", "I will never understand this attitude that children should dislike vegetables.  Or that it's acceptable to just let them not eat them.", "Wait, I'm confused. Is this a joke that went above my head? Why would the kids have to be insanely hungry to eat vegetables?", "OP shoulda laid a spell on them right then!", "I mean, she can look up how to start a garden if she’s that desperate. It might be difficult but not impossible to do it herself.", "It’s literally a google search away to learn how to do that.", "Not really. Teaching people isn't my strong suit as I'm not particularly patient.", "They steal the extra produce.", "It’s a google search and YouTube video away to learn how to grow plants.", "So can I come over and raid your fridge?", "No, that’s not how that works when it comes to stealing from personal gardens.", "So getting police involved for a crime is “not a neighborly move,” but stealing is? Yeah no, not how this works.", "And stealing is a pretty shit thing for a neighbour to do.", "So the OP should trust thieves to trade fairly?  They were stealing food meant for OP’s table", "You sound like the kind of person that would have helped them out if they had just asked. Definitely NTA. Your neighbour sounds like an entitled shit.", "Motion-sensor lights would at least surprise the shit out of them. Bonus: manure!", "You probably could put it on a timer or something so it doesn’t activate when you usually let your dogs out", "You are under no obligation here and you are not TA, but if you want to extend compassion you could offer to help them plant their own garden or offer to answer gardening questions they have.  They sound a bit off their rocker so it might not be well received, but it's one possible response if they say they are hungry  - \"I'm sorry to hear that. I've learned a lot over the many years and  much labor I have put into making my garden into what it is now.  If you'd like, I can help answer questions you have about yours as you get it started.  I know from experience that it's a great way to obtain healthy food.\"", "Your dogs might enjoy them", "I'd be worried about letting your dogs outside unsupervised in general. All it takes is one tainted hotdog tossed over the fence.\n\nThat being said you can get ones you can set to a timer- so it's inactive between certain periods- and turn on/off remotely.", "NTA\n\nSo if they were really just trying to feed their kids they could have come over and asked if there was any extra you might have been willing to share.  \n\nInstead they decided to sneak and steal even after you told them to knock it off.  This then forced you to lock your gates to keep them out. I honestly suspect they would have continued stealing from your garden as well as damaging it until there was nothing left to take. \n\nSo they got what they deserved which was a visit from the cops which was likely a warning they could be charged with trespassing the next time it happens. \n\nAs to your friend who thought it was an AH move - IMO nope. You have a chunk of money and the value of the likely 100s of hours you put in to get your garden to this stage so you can feed you and your husband.", "If she was really dealing with food insecurity, she could’ve come up and asked you if you had any extra vegetables/foods from your garden that she could have. I’m sure in that case you would’ve shared. But just going in and repeatedly stealing from you, it’s not the right thing to do.", "I have no doubt that they will climb the fence.", "I mean honestly they could have asked. If I was having a hard time feeding my kids I wouldn’t care how embarrassed I was, I would ask.", "Notice “trespssers will be shot on sight. Enter at own risk”", "I think you could switch them off before you let your dogs out", "Why are you copying the comment by /u/MidwestNormal [https://www.reddit.com/r/AmItheAsshole/comments/159qth2/comment/jth5zb7/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/AmItheAsshole/comments/159qth2/comment/jth5zb7/?utm_source=share&utm_medium=web2x&context=3) ?", "I agree, I have people come to my door about the orange tree in my front yard all the time. In my case, we don't do anything special to really care for the tree, so we say go ahead.\n\nBut I'm glad they ask instead of just setting up shop in the yard to get harvesting.", "OP’s neighbors can get seeds at the dollar store for $1 per packet and plant her own vegetables", "I hear you but this kind of behavior usually ends up with people not putting in the work anymore. Why would OP work hard if there's barely any benefit from it?\n\nA lot of people with gardens happily hand out the surplus if asked and sometimes more.", "the food banks around me all give out perishables. Maybe it depends on the area or season. Regardless, they're not entitled to OP's perishables.", "Then maybe they could get the basics and then use the $ they were using on the basics for vegetables? 🤔", "A lot of Churches have food banks- and can have the right connections to have bargaining power.\n\nOne by me has a special deal with a local grocery chain- they'll get a ton of lightly expired but still good nonperishable (like canned goods) and fruit and veg that aren't pretty enough to sell but are still safe to eat- for free or at greatly reduced rates. \n\nSomeone knows a guy who knows a guy who pulled some strings and called in a few favors with someone else.\n\nYou don't even have to be the same religion or religious at all- a lot of the \"public\" church banks are public because they want to help everyone regardless of stuff like religion. (Private being for members of the congregation and sometimes also for related congregations- not open to the general public)", "If it’s ok I will throw in a mention here of a program called “Second Harvest”. I think there was a similar one called “Project Glean” or something like that. \n\nThey would have volunteers come out and (with permission) harvest anything left behind after the growers took what they wanted. Everything they picked was donated to local food banks. Without them a lot of food would have rotted in the fields and orchards.\n\nIf you have something that will otherwise go to waste, please consider letting someone harvest and donate it for you.  \n\nI don’t know the name of another program, but it allowed food banks to work together when one had too much of X to fully use/give out, and another food bank had a need for X.", "Your friend is rationalizing theft, does she believe that life's hardships serve as a license for crime? If people live by such a mindset, we would be living in a terrifying world.", "Here's the thing. You *were* understanding. You talked to them about it rather than immediately calling the cops and pressing charges like most Americans would do. Even when you did go to the cops, you didn't want to press charges. I'm pretty gosh darn anti-cop, and I'm anti-corporation and pro-welfare, too, but stealing from your neighbor isn't any of that (unless your neighbor is, like, the CEO of Whole Foods or something).\n\nSure, you could have tried talking to them again, asking about why they were doing what they were doing, but quite frankly, given how your first conversation went, I don't see the point.\n\nYour friend is detached from the situation and, although I hate the term and most instances in which it's used, virtue signaling.", "I just said in another comment that I have every sympathy for people who need to steal food to get by. Things are tough and there's very little meaningful help out there.\n\nBut if you're in that position, you should be targeting the big chain supermarkets, not your neighbours.", "Your friend sounds like a thief, too.", "You can buy seeds and food plants with your stamps. I don't know why so few people seem to know this.", "We always hated vegetables as kids. It was a way of pushing our parents' boundaries with us. \n\nThey were \"good for you\" how disgusting were our parents for making us eat something \"good for us\" when there was ice cream in the freezer.\n\nIs that not food as well? Why couldn't we just eat that?\n\nSo we got the rule, no ice cream unless all the veggies were gone.\n\nGot older and realised we probably would have starved to death of malnourishment on ice cream alone, and eat plenty of them now, but it was definitely something we pushed back on as kids.", "And turned them into stone!", "If their story checks out, they should've mentioned it the first time around. Or, after the Police came over, they should've come over and apologized to you, explaining their situation. Or written a letter. Instead, they decided to lash out at you. Don't feel bad. They might be hungry assholes at times, but they are primarily assholes, which becomes evident because they're still assholes even when well fed with _your_ vegetables.", "You can make a salad with the leaves (better before the flowers come out), fry the flowers in fritters, and make tea with the root.", "It’s kindness to offer a neighbor help and make friends instead of enemies.", "My parents have a couple black squirrels that have been swinging every day on their bird house hanging from one of their trees.", "I'm gonna guess that's what the police officer was doing at their door. In most places, formal paperwork isn't required, but police will usually make it clear, in person, about the trespass so there isn't any \"misunderstanding.\"", "I love the Bucket Woman Saga!", "Or they could have said something like \"hey, I saw you had a garden. We need to start growing produce, times are tough, our family needs more food options\" I bet most people would hook them up with food, advice, support, whatever.\n\nBut some people are immature dicks, so instead of asking or communicating, they act like OOP's neighbors.", "So while OP is NTA, I'm pretty sure if these folks are stealing vegetables from their neighbor, they don't have the money to set up and maintain their own garden. It's not cheap.", "California here. We get lots of fruits and veggies too. Food banks here manage it by taking the surplus from surrounding grocery stores that would've been thrown out anyway. So I guess the only caveat is that they go bad pretty fast.", "I guess they starve during the Canadian winters. /s", "Right? I bet if they had asked, OP would have told them how to start a garden, hell, get googling. It's a lot of work, but it's better than stealing, smh", "Have you been to many food banks? You're lucky to get those items at some places.", "Yeah. She kinda sucks.", "This probably is because of America's dependence on processed foods and a lack of access to fresh food/gardens (most apartments I know of don't have community gardens)... Thanks for teaching me something new today, though!", "You don't even have to buy seeds, check your local library! Or your local gardener- if anyone sees my garden, and wants to ask about something, I'll happily start seeds for them. I love the seed starting part, it's the hard manual labor that I'm not so fond of.", "This year was a bust gardening wise because I was in a sling after a car accident during the period of time I really needed to start cooking with the proverbial gas but the year before that I had a moderate haul (and I was busy caring for a dying relative on top of work, so I wasn't really taking all that good care of them) and the year before that I did everything wrong and still had so much veg some of it went bad before I could eat it.\n\nTheir are a lot of plants that are beginner friendly as long as you buy them prestarted- like cucumbers and bell peppers. Once they're established it takes a lot to kill some of them.", "My parents never advertised vegetables as \"good for you\", they were always just part of food and neither me or my sisters ever had a problem with eating them.\n\nI've noticed that, for whatever reason, most of the kids who don't want to eat vegetables are from the US.", "Yeah, it sounds like they can’t stop popping out kids and think it’s other people’s job to provide for them.", "There won't be any more problems if you trespass them. It sounds like they take the cops seriously so knowing they will be arrested if they do it again (after being trespassed) is a serious threat. You said you wanted a paper trail. Having them trespassed is much stronger than a police report.", "Set it on a timer so it only comes on during x time during the night.", "If you want to be nice (not that you have to), you could offer to show them how to grow their own and share spare seeds. Ultimately if they are having food problems that would help them more than stealing. Probably won't help them for this year but longer term it would.\n\nNTA as mentioned by others they are stealing food from your mouths and their kids are not your problem.", "Protect your garden if they plan to put salt in the grown, I've seen that before", "If they needed help, they would ask for it. They're stealing from you for no reason. I am in great need, and would never take a thing. This isn't a need situation. It's a morally bankrupt answer to a simple problem. They have a home, so they have an address. They can go to food banks, or get social services to help out. Don't feel obligated to be kind anymore. Trespass them and make them accountable for their decisions. Protect your property (preferably in a nonviolent way).", ">the woman came outside and started screaming at the house that they were hungry and had kids to feed and she couldn't believe I called the police. \n\nGeez, did she ever think of maybe planting her own vegetables??", "It's... Pretty cheap tho. You don't have to turn your whole plot into an edible garden. \n\nFor the most basic stuff you need a shovel and seeds. Maybe a couple of wooden sticks. (Something they could have asked OP for, if she has some old equipment she no longer needs, instead of making an enemy out of her.)\n\nBut of course it depends on their climate and the food they want to grow. If rain is not a problem, it's more the time consumption part that can be an issue, but.. They have children. Even a 4-5 year old can help mom and dad lend a hand with weeding, for example.", "If you are that much in the thick of poverty, you are working your ass off and don't have the luxury of time or energy to plant your own.", "We can advocate for a better world while still expecting people to live realistically and responsibly in the hellscape we're currently trapped in.\n\nIt's not about who deserves to breed, it's about what their *children* deserve as a standard of care as they grow.  The system won't provide, so if the parents can't either, then they need to not hurt their innocent children.", "OP doesn't say if they're working or not.", "Yup. Never met another gardener who wasn’t eager to share tips and tricks (and seeds!) That’s part of the joy involved in growing things yourself.", "I have a small garden for tomatoes and zucchini and simple stuffs, and I just hate the seed starting phase. It goes wrong in so many ways.\n\nBut I have a garden neighbour that doesn't mind doing double seedlings and in exchange I water/tend his garden when he is on vacation.\n\nCommunity is a great resource.", "I guess it all depends on how the vegetables were introduced and what kind of role they had on the plate.\n\nMy parents made them the Priority Food, extra special, important, etc.\n\nSo when we were looking to push bounderies and flex our tiny egos, veggies were something we could push back on.", "Considering the cops were at their door i think they've already been trespassed. OP said she wanted a paper trail after telling them no and then a cop comes to the neighbours door? That's an officer that did their job.", "So, uh, seeds are cheaper than dirt. If they already have the dirt because they have a yard they could grow a decent bounty for less than $5.", "Why should she want to be nice?", "Lol fromm the sound of these trailer trash neighbors they're probably sitting home now and trying to figure out how to plant a Doritos bush", "I spend MAYBE ten minutes a day with my potted veggies + they each took maybe thirty minutes each to seed/repot. Pots don’t get weeds, citronella and pee keeps pests and pets away, and half of my seeds I easily could have replanted from vegetables I bought. Gardeners regularly give away or trade partial seed packets or sprout flats. Neighbor is spending as much time sneaking around stealing as she could feasibly spend on her own garden.", "Or the pets, OP mentions they have dogs. If someone's reaction to being told not to steal was to throw a tantrum in public I'd be really concerned about what they might be capable of. I understand this might sound like me jumping to the worst case scenario, but people are absolutely nuts right now and have been escalating for far smaller reasons.\"You hurt me, so I'll hurt you.\"", "Yeah they’re broke, but salt is cheap in bulk.", "Yeah but they might not know what to do - not everyone was brought up growing and let's face it most growers have loads of seeds leftover, and if you want a nice variety it can get expensive if you are already broke.", "Because some people feel empathy for others especially if kids are involved. And some people don't want to have ongoing issues with neighbours.", "People have poisoned pets before to get back at people, unfortunately.", "They presumably have working cellphone's or access to a public library. Google is free.\n\nNow, whether or not they know how to read...that's the big if. A huge chunk of the US's adult population can't read.", "u/ChanceZucchini1645 be very cautious about letting your pets outside alone. It’s a pain to start having to leash them and take them out when you used to be able to just open the door. But it could save their lives!"]}