{"id": 23153, "submission_id": "159vy4z", "title": "AITA for eating my meal indoors in comfort since my FIL was in my patio chair.", "selftext": "I (M36) am a big guy. 6'8\" and 398 pounds. Call it 203 cm and 180 kg. \n\nMy FIL is also a big guy. 6' tall and 200 pounds. 182 cm and 90 kg. \n\nBecause of my size I cannot sit in in a regular plastic patio chair or Adirondack chair. \n\nMy father built me a custom chair for a gift when I was 18. I love that thing. It even has my initials carved into it. It is sturdy and ridiculously large. \n\nWhenever we have people over to the house it is very obvious which chair is meant for me. I have an oversized folding chair that is no where near as comfortable but it allows me to at least be social. I can have a beer in it but eating is a terrible idea. \n\nWe had family over this weekend. Normally if someone sits in my chair when I'm grilling my wife will ask them to pick a different seat. But she can't stand up to her dad. \n\nHe decided that since he is a big guy he deserves the big chair. And my wife chose not to remind him that is the only chair that I can sit in without breaking it or hurting myself. \n\nWhen I was done grilling I came over and asked if I could please have my chair so I could join everyone. \n\nHe said he was comfortable and that he wasn't going to move. \n\nRather than start a stupid argument I just served myself my food and went into my office to eat. Because of the work that I do my office is soundproof and locked and is in the basement that locks as well.  I could lose my job and be criminally liable if some of the information I deal with wasn't properly compartmentalized. \n\nOnce everyone figured out that I had just left to find a comfortable place to eat they all started bugging him to move since he was literally in the only spot I could sit and there were plenty of other seats. \n\nMy wife tried to get me to come back but my phone was upstairs and I was enjoying my peace and quiet. \n\nI ate quickly and came out as soon as I was done. But the damage was done. My FIL was embarrassed by everyone except my wife for sitting in my spot. He was very red when he apologized for taking my spot. \n\nI said no problem and sat to socialize with everyone. \n\nMy wife said that I behaved poorly and caused her father to be yelled at by her mom. And that even my kids told him that he shouldn't be sitting in my chair. \n\nI would have eaten in the kitchen upstairs but it was full of food and people. We don't eat in the living room. I guess I could have eaten in our bedroom but I have a perfectly acceptable place to eat downstairs. \n\nAITA", "created_utc": 1690347319, "permalink": "/r/AmItheAsshole/comments/159vy4z/aita_for_eating_my_meal_indoors_in_comfort_since/", "score": 865, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My father-in-law chose to sit in the only chair I can use and refused to move. I might be the asshole because I just went into my office to eat and left the party for fifteen minutes or so causing him to be called out by his wife and grandchildren. Along with other guests. I just wanted to eat my meal in comfort.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nYou asked politely, you didn't make a fuss when you were refused, you solved your own problem by eating elsewhere.\n\nYour wife claims you \"behaved poorly\". Ask your wife: \"What should I have done, then? If you think I was wrong to eat in my office, well, then, exactly where do you think I should have eaten?\"\n\nI'd be really interested to know her answer.", "NTA. It was a dick move by your FIL trying to outmuscle you in your own home.", "NTA You did everything right. You asked him to move. He refused. You didn’t freak out; you ate someplace else. Your FIL was an AH and is embarrassed that everyone noticed.", "NTA your FIL sounds like he was tryin to have a power struggle with you and lost.", "NTA. Your father in law definitely is one, though. He’s horribly rude.", "NTA. You have been a gentle giant, and everyone agreed.\nTalk to your wife....maybe she just wanted to avoid conflict?", "NTA You asked politely and didn’t press the issue too not cause a scene. Family members noticed and policed his behavior about “big man needing a big chair” when the bigger man should be able to use his custom built personal chair in his own home.\n\nThe only possible thing I see you could’ve done differently and kept you wife happy is to explain that it’s the only chair comfortable for you but that seems like it would’ve been a bad idea. Your wife is just upset that her dad was ridiculed by his family when he could’ve been ridiculed by you. Exactly what happened is the best possible thing that could’ve happened given that he didn’t want to let you use your chair", "NTA - you won that by not engaging.  Everyone else rallied for you on their own.", "NTA what your wife wants you to do sit on other chair and broke it?", "NTA\n\nYou were incredibly polite, imo. You didn’t make a scene and you are never under any obligation to put yourself at risk (particularly in your own home). \n\nYour FIL is an arsehole, though. \n\nYour wife has daddy issues that she needs to work on if she’s going to be a grown up in a grown up marriage.", "NTA I see nothing wrong with your actions at all.", "NTA he was being a rude guest and you weren't rude in response in an attempt to diffuse the situation. He needs to own up to his actions.", "He’s nearly a foot shorter half your weight and thought you could sit somewhere else even though he had to have the big chair to be comfortable what was even his logic here? Also you were polite you didn’t make a fuss and where else would you have gone if you couldn’t sit in any of the other chairs? NTA", "NTA. You requested your chair, he denied it, so you moved to a place where you could be comfortable. You de-escalated and disengaged. Everyone else *rightly* called out your FIL for this. Everyone except your wife called him out on it, and he was shamed into moving. You came back, the situation was resolved, and you moved on.\n\nYour wife is problematic. *Every other person* there recognised your FIL was wrong and called him out on it. He agreed and moved. Your wife is hung up on the fact that her dad was made to feel bad for his bad decisions. She doesn't care that she is complicit in excluding you, she only cares that her mom was angry at her dad. Why does she care more about her dad and his opinion than anything else, including her husband, children and mother?", "INFO\n\nWhat race of giants is your FIL descended from? At 282 cm, that makes him about 9'3\" in freedom units.", "NTA Wife and father in law are kinda small AH's though", "NTA but your wife and FIL are. Honestly, your wife blaming you for the incident caused by her father has left a bad taste in my mouth.", "ASA (edit: ESH) so far. It is clearly visible that this is your chair and he obviously didn't Care, but: Did your fil know that this chair is the only chair at the table where you can sit without discomfort? Did you tell him you would eat inside, completely isolated, if he doesn't move?\nIf not, than you completely embarassed him because he didn't know the consequenses of his refusal to move.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (M36) am a big guy. 6'8\" and 398 pounds. Call it 203 cm and 180 kg. \n\nMy FIL is also a big guy. 6' tall and 200 pounds. 282 cm and 90 kg. \n\nBecause of my size I cannot sit in in a regular plastic patio chair or Adirondack chair. \n\nMy father built me a custom chair for a gift when I was 18. I love that thing. It even has my initials carved into it. It is sturdy and ridiculously large. \n\nWhenever we have people over to the house it is very obvious which chair is meant for me. I have an oversized folding chair that is no where near as comfortable but it allows me to at least be social. I can have a beer in it but eating is a terrible idea. \n\nWe had family over this weekend. Normally if someone sits in my chair when I'm grilling my wife will ask them to pick a different seat. But she can't stand up to her dad. \n\nHe decided that since he is a big guy he deserves the big chair. And my wife chose not to remind him that is the only chair that I can sit in without breaking it or hurting myself. \n\nWhen I was done grilling I came over and asked if I could please have my chair so I could join everyone. \n\nHe said he was comfortable and that he wasn't going to move. \n\nRather than start a stupid argument I just served myself my food and went into my office to eat. Because of the work that I do my office is soundproof and locked and is in the basement that locks as well.  I could lose my job and be criminally liable if some of the information I deal with wasn't properly compartmentalized. \n\nOnce everyone figured out that I had just left to find a comfortable place to eat they all started bugging him to move since he was literally in the only spot I could sit and there were plenty of other seats. \n\nMy wife tried to get me to come back but my phone was upstairs and I was enjoying my peace and quiet. \n\nI ate quickly and came out as soon as I was done. But the damage was done. My FIL was embarrassed by everyone except my wife for sitting in my spot. He was very red when he apologized for taking my spot. \n\nI said no problem and sat to socialize with everyone. \n\nMy wife said that I behaved poorly and caused her father to be yelled at by her mom. And that even my kids told him that he shouldn't be sitting in my chair. \n\nI would have eaten in the kitchen upstairs but it was full of food and people. We don't eat in the living room. I guess I could have eaten in our bedroom but I have a perfectly acceptable place to eat downstairs. \n\nAITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. FIL is TA here. He knows you have limited options and was only upset because others called him out", "NTA. You asked him. He refused. Let him face the consequences. Tell your wife she was wrong not to deal with her father. Not you", "NTA", "NTA. You were very kind, my 6'5\" brother would have just sat on him and maybe farted. Your FIL and wife are both awful though.", "NTA\n\nThis is completely an issue with your wife’s inability to deal with her father. Which then causes him to know that he can get away with bs behaviour.\n\nInstead of your wife being angry with you, you should begin to calmly challenge her behaviour and outlook, in the hope that it either changes or she understands when it’s at the root of, or causes, issues.", "First up, I'm 6'1\"\" tall and 250 pounds.184 cm and 115 kg. I guess I'm a pretty big guy. But compared to you I'm child sized. Saying your FIL was a big guy is a stretch as he's roughly half your size. That should be obvious to him and it should also be blindingly obvious that the custom chair with your initials on it is there because you're a unit. He was being a stubborn old guy and got called out for it. You handled things with dignity and are certainly NTA.", "Ah, the in-laws. Can't live with ’em; can't kill ’em.", "Even worse than lost; he was scolded by a group of women and children for his dickish behaviour. \n\nNTA OP, you did everything right. You asked him politely to move, and when he decided against it you removed yourself from the situation so you could eat. \n\nWhat kind of “small dick energy” does it take to take the grillmaster’s chair? Seriously…", "He meant 182.", "ASA?", ">Did you tell him you would eat inside, completely isolated, if he doesn't move? If not, than you completely embarassed him because he didn't know the consequenses of his refusal to move.\n\n\nIsn't that childish? \n\nPlease move because if you don't, I will eat outside, completed isolated. \n\nIs the point to make him feel bad or is Op not to treat him like an adult? \n\nHe already said it was his chair. That was enough.", "And I'm pretty sure the comment above was sarcasm. 282 would be a new world record as the world's tallest dude was 272 cm.", "Sorry, thats for the german subreddit. I'll edit: ASA means ESH.", "Oops, I forgot to add /s to my answer lol. I assumed he was saracatic too when he said freedom units 🤣", "NTA. Your wife needs to grow up and grow a spine. Her dad is a bully.", "Omg so NTA. Your FIL deserved that embarrassment.", "The fact that everyone except your FIL and your wife could see how wrong this was makes you NTA", "NTA. You didn't cause a scene, you went and ate somewhere where it was comfy and then came back and joined the party. You weren't rude or aggressive or anything.", "NTA, you did everything right", "NTA - honestly I feel very moved at how much kindness and patience you showed in that moment.  You were polite and just quietly went about your business.\n\nYour FIL only embarrassed himself with that behaviour.", "TIL there are people who can make someone who is 6’ tall and 200 pounds have a little man complex. NTA.", "NTA. Your FIL built you a chair because of your size and the wouldn't let you sit in it? You did absolutely nothing wrong.", "NTA. I fit your dimensions although slightly heavier 190kg. I would do the exact same thing if was at a family function. You did nothing wrong your FIL should have been embarrassed", "NTA and I think it was more of a power play than just the chair. My mum’s ex always used to use my tea cup that my auntie bought me as a child that had my name on it. Plenty of other cups and mugs to use, but he had to use mine to feel like some kinda big shot. I hope you still enjoyed your meal, despite your rude FIL", "NTA", "NTA op. You might want to get a placeholder and write 'reserved for op   s exclusive use ' 😉😂 you know since your initials and the fact the knowledge  that that's your chair and the only one you can sit in outside is being ignored", "NTA. \n\ncouldn’t have handled it better, you went to go eat quickly, came back and didn’t make a big deal of the situation, despite your FIL coming into YOUR house, taking YOUR chair, and refusing to move went asked respectfully.", "NTA\n\nAnd- congrats, you won this one.\n\nAsk your wife what she expects you to do next time. Breaking a chair? Or maybe breaking your bones? Or standing next to the table with your plate in one hand and trying to eat?\n\n\nYour FIL fucked around and found out. Bering called out by his own wife and even young kids should be embarrassing enough not to pull this stunt again.", "NTA. FIL is defo an AH.\nwifey needs some reflection if even her kids know grandpa cant take your chair.", "NTA but you don't have a FiL problem (which you dealt with 10/10 perfectly!) but a wife problem. Of course mom got pissed at him, anyone with a brain would! So why wasn't your wife also pissed at him? Is she a daddy's girl or something? If she can't have your back on something as obvious as this, what other scenarios are there where you can't count on her support?", "When someone does something embarrassing or shameful, it's normal to feel embarrassed or ashamed of it. Your FIL feels that way because he should feel that way. No one needs to soothe it over, apologize, or make his little feefees better. If he doesn't want to feel embarrassed or ashamed he can be an adult who chooses better adult behavior going forward. That's all there is to it. \n\nNTA. Your wife probably needs some counseling if she's too immature to tell him no on something this small.", "NTA, you should mention to your wife that siding with her father isn't going to gain her any points with him, it's only going to push OP away from her", "Right? 6'8 is a big big boy! Almost everything in the world thats not customised is gonna be too small for him. \n\nFIL thinks he's *that* big at 6' he needs the giant chair? I bet he doesn't have to duck under doorways or have his feet hang off the end of the bed. I bet he can buy clothing off the rack too. Hopefully the shame of it will prevent him from pulling such nonsense again.", "My thoughts are she would rather appease her abusive father than support her husband.", "For sure serious talk vibes about who she NEEDS to be loyal to.", "Trying to swing his dick and be the alpha male in OPs House. No logic, just ego.", "Lol freedom units. Hello friend from America.", "Wanna bet?", "[deleted]", "I'm not saying the wife shouldn't stand up to her father but it is difficult for people like that to stand up for themselves or others when their entire life theyve been conditioned and brow beaten and broken to obey that person.", "Hey!", "Yes, that is where fil is an childish asshole. He should have moved when OP let him know it was his chair. He was obviously ok with chasing him off his chair but he maybe didn't wanted to chase OP completely off the table and the garden.\nHe made fil look even worse then he intended with his seat choice and embarassed him.", "Seriously.  I think it would be obvious that he couldn't sit anywhere else, or he would not have asked FIL to move.  What was he supposed to do, eat standing up?", "Easy there, tough guy.", "Lmao, I like the general idea. But five simple words, delivered in an appropriately menacing tone, would also do the trick (keep the whispering part): *\"I know what you're doing.\"*", "Oh I have no doubt. Doesn’t change the observable fact that she needs to evaluate WHY she would rather defend her abusive father.", "[deleted]", "[deleted]", "Something tells me you don't have a wife", "Settle Petal.", "I have lots of experience with a passive-aggressive mother-in-law, thank you. Feel free to DM me any time you need advice in the future.", "As a fellow big guy (6'6 320lbs so I know the issues with chairs), NTA. You didn't start a fight or disrespect anyone. You quietly saw to your needs.\n\nEither your FIL was trying to start a fight, he wanted you to break a chair and be embarrassed, OR he's an aloof dude who can't be bothered to pay attention to the situation. Any of those reasonings are not your fault and the only winning move here was not to play.\n\nIf your wife is mad, she should be mad at her dad or herself for not standing up to you.", "NTA. Your wife is upset because you very politely rocked a boat that (I suspect) she has spent a lifetime steadying. When you're used to appeasing someone, it can be a shock to see a third party refuse to play along, even when that refusal is the most reasonable course of action.", "NTA. You didn't cause your FIL to be yelled at by your MIL, he caused it by behaving poorly.", "NTA- but I am super curious if this is the first time your FIL had ever been to your place and seen this chair?", "Your dad made you that chair. Your initials are carved into it. You are polite, move away and then returned. And your dad built the custom bloody chair for you!!\n\nNTA", "There are two assholes here, you aren’t one of them. NTA.", "You handled it fine.  FIL learned what you would do if he doesn't move.  He is embarrassed, so what? \n\nYou left, and didn't return until after your meal was done.  It emphasized FIL's failure to move.\n\nI find it more telling that your MIL and your children asked FIL to move before your wife asked him to move.\n\nNTA", "> My wife said that I behaved poorly and caused her father to be yelled at by her mom. And that even my kids told him that he shouldn't be sitting in my chair.\n\nHow confusing. Your reaction didn’t cause this. You had nowhere to sit. Logistically, no other option.  \n\nHe was yelled at and harangued because he deserved it for his rudeness. \n\nNTA", "No one’s gonna ask about his torture basement, I mean home office? Heh heh", "Nta. Anyone comes to my house and tries to take over won't be allowed back, ever. \n\nGot a wife problem. Your kids are good", "NTA - FIL was pulling a dominance move and you refused to play the game.  Without an opposing force, he fell flat on his metaphorical face.  The only person who's to blame for his embarrassment is himself.", "NTA.\n\nSomething something daddy's girl, something something grow a spine, something something cut the apron strings.", "Controversial opinion, but ESH. You have *one* chair you can eat in? Lose some weight, dude.", "ESH you threw a tantrum over a chair and your excuses for not eating in other areas aside from your locked office without your phone aren't even legit. You were mad at the chair situation which was disrespectful but instead of standing up for yourself you just dipped and let the scene unfold by itself which arguably made it a bigger thing. Also you left your wife and company alone and were rude to them. Her father was wrong to take your seat but you didn't have to go hide and pout with your meal. You could've eaten in the kitchen or living room, \"full of people\" my butt. You just wanted to sulk. Also here's a clue, buy more chairs", "NTA. You didn’t do anything wrong. In fact, your FIL is the A**. You don’t come into another man’s house and show anything other than respect.", "INFO:  would you be able to bring your office chair to the deck?", "NTA. Your wife is the problem here.", "He got yelled at by his wife. So what? Isn't he man enough to endure that?\n\nNTA", "NTA but your wife & FIL definitely are", "NTA. However, you might want to get more weight bearing chairs. Maybe the other options were uncomfortable for your FIL as well. \n\nI'm glad other people stuck up for you, not sure what's going on with your wife.", "NTA, you did what you should've done. I think he was trying to prove himself against you. Also he's a big guy but still only about half your weight. He doesn't need that chair.", "NTA,  \n\n\nI think you were very mature in handling the case, without causing any drama (at least not on purpose).  \n\n\nAlso.. 6' a big guy? \\*Laughs in Dutch\\*.", "NTA", "NTA. FIL was being rude.", "Definitely NTA! So maturely handled.", "NTA Your FIL should expect to be yelled at by his wife. Someone has to make sure he behaves and one spouse's behavior generally reflects on the spouse as accepting of it unless stated otherwise (fair or not).", "NTA by a mile", "NTA.\n\nHonestly it sounds like your FIL was trying to assert dominance and it backfired. Spectacularly. Particularly seeing as it was a chair custom made, for you, by your father. Nah, that was deliberate and he's just embarrassed he was called out on it.", "NTA", "NTA.  You don’t have a father-in-law problem, you solved that already.  You have a wife problem.  She needs to grow a spine and stand up for her husband, rather than make you the problem when you handled the situation perfectly.", "NTA, you asked him to move but he refused. You were right to not cause a scene.", "Well next time sit in his lap I guess 🤷🏻‍♀️ idk what else your wife expected you to do here...", "NTA. He got what he deserved", "NTA at all but…are you Brian Shaw? Lol", "He fucked around and found out. You were respectful and discreet about going off to eat, and came\nOut as soon as you could. No issue., your wife needs to figure out some stuff here. NTA", "NTA your wife needs to have your back. You removed yourself for the situation like an adult. It's sad everyone else came to your defense and comfort but not your wife. Him being embarrassed is not your problem.", "NTA. your wife has some issues she needs to work through", "NTA, your wife is wrong\nYou did absolutely nothing wrong, even to the point of telling him everything's cool after he apologized. FIL should have moved for you, he sounds like an AH.", "NTA. It's super annoying to see how many people project their own insecurities or embarrassment onto other people. You didn't do anything wrong and your wife needs to learn to handle her emotions.", "NTA, your wife is the asshole for saying you behaved poorly.\n\nIt sounds like she was embarrassed and is taking it on you.", "NTA.  You're a man mountain and your FIL should have shifted his ass.", "NTA. \n\nNot only is it your house and your chair that he is sitting on, but it sounds like it is obvious that out of the two...you need that chair more than he does. You chose to not make a big deal out of it which is nice, and went to eat somewhere you felt comfortable. \n\nThe fact that your FIL rightfully got embarrassed by his actions is not really on you. He should have been more courteous of his hosts needs too.", "NTA, in fact you were very polite.  Most people your size can be very intimidating. FIL is the asshole, he deserved to be publicly shamed.", "NTA \n\ndid FIL think you would break your chairs to show him that there is only one seat for you", "NTA. OP asked politely and didn't lose his shit when asshole FIL refused. OP really is a gentle giant <3", "NTA.\n\nYou peacefully avoided any confrontation and just removed yourself from the situation to eat. When you came back, your FIL apologised and must have realised he acted like an AH. Your wife seems like (from an outsiders perspective) she might have some issues with her father and might need to work on those in order to be more open to her dad.", "NTA.  FIL and wife are.  Him for disrespecting you in your own house, your wife for not calling him out on it.  When I first got married I had some issues with a couple of my in-laws trying to tell me what to do when they were over.  Each time it happened my wife called them on it and told them if they ever disrespected her husband in his own home again they'd no longer be welcome there.  At least MIL had your back.", "Remind your wife that apart from her, no one supports her father's grandiose tool measuring contest. I hope he was drunk, because if he's like that sober he must be impossible.\n\nNTA", "You’re wife needs to be able to stand up to her father the way she has no issue doing it to others. It’s not like she has to lash out at him, just a simple “hey dad, that’s his chair and the only one he can comfortably sit in. Please move so we can all sit together!” You’re NTA. If you would’ve made a big deal out of it and blown up, then maybe because I feel it isn’t appropriate for the situation. So kudos to you for knowing it’s not worth the fight. But if anyone is the asshole it’s your FIL. He most likely knows already that this is YOUR seat, whether he was trying to be funny or not, he should’ve just gotten up right away!", "NTA\nYou didn't cause a fuss, you politely asked FIL to move and when he refused went elsewhere to eat and came straight back, still sociable and accepted his apology with no issues, you did everything right and probably handled it better than most would.", "NTA.  Your FIL is TA here.  He knew it was your chair & you asked him to move.  Everyone asked him to move & he refused. So if he got yelled at & embarrassed, that's on him.  What were you supposed to do?  Stand up & eat?  You didn't do anything wrong.  You found a comfortable spot to eat your food then you rejoined the party.  NBD.", "NTA  \nNo reason for you FIL not to move.   \n\n\nAlso, what do you do for work? The way you described the security precautions made it sound very mysterious and intriguing.", "Nta he had everyone telling him not to sit there bar your wife and you even asked for your seat back. Disrespectful and out of line from both your wife for not reminding her dad and then trying to act like you were the problem and your fil for blatantly sitting in your seat even after being asked to move so you could join everyone, instead his comfort and as more important than you joining them for dinner at your own home. \nHis wife shouting at him isn’t your fault but was his and if your wife had simply gotten her dad to move it wouldn’t have happened. Instead she was putting his comfort above yours which is ridiculous, he’s only 6ft you’re 6ft 8 and clearly she knows that you need that chair to support you. \nSeriously initials are on it and everything.", "NTA. I would love to hear how your wife would have preferred you handle that.", "NTA. You didn’t behave poorly, you resolved the issue without making a big deal of it. It’s not your fault that everyone else did make an issue about it.", "NTA at all.  You asked, he declined.  Rather than start something, you did the gracious thing and found someplace comfortable for you to eat.  You weren't sulking or pouting at least according to your telling of the story and you even ate quickly so you could rejoin the party.\n\nIf your father-in-law is embarrassed it's because he brought it on himself.  Your wife's response was completely out of line.  If it's a recurring problem, might be worth addressing.  But if you don't see them that often or her inability to tell him know doesn't generally cause problems, it's probably not worth fighting about it.", "INFO: why can't you eat in the other chair but you can have a beer in it?", "NTA but your wife and FIL are the AH’s.", "Your wife has daddy issues that she needs to work on if she’s going to be a grown up in a grown up marriage.", "And his wife is just a big an AH. I mean, did she want her husband to sit somewhere else where that chair couldn't hold his weight, the chair breaks and he's either injured, embarrassed or both? \n\nI'm glad everyone else saw that Dad was being an AH, including OPs kids and MIL. The wife must be really be terrified of standing up to her Dad. They're both ridiculous.", "[removed]", "Exactly. Wife is AH too.", "Maybe he should've sat on FIL", "I'm curious about this too, what's the resolution in her mind?", "[removed]", "Oops. Thank you", "He is 6.8ft the weight aint the problem dummas", "I think his wife is only upset because even her kids have no problem telling Grandpa he was wrong, but she still can't.", "NTA your wife needs to have your back.", "NTA but your wife and FIL are.", "Yeah ‘you made my dad get shouted at by my mom!’, how? Dad got himself shouted at by mom, I absolutely hate how so many people act like it’s the person speaking out who got the AH in trouble when it’s actually the AH reaping the consequences of their actions.", "Fil isn't that height. Father in law is 6ft. Just over 180 cm. Op is 6.8 making him over 200 cm", "It says 182 ? Did it previously say 282 ? Lol", "That's how I deal with my cat, I tell her I'm going to sit there, and then I proceed to start sitting down. She's learned what those words mean and usually gets down before I turn around. Lets see if the FIL can beat my cat when it comes to figuring it out.", "Probably anything that absolves her of wrong doing", "Comment stolen from u/Riutfragus7597", "My husband is 6’8” and only slightly lighter than OP states they are and our dining room chairs are solid steel mid century vintage because he has sat through every cheap piece of furniture we’ve owned. \nNTA OP i bet she’d have been annoyed if you’d have conceded and sat down to eat in a chair that can’t hold your weight and broke it.", "FIL is an Oompa Loompa compared to OP, what an ass.", "Works on kids too! Lol", "You were raised by your father in law? This probably explains your awesome attitude.", "> Except I would have quietly whispered to my father in law, after his rude ass comment, to get the fuck out of my chair before I cleaned his ass up in front of the family.\n\nThen there would be two assholes in the conversation.", "i mean... tbf the FIL did not raise op, he raised op's wife... so trying to say \"exactly how you raised me\" would be really weird.", "Dangerous too. I used to date a 6'4 big boy and he went through a chair and landed on his tail bone, he already had back issues because of his height, and he was hurting for a couple weeks after that. \n\nIf you're at either extreme, big or small, the world is not designed for you. My little mummy was 5' and a bit so i (5'10) was always getting stuff off shelves. She's since passed but if i see a shortie trying to reach for something from the shelf in a shop i always offer to help get it for them.", "I agree, though it’s interesting that nobody else had a problem standing up to her father when it was called for. So capitulation to her father doesn’t seem to have been something she saw modeled by her mother, even if as a child she was taught to give in and take or redirect the blame away from him.", "As a 5'0 nothing woman, i appreciate you. It drives me nuts how high stuff is sometimes and the audacity to tell me i cant climb to reach it when theres noone around to help 🤣", "Its not like you can carry a step stool whereever you go....although that would be pretty cool, carry it like a furled umbrella and *bing* little ladder!"]}