{"id": 23164, "submission_id": "15a4e93", "title": "WIBTA for going back on my promise to get my daughter a pet fox?", "selftext": "My daughter (16f) has gotten really into some particular social media channels it seems and has become pretty determined to have a pet fox. \n\nShe's done all this research and begged me for it, and says she knows they're expensive but she could put $200-300 a month towards it from what she makes at her part-time job at an arcade here.\n\nI spent about a day doing research and told her, fine, if she can find a fox rescue to volunteer at for a couple months, and she can build a suitable enclosure in our yard (we do have a big enough yard), then we can get a pet fox.\n\nI sort of expected she'd be deterred by the reality of it but it doesn't seem like it. Within a week she'd found a wildlife rescue place half an hour away and got a volunteering spot with them, and has been going to volunteer there for the past 3 weeks, one day a week. She also started researching how to build the enclosure and has some friends who said they would help her out...\n\nBut I've started to think this is a really bad idea. Firstly every time she's come back from volunteering she's brought this really horrid odor back into the house. The first time I passed it off as she must have slipped and fell in some awful mess there or something, but no, it's been consistent. The second time I talked to her about it and she rolled her eyes and said \"Oh it's not that bad, it was rough for my first hour or two but you really do get used to it, all animals have a smell like dogs/cats etc.\" Her clothes appeared to be all clean, but still carried the smell.\n\nSecondly it seems like it will be too much work for her, while managing school and work. But she promises she can make it work and says \"I get straight As, it's not fair to use that concern against me\"\n\nI know she'll be really mad and feel like she did a lot of work for nothing if I go back on my word and say we're not getting a fox, but I'm worried about the consequences of getting one. WIBTA for going back on my word?\n\nTL;DR: Promised daughter a fox pending certain conditions, she's surprised me by fulfilling them, WIBTA for backing out?", "created_utc": 1690374223, "permalink": "/r/AmItheAsshole/comments/15a4e93/wibta_for_going_back_on_my_promise_to_get_my/", "score": 2858, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Going back on my promise to my daughter\n\n2) I can understand why promises are important and shouldn't just be disregarded\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Wild animals are not pets, she will probably loose interest in the animal if you got one and it will probably end up neglected/unhappy.", "YTA.  You did not do enough research.  Foxes smell awful, much worse than cats or dogs.  Your yard will smell bad forever.  You should never promise your kid something assuming its never going to happen, because kids will make it happen.  \n\nWhat is the plan once she turns 18?  Is she going to live at home?  Go to collage?  You can't bring a fox with you to collage or to an appartment.  In general the teen years are the worst time to get a pet.  \n\nLook - you are going to have to go back on your promise because there is a good chance if you get that fox your neighbors will complain about the smell  and you'll have to get rid of it anyway.  Your daughter is a little bit of an asshole too for not being honest about the smell.  But you are going to have to figure out how to make it up to her.  Just don't get the fox.", "Easy. Yes yta. What are you teaching her? That it's totally fine to go back on your word, when it suits you. Is that what you want her to get from this? You basically lied to her then. Great parenting!", "Info: your daughter is 16 and I assume will be going off to school in a year or 2. What is the life expectancy of a fox? And who will take care of it when she goes off to school?", "YTA\n\nFirst of all, never make a promise you don't intend to follow through on. You state that you thought she would be deterred - you should have prepared yourself adequately for what you would do if she did as you told her to do. That's on you.\n\nAlso, FWIW, the smell thing is not something you need to have a chief concern about. Working at a shelter creates a far different odor concern than having one animal, even if that animal is a fox, at home. Shelter's have dozens of animals and it's a much stinkier environment, that kind of smell isn't created by one singular animal.\n\nYour daughter has proven herself to be responsible - she has straight A's, she happily has worked this job, she's educated herself on the matter. Do her a solid and educate yourself on what ownership of this would look like. Have a frank conversation with her about whether it's reasonable to get an animal that she wouldn't be able to take to a college dorm with her. If she can think through all the possibilities and take full ownership of the animal, then this could work. But, don't just go back on your word because YOU were irresponsible in your decision making. Meet your daughter's maturity level and go from there.", "YWBTA to your daughter but not the fox \n\nNever make promises you never intended to keep and never promise to give someone a wild animal for a pet. Foxes are not pets. They’re not domesticated like dogs and they can’t ever be trained to be like one. They destroy everything and will absolutely wreck everything you own, and they smell so bad.", "INFO: Do foxes really stink **that** bad? Seems like that's the number one concern, I know people say they stink but I wondered if it that's much worse than dogs.\n\nCouldn't she shower or something after volunteering with them to fix that issue?", "I think NTA. You said yes when you had different information. Do it sooner rather than later and really explain why your decision has changed and that it's based on new information and explain that information to her.", "YTA for making the promise in the first place\n\n\n\nHowever, pet Foxes aren't ideal. From the fox channels I have seen, they discourage owning foxes because they smell and are quite destructive. Your house will be destroyed.\n\nSo saying no was the best", "YTA for promising something you can’t legally get her. To own a fix you have to own a sanctuary for foxes or a zoo. Do research before making promises like that", "YTA \n\na \"bAd sMeLl\" is **not** a reason to back out of a promise, what sort of weird logic is that. it's a smell, get over it", "YTA for making a promise when you thought you could get out of.", "YWNBTA. eta: but you were an AH to allow her to think that this was a good idea without thinking it through fully.\n\n**FOXES ARE NOT PETS**. They are wild animals that require a lot of special time and care that a 16 year old is not likely to be able to provide without unique circumstances (i.e. a parent works in wildlife rehabilitation, is a vet, etc.)\n\nNot to mention, she likely will want to attend higher education, leaving said fox with you and that isn't acceptable. \n\nFoxes are beautiful creatures but they are destructive, smell and are *expensive* to keep.\n\nMaking your daughter see the realities of caring for foxes in a rehab was not a bad idea but you need to sit down and really discuss the reality here.", "Well as horrible as backing out of a promise can be, you need to be sure a live creature will be in safe hands and cared for.   \nThese are wild animals unlike dogs where they have been bred to do certain jobs for 100s of years.   \n\n\nYou're the parent here, you need to make it clear that just because she wants something it does not me she should get it, promise or not.   \nShe can always use the money to save up and when she's old enough to move out to get one of her own.  \n\n\nJust make it up to her, she'll be mad but she will understand later on.  \nAnd yes, as much as I adore foxes, THEY STINK!!", "INFO: Can you even legally own a pet fox where you live?", "Schedule a zoom call with an animal welfare ethics professional and talk everything through with them with your daughter.\n\nEdit: also have a meeting with whomever runs that rescue about why wild pets are a no no.", "YTA. You shouldn't have made the promise from the get-go but it's even worse that you waited until she fulfilled her part of the bargain to go back on the promise.", "YWNBTA for not getting a fox but, as everyone else is saying, YTA for promising one.\n\nI think you need to explain to your daughter about the smell and that you’ve realised you can’t live with it. Tell her you made the promise in good faith and dismissed the thing saying foxes are smelly assuming they would just be like dogs or something but that you were wrong. Own up and apologise for making a mistake and work with her to find a different pet that she can have. Make sure it’s one that likes to be kept as a pet though as not all animals can be domesticated well. \n\nSpend time with her finding a different animal that works for you both because you owe her at this point, because you’re going to break your promise.", "You could say no, but you'd definitely be the asshole. If she gets straight A's, earns her own money by working, has friends and wants to take on even more responsibility to care for a sanctuary animal, you really ought to let her. You made a promise, and you might not have been serious about it, but you're raising that kid and you don't want to teach her that promises mean nothing, right?  \n\n\nBiased, because I happen to love foxes too, but if I were your kid I'd be seriously mad at and disappointed in you for what you want to do.", "YTA for promising this. YWBTA even more if you go through with it. \n\nFoxes aren’t supposed to be domesticated or in peoples homes. A rescue fox may need to be in this setting due to trauma or abuse from humans but it still shouldn’t be. Your daughter isn’t qualified. I know she probs got this off Instagram with that woman who has a pet fox - but she’s a vet who took it in because it can’t live in the wild. Even she’s said she wouldn’t recommend it as much as she loves her fox. \n\nIt will smell, it will be a full time job looking after it. It will stink the house and garden out, your house will always stink. \n\nIs your daughter taking the fox when she moves out? They require a lot of space. Is the enclosure fully secure? If it gets out, it won’t come back. \n\nFoxes are feral. They are not cute domesticated animals. They will not sit and let your daughter pet them. They will be aggressive in your backyard. \n\nThis is incredibly cruel on the fox. It shouldn’t be in your backyard with not enough space and people who don’t know how to take care of it. \n\nHugely bad idea. Foxes aren’t pets, get her a cat.", "YTA but don't let her get a fox. You're neighbour's will hate you and it's a wild animal, not a pet. Tell her your house insurance won't allow it if you want or tough it out and tell her the truth that you made a mistake.", "YTA. \nYou told her that if she met certain conditions, she could get a fox. She's met those conditions. Talk to the people who run the place she volunteers at about the smell. It could be from other animals, or it might be because they don't really bathe the foxes they're rehabilitating (bathing would seriously stress a wild animal while a captive born one would be used to it). \nIt's not her fault that you didn't do enough research. Talk to the wildlife people to see what can be done to abate the smell.", "ESH.\n\nYou are correct not to let her get a fox, but you *are* going back on your word.\n\nFor her part, it's wildly ignorant to be working with an animal rescue and also want to have her own exotic pet. There's no way that a reputable rescue organization would support that,  especially since they'll likely be the one that the fox is rehomed to once your daughter can't care for it any more.", "NtA is she going to skip going to college to care for it?  Because they live about 14 years. Remind her dating will be a challenge if she reeks of fox urine, and she will reek of fox urine. It gets in your hair, pores, clothes and is 100 times worse than cat piss. And liability insurance? Gon a have to keep that going for the 14 years. And that will be on you for at least the first several years, that is if you can even find insurance.\n\nI love long tail macaques, but as an ADULT I know they belong in the wild and should never be a pet. She's a child, it's up to you to be the adult here", "YWBTA she did everything you asked you would have no good reason to say no", "YTA for making her this promise in the first place since you never intended on fulfilling it since you didn't expect her to meet the conditions, but N T A for going back on it. Foxes are not pets. Even \"pet\" foxes are a bad idea. I bet the wildlife rescue she volunteers at would also discourage her from attempting to keep a fox as a pet, considering those folks likely have a ton of experience dealing with people's so-called \"pets.\"", "YTA. One, for making a promise you never intended to keep. Two, for thinking a feral wild animal is okay to keep as a pet. Whatever law in your state that says you can keep a fox as a pet is wild and so dangerous. It's like when people's pet monkeys attack them and disfigure them for life and then they're surprised. It's a WILD animal. Foxes are not domesticated like dogs and cats. Just because you CAN, doesn't mean you SHOULD. The ONLY reason a human should have one is if they are an educated, licensed and professional rehaber doing their job!", "As others have said, YTA for making a promise you didn’t think you would need to keep, but you would not be TA for refusing to let her have a pet fox \n\nYou might want to go with her to her volunteer place and talk to one of the people who run it what they would recommend for someone who wants a pet fox. If they’re at all responsible, they will shoot down the idea REAL fast. I would imagine that at least one of the foxes under their care is someone’s impulse buy.", "YTA for making the promise in the first place. you really should have researched about the smell in the first place - the grades argument is less convincing, but the smell is not a joke and is the number one reason pet foxes get surrendered.\n\nbut **do not let her get a fox**. be honest, tell her you did not do enough research on this matter and you were wrong. I think it's reasonable to apologise for not being able to keep that promise, and to find a way to make it up to her. she's going to be angry and upset, justifiably so imo, but absolutely do not let her get a pet fox. parents do make mistakes, no one's perfect, but what you do after making that mistake is really important. neither of my parents have ever apologised to me in my life, even when they've changed bad behaviour, and I notice.", "YTA for making the promise in the first place but I can't blame you for going back on that promise. Foxes are terrible 'pets' and I really doubt all the channels she follows shows how life actually is with a fox. They are destructive, smell horrible and even the 'domesticated' ones i've met have awful attitudes.", "YTA for making a promise that you never intended to fill. \n\nYWNBTA for not allowing her to get a fox. Foxes are not pets. The one who ends up caring for this fox when she goes off to college, etc will be you. \n\nBut let me reiterate. You're a massive TA for even making that promise in the first place and your daughter has every right to be furious with you. You have damanged your relationship with her by lying to her.", "YTA for promising her something without thinking it through. And more so for not believing in your 16 yo childs ability and dedication. \nNow to not be TA you either need to apologise, and make your amazing 16 yo understand how much of an A  you really are and explain how you did not own up to your role as a parent. And apologise and make it up to her somehow. \n\nOr the simple solution get the kid a pet fox. And live with your bad choices. Also a fox can be a pet. Don't listen to the US Americans.", "YTA for making the promise, not that you won’t get her one.", "YTA. You should have never made the promise in the first place and letting her be so influenced by YT. \n\nFoxes are not pets. They are wild animals, they stink to high heaven and are very expensive. What happens when it needs medical care? Her budget will not cover it as it would need specialized care or an specialized vet.  She's going to stink all the time which will be an issue for your house and her. And other users made a great point. What happens if he goes to college or moves out? Are you going to take  care of it?", "YTA\n\nnot getting a fox is normal but you are going back on a promise after your daugther did everything, you were an asshole the moment you as a parent made a promise you never intended on keeping and didnt research and communicate properly. either way talk to your child and owe up to the fact that you fucked up majorly and try and find a comprimise.\n\nin the situation yta but its nothing that cant be fixed withhonest communication, responsibility.", "YTA for making the promise but please absolutely do NOT get a pet fox.\n\nLook up juniperthefox on instagram. Find the posts about fox bites and smells and why they make horrible pets. People who rescue foxes from fur farms are selfless heros who dedicate their lives and homes to the animals. What happens when your kid goes to college?!", "ESH - both of you for not doing enough research about captive foxes and not adequately taking into account the long term needs of a captive wild animal. \n\nYou daughter is 16, so of course she’s going to be blissfully naive about the true magnitude of the responsibility she’s taking on. It’s your job as an adult to help reign in her enthusiasm and help her face some harsh truths before bringing an innocent animal into the picture.\n\nAs a vet who has worked with a lot of exotic animals, the exotic pet trade is a huge pet peeve of mine. Most of these wild animals suffer greatly at the hands of inexperienced but well-meaning owners, be it physically, mentally, or both. In one state I used to visit for work, keeping foxes was legal and it wasn’t uncommon for parents to buy fennecs and red foxes for their kids who just HAD to have one. I was able to keep tabs on a few of them, and the sad reality is that they all died premature, preventable deaths or sustained life-altering injuries. \n\nFor example, one fox died of heat stroke because the teen girl it belonged to didn’t realise that foxes can’t tolerate extreme heat (there’s a reason we make winter coats from their fur, it’s really fucking warm). She thought that because it’s a wild animal it can live outside just fine. Another fox lost its front feet to an aggressive kennel mate. The owners were afraid their first fox was lonely so they bought a second fox and left them unattended overnight. Another escaped its enclosure and was hit by a car.  \n\nAre there a few private owners who are the exception to the rule? Sure. But the vast majority overestimate their abilities, underestimate the level of care these animals need, and the animals suffer and die.\n\nYour daughter is going through a period in her life where a lot of things are going to be changing, and introducing a captive wild animal into the mix isn’t fair to anyone. If she really, really wants a pet fox she should wait until she’s established in a career with her own house with enough free time to devote to its needs. Anything else would be selfish.", "I do think YTA if you back out.  \nHowever, I also think keeping a fox as a pet should've been a hard no at the start.\n\nIf you really must back out, maybe an alternative?  \nThis place in cumbria does wolf and fox walks/experiences.\n\nhttps://www.predatorexperience.co.uk/wolf-experience-and-fox/", "I mean, yeah, YTA for making a promise you didn't have enough information to make.", "YWBTA You blithely promised after a bare minimum of research. You have allowed your daughter to wrap up her time, energy, effort, and money into fulfilling your requests. This young lady has dedicated herself to this goal based on your promise. You need to sit down and do the real research or better yet, ask your daughter all the questions you should have researched in the first place and find a way to make this work. If you back out now, it's unlikely you will ever be forgiven.", "YTA but not getting fix is right thing to do", "NTA.\nTruly consider this thread full of kids sometimes.\nYou can explain to her that you've made a mistake and upon further thought, getting a frickin fox perhaps isn't the best idea. \nVolunteering at the rescue seems like a happy compromise, is there any extra responsibility she can take there instead? Is there any more reasonable pet that she could want?\nYou're NTA for not wanting to get a fox, you WBTA if you didn't discuss it with your daughter ASAP so she can begin to accept it and see if there's any compromise she can think of.", "Well, I think you can wait a little bit more before deciding. In the meantime raise the issues other commenters mentioned, as going to college, etc. You said she has to volunteer a couple of months in the rescue before getting a fox. Probably soon in these months she'll start to notice the consequences like her friends/school/job being annoyed by the smell, and will learn more about the ethical concerns of having a wild animal as pet. If you're lucky, this will put her off the idea. If you cut her now, YWBTA. Continue to politely show her the cons.", "You need to have a serious conversation with your daughter about how to care for the animal for its entire life. She's 16 and will be moving out in a few years for college or just to live on her own. How long to foxes live? Who will take care of the animal when/if she leaves home?\n\nBe honest and say you didn't think it through. Ask her how she will feel if she adopts a fox then has to give it up?\n\nYTA for giving her a promise. Be the grownup and say you made a mistake then take your lumps.", "I mean you have to have known by promising her that she expected to get a fox and backing out will make her lash out then question your word. I suggest for the sake of our relationship with your daughter, household (foxes are not pets they will destroy your house) and some quality time for you both. Go and volunteer at a resort or shelter for foxes so she can understand the work and care that the animals deserve. This can also open up better ways to communicate and quality time together. Trust me when my father was in life it hurt when he backed out on promises which made me resent him more but now he's gone and I had a lot of regrets but I remember a time he knew how much my sisters and I love wolves. He knew a guy and together we spent the afternoon just observing the wolf, feeding him, and my dad was happy. I was happy this is one of the few memories I remember I was happy with my dad.", "Sorry but YTA. You obviously should not get a fox (the smell will not just affect the family— it will affect your neighbors too.) However, saying “no way, never gonna happen, sorry kid” was the way to go. It’s too late for that so you’ll have to find a way to make it up to your kid. \n\nMy unethical tip to you is to start faking a fox allergy.", "YTA, as you're breaking your promise. Why didn't you do research before agreeing to anything?", "I think YTA already for lying. I'm not answering further.", "YWBTA you should never make promises to your kids you don’t intend to keep and you flat out admitted you thought your daughter would lose interest and you wouldn’t have to go through with it. \n\nHad that not been your intention you would still be the AH, but less of one. Sometimes the reality of a situation is far different from the hypothetical and a pet should be something everyone on the family is on board with. But, you made the promise and breaking it is still the AH thing to do. You might ultimately decide this is worth being an AH about as somethings are but you have to accept the consequences of that. The consequences are you have an upset teen who thinks they can no longer trust you at your word. It will be your responsibility to deal with that.", "NTA, it really sucks that you rushed into this promise but I think you have to break it...really bad idea\n\n>she could put $200-300 a month towards it from what she makes at her part-time job at an arcade here.\n\nUhhh you know she's going to **lose** the job, right? From the stench. Fox owners just stink. I knew a fox rehabber who was the sweetest woman but it was tough hanging out with her because that godawful odor just followed her everywhere, even when it's faint it's really obnoxious and unsettling and repulsive.\n\nI imagine her teachers would have something to say about it too...", "No if your daughter goes to college moves in with a boy friend , YOU will likely be left to take care of a fox . A dog is commitment enough but a fox , it can be hard to even find a vet never mind a pet sitter , I doubt its even fair to keep one alone .", "ESH, but do not get a pet fox regardless. You should not have made that promise, and it was an unreasonable ask from your daughter given the logistics of fox care. That being said, you are the adult in this situation and should have known better. \n\nA day of research is not enough to make a decision about getting any sort of pet, especially a for a non-domesticated animal that will require very specialized care. I don't think a teenager is remotely capable of providing that care. Additionally, what will happen when your daughter goes to college or tries to move out? There is a 0% chance that a typical rental would allow her to have the fox. \n\nWhich brings me to the most important point - fox urine STINKS. Everything in your home and backyard is likely to stink. If you want to experience what it would like to own a fox, have your daughter bring back stuff soaked in fox pee from the wildlife rehab and let it sit in your house and backyard (or don't, if you value your sanity and want to take my word for it). \n\nI think that you should apologize to her and explain that you were misinformed and make a suitable and well-researched compromise (e.g. getting a pet cat or a dog instead).", "YTA. Don’t make promises that you don’t intend to keep.  \n\nAlso, don’t get a fox. They’re not pets. Explain, apologize, offer to pay for her time volunteering, to get her a suitable pet, to send her on a vacation, anything to say you’re sorry. Just don’t get the fox.", "YTA for breaking a promise to your daughter but i am sympathetic because i would not want to live with a fox either LOL", "NTA because foxes are not pets. Probably shouldn't have initially agreed but not gonna hold that against you since she's a kid", "YTA\n\nAnd you know that. You are too fucking old to be learning the lesson of never making promises you can’t keep.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy daughter (16f) has gotten really into some particular social media channels it seems and has become pretty determined to have a pet fox. \n\nShe's done all this research and begged me for it, and says she knows they're expensive but she could put $200-300 a month towards it from what she makes at her part-time job at an arcade here.\n\nI spent about a day doing research and told her, fine, if she can find a fox rescue to volunteer at for a couple months, and she can build a suitable enclosure in our yard (we do have a big enough yard), then we can get a pet fox.\n\nI sort of expected she'd be deterred by the reality of it but it doesn't seem like it. Within a week she'd found a wildlife rescue place half an hour away and got a volunteering spot with them, and has been going to volunteer there for the past 3 weeks, one day a week. She also started researching how to build the enclosure and has some friends who said they would help her out...\n\nBut I've started to think this is a really bad idea. Firstly every time she's come back from volunteering she's brought this really horrid odor back into the house. The first time I passed it off as she must have slipped and fell in some awful mess there or something, but no, it's been consistent. The second time I talked to her about it and she rolled her eyes and said \"Oh it's not that bad, it was rough for my first hour or two but you really do get used to it, all animals have a smell like dogs/cats etc.\" Her clothes appeared to be all clean, but still carried the smell.\n\nSecondly it seems like it will be too much work for her, while managing school and work. But she promises she can make it work and says \"I get straight As, it's not fair to use that concern against me\"\n\nI know she'll be really mad and feel like she did a lot of work for nothing if I go back on my word and say we're not getting a fox, but I'm worried about the consequences of getting one. WIBTA for going back on my word?\n\nTL;DR: Promised daughter a fox pending certain conditions, she's surprised me by fulfilling them, WIBTA for backing out?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA, why even make that promise if you were never going to get a fox no matter what? FFS, say no to stuff, don't just hope things will go your way.", "I think you know that yta for making a promise you never intended to keep\n\n…that being said the decision on whether to follow through is still yours to make so you might just have to suck it up and apologize to your daughter and tell her why you won’t get a fox \n\nAND most importantly **deal with the consequences**, most definitely her being **justifiably** mad at you.", "Wtf would you agree to that omg. YTA for that. She can continue to volunteer but no fox at home. They piss everywhere and are notorious for it.", "YTA for saying yes in the first place, but should not follow through on your promise to have a fox as a pet. Even if raised from a kit they are not bred domestically, are still wild animals, and holding them in captivity is cruel. Neither of you have done enough research on this subject if you considered this a good idea. Tiktok is not an acceptable resource.", "YTA. IDK how you spent a day doing research and didn't discover that fox piss is one of the strongest and most offensive smells known to man. You absolutely need to back out, tell her that you screwed up big time and find a way to make it up to her.", "YTA, but better to be the asshole than go through with a promise when you didn't understand the full implications. Be honest, you made the promise when you didn't understand what that meant. You don't want your backyard to smell like fox now that you understand what it's like. You also would owe your daughter something to compensate for the broken promise.", "Foxes are NOT pets yta", "You might be right not to get a fox, but YTA and a huge one for making a promise with no intention to keep it. She's rightfully never going to trust you again. You better do something big for her to make up for it", "My wife and her daughters have run rescue's for years. They have had baby foxes delivered to them, after mommy fox got ran over or whatnot. You can raise a wild fox \\*to a point\\*. Not sure where \\*these\\* foxes are coming from but...Once they get to a certain point: Every single fox they had went feral! Instead of gently taking food from their hands, the fox would start to nip and use teeth and get more and more aggressive. They had to always return them to the pines to go live their lives, which is probably a better idea for them anyway....", "YWBTA. Why do parents keep posting \"aita for lying to/deceiving my child?\" The answer is literally always yes.", "This guy had to live with a bit of fox pee for breaking hunting laws.. worth a read - https://www.reddit.com/r/BestofRedditorUpdates/comments/t5yros/fox_poacher_forced_to_live_with_fox_urine_in_his/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1\n\n maybe read a few other redditors fox experiences. It’s not pretty. If you got a fox for her you would be TA. Right now your just .. an idiot for letting it get this far. \n\nhttps://www.reddit.com/r/BetterEveryLoop/comments/c8e6l9/living_with_a_fox/esmrjmg/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3", "NTA.  Although you should not have made the promise in the first place. You need to sit her down and let her know firmly it is not happening.", "YTA. You promised her, because you thought she wouldn’t go through with the conditions. So you never actually thought you would have to honor that promise, and you still don’t want to. I personally don’t think she should get a fox, since foxes are wild animals, not pets. But you’re screwed.", "YWNBTA\n\nDude don't even mess around with fox stink. That stuff will mess up your whole life.\n\nI had a friend who didn't even get a fox but started working 20 hour weeks with them at a zoo or something. She's meticulous about her hygiene. Noticed that she started to smell a little \"off\" after a couple weeks there, but nothing too bad. By the end of her first month it was **strong** on her, even fresh out of the shower. When I visited her after she'd worked there a couple months I noticed that **I** stunk afterwards just from being around her, and somehow the smell got into my house and I was getting whiffs of it for a week. Made me feel sick  🤢.\n\nI stopped hanging around her much until she got a new job and even then I could have sworn I still smelled it on her for a good long while.\n\nYou don't want that smell in your life.", "Offer a compromise like a dog or something.   \nApologise and think of ways to make it up to her. \n\nNTA She‘s gonna be an outcast. Hope she‘s not a furry.", "Info! Does your daughter have a plan of what she will do if for some reason, like going to college, she can no longer care for the fox? Has she found rescues and such in the area that would take a *pet* fox not a wild one? Has she looked up if there is any licensing requirements in your area and state for keeping a pet fox? Can she as a 16 year old get that license if it is required or would you as the over 18 year old have to? Any HOA (if you are in one) bylaws that may not allow her to do so? Vets in the area that would be willing to take care of one if the need were to arise?\n\nI think your concern of a smell is warranted but that you should have an honest discussion with her about your concerns as a whole. Sit her down and explain to her that when she is ready to leave home, whenever that is, she will be responsible for taking that fox with her and that by having a fox, that is considered a wild animal even if it’s been domesticated, it may limit her ability to find housing in a lot of area as well as put s limit on a lot of things she will be able to do. She won’t be able to find sitters for the animals if she wants to go on vacation, and if she does it will probably be expensive to the point of being prohibiting, as well as a host of other issues. This is $300-$400 she will have to make sure she has every month to care for these animals. They’re not like cats or dogs where if you fall on a hard time you can go to a shelter to get free food to tie you over.\n\n(But yes, YWBTA for having made a promise and then backing out of it, even though I do understand your concerns and I would have many of my own as well.)", "You're an asshole", "Why in the absolute fuck did you make a promise you had no intention of keeping?! \n\nNow you have to break a promise. YTA for making it in the first place. A wo/man is only as good as his/her word. \n\nHopefully you’ve at least learned a lesson.", "Hello? Rabies? Local fish and wildlife guidelines? NTA foxes are not pets they are wild and deserve a life in the forest. Not a crappy backyard pen.", "Yta. In all your research you didn’t find a single note on how much foxes smell?? I wonder what else you aren’t prepared for. They’re not easy pets. They’re my absolute favourite animal but no way would I want to live with one.", "NAH. Explain that the smell would be a problem for the entire family, and that it just won't work. I mean, that's sort of the point of her trying it out. She personally can stand the smell, but it would go out over the rest of the family as well, which actually isn't okay. It sucks, but it is what it is.\n\nI know everyone's saying \"you can't go back on a promise\" etc etc, but I feel there's actually another valuable life lesson here, which is that even when you made a deal, you are actually allowed to change it if it turns out that the deal won't work anymore. This is something everyone should know.", "[deleted]", "YWTBA.  Are you trying to teach her that promises don’t matter or that you can’t be trusted?", "Have you smelled foxes yourself? What's it like exactly?\n\nIs it just the urine that's so bad or what causes the smell?", "If I recall correctly it's pretty short, 3-4 years.", "> We found foxes produce a set of chemicals unknown in other animals. Some of these chemicals are also found in flowers or skunk sprays. One is so potent, a tiny leak was enough to force the evacuation of a building we were working in.\n\n[Fox scents are so potent they can force a building evacuation. Understanding them may save our wildlife](https://theconversation.com/fox-scents-are-so-potent-they-can-force-a-building-evacuation-understanding-them-may-save-our-wildlife-159337)", ">INFO: Do foxes really stink that bad? Seems like that's the number one concern, I know people say they stink but I wondered if it that's much worse than dogs.\n\nApparently their piss is so rank that before they'll let you adopt one, you have to put an open vial of fox urine in your house to prove you can put up with the smell and won't return the fox. (There was a [reddit](https://www.reddit.com/r/AmItheAsshole/comments/hznujc/aita_for_yelling_at_a_wildlife_sanctuary_owner/) thread about it a few years ago.)", "My inlaws have foxes on their property. Not pets, wild foxes as my inlaws have acerage. And you can smell them when they come within a 100 feet of the house. They smell really musky. They had a fox make a den about 40 feet from their back door, and the smell was sooooo bad. The urine smells even worse. My inlaws ended up calling a wildlife rescue because they couldn't deal with the smell. They couldn't open their windows, and the smell was wafting into the house.\n\nThe wildlife rescue came, and both workers complained that they were going to stink for days. You can shower, you can wash your clothes, but even according to them, the smell gets in your skin and after a while, it will stay and end up taking days to completely get rid of the smell. One of the rescue workers said if they get peed on by a fox they will stink for a week no matter how many times they shower and that they throw their clothes out when this happens because the smell will transfer to other clothes in the washer and dryer. \n\nOPs dtr will probably end up losing her job and bullied at school because of the stench that will stick to her. OP will more than likely end up not being able to open their windows on a nice day because of the smell. OP will definitely lose the ability to ever host anything in their backyard. And if OP lives in a subdivision, they will more than likely end up with their neighbors filing complaints. \n\nOP is the ah for making a promise they can't keep because they weren't well-informed, but OP will also be the ah when the neighbors complain of the smell from their yard. OP would also be an ah for letting their dtr go around stinking (however, that may be a lesson she has to learn on her own). OP would not be the ah for saving their dtr and neighbors from living in stench.", "Yes, the really smell that bad. My dog has been sprayed by a skunk and has rolled in fox urine. The fox smell was 100% worse than the skunk. I saw an insta by a woman with a cute pet fox and then I read her posts. The fox marks all over the house and it’s so stinky the smell permeates throughout the neighborhood.", "This isn’t true. There are multiple states in the USA where foxes are legal to own as pets. Terrible ideas, but not necessarily illegal.", "No, foxes are legal to own as pets where I live, you know the law's not the same everywhere right...?\n\nIt's not about legality, it's about wondering if it's a great idea or not.", "I suggest you look up more info about foxes. It isn't just a smell, it's a uniquely disgusting and persistent stench.", "You realize that the smell is so bad air can force evacuation of buildings right? XD", "No, no - OP is an AH for making a promise they never should have made. They are not the AH for not wanting a fox. That isn't the question at issue here.", "Then the correct answer is “no” instead of OP teaching their kid that they are a liar and won’t honor their word.  OP is an AH.", "It's not lack of bathing, foxes just smell like that 😅 \n\nBut yesss total YTA for promising something you didn't bother to research yourself, a lot of fox owners recommend getting to know the smell first and if you'd done any research yourself you'd know they stink. \n\nYour daughter deserves the fox 🤷‍♀️", "Fox are smelly. They are also wild animals.  He is the Ahole but two wrongs don't make a right.  The fox would be miserable as a pet.", "[removed]", "OP is TA, but there is still an excellent reason to say no. Just because he offered a stupid \"deal\" to his daughter does not mean that he has to get her a fox.\n\n\"Sorry daughter, I was an asshole to offer you that deal, but I just didn't think it through. I'm proud of your efforts but we can't get a pet fox for the following good reasons...\"", "The good reason to say no is that foxes are wild animals, not domesticated pets. \n\nOP is TA for making the promise in the first place, but the right thing to do now is to not follow through and try to find a way to explain and make it up to the daughter.", "[removed]", "OP, you should sit down and have a candid conversation with her about how foxes are not meant to be pets. Most people who take care of foxes do so with the intention of either rehabilitating foxes, or if they cannot be released to the wild, placing them in proper homes with people who can attend to their needs 24/7. A teenage girl who might be moving away for college soon is not one of them.", "I agree wholeheartedly with this.\n\nOP is YTA, but is just going to have to suck it up, admit fault, and say \"I'm sorry but the more I look into this, the more I realize that I made a mistake. You fulfilled the criteria that I set out, but upon further reflection, I cannot agree to getting a pet fox. I've learned that a fox is not an appropriate pet and we wouldn't be able to give it the kind of life it deserves.\"\n\nThen congratulate her on her work at the animal rescue, and try to find an appropriate way to make it up to her (maybe get a dog?). \n\nEdit. Maybe suggest that she talk to the folks at the animal rescue about having a fox for a pet? If it is a legitimate wildlife rescue organization, they should be able to vigorously dissuade her.", "OP should not get a fox for their daughter. OP is still TA", "OP can be an AH here and it can also be a bad idea to house a fox.", "He just assumed that his daughter would never actually do the things that he asked. He thought she would lose interest like a toddler. He should be proud of her laser-like focus on her objective... but she needs to learn that a fox is not an appropriate pet.", "I've heard that their pee smells even worse. OP should apologise to her for making a promise they can't keep though. Maybe OP can suggest that she get one when she's living on her own.", "Interesting. Is the smell as big of a concern as people are saying?", "There’s actually a decades old Russian breeding program that’s had some success in domesticating foxes, but it was difficult, took many generations, and still isn’t perfect. The domesticated foxes trend strongly toward dog-like characteristics. They also lost most of their musk smell.", "Why would she be an outcast? I would think most people would want to hang out with the girl with the cool exotic pet haha.", "Oh I did, in fact I was surprised how often it came up. I suppose I was naive because my thought was \"Well, if the absolute worst thing about them is that they're a bit stinky, then it must not be too horribly hard to care for them...\"\n\n(I'd been warned against having dogs or ferrets etc. in the past because \"they stink\" too and always found the concern to be overblown, so I figured this was no different).\n\nBut no...if what she's coming home smelling like after volunteering is normal fox stench, it's not just \"a bit smelly,\" it's heinous. Ugh. \n\nI figured if she wasn't actually coming into contact with their feces or urine it wouldn't be that bad, but that doesn't seem to matter for some reason?", "I was with you up until you said bringing it to friends houses and parties. This is unacceptable for a wild animal - it would be way too stressful for the animal and none of her friends will want it in their houses.", "urban foxes are really common where I live and you can always smell when they've been in the area overnight, unlike stray cats. part of the process of domesticating cats and dogs has been making them less unpleasant to human senses - wolves and big cats smell much stronger than their pet versions, for example.\n\nit's quite hard to describe the scent, just....really strong and wild. bearable outside and at a distance, wouldn't want it anywhere near my house.", "It's the urine. When people are planning on adopting foxes, the people go and spread fox urine around your house. If you can stand it for a week (rare), then you can move forward", "In the wild it is, in captivity they can live 10-14 years", "If that’s the case then keep your word and buy her a fox. You can’t expect her to keep her word if you as an adult won’t. She did her part.", "It’s a horrible idea. Even if it’s legal to own one where you live, you will have to find a specialized vet to manage its care. If you do find one, it’ll be twice as expensive as a normal vet. Also the fox will require a specialized diet as you can’t just feed it regular dog food. That’ll also be twice as expensive. Good luck finding a place to board the fox if she ever wants to travel. How about home owner’s insurance? Will it cover damage to property or injuries to people should that happen? Daughter is 2 years away from graduating high school. What are her plans after that? She’ll never be able to rent with a pet fox. People here have mentioned it, but it bears repeating, the fox will mark your home and the smell will permeate everything you own. People will be able to smell it from the street. I used to follow an Instagram with a pet fox. It was adorable but the owner was very realistic about her experience. 99 times out of 100, it’s  very bad idea.", "Which makes OP the AH since they didn't actually do their homework before making this promise.", "Yes the smell is very potent and lingers around for a good while", "I didn't see any of them first hand, but knowing how fastidious my wife is about keeping things neat and clean, I would say not. I know her daughter used to carry the last fox they had in the hood part of her hoody jacket. It would just climb up and crawl in there and poke it's head out over her shoulder!", "Not if she always *smells* like an exotic pet 😬", "Because she stinks. Foxes stink. Fox urine is really nasty.", "I think you're underestimating just how noxious the smell of fox is. It's so offputting that it will have a negative impact on her personal life and her ability to keep a job.", "She's gonna be the smelly kid.", "The smell of fox urine is terrible and will sink into everything.", "They spray urine all of their territory and they can't be housebroken. So it's impossible to avoid coming in contact with their urine. A dog can at least be trained to go outside.\n\nAnd foxes have glands on all four feet, on their face around their chin and jaw, sebaceous glands across their skin, and a spot near the base of their tail called the violet gland.", "Oh, good to know! Thanks!", "Some promises are stupid and shouldn't be honored. Including trying to keep a pet fox. They should not be kept as pets.", "That's dumb as fuck. If he promised her a lion, it shouldn't be like, \"welp, you promised her a lion, now you gotta get her a lion\".\n\nOr promising anything else equally dumb. I feel there's a Simpsons episode about this where Bart gets an elephant\n\nEdit - OP after promising daughter a lion\n\nhttps://www.reddit.com/r/PublicFreakout/comments/15a2r9x/woman_has_some_trouble_carrying_her_pet_cat/", "OP says that she read about the smell, but didn't realize how bad it actually was. She said that she compared it to past experiences of being worn away from dogs and ferrets because of the smell, and saw that if the smell is the worst thing about them then they can't be that hard to take care of.\n\nAs a certified animal person, that checks out to me. You truly are never prepared for just how awful wild animals smell until you encounter it yourself. You always think that you know what stink is, because pets can be stinky, but it's on another level.", "Foxes stink. Some people don't mind the smell (OPs daughter) some people do. Daughter isn't going to be outcast, just going to run with the crowd who think exotic pets are cool.", "Worse than cat pee even? I wonder what's so bad about it", "Interesting. What does it smell like exactly? It's just like cat pee but stronger, or what's so awful about the smell of fox?", "Is it the kind of thing that might lower the value of your home?", "What if you just keep them outside and always wear shoes/socks when in the yard?\n\nThere'd be no reason you ever have to get the urine/stench **on** you, right?", ">Or promising anything else equally dumb. I feel there's a Simpsons episode about this where Bart gets an elephant\n\nNot quite, he won the elephant as a prize without his parents' knowledge. More like when Homer bought Lisa a pony he couldn't afford imo", "Significantly worse than cat pee. And harder to get rid of.", "It's hard to describe. It's a more skunky,  musky, cat pee uncleaned for weeks smell? A local ecology site takes in surrendered exotics (like foxes), and while cute, they do stink.", "I don’t know but I do know it is hard to get rid of and foxes like to “mark” there territory so if you do remove the smell I’m guessing they will mark it again a few minutes later.", "It's like how the smell of smoke permeates everything.  You just have to be around it for the stink to get in your hair, clothes, and skin.", "That’s not how it works at all. Ask any zookeeper. Smell is a huge issue that absolutely affects the quality of life of animal keepers and their families.", "It's been so long I think I've blended those episodes together", "My only experience is with cat pee and when I worked for an apartment building, it would take us a week to get rid of the smell after someone with a cat moved out.", "Understandable. I only remember because I was never allowed to watch it as a kid, so my experience with the show has been more recent", "Ah I'm the opposite. I do have Disney tho (for the new Futurama exclusively) so I might just check out those episodes for nostalgia", "Lisa's Pony is great if you like Lisa episodes.\n\nAnd yeah crazy that Futuramas's back. I never quite got through it all, but I might some day", "Foxes are wild animals, not pets. The ones who are domesticated are usually only ones that cannot survive in the wild. \n\nThe smell can make your home and yard permanently stink. You would be decreasing your property value and have the smell around for a very long time.\n\nApologize for making a promise you can’t keep. Explain why, and maybe find a pet that would be a good compromise.  Ferrets (still smelly but manageable) are very smart like foxes. Certain dogs are very fox-like in looks and behaviors.", "YTA for breaking your promise- you should have done the research about foxes, how long they live, and how they reek BEFORE you made your promise, and not banked on your daughter essentialy failing.\n\nHOWEVER, I do think you're correct in backing out of the promise because this is just too much. Foxes are not pets.", "Do not get a pet fox! Here are some talking points to go over with your daughter:\n\n1. They are wild animals, not domesticated. This means they can be tamed by a dedicated owner, but will always remain wild and follow their instincts first and foremost. \n\n2. Their urine smells horrible, and they will urinate everywhere to mark out their territories, both outside and inside your home. It is very very difficult to remove the odor, and you will be cleaning constantly. \n\n3. They are destructive - They will treat apart furniture, woodwork, walls, carpets, clothing. \n\n4. They require a specialized diet that is expensive to maintain. \n\n5. Because they are wild animals, they require daily interaction for significant amounts of time to maintain any level of trust in humans. \n\n6. They are escape artists, and because of their instincts they absolutely will escape at times and can be very difficult to catch. \n\n7. If/when they escape, because they have not been raised in a natural wild environment, they will not survive for very long, and will end up being eaten by a larger animal, hit by a vehicle, or mauled or killed by any dog that happens to come across them. \n\n8. Because they are wild, they will kill small pets. \n\n9. Because they are wild, they are a very high bite risk. \n\n10. They require specialized and expensive veterinary care, and it is very difficult to find veterinarians that have the training to care for them, much less be willing to care for them. \n\n11. They are very vulnerable to many diseases, including distemper and rabies, even if vaccinated. \n\n12. They are nocturnal, and will be very loud at night, always. \n\n13. Your city, county, and/or state may have laws against owning them, with hefty penalties for owning one. \n\n14. They are extremely loud during the day. \n\n15. Even in areas where they are legal to own, neighbors may become very upset at knowing there is a wild animal being kept near them. \n\nTake it from a vet tech who has worked with wild animals for many years.", "Today I learnt about pet foxes. But as someone with a dog, I do know that the fox smell is horrific, as soon as mine rolls in their piss he is straight in the bath. \n\nProbably should've just said no in the first place, but too late now, so NTA for that smell alone.\n\nAlso to add, don't know where you are but there are a lot of rescue dogs from mainland Europe that have the look of foxes if it's about appearance and she wants a pet. They usually have a mix in them that includes podengo, which mine does, and he is regularly compared to a fox. Obviously, discuss it with her this time. Do not get her a dog she doesn't want, rescues have had hard enough lives without more abandonment.", "Op NAH, you would not be the AH for going back on your word. Fox pee stinks. For clarification, you and your daughter might want to look up videos and stories about school campuses applying 'frozen' fox pee to their trees to keep people from cutting down their trees and stealing them, just be ready to gag.\n\nTo save you the hassle, some college kids stole a tree off campus not knowing the campus hid frozen fox pee in it. They get it back to their apartment, only for the fox pee to melt and stink up the whole apartment. It got in the carpets, the furniture, their clothes... NOTHING was salvagable.\n\nETA: verdict", "YWNBTA\n\nI think it is not fun to go back on a promise because it makes you seem like an unreliable parent, so you will need to do a big mea culpa here.\n\nWhy I think you would be doing the right thing by going back on this promise:\n\n* Foxes are wild animals, NOT pets, and you should not keep them as pets even in a \"large\" enclosure.\n* Fox poop smells REVOLTING. Dogs love it, and the dogs I walk will roll around in fox shit if they find it and it leaves their fur smelling absolutely disgusting. You will be smelling this smell and whatever regular fox smell is, and so might your neighbours.\n* She may eventually get tired of the time and/or financial commitment at which point you have an enclosure in your back yard that needs to be disassembled and removed.\n* I think it's great she has a side job but I don't think she's doing the right thing by putting $200-300 a month towards something like this. She could be saving that money for when she goes off to college/moves out or towards courses/additional education/whatever towards something she wants to pursue as a career. Yes it is her money but as a parent I would talk to her about what kind of money she is planning to end up spending, looking at the long term: she is saying she is happy to commit to spending $3000 a year on this hobby. That's going to total to $6000 over the next two years, money she could put towards a car once she gets her license, or towards moving out, towards a long international holiday/backpacking trip, etc.\n* And has she thought of vet bills, and is there even a vet with experience in fox healthcare near? How is she going to get the fox there, does she drive and have her own vehicle or is she expecting to use the family vehicle to transport a sick fox (who may shit/piss all over the car)?\n* What are her plans for when she has graduated high school? Does she plan to keep living at home and if so, will she continue to have the time and money to care for her fox? If not, how will she find a good home for the fox?\n* You may have already found this page, but here is some good info to help decide that all of this is a bad idea: [https://metro.co.uk/2018/05/30/everything-youve-ever-wanted-to-know-about-keeping-a-pet-fox-7588206/](https://metro.co.uk/2018/05/30/everything-youve-ever-wanted-to-know-about-keeping-a-pet-fox-7588206/)\n\nSo, I would say that now that you have had more time to think and research, that you realise a fox isn't a pet, that it will be a costly hobby both in time and money, that it's not in the interest of a fox to be kept as a pet, and that you worry about the stench both for what will end up on her clothes that she will be taking into the home, and for the smell in the garden that may be smelled by neighbours. That you apologise for making a promise that you are now revisiting, and that it is your fault for not having told her you needed more time to investigate, but that the final decision is a no. That you will absolutely support her to continue volunteering at the wildlife rescue because you realise how much she loves it, but that she will not be allowed to keep a fox at the property.", "YTA. You’re not an asshole for not wanting her to get a fox for a pet. You *are* the asshole for going through this whole song and dance with her thinking she was gonna get a fox, when you clearly had no intention of letting her get one. It’s very clear that it has less to do with the smell she brings home, you’re just saying that to bolster your case. You were set in your mind already that she would give up and it would never happen anyways. You were wrong, and you lied to your daughter.", "ESH. Wild animals aren’t pets. How was this even open for discussion?", "YTA, you maneuvered yourself into this situation when you made a promise without doing your research first. And it's really not hard to research. I have no intention of ever owning a pet fox but just from watching a couple of animal rescue videos on YouTube I know it's a bad idea to keep a fox as a pet. They're not domestic animals. They stink, they're smart but destructive. People who work with rescue foxes basically dedicate their life to this, as if it is their job. Sometimes it is. Apart from all this, foxes just shouldn't be kept as pets. They're wild animals and no enclosure can ever provide the same level of enrichment as their natural habitat. If your daughter is obsessed with foxes, why can't she help out at the fox rescue? Why does she need to own a fox herself? This is just such a bad idea on so many levels. And now you have to come clean, sit her down and explain why you got her hopes up and now have to rescind your promise. This could have been avoided with minimal research beforehand.", "Ywbta. You made a promise based on certain conditions that have been met. You said that you've heard about the smell & thought it was blown out of proportion. That's on you.", "YTA for bluffing, YTA for not explaining to your daughter that wild animals are not pets. I did wildlife rescue in a former life and foxes absolutely suck as house pets.", "YWBTA. You underestimated your daughter, and that really sucks for you. Take this as a life learning lesson.", "YWBTA. \n\nYou promised something if she showed she could earn it. You're watching her put in the work she needs to do so she can earn her reward for the hard work she's done. \n\nThat being said, foxes are not pets. They are wild animals. They can never truly be tame. Also, depending on where you live, you might need a special permit and need inspections done. Foxes are a rabies vector species, so this is something to consider. Here in the US, some states require exotic pet permits and if you have a rabies vector species you cannot let it come in contact with the public or anyone other than the owner/handler for safety reasons. \n\nIf your daughter gets bit, are you both prepared to go through the rabies treatment? While it's not bad, that shit ain't fun, and it can cost a hell of a lot of money.", ">I sort of expected she'd be deterred by the reality of it but it doesn't seem like it.\n\nThis is emotional manipulation. YTA. If you have problems with it, then tell her those upfront. Don't play games that hurt her feelings.", "Foxes are not pets. In most states it’s illegal to even have one and in others you can only own one with a special license. They belong in the wild and anyone who ethically has a fox living in their home will tell you the reason they have it is because the fox was injured at a young age and could not survive in the wild. They typically have extensive expertise in wildlife rescue. @juniperfoxx is an example. \n\nFoxes are extremely vocal and make a ton of noise. Even friendly ones will bite *hard* enough to draw blood. They are territorial and cannot be trained not to pee on things they want to own (sometimes including people).\n\nIt was a bad idea from the jump to promise your daughter that she could have a Fox, not realizing the dangers, commitments, and legality of the matter. YWBTA for going back on your promise. But also YTA for not having the sense to say no in the first place.", "NTA - but only because keeping a wild animal as a pet is a BAD idea. Y t a for making the promise and your daughter is one for wanting one despite volunteering at a rescue. Probably the most eye opening thing that social media has shown me is how many crazy people there are around the world who think they can somehow domesticate a wild animal. Like the South African guy who had a pet hippo.", "I have a pet fox.... only joking, but the fox that lives in the cemetary next to my house will come right up to me and my dog when i take doggo for her night walk.. Foxy will take sausages from my hand and never nips or bites me or my dog... she is very tame but she still lives wild and can go wherever she wants... But the smell,... yeah, she does pong a bit and i would never dream of having Foxy as a \"pet\".. she is a wild (albeit tame) animal and i am content to go visit her a couple times a week.", "FOXES ARE NOT PETS", "THEY ARENT PETS THEY ARE WILD ANIMALS!!!!\n\nNow that this is out of the way..\nYTA\ndon’t promise a wild animal to a child? Wtf. The only reason rescues exist is to provide help for foxes in need. Not to have cute little pets for fun! Get her a pomeranian. They’re fox like enough.\nThis is coming from the person who is also in love with foxes(special interest autistic)and KNOWS they are not meant to be pets. \nI rescued a pom because they are(look like)mini foxes! \nJust.. don’t do it!!", "STOP TRYING TO HIME WILD ANIMALS.", "YTA for not being honest to her. Foxes are not pets, especially for anyone not already out of the house.\nMy occupation before being a SAHM was wildlife education. I have directly told dozens of kids and teens, foxes are one of the worst pets to get. They are musky, destructive, and do not thrive in a small enclosure in the backyard. And if they plan to pursue college it's very irresponsible to leave your pet fox with family.\n\nIf you love her, you'd be honest and tell her to pursue this dream after she's out of college. Your home can't house the fox while she's still growing up. You set her up though, so expect this to be a major betrayal for her.", "YTA for bluffing in the first place.", "YTA from the start. A fox is not a pet.", "Your best bet would be to have her talk to the workers at the wildlife rescue what they think about making a wild animal a pet. Also remind her she'll either have to find a new home for it or let it go before she goes to college. Of course pets need daily care so she can't make any weekend plans with her friends.", "NTA for breaking the promise if you explain that with further research and consideration, and her blatant disregard for very real concerns, you've realized that you agreed to a lot more than you were willing to sign onto with a pet fox. Otherwise, E S H here for this whole scenario. Yes, even your daughter. A fox is not a pet. She's going off TikTok and social media which only shows the cute stuff and the positives for likes. She's not getting to see the actual extent of the damage a fox can and will do if kept for a pet. She's dismissing your very real concerns and despite getting straight As, she isn't mature or smart enough yet to understand that what she sees and does volunteering at a rescue 1 day a week for 3 weeks is an entirely different world from keeping a fox for a pet.\n\nThe former, the goal is for the foxes to be rehabilitated and re-released back into the wild more often than not. Does your daughter like the idea of zoos and animals being kept in  enclosures that have limited space? If the answer is yes, you're both bigger AHs for wanting to put a fox in a backyard enclosure. If the answer is no, you're still both big AHs for not seeing animals as living beings that have needs but as accessories.", "YWBTA, at least to her.", "Yta for promising her she could have a wild animal as a pet without researching it at all. Is it even legal to have a fox as a pet where you live?", "NTA with caveats \nFoxes smell AWFUL.They are not domesticated animals they are not pets. People who want them for pets dont realize this\n\nYou are not wrong for not allowing it but you are wrong for even entertaining the idea at all and underestimating your daughter .\nApologize tell her foxes aren't pets and find something reasonable to reward her with", "YTA for promising in the first place. I don’t think the right choice is to get the fox. This fox will quickly become your fox as she looks toward college and setting out on her own. \n\nBut you are totally the asshole for promising her something on conditions and just doubting she’d follow through! You should have thought this through prior to committing. \n\nThese NTA comments are totally wrong IMO. Don’t promise things you can’t or won’t deliver to your kid, especially when the whole thing could have been avoided with a little foresight.", "ESH simply because foxes are not meant to be pets, *and* you went back on your promise. That said, can she volunteer more? \"Adopt\" a fox there and call it her own? There's likely a half-decent compromise here.", "YTA for making a promise you didn't intend to keep.\n\nAnd a fox shouldn't ba a pet (exceptions be made for rescued younglings that couldn't make it back in the wild, but they should stay in a refuge).\n\nYou should rescind your promise because it makes no sense to have a pet fox, and explain it to your daughter, and you should say that you are sorry that you lied about the possibility of having a pet fox.\n\nAnd you should try to be better next time.", "YTA for agreeing to a pet fox in the first place. Unless a fox where you live is different from a fox where I live, they are not meant to live in caged enclosures. They are wild animals and not there to be some pet to a pampered teenager.", "NTA. I know lots of people on the internet post these cute videos of foxes but the reality is they are NOT meant to be pets. Yes there are rescue foxes that still need homes and develop a sweet personality, but they were not raised for the purposes of being a pet. Like other “fad” pets like raccoons, bears, monkeys, there’s lots that go wrong while caring for them that people don’t see outside of TikTok. They are wild animals and should not be taken in as pets just because you think they’re cute. \n\nPlus, what’s going to happen in 2 years when she moves away to college or gets her own apartment and can’t take the fox with her? You might have been a little bit of a jerk to make the promise without knowing much about them, but at the end of the day it’s irresponsible to get an exotic pet just because you see cute videos of them online.", "YTA for agreeing in the first place. FOXES ARE NOT PETS. People just need to stop with this. We’ve already domesticated dogs and cats etc for our own selfish needs, leave the rest of the animal kingdom alone. I guarantee she only wants one for the internet likes she’ll get and has absolutely no concern for what is best for the fox which is NOT TO BE KEPT AS A FUCKING PET!!!\n\nYou should also ask her what the plan is for when she goes off to university or gets a full time job in 2 years. Who will be taking care of it then? You know it’s going to be you as she’ll be too busy with work/study/social life. Teenagers don’t generally think about the long term consequences of such a commitment so it’s your job to do that, even if it makes you the bad guy for now.", "YTA\n\nNot for not getting her a fox. Foxes are wild animals and should not be pets. But because you basically wanted to play chicken with your daughter rather than just say no, and now that that hasn't worked you're looking for a way to back out without being the bad guy.\n\nDon't get her a fox and explain that you are sorry for misleading her, but foxes are not pets and she can't get one.", "Man, my dog rolled in fox poo once, sweet lord of mercy the smell was enough to peel tiles! Poor dog wanted to jump up to me, no way boy not until you’ve been shampooed!\n\nSoft YTA but also not a major one, but don’t make those promises!", "YWBTA  ***but*** you will be making the right decision by backing out. \n\nSince you are the parent of a minor, *you* need to be prepared to take full responsibility of the animal, even if its \"hers\". When she heads off to do life at 18, there is a negative chance she will be able to accommodate caring for the fox in her early adult life. You will have to give her a firm \"no\" on this at some point, but try talking to her fist about long term care plans, expenses etc. Let her know that *you* will not be helping with the animal when she wants to go on vacation/sleep overs with friends, anything that will take her out of town. Any animal runs the risk of emergency vet visits as well. A reserve fund of a few thousand would be important for her to have as well....She should come to her senses pretty quickly. \n\nYou might talk to her about getting certified as a wildlife rehabber instead, which the rescue can help her with. This will give her an outlet to bring animals into the home to care for but without the long term nuances of having a non-domestic animal as a pet. \n\nYou can handle this with poise. Tell her you're sorry you lied by promising this, that YOU didn't understand she was so serious about it, and try to find an alternative that's more manageable.", "How is it possible you researched for a day and didn’t read about the smell?  I’ve only randomly read about foxes on Reddit and even I know they’re insanely stinky.", "YWBTA\n\nYou told she could do something if she put in the work, and she is doing so, and now are going to change your mind with out any real reason? The school work being the biggest concern, but if she is getting straight As already, can't really have an concern at the moment, like she said. If she she does foster a fox more than likely she would not be voluntering so much at the resuce place, since she would have one to take care of at home.\n\nAs for the smell, yeah, that is a concern, but have you even tried to find a solution about it? Do a bit more research, or tell your daughter to speak to the resuce place and see if they have any knowledge about it. Is it from foxes specifically, and they have that kind of smell, or is the the resuce place where the smell is coming from. A combonation of different animals, or just a large amount of them.\n\nGoing back on your work now would teach your daughter that your word doesn't mean much, nor does the hard work she put in. Why should she put in effort for something that will never be rewarded? Why should she believe anything you say you will do if it doesn't suit you.\n\nDefenitily raise your concerns about the smell and make sure they are addressed and you daughter has a plan to deal with it, but don't go back on your word.\n\n&#x200B;\n\nETA: I was under the impression that she was looking to foster a fox for rehab, not get a pet.", "YTA if you set tasks and she completed each one. \n\nI have two concerns, I know the videos she's probably watching- Finnigan right- Foxes are social animals so only one would be cruel to it but my big concern and the one to put up to your daughter is she is 16. What happens when she goes off to college? she will expect you to look after the fox while she's away most of the year?", "YTA for breaking the promise maybe try a compromise.", "YTA for breaking the promise. But not one for not wanting to live with a \"pet\" fox. They are not pets", "YTA for going back on your word after your daughter took seriously your requests and requirements, but as others have said, there are a lot of practicalities in adopting a fox that are not ideal. Perhaps you could both compromise and foster/sponsor a fox at the wildlife rescue center? That way you're building a bridge towards her interests, and supporting them, but also not letting a fox run rampant in your house", "YTA for making the deal in the first place.  You had no intention to honor it.  \n\nThat being said you shouldn’t get the Fox.  There wild animals, there not pets.  It will be a massive amount of work and she will be leaving the house soon.  She will need to carry that Fox enclosure wherever she goes, or it’s a rehabilitation pet meaning it’s temporary which I don’t think is what she has in mine. Also if it’s one that can’t be released, it’s a massive never ending commitment.\n\nDon’t let her get the Fox, bring up the points I made, but own up that you messed up.  Maybe get another actual pet, some type of dog?", "YTA for making a promise you never intended to keep.", "YTA but necessary. When she gets a place of her own, she can. Sounds like an awful idea", "YTA. Yeah foxes are cute and all,  but the few people I know who have interacted with “tame” foxes will be the first to tell you how bad they smell. \n\nBut unfortunately you made a deal that I think we can all agree was stupid. She fully delivered on her end. Now you have a dilemma. I’m really, really against breaking deals, so you really have to find a way to overcompensate her for this.", "Nta. Volunteering at a wildlife rescue is a good experience but no good rescue is going to let someone adopt a fox. Foxes are not domesticated and are not pets (that Russian study excepted). It is cruel to the fox to treat them as if they were.\n\nAnd three days of volunteering as a teenager is not enough experience to know how to meet the fox's needs", "I know they're cute, but they are wild animals and belong in the wild. She can enjoy them while at work!", "NTA. You thought it was a good idea, then you realised you made a mistake. It really is a terrible idea and as the adult it is up to you to communicate this to your daughter. A fox is not a pet. They are not domesticated. Keeping them as pets is cruel and a rescue would not allow it. \n\nExplain that to your daughter and if she doesn’t get it, simply say it’s not happening anyway.", "Should not have made the promise, but NTA for reneging after new information makes performance impracticable. However, she did perform on her end in reliance, so you should compensate her some other way. Talk it over.", "I don't know that I would necessarily call you an asshole per se, but you're definitely stuck somewhere between a crack and a gooch place", "Yes, YTA, or rather you would be one, if you went through with this plan. I'd say you already are one, for entertaining the idea at all.\n\nIf you've done your research, you should know that foxes are NOT domesticated animals. They do not behave like cats or dogs, they have oddities, aggressions, and behaviors that are VERY not compatible with human life. Foxes need more than an enclosure, and people who do rear them responsibly always RELEASE them before adulthood so they have a chance at survival. Can your daughter do that? Raise a kit until semi maturity and then let it go? Adult foxes are a nightmare to keep, can be aggressive, and are not AT ALL like what you see from the cutesy youtube videos, most of which use specially bred domesticated foxes.\n\nMost domesticated foxes can trace their lineage to the Russian fox experiments, thousands of foxes raised with the sole purpose of discovering how domestication works, and the effects it has on the species. Amazingly, they were very successful. And those foxes, generations later, are still sold and bred, and are very difficult to keep. And I doubt that's the kind of fox your daughter would be able to get her hands on.\n\nLook, foxes are wild animals. They aren't really fit for captive life. They are not pets. They either belong at a zoo/preserve, with TONS of space, or in the wild. Support your daughter working at the shelter. Do NOT bring the shelter to YOU.", "Okay this is a sucky situation. But- I’d say tell her you can’t have a fox at home due to the needs of the animal and the smell. Plus she’s leaving or moving out soon and you do not want it. Most young adults can’t buy a home right at 18 and communal living or renting a room is not going to allow a fox. It sucks, but it’s reality. \n\nI’d offer a compromise, for example, by saying you’ll support her continuing to volunteer and offer to drive her or pay for her gas to get there and back. Then, she gets to pick a more suitable pet that you will care for, including when she’s at college or whatever, until she can take the animal as an independent adult. Maybe even cover vet bills until she has FTE. \n\nYou don’t want to ruin your relationship so I think a firm No would probably crush her. Offer a compromise and work it through. So she knows it’s not the pet aspect but choice of animal. Then follow through or she will never trust you again. ESH.", "YTA actually for saying she could get one in the first place. They are wild animals and no one should have them as pets.", "*ESH.  FOXES.  ARE.  NOT.  PETS.*", "FOXES ARE NOT PETS!!!! \n\neven if you think they are tame they are still wild animals. the volunteer people will be able to tell your kid that.", "INFO: Is it completely legal to house a fox where you live? Does it require a permit? I.e. while my state allows it with a permit (18+, so your daughter is not yet old enough to secure a permit), my local government forbids fox ownership (so she wouldn't be able to house the fox anyway). What kind of research did you actually do aside from basic care/needs/cost?\n\nYTA for how you're going about this. You jumped too soon on okaying it and your jumping too soon in the other direction.\n\nI'm not going to even touch the moral implications of wild fox ownership.", "YTA for the promise, but you know I feel for you I would not have taken this seriously as well. I mean who could have known she makes it her life’s mission to get a fucking fox.\n\nNow to possible solutions: \n - Is it even legal to own a fox where you live? \n - Can you find a way to have the enclosure be not on your property? Or at least as far away as possible?\n - Or just you know, apologise and tell her why it’s not possible.", "YTA....but you can fix this if you **own up to it**.\n\n\"Sweetie, I was a stupid idiot.  I had no idea what was involved.  I told YOU to do your homework on keeping one, but I should have done the homework as well.  i was being lazy.  This should have been a concerted effect involveing BOTH of us.   But now that I see the troubles it would cause, I just cannot allow one in the home.  I'm very sorry for breaking my promise.  I hope you forgive me.\n\nIn the meantime, what I would like to do is do more research, while you do your own.  I assume you'll want to go to school for something like Nature and Wildlife studies?  I'm too much of a dope to care for a fox while you are there.  But I want you to continue your dream.  Keep working at the rescue for now.  Keep learning, and we'll see how thigns look down the road, ok?\"", "YTA for promising this initially, but please,\nyou have to break this promise — **don’t let her get a fox.** They cannot be domesticated. Please look at juniperfoxx on Instagram, it shows the reality of living with a fox, she runs a rescue and does not advocate for people owning them. \n\nWe have to stop this obsession that social media has created with exotic pets. Sugar gliders, capybaras, toucans, foxes — they’re beautiful animals, we don’t need to own them all. \n\nI have two bunnies as pets (animals that can be domesticated) and despite this which should make them easier to care for, I’m frequently filled with horror at how people treat them on social media. They’re not good pets for kids, they’re fragile, they’re not dolls. Most people don’t feed them correctly and they’re one of the most commonly dumped animal. Social media creates instant wants with animals without ANY of the long term commitments. It’s a disposable culture and the animals suffer. \n\nPlease don’t take part in this by adopting a wild animal that will be nightmare to house merely by doing what is in its nature to do.", "YWBTA, yes, but you should still back out. It's a crap situation all around that you put yourself in, as I know you recognize, so it's time to be the adult and say \"honey, I really screwed up. I should never have said that you could get one, it is my fault and I was not thinking this through.\" Own the mistake and make it clear that you screwed up here, best thing you can do to regain her trust.\n\nThen outline your reasons why. The smell is one, it is truly awful and anyone who visits your house will comment. Another is the fact that she's a teenager and will probably get bored of it, or move out to a place that doesn't allow foxes and you will be stuck looking after them, is another.", "YTA for making a promise you never intended to keep. You laid out rules for what your daughter had to do and she started doing them. Now no matter how you go about it, telling her no is going to feel like an absolute rug pull out from under her and she has every right to be pissed at you.\n\nNobody is disagreeing with you that a fox would be a bad pet, but why would you enter an agreement like this without looking it up thoroughly first?\n\nCongrats on putting yourself in this situation.", "100%. YTA and YWBTA\n\nThe fact that you still allow her to continue volunteering at the shelter KNOWING it’s for nothing makes you an AH as well", "YTA. All of your concerns are valid points, but you promised your daughter she would be allowed to have a pet fox after she volunteered and built a enclosure. She is doing that now and expects a pet fox.\n\nIs it even legal to have a fox pet where you live? I don't think you should get the fox, but know this will make you an AH, since you promised. Explain why you don't want to have a foc and try to figure out if there is something else she wants instead.", "YTA maybe get her a dog or cat or something like that foxes are wild animals and are mot to be domesticated", "YTA for a few reasons.\n\nANY situation where “a person asked me if we can get X (a baby, a fox, a car), and I said yes thinking they’d forget/drop it, oh shit now they called my bluff” makes you an asshole. Period. You lied because you didn’t want to be the bad guy, you wanted her to be the one to blame bc you didn’t believe she wanted bad enough. \n\nHowever, you should also NOT LET HER GET THIS FOX. Foxes aren’t pets. Tons of Instagram accounts have foxes or raccoons or other non-domesticated animals and they either \n\nA.) have professional experience from their day job \n\nB.) are filming AT A RESCUE \n\nor \n\nC.) they aren’t qualified to care for this animal, can’t take it to a vet anywhere because they’re not supposed to have it, and borderline abuse it out of ignorance. A lot of times the animal ends up tearing up the house out of boredom and yes, they have a distinct wild odor. \n\nA lot of Instagram “pet influencers” take shit care of their animals and just film the good parts for clout. \n\nRegardless of if she WANTS a fox, she really should not be getting them.\n\nSo I propose a potential compromise. \n\nShe already is volunteering at a rescue, so I’d suggest you continue to encourage her to do that. Yes, she comes home stinking—you may want to designate “fox clothes” and have a bin outside to keep them in.  you let her keep volunteering her time and work around the stink to keep it outside.\n\nNow, that enclosure outdoors? Try finding foxlike animals. Foxes are kind of catlike and kind of doglike. I don’t normally suggest this, but there’s a breed of cat called a Bengal cat. It’s larger than your average house cat and very active, and would enjoy an outdoor play area to blow off steam. They’re big personalities and are exotic as far as cats go (they’re a mix between a wild and domestic cat). Since they’re domesticated, they don’t have the same smell as something like a fox. \n\nJust like a fox, it would be a high-energy, exotic animal. However, it’s more domesticated.", "Stoppppp trying to adopt non domesticated animals and make them pets. They are wild and not the same. \n\nAll AHs here except the fox.", "YTA", "YWNBTA. It's called you changed your mind when you got new information.  I am sure you didn't know they smell when you first considered it and then the potiental academic ramifications of having to care for this pet (wild animal), study, and work.  You made a bad call at first but you realized it and changed your mind.  She can still see the fox at the center while volunteering", "when she asked you if she can have a fox. \n\nYOU DID A WHOLE DAY ON RESEARCH ON FOX PET AND TOLD HER SHE CAN. \n\nDID YOU REALLY DO THE RESEARCH CAUSE NOW THAT IT'S TIME TO GET ONE YOU'RE TRYING TO MANIPULATE HER AND GOING BACK ON YOUR WORDS. HMm... YTA.\n\nYou're a manipulative gaslighting person. Why would you promised something you clearly didn't meant to keep. I hate parents like these. How tf you're a parent when you are this immature UNREALIABLE.", "When I was in high school, someone had a pet fox. Within 6 months, someone broke into the enclosure and stole it.", "NTA and that fox musk will never go away. It will get on her bedding, in her car, in your car, then on you at your workplace. She will smell constantly and it can’t really be washed out. Yes SHE will get used to it, but you won’t and her friends won’t. She eventually won’t even be able to get groceries or a partner because of the smell. Pease don’t do this. Foxes belong in the wild not as pets.", "Wild animals are not pets, but getting someone’s hopes up, especially our own child’s, kind sucks, man.", "16 years old?  Pffttttt.  Teenagers don't have times to take care of pets while they are out for fun and school.  If they want a pet so bad, they should get a job to pay their supplies and insurance.  Like I said, they want to hang out with friends and all that fun.  \n\nLearn to say NO.  Never say promises because it's stupid to think oneself can get easily without thinking twice.", "YTA for making a ridiculous promise that you couldn’t guarantee you’d be able to keep, not for going back on it when you realized this was a terrible idea. Live and learn. We all have to eat our own bullshit sometimes. I know I have.", "NTA…she is 16.  Has she thought about what will happen to said fox when graduates?  Goes to college?  Have you told her you will not be taking care of said fox?  Does the sanctuary even recommend someone having a pet fox?  Has she talked to them about why she was there in the first place?", "YTA, but you’re not wrong? Getting a pet fox is an awful idea for all the reasons the other comments have already mentioned. I would also add, your daughter is 16, I assume she is planning on graduating  and going to college sometime in the next 2-3 years? Who is taking care of her pet fox then? You can’t have pets in dorms. Even if her plan isn’t college (which is fine) she probably wants to move out and be an adult at some point? Again, most landlords make having a dog or cat a pain in the ass (higher deposits, additional rent, not allowing them at all, etc) so what’s her plan in a couple of years? Everything else aside, the hard reality is, your daughter is coming up on a transitory period of her life. It’s not really a good idea for her to be getting any kind of pet, let alone something as high maintenance and labor intensive as a fox.", "Perhaps you should show her the youtubes on why foxes are not really good pets..they do smell and they are nocturnal.  But you are the ah for not doing your research before making the promise.", "So a while back I read a post on Reddit about a person who wanted to adopt a fox from a sanctuary. Over the course of a couple of months he was asked to follow a set of instructions that related to caring for a fox; can't remember the exact things he/she had to do, stuff like dealing with smaller animal carcasses to feed fox, building enclosure, fox proofing etc. Finally they had to have an open jar of fox urine in the home for 3 days to see if they could tolerate the smell. The fox was not adopted.\n\n\nI think you need to consider the entire household here. Can anyone other than your daughter tolerate the smell? If not then it has to be a no. It's not resonable to make an entire household live with the stench a fox produces. She can live out her dream when she is an adult in her own property.", "ESH-foxes are not pets!", "YTA\n\nFoxes are not really good pets. The people who have exotic pets are AHs IMO. It is usually not a good decision for anyone involved. You said you would get your daughter a fox if she did some things to earn it and now she is doing them and you will be the AH if you allow her to get the fox (which will be your fox unless your daughter lives at home for a while) or if you go back on your word. So there is no winning this one unfortunately. you are the AH in both scenarios.\n\nI suggest going back on your word as at least then you won't have a wild animal making your lives harder.\n\nWhy did you make that promise and why does she still think it is a good idea? I guess that is water under the bridge.", "Foxes are not pets.\n\nNo to pet foxes.\n\nYou made a mistake when you gave her the promise, but don't compound it with a second mistake.", "NTA.  Foxes stink to high hell and YWBTA to your family and your neighbors if you allowed that in your yard.  It sucks to break a promise to your daughter, but circumstances change with new information.  Now you know how disruptive it would be to keep such an animal near your house, so no foxes as pets.\n\nBut do own up to the fact that you made a mistake in promising your daughter she could have a fox, acknowledge that her hurt feelings are valid, and find a way to legitimately make it up to her.", "NTA.  You didn't know about the biochemical warfare that Foxes are capable of.  Your daughter can get a fox when she has her own place to stink up.", "YWBTA, and you HAVE to be the asshole. Like you're just going to have to be the bad guy here, because you should have never made this promise.", "YTA but you should let her get a more reasonable pet.", "Are you really considering that you would not be an asshole! She kept up her part of the deal once that enclosure is built there better be a fox or she’s going to resent you. The only way out of this might be finding an animal you both would like more.", "YTA, but it is what it is and now you need to fix it. Do research. Tons of research. Wild animals cannot be pets in many areas. Find out why. How does it affect their lifespan? What behaviors do foxes in captivity show that wild foxes do not?  What's the minimum recommended enclosure space for a fox in a zoo? Why? Tell your daughter that all this information has been a bit overwhelming, and since she works at a wildlife facility, she needs to get information from them; what do they think about the information you've found, versus what your daughter has found? No wildlife rehab is going to support the idea of getting a pet fox.  I've done some volunteer work for a big cat rescue, and misguided ideas of what makes a good pet are how they end up with their animals.", "YTA, but only because you didn’t do enough research before telling her she could get one. Foxes aren’t domestic animals and aren’t meant to be pets, they haven’t been selectively bred for the traits that make dogs and cats domesticated. Do not wait to tell your daughter she shouldn’t get a fox. I will say that, as she has proven responsibility and dedication to animal care, you and her could talk about getting a dog or cat? (Or really any other domestic animal, dog and cat just felt closer to fox)", "While I think you should 100% break your promise you’re still going to be YTA for it. \n\nYou should never have made this promise to begin with. It’s a wild animal. Historically they don’t do well in captivity. \n\nDid you even check your state and city ordinances to even see if having a fox was legal?", "YTA. Your kid is a kid and highly motivated, and you agreed to something without understanding what you were agreeing to. The very first thing that shows up when you google \"are foxes good pets\" is an article stating clearly that they are not good house pets. \n\nNow I am not saying that you should have said yes and stuck with it. You definitely should not get a fox for a pet, I am with you 100% on that. You should have said you'd look into it and then do your research before committing so you could be an actual parent. Now your kid is upset and you are the kind of parent who agrees to something to get your kid off your case and then changes your tune when it comes time to deliver", "This whole situation is a shit show. Domestic foxes can live for 14 years. What's she going to do with the fox when she goes to college? Is she going to live with you until she can afford a place with a yard large enough for the fox? Will she even be able to afford such a place in this economy? What happens to the fox if she moves out to a place that can't accommodate it?\n\nAny pet your minor child gets while living with you, you have to be prepared to remain *your* pet. If you aren't willing to care for that pet in your kid's absence, you don't get it.\n\nDomestic foxes, despite the implication, aren't really domesticated. They're better around people than wild foxes, but they aren't truly adapted to thriving in captivity. They don't seek out human companionship like most domesticated animals. Just like any exotic pet, they're terrible pets.\n\nDo you even have a vet in your area that handles exotics? Do you know how much they charge? Who is going to pay for those services?\n\nYour promise was made in bad faith, and YTA for that already.\n\nThe fact of the matter is, neither you nor your daughter thought about getting this animal long term, and it would be unfair to the animal to adopt it under those pretenses.\n\nYWBTA no matter what, because you made a promise that would be irresponsible to keep.\n\nSit your daughter down, apologize and discuss the *long term* care for any pet fox she brings home and explain that it's unfeasible for her to have this pet at her current stage of life. Once she is able to meet the requirements for the fox to live out its life in her care and to thrive, then she can reconsider getting one.\n\nAnd you, stop making promises to your nearly adult child in bad faith. If you had communicated exactly why her getting a fox *could not happen* now, you wouldn't be in this situation where you need to break your promises. Now your daughter knows your word means nothing to her.", "YWBTA for breaking your promise. Foxes are known for their smell and I'm shocked in any research you didn't learn how bad it would be.  I love foxes but you shouldn't get one in generally. They have been difficult to domesticate and humans have a lot of work to do if we want them to be proper pets one day.\n\nThat being said you made a promise. She spent a day a week volunteering 30 mins away. So she's wasted time, money, energy, and hope on this. If you don't give her a fox you will have to make sure you do a lot to make up for it.", "YTA for promising her that in the first place. She’s 16, what happens in a couple of years when she goes to college or moves out? Does the Fox go back to rescue? And yes, foxes smell. You’re the adult, you should have done research before promising her that.", "YTA a fox is not a pet", "Sometimes you have to tell your child I made a mistake you can’t have a fox. This is a wild animal it is not a pet. I am not going to care for it while you are in college and you are not postponing your life to live with a fox. You will be stuck with the fox when something new comes along. Let her rage and be angry but own up to your mistake and say no. It is still your property and expenses.  So be the adult and parent your child needs and say no.", "YTA for making this promise to begin with. Even just a little research would have taught you that foxes have a very, shall we say, unique odor. Plus your kid is two years off of college, and then trying to make it on her own which will be very difficult if she's also trying to house a fox. \n\nYou can back out now, but you need to fully admit you screwed up.", "YTA. Don’t make promises you don’t intended to fill.", "YTA for agreeing to it in the first place when you had no intention of following through", "Tough one. YTA if you back out but at the same time I think the logical, rational, adult thing to do is back out. You probably *need* to be “the asshole” here unfortunately. The mistake was promising this in the first place without thinking it through or researching enough, so just own up to that and find other ways she can cultivate this desire to care for foxes or other animals. Actually getting the fox is likely a bigger mistake down the line. \n\nBeyond the smell, it’s not wise to take this on at 16. Since she’s 16, she’s not going to understand that. But you as an adult, should. What happens when she goes to college or wants to travel? What happens when she’s in her early 20s and moves into an apartment (no way foxes are allowed)? She’s too young to make this kind of commitment IMO and it’ll ultimately fall to you or others at some point to care for or pay for the fox, which also isn’t fair to the fox. She should volunteer and continue to work with foxes and if she truly loves them that much she can get one when she’s settled into her own house (and by get one I mean rescue one who needs it, bc they’re not pets).", "A pet FOX? Did I read that correctly? Is anybody involved in this story a trained and experienced wild animal vet? There’s a reason why a fox is not considered a domesticated animal. What’s next, a wolf? Or maybe a lion like those GOOFY people in the arabian peninsula. Just adopt a dog, Jesus", "YTA why promise a wild animal, they're not pets", "YWBTA", "In addition to what others have said, one day a week is insufficient to evaluate her potential level of care.", "Not sure this is as strong as A. Foxes do smell, that is why they are not house pets. Yes, you should not back out because you made a promise, and she did the work. But you may want to get a signed contract to make sure she doesn't stop caring for the fox. Or leave it with you for you to take care of when she leaves. (Not the same as \"Can you pinch hit while I'm away overnight once in a while?\")", "You made a bad decision by promising something you won't deliver. The sooner you tell her, the better. The smell is a deal breaker for most people. Foxes are not meant to be pets. If she respects them, she needs to accept that. She'll be rightfully pissed, but it is what it is. YTA, and I hope you are prepared to let her voice her anger and disappointment.", "Yes YWBTA. She has proven her interest and dedication. Yes, it will be work, but all pets are work and they enrich our lives. As far as the smell - buy her some overalls or a smock she can put on when doing fox things. That way it’ll keep the smell on her clothes to a minimum. \n\nThe problem really is that you never intended to follow through in the first place, and that sucks. If you go back on your promise, you are teaching your daughter she can’t trust you. She will not forget this and she will resent you. It will also stick with her and make her feel bad about telling you about her interests and asking for support. This seems like one decision to you, but it will affect your relationship in so many ways for years to come.", "Erm… foxes aren’t pets. YTA as you should have said “NO!” And she is going to university in 3 years and so it would be your captive fox and not hers.", "YTA. You made a promise to your child that you're not willing to keep. You suck.\n\nThat said, getting a fox is probably not the play here, but you owe your daughter something BIG to make up for it.", "&#x200B;\n\nNo, you shouldn't have just hoped she'd be turned off by all the work and conditions - that's bullshit to do.  Just take a stand.", "Gentle YTA, but I think you know that already OP. You shouldn’t have made a  promise to your daughter that you didn’t intend to keep, and honestly your daughter sounds like a really focussed, capable person who deserves a bit better than that. It’s a bad idea to get a fox though; they aren’t domesticated and don’t make happy pets (as I understand; it’s illegal to keep them as pets in my country for welfare reasons). You need to apologise to your daughter, truthfully explain your reasons and do what you can to make it right.", "YTA for making a promise you didn't intend to keep.  You're a giant asshole for this.  Now she knows your word is absolutely worthless and she can't trust you.", "NTA, having a fox, they're not a pet. They need a lot of exercise, they absolutely stink and just, they're a wild animal. Find a different pet for her", "Foxes are not pets. YTA.", "My concern would be what will happen if your daughter goes away to school in a couple of years. Or when she moves into an apartment? You would be left with the responsibility of the fox. Foxes in captivity can live for 14 years. \n\nI would simply tell her that you were unaware of the smell and you cannot put up with that in your home. Sorry, kiddo. \n\nYour daughter should continue to work at the rescue center to indulge in her love of foxes.", "Light ESH. Tell your daughter to check out SaveAFox Rescue.", "YTA for saying yes in the first place. Foxes are not pets", "YTA because you assumed she would give up and now you have to go back on your promise.\n\nFoxes are not good pets. They're not dogs, though they may act like it at times. Think of it as more like a feral cat. As to the smell, it will not go away. You and her and everyone else is going to smell like a fox. As to the environment, an enclosure isn't good enough. The fox needs room to run around and dig, etc. Y'all don't know what you're getting into and I would advise against it.", "YTA. Getting a fox is a very bad idea and you should have clearly told her it was never going to happen. You're not going back on your promise because you never intended to fulfill it. It was a lie from the beginning.", "ESH. You shouldn’t have promised her you would get her a pet fox but she should also understand that foxes are wild animals and not pets.", "YTA\n\nFYI foxes are related to skunks.", "You should've done some research before you said anything. Foxes ALWAYS stink. They will never not have an intense odor. And they make a lot of noise. \n\nUnfortunately, YTA because you said \"sure, here's the goalpost\" before you even knew what game was being played.", "A fox is NOT a good pet.", "Yta for not doing your due diligence. You are the adult and that means you should take more more than five minutes to look this up.\nIf you had done this, you would have know that foxes are carnivores and most carnivores like ferrets etc. smell like shit. Foxes are in general not even pets especially for someone without the right training. Where I live it’s even illegal to own a fox.\n\nYou gotta sit down and have a long talk about this but be prepared for a lot more anger and disappointment", "I think you need to have a serious conversation with ?your daughter about some of the practicalities of having a “pet” fox.\n\nIs it even legal to keep wild animals where you live? You could get away with a rabbit, but considering the smell neighbors will complain to the police.\n\nLike others have mentioned, who will take care of it in. Few years when she finishes high school?\n\nWhat is she expecting for a “pet”? It can’t live in the house, sleep in her bed, go for walks, etc. It would just be a pretty wild animal kept in a cage.\n\nI don’t think you’re the A H, because you didn’t agree with the intention of changing your mind. Your daughter will be angry, but that doesn’t make this a good idea. Maybe point out that there are so many dog rescues with amazing dogs that need a home.", "YTA for agreeing on having a wild animal as a pet at all in the first place. Just ridiculously irresponsible all-around.", "YTA, never make a promise you don't intend to keep.  Foxes are insanely hard work and given that you stated that you did some research, you should have known that they smell.  Instead of just saying \"no\" you said yes, then tried to set her up for failure by telling her to go work at a rescue.  If your plan was never to get a fox, it was incredibly stupid to promise her one with the hoped that she'd just give up.  This is 100% on you.  I don't blame you for not wanting a fox, they aren't pets and having one would be irresponsible, I do blame you for how all of this unfolded and not telling her that to begin with.", "YTA Here, but it's understandable you wouldn't want a pet fox around. If you do renege, you had better be prepared to make it up in a way that is satisfactory to your daughter.", "She is in for a really really rude awakening.  Foxes aren't meant to be pets and yes, YTAH for saying she could have one, conditions or not.", "YTA. you made a promise you never intended to keep, because you thought she'd give up and you could avoid being the bad guy for saying no. now its blowing up in your face. don't promise something you aren't willing to follow through on.", "DO NOT GET A PET FOX. FOXES ARE NOT PETS.", "YWBTA, however, YOU MUST BE AN ASSHOLE IN THIS CASE.\n\nI’m a parent. Sometimes, you parent yourself into a corner, and you have to take an L. You fucked up, you did the wrong thing, and now the only option you have is to parent yourself and your child back on track. \n\n“Listen, what I should have said was volunteer first *and then we’ll talk.* I shouldn’t have made this promise, because I understand now that it’s just not realistic. It’s not really realistic to get *any* pet right now, given how close you are to college.” \n\nThat being said, you can still support her love for animals. Consider offering to foster, to making more time to volunteer with animals as a family, help her get her vet tech certification, etc.", "I wish my kids were this focused on any goal, any goal at all. Give her the fox that she earned.", "YTA for making a stupid promise without doing your own research. You should definitely not let your kid adopt a damn fox and you should definitely suffer the consequences for making promises without knowing if you could keep them.", "There are domestic silver foxes which can be a pet (they were bred to be tame, they are not wild animals), but not all areas will allow you to have them.  Before saying yes or no, talk to your municipality to see if it's even legal to have a pet fox where you live.  That may be the end of the conversation.", "This happened to me when I was younger.  I wanted a pet raccoon.  Mom & dad said to get the info together (costs, laws & license, enclosure, where to find the pet). I had EVERYTHING! I made COLD CALLS to government agencies in the 80s!\n\nNo raccoon 😢.\n\nI'm over it. \n\nNTA it would be a bad life for the creature & I was too young to ever understand that.", "Unpopular opinion: foxes are wild animals that should not be kept as pets.", "NAH\n\nBecause you framed the question would you be TA for backing out of this, I have to say no. And your daughter is not an AH for asking and working towards a goal she set. \n\nPeople voting “YTA” are skewing the vote towards the wrong outcome. Everyone seems in agreement you need to back out of this deal. The assholery was in making it in the first place. \n\nSo if you had made the question “AITA for promising to get my daughter a pet fox if she agreed to stipulations I made after perfunctory research and made in bad faith?” Then yes, you’d be TA for that. \n\nI didn’t know foxes were so stinky (musky).  I have them in my yard all the time and I never smelled them. But they leave poop outside my door a lot to mark the territory and that’s so annoying. They’re just passing through and not living here so I’ll be thankful then for that. \n\nYou’re going to have to let her know you made a massive mistake and didn’t do enough research yourself before making this agreement. And that it’s been a learning experience for you as well. \n\nAnd you’re going to have to be honest with her about how the stench has become one with her. That has got to be the biggest wake up call playing a part in your change of plans. SHE may have become accustomed to it, but she’s got to be made aware that smell is traveling with her and going to make a lot of people nauseous. \n\nMaybe you can redirect your promise into supporting her towards a career in wildlife conservation or something that aligns with her interests and dedication.", "Foxes are bad pets. They pee on everything, and their pee smells horrible. If you get a fox as a pet, you need to prepare to smell like horrible fox pee 24/7 for the rest of its life. \n\nYTA, for a couple of reasons. You shouldn't have made the promise in the first place, because you should have done proper research into the actual particulars of owning a fox. You are currently in a no-win situation of your own making. \n\nHave a candid discussion with your daughter, and apologize for not understanding what you were getting into. Hope she forgives you eventually. But do not get the fox.", "Your research skills are sorely lacking and your ethics are in need of an overhaul - don't make false promises. YTA.", "Don’t ever promise your kid something that you can’t keep. You may not think whatever it is is a big deal, but I can promise you, your kid will remember this. You are teaching your kid that they CANNOT count on you…and that will carry over into adulthood. \n\nYTA.", "YTA but not an unforgivable one. You fucked up. You didn't research enough, you underestimated the smell, you underestimated your daughters follow through. This is 100% on you. But it's also relatively low stakes.\n\nIf I were you I'd have an honest conversation with your daughter where you really humble yourself and admit your mistake. Explain how much the smell bothers you. Explain that you didn't think through about when she goes to college and that this is your fault but it's still a reality that has to be dealt with. Accept she's right to be angry and apologize. Give her time to express her feelings and validate them. This is a moment where you can teach her that even parents make mistakes but that you love her and want to take responsibility. This is a small enough issue that if you handle it well it could make your relationship stronger.\n\nAnd then try and make it up to her after you talked. Is there a different compromise pet you wouldn't mind keeping when she goes to college? Is there a bucket list trip she's wanted that you could take her on? Obviously tailor to what's realistic to your financial situation but this goes a long way to show you do care about rewarding her hard work and that you weren't just lying from the start. That you care about making this right.", "Foxes are wild animals, not pets.", "Of course YWBTA.  You shouldn't make promises you never intended to keep.  I wouldn't let that deter your from backing out though.  I would be pretty pissed if I was your neighbor and had to deal with fox musk smell all of the time.  Maybe she could volunteer two days instead of one as a compromise.", "Does this wildlife rescue centre have any programmes about releasing animals back into the wild? Because that should be the goal, foxes are wild animals despite what cute TikToks say. If this centre has permanent residents who can't go back to the wild they won't just hand them out willy nilly to teenagers who have worked there for 3 weeks. \n\nYTA, this was a silly thing to promise in the first place, too.", "YTA for not knowing foxes make horrible pets. As a parent try not to do the bait and switch.", "YTA for promising something like that in the first place because you didn’t believe in her and her ability to work hard towards it. It is realistically going to impact her motivation and trust in you that you gave her goals, promised a reward and she embraced that and dedicated herself to achieving it only to be disappointed and denied anyway. She’s going to realise you only said it because you didn’t think she could do it and that will be hard for her. It’s like you bet against her, it was a bad situation to get into because you didn’t really think it through.\n\nOn the other hand, this isn’t a car or something but a living animal you shouldn’t take on if you are unprepared just because you mistakenly made a promise. It’s not like this isn’t going to have an impact on your environment, although again you should have really researched that first, the main thing you hear about foxes is the odour so that shouldn’t have been a surprise. Everyone, including the fox, could ultimately end up in a difficult situation. Your daughter will presumably want to move out in a few years and finding accommodation that allows animals, especially exotics, is a huge obstacle to that. It’s not practical but that’s why you shouldn’t have promised. However I don’t think that means you have to follow through when that could make things worse, just really own up to your daughter that you screwed up and accept her negative emotions about it, not punishing her for reacting or speaking her mind. Parents aren’t perfect so don’t pretend to be, acknowledge where you went wrong and how it hurt her so you can hopefully work through it together. Also, still try to take an interest in her interests even though actually taking on a fox isn’t practical, it doesn’t sound like you learned much about them.", "Eh YTA for making the promise. Don’t let her get a fox though- bad idea. Since she is willing to put work in, maybe compromise on a more practical pet?", "In my opinion, why even entertain the idea of a 16 year old wanting a fox in the first place? They aren't pets, they're meant to be wild animals. Kids want all kinds of crazy things - you should have and could have said no or at least when she can her own financial decisions after college in her own space. YTA for going along with it to begin with.", "She's 16 - she's old enough to know that foxes aren't pets. What sort of AH wants to keep a wild animal in an enclosure? She needs to get over that idea but YTA for even considering it. And then giving her conditions and backing out of your promise when she meets those conditions.\n\nYou're just going to have to accept being the AH here and not make a poor fox suffer because you're going back on your word.", "YTA for causing all of this \n\n> I know she'll be really mad and feel like she did a lot of work for nothing if I go back on my word and say we're not getting a fox, but I'm worried about the consequences of getting one. WIBTA for going back on my word?\n\n\"Am I The AH for lying from the start, expecting my daughter to fail, getting worried because she actually finishes what she starts, and now waiting until she's put considerable effort into this before pulling the rug out from under her teaching her to never trust me again?\"\n\nYes.   Yes you are.\n\nYou need to own that you're the bad guy.  She's a teen and will be leaving home so you'll be the one caring for it.  The fox shouldn't happen.  \n\nThat said, you're the bad guy no matter what you do.  You're either the bad guy with a fox or without a fox.  \n\nJust be prepared that your daughter will never trust your word again.", "YTA for making that promise in the first place, especially because you never intended to follow through with it. Never promise or threaten anything unless you are 100% prepared to go through with it. (By threaten, I mean offering consequences, not literally threaten)", "Y *absolutely* TA. That being said, I think you should go with your daughter to the sanctuary one day. Have candid conversations with those running the sanctuary as well as other volunteers. Maybe this conversation can help your daughter to realize that this may not be a good idea.", "YTA simply because you've made a terrible situation for yourself with no way out without being even more of an AH to someone or something. Let's go through it point by point.\n\n* You, as an adult, as a *parent*, should have done better research about foxes the first time your daughter brought it up. You say you did a day of research but clearly you did not if you think an *enclosure in a back yard* is sufficient for a fox to live in! \n\n* Next, you actually made a good decision. Having her volunteer at a rescue/wildlife preserve is a fantastic way for her to get to interact with foxes (and other animals and nature in general!) without having to bring them into your yard and possibly your home. I think this rescue will be part of the key to how you get out of this situation.\n\n* \"Every time she's come back from volunteering she's brought this really horrid odor back into the house.\" No shit, animals stink. They're wild, they don't smell like rose petals. This is something that your daughter really enjoys and finds meaning in. Learn to deal with it. Maybe get her a 'work outfit' for when she's at the rescue that she can change into at the place, and change out of before coming home if it really bothers you that much.\n\n* \"It will be too much work.\" You're probably correct, but not *certainly* correct. Your daughter is 16, she could definitely handle it if she put her mind to it, but as you said she has work and school (and this volunteer rescue), I don't think it would be realistic.\n\n* She will definitely be very upset if you renege now. But you really have to. A fox is not a pet and your daughter and your household is not equipped to handle a wild animal. An enclosure is not sufficient. Working for three weeks in an animal rescue is not sufficient.\n\nWhat you need to do is sit your daughter down and apologize. Explain how deeply sorry you are, but that you made a mistake by agreeing to get her a pet fox, and that doing so would only cause more problems for everyone. Explain what I and others have mentioned. Talk to the leaders at the wildlife rescue, I'm positive they will agree that a fox is not a suitable pet. Tell her that you love and admire her dedication to animals and that you are really proud of the work she's done, and that you hope she will want to continue volunteering at the wildlife rescue and interact with the animals that way. \n\nThe big thing is to make it clear that this is your mistake, not your daughter's, and that you are very sorry for leading her on and putting her in this situation. She'll still likely be upset. But this is the best outcome for everyone.", "YWBTA.  That said, honestly just give her a few more months at the reserve first and she will probably change her tune about foxes as pets. Maybe ask the reserve yourself because likely they can explain better why they are not pets and also maybe your yard and planned enclosure won’t be adequate. If you are looking for a compromise to full-time fox care, see if she could foster some at your place as needed to help the reserve while they build enclosures or if they need to quarantine.  It’s most likely just from feeding that she smells. I volunteered with my friend who worked full-time at a wolf reserve and they basically had to butcher their own meat.  I think you should consider these great alternatives and not break your kids heart plus it could do some good for captive bred and captured foxes.", "INFO: at the facility where she is volunteering, where were the foxes rescued from?\n\nCan she talk with the people there about her desire for a fox as a pet? Can *you* talk to the people there? Your house is not an appropriate place to keep a fox. They’ll tell you that. \n\nYou’re still TA for making a lie-promise, but YTA doubly if you got a pet fox.", "YTA because you don't make promises you can't keep.A fox is not a good choice for a pet. You should sit down with your daughter and apologize sincerely and tell her you were wrong for promising her a fox.", "YTA. Totally. You admit to have given her conditions only to deter your daughter and you are now looking for excuses for not fulfilling your promise. That's some shitty parenting if you ask me.", "\"past 3 weeks, one day a week\"\n\n&#x200B;\n\nso she's been there 3 times?", "INFO, has she had a conversation with the people at the rescue about her plans? Have they not tried to discourage her on the grounds they aren't pets? Or would this be a rehabilitation situation which they can advise/ensure happens appropriately? (Trying to guage if there is an animal cruelty situation here)", "YTA for not instantly shutting it down when she asked. A fox is a wild animal for goodness sake.", "YTA.\n\nYou clearly didn't do any research. When I searched 'pet fox ohio', the first result was a news article with the title 'Adorable to look at, Destructive to own: Why foxes don't make great pets\". You clearly didn't do any research. Most states don't allow foxes to be pets. Only 15 allow them. And if you are \"lucky\" enough to be in one of the states, you would then have to find a vet who could care for one. You would know how stinky they are and that they dont make good pets.", "Anyone else think this problem might solve itself in a few months when everyone at school notices the daughter smells like fox urine all the time? \n\nI’d also have included stipulations that daughter find a veterinarian who will treat foxes locally and built up several thousand dollars for sudden vet bills. AND a solid plan for how daughter will keep the fox with her if she moves out for college. How will that impact her school choices? Might put her off it for a few years.", "A fox is a wild animal. Why would you ever entertain the idea of having one as a pet??? You seem wildly irresponsible.", "Fox are not pet for god sake....\nNTA but stop making false promises...", "YWBTA for exactly the reason you said.  She met all of your conditions & now you owe her a pet fox.", "YTA for making the promise at all. Foxes are wild animals. And while they can be cute and all, they are the happiest in an healthy wooded area.\n\nYou need to talk to your daughter. But you shouldn’t do it alone. Maybe reach out to the wild life organization she is volunteering with and talk to them about the situation. They probably have more information about foxes and their lifestyles in the wild and might make a good third party in your talk with your daughter. \n\nAnd maybe you can aim for a compromise. Some wild life sanctuary’s allow ‘adoption’ where one regularly donates for a special animal and in return they can name it and receive regular updates. Even potential visits. But you never own the animal in any way. If you can afford it you and your daughter could split the donations. And the daughter might be able to volunteer additionally.\n\nIt will be a tough talk but there are good compromises and it is a teachable moment.", "YWBTA based on the way you went about it. Why didn’t you just tell her no from the very start? She seems pretty determined and she’s following all the parameters YOU set hoping to dissuade her. You played the game and you lost instead of just being honest and communicating with your child.", "NTA. She’s 16 and who will care for the animal once she is at college or otherwise out of the house? You will.", "She's put in a lot of effort so you should not really stop her now.\n\nMy mother had a pet fox when she was a teenager. Apparently they are not too difficult to keep as pets. She had hers from a pup in a an interesting way really. She was a Farmer's daughter and when she was young she with her parents went following the hunt. One day apparently the hunt caught a vixen with cubs and because there were children present gave the cubs away to my mother and one of her friends as pets. If the children had not have been there I have little doubt what would have happened to the cubs.\n\nMy mother changed and became anti-hunting when she'd grown a little older.\n\nI know the fox smell too. I remember when we were in the woods once my mother stopped us and pointed out the smell. We didn't get to see a fox that day but I did learn to recognise the smell. Very unique.", "I’m pretty sure getting foxes as pets isn’t legal anyways. You’d probably have to be a wildlife rehabilitator and I doubt you can get a license for that at 16.", " Yes, you would be, but you NEED to be\n\nDo not get a fox, they are not pets.  Realistically don’t get a kid a pet of any kind you aren’t fully prepared to care for entirely their entire life span.\n\nYou were an idiot to say yes.  Own it", "Many states have laws. She’s way too young to even foster a rescue. Nor is she or the enclosure okayed by Law to house a wild animal. \n\nSit down and talk to her how you did your own research and how having a pet fox wont be good for the fox or for either. \n\nAnd if I’m mistaken or react me, but won’t the enclosure also attract certain animals? \n\nAnd if this is a juvenile or adult fox you’d be ‘adopting’ there’s no way to ensure it’s ok to be with humans or won’t try to escape due to instincts.", "Yta for how you did it.  But please stick to your guns.  A fox is not a pet and is way too much work for a 16 yo", "YTA", "ESH.\n\nYou suck for lying your daughter sucks for wanting to abuse foxes by locking them in cages.\n\nEveryone sucks here", "i wonder if the people at the shelter know why she started working there. i think, those would be the people that are able to convince her, that a fox is not a pet. \n\nI vote YTA, but mainly because you didnt try to shut down her plan from the beginning with the right reasoning by telling her, that foxes are not pets.", "YTA, not for not wanting a fox, but for saying yes in the first place without intending to follow through. \"No, honey, they're wild animals and not suitable as pets, but you can volunteer at a fox rescue if you want to be around them\" is reasonable. Setting conditions with no plan for what happens if she fulfills them is not.", "Soft YTA.\n\nPromising something and then failing to keep that promise sucks - but no matter how much it sucks, it's the right thing to do in this case. \n\nFoxes are not pet animals, and you need to talk to her about that, and own up to the fact that you agreed to something without fully understanding.\n\nShe already spends time volunteering at a wildlife rescue, I'd call them up and see if they can help convince her that it's a bad idea. \n\nMaybe even try the social media channels that she follows that gave her this idea. The responsible ones usually dedicate whole videos and have frequent reminders that their exotic pets aren't really pets, and they have special circumstances that let them keep wild animals (like owning a wildlife sanctuary, being a vet, receiving donations, ad revenue, Patreon, sponsorships, etc)\n\nOther things you'll probably want to go over would be asking her if she's ready and able to constantly replace things, furniture, clothing, decor, for the entire household - if she ever takes it inside.\n\nIs she ready for the liability if it escapes and eats the neighbors pets? Or bites other people? Or destroys their property?", "Foxes are wild animals, not pets. YTA for agreeing to this ridiculous request.", "Two to 300 $ a month will simply not be enough for a fox. Not to mention how destructive there and how much attention they need she simply is not capable. You’re not the asshole. She can do it when she’s an adult. Tell her to start saving now so that she can afford the massive bills then", "OP, Oh. . . OP. . . . A 16 year old girl who gets straight A's and is (currently) into foxes, because she's on a social media site.  . . .   Oh OP.  I feel your pain and your mental exhaustion.  It's hard enough having a teenage daughter - but you have a SMART, HARD WORKING teenage daughter with high expectations of you fulfilling the promise you made to her.  \n\nThis situation calls for a giant mea culpa from you, and a COMPROMISE. \n\nMost of these social media sites that teens are drawn to have a photographic component - meaning that there's a huge urge to post selfie photos of your teenage self interacting with and being adored by foxes.  There's got to be a way to satisfy this current hobby that doesn't smell up your life and endanger your daughter (foxes are wild and sometimes dangerous animals - and as many posters pointed out - they are NOT meant to be pets). \n\nPerhaps there's a family trip that can be planned with a focus on wild animals and photo ops? Perhaps there's a zoo that needs an intern in the fox department?  Brainstorm a bit and come up with legitimate options to offer your daughter.  She's smart and she will eventually get over the hurt of you reneging on your promise, but you are definitely the AH . . . momentarily.  This is a tough one, but you both will live to fight another day and next time do a TON of research before agreeing to ANYTHING!!", "You broke something very valuable. You won't get it back. It will be a very, very long time and will require MUCH work on your part for her to EVER trust your word again. Even then, she will never completely trust you. For me? As a teen, I would have rebelled, my grades would probably have suffered. I would have gone out of my way to hurt you !Ike you hurt me. Teens think that way and act, even to their own detriment. Even now, if I fulfilled all of the requirements handed to me as a caveat to achieve something I desperately wanted, only to be told I couldn't have it, I would cut that person from my life. Period. I refuse to have people I can't trust, around me. You broke something. Tell her NOW or were you going to wait for the enclosure to be built? She will hate you, but you brought this onto yourself.", "OP you are a fool to ever consider allowing her to a pet fox, whether you were never going to fulfill that promise or not. Not only should you never have a wild animal as a pet, foxes are so extremely difficult to care for. Please look up juniperfoxx on Instagram. She’s an official wildlife rehabilitator who has foxes and other wild animals. They are not meant to be pets. YTA", "Let me guess: your daughter follows that one fox account on insta that basically devolved into lowkey fox hoarding? \n\nGetting a fox as a pet is awful for the smell alone. Do not do this", "That's a word I would definitely go back on.  Foxes don't WANT to be pets.  Sounds to me like something to draw attention to one's self.  Look at me , I have a fox for a pet.  I'm too special for a dog", "Offer to get her a puppy or another pet.", "I think you should have done your own research into the matter to realize the commitment you just gave to your kid. Foxes stink. They smell musky and almost skunk like. It helps them hunt. They are not cute little cat puppies that everyone thinks they are. \nYou are the asshole for making a promise that you didn’t think would work out.", "Perhaps call the place where she volunteers and speak w them about her plans. Maybe they aren’t aware of her intentions. Perhaps they can begin to talk w her about the problems w having a fox in captivity, or the costs, the realities, etc.", "Yeah/ Yta because you’re breaking a promise, that you should never have made and your daughter is going to be pissed. So get ready for that.. but please bite the bullet and be the ah as that is better than getting a pet fox", "INFO: is she looking into higher ed? What would become of the fox if she moved out for uni?", "YTA foxes are NOT PETS and that smell only gets worse.  Have the people at the sanctuary not explained what a terrible idea this is?  That smell builds up over months and will utterly destroy your house.  \n\nWhy would you ever agree to such a terrible idea in the first place?", "ESH. Foxes are not pets, and the foxes you see on social media may be cute, but they are destructive, loud, smelly, and they bite. They are not like having a dog or a cat. Your daughter is being naive, and shouldn’t go by everything she sees on social media. The wildlife place is a perfect solution because she can spend time with the foxes she loves without all the responsibility. You can’t just leave a Fox if you go on vacation, so who will look after it? Depending on the state you also may need a special license to have a pet like that. \n\nYou are NTA for not wanting a Fox, but you would be TA if you get one. I think you should sit down and talk to your daughter about the research you’ve done and what you’ve learned here, and consider other pets. There are many dog breeds. Some are difficult to take care of like a husky, while others are easy. I have a cavalier King Charles spaniel that is a low maintenance breed. There are so many dogs in the shelter that need homes. \n\nThe more domestic fox breeds that you’d end up purchasing are often bred for their fur. This means that their other needs are overlooked and they can often have genetic issues or trauma from how they were treated in these places. \n\nI’d recommend looking up and watching all of the Juniper fox videos. The woman who runs it has like 4-5 foxes and other wildlife. She makes many videos about the challenges of fox ownership. Her foxes are adorable but they bite, get up on the counters, pee everywhere, shed everywhere, and aren’t good around people except for her and a few close friends. \n\nHaving a Fox could kill your daughter’s social life, her ability to go places freely, and her ability to keep her things nice. When your daughter moves out is she going to bring the fox? Because it’s not like a dog where you can have it in a pet friendly apartment. Please do not get your daughter a fox. You’re NTA for going back on your promise if it means a fox isn’t forced into a domestic life it’s not made for.", "I think WBESH (would be everyone sucks here)\n\ndaughter - needs to realise foxes not pets and you don't need extra odor coming in house. she won't be taking care of it if going to college\n\nparent (OP) - stop making promises you can't keep", "Having a teen daughter myself, it was very naive of you to think she wouldn’t follow through to get what she wants! Girls are stubborn like that!  \n\nBesides that, a fox is not a pet! C’mon man, you know that! You were just trying to pacify her so she’d stop asking over, and over, and over, and over, and over, and over again. YTA. Now it’s going to be worse because you lied to her.", "I am afraid you are in a lose-lose situation here.\n\nIf I were you, I would sit your daughter down and confess that you messed up (by making a decision based on too little information).", "There is no such thing as a PET fox. Check your local wildlife laws.", "YTA for making the promise at all. Foxes are 100% not pets and you would know that if you had done more than a SINGLE DAY of research. They are INCREDIBLY destructive, they smell, they are noisy nearly all off he time they are awake, etc. If you aren't involved with rescue or rehabilitation of foxes you shouldn't even humor the idea of keeping one. Non-rehabbers are absolutely not equipped or \"trained\" to deal with this kind of WILD ANIMAL, ESPECIALLY A TEENAGER OF ALL PEOPLE!!!!", "YTA for making the promise, 100%, but no, you wouldn’t be in the wrong for saying no now. Even if you’re an asshole for doing it. \n\nFoxes aren’t pets that kids without their own property should be getting. I would argue that really, unless it’s a rescue situation (ex: someone keeping a pet fox gives it up/dies/abandons it etc.) nobody should be keeping foxes, but that’s my personal opinion.\n\nIn proper care in captivity, foxes can live up to 15 years. Let’s say she gets a year old fox. Is she really going to have time and resources to do the heavy amount of care that fox needs until she’s 30? All throughout college she’s going to take hours out of her day to feed it, clean after it, provide more enrichment, etc.? She’s going to either come home every day or find an affordable large property to move the fox to? And yes, foxes smell horrible. They essentially smell like watered down skunk. As someone who has done taxidermy work with dead fox parts, it is a horrendous smell you have to scrub away with shampoo and conditioner multiple times to get out of the fur, which you can’t do with a live fox. It’s incredibly irresponsible to have a fox bonded to you and rehome it. You’re not going to do the work for her. What’s going to happen to it?\n\nYou have to tell her as soon as possible, you should absolutely be reimbursing her for any and all money she has spent so far on this regardless of how much it is, and next time think and do your own research before you make such an irresponsible promise. If she ends up wanting a cat or a dog she’s clearly shown she’s dedicated enough to own some kind of pet at least.", "Of course, you shouldn't have told her \"yes\" to begin with, but the damage is done and you need to be the adult here.\n\nWild animals are not pets, they're not domesticated. There's a good chance that there will be major problems with this animal, including safety issues. What if she loses interest in it? What happens when she turns 18? Some areas have laws that make it illegal to keep wild animals. I'm surprised that a wildlife rehab is willing to let a 16 year old take on a fox. There are dog breeders that wouldn't sell a dog to an 18 year old, much less a 16 year old.", "There are actually domesticated foxes. But, they come from Russia and bear a price tag of roughly $9000.\n\n[https://pethelpful.com/exotic-pets/Russian-Pet-Domesticated-Foxes#:\\~:text=Owners%20of%20true%20Russian%20domesticated%20foxes%20are%20exceptionally,domesticated%20fox%20will%20be%20in%20excess%20of%20%249000](https://pethelpful.com/exotic-pets/Russian-Pet-Domesticated-Foxes#:~:text=Owners%20of%20true%20Russian%20domesticated%20foxes%20are%20exceptionally,domesticated%20fox%20will%20be%20in%20excess%20of%20%249000).\n\nHowever, your daughter wants a wild animal, and you freaking agreed! Stop right now, explain it cannot happen, and take your licks, because you are in the wrong.\n\nYTA", "YTA - it's like the dad who put his credit card on the wall and told the son he could buy anything he wanted if the kid could headbutt the card against the wall as dad dropped it. \n\nKid did it. Dad was sad. I assume dad payed up. \n\nThis is a pivotal moment in time for you. Your job now is to help guide your daughter. Shut her down now and you can create a very negative mindset for her when she considers her goals in the future. \n\nShe wanted something, you set the conditions, and she's achieving them and putting effort. \n\nYou have to not only reward this behavior, but you also have to guide and nurture it. Show her that she can get results when she applies herself. Show her that you support her. It'll be effort on your part, because it's time to bust out the hammer and nails and measuring tape. It's time for you to learn and grow with her. Help her and yourself, you will both appreciate the experience for life. \n\nStifle her now and it will create a serious rift between you two, seriously how you handle this will lay a foundation for your adult relationship.", "What is she going to do long term with college or apartments? I do not believe she would be able to have one in an apartment.", "I’m in the US. Most state, county, local municipalities have restrictions on keeping wild animal species as pets. We rehabilitated 2 baby squirrels (Mork and Mindy) that were orphaned when the mother was fatally injured when a tree was being cut down. We had them for a year or so until the game warden found out and took them. Are you sure you can even legally have one?", "NTA what so ever.", "YTA. You fucked around and found out.", "Hard to answer because you both are and are not TA.\n\nYou are because making a false promise that you had no intention of going through with because you assumed, \"She'll get over it,\" automatically makes you an AH. If you didn't want a fox as a pet, you should have stuck to \"no\" regardless of how much she insisted.\n\nThe reason for not being an AH is because your natural instinct was right. You should not get a fox as a pet, for a variety of reasons, not the least of which is the fact that your daughter is 16 and (presumably) will go off to college in 2 years. Who's going to take care of the pet after she's gone? You.", "Ok, YWBTA for going back on your word. \n\nThat said, as many people here already said: foxes are not pet material for various reasons. \n\nYou do NEED to apologise to your daughter and repair the trust you broke with your thoughtless promise. \n\nGoing back on your word after she surpassed all your expectations is major AH territory, so a sincere apology is the least you can do.", "Foxes smell rank. Even the most basic research should have thrown up this fact, so it's clear that when you did your research, you didn't really do your research. \n\nAside from that, yes, YTA, big time. \n\nYou basically tried to set your kid up to fail and you never had the slightest intention of honoring your promise. Clearly, your word means jack and you don't think it's important to honor a commitment. That's a really terrible way to behave and a really terrible lesson to teach your kid.", "Don't make promises you don't intend to keep.\n\nDon't promise your child that they can keep a wild animal as a pet, or otherwise allow them to keep a wild animal as a pet. Explain to your child why it's a bad idea.  Do research if you have to, or if you think it IS a good idea.\n\nYTA x2", "Yta but since you are already in this boat see if the place she is volunteering at can talk some sense into her. What the reality of it really is.", "YTA for making the promise when you probably skimmed one article. Sit down with her and have an honest conversation about your concerns.", "Do not get a Fox. Foxes are not pets. If your daughter is able to spare $200-300 per month who do you think will be caring for the Fox when she’s at her job? You. Foxes are incredibly high energy. They smell. A lot. Nobody will be able to stand being in your house or around you. You will bring that smell with you wherever you go. They are also very noisy… like they literally scream. Y-T-A for making a promise you shouldn’t keep without doing your research. But YWNBTA for going back on this one.", "Foxes are wild animals, not pets! YTA for even considering getting one as a pet and you're an even bigger AH for making promises you can't keep! Do you realise how soul destroying it is to have your mother break promises? She will remember every broken promise for the rest of her life.", "NTA! Foxes are not pets but wild animals. Your local animal control could come take them. Certain videos are done in sanctuaries for these animals.", "Do NOT get a pet fox!!! They are wild animals not pets and they stink to high heaven. The fox will stink, the enclosure will stink, your whole yard will stink, whoever takes care of the fox will stink, whoever spends any time in the yard will stink and it will even stink so bad your neigbours will complain!!!\n\n\nTell your daughter that you a very sorry but that promising her a pet fox was a mistake. You should have done more research yourself before you made that decision and promised her. You didn't do that research before deciding but now that you have done that research you now know that getting a pet fox is not an option, because:\n-they are wild animals that should not be kept as pets\n-their smell is MUCH too strong making them unsuitable as pets and unsuitable for living anywhere close to any homes and it would not just be a big nuisance for your family but also to everyond surrounding your property and that is just not ok\n-it is too much work especially of she goes to college or something in the future, since she can't just take a stinky wild animal with her\n\n\nShe can continue volunteering at the wildlife rescue to get her fill of wild animals. The fact that she still thinks it is realistic and ok to have a wild animal as a pet and still actively wants to pursue that tells me she doesn't understand wild animals and what they need and deserve and what the consequences of keeping a wild animal as a pet would be.\n\nBtw, anyone that works with wild animals stinks to high heaven. That includes volunteers at animal rescue's, zoo keepers and many more. If you would have met Steve Iwin after he had worked with animalsmamd before he had a chance to take a shower, he would have stunk to high heaven.\n\nSo in short: do not keep a wild animal as a pet and do not keep a wild animal in a residential area because they stink to high heaven which is not ok in a residential area.\n\n\nBtw, one of the reasons foxes and their habitat stink so bad is because they tend to mark everything in their territory with urine, which stinks really bad. I am sure you don't want your yard to stink like one big fox urinal.", "YTA \n\nDon't make promises you don't know you're able to keep.\n\nThe same sort of \"set expectations I expect you to fail\" method was how I learned to stop trusting my parents altogether. \n\nPutting in all the work, meeting the agreed upon requirements, only to be told to my face 'I didn't think you'd actually do it' was one of the defining disappointments of my youth.\n\nRegardless of how you handle the situation, be thoughtful in how you go about it. Whether you go back on your word, or try to make it work, take time to think to yourself how you would want to be treated if the roles were reversed. If \"no\" is the only reasonable option, be ready to honestly apologize for getting kiddos hopes up, genuinely offer consolatory alternatives, and be understanding if kiddo gets upset.\n\nAnd in future, consider responses like \"let's research this together and see if it's feasible\" instead of promising things before you know much about what you're getting into.", "Unfortunately I'd say YTA for making a promise to get one without really looking into it. Foxes stink and are not domestic animals. And also her paying $2000-$3000 a year to look after it will soon stop. Absolutely do not get a fox, fucking hell.", "YTA for promising her she could have a fox without fully researching. Your daughter will be likely heading to college in just a couple of years, leaving you with this wild animal for likely the rest of its life. Foxes ARE NOT pets. As you've seen, they reek. They're also destructive, and are not happy in captivity. They belong in the wild.", "My first pet that my mother didn't want was a lizard, I got him because she said yes. I kept him in my room and she barely knew he was there after I officially got him. I wanted ferrets so bad but knew with my mom's super smeller that she would suffer and she definitely said no to those guys. I got ferrets after I moved out! Definitely don't promise stuff that you aren't confident on otherwise sit down and properly talk. Tell her why, talk about your boundaries as a parent(if I was a parent, idk that I'd want a fox either, they are so smelly! Still love them though), maybe about your mistake of promising and hoping she'd fall off track.. I wish my parents would've taught me and talked more about the choices they made for my good. I'd just get upset and nothing went from there other than I got a no and thats all. I think kids deserve to know why they getting a no or why parents make certain choices for them. Not everyone has an amazing mom like me but the amount that I look back and go \"man she was right about that\", is crazy.. wish I wouldn't have been so stubborn as a teen.", "There was a post on AITA some ways back, where a young woman was determined to have a pet fox. No argument could sway her. Finally, she approached the people who could make it happen, and they insisted first that she live with fox urine 24/7 for a set period of time.\n\nShe dropped the idea pretty quick.\n\nIt might well be that the place that provides foxes won't let her have them... they've been around the block to know what it entails, and likely don't want to set up a person with a fox until they are *certain* it's a good match.", "YWBTA. The number one rule of parenting is don't make threats nor promises that you can't/won't follow through on. And YTA for not believing in your kid's determination.", "[removed]", "Foxes aren't meant to be pets at all. It's illegal, in the UK, to keep a fox as a pet.", "Yeah, it's not really feasible. I think people are really underselling the smell even in this thread, which is the #1 concern with foxes. It's not just the urine.\n\nMost animal scent (especially mammals) doesn't come from their feces or urine, but **musk**. When you go to the zoo, the strong zoo odor you often smell is almost never dung (keepers keep the zoos clean) but musk. Most pet owners aren't too familiar, because popular pets don't produce hardly any musk - we've basically bred it out of them on purpose. Ferrets are the only semi-popular pet that produces a bit of musk and people freak out over even that.\n\nFoxes are **extremely** musky. They have glands all over their body that produce different gland secretions and they obsessively wipe it all over everything they can find, including you, your house, their food, their food bowls, their enclosure, the grass, etc. It's like an oil that gets a little bit on everything.\n\nMusk is meant for marking territory and is heavily water-resistant. It sinks into things (like skin) and \"marks\" them. It accumulates and gets worse over time.\n\nThat's before we even get to the urine, which they spray everywhere, also for marking territory, which smells like fox musk mixed with tomcat spray times 10. Awful. It also will not wash off.\n\nBottom line, foxes will deliberately make everything around them smell like them and showering won't help.", "To be pedantic, it wasn't a \"lie\"; it was a promise made with incomplete information that came and slapped OP in the face big time.  This is an opportunity for a parent to own their flaws, try to make it up, and teach a lesson than responsibility can mean breaking rather than keeping promises.  There are times where it makes sense to break a promise.  There comes a breaking point.  What if it had been, \"Yeah, they demand you sacrifice a virgin weekly for them, but you really get used to it after the first few sacrifices\"?  OP has to pay for the mistake, but it was a mistake not a lie, and keeping a fox isn't the best repayment.", "Agreed op you should have just suggested the volunteering to interact with them, I should think working for a rescue would give her an idea WHY foxes aren't pets (and how they end up in a rescue when the owners realize the mistake they made). You'll have to go back on your word and deal with the consequences of her being angry since a fox is not a pet it's a wild animal that has very complex needs. There is no such thing as \"fox food\" so your daughter will have to meticulously craft a balanced diet for this fox. As someone who worked in vet med most of not ALL homemade pet diets are lacking in at least one nutrient or more and the animal ends up with health problems. And these are ones crafted by people who have more knowledge than your 16yr old daughter whose still in highschool. You would be extremely irresponsible to give her a fox as a pet and you should have just told her that straight away. These tiktok and Youtube channels glorifying owning exotic pets need to be banned. They're making the problem worse.", "Look I agree 100% that your average red fox is NOT a pet. However there is a large population of domesticated silver foxes that ARE pets. They’re from a scientific study about how we might have domesticated dogs. [Link](https://evolution-outreach.biomedcentral.com/articles/10.1186/s12052-018-0090-x)", "domestic foxes are purely pets while they may stink they do not act like wild foxes and a domestic fox left to its own vices will die of starvation. they have been bred to rely on and seek human interaction. just because they are a pet you don’t like doesn’t mean they weren’t bred to be pets. \n\nthis is like saying ferrets aren’t pets because they aren’t a dog or a cat. if the animal was created by humans through a breeding program for human companionship regardless of its care needs, it’s a pet.", "„Massive“ \nThey made a mistake. Don’t overdo it lol.", "[removed]", "Also to support your second point. OP alluded to it with the smell, but Fox urine smells *atrocious* and is difficult to get rid of.", "OP should have said no from the start. Foxes are wild creatures, and only very specialized environments are healthy for those creatures. It’s a very big commitment to get any pet. Wildlife rescues are double the consideration. A day of research and a gamble that the kid will grow tired of it does not meet that standard of consideration.", "NTA you are not a massive TA for changing your mind now that you have additional information.", "If it’s the Instagram I’m thinking of, her handle is actually juniperfoxx. But yes she gives so much info about the realities of handling foxes.", "I was going to comment about juniper's page and how she explains they are not pets!! \n\nPlease please do more research and do not get a fox.", "> This guy had to live with a bit of fox pee for breaking hunting laws.. worth a read\n\nI think that happened in my county! I remember something about it in the local newspaper.\n\nfrom the sounds of it it really broke the guy...", "I’m surprised no one where she’s volunteering has mentioned this. OP is she’s working at a rescue org, maybe someone there can have a talk with her about keeping wild animals as pets, because it’s wrong to cage a fox or any wild animal (unless they are being rehabed to go into the wild).", "THIS!!!!!!!!!!!! \n\nffs.", "I'm wondering how the daughter can be spending so much time at a *rescue* and not have already been shown/told the ethical issues with owning foxes as pets.", "Can you people not read? Do you just pull out the same response every time? He did intend on fulfilling it, the smell has changed his mind", "TBF If smells were a problem in an arcade gaming wouldn't be where it is today, my friend.", "That's actually a pretty normal thing and is NOT the fox 'going feral'.\n\nIt is likely around autumn of their first year, which is usually when the parents chase the kits away from their old home to go start their own lives. \n\nWhich tends to make foxes that were previously docile, start acting quite moody, aggressive and short-tempered, likely as a survival technique as instinctively, they still expect to be kicked out at any time now.\n\nThis is temporary, but first time fox-owners are often caught off-guard by the period of time it occurs. And the personality may still not be the same afterwards. It's kind of like how humans have puberty and go through a lot of changes from 12 to 20, but in a fox, it's a much shorter time period they have to grow up and change in.", "[removed]", "Yeah foxes are notorious for their smell, they have a really unique horrible scent (it’s close to a skunk smell) they release from a gland next to their butthole. It’s really bad, way worse than a cat or dog. OP definitely should have researched this before getting her hopes up.", "Obviously not getting the daughter a fox is the right decision.  \n\nBut... the OP knew that when she first asked, and as opposed to just saying no at the beginning like they should have, they instead set up conditions they assumed the daughter wouldn't follow through with.", "Exactly. Plus what’s going to happen in 2 years when she moves away to college or gets her own place and can’t take the fox with her? She’s young and only looking at this with rose colored glasses and not thinking of the reality of the situation. Dad is NTA for doing what’s right for the animal and her.\n\nEdit: lots of people are caught up on the “going back on a promise” thing, but that’s part of parenting. Sometimes you get new information and you have to make a difficult decision, sometimes in opposition to a decision you previously made. OP is 100% NTA for getting new information and deciding what’s right.", "Nah, OP is the asshole because she didn’t “make a mistake,” she thought her kid couldn’t fulfill the requirements of her promise. This is the part of “Scott’s Tots” where he knows he can’t pay for their college but lets them sing their song. \n\nAlso: obviously, owning a fox as a pet is a terrible idea. But tell your kid that, not “if you work hard and whatever, you can have a fox.”", "It is so, so much worse than dogs. Dogs love rolling around in fox shit. The smell is revolting. You can't even smell dog anymore, all you smell is fox shit.", "We were feeding a stray cat to capture it after an asshole cat hoarder threw a few out.\n\nA skunk would occasionally visit so when a bad smell woke us up, we had assumed the skunk sprayed. Checked the cameras, a fox wandered into our yard for less than a minute. The smell was strong enough to wake up the entire house that night and the following night when it returned.  We could smell it until we had a good rain.\n\nWe didn't leave the food out after the first night,  just water. We fed the cat and took the food in after she had eaten. The smell was that bad!\n\n (Kitty has a home now, btw!)", "He \"researched it for a day\" but literally nothing he researched talked about the eye watering smell? I haven't even researched it but I know that they figured out that it's possible to domesticate foxes but in doing so it was impossible to breed the need to constantly mark/pee out of them", "this isn’t entirely true chief, foxes and raccoons have been domesticated. there were breeding programs for both that led to the domestication of them.\n\na domestic fox even if it is a rescue, does not behave like a wild fox and is not suitable to survive in the wild, it is quite literally a pet.\n\nif your opinion is that we shouldn’t domesticate things that’s a whole other story, but pet foxes and raccoons are not wild caught and do not behave like wild animals, they are purpose bred pets.\n\nthey have no fear of humans and actively seek human interaction like dogs or cats because they were bred to do so.\n\nplease don’t speak about something you do not have the expertise or have not done the research to speak about.", "domestic foxes die if left in the wild. everyone in this thread talking about this is a moron. wild foxes require licensing, domestic foxes can be purchased as they are just pets, that were purpose bred for companionship.", "I dunno. I heard once that most people who get a pet fox and give them up do so because of their smell. Apparently they smell quite awful all on their own.", "I don't think the daughter has proven herself all that mature.  How is she going to study, work and care for the pet?  It sounds good on paper but in practice it's different.  Daughter is a good kid, but I don't think she has thought through this whole scenario.  The parent has and is preventing a bad situation", "This is one of the few reasonable comments here. The daughter seems to be taking this seriously and actually learning a lot. What needs to happen is an honest conversation about the pros and cons and what will happen in the future. Can she articulate a plan for what she's going to do once school is over? Can she understand all the potential issues and responsibilities?\n\nIt's possible she could do this correctly. Or she's a teen who's gotten obsessed with something because of social media. But she's been serious enough about it that she deserves to be treated like an adult.", "I agree with everything except the smell point. Apparently fox smell is so putrid, people who go to buy them sometimes have the option of taking the smell home first; it’s so disgusting that most people cannot handle it.", "Or, you could be teaching her that sometimes you make mistakes in agreeing to something and now with more information, the plans have to change. \n\nBut whatever…**A FOX IS A WILD FKING ANIMAL AND NOT A FKING PET!**\n\nN T A for changing the agreement with new info, but YTA for agreeing to get a wild animal in the first place.", ">you would have no good reason to say no\n\nAs someone who has spent a lot of time around foxes, the good reason not to get one is exactly what OP said in their post; they smell HORRIBLE. The smell doesn't go away. You and your whole family will smell like fox piss no matter how clean you keep your house, or how many times you wash your clothes. The smell just doesn't go away completely. That's something they didn't know before they told their daughter that she could get the fox, and this new information is enough to say no to. \n\nThey would be TA just for saying yes in the first place without doing proper research, but they shouldn't be held to actually getting her the fox. They're a lot of hard work, and a 16 year old is likely to get bored and stop working as hard after the novelty wears off, and then OP is stuck taking care of the fox and stinking. Foxes are super cool, but they are not for everyone.", "She is the AH for even making this promise but there are a million reasons to say no. She needs to shut this down and accept the fallout. \n\nFoxes smell so much worse than you are expecting. There is no way to get their musk smell out once it’s in something. The daughter is also a couple of years shy of leaving for college. Who the fuck is going to take care of a fox while she is gone? Foxes aren’t pets. OP shouldn’t have ever made this promise but in no way should get actually get her daughter a pet fox", "How does being a furry even add anything to this topic? No where in this post does anyone mention being a furry.  Why bring it up when it's no relevant to the conversation.  \n\nAnd wtf is wrong with it..  omg someone wants to cosplay as a cartoon animal, the world is gonna end😐 I hate the stigma and judgement.", "Even though it’s not great behaviour to go back on a promise, and they shouldn’t have made it in the first place, it doesn’t look like OP is trying to manipulate their daughter. The post reads like they’re just not sure it’s such a good idea. Also couldn’t see any evidence of gaslighting- it’s not gaslighting to change your mind. OP shouldn’t have promised their daughter she could get a fox in the first place (partly because foxes are not suitable as pets anyway), and they will need to at least apologise and have a good honest discussion with her, but I think you’re going a bit far with the opinions, bae.", "Or set it free", "They are not just “a bit” stinky. Everything you own will permanently reek like a skunk sprayed you. You won’t even be able to wash your clothes enough to get that smell out. And they are extremely destructive even with proper enrichment. They are WILD ANIMALS. Not pets.", "Man, it comes up in the context of \"They make you marinate it in it before you can adopt one\", that's how bad it is. Assumptions like the one you made are why.", "YTA. The smell of fox urine will ruin her social life if it hasn't already. Also who's going to take care of it when she's in college? Not wanting that kind of stench on your property is perfectly normal. The part where you're the a hole is making a promise you can't keep.", "Has she asked at the place she's volunteering about having a fox as a pet? I'm sure they'd be against it. Foxes are wild animals & it would be cruel to keep it caged as a pet.", "I think you NEED to read this post:\n\nhttps://www.reddit.com/r/BestofRedditorUpdates/comments/t5yros/fox_poacher_forced_to_live_with_fox_urine_in_his/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2", "The first search result I found was an article indicating how horrible and awful it was to own foxes. They smell and will destroy anything in their path. First search result. You clearly didn't do any research.", "YYA in this situation for agreeing to a deal you made *only because* you didn't think you'd have to make good on it. Sit down with your daughter and explain to her what you did and why it was wrong to enter an agreement with this mindset. \n\n*Then* explain that you would be an even bigger asshole to actually let her get a pet fox. Foxes are wild animals that belong in the wild. The rescue she works with should agree. Explain that you were wrong to agree in the first place to allow a wild animal to be kept as a pet in your home. \n\nAnd then give her space to deal with all that. It's a lot to know you were right, did everything right, and still can't get what you want because it would be wrong. She'll be upset for a while but I think she'll eventually understand *as long as you take accountability for your own missteps here.*", "They can live outside. Also, if she's volunteering at the fox center, she's more surrounded and tending and cleaning means she's really immersed in the cloud of smell. An animal who, if a rescue, comes to your place will be one unfit for release into the wild.\n\nhttps://youtu.be/TDZfcZ2MR7c", "Take the AH on this one. You are the one going to be stuck with this animal when she moves in a few years. You are the one who will lose property value on your home, and take a hit on insurance.", "I think you make an excellent point. Maybe daughter can be a fox foster?? Is that a thing? Not have a fox as a pet, because that is awful, they are not domesticated. But fostering might be a compromise? I don't know. I'm spitballing here. \n\nOP is a massive AH for making a promise that they aren't going to keep after the daughter has met benchmarks. But OP is also an AH for ever considering a fox as a pet. \n\nCats self domesticated. They were like hey - humans have a steady supply of rodents nearby, befriend humans, get easy access to rodents and food scraps. Foxes have decided against this. I imagine a fox conclave somewhere, and a vote is held every century to remain undomesticated.", "Most of these influencers who rescue foxes have stickied posts talking about how foxes are not pets, they are a full time job. OP, please do some research on this, because she might not listen to you, but she may listen to them. JuniperFoxx is one who comes to mind. You can't have a pet fox and work full time, or even be a student. YTA for lying to her, but she absolutely should not get a pet fox.", "My main take away when I talked with someone who raises foxes is that they smelled like cat piss. Like their natural smell was cat pee. It's not just a musky scent (I actually don't mind ferrets or pet skunk smells) but literally smells like pee.", "Question for ya, I have a family of 5-6 foxes living in my backyard (not my pets) about 25-50 yards away from my house. I go over to the area quite often and I don't really notice a smell. Am I just nose blind to it or does the smell dissipate more outside? Just curious because I've always heard they smell horrible but I really don't notice.", "Maybe some types of foxes. I have trapped a dozen or more foxes to relocate. They weren't stinky. Angry and pissed off, yes. But stinky no. I had them in a cage in the car, no problem.", ">Most animal scent (especially mammals) doesn't come from their feces or urine, but musk.\n\nSo what does this \"musk\" smell like that's so bad, if it doesn't smell like poo or pee?", "A promise is just that, a promise. Mom is TAH. If she had done more than a few minutes research she would have realized that it was a bad idea. That, however, does not make it OK to go back on a promise.", "You're not wrong but who takes care of the fox when kid goes to college in a few years?", "Their urine still stinks to high heaven though, there was an older Reddit story where a lady nearly lost her job because of the smell from her fox.", "Except that study is in Russia, and getting one right now is... not feasible.", "I’ve met some of these silver foxes and usually they’re trying to domesticate me.", "There is only *one* species of actual domesticated fox (and we're using the term \"domesticated\" pretty loosely here; they have actually seen similar behaviours in *wild* foxes, so there is a debate about how successful the program really was) - and according to every source I found, they are *so* rare that you're very unlikely to ever see one outside of Russia, because they were domesticated as part of an experiment and *not* for sale purposes. Like you are more likely to see a seller *lying* about them being domesticated than you are to actually buy a domesticated fox.\n\nAnd again, they make it very clear that the term \"domesticated\" is being used *loosely*. We have no idea if it actually did anything of importance, because wild foxes and fur farm foxes can behave the exact same way. We don't even really have a clear definition of the term \"domestication\" because we've come to realise (partially *from* the fox experiment) that there really isn't a clear-cut line between \"wild\" and \"domesticated\" like we once thought. It is much more complicated than we believed it was.\n\nThey also say \"do not ever own a fox, even if it is actually domesticated. They are not good pets\". Which is exactly what the original claim was that you're responding to.\n\nSo basically, all the actual sources on this matter say that you're spreading dangerous misinformation. Idk where you're getting *your* information, because every page I found is saying it's wrong.", "thats just…not true. people breed lions and tigers to sell as pets, do you think that makes them so?", "People here love to exaggerate", "Oh, wait! Probably you can sponsor foxes at the center! That can be where she has her \"pet\"!", "In captivity, it is about as long as a dog of 10+ years.\n\nIn the wild, it is often a year or less because many foxes die in their first year to mange. The lucky ones make it to 3-4 or older and usually die in other ways (hit by car, predators, etc.).", "Right? I think OP got really lucky, and their kid doesn’t have to learn that they’re a shit with promises, because the time with people in the rescue group will (hopefully) dissuade. OP can and should meet with someone there and confirm that.", "[removed]", "Same.\n\nI assume stubbornness or believing she's an exception.", "Yes. It was wrong of OP to promise a pet fox without knowing about how horrible owning a fox is.", "OP himself says:\n\n>I sort of expected she'd be deterred by the reality of it but it doesn't seem like it. \n\nThis really gives me the impression that he did not think she would commit to volunteering, and that if she did, she would've lost enthusiasm and ditched the idea.", "there's a massive difference between teenage boy smell and fox smell lmao", "I've seen a documentary on it, it's still a work in progress but so far the results have been good.\n\nThat said, the foxes OP is talking about are almost certainly from the wild.", "I’ve heard accounts of fox musk being used as a punishment for fox hunting, often as an alternative to jail time. Open vials of it are left around the house for up to a year. Apparently, most people start wishing they’d gone to jail instead after a week or so.", "It’s not just the urine, they have a scent gland under the tail that releases a strong smell very similar to a skunk. It’s awful and so so strong, it gets everywhere and you can’t get rid of it.", "Have you ever seen Labyrinth?  Having a fox in the neighborhood is like having the bog of eternal stench in your backyard.", ">Sometimes you get new information \n\nTo those people's credit, this really shouldn't have come as \"new\" information.  \n\nThe answer to \"should I keep this wild animal as a pet?\" is always going to be no, unless you happen to live on a 5+ acre property that you can essentially treat as a nature sanctuary.", "USA USA USA!", "Read the whole comment thread before commenting. You might actually get the whole story then. You", "Will she be attending college? Does your daughter have a long term plan for the Fox when she moves out? Honestly YTA for making the promise in the first place but you’d be more the asshole for not being able to give the animal a good home.", "Its not a great idea but if you have to grey foxes are better manageable then the orange ones, because of that some places you can only legally have they grey ones as a pet and not the orange ones, think they smell little less too.", "Of course they know the law differs that's why they asked instead of just telling you it probably wasn't legal. Snarky McSnarkerson.", "I have a dog who likes rolling in it and can confirm it’s vile!", "A couple of rescues I know make people who want to adopt take home a vial of fox urine. They have to leave it in the house, uncapped, for a couple of days and decide if they REALLY REALLY want that smell to hang around. Apparently a lot of people do back out. (And I know fox poo REEKS because my dog shoulder dropped into some once and got in one good roll. It took a LOT of work to get that stink out.)", "To add, from what I understand, foxes can’t really be potty trained and will go whenever or where ever. I’ve followed juniperfoxx on IG for several years now and she has been very transparent that while they look cute and fun they do NOT make good pets. They will also bite, hard. The entire property will have this stench. And an enclosure will need to be built by a hired professional. It’s NOT like fencing a yard in for a dog. Fencing has to go underground because they dig. I would encourage OP to check out her page and her Q&A tab. They are adorable don’t get me wrong, but sound like hell to live with. A “domesticated” fox is not the same as a domesticated dog.", "I think OP is lying about even googling it. No one with an ounce of reading comprehension or research skills could misinterpret these warnings as being “a bit stinky.” It’s basically all that comes up, emphatically, in no uncertain terms, no matter how you google it.", "Haha, unfortunately I'm not an expert (I just have a very passionate friend who cares about animals). I think fostering sounds good...in the future, when the daughter hopefully pursues a veterinary/animal related degree, since she's shown so much passion for this area.\n\nPeople really need to stop normalising foxes as pets. They're cute, but they're also wildlife, and wildlife should be respected.", "\"Fostering\" can only be taken on by a wildlife rehabber (like the place she is volunteering) and ideally would be with a view to releasing them. Even fur farm foxes who have never lived wild are generally housed in larger compounds with access to vast amounts of space. Juniper the Fox is a good education resource:\n\n[https://www.juniperfoxx.com/](https://www.juniperfoxx.com/)\n\nA teenage girl will never be the right fit unless it's volunteering - they will cost thousands of pounds in vet bills, they're hard work, they do have a very strong odour and can be pretty antisocial. OP is just crazy for even considering this! One day week volunteering for three weeks is such a small amount it's wild!", "The purpose of fostering is to be a halfway home for strays before they get adopted. Wild animals don't really have an equivalent, unless they need 24/7 care/rehab. Wild animals are either rehabed and released, or are incompatible with release and live in a sanctuary or shelter.\n\nShe's literally working with foxes at a shelter - I don't understand how dense the daughter can be to be working with them and not understanding that they aren't house pets.\n\nObviously OP is TA for their promise made in bad faith, but the daughter cannot seriously think getting a pet with such strict requirements, right before college, is a good idea.\n\nI feel bad for the kid, don't get me wrong. I was that kid that wanted every pet animal under the sun and begged my parents. We didn't have the lifestyle or resources to take care of pets when I lived with them. And then as an adult, made plans to be able to provide a home and life suitable for my two pet cats and I have plans for them if my partner and I break up, if we move, if we leave the country, etc.\n\nIt's just not feasible for a 16 year old to have a pet unless their parent is willing to care for it too. OP vocally has not been in this case. They were just too cowardly to put their foot down and tell their kid no, and instead made a bad faith promise and now they will suck no matter what they do.", "There actually are domesticated foxes you can keep as pets. There was a breeding program that domesticated them and they even gained more domesticated animal appearances. But they are not something the average person can afford or even handle.\n\nBut keeping wild foxes is not what she thinks it is. And wild animals are not pets and never will be. It's amazing the daughter wants to interact with foxes and she found a way to do that in a constructive and positive way through volunteering. But that should be the extent of it for a teenager. She should be sat down and taught that keeping wild animal like a fox should not be a aspiration. Wild animals belong in the wild and only unfortunate circumstance would force them to stay in a cage in a backyard. If she wants to go down that route it will be long. She can live the life of rehabbing and fostering wildlife. But that is not pet ownership and she needs to understand the difference between keeping pets and keeping and rehabilitating wildlife.", ">Maybe daughter can be a fox foster??\n\nIf the issue is the smell, I don't think it matters whether the fox is there as a pet or as a foster, unfortunately.", "A fostered fox is still going to be stinky and in/around the house, so it doesn't really solve the problem.", "It clears out outside much more. Better air circulation, and less extremely porous surfaces(fabric/skin). They're also spreading that smell over a much larger area because wild fox territory is much larger than a human home/yard But if you smell the den itself you'll notice. It's why they belong outside In the wild.", "You'll regret that choice if they ever pee while in your car. That smell is absolutely FOUL.", "There are a lot of bad smells that aren't either of those things.", "From what I've experienced with working around various foxes - the musk varies from strong stale urine to I recall an artic fox that smelled exactly like a common skunk.\n\nIt's not pleasant at all.", "That’s an extremely valid concern and just goes to show that the mom is in fact TA. Because she spent 5 mins on google then made a promise she can’t keep. \n\nI just wanted to point out about the domesticated foxes because they’re so awesome!", "Sometimes people have pets AND go to college, and sometimes people don’t go to college at all.", "My dad said the same thing about my pets and I took them with me. If she’s determined she’ll find away. I would’ve never left my pets for college. It wasn’t easy but I would never change it", "domestic foxes are not just genetically different they are also phenotypically different and do not look like wild foxes, not only that but they are also not of the species found in north america so it would be hard to pass off north american foxes as the red fox is bigger, behaviorally different and does not look at all like domestic silver foxes.\n\nthe russian experiment itself states the physical differences as\n> floppy ears, short, curly tails, juvenilized facial and body features, reduced stress hormone levels, mottled fur, and relatively long reproductive seasons.\n[here](https://evolution-outreach.biomedcentral.com/articles/10.1186/s12052-018-0090-x)\n\nfurthermore these traits were not present in the fox population when they began nor were the behavioral differences \n\n> Lee Alan Dugatkin, a behavioral ecologist at the University of Louisville in Kentucky who wrote a book on the Russian foxes with Trut (SN: 4/29/17). “It’s not as if those things were there when they got the foxes,” he says. “It’s extraordinarily unlikely that there was kind of hidden genetic variation for these traits.”\n\nThe majority of scientists agree that the foxes are very much entirely genetically different and no study has found similar traits in wild foxes. The case study you are referencing found similar traits in fur farm foxes that had been selectively bred since 1880, the consensus is that these foxes were likely inadvertently domesticated as domesticated non aggressive foxes have better fur and are easier to slaughter en masse. the only debate ongoing is that the scientist claimed that the mechanism of domestication, “domestication syndrome” was a shared traits amongst all mammals and the timeline may be longer than the 6-10 generations the study found. \n\nalso as to how the rest of he world got the foxes they sold them. you can still to this day buy a fox directly from them for about 8,000 USD.\n\nit’s cheaper by a little bit to buy a US bred one, but US breeding operations still obtained their foxes from the original and as far as i’m aware ongoing russian experiment.\n\nThey are not great pets sure, but to say they aren’t pets at all is to say these animals can acclimate and thrive in the wild. they simply cannot and will die i have witnessed it first hand.", "Exactly, its not good but it is materially different from & better than making a promise you never intend to keep.", "Huh, interesting. Is \"fox musk\" different than their urine?", "It definitely would. We once looked at a house where the owners and their children were into horses and every wall was covered in awards. The house absolutely stunk even though they never actually brought a horse into it.", "Watch some of the videos from Save a fox. She's quite honest about the smell.", "You won’t even be able to show your home until you get rid of the fox or else you will lose a massive amount off the sale price.", "There are compounds in the urine that get in the air of their marked territory. That's what makes the smell so strong and persistent.\n\nYou spend enough time near a fox, and you *will* stink.", "And when it rain, it spreads out over the yard. I", "She's only volunteered there 3 times according to OP (and who knows how long and involved those shifts are so far), so it's probably still sparkly and fun. She hasn't been hit with the reality of solo care of a captive game animal.", "I put a tarp down under the trap. I stopped trapping them after I painted a marker on a couple of them. Even released 25 miles away the little buggers found their way home. I had to put up an electric fence for the bears but it keeps the foxes out too.", "I assumed it was a dad. Your post made me go back up and read and there's no mention of sex of parent. It's so interesting how our brains ascribe gender even when it's not mentioned.", "You are vastly the exception. \n\nAlso, did you take an exotic pet with *extremely* specific needs with you to college?", "I’m not sure if it’s actually called “musk”, but they definitely have scent glands separate from urine. I tried googling to find what it’s called, and found [this](https://theconversation.com/amp/fox-scents-are-so-potent-they-can-force-a-building-evacuation-understanding-them-may-save-our-wildlife-159337) article that mentions a leaking sample of “fox scent” led to a building being evacuated.", "Then he shouldn’t have promised her", "> Interesting. What does it smell like exactly? \n             \nhttps://www.amazon.com/Predator-Pee-100-Fox-Urine/dp/B01AL6Y8AU?tag=namespacebran425-20           \n            \nKnock yourself out and you don't even need to be near a fox.", "From what people here in comments seem to say it’s both really, really, really bad and incredibly hard to get rid of the smell", "I thought horse smell was considered almost pleasant to many people lol. What did the house smell like?", "Sounds like she’s an exception too. What teen do you know that would jump through all of those hoops and not give up? And they weren’t exotic but one was very much special needs and required extensive care. The vets couldn’t believe he lived as long as he did. But I loved him until the day he passed.", "Sometimes it's better to break a promise and deal with the fallout than to follow through on something that is stupid and irresponsible, especially when an innocent wild animal is involved.", "It is what it is. Ofc he shouldn’t have.", "Horse smell and stable smell are a lot different.", "Should take a day if you're using an enzymatic cleaner.", "I have horses, and did as a teen…they require extensive, specialized care and very specific living conditions-much like a fox. \n\nI didn’t take them with me to college. That doesn’t mean I didn’t/don’t love them…it was just impossible.", "he shouldn’t have made the promise in the first place.", "Depends on how bad it is, the floor AND subfloor type, and length of time.\n\nHad a friend who had a mental breakdown and their cats pissed everywhere in their home. \n\nThey ended up having to gut the floors and subflooring (and even some of the drywall) to finally get rid of the smell.", "I didn't say he should've! He is TA for that. But he also shouldn't keep the promise.", "And he’s an asshole for going back on his word.", "you're just going in circles man. we all agree he shouldn't have promised her this and that he is an AH. but also he shouldn't honor his dumbass promise.", "There was a post awhile ago about a manager that wanted to fire an employee bc she got a pet fox. The worker started to smell. Schedule became inconsistent and unreliable bc they were constantly having to go and check on the animal. Etc. having a pet fox will have a major affect on your lives. Foxes are not pets. The AH thing here is you giving your daughter a goal you didn’t want to follow through with. \n\nI’ll see if I can find the post I’m referring to and link it.\nEdit: https://www.reddit.com/r/AmItheAsshole/comments/ndydr4/aita_for_threatening_to_terminate_an_employee_if/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1", "YTA for promising a fox in the first place. Foxes are wild animals not cute dogs. Dogs have been bred into domesticity for thousands of years. Foxes have not been bred at all.\n\n**Do. Not. Get. Her. A. Fox.**", "YTA.\n\nSimply for how much of a naive nitwit you've been since the beginning. Foxes are not pets!!! \n\nGo visit a zoo or that wildlife rescue and have a good look at that fox enclosure. Foxes can jump and dig! They are surprisingly strong and they are very, very smart. You'd need to build a high security prison in your backyard. The cost of building that alone will be staggering!\n\nAnd have you looked at the diet? Do you think you can just go to a pet store and buy cans of fox food??? \n\nWhat happens in two years when your daughter moves out? Will she be able to take the fox with her? Or are you going to dump that fox on the rescue like every other irresponsible nitwit that thinks exotic pets are sooooo coooool.\n\nAlso, there's no such thing as a domesticated fox. They are cute and cuddly when they are small, but then they grow up and they turn feral. All of them. Including the \"tame\" silver foxes.\n\nIt's time for you to have an honest and serious discussion with your daughter. But please don't get her another pet as consolation prize. Get her a fox sponsorship at the rescue. Or a plushy.", "YTA for making a promise you didn't intend to keep.  You also failed to check your local laws to make sure it was *legal* in your area to have a fox as a pet.  In most places they are considered a wild animal and it is *illegal* to keep them as a pet.\n\nLook up the laws to see if it is illegal to have a pet fox and then explain to your daughter that you messed up and shouldn't have made that promise because you didn't realize having a pet fox is actually illegal.", "You made a stupid promise.  Foxes are not pets and any rescue center would of told your daughter that. nta for not letting her get it, but be mindful what you promise.", "Foxes are not meant to be pets.  Let me say that again. Foxes are not meant to be pets.  \n\nIt is great that she is volunteering and you should encourage her to continue. But you need to explain to her that foxes are not pets and she will have to fulfill her pet fox fantasy by volunteering with them.", "Hey might want to edit your comment, specifically the second paragraph.  \n\n\nYou said “YWNBTA for allowing her to get a fox.” But then the rest of the paragraph makes it clear you mean “YWNBTA for NOT allowing her to get a fox.”", "[Russian Domesticated Foxes](https://www.jabcecc.org/rdf)\n\nI agree that YTA. I’m not trying to be contrary but if you had done a modicum of research before telling your daughter the terms of your agreement, you would have known they are not practical pets.", "I'm curious if OP even looked into whether it was possible/legal to have a pet fox in their area. Where would you even get one? Unless someone is backyard breeding them which is **super** unethical, most foxes I've seen on social media are either rescues from the fur trade (who often come with health or behavioral issues from their mistreatment) or wild foxes who couldn't be released back into the wild. Animals in both of those scenarios go to sanctuaries/professionals, they aren't given out at backyard pets.", "OP please pay attention to this comment!!!!", "I’m in my 50s with a lot of experience in the world. I assure you, I’m not a kid.\n\nI think he’s an asshole for this promise. \n\nI also think he’s got some maturity issues himself if he thinks it’s ok to make promises like this b/c his kid doesn’t know her own mind/won’t be able to meet the conditions.\n\nI’ve seen plenty of parents do that. Every single one of them was either immature, selfish, or stupid. Sometimes all three.\n\nNow maybe this isn’t typical for OP band this was a one-time blip. Let’s hope so.\n\nIt’s going to be a hard lesson to learn.\n\nAnd his daughter actually won’t forget it. \n\nHe’s NTA for not wanting a fox. He  is TA for makign a promise to her thinking he wouldn’t have to hold up his end. That requires some real self-reflection on his end.", "I'm sorry that you think making a mistake makes you an arsehole? Sometimes we don't consider all possibilities and think something is a good idea, turning around and saying \"perhaps not\" is not arsehole behaviour.", "Yeah, OP says they did research, but I kind of doubt it if they were surprised by the smell. The first thing you find out about when reading/watching *anything* about keeping foxes is they smell *fucking terrible*.", "Before she goes to volunteer again I would call the place up, and would ask if they would be willing to educate her daughter. If they know her end game is owning a fox, then maybe they can help prevent her from ever wanting one.", "I'm guessing they're talking about domestic foxes? They've been in breeding programs for decades and would not survive in the wild s", "I agree with this and also LOLed at the characterization of the parent being a \"massive AH\" and also damaging their relationship forever for lying. Oy. Hyperbole much?\n\nI agree the parent should have likely done more than 24 hours research and probably was hedging bets, assuming the daughter would not follow through with all of the conditions to get a fox. But you're right, OP did get more information in the way of overwhelming stench and that changed the agreement. \n\nPS- This seems like a great kid. Hardworking, industrious, takes initiative, demonstrates caring. I don't know, seems like probably OP had some hand in that? \n\nI really think NAH. \n\nOP will have to have a hard conversation with kid and will need to apologize for not fully thinking it through as they should have, and then OP and kid will need to collaborate on some sort of solution that works for their whole family. Teachable moment. Parents F up and they can apologize when they do. Her dedication to bringing this to fruition is remarkable. Given the new info, we can't have a fox on our property. How can we fix it?", "The domesticated silver foxes have been (arguably) domesticated, but are not generally kept as pets. They’re mostly still used in research projects, as far as I’m aware.", "I agree with this. \n\nOP did initially seem genuinely willing to get a fox, so it's not like they actively lied; they just didn't realise the full impact it would have, and changed their mind. That's a normal thing that can happen in all sorts of situations. On top of that, it seems pretty clear that foxes are not meant to be pets, so getting one would make both OP and their daughter TA.\n\nBringing it up with the daughter, apologising for making a promise OP couldn't keep, congratulating her on her commitment and coming to an agreement about getting a different pet or sponsoring a fox at the centre would be a good way of handling this. If the daughter wants to keep going, OP should let her (think about instituting a mandatory post-volunteering laundry and shower routing) and in all likelihood, the daughter will realise over time that it's a good thing she didn't get the pet she wanted--either because of the smell or because she learns that foxes are wild animals (do NOT say \"I told you so\"!).", "Oh, the girl needs a pet. She deserves it. A fox? Idkkkkkk", "I would probably call the wildlife rescue to see what they may say about people keeping foxes as pets before telling her to ask them. For all we know, she is working with other volunteers who would have no problem having a fox as a pet, even if the people that actually run the place may disagree.", "The information isn’t new! Other than that, yeah. But OP should have to reckon with the fact that they tried to make the daughter tire herself out in pursuit of fox instead of actually parenting with the boundary of “no, we can’t get a fox.”", "Just because legally you can do something it doesn’t mean you should, what on earth possessed you to say yes to begin with? YTA", "You also should not foster foxes at your own home or in your own yard because they STINK!!!", ">Maybe daughter can be a fox foster?? \n\nin her own home, where she can deal with the stench\n\nYTA OP for saying yes before doing proper reading, but not for not letting her get a fox", "The daughter met practically NO benchmarks beyond can we build an enclosure in the yard. She hasn’t identified anything regarding cost, feeding, type and cost of vet care, lifespan of the animal, behaviour, etc. She’s simply said I’ll work part time to earn $200-$300 and build an enclosure. Wildlife needs more than a friggin cage to live in and there are dogs that easily cost more than $200-$300 a month.", "From what I know about foxes, this is only sort of true. Foxes are more social than cats, cats also didn't self-domesticate. They were domesticated by humans at two separate points in history, which is why domesticated cats are social (even what we call \"ferals\" are social and form colonies), but their ancestors the African Wildcats are NOT in the slightest and cannot even share territory with each other. We didn't put a ton of work into it, but we did feed and house cats intentionally to keep rodents out of our crops/storehouses/pantries. Cats aren't even universally agreed to be domesticated, and we've been beside them for over 2,000 years! Part of why foxes smell so damn bad is because they're not concerned with being hunted by one another like cats are, but they are indeed creatures of solitude, outside of being raised or raising their own young. However, I have been approached by hungry foxes without any coaxing, their nervousness more akin to a stray dog than a cat, never approaching the eagerness of a raccoon. They're comfortable approaching human territories, but as they're usually stealing or eating a pet, they have no reason to assume good relations between themselves and humans. There's a lot to suggest, including actual work done with foxes, that they'd be easier to domesticate than cats... By a lot, actually. When it comes to domestication, the question really isn't \"can we\" but \"should we,\" and I'm not sure there's a compelling argument against domesticating any animal we've already destroyed most of the habitats for, especially when there's a lot to suggest it can be a positive experience all around.\n\n**Now do I think OP is in a position to adopt a fox for her teenager? Fuck no.** But there's a debate to be had about it being bad in general. The first mfer to domesticate a wolf probably got side-eye real hard, especially since domesticated dogs are more closely related to bears than wolves, but half the country has one in their house now.", "Fox fostering is definitely a thing in the UK for sure, my friend’s neighbours do it", "Foxes keep their dens pretty neat. And store their food elsewhere.\n\nThere’s a stupid number of urban foxes, but you can go your whole life without even seeing one or noticing a den because they are just that good at existing.", "no selective breeding to the point of human reliance and inability to thrive in the wild, as well as the behavioral tendencies to seek and increased levels of serotonin due to human interaction is what makes foxes domesticated.\n\nplenty of animals we keep as pets aren’t actually domesticated, like exotic parrots. this is not the case with domestic silver foxes as they are very much behaviorally, genetically , and phenotypically different and cannot survive on their own.\n\nbasically lions and tigers aren’t SELECTIVELY bred for companionship they are purely bred for exhibition and conservation and even a privately bred lion can thrive in the wild as it is genetically and behaviorally identical to a wild lion.", "There is no such thing as a pet lion or tiger. There are lions and tigers being kept inappropriately that are likely to kill someone one day.", "There’s a story here I’ve read where the OP tried hunting foxes in the wild which is illegal and he was caught. It was either jail time in prison or house arrest for 3 weeks with a jar of fox piss in every room of his house. He chose the latter thinking he can withstand the piss smell but after 3 weeks he wished he chose the prison instead lol", "They definitely lied. They said they expected their conditions to \"deter\" her from wanting one. Basically trying to be the good guy and then saying \"I told you so\".", "Sheesh! \n\nI feel like OP shouldn’t have made that promise but I do not blame them for not wanting to deal with the stench or the upkeep of a fox for when the daughter is gone. So maybe they need to revisit the conversation and hopefully the daughter will come around.", "Hoping he wont have to follow through on a promise isnt the same as not intending to follow through", "> think fostering sounds good...in the future, when the daughter hopefully pursues a veterinary/animal related degree, since she's shown so much passion for this area.\n\nAnd when she is settled down and in a permanent home.", "From what I understand they also spray everywhere and have a terrible smell", "> She's literally working with foxes at a shelter - I don't understand how dense the daughter can be to be working with them and not understanding that they aren't house pets.\n\nThe fact that she sees this volunteering as a waste of time if she doesn’t get the Fox frankly solidified she’s the last person who should be taking care of one as a pet. That poor thing is definitely gonna end in one of those rescues the moment she moves on to the next tiktok trend.", "There are social media accounts on Tiktok and Instagram that glamorize owning wild animals as pets. The 15 second videos make having a pet fox look fun and easy. The people posting the videos also get a lot of praise and attention. would assume the daughter has been heavily influenced by that type of content.", "Exactly because they STINK to high heaven!", "They are not fully domesticated and a lot of the claims around them being \"domesticated\" are based on playing fast and loose with that term. Domestication is a very, very long process, and the foxes that were part of that specific breeding program do not represent the majority of \"pet foxes\" on the market, fur farm rescues, or wild foxes that can't be rehabbed. Those breeding program foxes are certainly *tamer*, but they're WAY off from being a domesticated species.", "They're not really domesticated and they're not meant to be pets.", "Interesting.\n\nDo they take the food & store it or eat it right then? We have a large pond that we fish from & we just bring the fish over by their den at night & they have been taking it. \n\nIt's a wooded area that we live in & we do see them all the time. They do not seem to be scared of us at all as they will come out & run around while we are outside.", "You cannot have a fox in a dorm room or an apartment or frankly anywhere you rent. Is she gonna manage to buy a house while in college?", "It absolutely would. Foxes mark EVERYTHING. On top of that they’re destructive little jerks who will burrow into, chew, scratch, and tear apart anything they can find. They’re not easy to keep stimulated, even the ‘domesticated’ foxes that the daughter is undoubtedly talking about. They’re bred like dogs to bring out their desirable traits like more relaxed tails, less aggression towards people, and the ability to bond with a human. Started in Russia, to no one’s surprise. \n\nMuch like Savannah cats, it’s not an exact science and even several generations in a bred fox will still have destructive traits and the smell of their urine is not something that can be bred out, nor the need to mark. You would likely have to rip out baseboards, carpet, strip paint on your walls, completely renovate a home with a fox and even then the smell might not completely go away. It’s like tobacco; it sinks completely into any even mildly porous surface it can and stays there. \n\nOne of the first tests that any fox breeder will have a potential buyer go through is leaving opened bottles of fox urine around their home for two weeks or so to see if they can stand the smell. Fox breeders say it’s an incredibly effective deterrent, most people like OP do not realize how truly pungent it is.", "Will lower the value of the home.\n\nWill piss off any neighbors within smelling distance.\n\nWill be inflicted upon neighbors, delivery and service people who come to the home, and passersby.\n\nMight be illegal where OP lives. Or at least against code.\n\nMaybe OP should do some research. He may find that he can’t legally have foxes where he lives. \n\nHe needs to look into his state (assuming USA) or province (if other country) law on having wild animals.  Then he needs to look at local zoning laws.\n\nUnless he’s in a state that allows people to have foxes without a wildlife rehab license AND his house is somewhere without strong zoning laws, he’s likely not legally allowed to do this.\n\nEven if it’s legal where he lives, doesn’t mean his neighbors can’t sue him for the nuisance of the smell. \n\nI live in an area with little to no zoning. This would still not be legal here. \n\nThat may be his out. He can’t legally allow her to do it.", "As someone involved in flooring replacement, I had the ... Experience of restoration after a red fox owner moved out. We were not able to clean it and tore the floor out to the support beams.", "It's not just that they *can't* be potty trained, it's that they *enjoy* finding new & entertaining places to mark/defecate. They'll drop a turd through the opening of a beer bottle if they can work out a way to get their arsehole positioned just right.\n\nFamily friends were building a house that was built into the side of a hill. As such, the exhaust/intake pipes for their high efficiency furnace poked out just above ground level. The elbow on the intake is supposed to point down, but I guess it wasn't properly installed, and a fox started pooing right into it. It was absolutely foul. Delayed their move-in date by two months because the smell seeped into the all the unpainted drywall on one level.", "Their musk is airborne. You can't escape it. The odour will permeate your clothing just by being in the area for an extended period of time.", "Would you not touch your pet? You touch it = smell.\n\n\nAlso, their yard would still be extremely stinky to the point where it would not just bother their family but everyone living near them as well.", "A permanent home in this economy? The daughter might be in her 30s or 40s by the time that happens", ">The fact that she sees this volunteering as a waste of time if she doesn’t get the Fox\n\nShe never said that, though. OP just says he thinks she'll feel like she did a lot of work for nothing, which also includes all the research and planning of the enclosure. Maybe she'll continue volunteering even if she doesn't get a fox. We don't know.", "There are really domesticated foxes that do make good pets. Not great pets. It's still very early in their domestication. Look up the Russian breeding program. Very interesting to see the link in coat patterns and domestication.", "Stereotypes lead our brain down the path of things like this. We see something like this and go \"oh one parent isn't being cool. It's probably mom.\" Because the stereotype of a dad will just be like \"fuck yeah, let's get a fox that sounds dope.\" \n\nBut yeah. These stereotypes we ingrain ourselves with play a huge part in our own unconscious, cognitive biases.", "OP needs to talk to the head of the rescue. The daughter needs a wake up call, and probably more afternoons at the rescue doing the dirty work.", "And fox urine is meant to smell like a skunk mixed with ammonia from what I read. They can’t be trained to use a litter box and will insist on marking their territory. they are supposed to get more bad tempered as they age and there are certain gross things you need to feed them because if they don’t get enough of this taurine thing they can go blind.", "YTA for making the promise in the first place. Foxes are WILDLIFE NOT PETS!\n\nDid you even check your local bylaws to see if it would even be allowed? Or with your homeowners insurance? What if a neighbour’s cat gets killed by the fox? Or a neighborhood child gets bitten? The likelihood you’d get side is practically a certainty. Not to mention you’ll probably need rabies injections if you get bitten, which aren’t pleasant or cheap (if you don’t have free health care).\n\nEven if you were seriously going to allow this you gave absolutely no consideration to the vet care an animal like this would need or even where to get such care. \n\nRegular vets don’t even deal with pets like rabbits and weasels/ferrets and you need to find vets that specialize in those kinds of pets as most usually only deal with dogs and cats. So if some kind of medical treatment is necessary do you even know where to go to get it and how much it would cost?\n\nWere you planning to just feed it dog kibble? Do you have the room and storage necessary to safely prepare the kind of food it would need without having to worry about cross contamination of your own food or food prep area?\n\nYour promise to your daughter was so thoughtless that it’s staggering how little you thought beyond “she’s probably flake out”. You and people like you are what’s contributing to the industry of keeping wild animals as pets and considering yourself “animal lovers”. \n\nYTA. YTA. YTA. YTA. And shame on you.", "YTA not only for making an empty promise but for allowing her to think this is something feasible or appropriate. Wild animals aren’t pets and as a zookeeper the first thing I do when people say they want one is let them into our fox building where they are very quickly deterred by the smell. Make a sincere apology to your daughter and explain to her that even once she is on her own and can purchase a wild animal that she absolutely should NOT. It’s wild to me that the staff at the rescue have not drilled it into her that they are not pets", "The first post I saw of hers was a video of when juniper dug herself through the center of her owners mattresses. She made the comment that it wasn't even the first time.\n\nWhy would anyone not involved with rehabs even consider a fox.. ESPECIALLY for their damn teenager... Smdh", "I’m wondering if where she goes is reputable, or if she’s hiding her true goal from them. I also wonder if they had her get rabies preexposure shots…my licensing process was not something I could have done at 16.", "Or that sometimes people mean well but find out that the thing they’ve agreed to do is beyond their capability. Like if I promise my husband we can get a dog and then I develop an allergy to dogs, we aren’t going  to get a dog. \n\nThe parent  experienced how awful the fox smell is and realized they won’t be able to handle this smell permanently in their home. \n\nIt’s disappointing for the child, but it’s still NAH", "Foxes absolutely reek and make everything they are near stink too. It's just part of being a fox and there's a very good reason no one keeps them as pets.", "I would think the rescue place would have explained this to her.  Maybe OP should contact the rescue shelter and explain what's going on and get their opinion.", "Perhaps go with her to the rescue and also discuss it with them. Hopefully, if they are an ethical rescue, they will also be against keeping them as pets?", "The promise was made assuming the kid would back out on her own. Mom never intended to follow through with her promise thus making it a lie.", "The Russian foxes are not domesticated - domestication takes literally thousands of years and that project originated in the 60's. Captive bred fur farm foxes (which is where the Russian fox line originated from) may have some different phenotypes than wild foxes (different coat colors, thicker coats, etc) and may be more readily tamed or comfortable around humans, but they are *not* domesticated and should be considered wild animals.", "Those “domesticated” foxes aren’t anywhere near domesticated in the sense that dogs are.  They’re just sorta tame.  They still have a ton of wild instincts, and still stink like hell.  They really aren’t pets and shouldn’t be characterized as such", "This is a 16 year old. They are almost college bound and are far too old to think that foxes are a suitable pet.", "My mother barely handled bearded dragon shits. I can’t imagine fox shits. That’s gonna be rank", "She spent a day doing research but then it didn't came up to her mind. Please she thought her daughter will let go of that idea but when she realized it was serious now she's tryna act like the responsible parent. Yup of that ain't manipulative behavior idk what it is.", "Like musk. Rot doesn't smell like either of those things, either, and it still stinks. Wide world of smell out there.", "This will definitely have a negative impact on their relationship. This seems to be a huge deal for her, She made a promise, and is reneging on it. At the very least, she may have a hard time trusting her in the future.", "Man if I were the teenager in that situation that would offend me more than a flat no in the first place would’ve lmao. Just a shoddy attempt at placation and a terrible compromise.", "To back this up, to help deter people stealing trees for Christmas, some places spray them with fox urine.  It freezes in the cold air, but then a thief brings it inside the house, it warms up and, well...", "I used to live near a university, and every year dumb lazy college kids would come chop down small decorative pines from around the school grounds/town and take them home. School/city retaliated by spraying the trees with fox urine. A good freeze and cold weather made the smell very faint. That is until you bring it inside your nice heated apartment. Good luck getting rid of that smell from your carpets. Nipped that issue in just a couple of years.", "The scent is airborne. It will cling to you. And your neighbours will have to deal with it.", "Indeed, that’s kind of where I was going. It’s taken the Russians 40+ generations of heavily selective breeding to get foxes that are anywhere near domesticated enough to keep as a pet. No random wild fox is going to work well as one.", "They don't let children foster foxes unless they're the child of a rehab worker vetted for many years. Fostering is a part of rehab and not needed. Otherwise it's just a fur trade or breeder pet that'll mess up someone's home.", "Foxes will destroy a normal house with their smell.  To “foster” one the wildlife rehab places I’ve worked with will tell volunteers to go to the tractor supply store and buy some fox urine…bring it home and pour it into a glass bowl in your house.  That usually weeds out 99% of the candidates, it is super pungent.", "She actually needs to use the resource of the shelter and speak to the folks there about it.  I'm certain they have strong opinions about it and would easily dissuade her!", ">if the animal was created by humans through a breeding program for human companionship regardless of its care needs, it’s a pet.\n\nof course i was referring to this part of your original comment. people do breed them to sell as pets and they are obviously not.", "It's been a while ago and I couldn't find a link, but there was a post about a guy who agreed to live with a bottle of fox scent in his house for a month. I don't remember the circumstances, but he had a choice and chose that as the least offensive of the options. Or so he thought, he posted after 2 days the scent was on everything and he couldn't escape it. Said it never got better. It was a wild story.", "I want a skunk, but know I can’t have a skunk, still want one so badly.  I want an alligator, monkey, raccoon, owl, and so much other cute critters.  Unfortunately, I know it is not fair to the animal or feasible, especially in a state that doesn’t allow any of them, besides maybe monkeys (but their needs are to extensive, for where we live).", "It’s disturbing how a 16 year old, who will be a full time college student in two years and be working part or full time, thinks having a pet fox will be fun.  This is what a Sox year old thinks is fun when the see it on Tik Tok.  But a 16 year old? So many red flags.", "And everybody who has ever seen a fox in a zoo or similar knows that there is hardly a sader sight. Foxes are highly intelligent animals that hate to be in an enclosure. To be happy they need to build and rebuild their homes with sometimes very long and complicated entrances and rescue tunnels, and to have the possibility to make long walks through their big territories.\n\nWe have a little dog of an not very well known breed, and a lot of people say its face is quite similar to that of a black fox. \n\nSo maybe look out for a \"Mudi\", along with helping out in this station or maybe volunteering for fostering a fox from time to time.\n\nNAH here. You love your daughter and as a vet and on Tiktok myself I can easily understand how fascinating a fox is. But tell your daughter that after more reading and thinking you came to the conclusion that keeping foxes as pets does not do them a favour at all, and you changed your mind about it out of pity for the foxes. The stench that would be hard to bear for everyone that visits your home  is a valid point, too. \n\nMaybe next time some problem like this occurs, better not promise anything, but take her to someone who is willing to share a first-hand-experience in this field and is able to show both of you what to expect! \n\nGood luck!", "They are really domesticated but it is still early in domestication process so of course they aren't going to be like a dog. And even if they were they are more of a mix between dogs and cats. That is why I never said they make great pets. They make good-ish pets. But they are domesticated. A cow is domesticated but they don't make great house pets either.  Fur farm foxes are different from the domesticated foxes sold as pets.  And they are also different from wild foxes. It's a level of domestication but it's still domestication. Domestication is a spectrum. Not a switch.", "They are domesticated. That's a fact. If you want to discuss if they should be domesticated then that is a discussion we can have, but the fact that they are is a box that has already been opened.", "Absolutely, they would be perfect. He still needs to accept that he messed up promising her a fox. But he also needs to show her that her request is unreasonable. What child doesn't want a cool animal like a fox as a pet? The shelter runners and long-time volunteers are the perfect people to educate her on that.", "Foxes are too dang smart. We also had to do electric fencing to keep them out of my family's ducks.", "I can believe it. We once walked our GSD past a house on our street and she started going BALLISTIC at the smell of some blankets in their driveway. I asked what they were for. They were their horse blankets they were hosing off. We couldn’t smell anything but the dog sure could.", "I desperately wanted a sloth, I knew it was unlikely to happen but researched it anyway. \n\nSloths are definitely not meant to be kept as pets! \n\nIn the 70s and 80s people had lots of pets that were unsuitable and just released into the wild. There were several sightings of a big black cat like a jaguar near where I live in the UK. I also know people who had pet monkeys. \n\nIt was cruel and I’m glad restrictions were put in place. \nFerrets are cute and make excellent pets except for the smell. Maybe OP could compromise with a different more domesticated pet. \n\nI would love an owl though!", "16 year olds think a lot of weird things look fun. Because they’re still kids. Older kids but kids, nonetheless. \n\nHow, exactly, is that a red flag?", "There really, really are not.", "I have trouble believing this wildlife rehabilitation center would adopt out wild animals as pets and if they did, WTF?", "Definitely talk to the head of the rescue.\n\nAs a teenager, I worked at a rescue/rehab primarily for wild birds, but we did have a crow that was a surrendered pet. Total sweetie, but if I'd started talking about getting a pet crow myself, the rescue director would have had A Discussion with me. Not because it was illegal (although it is), but because they're still mostly wild, and it takes a LOT to keep one happy - not just cleanup, but interaction time. Same as foxes. \n\nDoes the rescue even know that she intends to get a pet fox? Would they seriously let a teenager adopt one, with the knowledge that the teenager will be the sole caretaker? Most dog/cat rescues won't, unless the family is onboard.  \n\nOh, and they also make godawful noises. Which personally I love, but it does sound like demons are surrounding your cabin.", "The Russian ones seem to actually be domesticated. But. They cost 10k+ and chances are you get sold a bootleg one that is not. (Like people who buy a \"minipig\" that is just a regular piglet.)", "You’re taking that comment awfully personal. I never said you didn’t love your horses. I just said I couldn’t leave my pets and I didn’t leave my pets. I did everything I could to give them a good life and made what I thought was the best decision for them and for me. I’m guessing you did the same. So I’m not shaming you, I’m just saying I made a different decision which was the right one for me. And it’s not fair to assume what she would decide with out asking her", "OP could consider rehabilitating a fox. She's got two years before she goes to college, and wildlife rescues typically need fosters for their foxes. Plus, it seems like they've got the resources needed to house a fox temporarily.\n\nAlthough I do agree, foxes aren't pets. It's unfair to the fox to keep it cooped up for years, when they deserve to run free. Also, where would you even buy a pet fox?", "> They’re not ~~easy~~ pets.\n\nFoxes are not a domesticated animal, and have no business being a pet. I have a hard time believing this story since OP says the girl's been working at a rescue and hasn't learned that lesson.  That's day 1 for animal rescue places that keep non-domestics like Foxes.", "> YTA, why even make that promise if you were never going to get a fox no matter what? \n\nWhy does this keep coming up? OP never says they lied about being willing to adopt a fox initially. OP *learned new information* after making the promise.\n\nIt was information anyone who had done better research would have found to begin with, but OP being bad at research doesn't make OP a liar.", "I was surprised that no one has mentioned rabies. I hate to be the one to say it, but if that fox were to bite someone it would have to be euthanized and tested, no matter what. And if the fox does wind up being positive, that is going to be one expensive hospital bill.", "The natural smell of foxes is the number 1 reason they end up being surrendered to sanctuaries by pet owners. You should absolutely not adopt a pet fox, especially now that you’re all too aware that even just secondhand exposure to the scent is too much for you. You really need to sit your daughter down and explain honestly that you had no idea how bad the odor would be, and figure out what you can do to make your mistake up to her. I know she’s trying to downplay how bad the smell is and power through it, but be honest, can you imagine sending her to school smelling like she does when you pick her up from volunteering? Be firm, but apologize for misunderstanding and biting off more than you can chew.", "YTA for reducing a wild animal who, if they are living in a home are most like in rehabilitation, to \"must not be too horribly hard to care for them.\" Make her volunteer longer and make her actually Learn from the sanctuary where she is WHY they are there versus in a person's home. She has zero idea of what it takes to take care of a fox and same goes for you. Just because its an animal, doesn't mean its a PET.", "Or it's teaching their kid that it's ok to reconsider your decisions when you get new information.", "people do breed them. they shouldn't, but they do. there was an \"exotics\" pet store in my hometown that would get in fox kits about once every year or two, and they were sourced from a breeder in that state. every time they got them in people would literally protest outside & on social media but it never worked because \"oooh baby foxes so cute\", or whatever.", "\"I sort of expected she'd be deterred by the reality of it\" heavily implies OP wasn't expecting to ever actually adopt a fox. That's why it keeps coming up. I, and many others, genuinely don't get the impression OP ever intended to make good on the promise.\n\nNot to mention they did all of 1 day's worth of research on foxes and called it good (and by day, I'm honestly betting not even an hour because the fact is their smell and bad habits readily pop up at the forefront of what to expect when owning a fox). So even if you want to be generous and assume they did intend to make good on the promise, they really didn't put in effort here and it's still very much their fault things turned out like it did.", "I remember a [redditor that participated in an illegal fox hunt and part of his punishment was to live with an uncapped bottle of fox urine in every room of his home for a month.](https://www.reddit.com/r/BestofRedditorUpdates/comments/t5yros/fox_poacher_forced_to_live_with_fox_urine_in_his/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)  He was allowed go leave during the day but had to sleep in the house at night. His wife took the kids and refused to stay in the home. The guy said showering made the smell worse and that even after the bottles were removed everything was just permeated with the smell of fox urine. And his wife refused to come back because he himself smelled lime fox urine whenever he sweated.", "Oh yeah, it is 95% OP's fault here, no question. (I place the teenager 5% at fault because even after volunteering at a wildlife rescue place she somehow still thinks private ownership of a wild animal is fine.) OP should never have agreed to something like this without doing significantly better research. This is less research than a responsible person would do if someone wanted to bring a dog into their house, let alone a wild animal.", "I disagree, to an extent. It's not like anyone is taking foxes out of the wild to sell as pets. They're almost entirely fur farm rejects whose coats were deemed imperfect or otherwise unworthy of harvest. The captive fur industry has ended up breeding thousands of semi-tame animals who's coats would put them at a natural disadvantage were they to be released. Furthermore, because they're raised in captivity, they don't know how to survive in the wild. Responsible fox rescues will rescue the fur farm rejects before they're culled, foster them, and adopt them out to homes that are properly vetted for enclosure size, knowledge on fox care, and the amount of free time a prospective adopter would have for a fox, among other things. To me, adopting to a knowledgeable, capable, and responsible home is far more humane than culling an animal that someone thought wasn't pretty enough to slaughter for fur. The only issue is making sure the animal is placed in an appropriate home, which can require a lot of time and effort for a rescue that's already spread thin. There are fox breeders, of course, but those are an entirely different can of worms. Most fox breeders do selectively breed for temperament, though, so a domestically bred fox is generally going to have a much different temperament than a fox born in the wild. (Edit to fix autocorrect)", "Those were sadly the benchmarks that OP set. That is why OP is the AH. All of this is a terrible idea. \n\nOP said it is expensive, daughter said she will contribute to cost. OP said go volunteer, daughter is doing that. OP said build an enclosure, daughter is working to do that. \n\nThis is completely ill-conceived. But even worse to have your daughter do all this and then tell her no.", "Honestly same. \"You can donate to the center you work at! That'll be your 'pet'!\" Patronizing as hell.", "I love when the punishment fits the crime. Sweet, sweet justice.", "They dont just spray. Foxes also use their scat to mark territory, and they climb.\n\nYou will literally have fox pee and poo in every corner, AND theyre destructive on a level puppies could never dream of.\n\nTheyre absolutely not pets.\n\nOPs kid should talk to the rescue staff about how they feel about pet foxes. My hunch is their immediate distain and fury will change her mind. There's a 0% chance that folks who run a wildlife center are cool with foxes as pets. Lol", "I rented a house while in college as dorms were not an option for me and my pets. If this is something she really wants, she’ll make it happen even if she has to wait until she’s 18. The best option would be to sit down and explain these concerns to her and if she’s still determined, help her find solutions. But saying she’s just going to leave the fox behind for college is an unfair assumption. You don’t know her\n\nLove how you responded then immediately blocked me where I couldn’t respond. Really cool", "Wow, even the poo is that bad, not just the pee?\n\nWhat does the poo smell like compared to say, dog poo, how would you describe it?", "Unfortunately I don't think it sunk into him. He just kept talking about \"don't break the law.\" And \"never skirting the law again.\"\n\nIf it were legal he absolutely would have done it again.", "If she's lucky", "You can't have a fox in a rented house. No lease is going to have that allowed, and it would damage the hell out of the place. They're destructive and the stink sinks into everything. It's not like having a cat or dog.", "If he had money, he'd do it again because the ones with the money are rarely punished.", "My hunch is that they don't. They probably are the opposite - they end up taking in foxes people bought as pets and then regretted it or somehow became unable to care for them any more.\n\nThe daughter needs a setious chat with the staff of this group shes volunteering with. They'll definitely have strong feelings about people getting foxes as pets. And probably sone pretty serious rules if they do ever let critters in their care leave. I really doubt that a 16 year old could meet those criteria on their own, but Mom needs to nix this pen building exercise immediately.", "Foxes live about as long as dogs in captivity. It's an awful idea for a 16yo to get one, even if she lives at home while going to college and/or working. It isn't something an average person can do. They are a full-time job and I don't think any 16 yos even have the time to properly care for one.", ">OP is YTA, but is just going to have to suck it up, admit fault, and say \"I'm sorry but the more I look into this, the more I realize that I made a mistake. You fulfilled the criteria that I set out, but upon further reflection, I cannot agree to getting a pet fox. I've learned that a fox is not an appropriate pet and we wouldn't be able to give it the kind of life it deserves.\"\n\n100%\n\nAs a parent it's important to learn to eat crow lol", "I once lived in a neighborhood with a bunch of foxes, one night around midnight my dog was barking like crazy at the front window. I looked out the window and saw a family of foxes absolutely wrecking a raccoon. Like r/natureismetal ripping arms off destroying that trash panda. I’m no fox expert, but didn’t seem like pet behavior.", "I mean, it wouldn’t be the first time a parent told a 16 year old no to something that’s a bad idea. I think it’s best to stay firm to that.", "That's not how smell works. \n\nI can tell someone smokes even if they've changed their clothes. I can visit smoker friend's apartment and even if I only step in and don't sit or touch anything and take off my shoes when I get home my family can tell who I visited that day because the smell has gotten on me anyways. \n\nThe particles that give off the smell are airborne and needs to be airborne to reach as many other foxes as possible even from a distance. This is why Fox and other animal urine are used to either attract or repel other animals.", "It helps that they took foxes from fur farms. That's atleast by this point, 100 years of selective breeding with 60 of which being focused on domestication.", "Forgive my ignorance, but why a tractor supply store?", "Thank you! Fascinating, I had no idea this was a thing and was wondering how the hell anyone would get a fox as a pet except weird animal smugglers.", "One person in a locality near me has a pet fox. It’s made the news several times bc all their neighbors got together and are trying to get a law passed to force them to get rid of it.", "I thought the fox was going to be kept in a pen out back.", "They carry fox urine, farmers and people with gardens use it to keep other animals away.  I’m not sure where else you’d get it, I guess online if you don’t have a tractor supply nearby.  They carry more than tractors obviously.", "Your average pet owner is not going to think that a pet fox meets the guidelines for domestication.\n\nEven the most domesticated and carefully bred foxes will mark territory with soray and scat, destroy anything that fits in their mouth, and are more nippy than the worst ever puppy.\n\nGiven how many actual dogs are surrendered for far less than that, maybe advocating for foxes as pets isnt a great idea **for the foxes**.\n\nIf youre more interested in the \"rights\" of people to own domesticated foxes than the actual wellbeing of the foxes themselves, then I hope you never have pets. Because theur care has to be a priority over your wants.", "They really are smart. And have you ever noticed that they like to poop ON things? A rock, a piece of wood, whatever is a little higher and different than their surroundings.  Very cool critters but they will clear out a peach tree in a single night.", "Yeah, because that's soooo fun for the fox. Daughter is a selfish brat who just wants the fuzzzzzyyyyy and doesn't care that it will be miserable. It's not a plushie.", "Meanwhile, we have a raccoon that poops in the bowl we keep outside to feed the strays if there's no food when he gets there at night. \n\n...also figured out how to get into our house.", "A rescue fox going to an owner who has the time, skills and resources to take proper care of it wouldn't be so bad. But daughter isn't a good candidate for that sort of thing, not at the moment. She's only 16, what is her life going to be in a few years? Will she be in a position to continue caring for the fox? Probably not, and even if she does want to commit to caring for the fox, that's going to limit her options. And she has only been volunteering with the rescue for a few months, that still isn't a lot of experience. Especially since, given her age and recent volunteer status, there are probably a lot of things she hasn't been allowed to do.", "Something tells me they must live in a state that doesn’t require licensing and you can go buy an exotic pet at the store. Florida has nonexistent laws when it comes to what animals you can own and you’d be surprised at what you can buy at a local exotic pet store. A friend of my sister’s has a pair of foxes and even though she has a proper enclosure for them they still stink.", "There’sa reason there are a lot of pet foxes in rescue. They’re not great pets. My friend had a fennec fox. He was ADORABLE.\n\nBut.\n\nFoxes are primarily nocturnal. He’d go crazy at night—like a cat from hell.\n\nThey’re not cuddly…they’re never *truly* domesticated. He would let my friend pick him up, but he really didn’t like being handled.\n\nThey’re prey animals, so they can be really skittish.\n\nYou can’t leave them outside unless they’re in a secure enclosure from which they can’t dig out (they’re burrowing creatures, so they can dig quickly and deeply.\n\nThe males can also be territorial and will piss ALL OVER. \n\nAnd even if they don’t piss all over, they’re in the musk family, so they always smell a bit like lightly fragrant piss. You’ll get used to the smell after a while, but you’ll smell like musky urine to others.\n\nYou’re NTA.\n\nIt’s a bummer for your daughter, but their smell alone is enough to say “get your own when you move out”. And seriously, at night…you’ll hate the thing.\n\nLeave the wild animals in the wild", "Foxes are not a child’s pet. Their not an animal you can stuff in an en loader and hope it’s fine. This is a terrible idea. She cannot tend to one and do school easily. Foxes are notorious for escaping from their enclosures. Their amazing animals and can be very sweet and affectionate but their not a child pet.", "I mean op could have gotten out of it without being an AH by bringing up the smell and explaining they didn't think it would be quite THAT bad so they've gotta put their foot down and say no fox.", "Yes. And isnt fox smells so complex to the human nose that we literally can’t get used to the smell?\n\nPeople need to learn to appreciate cute things without “needing” to own said cute things. Appreciate that the cuteness exists but let it be.", "Bruv as someone1 who was unlucky nuff to get a fox, they are not house pets. Only certain lines (e.g. russian) have been bred for semi domestic living, most sellers aren't these. Their shit and piss is extremely potent....like house clearing", "You would think she would learn this from the fox sanctuary that they should not be kept as pets. Op YTA for making a promise you don't want to fulfill.", ">foxes are not meant to be pets.\n\nNothing is \"meant\" to be a pet; we breed animals to make them into pets and I know that a research study was done into the domestication of foxes.\n\nThey specifically breed only foxes that liked and socialised with humans, and it showed that it was working over the generations with later generations acting not unlike a domestic dog interacting with a human.\n\nBut I'm firmly of the belief that any animal that is not domesticated will go extinct because eventually either humanity goes extinct, or the Earth becomes an ecumenopolis aka Coruscant from Star Wars (city covers the entire planets surface), so IMHO domesticating animals is the only real way to save them long term.", "Fox musk is so smelly they burn shacks that foxes get into for too long. Their pee is IMPOSSIBLE to wash out and your home will never stop smelling, even if the fox lives in an enclosure. Fox are NOT pets. \n\nMy childhood (ex)friend was stupid enough to try and get a fox 3 times. She had rehab and wildlife experience. All 3 of those fox died gruesome deaths bc from disease to being pulled apart by other wild animals drawn in by the scent of a captive fox. \n\nDO NOT do it. No matter what.", "To be fair, everyone is very dramatic about how ferrets smell, and personally I love the way their fur smells 🥹 I mean their feces not so much. But it's still not as bad as everyone makes it out to be. So I get why you wouldn't be too concerned until you actually found out how foxes smell", "Cat piss that has been sitting out in the sun for a couple days, but yeah", "The person who agreed to getting a fox knowing full well their kid would be going off to college in a few years.", "Not being funny but basic research should have shown a fox is not meant to be a pet unless you're looking exclusively at biased sources that glamorise pet foxes. Both OP and their daughter dropped the ball on that", "They didn’t ask.", "It's the kind of smell they use to catch tree thieves (spraying fox urine on a tree to freeze at sub-zero temperatures on a tree trunk) and you cannot get rid of it for days or weeks.", "Pouring fox urine into something is literally one of the biggest revenges Reddit people recommend on the illegal life pro tips/revenge subs. It apparently is one of the worst smells on the planet and never comes out.", "Yes, OP really stuck her foot in it. The option to have an outdoor enclosure for the fox just might be plausible. And of course it has to be a fox that is unfit to survive in the wild.", "They’re in the musk family so they always smell like sweet piss in addition to them being territorial (with some males aggressively marking their territory).\n\nBut even in a best case where the fox didn’t start up all night spraying their territory and going ape shit (which they do. They’re nocturnal and it’s miserable. Worse than a cat), you’re still going to smell like you wet the bed", "Yes they are.", "There’s a reason there are a lot of former pet foxes in rescue", "She has been volunteering at the rescue for a while now, I'd be surprised if this topic never came up.", "Even if *you* get used to their musk others won’t. You’ll smell like you wet the bed and sprayed cheap perfume.\n\nNot even all the literal piss and shit…just their natural aroma…sweet urine.\n🤮", "They sell the urine, which you can use to \"mark\" your own property to keep other foxes out of your \"territory,\" to keep them away from your livestock or poultry.", "Like dog anal glands mixed with an over-ripe litter box that got sprayed by a skunk.", "OP says she goes there once a week, so she's only been there three or four times total. Very easy for the topic to never come up with a random newbie teenager, especially depending on how chatty she is with near strangers she likely wants to think well of her.", "Lol, I have more pets than you will probably have in your life. I am not advocating for foxes as pets. But the fact that they have undergone domestication is separate from the ethics of keeping them. They have been domesticated. Whether or not that is right is a discussion no one wants to have. They just want to argue that if it is not behaving like a dog then it is not domesticated. That is not how domestication works. Dogs are a exception, not the rule of domestication. A chicken will shit on everything in your house, is not very trainable, and has innate instincts you can't breed out. Chickens are still domesticated.", "Yes there are.", "Some legitimate exotic animal rescues adopt out animals, BUT they only do so with animals that meet specific criteria, and they only adopt out such animals to people who have a lot of experience and knowledge. OP's daughter definitely wouldn't qualify.\n\nThat said, it doesn't sound like this place adopts out foxes.", "Them's some smart little buggers too. \n\nWhen I was kid about 6 or 8  a raccoon figured out how to open the latch on our little trash shed that we kept the garbage cans in. One night I heard him in there. Being the badass that I was I grabbed a stick and went to teach him what for. I flung open the door and that raccoon turned, puffed up until he was the size of a pickup truck and made this wailing hiss. I dropped the stick and ran so fast I don't think my feet ever touched the ground.", "Florida actually has pretty strict laws haha, but there’s a huge exotic industry there so you’ll definitely find more weird pets there than elsewhere", "i know im spamming replies to people like you, but i’m gonna keep doing it please do not speak on a subject you are not informed on.\n\nwild foxes and rehabilitation requires licensing and evaluations in almost every US states.\n\nDOMESTICATED foxes do not, as they are a fully domesticated, purpose bred animal, that relies and seeks human attention. domesticated foxes are not wild animals and cannot survive on their own. they are born domesticated and act different than wild foxes from birth. we also have a pretty good understanding about the genes we’ve analyzed that changed between wild and domesticated foxes, and how they contribute to the behavioral changes.\n\nthis is akin to needing licensing for wild dogs or pure wolves, but not for a german shepherd, as one is a wild canine and the other is domesticated.\n\nwhile they may not be a suitable pet for all domestic foxes are purely pets, do not belong in the wild, and will die of starvation if they do. \n\nan idiot in the town i used to live in released his domestic fox he didn’t want to take care of, because OH ITS A WILD ANIMAL ITLL BE FINE. had very unique black and white markings, the fox started losing weight and then started seeking humans for food and got run over and died trying to approach people.", "This right here. I volunteer with a wildlife rehab and once I have my hours I will be getting my license. It’s no joke and all the cute stuff social media shows is NOT reality at all! Even the cute cuddly baby animals still very much have wild instincts and as they age those instincts come forth even more. Hell just the other day we were all discussing this with one of our local ACO officers that has to deal with illegally owned wildlife calls pretty frequently. Social media has done a great disservice to everyone by not being realistic about what actually goes into managing wildlife. And yes foxes stink to high Heaven.", "I know the behaviour of foxes.\nI volunteered for a rehabilitation center for years. I’m not just some joe blow on the internet.\n\n So a bunch of asshole breeders started doing this bull and we’re just to be like.. cool cool cool!! Keep on at it!! Foxes will never be fully domesticated. Sorry. No.\nHumans are pathetic.\nWe just take and take because we are greedy Twats.\nFoxes were never meant to be pets.\nIt should be stopped. They were never meant to be held captive.", "That doesn't mean OP wasn't going to follow through at first, though. I tell my kids things like that all the time. \"Can we go out for ice cream?\" \"Sure, if you clean the bathroom\" They hate cleaning the bathroom and mostly just deem the whole thing, \"not worth it,\" but then they actually do clean the bathroom and it's like, well crap, guess we're getting ice cream. 🤣\n\nJust because you don't expect them to follow through doesn't mean you wouldn't honor the agreement. \n\nIt's pretty normal.", "couldn’t the same thing be said for dogs and cats? and no it wasn’t just some asshole breeders.\n\ndomestic foxes were created by scientists  that were knowledgeable in behavioral and genetic modification and were only kept as scientific animals for a long time, no one thought their domestication would be successful, but they were, and on top of that we were able to identify the specific gene changes that make domestic foxes different. all domestic foxes are descended from this population of foxes. they are fully and verifiably through genetics, domesticated.\n\ndo you believe we should euthanize all domestic animals and end pet ownership completely? because unless that is your belief you are making baseless claims and exaggerations to justify your stupidity.", "Oh I think I remember that one too", "It absolutely can be said for cats and dogs. Unfortunately that was done hundreds of years ago, and now it is out of our hands and a huge problem. The responsibility is ours in regards to cats and dogs.\nI am 100% against them being bred and think everyone should be adopting. There is zero reason to be supporting breeders.\n\nWhat happens to all of these designer foxes when people buy them for the novelty of it? For their children? For their own greed?\nBecause that’s what they are.. a new fad. This is a new fad. It has not been around for a long time.\nFoxes are a huge responsibility.\nThey take a great deal of care. Maintenance. Grooming if in captivity. They get extremely lonely bored in captivity.. which can lead to depression.. which can lead to aggression.They need an immense amount of space and activity. \n\nSo again\nWhat Happens when the novelty of these foxes is done?\nPeople will release them into the wild.. just as they release bunnies.\nThey will just dump them at shelters.\nIt’s going to be a big problem.\nThis is not a good thing to support.\nIt should be banned.\n\nEDIT:\n\nCalling me stupid for having a conversation is very mature. Congratulations. \n\nScientist also sewed decapitated dog heads onto one single dog body in the name of science. Doesn’t make it a good decision.\nWe don’t need to domesticate foxes.\nThere is no reason. It has no value.", "Given her age and new volunteer status, the rescue probably has strict limits on what they allowed her to do. (at least, if they're a good rescue)", "Huh, what's the difference in the smells? I'm trying to think which would even be worse lol", "Oh, wow, only a few times? Nowhere near enough experience to know if she can handle a pet fox or understand what caring for it entails. Especially since her tasks, given her age and new volunteer status, are probably very limited.\n\nI still think it's likely that she has seen some \"foxes are bad pets\" messaging at the rescue and ignores it. Good chance she even realizes that they'd berate her for wanting a pet fox and knows not to bring it up.", "Stable smell has a lot of scents combining together.\n\nHay, straw, wood/wood dust, leather, leather oil, horse feed, horses, dung...\n\nOther than the last, it's a specifically unique but lovely smell.\n\nHorse smell is just the straight scent of horses. They can have a certain smell just like cats and dogs do, but there's a whole lot more of them, and you're in physical contact with them constantly. Brushing, riding, pets, trying to get a nose out of the way while dumping in hay or feed...\n\nAnyone who is around it constantly goes nose-blind. Anyone not is going to be in for an experience. It's not so much a *bad* odor as it is a *strong* one, if that makes sense?", "What Jantra said. Animals themselves are fairly clean, they don't lay in their own crap etc.   \nSame as with cats, the animal itself smells nice, but the environment ends up being stinky.", "To me both smells are amazing, but yeah, probably not to have around the house all day. We had to take our riding clothes off as soon as we came in.", "Vet care is also expensive. You have to find a vet with experience with foxes, not just your average vet who only handles dogs and cats. \n\nOP was so short-sighted in making this promise...", "Exactly. I followed a woman who worked with a wildlife rescue rehabilitating foxes and she had to emphasize every month or so just how destructive and territorial they are. The one living with her had hollowed out the back of the couch and was filling it with objects from around her house that she absolutely couldn’t remove without it attacking her. Also, they were all ruined by the fox stench. There are sooo many reasons foxes are not pets! Ugh, OP. Just ugh.", "Have you looked into wild animal codes/laws/ordinances in your area? Your state/city/county/province, etc. may very well not allow you to privately own a fox anyway. It's something to look into and may get you off the hook, BUT...\n\n...YTA for making a promise you had no intention of keeping, especially a promise that involves the care and keeping of a living creature. Wild animals aren't toys, fads, are hobbies. You should have taken the opportunity to teach your child that instead of making her an empty promise.", "What were you thinking??? Promising your daughter a wild animal, what’s next?", "I do agree with this sentiment but it does depend on the foster situation it can turn into keeping it full time.  I fostered a raccoon who now is a full time pet due to the fact of how domesticated he became.  I attempted to have him reintroduced to the wild but was told with his behavior that he would not survive in the wild on his own as he really is just a pet at this point.  Foxes though are so much work I have fostered some crazy animals and have been approached about foxes and would never personally foster one.  Their urine is a god awful smell and it is so hard to get rid of and also they are full of energy constantly and can be very loud and vocal creatures.  I would def think twice before making any kind of decision on fostering a fox.", "This is it. Plus OP clearly didn’t do that much research as it’s quite well known that the smell of fox urine is terribly potent. It’s believed to be up to 20x stronger than a cats. \nI follow a lady who has a few foxes that can never go back out into the wild due to abuse at fur farms and such that they were rescued from. She’s talked openly many times about how foxes are not typical pets and shouldn’t be treated as such. The smell from foxes will get into everything and it will never go away. But beyond that, they thrive on routine and can be quite destructive with household items. But they also need a HUGE outdoor enclosure for outdoor play that is both large enough and safe enough that they can’t escape it either. \nAny good fox rescue would also be incredibly stringent on re-homing a fox. There’s a chance they might deem the size of the house or the garden unsuitable. Some even go to the extremes of insisting that you have a jar of fox urine in your house for a month to see if you can cope with it. I think OP was a bit naive here even considering making this a promise. Especially when as most people have pointed out, this kid is still a teenager and it’s unknown whether she will stay at home or not in a few years.", "I don't think OP has thought about what having this kind of pet long term would mean in terms of care. There are plenty of parents who refuse to get their kids regular pets like cats and dogs at this age bc they know their kid won't be around to care for it soon and they don't want to watch it while kid's at college.\n\nOP should consider if daughter wanted a puppy or a cat, would they be willing to care for it while daughter is away for college or work. If their reaction to a dog would be, no that's too much work or only if I have nothing to do with caring for it, then they *definitely* shouldn't get a fox. \n\nA dog or a cat she could eventually move out with her. She can't even legally own a fox in all 50 US states much less abroad. No apartment or house would lease to her if she has a fox listed as a pet. If OP goes through with getting the fox, they need to understand the fox would most likely be staying there for it's entire life and that he's going to be helping (or possibly doing most) of the care for the fox at some point, unless they send it to a rescue themselves.", "OP claims to have done a full day of research though.. and didn’t manage to figure out that foxes smell?! She never took it serious in the first place, that makes her an AH imo", "Wow. Or don't make promises with incomplete information. But that's not what happened. OP made the promise, hoping the daughter would get discouraged. Just parent up and say no.", "It's not clear from the post whether it was a lie or a mistake.\n\n\"I expected the reality to deter her\" as well as the weak excuse about it being too much work do seem to suggest that OP never had any intention of following through.\n\nIf you Google pet foxes, the stink problem is going to come up immediately. There's no way OP did more than 10m of \"research\" and didn't come across that. If this is a genuine mistake caused by not having all the facts then it's a pretty stupid one since they somehow missed the number one drawback. If there is a wildlife rescue close enough for her to volunteer at then they should have visited it themselves to see how bad the smell is before agreeing in the first place.\n\nThe question should not be \"WIBTA\" for breaking the promise, that's the most sensible option at this point. It should be \"AITA\" because the damage is already done, OP is TA for either knowingly making a false promise or making one they didn't fully consider. The daughter won't \"feel\" she did all the work for nothing, she *did* do all the work for nothing. I hope OP feels appropriately guilty and finds a good way to make this up to her.", "Still makes OP an AH.", "No, it was a promise the parent never intended to keep. She set conditions she believed her child wouldn’t be able to meet so the child would stop pestering her. It’s like when my mom promised my little sister she could get a hedgehog if she paid for it herself, believing she would never be able to save 300 dollars at 14. Well, guess what? She underestimated how badly my sister wanted that thing, she was fucked, and Gatsby lived with us for 3 years. Only in this situation, it would most likely be an abandoned or injured animal who has become slightly tame and cannot go back into the wild, so it’s a really big problem.", "Okay, love your SW reference haha! But to answer you, while I do think that animals rely heavily on humans to survive (whether it be through our conservation efforts or on the other side, our destruction of the planet), most animals were domesticated only for specific purposes. The ‘purpose’ for breeding foxes, I suppose, for companionship is already fulfilled by other domesticated animals like cats, dogs, some birds, etc.\n\nI do think that it’s impossible to domesticate all animals (imagine mosquitoes urgh). Rather, what we should do is try our best to minimise our impact on the local wildlife.", "You're assuming that she was assuming, but I'm hoping that she was just hoping.  I suppose \"expected she'd be deterred\" is open to interpretation.", "Is bearded dragon poo that much worse than dog poo? What did it smell like exactly?", "I spent about one solid minute on Google, and saw three times that having a pet Fox is strongly discouraged and illegal in most states. Secondly that they mark their territory like crazy and can’t be house broken. \n\nSocial media is crazy for kids - it paints a completely different world. My friend was convinced that he didn’t need to learn how to drive, move out, or even work more than four hours a day because we grew up with video game content creators becoming overnight millionaires and running companies in big cities. He figured because this one personality who lived with other personalities didn’t drive or have his own place, he didn’t need to, despite us living in the suburbs in a commuter town. We are now 30, and he just now got his license. He’s certainly an outlier, but he’s a perfect example of how social media fucks up how kids think.", "There's a woman who has 2 pet foxes, and I think is either on IG or Tiktok, but both foxes are rescues, and couldn't survive in the wild due to being pets.  She has said you can smell her house outside even with all the doors/windows closed.  She's pretty much a recluse because the smell of fox urine does not come out.", "I follow a fox rescue on Facebook for cute fox photos so I know probably more than most people about how the process works. All their foxes are either fur farm rejects or breeder-obtained foxes obtained from homes that either didn't have them legally, or just realized they couldn't adequately care for them. But a vast majority of foxes adopted from rescues are fur farm rejects that wouldn't be able to survive if released into the wild.", "I feel so naive- I didn’t realize that fox fur farming was still a viable business and thought the fur business was down to just trapping except for mink farms. No idea why I assumed this.", "Yeah, they're almost certainly sheltering her from the worst of it. I wouldn't be surprised if she'd seen some anti-pet fox messaging, but I'd also not be surprised at all if it's so far mild and easy to wave away as being against \"bad fox owners\" instead of \"all fox owners\". That's going to be the tough part in convincing her really: getting her to realize that she's not going to be the exception. (Which might be a bit harsh on her, but she's also trying to get an exotic pet that she likely won't be able to care for in a few years, so...)", "Speaking as a parent who has had to backpedal on a bad decision occasionally, I would not call OP a “massive AH”. Parenting is hard and sometimes we misstep. And OP can tell the daughter that. She will have a chance to make her own mistakes in the future and watching her parent own the mistake is a growth opportunity. These posts give you plenty of reasons for your change of mind.", "It's also apparently good for keeping rabbits out of gardens!", "My point wasn’t the cruelty of keeping a wild animal in a cage out back. It was more about not having fox poop inside.", "> \"YTA for making a promise that you never intended to fill.\"\n\nBut OP fully intended to let her daughter get a fox, so that point of yours is irrelevant. Only after realizing how bad they smell they decided they don't want the fox.", "Sounds like OP didn't believe in his daughter to get shit done either, dismissive of her passions. Reminds me of my dad.", "First, consider that the rescue is multiple foxes and probably inside, and she's likely always doing dirty work there as a volunteer. So the smell of a single fox that you keep outside will be nothing in the range of the way she smells after volunteering.  \nYou definitely screwed up, and you might just have to accept you're the bad guy here and have her mad at you.   \nI can think of 2 possible options for telling her no that might soften the blow. As others have said, you could tell her that if she can't take it to school with her or where she plans on moving, then you will be sending the fox to the rescue she works at when she moves, so she needs to consider that scenario before she adopts. And 2, you should look into your local bylaws. I wanted a fox too, but most city bylaws ban them because they're considered \"exotic pets\", or maybe the enclosure isnt legal in your yard, so you might have a way out that you can blame on your  municipal government and save some face.   \nGood luck. She's working really hard and I hope you can find it in you to let her have this, but if not then I hope she's not mad at you for too long", "Or it isn't really a rescue but something shady.", "Talk to rescue staff WITH the father present after father has spoken yo rescue staff.", "*Ding ding ding!*", "YTA for not doing your research and for agreeing and now you’re going to break your girl’s heart.", "Just throwing it out there that there does exist a dog breed that looks just like a fox. I have one and she’s actually very frequently mistaken for a fox. \n\nThey aren’t the easiest dogs to deal with but they’re also not like, husky-level difficult. Your daughter might find one a very fulfilling pet. Look into the Shiba Inu dog breed and see if it’s a compromise your daughter could accept.", "I recommend smaller Spitz dogs for people who want foxes. My Japanese Spitz is weirdly long and slinky for her breed and has an adorable foxy face - but with all the benefits of being a highly trainable, human-oriented domesticated animal.\n\nShe even pounces like a weirdo:\nhttps://imgur.io/gallery/jArn5jd\n\nYou're also completely right that her organization should dissuade her - but if she's going once a week and it's been three weeks, she's only been there 3 times. It might take more time.", "My advice would be to sit down with her and discuss the logistics of having this “pet” long term. \n\nFor one, it’s not a pet, it’s a rescue, so make sure she understands that. This is some frivolous fun thing, it’s basically 24/7 volunteer work. \n\nSecond, ask her what she plans to do once she’s in college. Either she won’t be able to go away, or she’ll have to commute to a local one from home. \n\nThird, ask her about how she’s going to be able to afford both a fox and saving up for the future once she’s an adult in her 20s. I don’t know how long rescue foxes live, but I’m guessing probably more than four years. \n\nFourth, I would just explain how you feel. I wouldn’t start with backing out of the promise, but I would explain deeply why you’re uncomfortable having this animal in your house. It’s not like a cat or a dog or even a donkey, it’s a wild animal. It’s expensive, smelly, undomesticated, and she’s bringing it into your comfort space and home for who knows how long. \n\nFifth, instead of being blunt, try to suggest a compromise. Maybe promise to help her pay for one once she has a stable home to raise one. The thing about being on the verge of graduating high school is that college is a very tumultuous time. You’re moving around, and you don’t have time for things like animals. I’m a college student, and I would *love* to have a cat of my own. But I would never buy one right now, because I’m constantly going back and forth for college, and my dorm situation is not spacious enough for an animal. Tell her to think about how she will take care of this animal long term, and to take into consideration when would be the best time for both her *and* the fox for this to happen. For me, it would be after college, once I have my own place and salary (that’s when I plan on buying a cat). It should be the same for your daughter.\n\nI don’t know what her plans are after high school. But she’s dragging you into this by rushing to do this right now. The fox can wait 7-10 years if she really wants it.", "I think a lot of animals go through moody adolescences like that, parrots do it, too. My step mother decided she wanted to adopt one as a baby so it would \"bond\" with her or whatever, claimed she'd done tons of \"research\" and could handle the adolescent phase, made tons of jokes about how he was going to be a moody teen... she couldn't handle shit. She raised him from a tiny baby that had to be spoon fed mush, then got sick of him and gave him away when he hit the adolescent phase and started attacking everyone and screaming all the time. It was fucked. She didn't even give him to a sanctuary like she said she would, just passed him off to some college kid who wanted a pet.", "Yeah, I would bet the rescue she's volunteering with could take her out and show her every single fox they've reclaimed from an irresponsible human who tried to make them a pet. I doubt it would be a small proportion of their number."]}