{"id": 23175, "submission_id": "15a5bc4", "title": "AITA for not giving my step niece a job?", "selftext": "I have 4 siblings and all of us have at least 1 or 2 kids under the age of 10. my oldest brother is the only one whose children are over 10 yo. he has a 14yo daughter Melody and a 15yo stepdaughter Leah.\n\nmy siblings and I need babysitters for our kids and a few months ago we started asking Melody to be our sitter. she has been doing a really good job and it's very good for us because we trust her so we are not worried about our kids anymore also we like to pay her some extra money each time as a way of spoiling our niece. the problem is my SIL has been insisting that we should use Leah as our babysitter too which none of us wants to do. every time we ask Melody, she interrupts us and says how about Leah does it this time?\n\nit happened again yesterday when I was asking Melody to babysit. my SIL interrupted me and said let Leah do it this time. I finally snapped at her and told her that our kids aren't the only kids on earth and sure Leah can find a job somewhere else. she insists that this is different and the rest of the jobs don't pay this much and they don't have these advantages( referring to us giving Melody a ride to and from our house, taking her out for ice cream afterwards and etc)\n\nI told her that I'm still not giving her daughter a job and she called me an asshole", "created_utc": 1690376612, "permalink": "/r/AmItheAsshole/comments/15a5bc4/aita_for_not_giving_my_step_niece_a_job/", "score": 106, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole for not giving my step niece a job because I want to give it to my niece and therefore my step niece is upset that she is nit getting the job\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: Is Leah unreliable, or is this a blood thing?", "INFO: May I ask why you don't want to use Leah? As a pool of three different families it's always good to have a back-up sitter BUT you don't 'owe' Leah (OR Melody) a job, it's just that Melody is doing a great job that you're keeping her as your regular babysitter.", "NTA.\n\nIt's nobodies business who you trust to watch your kids.\n\nYou trust Melody, hire Melody.\n\nYou don't trust Leah, you don't hire Leah.\n\nIf your SIL wants to have this as an opportunity for Leah to bond with her new cousins and become more part of the family, fine, that's not a problem.\n\nBlending Famailies takes time and there are other ways and times to do this, besides a way that literally takes money away from Melody, and risks resentment there.\n\nYou probably need to have a sit-down conversation with your Brother, because at this point his wife is not acting rationally.\n\nIf your brother is sticking with this woman for the long haul, Leah needs to be invited to be part, does this mean she needs to take Melody's babysitting job? No.", "Is there a reason why you don’t want Leah to babysit, like, she’s immature or irresponsible, or is it solely because she’s a stepchild and not a blood relative?", "Ehh... I think you need to explain more about the reason why you don't want Leah to babysit your kids. However, I don't think you're AH at this moment because you are the one who makes decisions by hiring a trusted babysitter. \n\n... but still, what's your issue with Leah?", "NTA.\n\nI don’t care what your reasons are for choosing Melody over Leah, I believe it’s 100% your prerogative who you “hire” to spend time with your kids.\n\nI am curious how long Leah has been part of the family but frankly, even though I suspect you prefer Melody coz she is someone you know all her life, I would still not hold your choice against you. As a parent, I also prefer to leave my toddler with some people rather than others, even if we are all family (blood relatives even). \n\nEven if instead of babysitting we were talking house-cleaning, still your choice who to hire. I cannot understand why people would think otherwise (but I also cannot understand why you posted here with this example. In what world would you be TA for choosing who to hire?)", "Is there any reason why you don't want Leah to babysit?", "INFO: why won't you consider Leah?", "I am to walk against the crowd and say you are NTA.\n\nIts so awkward you are being pressured in this. I dont see any reason why you are obligated to grant more jobs to others.\n\n What if their neighbors got a daughter that was like a sister to their daughters, that she wants to work too? And she might has a sister as well? Oh dont forget their niece that might exist as well, who might be like a sister to them :D\n\nThis concept is just too awkward for me to take it seriously. What if your neighbor yells at you that why did u seek a babysitter that far away from home when their daughter was all ready for that job ahahaha", "Well aside from the very clear point that you are 100% in your right to hire who ever you want, it ultimately comes down to this: would you trust Leah to watch your kids? Is she as competent and as familiar with the kids. \n\nBecause if she is just as competent and your kids would feel as comfortable then yeah you are a bit of an ass for not giving her a chance every once in a whale as well.\n\nIf she’s not as competent and/or the kids aren’t as comfortable with her, then absolutely NTA. \n\nYour kids safety and comfort comes before anything else here.", "iNFO -  Why can't leah, the older child, babysit?  Is she unreliable or do you just have a thing against step children?", "YTA both in this situation and for refusing to answer any questions about why you won’t let the other one do it. But you know you’re the asshole about it, which is why you won’t answer the questions.", "This to me is an interesting situation to me as it entirely depends on the reason. As in the comments you talk about how your kids favour melody but giving Leah this opportunity is an amazing way for your kids to bond with her. However if your just trying to cover yourself for favouring melody then your the ASSHOLE as your denying her an opportunity to bond and feel apart of the family u are currently pushing her out of", "INFO- How often do you and your siblings rely on Melody to babysit your kids? Does she want a break every once in a while? And why don’t you trust Leah to watch your kids? Do you not view her as family?", "Info: for how long have you and your kids known  Leah?", "Info: how long has Leah been a part of the family?\n\nAs a parent, if you don’t trust your step niece to watch your children then you don’t trust her. When it comes to watching your kids it’s ultimately your decision.", "Why will you not allow Leah to babysit?", "NAH\n\nYou have a baby-sister that works, that your children know and are used to, that knows your rules and how you'd like them to look after your children. This isn't about \"giving Leah a chance\" this is about changing the entire routine for you and your children.\n\nThere is an argument to be made for letting Leah step in, certainly, for when Melody has other plans you can always have a back-up (as others have pointed out). Leah might even be better at the job than Melody, you'll never know if you don't try. I don't blame you for not wanting to change things on whim, but I can also see how Leah's Mom could interpret this as you ostracizing Leah as she's not blood related. Tough spot to be in.\n\n&#x200B;\n\nEdit: grammar", "Info: why don’t you want Leah? How well do you know her? Have you seen any red flags?", "NTA  \n\n\nand here's why:\n\nNo matter the reasons, parents are the ultimate authority when it comes to their child's well-being and comfort. Others' (or heck even society's) prejudices be damned, no parent's decision should be overridden by a third party when it involves childcare to any extent.  \n\n\nYou don't have to explain to your SIL why, but of course, you don't have to be mean about it. Go with what's best for your children, and if they still insist, start looking into other options.", "YTA but not because you didn't give her a job, YTA because you clearly have reasons for not wanting her to have the job that, at the very minimum, you're embarrassed to voice here. You know your feelings on the matter aren't coming from a good place and you're lucky that this particular situation has lots of logical cover for you to hide behind. \n\nThat's why she called you an asshole, not this disingenuous \"AITA for not giving my step niece a job\" bullcrap.", "NTA. SIL is trying to force drama for no reason. Wanting one consistent baby sitter you and your children can get used to and comfortable around does not make you an ass hole", "NTA. When it comes to your minor children it’s entirely up to you who babysits them. You don’t have to have a good or fair reason to entrust them to one person over another.", "NTA. You get to choose who you have babysit your kids. If I didn't want certain family members babysitting then I definitely would not get talked into it by someone else. Use who you trust.", "NTA, this is super awkward, and good for you for staying consistent with Melody and the kids.\n\nI don't know how long Leah has been in the family, but if it's less than 3 years, Leah and Melody are gonna have a big problem, especially with step mom being as pushy as she is.\n\nLeah is used to being the oldest. So is Melody. Your family sees Melody as the oldest niece. Even if you eventually love Leah too, you will not see her as your oldest niece, because that place in your heart is already taken. You can't just change the entire family dynamic over 1 person. \n\nThis is gonna be a problem because Leah is actually older. She's not wrong for wanting to be treated that way, but it's not gonna happen, and it will sting. \n\nThat's what's happening right now - It seems that stepmom is trying to establish a new family dynamic, where Leah steps into her \"rightful place\" as the oldest. It makes sense, if Melody had a younger sister, you would probably pick Melody over her, and then use younger sister when Melody goes to college or something. So younger sister would still get a chance. But Leah never will. Still, you're NTA.", "Nta these are your child. You get to decide who you ask to babysit.", "NTA why your sil want to steal job from your niece to give to her daughter?", "YTA see I was originally not going to judge but seeing your replies it is obviously favouritism and you don’t like Leah. I will say though you are close to burning bridges and if you are ever in an emergency and only Leah can help don’t be surprised if she tells you to go do one. Let’s be honest there will be a time when you will need Leah’s help and when she posts here asking if she is an ah for saying no we will all tell her she isn’t", "Ima go with NTA. It’s completely up to your discretion. I do gotta ask though, does Leah want to babysit your kids? Could you not have them both babysit at the same time?", "YTA\n\nAt no point did you say Leah was not responsible / trustworthy.  It sounds like you favor Melody.  Nothing wrong with that, but showing favoritism can be detrimental to your relationship with the girls and their relationship with each other.", "Frankly, I would find another person to babysit. Melody is obviously getting an earful from her step-family. Just tell them you don't appreciate the drama and you solved it by having neither girl babysit.", "YTA\nWhy do \"none of us want to\"?\nIs she unreliable? Did you not like her mother and you're taking it out on the kid? Has she not taken a babysitting course? (has Leah?)\nYou haven't given any reasons and from what you've posted, YTA.", "I'm going to be a minority opinion here, but, why is the SIL trying to take away a job from her stepdaughter and favor her own child?\n\nI mean, they are basically accusing you of some Cinderella BS with regards to your niece and step niece, you might as well turn the argument around.\n\nInitially, I will go with NTA, but, considering your brother and niece's family and stability, I'd say you should give your step niece some chance to earn your trust, maybe some other chore or taking both nieces out and bonding with them. YTA if you don't even try.", "NTA. This is solely at your discretion.", "I would say you're NTA. \n\nYou have a valid reason not to hire her as a nanny cause Kids prefer Melody over Leah. It's up to the kids and the parents whoever they're comfortable with. And even if OP hires Leah I don't think kids will love it. It will also can go wrong ( as some stated in the replies that they might bond over this ) you know it's like forcing your kids to be friends with someone you are not comfortable with. Yes Leah might be step kid Yes they might be favouring melody over Leah but no relationship can be forced specially to children if they want Melody that's it. \n\nAlso I really wanna know more Info. Like is Melody your SIL's child or she's also a step kid to her. Why would she always interrupt you to choose Leah whenever you are asking melody to babysit? How kids behave around Leah??", "info - Why not use Leah some of the time? If that works you’ll have two babysitters you can rely on.", "YTA. You can have whoever you want babysit but that doesn’t make you not the AH", "It seems like you are treating Melody as family and Leah as a stranger. I can understand if you are not as close to Leah, especially if she came to the family later on. But she is a 15yo and it seems like the only reason you don't want her to babysit is because of this \"step-niece\" part. \n\nI'm not saying you have to let her babysit, but maybe when Melody is not available etc. And maybe you can negociate the \"how\" if you dont want to get icecream with her later. It does seem a bit cold how you are treating this child that, whether you or she likes it or not, is in your family.\n\nYTA, but you don't have to be.", "NTA \n\nOnce you find a babysitter that you're happy with, don't change anything.", "INFO: WHY are you not letting Leah do it? Is it for a good reason? Or are you just doing it because she isnt related to you? If you are doing this because she is a STEP niece yes... YTA. If there is a valid reason for not wanting her to watch your kids... then thats a different story", "YTA. It appears you are treating the step niece differently because she is not a blood relative. Melody is trying to include her and be a decent person. You are definitely the asshole.", "NTA. This isn't about Melody or Leah. It's about your kids and it makes sense not to keep switching sitters because kids benefit from consistency. You get to decide who you trust your kids. \n\nIt's a job. I wonder if Leah got a job, would your SIL march to her boss and tell them they have to let Melody cover some of Melody's shifts? Because that's not how jobs work and since they're now learning about the working life, this is a valuable lesson.", "NTA. This is a job. Melody got the job, Leah didn’t. Your SIL pushing this on you guys is ridiculous. You clearly trust melody more and that’s a good enough reason. You have no need to justify why you don’t trust Leah. These are your kids she’s watching over. Not house plants. You should be going with the person you trust.", "NTA.\n\nThe SIL is just egotistical that it’s not HER daughter getting the work. It’s the SIL that’s TA.", "I really hope for your sake that you and your SO never break up and move into other relationships because if that happens your children will be the steps.  If that ever happens, when they cry to you about how they are not accepted by their step parents family, I hope you remember this and tell them that you approve of families excluding children who are not related by blood.  Make sure you tell them how you don't consider steps to be family and they need to just suck it up and get over it.\n\nEverything about your post and your comments make it clear that you do not want a relationship with Leah and don't concider her family.  And that makes you a huge asshole.  Children should never have to face this kind of heartbreak because their parents made bad relationship choices, and yet they almost always have to.\n\nYTA", "YTA and quite obviously too. in what fantasy world do you live where thats even a question?", "I cannot judge you.  How long have you known Leah?  Do you all treat hee less than because she is not blood?  I feel bad for Leah because of the rejection but I don't know the relationship or timeline.", "YTA - you have no good reason (based on comments) to not trust Leah, just your own prejudice.", "YTA- as a person who is a step niece…she’s your family too. Why don’t u give ur step niece a chance… why don’t u give ur kids and her an opportunity to bond? She’s your family too but ooh ur hung up on the word STEP. Shame on u mister. This is coming from a “step kid” who didn’t have the greatest relationship with bio dads family… and adored her “step” family… even the family who called me my stepdads wife’s kid even tho he claimed and eventually adopted me as his own. U may think it’s ok… but u a really hurting ur step niece in the process", "YTA \n\nSo far it seems you “ she is not real family “ type of dude.\nIt would be fair to offer both girls job, and actually better for you to have a back up", "I think \"I don't want to\" is a good answer. I want my niece who I know and trust to be my kids babysitter. also my kids prefer Melody\n\nYTA, you sound like a petulant 5 year old. You haven’t stated any valid reason why you don’t trust Melody and your kids are most likely following your lead. If you don’t like her you really shouldn’t expect them to like her.", "NTA.  You said that your kids prefer Melody and that's who you feel comfortable with.  SIL needs to butt out and if Melody is trying to get you to hire Leah then she's getting heat at home from SIL.   SIL needs to be put in her place.", "Has your step niece done something to make you not trust her? Because if your only reason to not trust her to babysit is because she’s not blood related, then you are doing it just cause issues. Why would you want to do that? And while you are correct that’s there are other kids she could babysit for, it’s also seen as a huge red flag by others that her own family refuses to hire her.", "Based on your replies YTA. It's just favoritism at this point and no specific reason. Are you allowed to do that? Absolutely. Can your SIL and her daughter dislike you for it? Also yes.\n\nYou are just hurting your relationship at this point. You are giving one kid the opportunity to make money and be around family while the other one is pretty much told \"ya I dont like you\" in a non verbal way.  A very bad thing to indicate to a kid who doesn't sound like there is any reason behind your dislike.", "Best way to deal with this is say yes to Leah babysitting and then feed your kids a lot of sugar 🤣\nOnnnnly joking. You could just say that you prefer melody as she has been in your kids life the whole time, but could pick Leah up after so you could all go for icecream? Just a thought", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have 4 siblings and all of us have at least 1 or 2 kids under the age of 10. my oldest brother is the only one whose children are over 10 yo. he has a 14yo daughter Melody and a 15yo stepdaughter Leah.\n\nmy siblings and I need babysitters for our kids and a few months ago we started asking Melody to be our sitter. she has been doing a really good job and it's very good for us because we trust her so we are not worried about our kids anymore also we like to pay her some extra money each time as a way of spoiling our niece. the problem is my SIL has been insisting that we should use Leah as our babysitter too which none of us wants to do. every time we ask Melody, she interrupts us and says how about Leah does it this time?\n\nit happened again yesterday when I was asking Melody to babysit. my SIL interrupted me and said let Leah do it this time. I finally snapped at her and told her that our kids aren't the only kids on earth and sure Leah can find a job somewhere else. she insists that this is different and the rest of the jobs don't pay this much and they don't have these advantages( referring to us giving Melody a ride to and from our house, taking her out for ice cream afterwards and etc)\n\nI told her that I'm still not giving her daughter a job and she called me an asshole\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nShe probably knows full well what's going on, and I wonder if she's trying to force you to come out and say it so that she can confront you about it.  You may have to explain that this has to do with Melody being your niece.  That means you're occasionally going to want to spend time with her yourself, and that's the way you're doing it.  No offense to Leah, but she's not your niece.  It's too bad if she doesn't have an equivalent relationship with people in her actual family, but that's one of the hard parts of being in a blended family.  Even half siblings are going to have different support systems and often one will have more advantages due to the non-common relatives, let alone step-siblings.\n\nSIL is going to have to come to terms with you not feeling the same way about Leah as you do about Melody.  You owe her politeness when you run into her, and it might be nice to give her a present for her birthday and major religious holiday while she's a minor, but you don't owe her equal treatment.   I have a feeling she's upset because Leah doesn't have the family network that Melody does and was hoping or even assuming that her marriage would provide an insta-family for her, but it doesn't work that way.", "NTA- your niece is ok with babysitting and you seem to be committed in providing her the income (which is probably why the niece is ok with it). However if the parents keep insisting on letting the step daughter babysit, it should be explained that it is Melody’s job now (worked between them) and Leah needs to find her own job. And/or tell them the real reason (if there is one) you prefer not to have her babysit.", "NTA because i think your SIL is being entitled thinking her daughter deserves the same treatment as her stepdaughter especially with giving examples like rides to and from the job and ice cream after. those may not be included if Leah babysits and then there will be a whole nother argument about how you dont treat them fairly. which would be true but also understandable especially if you dont know the step niece like you've known your niece all her life", "NTA but I hope Leah finds her strength to love herself enough and doesn’t feel bullied by her ADOPTED family.", "NTA", "You're NTA\nSIL isn't a AH\n\nThey are your kids so you decide who looks after your kids but you are AH for reacting for how you did in front of both girls.\n\nYour SIL is seeing her daughter is being excluded so is sticking up for her but is an AH for keeping to push the issue.\n\nI think it is a blood thing. You will always love and favour your blood niece more than step niece. Your SIL will just have to accept it.", "So...she has YET to answer why the kids don't like/why they don't trust Leah and how long she's been around...MORE INFO NEEDED.", "NTA. Your SIL is basically trying to steal Melodys  job to give it to her daughter. That wouldn’t fly at any other type of job, why is it ok in this situation? You like and feel comfortable with melody. Your kids prefer melody.\n\nYour SIL should be trying to help her daughter look for her own job (babysitting or otherwise) instead of trying to push melody out of hers.", "ESH.\n\nYou don't have to hire Leah if you don't want to.\n\nBut the fact that when you ask Melody she says why don't you ask Leah tells me that you're already asking Melody too much.", "NTA", "Are you treating them different because one isn't blood? If so YTA if its for other reasons then not", "I want to put N-T-A but something about this is kind of off putting. OP says their reason is they just don't want to Leah be the sitter and that even Melody doesn't want to give up the job. Of course Meldoy wouldn't want to give up the bonus pay and other perks of the job. At face value this is N-T-A, but it feels like there's something just below the surface.", "\"No\", and \"I don't want to\" are complete sentences yes, but you're coming into a public forum asking about judgement and not giving very much info. Your comments are super defensive whenever anyone asks about why, or brings up the obvious fact that she is a \"step\" kid. \n\nThat being said, your kids like their babysitter and that's the end of it. There is no reason to change babysitters for no reason. But I would encourage you to actually unpack what's going on with your defensiveness and resistance. NTA", "No one should pressure you or make you feel like you have to do something that makes you uncomfortable, so for that I’d say NTA. However, has Leah done anything to make you uncomfortable? Has she been rough with the kids or a bully? Is there a specific reason? From the perspective you’ve given, I’d say the SIL just wants her daughter to feel included, and not less than because she’s a “step” of any kind. It’s a difficult line to walk, but she probably wants Leah to get the same treatment as Melody. So maybe take a step back and just be honest about why you don’t want Leah to watch the kids. Whether it’s a blood related thing or you don’t trust her, you have every right to dictate who watches your kids. But your SIL isn’t a jerk for feeling the way she does either.", "The silence on this question is deafening. Has replied multiple times to other comments saying their excuse should be enough. But for some reason won’t respond to this one", "I think \"I don't want to\" is a good answer. I want my niece who I know and trust to be my kids babysitter. also my kids prefer Melody", "The thing is none of the other siblings are using Leah it seems. Must be a reason somewhere cause else someone else would use Leah", "Of course Melody is favored, she is their niece. They are not obligated to have Leah babysit. SIL is not wrong to ask to let Leah babysit, once; after that she just becomes pushy.\n\nNTA you choose who gets to watch your kids for whatever reason.", "3 or 4 times a week in total. she doesn't want a break she even asks us to go out more so she can babysit lol", "Why does Melody deserve to have her job taken away?", "OP & siblings only started hiring Melody a few months ago! Leaving Leah out must look to her like a pointed message of not accepting her as family.", "we mostly only need babysitters for date nights and if Melody isnt free our backup plan is go to date tomorrow. we dont really need a second sitter", "I want someone who I know and trust and who my kids love to be their babysitter. I don't want to force my kids to spend time with someone they don't love just to avoid hurting her feelings", "Melody is not doing that. as a matter of fact she is upset that her stepmom is trying to take away her job", "i hope if my kids become stepkids their stepmom doesnt try to force them to give up their jobs", "OP is obviously not comfortable with leaving her kids with the step niece. That's their right as a parent.", "Ok so it's obviously so in your world that the OP, Must take away a good paying Job from Melody, to give it to Leah?\n\nYou think Blending families is hard, now? How the heck do you think it's gonna play out when Melody gets to see Leah spending money that should by all rights have been hers if not for stepmom.\n\nYou think she's gonna be happy about it?", "i dont have a good reason to not trust the nighbors daughter too but im still not asking her to babysit", "But you are telling him to hurt his Niece, you honestly think your stepsiblings would have loved to hang out with you, if your dad forced one of them to give their job to you?", "I don't read that. I read it as SIL not wanting Melody to have a job.", "Consider re-writing this, I can't figure out where you stand", "Sorry but OP has other siblings who also don’t want to let Leah babysit. \n\nThere some context that we are likely missing such as how long they know Leah and other stuff.", "I think u misread.. when OP asked Melody, it’s the SIL that asked to give it to Leah", "The reason behind \"I don't want to\" is likely what will make the biggest difference between 'no AH here' or YTA so realistically, it's a reasonable question to ask.\n\nIs there a gut feeling behind why you don't trust your oldest niece? Is there something she's done or failed to do that's influencing your feeling? If you haven't stopped to think why you do or do not want to, ok, but taking the time to reflect on where your feeling is coming from would help with the rating of the situation.", "It’s clear that you don’t consider Leah family so why do you keep making up excuses when it is clear it is because you don’t consider Leah family", "I'm going to be honest, it's not and it's not going to heal this situation. \n\nYour SIL likely sees how engaged all your kids are with each other and having great cousin bonding and is hurt that Leah is not even a consideration. This is a struggle for parents who are trying to blend family, especially with one as close knit as yours. \n\nThe only way you get to know and trust Leah is by spending time with her and allowing her to integrate into the family. \n\nYou're not an AH for choosing Melody as the first choice but you are the AH for saying \"I don't want to\" like an immature pre-teen.", "It is not a good answer.\n\nDo you not like or trust Leah? Do you not consider her family?\n\nIs Melody uniquely skilled to babysit? Do your children have particular obstacles or issues for which Melody is suited to deal with, but Leah is not?", "It's good answer but question remains why you trust one a lot more than other to be a babysitter when both are raised by your oldest brother. I assume both Mel and Leah live under same roof so only prefering one to babysit probably creates tension between them.\n\nYWNBTA if you have legitimate reasons and can communicate it well otherwise SIL is right.", "The parents also are not obligated to let Melody babysit. If they feel like Leah should also have that opportunity, then it’s in OPs interest to come to a compromise.", "FURTHER INFO- What happens when summer is over? Will Melody continue to watch the kids 3 or 4 times a week? Also, why didn’t you answer my questions about Leah?", "YTA why didn't you answer the other 2 questions?", "A few months is still plenty of time to establish a routine. I'm not ignoring the fact that this can been seen as not accepting Leah, but the fact of the matter remains, they're OP's children and it's their choice to make. How Leah feels is irrelevant to OP's comfort in who is watching their children. There are plenty of other ways that OP can make sure Leah feels included in the family, but they do not have to cater to Leah's Mom in this instance.", "It sounds like you’re actually going out if your way to not engage with Leah here. \n\nEspecially considering that you spend all the extra time with Melody (rides to and from, ice cream after, etc), I feel like this issue is more about how you feel about treating Leah like a part of your family than it is about her babysitting. Do you ever do anything that lets Leah engage with your kids in the same way, or do you ever take her for ice cream just because? You know - the little benefits that come with babysitting for family and help people feel closer to each other?\n\nAs a parent you always have the right to choose who watches your kids, but theres a huge YTA vibe in what information you’re choosing to leave out.", "[deleted]", "After reading your comments YTA massively", "I misread your description. Still YTA.", "But you said you wouldn’t let Leah do it even if melody is busy. You also said you’ll move your date night if melody/you can’t find someone else, and still won’t hire Leah. So this isn’t about that and you know it. And it isn’t making melody give up her job, it’s switching between 2 sibling to give both an opportunity.", "You NTA… you have the right to decide who is babysitting your kids and who you paying.", "Lol! Very valid", "Why is Leah on par with the neighbors daughter? It sounds like you don't consider Leah to be family, is that intentional?", "The neighbour's daughter isn't a part of your family. Leah *is* your family now. \n\nWhat is so hard to get about that and why this situation likely is hurting your SIL?", "I didn’t say that now did I? I didn’t say take\nover I said give her a chance, and let her bond with the kids since she’s FAMILY too. But  maybe she can baby sit when niece isn’t available… or take turns. He’s focused on the word STEP.  My step siblings woulda hung out with me cause they took turns with me when we was all bonding and becoming a family. My siblings at a young age are the ones that made me feel included. They included me with their cousins, friends etc when I was new to the family. My “step” dad also made sure I was involved in all family activities. I was niece, granddaughter, etc not “step” this and that. Also the one uncle that didn’t include me or didn’t believe in “step” family, was left where they stood, 27+yrs later there’s no “step” we are just family and the uncle is a divorced miserable fool.", "According to the comments, OP said a couple times that even if Melody can’t babysit she won’t let Leah. \n\nSo they’re choosing not to use her even when it wouldn’t affect the other niece, and not giving any reasoning at all. \n\nIf they were saying “we have a standing date on Thursdays and Melody keeps the day free for us” totally agree. But “we change our dates to avoid using Leah if Melody cant babysit” is a different story. \n\nIf they really don’t know her or feel comfortable, there are really easy ways to work that trust up (e.g., hiring a sitter while you work on a really big project in the house that takes attention, ask Leah to co-babysit and get used to their kids, invite Leah and family over to specifically get to know her better) they go out 3-4 times per week so it would seem money and time are not hugely important. \n\nAs it is though and from the comments OP is leaving theyre making a pretty conscious and outward choice not to ingratiate Leah into their world in any way, and it also sounds like its coming across about as hurtful as it could. \n\nDef some conjecture on that last part, but the whole situation as OP explains (and doesn’t) is a super weird red flag 🚩", "He commented what he doesn’t give this job to a neighbour kid as well.\nSil needs to keep stuff equal for girls, both should be able to get some money. Blending families are tough.\nI would be out if husband family mistreat my kid.", "Hmm, okay. I interpretated the she in OPs sentence to refer to Melody, but yeah I guess it also makes sense that the she is the mother.", "“I don’t want to” is a complete answer. So is “no”. OP can hire whoever they want to watch their children.", "It sounds to me like it's the money and the ice cream.", "The kids preferring their cousin isn’t a good reason?", "He doesn't have to give a reason.  He prefers Melody.  That's the end of the discussion.", "His legitimate reason is he doesn't want her to babysit.  He doesn't need anymore than that.", "That is true, which will cause more drama between Melody and her stepmom. I think the important question is what is OP's brother saying about all of this.\n\nJust because the brother remarried, OP has no obligation to bond with SIL and step-niece. Sure, it would be nice but it can't and shouldn't be forced. \n\nIs this about bonding though? It could be, or is it about Melody making money and Leah not?", "yes just like she was doing before summer. it wasnt a problem for her.\n\nbecause I already answered in my other comments Im not going to repeat something 20 times", "I just asked that myself. Also, what happens when school’s back in session? Melody most likely won’t be able to watch her cousins 3-4 days a week then.", "Here's hoping that this comment rises to the top with thousands of upvotes.", "Has OP done that? Or are you making shit up?", "Why is he the asshole?\n\nThis is about a Job, that Melody is doing, and doing well.\n\nThere are other babysitting gigs in the area, but SIL wants OP to give Leah, Melody's job because they pay more and there's a perk of occasional ice-cream.\n\nYou and other YTA posters are making this out to be some huge \"Leah-isnnt-family-OMGOMG-SHUN\", when it boils down to him having a service provider he likes and doesn't want to change.\n\nSo I ask you, What has Leah done for her to deserve to have Melody's Job?", "Bingo!", "she doesn't get a job just because she is family. we have a babysitter who has proven to be amazing at her job and our kids are extremely happy with our choice why would I change that?", "> Leah is your family now.\n\nSo, you can choose your family, unless your brother fucks a woman with a kid, in which case that woman gets to choose your family?", "Yeah.... that's projection talking.\n\nHe's not focused on the word step, You are, he's focused on his kids liking their cousin to babysit them, and him being able to trust that Melody can do the job.\n\nLeah is presumably being included in a great many other ways, but this situation is not yours. \n\nMelody does not want to give up or share her source of income to Leah, and his SIL isn't focused on Cousin bonding for Leah, she's focused on OP giving better pay and perks than most babysitting jobs.\n\nYou are literally arguing that Melody must lose money and time with her cousins to Leah, to make Leah feel part of the cousinhood.\n\nTell me exactly how well that's going to go over as a bonding exercise between the stepsisters.", ">Sil needs to keep stuff equal for girls,\n\nOP isn't their parents. \n\n>both should be able to get some money\n\nShe can babysit for others. \n\n>I would be out if husband family mistreat my kid.\n\nI wouldn't care if my brother got divorced because I refused to hire his stepdaughter. If it works and it's what's best for OPs family then Leah can go work for someone else.", "Ok, He did also in the OP, say that he has pointed out to SIL that there are other Babysitting jobs, but she's said that they're not good enough because they don't pay as much or have the fringe benefits, that he offers Melody.\n\nSo it's not that SIL wants A job for Leah, she wants Melody's Job for Leah.\n\nMelody wants to keep her job, why are you against that?", "Yea but SIL can get offended when the only reason why not is because she's not related by blood.  You have the right to say no, but people have a right to have bad feelings about it.", "So is \"fuck off\" the next time he wants to do family stuff with the people he offended. You can do whatever you want but if your goal is to not be an AH and take others into consideration, there's that.", "A complete answer doesn't mean it's not AH behaviour. While OP has every right to never ask Leah, that doesn't mean that it's not still going to cause tensions and divisions, and there's an innocent kid, who is part of the family, whether or not OP likes it, who's going to be getting deliberately excluded.\n\nIf Leah has been proven to be unreliable, that would be one thing, but other this is a definite YTA to me.\n\nI think too often, people on here over conflate what people have the right to do with actually decent behaviour.", "The kids might prefer ice cream for breakfast, too, so in and of itself without context, no, I don’t think it’s a sufficient reason.", "The question is not whether or not he has to give a reason. The question is whether or not he’s an asshole. He is. That’s the end of the discussion.", "You’re right, he doesn’t. As long as he’s good with hurting a child’s feelings and doesn’t want to keep a relationship with his brother. He asked if he’s an AH and he is if he has no actual reason.", "Like I mentioned - \"I don't want to\" is a good answer and he is completely in all his rights to refuse Leah for whatever reason he wants. But refusing only Leah is definitely creating tension in his brothers family and brother or SIL are in all their rights to not allow any of their kids to babysit for OP.\n\nIf my relatives came and started openly favoring only one of kids with no valid reason - yep, they are bad people and we are no longer gonna visit them as often.\n\nOP is YTA massively.", "You haven’t answered my questions actually. WHY don’t you trust Leah? The only thing close to an answer I’ve seen is that she’s a stepdaughter. Has she done anything untrustworthy? Do you and your siblings like Leah?", "\"I don't want to\" isn't an answer. You need to actually tell us why. Surely a grown person is capable of explaining their thought process.", "I agree. If Melody was working at a Dairy Queen, she wouldn’t be able to just give Leah one of her shifts here and there. Leah’s mom can help her find a job with the pay and perks Leah would like. \n \nI was on the fence reading through the comments because some of OP’s comments seem a bit harsh or cold. But that doesn’t really matter and OP may just be tired of the step mom interfering. It sounds like Melody has been their sitter for a while and it’s working for all of them. Melody shouldn’t have to give up her job, especially, if she doesn’t want to.", "[deleted]", "I am not saying you need to change that, *but* there is a way to have some tact with your SIL and not sound like an AH. \n\nThe easiest thing to do here is say \"SIL, my kids really cherish the time that Melody comes over and babysits and we want to ensure that they're comfortable so when Melody is free she is our first choice. If Melody wasn't free, we could consider Leah\" and then just leave it at that.\n\nBut you're seeing this as an issue about a job and it's not that. Open your eyes and take a critical look around at how you and your family (siblings and nibling included) have facilitated welcoming Leah and your SIL into the family.", "Just don’t complain when Melody isn’t available when you need her and Leah wont pick up the slack. Karma", "Lol\nI don’t give a shit about both girls. \n\nBut in this case this is not “ just a job” - he gives extra treats, drive to ice cream and generally bonds kids in a family. So he excluding one of nieces making her less of a family? Not nice. \n\nSo he essentially mistreats one of kids.", "OP has stated that they change their plans when Melody isn't available.\n\nThey don't reach out to Leah when Melody can't work, they actively avoid Leah in the process.", "SIL is the one making this a bigger situation than it should be. OP has a preference of having niece babysit their kids and SIL is trying to push niece out of the way so her daughter can have the job.", "Family members are not entitled to babysitting jobs, especially when a regular babysitter is already established.", "When it comes to choosing a babysitter your child should enjoy spending time with their babysitter. This is so different than ice cream for breakfast.", "It is when part of them preferring her is that they feel comfortable and safe with her.", "And he is NTA…parents are the \\*only\\* ones whose opinion on who babysits counts.", "No, I agree with him. Growing up, I hated when anyone but one cousin babysat because she was the only one I trusted and felt comfortable with. \n\nBesides the babysitting, I rarely saw her because she was in college, so it's not because I was closer to her than other family members.", "Melody's mom is gonna make her say she's busy so Leigh can babysit in that scenario", "Yeah the \"Melody isn't free\" loophole is a major incentive for them to start making sure Melody \"isn't free\" at regular strategic times.", "> \"when Melody is free she is our first choice. If Melody wasn't free, we could consider Leah\" and then just leave it at that.\"\n\nIn another comment, OP states that they go out of their way to avoid using Leah, at all. If Melody is unavailable,  they will change their plans to match her availability.\n\nThis has gone far beyond \"taking away Melody's job\". They are actively avoiding Leah.", "uhhhh we have back up sitters I'll never need to ask Leah. also in an emergency I have 4 siblings all willing to babysit so dont worry about me", "But your idea is still for OP to not, find a new way for Leah to bond with her step-cousins, but you're entirely on stepmom's line here.\n\nLeah needs to be getting Melody's Job.\n\nYou don't see big glaring problem for family-blending, if Melody's Job is taken away and given to Leah?\n\n\"AITA for Hating my Step-mom, because she forced my uncle to give my babysitting job to my Step-sister.\"", "That's fine but OP has to accept if his brother tells him his daughter can't do it anymore or refuses to include him or his family in any activities with his family.", "When it comes to being a welcoming member of the family, there are many paths one could take, and OP has chosen against all of them.", "Or perhaps they are simply parroting their parent.", "INFO: is there a specific reason why Leah you refuse to consider Leah, even as a backup/occasional replacement? \n\nI’m all for parents having the choice on who they want to watch their kids. However, you seem to avoid giving (or being able to give) a reason why you refuse to allow Leah to watch your kids. Obviously your kids are going to prefer Melody if you don’t/won’t have watch the kids, I’d be willing to bet your kids would also say they prefer her to your current backup sitters so it’s kind of a moot point on your part in regard to who they like/love.", "It does not have to be “ taken away “ . Girl babysitting 2-3 times a week. They can take another girl once a week. Even taking her once every couple of weeks will improve bond and family  relationship.", "She's only been doing the babysitting for a few months, not like a job of years' standing.", "I’m sure OP would survive just fine with the inconvenience. That would make the brother and SIL bigger AH than they already are for being that petty.", "He can be welcoming to Leah without leaving her alone with his children. If the kids prefer Melody over Leah they likely have a reason for it.", "My favorite babysitter growing up was a cousin my mom disliked. But she hired her because she was who my siblings and I felt save with and she did a good job. \n\nNot all kids parrot everything.", "Possibly the reason being that OP hasn't let her spend time with them?", "Do you think OP is being welcoming to Leah?", "And yet OP doesn’t want to disclose any reasons.", "OP is obviously under no obligation to use Leah as a babysitter, but I don’t think the post is candid about what OP thinks of Leah, and “because I don’t want to” is a toddler’s response.", "OP can let Leah spend time with the kids supervised. We have no idea if Leah gets to spend time with his children supervised or not. Very concerning so many people think OP should leave his children unsupervised with someone he does not trust to watch them. We have no idea how long Leah has been apart of the family and we have no idea why the children do not prefer Leah.", "I have never personally watched OP interact with Leah and I’m assuming you haven’t either so neither of us know if he is welcoming to Leah at family events or not.", "I wouldn't want to hire anyone but the person my kids feel the most comfortable with either."]}