{"id": 23260, "submission_id": "15b0ik7", "title": "AITA for taking back a tip at a restaurant", "selftext": "I live in a country where tipping isn't the norm. It's not super unusual, but also not compulsory or even expected. If you go out for a group dinner to a restaurant it might be okay to leave some extra on the table for good service, or to get a coffee in a cafe and say 'keep the change', but the average place doesn't expect a tip.\n\nI went out for lunch with a friend yesterday, and I mentioned I had some spare cash for a tip. It's a place that allows modifications to the meals and I have some allergies too so when I feel like I'm being difficult with my order I like to tip as a thank you. When the bill came and I paid on card, I saw on the receipt that 20% gratuity had been added. This is unusual around here except maybe for big groups, and it wasn't mentioned anywhere on the menu, but it was an American chain so probably a custom they get from there.\n\nWe packed up and left, and I picked up the cash I had gotten out for the tip (it was about the same amount as the added gratuity). My friend questioned this and I said it had been added to the card payment. She said it was embarrassing because the waiter probably saw the money, but I didn't get it out until I paid after the meal, it's not like I had it out on the table as bait for good service.\n\nAs we left I saw the waiter go to clean our table, and... yeah very clearly was looking around for the cash and seemed bothered. The friend I went with is now being very passive-aggressive about 'the horrid way I treat service workers', but I don't think I did anything wrong. If anything I think it's slimy that they could add gratuity when it's not the norm.\n\nIt's so much not the norm that I have had waiters be confused or reluctant to accept tips. I'll say 'I made like three modifications and the food was really good' and they've said 'oh haha wow thank you but you really don't need to' to a 10% tip. My friend knows this, but still thinks I 'bait and switched' the waiter.", "created_utc": 1690460673, "permalink": "/r/AmItheAsshole/comments/15b0ik7/aita_for_taking_back_a_tip_at_a_restaurant/", "score": 103, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I did technically get out cash to tip a waiter and then put it away again. My friend thinks I'm the asshole because I'm taking out my issues with a corrupt system on an innocent individual in that system who was bothered by my actions.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "No, the store slipped a 20% mark up on you  without telling you on the menu or with a sign.\n\nNTA", "NTA. If your friend was that bothered by you not wanting to tip double she should have left some cash", "NTA, but a huge shoutout TA to whoever's owning this chain that's subtly throwing in the 20% gratuity automatically with the bill. The servers are getting more screwed over  by their boss because 1) pretty much every customer is going to not tip because they'll assume it's been included and 2) even if the boss isn't pocketting all of that cash for himself he's definitely taking a cut.\n\nRule of thumb imo is that unless you are handing the tip to the servers directly the owners are taking it for themselves. In one of my old jobs where I worked as a server the management tried to get us to hand in all the tips and at the end of the month it would be proportionally split for all of us, but of course the manager himself also had a piece of the cake.", "NTA\n\nI would actually have called the waiter and asked what that gratuity was and where it was advertised that you needed to pay more. And if it wasn't removed I'd leave a complaint.\n\nEither way, I wouldn't be leaving a tip when they charged me for it already.\n\nI'm also from a country where tips are not mandatory. My mother's generation will probably leave a tip. Mine wouldn't.\n\nAnd even when we do leave a tip it's like 1 Euro, 2 tops, even for a big table.", "NTA - there's no reason to double tip, especially if it's unexpected.", "NTA. A 20% mandatory gratuity for a party of two is exorbitant, and in this case it was double dipping. It probably was added because tipping is non standard in your country. While I think you should have discussed your concern directly with the manager (this would have given the waiter an explanation), this was just an awkward situation. \n\nIt was not wrong to take back the tip.", "NTA, the tip was on the bill, so what if the waiter saw it, was he expecting a double tip? Tipping culture is out of hand in the US. Don't let it take over the rest of the world.", "NTA .\n\nIdk where you live and what you have for places their, but in the United States we've got GrubHub that adds a tip by default everytime you order for delivery. I always take the tip off of the delivery and hand them extra cash if they deliver on time and everything. Some restaurants I've been to have put the tip in the bill. I've always thought it was just to make it easy to not do math. If I take off extra tip in a place where it's pretty customary to tip, I don't see you as a AH.", "NTA  \n\n\nBut I hope the restaurant actually passes on the mandatory gratuity to service staff, I've seen stories where owners add a mandatory service charge and then don't pass all or some of it on  \n\n\nThe nice thing about tipping with cash over adding it to a card is that the server gets it directly", "NTA. Normally restaurants add a gratuity for groups of 6 or more. To add 20% to the bill for a table of two is unheard of. No reason to double tip.", "NTA - even in America where tipping is customary, it is not normal to leave an added tip if they've included one on the bill already. You *can* if you think they did amazing service and the 20% somehow wasn't enough, but it certainly wouldn't be expected.\n\nThat said, an automatic 20% tip isn't normal at most places in America unless you have a large party. And why the waiter would be looking for an added tip if one was included is beyond me, though it may simply have been a habit just to ensure nothing was missed since some people stick money under plates and such.", "nta \n\nunited states citizen here. 20% is high af bruh.\n\ni usually don't really go for more than 15%, so for that chain to automatically include 20% is... interesting. usually here they have options so like 10%, 15%, 20%, or custom.\n\ninitially in my mind i thought you were digging through the tip jar to get your money back, but after rereading and you had just left the money on the TABLE? your friend is so dramatic PLS LOL\n\nthe server might have been amazing but you literally ALREADY TIPPED THEM in a country where that is not normal like your friend needs to take their expectations down 10 notches.", "ESH... I am sorry, I understand your reaction, and if you didn't put the tip on the table and just said \"i won't double tip\" I would agree. But you did put the tip on the table and took it back. That is what, for me, makes you an A. But your friend could have let some,  if she was that embarrassed. So she is an A too", "Nta but rips go in waitresses pockets. The service on the bill goes to the boss", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live in a country where tipping isn't the norm. It's not super unusual, but also not compulsory or even expected. If you go out for a group dinner to a restaurant it might be okay to leave some extra on the table for good service, or to get a coffee in a cafe and say 'keep the change', but the average place doesn't expect a tip.\n\nI went out for lunch with a friend yesterday, and I mentioned I had some spare cash for a tip. It's a place that allows modifications to the meals and I have some allergies too so when I feel like I'm being difficult with my order I like to tip as a thank you. When the bill came and I paid on card, I saw on the receipt that 20% gratuity had been added. This is unusual around here except maybe for big groups, and it wasn't mentioned anywhere on the menu, but it was an American chain so probably a custom they get from there.\n\nWe packed up and left, and I picked up the cash I had gotten out for the tip (it was about the same amount as the added gratuity). My friend questioned this and I said it had been added to the card payment. She said it was embarrassing because the waiter probably saw the money, but I didn't get it out until I paid after the meal, it's not like I had it out on the table as bait for good service.\n\nAs we left I saw the waiter go to clean our table, and... yeah very clearly was looking around for the cash and seemed bothered. The friend I went with is now being very passive-aggressive about 'the horrid way I treat service workers', but I don't think I did anything wrong. If anything I think it's slimy that they could add gratuity when it's not the norm.\n\nIt's so much not the norm that I have had waiters be confused or reluctant to accept tips. I'll say 'I made like three modifications and the food was really good' and they've said 'oh haha wow thank you but you really don't need to' to a 10% tip. My friend knows this, but still thinks I 'bait and switched' the waiter.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "nta, i'm in the US, used to bartend, and generally tip well. if a tip is included on the bill i pay exactly that bill amount and nothing more.", "NTA, they literally already took a 20% tip from you. Which, I know some places to add mandatory gratuity for larger parties but it was just you and your friend. It could be considered stealing that they added a tip themselves. You didn’t want to tip twice, which would have been 40% of your bill. \n\nIt seems like your “friend” just wanted to shame you, as she didn’t actually feel bad enough to leave the tip herself.", "Nope NTA....I don't do automatic grats.....I usually tip about 30% but if there's an expectation to a tip with an auto-grat; I don't pay it.", "NTA but I will say you probably should’ve asked, gratuity as some places is split amongst cooks,bartenders,servers and food runners. I would’ve asked if they were getting all of it and if not if you wanted left the difference", "NTA they got their tip. If it is added to the bill I won't tip either", "NTA, gratuity is something that is optional, not just added there, a tip is if you feel like tipping, not something that should be required", "NTA. And depending on where you are in the world it’s illegal what they did.", "NTA", "I was the one to invite her out and said I'd pay, I don't think she had any cash", "Out of curiosity I googled the chain in my country and yep, saw a bunch of articles, some of people complaining about the added gratuity, but far more exposing how little of it actually goes to the working staff", "Also because tip was already added in, I would think any cash on the table could've been just the patrons dividing up the bill themselves.  Like if one put it all on their card, the cash was out to give the person that paid, their portion of the bill.", "In my eyes, thats kind of a dumb thing to fixate on. Who cares if the money was already put out on the table. They already took their cut without her permission.", "Maybe he put the money on the table for a taxi or lift home ? Don't be presumptious", "oh dang, do you know where calling it 'gratuity' fits into that, I thought it was meant to go to servers/kitchen?", "In my mind I don’t really see a problem here, and I am an American who is used to tipping everywhere. I will definitely tip 20-25% for good service, but if it’s added on I’m not doubling it because I’m not made of money.", "In the US, the boss taking part of the tips (or not passing them along at all) is a violation of the law, easily reportable to the department of labor, and the place would get fined to all hell.", "Yeah, maybe it is because of the years I spent as a waitress, I feel bad for him, he saw the tips but didn't get it. Knowing the average, I know waiters need tips. Plus, I am french, waiters never put tips on the bill. So maybe I don't get it the right way.", "You are right, it does - a gratuity listed on the bill does NOT go to the boss like he said.\n\nDepending on the individual restaurant's policy, the tips MAY be pooled amongst employees and not go directly to the one waiter/waitress, but in a case like that it wouldn't matter if it was automatic on the bill or you gave cash.", "It’s so easily reportable but a lot of servers are broke, don’t know about the law or just don’t care. Some all 3 at once. It can take a while for the process and I wouldn’t doubt some are scared to lose their sources of income (which could be another case for retaliation).", "NTA.  The store added the 20% without your permission.  No need to tip twice.  Taking the money back was not an AH move.  It was warranted.", "NTA. Your tip was already added to the bill.", "NTA.  There's no reason for you to add a tip when the restaurant already added a 20% gratuity to your bill.  Had you known in advance that was happening, you wouldn't have put cash out on the table.", "NTA. The restaurant added a decent amount of gratuity on for you. Why would you tip extra, especially if it’s not expected? Maybe the waiter will complain and management will stop doing it, but probably not.  \n\nAlso, in the US they usually add higher gratuity for large groups but there were only two of you. I know you’re not in the US but adding gratuity for only two people seems odd.", "So you were kind enough to invite her out and pay for her meal… meanwhile *you’re* now the asshole because in her eyes, you didn’t leave an additional tip to the one that you’d already paid?! \n\nIs she for real??! The audacity, lol.", "NTA.\nDepending on where you live, if the establishment does not indicate an auto gratuity anywhere it is illegal for them to charge the gratuity to your card. \nYou actually had every right to change that amount. However since you were gonna tip in cash the same amount then you had every right to put your cash back in your pocket", "I'm American and very big on treating service workers properly. Nta.", "NTA we think it's slimy to add an automatic gratuity in the US too, and you often get worse service because they know they're getting their tips no matter what. I would recommend not supporting that chain again. Tip culture is just a way for rich owners to outsource paying their staff to the clients already overpaying for food.", "NTA, even in the USA I do 20% on the card *or* 20% cash, never both. If they want cash, they shouldn't put it on the card.", "NTA.  And tell your freeloading friend to tip next time if she cares so much.", "NTA. Server should mention that the gratuity is included in the bill.", "NTA.  I was a server for nearly ten years.  A 20% gratuity would be standard for larger groups, but not for smaller tables.  20% is the standard that I tip, but I'll tip more if someone goes above and beyond.  \n  \nA server getting a 20% tip has zero right to complain and you have no reason at all to be embarrassed.  If I'd seen money on the table before a guest departed and it wasn't there when I got to the table, I'd certainly check to make sure it didn't fall on the floor or anything, and then be happy with my 20%.    \n  \nYour friend has even less right to complain and/or be embarrassed.  If she continues to press the issue, I'd have a frank discussion with her and let her know you don't know why she's decided to fixate on this or continuously ridicule you over it, but she needs to stop or you'll be re-evaluating the friendship.", "Nta. Why didn’t you friend leave a típ themselves if they were that offended?", "NTA. \n\nIn America, it’s common and expected that if a gratuity will be added to the bill automatically, this is advertised somewhere on the premises - typically on the menu. Wording is something like “20% gratuity will be added for parties of 6 or more.” Doing otherwise is considered scammy here, so I feel it would be even moreso in a country where gratuity is not built into restaurant pricing models.", "NTA…work as a server and if you autograt you don’t get to expect extra money. The only thing I would have done is let the server know that cash wasn’t taken by someone but that you didn’t realize they autograt you.  So the tips on the card receipt.", "I bet the place doesn’t even directly give it to the waiters, or “uses it to make up part of their salary”, since tipping isn’t common in that area there probably aren’t laws protecting the distribution of the tips.  OP is still NTA, because it should be going to the waiter, but the place seems pretty sketchy from what little we know (including the waiter being surprised not to get the additional tip).  Personally I doubt I’d go back to a place like that.", "Yep. NTA.", "NTA. Tip culture in the United States has gotten out of hand because companies would rather guilt trip customers into making up their slave wages instead of paying them a livable wage. Almost every business has tip prompts on the pay screen now, even self-serve places. Aside from this, it's not fair to you or the rest of that restaurants customers to be charged gratuity without being told. That's shady. It's not the norm for the majority of American establishments.", "NTA\n\nTipping isn’t common AND they charged a 20% gratuity?  No way I’d leave a tip.  Rounding up is one thing and common when paying cash in a non-tipping culture.  That 20% gratuity seals it though.  Nope.", "So if you had not picked up the cash you left on the table, you would have been leaving a 40% tip? \n\nNTA at all."]}