{"id": 23291, "submission_id": "15bcrjs", "title": "AITA for leaving my job while my boss is almost due to have a baby?", "selftext": "I work at a dog daycare and we don’t have that many people as staff (4 full time and 3 part time). When ever one of us need to take a day off, we become understaffed. My bosses are  pregnant and they usually help out but now that they are a month from their due date and we still haven’t hired anyone to replace 2 part timers that are leaving soon and the 1 full timer who quit earlier on in the year. \n\nI am a student so I work part time but I am usually called onto work when my bosses go out of town. I have been working at this establishment for over a year and have become a favorite among the employees and dogs. I have promoted to a manager position 6 months ago but when the other manager quit, the position became a rotating role. I never got a raise for my promotion because when everyone is a manager, it makes it even out. \n\nI feel like my boss is holding me back from progressing in this job. I have made it a point that I want to learn how to run the front office so if coverage is needed for the one office lady, I can help provide it. To make this even a further point, I used this job as a way to get school credit and made it a goal to learn the office. \n\nI am honestly burned out from this job. I come home with not wanting anything to do with my own dogs. I am now looking during my lunch break for other jobs to pursue in my last semester of school before I start the process to get my teaching credential. \n\n So the big question is AITA if I quit my job right before my boss is due to have a baby or should I stick it out and find a job while I student teach?", "created_utc": 1690490260, "permalink": "/r/AmItheAsshole/comments/15bcrjs/aita_for_leaving_my_job_while_my_boss_is_almost/", "score": 62, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Leaving my job while we are already understaffed and my boss is almost due to have their baby\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - You are not responsible for your boss or the company.  You are an employee who seems to be trying to do the right thing but is not really being appreciated.  Bottom line - you don't owe them.  You could go in and explain your thinking and see if they change anything, but, unfortunately, you probably have to quit to get them to take you seriously.", "NTA \n\nYou are not responsible for their incompetence or for managing their stress levels. Pregnancy or not, they don’t seem to have a grasp on managing the business anyway. Do what’s best for you.", "NTA - but my advice is that it's better to look for another job while you're gainfully employed instead of looking for one while you're not. \n\nHaving said that - if you need to get out of there for your own well-being, do it, and don't look back. They can find new employees.", "Nta\n\nTheir failure to plan isn't your problem, just like their inability to run a business isn't your problem. A rotating manager system where no one gets a raise, but everyone gets more responsibility is a terrible idea. \n\nLeave there and find a place thar is run by people that know how to run a business.", "NTA.\n\nYou take care of you.  I believe you are an \"employee at will\" and not a serf to their fiefdom.\n\nThey are not taking care of the business.  That is NOT your problem.  You don't owe them anything but to do your job.  They will figure it out.  They haven't hired anyone cuz they don't have to.  They just burn out their existing employees.", "NTA. You don’t owe them anything.", "NTA, unless you’re the baby-daddy you owe them nothing with regards to their pregnancy. If you think things are tight now wait until they have a new baby which will dump more into your lap to pick up the slack. \n\nYou are responsible for yourself and yourself only in this situation. I wish you happy (job) hunting!", "NTA. They're understaffed and doing nothing to change thatt", "NTA. Give your 2 weeks and move on with your life. You're an employee, not a family member. It's a financial agreement, not a personal commitment.", "NTA.\n\nYou are merely an employee. Any job that gives you a promotion w/o any compensation changes justifies leaving.", "You don’t owe anything to your job.staffing is not your responsibility", "NTA -  Their insufficient staffing and lack of cross training is on them; not you. They also chose to not give you more compensation, or cross train while watering down the title, 'Manager'. You are responsible to you; your goals and future. Don't get sidetracked feeling guilty about things you do not control; their decisions, business staffing, etc. Take the good from this experience and more on.", "NTA\n\nIt isn't your responsibility to properly staff the establishment.  \n\nAnd as an employee, you definitely don't want their workload falling on you when they have that baby (coincidentally right when fall classes start).  Give them two weeks notice and get out before things get worse.", "NTA. At all. Never hesitate to leave a job if they're not treating you right.\n\nIt's their fault there aren't enough staff. They have to deal with that.\n\nDo try to get another job lined up before you quit this one. It's easier to get another job when you're currently employed.\n\nGood luck!", "NTA, lookout for yourself, your boss is doing the same thing.", "Your boss is purposefully understaffing to keep overhead low to make more profits. Their inability to run a business property is not your problem. Get another job. NTA", "NTA \nyou have to look out for your mental wellbeing too. If this job burns you out, it’s not the right one. You don’t owe them anything, it’s not your fault that they didn’t hire anyone for the open positions yet.", "NAH\n\nIf you’re at an “at-will” job, you can leave at any time for any reason. It’s up to upper management to hire people.", "Not unless you put the baby in them.", "NTA.  What you owe your boss is two weeks' notice.  Other than that, you have been an exemplary employee and have more than earned the pay you've received.  Do what is right for you.\n\nIf you got run over by a bus, they'd simply run an ad and replace you.  They can do the same, even though you're walking out on your own two feet.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI work at a dog daycare and we don’t have that many people as staff (4 full time and 3 part time). When ever one of us need to take a day off, we become understaffed. My bosses are  pregnant and they usually help out but now that they are a month from their due date and we still haven’t hired anyone to replace 2 part timers that are leaving soon and the 1 full timer who quit earlier on in the year. \n\nI am a student so I work part time but I am usually called onto work when my bosses go out of town. I have been working at this establishment for over a year and have become a favorite among the employees and dogs. I have promoted to a manager position 6 months ago but when the other manager quit, the position became a rotating role. I never got a raise for my promotion because when everyone is a manager, it makes it even out. \n\nI feel like my boss is holding me back from progressing in this job. I have made it a point that I want to learn how to run the front office so if coverage is needed for the one office lady, I can help provide it. To make this even a further point, I used this job as a way to get school credit and made it a goal to learn the office. \n\nI am honestly burned out from this job. I come home with not wanting anything to do with my own dogs. I am now looking during my lunch break for other jobs to pursue in my last semester of school before I start the process to get my teaching credential. \n\n So the big question is AITA if I quit my job right before my boss is due to have a baby or should I stick it out and find a job while I student teach?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- as long as you follow any giving notice or anything like that that your location demands.\n\nIt sounds like you were supposed to be taught a certain skill and you were not.  You deserve to grow.  \n\nIf it makes you feel better, a boss tried to intimidate me to work Christmas Eve.\n\nAs an attempt to guilt trip me they told me that they then would have to work Christmas Eve.\n\nI was okay with that.", "NTA. Look at how much energy you have put into this company, and then look at how much energy they put into keeping their staff happy. You told them the problems and they ignored them. They ignored the staffing issues as well. Don't ever put a company before your mental health and personal needs. Yeah it sucks for them, but if it is too big of an issue for them they will try to come to an agreement to get you to stay.\n\n If anything this is the best time to leave and put pressure on them to treat their employees a bit better. Owners tend to forget that employees don't get a share of the company like they do, we get the leftover pennies and then they wonder why we aren't as enthusiastic as they are.", "Did you impregnate them? If not, you’re NTA.", "NTA - but if student teaching is anything for you like it was for me, don't expect to be working much.  We were strongly discouraged from working (but we were also taking a lot of classes)", "Clearly your boss only owes you a paycheck.  You're not seeing much else. In return, you only owe the courtesy of a 2-week notice.  And even that is a gracious gesture.\n\nYou look after you - your boss isn't.", "Nope, quit the job and find a new job.  NTAH.", "NTA", "Decide how much you think you should be paid. Ask your boss for that raise. If she says no, quit. You don’t owe bosses anything they’re not paying for.\n\nNTA", "No. They are a couple and achieved that themselves. They’re both my bosses", "NTA.  It’s not your fault that the boss hasn’t hired enough employees.  That’s not your job. If you’re even enjoying your home life (dog) less, and not getting the training you thought you would, it’s time to move on.  A job is not about “loyalty” when they aren’t “loyal” enough to hire the minimum crew to keep their employees from getting burnout.  Good luck on your job hunt. I hope you find a great one.", "This. It looks like they don't appreciate their employees. This could be the reason for their high employee attrition. Take a cue from your ex colleagues and quit.\nYWNBTA if you quit."]}