{"id": 23344, "submission_id": "15c0rb1", "title": "AITA for cancelling babysitting last minute when my sister had to go to work?", "selftext": "I (f19) have an older sister (f27). She has two kids, f6 and m1. \n\nMy sister and her husband both work night shifts and she asked if I could come over to their house to watch the kids overnight. I told her I have work the next morning at 9am so I need to be able to rest. She said they both sleep through the night and they go to bed at 7pm so they won't be any trouble and begged and pleaded for me to babysit because she and her husband need the money, and said she'll set up a bed for me in their living room.\n\nI caved and agreed to babysit, I arrived at around 5pm and the youngest was just waking up from a nap!!!! My sister said he has just been down for a \"quick 3 hour nap\". I don't even have kids but I know damn well he's going to be up late. I told her absolutely not, I'm not babysitting tonight anymore, you said they'd sleep through the night and you know i have work tomorrow morning.\n\nShe got really angry and said I'm selfish for cancelling so last minute over such a stupid reason. I refused to argue with her and said she and her husband need to find other arrangements because this is not going to work, and I left.\n\nShe later texted me a paragraph about how it's such a small ask and that the kids keep her and her husband awake all the time and it's not a big deal for me to have just one sleepless night, that it's hard for her to be sympathetic for me. She said I'm being dramatic and need to get over it.\n\nAm I the asshole??", "created_utc": 1690558466, "permalink": "/r/AmItheAsshole/comments/15c0rb1/aita_for_cancelling_babysitting_last_minute_when/", "score": 41, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1: I cancelled babysitting my niece and nephew at the last minute\n\n2: My sister and her husband needed to go to work and I majorly inconvenienced them and let them down, and I could've sucked it up and babysat anyway because I said I would initially\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your sister pretty clearly said that she knew you'd have a sleepless night, despite initially claiming otherwise.  She doesn't seem to understand that parenting sometimes sucks and non-parents have no obligation to do it.  NTA", "NTA. She lied to you to get you to agree and completely ignored the fact that you need your rest as you also have work. \n\nIt is not a small ask and she knows it. If it was, she could've easily gotten a real babysitter.", "Nta\n\nShe lied, there is no way a kid is waking up at 5pm from a nap and going back to bed 2 hours later. They need the money, and apparently they think you *don't* need money, because them working is more important than you working. \n\nThey are parents, so they can't *both* work night shifts anymore. If one is day, one is night, so be it, if they become passing trains in the night for the next couple years, it's what they chose by becoming parents.", "NTA it's their kids why should you ever suffer sleepless nights because of them", "Nta\n\nYou are doing someone a favour and they try and bait and switch you by lying. Not acceptable.\n\nCancel move on.\n\nIf anyone asks why you would cancel last minute the only acceptable answer is because it was the last minute when you discovered that sister was lying to you.", "NTA. But woo boy, is your sister an AH. She thinks it’s “a small ask” and “not a big deal if you have one sleepless night” and that it’s “hard for her to be sympathetic” because she thinks she and her life choices are more important than you and that her needs take precedence over yours. She seems to feel very superior to you because she’s older and has children. Keep standing up for yourself because your life choices and needs matter. \n\nOh, and a three hour nap is never a “quick nap”. She’s an AH just for saying something so stupid.", "NTA. There is no way that child will go back to sleep 2 hours later. What on earth was your sister thinking.", "Definitely NTA. And I applaud your extremely mature way of handling it. With that being said, continue that  mindset and don’t even reply to the text.  If you already did, don’t engage any further. It took me almost 50 years to learn what you appear to already know: do not engage arguments about things that you are in control over.", "So she KNEW the kid would keep you awake, she admitted it?\n\nNTA", "NTA\n\nYour sister knew perfectly well no way were her kids going to bed 2 hours after getting up from a really long nap.\n\nThey have two kids. They should have regular childcare arrangements in place. Not to mention, it should be obvious that unless they have a regular babysitter, both parents can't work the same shift. I had friends who worked opposite shifts (one did days, the other nights) until their youngest was in kindergarten because they couldn't afford daycare. They did what they had to do. These are your sister's kids, not yours and if someone needs to have a sleepless night, it's your sister.", "So she lied to you and then got angry of the consequences of her lies? Your sister is immature and selfish af. I feel bad for her kids.", "NTA.  She lied about the job, so you don't have to take it.", "NTA.\n\nDick move from the sister here.", "NTA. Your sister sucks.", "Good for you!!   For not caving when she proved that she didn't care one whit about your schedule, only about her own needs.\n\nNTA.  You're awesome.  And very mature for your age.  Brava.", "Nta.  You're a smart girl.  At that age i dont know much about kids but you do and dodge bullet.  Im proud of you.  It not your kids not your sleepless night.  And your sister's suck.  I hope you will not  babysitting for her anymore.", "NTA\n\n&#x200B;\n\nShe lied to you. Srtop babysitting for her.", "NTA, she tried to trick you and got found out. No more babysitting for her.", "Oh wow. I was so ready to call you TA for making assumptions about the kid's sleep schedule and canceling for probably no reason (my one-year-old can easily nap until 5, then go down at 7:45 and sleep through the night until 7 or later), but then I got to the point where your sister revealed she expected the kids to keep you up all along. Big NTA.", "Is she even paying you?\n\n> it's such a small ask and that the kids keep her and her husband awake all the time and it's not a big deal\n\nLol no. They ain’t your kids. Good on you for standing up for yourself, NTA.", "ESH\n\nLots of one-year-olds will wake from a 3 hour nap at 5pm, and then sleep through the night again at 8. So your assumption that he wasn't going to go to sleep is probably false. Afternoon naps are completely normal for one-year-old children.\n\nI was all set on calling you the asshole until your sister admitted that she had been lying to you, and that her younger kid does not in fact sleep through the night. Because \"can you sleep in my house because I can't leave my kids alone in the house while they are sleeping\" is a completely different request from \"my one year old will be up half the night. Can you babysit?\"\n\nSo the only reason I'm calling you an AH at all is that you didn't know she'd been lying about her kid's sleep patterns until after you bailed out on her.", "This is a hard one but I'm going to say YTA. But your sister was too. It was wrong of her to push that on you, and to risk your sleep. But it's also wrong of you to cancel at the last minute when you had agreed and they were counting on you. IMO you should have stayed and when she came back made it clear you wouldn't be babysitting for her again in the future.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f19) have an older sister (f27). She has two kids, f6 and m1. \n\nMy sister and her husband both work night shifts and she asked if I could come over to their house to watch the kids overnight. I told her I have work the next morning at 9am so I need to be able to rest. She said they both sleep through the night and they go to bed at 7pm so they won't be any trouble and begged and pleaded for me to babysit because she and her husband need the money, and said she'll set up a bed for me in their living room.\n\nI caved and agreed to babysit, I arrived at around 5pm and the youngest was just waking up from a nap!!!! My sister said he has just been down for a \"quick 3 hour nap\". I don't even have kids but I know damn well he's going to be up late. I told her absolutely not, I'm not babysitting tonight anymore, you said they'd sleep through the night and you know i have work tomorrow morning.\n\nShe got really angry and said I'm selfish for cancelling so last minute over such a stupid reason. I refused to argue with her and said she and her husband need to find other arrangements because this is not going to work, and I left.\n\nShe later texted me a paragraph about how it's such a small ask and that the kids keep her and her husband awake all the time and it's not a big deal for me to have just one sleepless night, that it's hard for her to be sympathetic for me. She said I'm being dramatic and need to get over it.\n\nAm I the asshole??\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, she lied to you, set you up for failure, then got mad about you reacting like a normal person and put the onus of raising her children on you through guilting you afterwards. Your sister is 100% an AH here.", "NTA. \n\n>it's such a small ask and that the kids keep her and her husband awake all the time and it's not a big deal for me to have just one sleepless night, that it's hard for her to be sympathetic for me\n\nSo she admitted to lying. Yeah, no. She can find someone else to babysit. You are not the parent, so you don't have to sacrifice your sleep for her kids.", "A 3 hour nap?! No wonder the kid keeps people awake. That's way too long for a \"nap\".", "It’s such a good lesson. Let these types throw their tantrums and argue with themselves. They can sort out the logistics of their own choices.", "100%", "But the reason why she agreed to babysit was because the sister had said that they will go to sleep around 7 but the kid just woke up. So it's on the sister not OP because she was the one who lied first. \nOP only agrees because the kids would go to sleep around 7, she did not sign up for being a free babysitter to kids who she will look after for the whole night. She also has work the next morning. \nSo no, it was not wrong to cancel it at the last moment.", "> This is a hard one\n\nIt is about as hard as a baby's dick.  The sister lied to her so she had every right to cancel last minute.", "Plus you'll get to see the real colors when you don't engage and they get themselves all fired up.  Then the real them comes to light."]}