{"id": 2338, "submission_id": "yvc6z5", "title": "AITA for leaving the delivery room before seeing my newborn?", "selftext": "I (m22) and my girlfriend (f21) had our first baby boy yesterday. I'm beyond happy and grateful, never knew being a father would make me feel this way and fill such a huge part in my life. My girlfriend is an amazing women and i know she'll be an amazing mom.\n\nIt was yesterday when she went through labor and I wanted to be available for her and our child as much as possible (which is my duty). I was in the delivery room with her and she did want me to stay with her, the problem was I started feeling really nauseous when she was giving birth. I tried to look away  hold my breath and do some breathing exercises. It was helping but at some point I started to feel sick to my stomach. I tried to stay until she has given birth and i left right when i heard our baby's cries and the staff congratulating us, perfect timing because I did throw up once I entered the bathroom. I went back right away and my girlfriend was visibly upset. She ignored me until we were settled in our private room. I went to finish some legal papers and by the time i was done visits were open and her parents along mine and some of our siblings were there, she mentioned how i couldn't even wait a little to hold our baby before leaving, everyone backed her up and i did apologize and I've been trying to make it up to her but it's embarrassing because she has been mentioning it to any visitor and that's all they've been talking about since yesterday. I tried to tell my sister to brush it off but this made it even worse and they're saying i should stop being an AH and own up to my mistake which i am doing. \n\nThis is not a new thing for me, I do feel nauseous at the most inappropriate times and everyone who knows me knows that too. I did feel bad for not being there to share our son's first moments but I'm pretty sure she wouldn't be happy to have me throw up in the delivery room but she doesn't want to hear any of my \"excuses\" anymore. AITA?", "created_utc": 1668458996, "permalink": "/r/AmItheAsshole/comments/yvc6z5/aita_for_leaving_the_delivery_room_before_seeing/", "score": 355, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) for leaving the delivery room before seeing my newborn\n2) because I wasn't able to be there for my girlfriend and our son's first moment\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you left due to an illness and came back ASAP. If I were you I’d get a quick phrase and use it every time to shut people down. “I had to puke, it was unfortunate timing. Let it go.”\n\nCongratulations on your bundle of joy.\n\nSincerely,\nA pregnant woman\n\n\nEdited for spelling", "I hesitate to call you an asshole but I completely understand why your gf is so angry with you.\n\nWhile you cannot always control how your body reacts to things you could have said \"I am going to throw up,\" and grabbed a bin from inside the room. Your gf was at the tail end of what was probably a long, painful and exhausting birth process, and she probably feels like you put your (relatively to hers) brief discomfort over what she'd just been through/was going through. Labour is a very scary time for some people and you literally walked out the door right at the point you were both waiting for.  She probably feels like you didn't care enough to stick it out and would have much preferred you to vomit in the corner so that you stayed with her. And tbh, when one partner is in labour I do feel like the labourers needs outweigh their partners (obviously there are certain exceptions to this).\n\nDefinitely try and apologize again and try your best to help her during the postpartum healing process and hopefully she'll end up thinking you running to go vomit is funny once she's had some time.\n\nETA: NAH", "NTA. (Don't do this) throw up on the baby look at the family and ask is that what you wanted? But seriously tell them reddit said stop being AHs for berating you. Many father's aren't even in the hospital the day their child is born and it's a experience that leave many sick. Maybe bring in YouTube and have them watch surgeries or something equally disgusting in the background while your explaining this and if they leave the room give them hell that they can't sit through a small lecture.", "NTA.  I mean sure it’s a once in a lifetime moment, but I think excusing yourself was the best move, especially since you actually did vomit.  Vomiting in the room would just cause more work for the staff and cause you a good deal of embarrassment.  It’s not like you left the room to answer a phone call.", "NTA-you didn’t do it on purpose. And yes, throwing up in the delivery room would have been worse. Your gf and family need to give you a break here.", "NTA, you were about to give the staff another patient (you). You did the right thing by ducking out until you felt better.  She needs to understand that.", "NTA, some dads pass out in the delivery room and nurses have to divert their attention away from the mother. Leaving was more considerate.", "I'm gonna be different as say NAH. You were going to puke, it's good that you left the room before it happened all over the place. You tried to be there for as much of the labour as possible. However, your gf just gave birth and is rightfully a bit miffed that you seemingly disappeared right at the most important part. She's just gone through the most intense thing she'll ever do and emotions are high. You'll both laugh about it in the future.", "NTA - noone wants you to throw up in the delivery room.", "NTA. Would they rather you stay and throw up on the baby's head?", "ESH, but hopefully you two can work through it together.\n\n> I'm pretty sure she wouldn't be happy to have me throw up in the delivery room\n\nI dunno, dude, I think she’s making it pretty clear she *would’ve* preferred you just ask for a bucket or bedpan or some other nearby receptacle than miss a moment you’re never getting back.  It’s not like they weren’t going to have to clean the room anyway.\n\nThat said, you *can’t* get the moment back.  She can either accept that and focus on all the good memories and first times to come, or she can keep dragging this into it.  Apologize one last time without any attempts to justify yourself, maybe take advantage of being in the hospital to see if there are any resources that can help you work on controlling your urge to barf better in future, and see if you can move forward from there.", "NTA. I would talk to one of the nurses and have them explain your situation as well.  Having been a nurse and having watched multiple SOs try to \"tough it out\"...you did the right thing for both the babies and your gfs safety.", "Next time should he puke on the baby just so he can hold it s__/.\n\nHe didn't leave too be mean, who likes to smell puke?", "I mean would she have preferred you threw up on the floor? Like I don’t understand", "Nta. Birth is gross. Coming from a woman who birthed her baby and was throwing up the entire time I labored with her. The smells are freaking gross", "NTA \n\nYou can't help how your body deals with things. You might have missed the exact birth moment as to not make a terrible mess...but you were there to be her support for the worst. Would it have made a difference if you had fainted as some men do? Vomit vs fainting...both embarrassing to dad but not uncommon.", "NTA...your bodily reaction is your bodily reaction. You did the most polite thing you could under the circumstances.  A little good-natured teasing might be in order, but nobody should actually be upset.", "NTA def was the move to not vomit on mom or newborn or staff.", "NTA where I live husbands/partners are only allowed to be in the delivery room if they are sitting because alot of guys faint or puke during delivery. \n\nYou being right here doesn't matter as much as saying what the hormonal person who just expelled a living organism from her body wants to hear.", "NAH \nHer reaction is valid, you missed the one moment you can never experience again, regardless of the reason. \n\nWhy didn't you or anyone else bring up your queasiness beforehand? The hospital staff is definitely used to the father passing out or feeling sick, you could've prepped for that and had a barf bin next to you. \n\nThere were definitely changes that could've been made but I think this can be something you laugh about in the future. At the end of the day, you're both blessed to have been together during that whole experience and to come out with a healthy family.", "NTA it’s unfortunate, and I’m sure you already feel awful as it is, but you can’t control nausea. Rather than tell random people what happened, I’d think your wife would be more concerned with the fact she just brought life into the world, but okay. Mazel tov either way", "NTA you had an uncontrollable human reflex and better the bathroom than the delivery room!", "NTA, lots of men have issues with child birth. You stepped out to throw up after the baby was born and came back. Would she have preferred you vomit on the baby?", "NTA - seriously it’s puking and this is normal for you apparently. What alternative did you have?!? Vomit on her and the baby?!? I’m wondering if she’s taking the vomiting as a personal jab or something over labor.", "NTA ask your girlfriend if she would rather you puke on her? Since it was so important you not leave the room.", "NTA - You can’t control how your body reacts sometimes. Goodness, I’d think someone who went through 9 months of pregnancy would be the most understanding of that. I do get that emotions and feelings were high and she probably felt she needed you in that moment, but what did she want you to do? Barf on your newborn?\n\nI understand her being a little upset in the moment, but for her to tell everyone that visits about it? To drag it out days later? To get everyone else to guilt you and effectively rob you of your new joy in being a dad? This is just cruel at this point. It sounds like she cares more about that one moment than the actual baby. No, I wouldn’t even say you made a mistake here. You knew your limit, you stepped away, you gathered yourself, you came back as soon as you were able. I think you handled it very well.", "Soft yta. This isn’t a new thing and it sounds like it’s caused by stress. You should have handled this before delivery day. Take an anti nausea medicine or maybe ask your doctor for something for anxiety. Instead of being proactive you were absent and it was probably preventable. Thumbs down. If you had tried literally anything my answer would probably be different. If you parent this way I feel sorry for your kid and your girlfriend. It’s your job now to anticipate problems and fix them before they become problems. You can’t drift through life after you become a parent, you have to actively think and plan for your kids’ needs.", "Going against the grain here but YTA. You have a history of nausea at bad moments. You had 9 months to deal with that and be there for your GF who was going through horrible pain and probably her own nausea. Man up. And throw up in the garbage in the room if you had to.", "NTA. My uncle passes out at the sight of blood.  So you can imagine how he would have been in the delivery room. You left to vomit elsewhere before returning, did your gf really want you vomitting in the room with her taking some of the medical professionals attention off her & your baby, when you knew what was going to happen and how to handle it.", "NTA. You were throwing up, it's not like you didn't care. I would have felt incredibly bad for my husband if that happened to him while I was giving birth, I would have never been mad at him for it.", "NTA. What did she want you to do, throw up all over her or throw up in the bathroom?", "NTA.  You can't control feeling nauseated, but you can (and did) control your reaction, in ORDER TO PROTECT HER.  (Sorry for caps but she needs to understand this.)  Your gf is full of hormones and perhaps feeling that you don't fully appreciate what she went through.  When she brings it up, even in front of others,  \"Honey the last thing I wanted was to make that harder for you, you were amazing...\" attitude is best until things settle down.  Eventually, you two need to discuss how to work out these things but not now....", "Nta the birth process is a pretty graphic sight and it's common for partners to throw up, get nauseous, and or to pass out you did everything right and nothing to be embarrassed about.... congratulations on the baby boy 👶🍼", "NTA\n\nYou were sick. And yes, you could have puked in the room, but that would be gross, so you left to do it in the bathroom, like a civilized person.\n\nDoes she know that? Does she know about your issue with throwing up easily? Because if she knows both of these things and is still making an issue of it, you have a definite relationship problem that needs discussing. \n\nAnd if she doesn't know you left to get sick, then you need to tell her that. In private. Should have done that immediately. Because now she seems to think that you just didn't care about seeing your newborn child and you haven't disavowed her of that notion.", "NTA Birth is kinda gross. You need a minute", "I don’t think that you are the AH at all, but the timing couldn’t have been worse. Again you did your best, but having had a husband who left while I was laboring(I can’t have a epidural, so he couldn’t stand me in that much pain) as much as she will forgive you and will understand once things calm down. You unfortunately will never ever be able to make that up to her. It is forever going to be burned into her head. She won’t hold it against you, but that memory of your child’s first moments and you not being there have ruined that for her.", "INFO - *did* you hold the baby before leaving (after you came back from vomiting)? I know you said she was ignoring you, but did you get to hold your son before working on legal papers? If not, why not? Were you lightheaded? And were the legal papers work, or legal papers related to having just had a kid? \n\nIf you didn’t hold your son before leaving to do the paperwork, YTA - UNLESS it’s that you were worried about subsequently passing out or dropping him. \n\nIf you were doing work on the day of your son’s birth, YTA.\n\nIf you held your son before leaving *and* the paperwork was inre to the child, then NTA.", "NTA for excusing yourself to puke and go right back into the delivery room. \n\nYou had time with her and the baby before you had to leave to do the paperwork, right ?", "YTA.\n\nYou do realize that delivery generally involves vomiting just before the baby is born and also defecating? So it's perfectly acceptable for her to experience this in front of strangers but you just had to leave the room to attend to your own needs while she was pushing a baby out of her body?\n\nYou need to do better.", "NTA\n\nI don't think she is either, honestly. She literally just gave birth & her hormones were likely a disaster. Add to that the media portrayals of fictional 'perfect birth' scenarios she's been exposed to most of her life, it's understandable that she was upset. I suspect she'll get over it, just give her some time.", "NTA, you literally threw up. did they want you to throw up on the baby?", "YWBTA if you don't allow your wife to be upset about this. \n\nEven though you didn't do it on purpose, it is still a very sh**ty thing to happen to her. \n\nShe's also probably a little bit embarrassed her natural bodily functions made you throw up (even though I think  the stress of watching your spouse go through something like that is a fair reason to get sick).\n\nShe was the most vulnerable shes ever been, I imagine she is getting a bit of reassurance from laughing about it and having your friends and family back her up.\n\nEdit to add: best thing to do is to acknowledge how crappy it must of been for her, rather than get caught up defending yourself.", "Yes, you didn't want to throw up in the delivery room, but why couldn't you return afterwards to see your son? The legal papers could have waited.\n\nEDIT: Sorry, I misread this. You did go right back. Goodness, it sounds like she wanted you to risk vomiting while holding your newborn! NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (m22) and my girlfriend (f21) had our first baby boy yesterday. I'm beyond happy and grateful, never knew being a father would make me feel this way and fill such a huge part in my life. My girlfriend is an amazing women and i know she'll be an amazing mom.\n\nIt was yesterday when she went through labor and I wanted to be available for her and our child as much as possible (which is my duty). I was in the delivery room with her and she did want me to stay with her, the problem was I started feeling really nauseous when she was giving birth. I tried to look away  hold my breath and do some breathing exercises. It was helping but at some point I started to feel sick to my stomach. I tried to stay until she has given birth and i left right when i heard our baby's cries and the staff congratulating us, perfect timing because I did throw up once I entered the bathroom. I went back right away and my girlfriend was visibly upset. She ignored me until we were settled in our private room. I went to finish some legal papers and by the time i was done visits were open and her parents along mine and some of our siblings were there, she mentioned how i couldn't even wait a little to hold our baby before leaving, everyone backed her up and i did apologize and I've been trying to make it up to her but it's embarrassing because she has been mentioning it to any visitor and that's all they've been talking about since yesterday. I tried to tell my sister to brush it off but this made it even worse and they're saying i should stop being an AH and own up to my mistake which i am doing. \n\nThis is not a new thing for me, I do feel nauseous at the most inappropriate times and everyone who knows me knows that too. I did feel bad for not being there to share our son's first moments but I'm pretty sure she wouldn't be happy to have me throw up in the delivery room but she doesn't want to hear any of my \"excuses\" anymore. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I get her perspective but OP puking in the middle of the room would honestly have been a lot worse - it’s a medical environment and the entire lady-garden is on display and someone’s spewing their stomach contents? No gtfo, go clean yourself up, and don’t introduce yourself to your brand new baby with vomit on your chin. \n\nIt’s a crappy situation, but hopefully she’ll realise she’s being ridiculous sooner or later. Especially since it’s a well-established fact that you cannot control your stomach’s response to visual stimuli sometimes. Add to that the scent of blood and everything comes with childbirth and it’s frankly more surprising we don’t see more “atia for throwing up during childbirth” posts.", "INFO - did you hold the baby before guests arrived?", "NTA\n\nSo, were you supposed to throw up in the delivery room? Good that you left.", "Did she want you to puke on the baby?? NTA, she's mad at the situation but venting it out on you.", "Going NAH\n\nShe just pushed a human out of herself. She couldn’t just “walk away” so she was upset. I get it. \n\nYou have a real physical reaction to stuff. You held on as long as you could. Can you imagine the chaos of you had vomited right there? Yikes. \n\nBe kind and gracious to each other. And hopefully in a year or so it will be a funny story to tell. \n\nCongratulations!!", "Guess they would have been happy if you had vomited all over the newborn and the new mom. Yeah, that would have been so much better.", "NTA", "NTA. What did she want you to do, puke on the baby? ( A friend did this once. Hilarious story in hindsight but not at all funny at the time)", "NAH", "Yta, but slight. It's not like it would have been the only bodily discharge in the room. And if this is so recurrent why did you not address it beforehand? The literal moment you become parents you leave the room for an issue anyone could have seen coming a mile away and there is no way it did not briefly occur to your lady that this is how parenting with you is going to be. Kid breaks an arm, dad runs to vomit. Natural disaster, dad runs to vomit. Spelling Bee winner? \"Where's dad? Oh, he's vomiting. \" It may sound extreme but so if your thought process when pushing out a human. Apologize. Again. Tell her you're going to the doctor to have it addressed. (They make medicine) Then tell her you're uncomfortable with continuing to be the Butt of the joke about and ask her if y'all can move on.", "YTA.  You literally have had no role in this for 9 months and this is how you handle it right off the bat? If you knew this was your history, had you notified the nurses, had you planned ahead for this potential?  From your wife's point of view,  you let her down big time in an incredibly vulnerable moment meant to be a sweet family coming together moment.   Good luck trying to come back from this.", "NAH. You are both dealing with biological stress. You handled things well but she’s probably overly emotional and having hormonal irregularities. Things will be ok. Congratulations!", "NAH for everyone's feelings but your wife could be a bit more understanding, hell people pass out watching the birth of their child, and think how much more shit you'd be in if you had vomited on your newborn.", "NAH. It's understandable that she wanted you to be there; it's also understandable that you didn't want to throw up in the delivery room.", "NAH. She wanted you there for a very special moment. You didn't want to possibly vomit on her or your newborn. Congratulations by the way.  I know 2 dads who waited outside because their own spouses knew they would pass out or vomit from watching the birth and all the bodily fluids that are involved. No body wants to deal with dad passed out or sick during a birth.", "I mean she's sweating bleeding tearing maybe shitting herself at that point, she just didn't care about a lil vomit ...and more probably felt like she was losing it and you got to choose how much to engage with that, she did not have a choice about stepping out of the scenario. She wanted u in it with her, not pretending to still have niceties and civilization. Try n understand where she is coming from.", "NTA. You're not the first, but cut her some slack while her hormones are going crazy.", "NTA.  This is because it looks like this was a reflex action but one that could have been predicted.  I am not sure but do get the sense that with your history that you did everything ahead of time to try to mitigate this reflex.  For example, a family member of mine would throw up due to nerves prior to their sporting games.  We tried many things from positive mental exercises, listening to music, and the like.  We finally found a process that works but do keep an awareness of their reflex even though throwing up hasn't occurred since finding the process that works for them.  I got this from your gf's reaction that she doesn't want to hear your \"excuses\" which leads me to think that you haven't explored all avenues to try to ~~mitigate~~ the reflex.  I hope you work on this to try to help prevent it for the future., as you age you will start to regret missing these types of milestones.", "NTA.  Sounds like you held off on running out as long as you could. I think she's being unrealistic (or has never thrown up before) to expect you to have stayed and cuddled the baby for a while and an AH for telling everyone about it.  Rest assured, she is the one looking bad as a result of these stories--people are just appeasing her because she's the new mom.", "NTA.  You did your best, you hung on as long as you could, and it's better you went to the toilet to throw up instead of puking on your girlfriend or on the floor.  Though I imagine giving birth is an incredibly scary thing to go through, I wonder if she's just out of sorts as she recovers from giving birth, and maybe when things are settled this is something you can both laugh about further down the line.  There are many firsts that you will be there for.  This one just didn't go quite to plan.", "I'd just apologize and ask which would she'd have preferred you done. Throw up over her and the baby, in the middle of the suite, or run to the bathroom? Tell her you literally couldn't hold the baby as you literally vomited as soon as you entered the bathroom. I get why she's mad but you didn't have many options. Just let her know how sorry you are and you didn't want to vomit in the room. Then try to help her out as possible with her postpartum stuff and share the load with her with the baby. She'll get over it hopefully.", "I'm amazed she even knew you weren't there, I had my mom and MIL in the room (gave birth 10/20/22) and only found out last week that my MIL almost passed out while I was in labor. I don't expect any other person in the room to ignore their medical experience because of mine", "NTA. Honestly I'd flat out say okay next time I will puke all over you and our child, good? She is being ridiculous and petty. You didn't leave because you wanted to you left to be sick and held out as long as you could. Anyone faulting you for that is ridiculous.", "NTA.   I'd rather my husband leave instead of throwing up on rhe floor while I'm trying to push.  I want the nurse and doctor focusing on me, not getting towels  or a bucket for vomit.", "Speaking as a woman who’s been in labor - yeah, go throw up somewhere else.  l’m one  of those who can get sick just hearing the sound!\n\nNTA", "NTA.  You did the right thing.  Unfortunately you're going to be hearing about it for literally the rest of your life, but you weren't an AH.", " NTA. Wife and family are being very harsh on you. Suck it up because your wife is a new mother, she is probably going through a lot right now.", "I think what the fiancé wants is for him not to have vomited at all. \n\nHere’s the thing: if he had stayed in the room and barfed in a trash can, then some of the medical staff have to stop and take attention from the fiancé and baby to check on OP, which isn’t desirable. Plus, then the whole room smells and the fiancé and visitors all have to smell it. Given that he was going to barf, going to the bathroom to do it was the right call. \n\nHere’s what I think she is upset about, as someone who has given birth myself. Pregnancy changes your body. You gain weight and get stretch marks. Many women feel ugly and gross by the end. During labor you vomit and you often pee or poop yourself. Plus, there is blood coming out of your hoohah. Many women worry that if their partner sees the baby coming out of them, he’ll be so disgusted that he’ll lose sexual attraction and their sex life will never recover.  I think she sees OP vomiting as a sign that he thinks her body is gross and she’s worried about what that means for their relationship. And I think OP is totally not getting it and is making things worse by focusing on where else he might have vomited. \n\nIf he wants to resolve this I think he probably needs to say something along the lines of, “I’m sorry. I think the birth was so amazing to watch. You were so strong to get through it. You know how I am with blood…I’m sorry I wasn’t feeling well. I just want you to know it wasn’t about you. I’m so impressed by you and think you’re beautiful and amazing.” Basically he needs to reassure her he’s not grossed out by her body.", "This was my thought. \n\nMy husband almost passed out while I was getting my epidural. The needle is really big according to him. \n\nHe was infront of me helping me stay still and then he was sitting on the floor. \n\nI would have rather had him speak up since taking care of him was the last thing on my mind and then we had even more people in the room since I needed the nurses and then he needed nurses too. \n\nBut it's not like he did it intentionally, he ended up handling the birth fine. \n\nOp stayed as long as he could, threw up, came back. \n\nNTA", ">I dunno, dude, I think she’s making it pretty clear she would’ve preferred you just ask for a bucket or bedpan or some other nearby receptacle than miss a moment you’re never getting back. It’s not like they weren’t going to have to clean the room anyway.\n\nIt's one moment in a lifetime of moments. She's dealing with a lot of stress, both emotionally and physically. She can be upset at him for a while. But it's not his fault that his body has a reaction.\n\nLeading up to the birth, and once they've gone home from the hospital are when OP is most responsible for supporting and contributing. But in the delivery room he has a pretty minimal role, when compared to literally everyone else in that room. Staying out of the way is the best thing he can do. She can choose to accept that or not. But she sucks if she chooses not to.", "This! I'd razz my husband for the rest of his life (but that's our relationship) but I wouldn't actually be mad and I wouldn't make a thing out of it with the rest of the family.", "I did comeback, I thought it was mentioned? I left for the papers after making sure she was settled in the private room.", "He said he went right back to the delivery room. He went to sign the legal papers later, after his gf was settled into her hospital room.", "I did!", "What you said might have contributed but somehow I don't think OP saying, \"sorry honey but I didn't want ppl to maybe smell my barf for a second\" would help 😂", "I feel like this is a damned if you do, damned if you don’t moment. If he stays and throws up in the room, then everyone’s on his back for not holding his stomach and ruining the birth by vomiting through it. Or what actually happened happens. \n\nThe cards were stacked against him.", "I am not passing any judgment on you. I remember back in college we had to watch a child birth video. Even as a movie there were a couple of people that threw up and one guy actually fainted. And it was a movie.  When I had our kids my husband had to sit down because he got a bit queasy. And honestly if he had to throw up I would of needed him to do it in the other room.", "NTA. What did she want you to do, puke on the baby?!", "NTA. Vomiting in the delivery room would’ve been worse.", "you know who also felt nauseous?the person pushing a watermelon out of a lemon..YTA.dude,babies are disgusting.the things that come out of them..get ready..", "NTA\nBut I understand her. She’s just gone through something traumatic where you just had to be there and though I don’t blame you you left. I’m totally on your side here but hormones and emotions are high right now for her so I get it.", "NTA. She’s dealing with a lot of changes right now. I’d try discussing it again in a few days if she still seems irritated. Explain that you really did have to throw up and didn’t want to take any of the medical attention from her and your baby. I get why in the moment she was irritated, but I would definitely understand. I would not have wanted my ex puking and then having someone focused on taking care of him at that moment.", "NAH. What was the alternative? You puke all over and the nurses and doc have to step through it and handle it while also caring for your gf and baby? \n\nI’d be irked with you too. But I think I’d work through it a tad bit faster and either start laughing or just move on. This is like someone passing out during a birth. Only you vomit.", "NTA. Would she have felt better if you had puked in her lap? What is wrong with everyone? It wasn't like you left to watch a ballgame. You were sick and came right back. She needs to get over it.", "YTA this us an ongoing problem which means it should have been discussed with a physician o that you can have anti nausea medication as needed. \n\nWhy didn't you plan for  this?", "NTA. My dad felt faint when I was being born and the nurses had to help him to a chair. It happens. You cant control it!", "NTA. Just tell her sorry I had to go throw up. It’s common and it happens. You came right back. Does she not know why you stepped away?", "NTA, would she have preferred you to vomit on her or the baby!?!", "Nah it’s an emotional moment for everyone. Hopefully she’s found some understanding. It’s better you left to discreetly throw up than throw up on the delivery room floor", "NTA. What were you gonna do?,vomit all over her, the floor, and possibly the baby? Clearly its  hormones flowing.", "NTA, if you had stayed you probably would’ve vomited all over her and your newborn baby. Damned if you do, damned if you don’t.", "NTA   \n\n\nWhat, so if you would've almost pooped your pants, you should've dropped your trousers right there? Do you know anyone on the planet who's immediate reaction to vomiting isn't rushing to the toilet?\n\nI know it's an emotional time for your girlfriend and all, but she should be thanking you instead for being considerate even when it means missing the first few moments of your child's life.\n\nShe should feel bad for you for missing it, not blaming you.", "NAH you’re no help to anyone if you can’t help yourself. You’re both running on very little sleep (her, more so) emotions are running high, and adrenaline is all that is left. \n\nWhen things calm down, please explain to her that your options were to run to the bathroom, or vomit on the baby. \n\nCongratulations to you both!", "INFO: so what did you to prepare in advance beforehand to help circumvent this issue that you knowingly have to be the support person in the delivery room? Or did you just hope for the best?\n\nDid you ask if she would want anyone else in the room for support if you weren't 100% there like expected? You were obviously her first choice, but did you abandon her to be by herself and doctors at that moment since this scenario of your issue happening did play out? \n\nDo you feel randomly nauseous at different times and it's a condition you haven't looked into? Or do you mean you get nauseous at 'inappropriate times' meaning when another person is in medical need?\n\nHow is \"owning up to it\" equate to wanting it silenced from discussion? \n\nI have so many questions. Not enough info to figure out if that was AH move to do what you did.", "And?? One thing don't erased the other one, just because his wife is feeling worst doesn't mean he won't feel sick, what was he supposed to do?? Vomiting in her wife? In the floor right beside her?", "> You do realize that delivery generally involves vomiting just before the baby is born \n\nHuh? No it doesn’t.", "When I gave birth and got an epidural the anesthesiologist said no one was allowed in the room except for myself and them. They said passing out happens too often.", "I'm not sure if he would have taken any attention away from mom and baby.\n\n\n\nBack when I was pregnant my OB told my husband if he passed out during Csection they'd scoot him out of the way and leave him on the floor, lol.", "I feel like you've got the right of it. \n\nMy husband faints instead of vomits. For every kid we've had, I kick him out of the room for certain parts of labor because I know if he goes down it'll distract the nurses from me. That being said, when I'm getting a needle jammed in my back, I do get pissy that he's not there because hormones. \n\nI cannot imagine how pissed I would be if he threw up after watching me give birth. It wouldn't be his fault, just like it isn't OPs, but oh man...", "it just irritates me because whats he gonna do when baby pukes?has a blowout?", "It felt like the room was packed with people. Lol\n\nBut according to hubby the needle is huge so I guess that makes sense.", "I agree. I don't think she wanted him to stay, I think she wanted him to not vomit whatsoever. NTA, but consider that she's still going through a lot hormonally and probably isn't thinking straight rn. Also next time they bring it up, say I decided not to vomit on you or the child so what else did you want me to do. Let it go.", "You know that his wife giving birth and a baby puking are two completely different things, right?? The moment his wife is giving birth he is under so much pressure, the person he loves is literally suffering right in front of him, the smells of fluids, sweat, blood, probably poop all in a room with a lot of people in there, the nerves of something going wrong, plus he been someone that feels nauseous on inappropriate times. There's not point of comparation between his wife giving birth and his baby puking, don't make it look like he's gonna die when he has to change his baby diapers just because he vomited in a situation of so much stress", "It was pretty early in the morning when I got one so it was just us and maybe a nurse? But no visitors or guests. My SO was told to leave and go on a 20 minute walk.", "At the point I got the epidural, I just wanted the pain to stop. And I would not have let hubby leave the room. \n\nBut it's probably better to have the dad take a walk than end up sitting on the floor with his head between his knees.", "The minute my water broke I requested on because I didn’t want to be in too much pain during induction. I asked if he could stay for support but wasn’t given an option sadly.", "Yeah, I had given birth to my first two without any pain medication so I thought I could do it again. \n\nBy the time I got it, I delivered 15 min later, it was a two statge and the second longer acting part hadn't kicked in yet, but it was enough to help me relax. \n\nI would absolutely recommend the epidural.", "I don’t know how people give birth without one! Those contractions can be a killer!", "NAH she just gave birth, her hormones are crazy, she's possibly been on pain meds and you threw up at her most vulnerable moment. She's probably not in her right mindset and is hyper focused on what happened and that's why she keeps talking about it. You can't help being nauseous and she's coping with a lot. Congrats on being a new dad.", "Oh yes I would love to have you stay for a extra minute so you can throw up on our child and possibly get it sick, sounds like the best idea ever. Why the heck did t u do that? /s", "Sorry bud, but you should be pissed off for being treated this way. I think she needs to gtf over it because in a years time, she really won't remember it, just like everyone else. \n\nYou did everything you could to be present and threw up at the last second.\n\nJust prepare yourself for the diapers and don't try to get away from them. Have a bucket nearby if you have to. In 20 years time, you'll be laughing together at all the times you spewed while changing diapers.", ">This is not a new thing for me, I do feel nauseous at the most inappropriate times and everyone who knows me knows that too.\n\nNTA.  It sounds like you have an abnormal physical reaction to stress/anxiety and not something you have any control over.", "If only your wife could just decide to walk from giving birth but she had no such choice. \nYta.\n\nNo idea why people get so overwhelmed by birth. Yes I'm a parent and been there and done it. When you choose to become a parent you put your child's needs above all else is what I believe.", "NTA and poor you lol. I have attended a couple births with friends and seen their SO turn green, hyperventilate, vomit, etc. This is not uncommon.  It sucks that it hit you like that but I can understand. I have anxiety attacks that wait for nothing and no one when they hit, so I get it. That said labor is emotional, miserable, and traumatic so I do understand her being upset.", "If you knew in advance you have a puke problem you should have had a puke bag handy. Hospitals have lots of them. Delivery rooms are usually stocked with them.\n\nInstead of being prepared you tried to hold it. Have you successfully held it through really intense moments? I'm guessing not, and that makes YTA.", "Nta. She has a rush if hormones going through her and she went through it but younwere there for the birth and her. You needed to take care of you too. My partner passed out during my c-section after he got sick. They had to wheel him into my room on a separate gurney lol and I took care of our daughter until he woke up the nurses were nice enough so clean him up and cut him out of his scrubs. You guys will look back and laugh about it.", "NTA - this is really unfair to you.  If you're going to puke, you're going to puke.   You held out as long as you could.", "NTA.\n\nYour partner is taking a post partum emotional reaction and running with it into abusive behaviour constantly bringing it up with everyone and trying to reprimand you.\n\nIf you had diarrhea would she expect you to pop a squat over the bedpan?", "NAH. You did do the right thing by leaving and being sick in the toilet- you couldn’t help it and getting vomit all over the delivery room would not have made you popular! But equally your gf just grew a whole human and pushed it out of her body. I can understand her feeling a bit like you abandoned her right at the crucial moment. \n\nIf you can stomach it, flowers, chocolates and a grovelling apology, then don’t react overmuch to any more jabs about it. It’ll blow over and you guys will be the in throes of new parenthood. \n\nOne day, you guys will hopefully be able to look back and laugh. Best of luck OP", "Jfc, *I* puked while *I* was giving birth, ffs! I'm just happy that my husband stayed upright, I'd have totally understood if he needed to run to the bathroom, birth is overwhelming, for everyone, my husband was shaking more than I was. It sounds to me like the gf is trying to assign more significance to this than is warranted.", "Women literally end up shitting during labor, I don’t think the delivery nurses and doctor would’ve even blinked an eye honestly. I’m sure they’ve seen everything. I don’t blame his gf for being pissed either though I understand OP just kind of ran out on instinct with his vomiting urge.", "Yesssss…or at least he could have had some puke bags near him.", "While I'm not sure I agree he's an AH, I was looking for someone to post this. He needs to be prepared for such events with anti-nausea meds and maybe anxiety meds.", "It wasn't.", "YTA", "NTA would she have preferred you puke in the room", "NTA it's hard to control vomiting.  You held out as long as you could. Girlfriend needs to get over it", "NTA - if anything the medical staff sucks here. During my birthing experience, the nurses made it clear early on what dad was to do if he felt ill or like passing out. It was made clear to us it was normal if it did but his job was to get out of the room and not become a second patient because staff simply couldn't attend to him promptly if he did. \nAnd when things got dramatic, at one point he was simply,  more or less pushed out of the way (medical emergency).\nWife has been through the wringer - she's hormones soup and not thinking clearly. OP, as rough as it is, right now your job is to let her include that as part of what she tells people, respond kindly and patient with something like \"I'm heartbroken I missed it too honey. I wish my stomach had cooperated with my heart\". This will pass soon enough. She wants to know you weren't grossed out, that you wanted to be there, that this was important to you.", "nta.", "Would your gf prefer you puked  on her? Nta", "NTA!! Sounds very much like an anxiety attack, tho I am not a professional. I have also experienced nausea when anxious. It’s a physiological reaction that you can’t control. Your partner isn’t being very sympathetic to what actually happened to you.", "Would she have rather been barfed on? Or had you faint as she was crowning? They had much more important things to do instead of assist with a barf bag. You physically could not help it and dealt with it in the most self sufficient way that didn’t inconvenience anyone else. She is being unreasonable. It’s not like you left the whole time saying gross ew. \n\nNTA", "You do know that vomit happens frequently in delivery rooms, right?", "NTA. Your girlfriend is pretty hormonal right now, so may not be very logical. I think her attempts to shame you during what should be a special and memorable time as a new parent are way, way, way worse than stepping out of the delivery room for two minutes for a quick lil anxiety puke.", "NTA", "NTA. While pregnant I’d faint at the worst times. If I were her I’d be grateful you stepped out and not made a mess and distracted the staff from me and the baby", "NTA.  My husband left the room right after I delivered our last to get out of the way.  There were so many people in the room: doctor, 4 nurses in and out, and a couple nurses from the nursery.  He got claustrophobic.  He was still the first to hold her and was only gone like 5 or 10 minutes.  Your husband literally threw up.  Did you want him to throw up on you or the baby or the floor for the staff to maybe slip in?  Come back to your senses please.", "NTa did she want you being sick on the baby or her? Unfortunately it happens.", "NTA, you went to throw up not to play blackjack at the casino. “Sorry for leaving the room to throw up. Next time, I’ll just throw up on you so you know that I’m still in the room with you,” is what I would have said in your shoes, and in front of every person she mentioned her gripe with, so that they all know EXACTLY how stupid it is that she’s upset at you for temporarily stepping out to NOT be throwing up on top of her.", "NAH, it was better to throw up in the bathroom than the delivery room", "NTA what did she want you to do, puke on the baby?", "Yeah, had a 6'6\" male friend pass out when his wife was delivering. His sheer size took out the drip trolley, a tray of medical stuff and a staff member.", "Lol, me too! I was throwing up the entire time for my first.", "Lool I went into labor ar 9pm, it lasted 8 hours, he went off to sleep on a chair in a supply cabinet and my mom had to rush to wake him while she (my daughter) was coming out, he missed the actual birth, shit happens. I find it really sad she feels she has to recount him missing it to every visitor, seems vindictive 😓", "same! especially the night before when they first started inducing. I was induced on the 16th, had my son on the 18th and I honestly spent the entire inducement vomiting. even once got my poor husband.", "Hormones are a fucking bitch!", "Same. I literally didn't even push.....just puked lol.", "Csec is a lot different than \"natural\" birth.", "I had a wonderful nurse with my first who told me to not worry about it when I puked because I was using the same muscles as pushing and was still  helping move baby down!"]}