{"id": 23403, "submission_id": "15csa9o", "title": "AITA for yelling at a gym rat in front of everyone?", "selftext": "i (21f) have started going to the gym a bit regularly. i recently got off the implant and i’m desperate to lose some weight. i wouldn’t say i’m fat (i’m 5’8 so it usually balances out), just a bit chunky in the wrong places. i got a 24hr membership at a fairly large gym near me and i’ve been going for about 2 months now. \n\na week ago i went at a rlly busy time (6pm) instead of my usual 11pm bcz i had to be up early cz of travelling to an interview. i was doing some lateral pull downs on the machine and noticed a muscular guy was hovering near me. i could sense him halfway through my set but tried to ignore him. when i’d finished my first one i turned and looked at him waiting for him to say something as he stared back cz it seemed like he was waiting for the machine himself. i eventually just offered up the seat saying he could work in if he needed and he thanked me and sat down. \n\nhere’s the problem. he wouldn’t let me work back in. once he finished his first set i waited a few mins thinking maybe he was gonna stand up but he just went on his phone and then started his second set. on his next break i tapped him on the shoulder and asked if i could work back in again. he pretty much just shrugged me off and ignored me. i was a little irritated but i again waited for his next set to finish. i thought i’d just ask how many he had to do left and this man was going to do 10 sets and was only n his 3rd. so after his 4th set i took the screw out the weights and placed it at the weight i needed and then just stood right next to him waiting. he moved the screw back but i took it out again. this went on for a little bit and he was getting visibly annoyed before he stood up and just left without all his stuff. i just shrugged and rest down but halfway through my set i got a tap on the shoulder and it was one of the workers. he said i needed to leave the machine and stop harassing other members to give it up. \n\ni was gobsmacked. i tried to explain the situation but he just kept telling me i needed to get off it and give it back to the man like this was preschool. the gym guy was just stood there smirking and i snapped at him yelling that he really is just some coward for running to a worker bcz i wanted the machine back after i allowed him to work in. i berated him on what working in meant and asked if he ever treats any of the male gym goers like this or does he just like to try and intimidate women bcz of his fragile masculinity. the gym was silent and everyone was watching by the time i’d finished. \n\ni put my headphones in and sat back down fuming. i was half expecting someone to drag me out. some of the other muscular men came over and apologised for what the guy did saying that it wasn’t proper gym etiquette but that i shouldn’t have yelled at him and embarrassed him like that. i think i was justified but now i feel awkward going back to that gym. \n\nAITA?", "created_utc": 1690637097, "permalink": "/r/AmItheAsshole/comments/15csa9o/aita_for_yelling_at_a_gym_rat_in_front_of_everyone/", "score": 331, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i probably shouldn’t have yelled at him in front of everyone, especially in a place where he’s surrounded by his peers\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - I've owned two gyms. That is not gym etiquette...doing 10 sets on a machine and sitting on it while someone is waiting is ridiculous. Working in is sharing the equipment...the equipment that you are also paying to use. \n\nI would have kicked him out of the gym and fired the employee.", "NTA. Fuck that guy. I’m glad you yelled at him in front of everyone. He deserves to be embarrassed.", "NTA, guy was a weird mix of toxic and wussy. he took the machine off you, then when he didn’t get his way he went snivelling to an employee - absolute loser behaviour. you’re right to have put him in his place, but i totally understand why you feel awkward there now. it’s his fault though not yours", "NTA fuck that guy and honestly the employee as well for not even allowing you to explain", "NTA\n\nid find another gym - not because u should be embarrassed to go back but because fuck those people.", "NTA, you offered him the seat to specifically workin together on it. He thought he could just nab it.", "NTA. Self entitlement is high. Working in means sharing the equipment.", "NTA.  I had my share of gym encounters like that. The last one was with a guy who was RESERVING machines with a towel.  He’d pick 3-4 machines for his “circuit” and would come running to anyone who try using them and tell them he’s using them even though he was on the other side of the weight room lol (This was during the 6pm rush hour.)  I immediately went to the front desk and they made him take all the towels off and gave him a warning. Embarrassing him in front of everyone.\n\nSome people do not have good gym etiquette and that’s ok.  Move on.  Next time don’t let him work in.  If you get asked by someone else, make it clear you would be taking turns after every set. Don’t let one person ruin it for everyone else.\n\nAlso, not everyone likes the “work in” situation.  I disinfect pretty well every machine before using them and it’s not like I want to clean it like a maniac after every set.  I usually go to the gym around noon when there’s not a lot of people so I don’t ruin the experience during rush hour with my cleaning habits.", "Know what? I want to say TA but I am glad you stood up for yourself. He did the wrong thing and tried tattle on you. You weren’t having any of it. Was is appropriate? Probably not. Did it allow you to finish your workout without being a doormat? Sure did.\n\nNTA. Go back. Keep going back. Don’t be intimidated for sticking up for yourself.", "NTA, no one’s work out is more important when you’re at a gym that everyone pays for, commercial or not. He just needs to get his own equipment at home if he’s this fragile and entitled", "Of course other men are going to think you are wrong for embarrassing him - yet he’s not wrong for embarrassing you when he was not following gym etiquette.  \n\nWhere you are wrong is the game you were playing with changing the weight on the machine. I’m not sure how I would have handled that.  For that reason only I’m going with ESH.  Him for not working in like he was expected to since you were kind enough to share, and you for the game.", "NTA- Glad you stood up for yourself. I'd find another gym since the staff is horrible. Actually, everyone except you was pretty awful. Especially the dudes that saw what was going and still felt like telling you that embarrassing that loser was wrong.", "Good on you for standing up for yourself. He was the one being an AH. It's possible you went over the top enough to also be an A, but maybe not.\n\nSpeak your mind, don't accept having to be uncomfortable just so that other people don't have to be. Hopefully this guy will learn better how to share \n\nNTA", "NTA. When I used to go gym, I used to get pushed off of the boxing bag by the same guy everytime. Even as a dude, they’d just stare at you and try to intimidate you off. These people are assholes no matter who is training. You did the right thing standing up for yourself. And you should report that worker as well because he should’ve checked the cameras and see what happened instead of just taking the AH’s word as gospel.", "NTA. That guy is a dweeb and deserves to be shamed for his poor gym etiquette. People like him are why some people are hesitant to go to the gym in the first place. \n\nThe worker didn’t rectify the situation, so you were left to fend for yourself.", "I never let people work in on my sets. Nope. I usually do 4 sets and wipe the machine down after using it. Not a fan of someone else's sweat mixing with mine. They can wait 🤷", "NTA and that's why I'm very reluctant to let anyone work in with me. Luckily I'm a dude with a pretty intimidating rbf so people tend to not try to talk to me anyways lol. But yeah what usually do if someone is starting or waiting on me I tell them I have a long way to go, and if they all if they can work in it tell then no because I need to focus", "NTA.  Some people don’t understand proper gym etiquette.", "NTA. You shared and he should too. Jerk. Not you him. I thought that's how it worked with one machine?", "NTA. That guy is a piece of sh*t. Regular gym goers should know what working in means.", "ESH. I agree with the worker and the other gym members, and I think YOU should have gone to the worker. I would vote much differently if you had verbally criticized him the first or even second time he blew you off--and then dropped it.", "ESH\n\nInstead of messing with the weights and changing them back you should have gone and gotten an employee.", "ESH. What he did was super crappy, but you behaved like a preschooler and got treated like one. Moving the pin? Yelling? Yes, that is toddler behavior. Go find a different machine to work on and gossip about him with the other gym guys like a grown up.", "ESH He was monopolizing the machine but then you tried to force him to stop (to the point that employees had to step in) and then you had a very public tantrum.", "YTA\n\nYou were a considerate person, What that guy did sucked, but your behavior was over the line of what what I would call “standing up for yourself “\n\nMoving the pin was childish and having a temper tantrum in front of everyone was even more childish.\n\nGoing to staff to report the situation would have been the best approach.\n\nBut, I dont think you should avoid the gym out of embarrassment.  You acted out of frustration, it happens, move on.  Everyone there will forget it soon enough.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\ni (21f) have started going to the gym a bit regularly. i recently got off the implant and i’m desperate to lose some weight. i wouldn’t say i’m fat (i’m 5’8 so it usually balances out), just a bit chunky in the wrong places. i got a 24hr membership at a fairly large gym near me and i’ve been going for about 2 months now. \n\na week ago i went at a rlly busy time (6pm) instead of my usual 11pm bcz i had to be up early cz of travelling to an interview. i was doing some lateral pull downs on the machine and noticed a muscular guy was hovering near me. i could sense him halfway through my set but tried to ignore him. when i’d finished my first one i turned and looked at him waiting for him to say something as he stared back cz it seemed like he was waiting for the machine himself. i eventually just offered up the seat saying he could work in if he needed and he thanked me and sat down. \n\nhere’s the problem. he wouldn’t let me work back in. once he finished his first set i waited a few mins thinking maybe he was gonna stand up but he just went on his phone and then started his second set. on his next break i tapped him on the shoulder and asked if i could work back in again. he pretty much just shrugged me off and ignored me. i was a little irritated but i again waited for his next set to finish. i thought i’d just ask how many he had to do left and this man was going to do 10 sets and was only n his 3rd. so after his 4th set i took the screw out the weights and placed it at the weight i needed and then just stood right next to him waiting. he moved the screw back but i took it out again. this went on for a little bit and he was getting visibly annoyed before he stood up and just left without all his stuff. i just shrugged and rest down but halfway through my set i got a tap on the shoulder and it was one of the workers. he said i needed to leave the machine and stop harassing other members to give it up. \n\ni was gobsmacked. i tried to explain the situation but he just kept telling me i needed to get off it and give it back to the man like this was preschool. the gym guy was just stood there smirking and i snapped at him yelling that he really is just some coward for running to a worker bcz i wanted the machine back after i allowed him to work in. i berated him on what working in meant and asked if he ever treats any of the male gym goers like this or does he just like to try and intimidate women bcz of his fragile masculinity. the gym was silent and everyone was watching by the time i’d finished. \n\ni put my headphones in and sat back down fuming. i was half expecting someone to drag me out. some of the other muscular men came over and apologised for what the guy did saying that it wasn’t proper gym etiquette but that i shouldn’t have yelled at him and embarrassed him like that. i think i was justified but now i feel awkward going back to that gym. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, it nice you allow him to work in but honestly it’s much better if you just finish your set.", "YTA", "YTA \n\nim so glad you stood up for yourself but you should have gone to the worker instead of bothering the dude and changing the weights", "[removed]", "So the other gym members admit that what he did was wrong, but then said you shouldn't have done anything about it? Fuck that noise.  You are right, he would not have done it to any of them. There's only one asshole here and it wasn't you.", "NTA. He brought that on himself.\n\nPersonally, I don't work-in with others. If I'm doing multiple sets, the rest period in between my sets isn't long enough for someone to do a set. I let them know that I'll be finished in <5 minutes", "lol", "You are one of the people with poor gym etiquette.", "some men did smile at me and nod after and a few others gave me a thumbs up so they weren’t all bad. this is the only 24hr gym near me, the next one is about 1hr 30m away from me and i don’t have the time to spend 3hrs a day travelling for the gym. i might just end up going at 1am 😭", "Yeah, the dude was a jerk but she should have just gone and got someone instead of being childish, now it's ESH.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Sorry I don’t want to share your sweat", "Well, if you're staying there, stick to your routine. You've already established that you won't be pushed around. The dude should be avoiding you at this point.", "That is fine but don't whine about other people's gym etiquette when you have none.", "This. I'm sure you feel self-conscious but this dude should feel more embarassed.", "NTA", "Embarrassed him like that. Lol. He was capable of doing that himself. \n\nEvery regular gym goer know that you should work in together. Honestly.\n\nWouldn't have been my approach- but NTA.", "If somebody's parked on a machine I want to use and scrolling on their phone, I'll ask them if they're done using it and I can take over. It prompts them to either start their next set or go away", "NTA. This is why you can't be nice to people.", "If he didn’t want to be embarrassed he shouldn’t have acted like an embarrassment, NTA.", "NTA!  Please don’t stop going there either.  I’ve been hitting the gym for over 30 years and I bet a lot of people there respect you for ripping him a new one.  Most of the modern “meatheads” in the gym are happy you are there and caring for your body.   I would not be surprised if more than one spoke to that guy.  I find the most difficult gym goers today to be young high school athletes.  They are not mean but often lack situational awareness.", "NTA. Yes, you made a scene. Yes, you embarrassed him. Yes, it was completely justified. Don't dwell on it too much, just don't go to the gym at that time of day.", "NTA - screw that guy and good for you for standing up for yourself. Also not sure how I feel about the other gym members coming up to you to say how you shouldn’t have embarrassed him like that, sometimes people need shaming to realize that they’ve done wrong.", "NTA. That guy abs everybody like him can go fuck themselves. People who think they own the gym are the worst. The other guys who told you not to yell may have just been trying to save you further trouble down the road.", "ESH", "And everyone clapped", "Nta. Working in means tit for tat. You offered to let him work in with you meaning you were there first.", "Do not back down.  Go back.  If he comes ANYWHERE near you, say very loudly “Will you please back off?  You are making me EXTREMELY  uncomfortable.”\n\nFuck the patriarchy!\n\nPatriarchy is not the guys who backed you up.  Its the guys who supported the gym rat.", "NTA Yass Queen!", "NTA ... you're good he was a d1ck and GOOD FOR YOU for calling it out. \n\nGo back like you OWN the place.", "And THIS is one of many reasons there’s many gender specific workout areas.", "NTA. Not only did you stand up for yourself--you stood up for everyone in that gym who was sick of that guy. Those men giving you thumbs up and smiles were showing you that they were GLAD you did it because they couldn't or wouldn't deal with the guy themselves. You're a hero! \n\nAnd just FYI--you *belong* in the gym as much as anyone. You're not less important or less valid because you don't have a \"perfect\" body. Everyone is there to improve themselves. Having bigger muscles or less bodyfat doesn't give someone any superior rights.", "NTA - I would talk to the manager and file a complaint. Do not let him ruin your gym experience, as you've seen most are considerate and not jerks.", "You were the jerk in this situation. Your sense of entitlement is insane. He wasn't a gym rat, btw. You're a gym jerk.", "NTA. Good and do it again. Go back. Don’t let SD think he won damn nothing. Also, don’t listen to anyone saying you shouldn’t of screamed at him. They can eat it too", "As a 5 day a week gym rat myself, totally NTA and what he did was against all gym etiquette I have ever heard/read/seen. F that guy, the worker, and the other gym turd that told you not to yell at the first guy", "NTA- if you don’t want to be embarrassed, don’t do things you’ll be ridiculed for", "Tldr", "ESH. When he refused to let you work back in, why didn't you go to management yourself instead of re-setting the weights (I do admire your balls though, even though you were wrong).  Once you started yelling, you had to know this would end badly.", "NTA - The guy at the gym was certainly inconsiderate and didn't follow proper gym etiquette by not allowing you to work in.", "As an Asian woman, I’ve been in this situation before where people think they can walk all over me in public and something similar happened to me at the gym too. I also berated that person in full view/volume of others, which was the last thing they expected, they for sure thought I’d drop it and avoid confrontation. I have no doubt it caused them to reassess their behavior from that day forward and I will never regret speaking up in situations like this.", "The thing about people yelling at you is that it's only embarrassing if you know you've done something wrong.", "This. If he had been a decent person and just shared then it wouldn't have been an issue in the first place.\n\nNTA", "Also file a complaint against the employee. NTA", "I don’t encounter the truly Entitled People irl that I read about on Reddit except at the gym. What is up with That Guy at the gym who uses one machine for 30 minutes with long breaks between sets, just camping on his phone or whatever? How could anyone be so oblivious to (or uncaring about) others’ needs? Infuriating.", "The people who downvoted this have very fragile egos. You’re so right.", "The one with the entitlement problem is the guy who stole the machine when OP offered for him to work in with her.", "NTA file a complaint against the employee please.", "Keep going! Considering his response was to intimidate you, refuse to share and then run to an employee rather than be reasonable - I doubt he's going to engage again.", "Nah, keep doing exactly what you’ve been doing. You embarrassed the shit out of that guy and it sounds like you now have a bunch of gym bros as your fan club. You did nothing wrong, no reason for you to change your routine.", "This tells me that this is not the first time that man was caught being selfish and going against etiquette.  You go back whenever you want for your schedule and hold your head up high.  Do not feel bad for sticking up for yourself- you should not have had to in the first place.  Don’t let one rotten apple deter you from your goals.", "O.p. gave up the machine willingly. She said that she told him he could use it, and got up. She said nothing about sharing. 10 sets is within normal range. Resting a minute between sets is also normal. Changing the weights while he was working out was not okay. And yet she continued her aggressive behavior.", "Working in = Sharing a machine where you do your set while the other rests. This is basic gym knowledge.", "Ah. Ok. \nWell. In that case i rescind my original comment. I workout frequently and have never been told this or been asked to \"work in.\" Where I workout people just wait till the person is done and then do their thing."]}