{"id": 23468, "submission_id": "15df9pv", "title": "AITA for not giving a strangers child food?", "selftext": "I (30f) was at the playground today with my toddler and he wanted a snack so i pulled out some blueberries and strawberries for him. Another toddler came over to us and tried taking some of the berries but i said no they’re not yours. The parents saw this and went off at me for not giving their daughter any food. \n\nI’m definitely not one to deprive a child of food if they’re hungry but this child I didn’t know and they could’ve had an allergy. Maybe it’s the mum guilt but maybe I should’ve asked the parents before dismissing the child.", "created_utc": 1690701896, "permalink": "/r/AmItheAsshole/comments/15df9pv/aita_for_not_giving_a_strangers_child_food/", "score": 50, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action that should be judged is me not giving a child food. It may make me the ah if the kid was really hungry\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, and your concern is completely valid. I can just as easily see parents like these going off on you for just giving food to random kids if their kid DID have an allergy. Only then you might be in actual trouble as opposed to just being griped at by some snackless cheapskates.", "NTA.\n\nYou did the right thing.\n\nThis child could have had an allergy and probably shouldn’t be learning to accept food from strangers. I can’t imagine the mental gymnastics I would have to do to go off at someone for this, rather than telling my own child we don’t take food off of strangers.", "NTA. There should be no expectation for you to pony up food for someone else's kids. Could you have asked? Sure, or the other kid's parents could have called their kid over to them and said \"no don't bother the nice lady, we have food for you.\" Shoulda/Coulda/Woulda works both ways, and you are fine.", "NTA. The other mom is entitled and should have snacks for her child", "When they get older, you’ll be able to tell them to check with their parents first. If you knew whose child it was, you could have checked yourself. But you’re under no obligation to give anything away, and the other parent should have known that. It was then on them to distract the child and move them along. NTA", "NTA, you should never feed someone else's child unless you have a clear yes from the parents. I share our snacks sometimes but only after I checked with the parents.", "NTA. Asking strangers food should be for emergencies like \"my child's hypoglycemic and we just spilled the apple juice on the grass\".", "NTA... I would have done the exact same thing and I have a 2 yr old. If you had and they were allergic, they would have held you liable for it. Better safe than sorry!", "NTA- You brought snacks for your kid, not to feed other people's kid. The other parents can get mad, but they should have come prepared and not expected other parents to feed them. I have 4 kids and I have always brought snacks and would never get mad at another parent for saying no to my kid. Part of being a parent is being prepared, so if they go out then they need to bring things for their kid.", "Definitely NTA. The other parent should have had a closer watch on their kid before she even got close enough to try and take your food! What if you had been some stranger with candy trying to lure the child away? They are TA, not you.", "NTA you reacted rationally. The other mum was an idiot", "NTA.  Other kiddo's mom was the problem, not you.", "NTA strawberries and blueberries are ridiculously expensive at the moment and even though I do buy them for my daughter as she loves them I don't carry around enough for other people as well. \n\nShe should be teaching her child that's it not appropriate to approach strangers at the park, not worrying about getting free snacks.", "NTA\nWho on earth expects strangers to feed their child?!", "NTA. What an irresponsible parent to just think its ok for strangers to feed her child whatever. I don't even give a treat to a dog without asking the owner if its fine. Who knows what can happen from allergies to having a very sensitive digestion and all.", "NTA never ever feed a random child anything.", "NTA \n\nAbsolutely right to not give food to a child you don't even know. Those parents are wild. \nAlso ... They ought to really teach their child it's not okay to walk to strangers and try taking something not theirs. I know this is a toddler we are talking about, but my friends have both 2 year olds and when the boys touch something they shouldn't they absolutely tell them right away not to. How else will they learn... ?", "Er, shouldn’t That parent be using that as an opportunity to teach the kid not to take food from strangers??!??", "not your child not your problem. the child has parents who can feed him yes? then they should feed him.", "NTA\n\nI definitely would have told the child to, “Go ask your parents if it’s OK.” Then maybe follow the toddler over and ask them myself.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (30f) was at the playground today with my toddler and he wanted a snack so i pulled out some blueberries and strawberries for him. Another toddler came over to us and tried taking some of the berries but i said no they’re not yours. The parents saw this and went off at me for not giving their daughter any food. \n\nI’m definitely not one to deprive a child of food if they’re hungry but this child I didn’t know and they could’ve had an allergy. Maybe it’s the mum guilt but maybe I should’ve asked the parents before dismissing the child.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA..the entitlement of people is astounding.", "NTA. The mother could have brought her own fucking food, instead of behaving like this. If the mother forgot to bring any, she could\\`ve just asked you with an explanation.", "NTA. My daughter (for the first couple of years) had a sensitivity to anything oranges. She would always develop a rash. People always offered it to her, I’d have to be the rude parent and take it away, wash her hands, and explain to them. No one should ever give kids food that you don’t know.", "NTA\n\nAbsolutely right they could have an allergy. \n\nOr their parent didn't want them to have a snack because it would ruin their dinner. \n\nOr crucially - children need to learn not to accept food from strangers!!! (Obviously you're not a bad stranger but I mean it's \"stranger danger\" 101!)\n\nOr quite simply - you bought the food for your children. You're under no obligation to also feed a stranger's children! \n\nThat mom was very clearly TA!", "NTA\n\n&#x200B;\n\nTherse parents are AH", "Nta. Child could have had allergies. And also it's strange to share food with strangers", "NTA.  Not even close.  Parents should not in anyway be mad at you.   Should've brought their child snacks and corrected the behavior, you never take things from a stranger.  Entitled ass people.", "Your response to the parents could have been that teaching a toddler to accept food from strangers would be child endangerment, so you obviously couldn't put their kid at risk by accidently enabling such behaviour - so they're welcome.", "They should have gone to grocery store and bought some for their kid WTF. NTA op", "Thank you", "Thank you", "All of that is true offcourse. But my initial thought was OP did well to send the kid away because children who alway get what they want will turn into the entitled people those parents are. So good on OP to at least not give into such bs. NTA."]}