{"id": 23493, "submission_id": "15dq894", "title": "AITA for making my sons birth mom move out once the adoption was finalized?", "selftext": "\nFor the past 7 years, my husband 43M and I 37F have been trying to have children, but we’ve been unsuccessful as we’ve went to specialist and have been assured that we can’t have children. Our hearts were broken and since then, we’ve wanted nothing less than to become parents and have something to call our own. \n\nLast year, we decided we would volunteer helping at foster homes and helping the youth and young adults that were struggling with homelessness. While doing this, we met our sons birth mother (A) 19F. She was pregnant and struggling with homelessness and we offered to take her in, help her with maternity clothes, healthcare, transportation with doctors appointments etc. She took us up on our offer and moved in, and thats when she began telling us that her child’s father wasn’t in the picture and she had no way to provide for him. She didn’t know what she was going to do and had no job or way of caring for him. She was 20 weeks pregnant around this time. \n\nAs our bond grew, we told her our struggles with having a child of our own and told her that it would mean the world to us to have a child as we are financially stable and a loving family. We offered to adopt him and have her be a sister figure to him, we told her that this was completely her decision and that we would support whatever she wanted. After a few weeks, she told us that she wanted us to adopt him once she gave birth and we agreed to an open adoption. We thanked her, and we supported her in every way she needed and she also had her own room in our home. \n\nFast forward, she gave birth to our son, Aiden. I was there for the birth and our bond was unexplainable. Shortly after, the next morning she signed off the adoption papers and terminated her rights. We then took him home along with her. About 2 weeks after his birth, she began becoming very clingy with our son. We explained that he was ours and she was welcome to help with him, but he was my son and I would make all decisions regarding him. This upset her, and she felt hurt, so we ultimately decided to ask her to move out and once the adoption was finalized, we haven’t had any contact with her since. We decided to close the adoption and we asked her not to contact us any further. \n\nHis birth mother thinks I’m the AH, and accuses me of manipulating her with false pretenses however this is not true and aiden is our son and I am his mother so I have to do what’s best for him. Aita?", "created_utc": 1690735711, "permalink": "/r/AmItheAsshole/comments/15dq894/aita_for_making_my_sons_birth_mom_move_out_once/", "score": 333, "replies": ["This post is currently locked due to the contentiousness.", "Absolutely evil. You took advantage of a young mother and manipulated your way into stealing her child and then shutting her out once you got what you wanted. How can you live with yourself. I hope the young mother gets a lawyer and you get what you deserve. There should be criminal charges for you stalking the foster system so you could find your target to prey upon.", "You're not an asshole, you are evil. You found a young woman facing incredible obstacles, brought her into your home, groomed her to give up her child on false pretense and then slammed the door in her face. You lied to her about access she would have to her child, you stole that child. You deserve the absolute worst.", "YTA. That girl didn’t want to give up her baby, she was just scared and lacked resources. You took advantage. Wanting a child doesn’t entitle you to one. This made me sick to read. One day your child is going to find out how you went about acquiring them and I hope they leave you in the dust. Evil, evil, evil behavior.", "YTA. You used that woman for a baby. You agreed to an open adoption and then “closed” it? How is that even legal?", "YTA.  Lady, you legally stole a baby.  Do you truly think she would have given you her baby if she hadn't been an abused teenager bounced around the foster care system without any place to live or partner to turn to?  You offered her kindness and shelter when she she was facing living on the streets as a pregnant teenage single mom.  Her consent wasn't informed.  Keep your baby, but don't lie to yourself about how you got it.", "OMG. **YTA**\n\nWhat happened to your promise of being a \"sister figure\" to the baby? This whole thing sounds sleazy to me -- I suspect you had every intention of convincing her to give you her baby the day you found out she was pregnant, and you don't get much more manipulative than that. This makes my stomach turn.", "YTA \n\nYou manipulated a vulnerable homeless teen to meet your desire to have a family.", "This is one of the worst stories I have ever read. I am literally heart broken for this young woman who has been manipulated, abused, lied to, coerced …. And by another woman! That is what makes it worse for me - you are a vile human and remember   Karma! YTA", "YTA. \n\nI am wondering if the birth mother truly understood everything that was going on with this adoption. \n\nDid she have a lawyer or advocate on her side to explain everything?\n\nWas she originally going to live in your home and be a \"sister\" until you decided to ask her to move out? \n\nIs she back to living on the streets or in a shelter?\n\nI am wondering if she also had anyone there to help her with the feelings she was having before and after the birth? She experienced a drop in hormones, further changes in her body, etc. She could have been so overwhelmed and confused. She needed help with all of this and you just kicked her back out and cut off all contact with the child. \n\nI do feel like she was taken advantage of. There was so much more that she needed help with and she didn't get it. She came to depend on you and you just tossed her out when she became problematic. Were you actually hoping for a live-in nanny since you said she could help with the baby? This isn't The Handmaid's Tale.", "Am so angry reading this. That poor girl. What you did should be against the law absolutely disgusting. He is not your son. Stop kidding yourself. You bloody stole him YTA", "YTA. I really hope this isn't real because it's absolutely disgusting. You manipulated and used a vulnerable woman. Vile.", "In order to close an open adoption, you have to go to court. How legal is this adoption? It sounds like you took advantage of a woman who probably wouldn't have given up her child if she'd had a home or any support at all. You essentially coerced her, misled her, and then had her sign away her parental rights immediately after giving birth, all the while thinking she'd have a role in her child's life. You know she can't afford to challenge you in court. You effectively stole her child, because you have money and she doesn't. YTA.", "So let me get this straight, you used a pregnant homeless young woman to give you a child and now you want her out and make her homeless again? This is really exploitative\n\nYou don't get to decide to close the adoption (edit. apparently in the US that is the case, which is even more unpleasant)- that's not good for this child. Neither should she have been even asked to give up her parental rights the next day\n\nThis is really disturbing. You essentially used her\n\nYTA", "YTA - you are 37 and 45yrs old. You brought in a 19yr old to help them. And then when they’re struggling with giving up their newborn, you kick her out? And are *closing the adoption*? \n\nWhat the fuck did you think would happen? It’s been 2 weeks. You absolutely manipulated and preyed on a vulnerable and scared teen mom.\n\nCan you even close the adoption just because? Does she not have any rights?\n\nWhat about when your son grows up? You going to avoid the adoption conversation? That always backfired really bad.", "\"Fast forward, she gave birth to our son\" .... YTA wtf  you manipulated a young girl , took advantage of her did not want her to be with the child , adopted the child and taking her out of the child's life  , you helped at foster homes for this exact reason to scout out a potential surrogate mother who was helpless  without actually paying her to be a surrogate , deception level 100 , you are not his mother you are a con artist", "So interesting that you didn’t become foster parents yourself, you instead volunteered at youth homes.  You preyed on vulnerable people to get your desired baby.  Period. Spare us all the info like you were trying to help this particular girl. You planned this all along.\n\nYou disgust me. The very least you could have done was throw some money at her to get going in life after stealing her baby.", "YTA.  You took advantage of your volunteer position and a Culebra l\nvulnerable teenager.   You PROMISED am open adoption and that she could have a relationship with her biological son.   Until she signed the papers.   He will find out one day and will hate you.", "Holy hell…\n\nYTA, this has so many levels of wrongness in it. You basically manipulated a young adult at her most vulnerable just to adopt a baby. Then decided to kick her out once you got what you wanted. The fact that you can’t see how you’re the ahole in this situation is baffling. You’re worst then aholes honestly, you’re both monsters.", "YTA but I don't think asshole really covers it here, you're evil.\n\nFunny how you only started helping at foster homes once you knew you were infertile, almost like your whole plan was to lure and manipulate vulnerable women into handing over their baby and then chucking them back on the streets once the papers were signed? She would have never agreed if you had told her you wouldn't allow her contact from the start and you know it.", "YTA\n\nYou told her she could stay with you, be a sister figure and have an open adoption; and then you went back on everyone of those things. \n\nYou should have anticipated that she wasn't going to just drop all feelings for the baby and ignore him after she gave birth. To me it kinda sounds like you manipulated this girl into giving up her baby and then kicked her out of your house and cut off contact.", "YTA - You lied and manipulated a young girl into a decision that she wasn't prepared for. You took advantage of her. \n\nI don't know how you can look your son in the eye after what you did to his birth mother. You only got that child through coercing and manipulating his mother just because you can't have your own.\n\nYou said she'd be like a sister and would have an open adoption as a way to appease her enough but then the moment the adoption was finalised due to your lying, you closed the adoption and threw her into the street.", "There are people in prison who have done less abhorrent things than what you’ve narrated. Give that child back, he is *not* yours!", "YTA\n\nYou took her in, fed her your sob story, made promises you seemingly always intended to break, and have cut her out of your lives and the life of her child (or sister!) now that you’ve gotten what you want. This is manipulative, coercive, cruel behaviour.\n\nThat poor woman. That poor, vulnerable, homeless, pregnant TEEN you manipulated with seemingly little remorse. But moreso, that poor baby, facing life with you both as parents.\n\n(Oh, and since you’re a fan of fast forwards, here’s one for you: fast forward to ‘your’ son finding out the truth one day and cutting you off completely.)", "You manipulated a desperate and pregnant teen and took her child under false pretenses. When you made the offer of an open adoption and you gave her her own room and said they'd be like sisters, you basically told her you were adopting her as well and you'd all be a family. Now that the papers are signed, you've completely changed your tune and went no contact. That's not your child. You are evil and definitely YTA.", "You legally did everything wrong here. \nAll she needs is one shitty lawyer and a job to get her child back.  \n\nYTA", "YTA. Don't try and frame it that you were helping that poor girl out of the kindness of your heart when you moved her in. You absolutely moved her in with the intention of manipulating her into giving you her child. You were predatory. And as soon as you got what you wanted, you kicked her to the curb. *You made her homeless again as soon as she wasn't acting as an incubator for the baby you decided was yours*.\n\nI hope that baby grows up to be a strong and loving person. I hope you don't smother and manipulate your \"little miracle\" the way I suspect you're going to. I hope you tell him the truth, that his mother was young and naive and vulnerable, and you took advantage. I hope he forms his own relationship with his biomother, the woman who never had a chance against your mercenary heart.", "YTA. You basically tricked her into letting you adopting her child by promising to let her live with you and be a part of your family, and now that the adoption is complete you are throwing her out without her child. \n\nYou are one heartless and evil AH.", "YTA. You are top of the asshole pyramid. \n\nYou manipulate a scared, confused, vulnerable teenager into giving you her baby because you are entitled. You don’t care about helping anyone. You wanted a baby and were willing to take someone else’s to make that happen.", "YTA.  It sounds like none of you had realistic expectations about how all this would work, but she's 19 and you're 37, so the onus is on you.  I'm not buying the \"it just sort of happened\" story.  After you found out you couldn't have a baby biologically, you just happened to start working with foster teens - teens who are often at risk for pregnancy and who are very vulnerable emotionally and financially.  You were baby shopping.  When you found the opportunity, you took in a vulnerable 19 year old girl, and gave her kindness and affection that she may never have had before, convinced her to let you adopt her baby by telling her that she could still have a place in the baby's life.  Then she actually has the baby, and has a much bigger biological and hormonal tie than she expects.  You don't want this because your incubator has become inconvenient, so you kick her out.  On what planet is this okay?!\n\nAdoption is a fraught and difficult process at the best of times, and can go horribly, horribly wrong, but it can also work out well when bio-parents and adoptive parents are in agreement - **real** agreement.  That's not what happened here, and it will taint everything you do for the rest of this child's life.  This was horrendously selfish of you, and you put your own wants ahead of bio-mom's AND baby's.  You wanted a child and couldn't have one, so you put a lot of effort into manipulating a vulnerable girl into giving you hers.  You manipulated this girl, acted as if you cared for her, when you were really just using her.  You made the agreement about an open adoption under false pretenses, and then reneged now that it's no longer convenient.  And now you're trying to hide behind \"it's the best thing for the baby.\"  By that yardstick, we should just screen every bio parent to make sure that there isn't a better parent out there, and just give the newborn to the \"best\" parent.  Ultimately, from an economic and stability standpoint, this might be the best of bad choices for this kid, but that's not the point.\n\nYou now have a problem about what to tell this child. You can try to whitewash this, and either not tell him he was adopted at all, or paint yourselves as heroes, and tell him that his bio-mother didn't want him or that she couldn't take care of him or that she was an awful person and what you did \"was for the best.\"  But he's going to want to find out about his bio-mom, (and he probably will DNA tests being what they are these days, and they'll be even better in 18 years).  Then he's going to talk to her or her family, and hear their side, and you are going to have a very upset and very troubled adolescent or young adult who isn't going to trust anybody, especially you, because you lied to him and to his bio-mother about some very, very fundamental things.", "YTA - you took advantage of a  vulnerable woman and stole her child. The fact you are now CHOOSING to deny your kid a relationship with his biological mother is criminal in my opinion and tells me you have done absolutely none of this with the baby’s best interest in mind, only your own selfish wants.", "You're a disgrace. You used and abused a troubled woman. Wait till the child grows up,  he won't want to have anything to do with you. It's borderline human trafficking, the only difference is you didn't arrange the pregnancy.\n\nShe could probably sue you and win custody of HER child. Ever heard of undue influence? You've got big legal issues ahead.", "Wtf. YTA. This is coercion, financial abuse, you’re a huge AH. Buying and coercing to obtain human beings has a name in law, I forget, do you remember the name for it? Damn OP what the hell? This sub has rules, so this is my civil response, you’re sick. Give this woman back her child, you are not his mother and never will be, and what’s best for him is to be with his actual mother. The only reason you ever even talked to this girl was to steal her baby. Please link the crowdfunding for her lawyer.\n\nEdit: also, see you in r/AmITheDevil - I’ll let you guess the answer.", "Yta. I’m not sure I’ve seen bigger assholes than you. She was vulnerable, unhoused, and likely with a history of trauma. You take her in, have all the power, and then dump her once she’s birthed your child?!? I see this as you preying on someone vulnerable, like a therapist being with a client. I could understand that this wasn’t working out, but what did you actually do to help her move forward with her life? Did you get her ongoing therapy and housing to help her through this? No, you reneg on someone who already had been struggling. \n\nTraumas can compound on each other. Your short-term connection worsened her life in the long run. Way to go", "YTA It actually sounds like the only reason you even volunteered at the homeless shelter was so you could find a young vulnerable pregnant woman whom you could manipulate into giving you their child", "YTA. You and your husband are predatory individuals. You took a baby away from a young, extremely vulnerable woman. Was that your intentions when working with the homeless? To see if you could get some ones baby? At the very bare minimum this shouldn't be a closed adoption.", "YTA and you did manipulate her and told her everything she wanted to hear, everyone knows it but you just won't admit it.", "YTA you've groomed a woman into giving you her child and now you've basically told her to gtfo so you can play happy families, this is just awful, you took a vulnerable woman and basically stole her child out from under her, i hope to god she gets her child back and you never see them again, you aren't their mother", "She agreed to an open adoption, then  you unilaterally decided to make it a closed adoption. YTA", "My god. This is exactly why the anti-adoption movement is on the rise. Great job on the trauma you’re going to cause your son. Evil people.", "this is straight up scary how you even have to ask. You better fix this.", "yta. you took advantage of a homeless vulnerable girl and used her for her baby. you manipulated her, and I don't, by the whole, decided to volunteer with foster teens and just happened to meet a girl who needed help and took her in out of the goodness of your heart. you're a sick and disgusting person. I hope she gets a lawyer and takes her baby back. you don't deserve a child. birth mothers can get their child back up to a year after the adoption, this adoption was wrong, and she deserves better.", "Yta you made promises to her then broke them.  Did you think she would give birth and not have feeling for the child. You were wrong, you were cruel and you are the ahole.", "Dude WHAT\n\nYTA OMFG", "YTA - You think you're being cute here, OP, but wait until this goes back to court.", "YTA for taking advantage of a girl like that. How can you live with yourself ?", "Oh my god!!! You should be absolutely ashamed of yourselves. That poor young woman, and that poor baby. I legitimately can’t believe you believe you’ve done the best thing for this child and it’s biological mother. Shame on you. YTA.", "Not only are YTA, you’re evil! You knew exactly what you were doing all along. That poor vulnerable girl.", "This is some handmaid's tale bullshit. YTA", "Yta you stole her kid and used her till you got what you wanted you both are sick people", "YTA you preyed on a very young vulnerable women. Essentially coerced and manipulated her into an adoption. Made promises you broke within weeks. You’re why people hate adoption as an option.", "YTA, you're the worst kind of predator, instead of openly stalking and causing harm,which is inexcusable in and of itself? You cover yourself with \"kindness.\" You gain their trust and then use that when they're most vulnerable and then have the audacity to strut around like you've done some saintly act.", "YTA. You're a literal baby kidnapper. I desperately hope someone comes to this young woman aid. What you have done to her is monstrous.", "You took advantage of a young teenage girl who was in a tough situation. You manipulated her into giving you the baby. And now you’re surprised with the results. Not sure that you two will make great parents. YTA YTA YTA", "You're not his mother, he's not your son. Your the woman who took advantage of his very vulnerable mother and manipulate her to steal her child, so no you are by no means doing \"what's best for your child\" cause he is not you child to begin with. \n\nIt looks like you \"volunteer\" with young adults to prey on vulnerable pregnant teenagers to snatch their babies under the pretenses of \"helping them\"\n\nYou're not only an AH you and your husband are horrible people, and I'm pretty sure that \"adoption\" wasn't exactly legal, so I hope the girl can get someone to help her and she gets her baby back. Someone who's willing to do what your husband and you did have no business raising a child or helping the youth, I'm guessing there's a reason you didn't go to adoption agencies. \n\nSo YTA, cause there has to be a judgement but know that you are way worse.", "YTA, you manipulated her and stole her baby. Exploiting her situation", "YTA, Serena Joy.", "I hope she can find a pro bono lawyer to challenge this in court and get HER baby back. You’re disgusting. YTA.", "YTA you did manipulate a woman in a fragile state for your own gain. you successfully, legally, stole her child.", "Question; do you still intend to volunteer at foster homes? Or will you be doing that again when you need a “daughter” to play with your “son”?", "This is so abhorrent it literally turns my stomach. It’s absolutely sickening. I feel terrible for that child to know it’s going to be raised by predators who literally destroyed a young woman and stole her child. I can only pray that girl gets her life back together and gets HER child back. At the very LEAST I hope she gets in touch once the child reaches 18 so that she can tell them exactly what kind of people you truly are, then the kid goes NC with you both. YTA x100000000", "YTA you straight up manipulated a virtual child. Cold and brutal.", "There is a reason when women are denied an abortion the choose to keep the baby rather than adoption. The body is flooded with hormones that promote bonding, including during labor and lactation.\n\nYes, there are some women who do not feel that bonding, but clearly not the lady in question.\n\nChildren do better with biological family. While there will always be a need for adoption, the need is for children who lack a biological relative to care for them, the purpose is not to provide something for you to love.\n\nYou took advantage of this woman to get something you wanted. The child was just an object. You should have got a dog.", "Holy sh!t… this post actually gave me goosebumps. YTA, but AH is not nearly strong enough.", "YTA you manipulated that woman’s decision by taking her in and letting her think she would be able to be in a ‘big sister’ situation. Both parties need to agree to a closed adoption, so if she has not you are SOL. Also, any judge will se right through your tactics and tear up the adoption papers if she wants her child back.", "YTA she feels abandoned and manipulated by you because she was.    You literally have no business with a child, you are despicable human being", "YTA you knew what you were doing when you took her in. You took advantage of a pregnant homeless teenager and now you’re taking her child and kicking her out.", "Also you aren't his mother and what you've done is abhorrent", "YTA you manipulated a child to obtain a child. This is wrong on so many levels and what you don't realize is that if you do close the adoption it has to go back to court and she can hold it against you and get her child back! You would lose. This is absolutely sickening to read of what you did. You are grown adults that took advantage of a young kid at their lowest points in life.", "Not only are YTA but you are pure fucking evil", "Of course YTA.\n\nAnd I mentioned this under someone else's comment, but I think it's important enough to note as a top-level comment of it's own: \n\nThis isn't just about you being absolute ghouls in general, or assholes. There's a very good argument to be made that what you did is a form of *human trafficking*. \n\nUsing false pretenses to influence a vulnerable, homeless, pregnant teenager, in order to obtain her baby for yourselves is a version of trafficking in human babies, a not-at-all unheard-of but particularly sordid part of the adoption industry, and very, very illegal.\n\nA good lawyer could make a STRONG case for both teenaged mother and baby being trafficked (the former coerced into giving up her baby, the latter as part of a coercive \"adoption\" wherein the birth mother was unable to give informed consent because she was ignorant of the adoptive parents machinations - trolling foster programs for victims; pushing her out of the house after promising her a home and family as part of the adoption; etc.).", "YTA and up to a year, the birth parents can take the child back.", "So you take in a vulnerable girl, convince her to give up her child and parental rights, then ditch her two weeks later? OFC YTA", "What a vile thing to do, YTA and much, much more. Handsmaid tail has nothing on you.", "YTA, gross manipulation on your and your husband’s part for praying on such a vulnerable girl", "I feel like saying YTA isn’t even enough. What’s wrong with you?", "YTA. You planned every step of this.  You preyed on, and took advantage of that vulnerable young woman.  After one mistake you enacted the final part of your plan - to get rid of her. Wow.  You're lower than low.", "WOW 100% YTA tell yourself whatever you want but you took this girl in so you could get your hands on her baby. This is seriously sick behavior. And I dealt with infertility for 5 years, that’s no excuse for what you did. Hopefully she gets a lawyer cause by what you yourself have written here you absolutely manipulated this situation. Adoption is wonderful, not when you’ve straight up lied and manipulated someone into it.", "Yta. A massive one. You take avantage and manipulate her just to have a son …", "YTA this never should have happened, this is why you go through an agency. Jesus Christ what did you think was going to happen? You’re monsters", "When that kid find out he's going to hate you", "YTA, you preyed on a vulnerable teenager and essentially waved a home and stability in her face to steal her child. I hope she challenges the adoption and wins.  I will never believe that you did not intend to steal the child from the start. As someone who dealt with infertility I cannot believe these words are going to be coming out of my mouth, but clearly there was a reason you can’t have your own children. You were not meant to be a mother.", "YTA 😒", "Look, it is always risky this kind of thing, when post-partum hormones kick in the girl can be unable to leave her child alone. You should've anticipated this, that is why surrogates are usually required to have children of their own already, so they know what they're getting into. This mother was 19, she hardly had an idea, but as a proper adult, you should know better. \n\nI think you indeed went ahead and seized the opportunity regardless of any consequences", "YATA 💯 percent and crackhead I really hope this young girl has friends that sees this post because you basically admitted to groom this young girl and manipulate her to give her child to you this is completely illegal and you can be charged with several federal charges as well as state charges. This post is you admitting you lied, manipulated her in a vulnerable state to get what you wanted her child. I personally would hire a top lawyer and also have the states attorney open a investigation on you.", "You took advantage of a vulnerable, pregnant girl and dumped her like trash after you got what you wanted from her. I hope she turns her life around and find resources that can help her take her son back from you. You are evil and I don’t know if you even deserve your own child after this. YTA.", "This is a pretty horrific story if true. This poor girl was as vulnerable as can be and OP took advantage and then threw her away when they were done.", "YTA you give adopters a bad name. absolutely cruel. you are the worst. taking advantage of vulnerable young women. you should feel ashamed. i wouldnt be able to live with myself", "YTA, you manipulated that child into giving her that baby. You’re a liar, and the only way to fix this is to give her back her baby.", "YTA for all the reasons everyone has listed.", "Holy shit, you're a monster.\n\nEdit: and possibly a human trafficker. I hope this woman finds some kind of legal help.", "You are a child trafficker. If you really wanted to help, you would have supported the mother to keep the baby. This is disgusting and selfish and you have deprived this child of it’s natural mother. You groomed her, knowing she had little options, into giving you that baby. Had she had the money and resources she would have never given her baby up. I feel you literally stalked for a girl in this scenario (while I do not have proof) you are literally giving off evil sadistic child stealing vibes and I hope you have a conscience to give the child back and just support the mother in raising it AND YOU CAN BE THE AUNT FIGURE!", "YTA, you make the evil step mother from Cinderella look like mother Teresa by comparison.", "YTA\n\nThis has to be one of , if not THE most disgusting thing I've read on here. And that's saying something. You went out and \"volunteered\" for the sole purpose of finding a pregnant young person with few options to bring in your home so you could con her into letting you adopt by saying things like \"open adoption\" and \"you'll be like a sister\" \n\nJust 2 weeks later when she was naturally attached to an infant that you said she'd have access to(and she carried for the better part of a year) you decide that now that the child is legally yours to kick this young lady to the curb with nowhere to go and close the adoption which you probably never intended to keep open to begin with.\n\nI truly hope that Karma comes looking for you and she gets it together and reverses the adoption before it's too late.", "He is not your son and you are not his mother. You lied to deliberately mislead that poor vulnerable girl, and stole her son. YTA so much. I hope this is made up because I am struggling to believe anyone could be so delusional and evil.", "YTA. You took a vulnerable child who had nothing and gave her the world. For the ripe price of her baby. Once you got what you wanted, you kicked her out and left her loveless and homeless and alone. Good job.", "That poor, poor girl. YTA.", "Never before have I truly wished the emotional trauma of having an adoption reversed on a desperate couple, but I hope it happens to you. You stole that woman’s baby with lies and manipulation. I hope she is able to get an attorney and get her baby back. You’re too terrible an asshole to deserve a child. YTA and so much more.", "YTA. You basically shopped for a pregnant woman in the most vulnerable situation you could possibly find. Then you promised her you would care for her as an older sister figure, insinuating that she and her baby would have a safe and loving home, with you and your husband as parental figures for BOTH of them. And then as soon as papers were signed you kicked her back onto the streets without her baby, because how dare she bond with HER child, right? Every step of the way you had malicious intent towards your makeshift surrogate, if we can even call her that knowing she did not know what she was consenting to. \n\nShe wanted her son. She may not have had the resources you do, but that is exactly why she was seeking help to begin with. You took her baby and threw her out like trash. Promising someone a home, claiming yourselves to be loving and deserving parents, just to do something as despicable as this. You could have had two children, you could have given both of them the love and security they deserve. I hope there’s some sort of legal action she can take to get her son back, you do not deserve him.", "YTA. Man this is just disgusting and sad. You manipulated this vulnerable young woman for your selfish needs. If you wanted a child you could’ve just adopted one without lying to someone like that. And then you had to audacity to get mad at her for actually trying to have a relationship with the child. This is honestly horrific.", "Sorry, closing the adoption on her makes YTA", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1- I made my sons birth mom move out after the adoption was finalized \n2- this may make me the asshole because the birth mom now feels abandoned and manipulated by me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Isn't there a compromise between living with you and closing the adoption? YTA", "YTA - your behavior is psychotic", "YTA. A disgusting, reprehensible human being. You and your husband both. You manipulated this poor girl into giving up her baby and then kicked her to the curb as soon as she was no longer useful to you. Will you be returning to the homeless shelter for another victim when the urgent for another child hits?", "YTA and a horrible being. You snatched away the kid away from his birth mother afrer agreeing for an open adoption. You manipulated a barely adult going through all kinds of emotional turmoil. The kid that you are calling your son will be ashamed of knowing the truth once he grows up.", "YTA\n\nYou took advantage of a **vulnerable** young woman, made **promises** you didn't keep and **abandoned** her the second you got what you wanted. \n\nI don't think you could be a bigger asshole. Or **villain**.\n\nI hope you have trouble **sleeping** at night feeling **guilty** for what you have done.", "YTA - she is a vulnerable teenager with no support system who suddenly finds two adults who at face value are trying to help and support her while in reality are grabbing for her unborn baby. You manipulate her into an adoption by selling her this idea of you all being a big happy family with you continuing to support her as well as the baby. Then you get jealous that she’s bonding with the baby and pull the rug completely from under her. It’s disgusting behaviour!", "So you deliberately targeted a vulnerable population to try and harvest one of their children. You succeeded. Congrats, that's probably the most cruel thing I've read here to date.\n\nYTA But mostly I'm hoping this was made up to try and invoke ire.", "YTA.\n\n>We offered to adopt him and have her be a sister figure to him, we told her that this was completely her decision and that we would support whatever she wanted.\n\nSo you think the good thing to do is kick a sister-figure out of your house? You promised something that you went completely back on as soon as the baby was born.\n\nYes, you are the AH and you manipulated an extremely vulnerable girl into giving up her baby and then dumping her as if she's garbage.", "YTA and the child you stole will know it, too, one day. You manipulated a teenager who had no resources so you could steal her son. I don't know how you could live with yourself. You are the kind of people who make adoption traumatic.", "I hope you lose the baby to a family that is not monsters. YTA.", "YTA and evil and cruel. You took advantage of a young woman in dire straits and now that you’ve used her and gotten her baby you want to kick her to the curb and make her homeless", "This is the worst story I have ever heard here. I have never hoped something is more fake before, but somehow, I dont think it is. YTA, and you are a horrible, horrible monster of a \"human.\"", "YTA. This poor girl thought she’d found a family to help her and instead you deceived her and cast her off as soon as you got what you wanted. Despicable behavior.", "YTA YTA YTA. Jesus Christ this is evil. That kid is going to hate your guts when he grows up and learns the truth.\n\n“Something to call your own??” A child is a person, not a toy. Y’all will be NIGHTMARE parents.", "You are an absolutely evil, terrible, horrific person. YTA. That poor girl. You should be deeply ashamed. This is the worst story I've read on this subreddit. It also seems like you went looking for a young and vulnerable person to take advantage of and steal a child from. I truly hope you get what you deserve", "YTA. You are literally evil personified. You purposely ingratiated yourself to a pregnant teen with this exact plan in mind. I am disgusted reading this and I pray she finds someone trustworthy to talk to who will come and destroy you. \n\nIf she is by some chance reading this I say \"Go to the media with proof\". Let this gain some traction, perhaps someone with legal experience can help you get your child back and these assholes can be charged. \n\nYou got your baby, congrats. If you ever want your baby to stay in your life you should never ever tell him this story. There is no way you can phrase this where you and your husband don't come out looking like absolutely predatory sociopaths. I'm serious, this is the worst thing I have ever read on this forum.", "YTA the absolute worst kind and I hope the child learns what you did when they turn 18 and never forgive you. Monster.", "YTA\n\nMy god. Asshole isn't even the word. You're despicable. You take in a vulnerable, very young woman in a very desperate situation and give her things she desperately needs--things like food and shelter. Then you pressure her to give you her baby. She eventually is manipulated into saying yes, possibly out of fear of being put back out on the streets if she refuses. You promise to keep it an open adoption. After she gives birth, you go back on your promises and kick her out of her home because she's being \"clingy\" with her own child. HER child. The goal should always been to keep the baby with the birth mother if possible. Adoption is inherently traumatic and should be a last resort. Certainly not this cruel coercion you enacted.\n\nYou are vile people who stole this woman's child. If this isn't illegal, it should be. It is certainly immoral. You are not Aiden's mother, you are a thief who stole him from his mother.", "YTA. A pure evil one at that. You have essentially kidnapped a baby from a poor teen who has been most likely been abused in foster care with no where to go. You have manipulated the girl with false sense of security, made her sign away her parental rights and then kicked her out after merely two weeks of giving birth when her body hasn't healed yet. Do you know the mental stress even the well adjusted new moms with lots of support face? And you have treated and inflicted the worst trauma on this poor girl. You haven't mentioned any specific instances of the birth mom overstepping, you just need an excuse to cut her off and steal the baby.", "YTA. In fact you’re worse than an AH. \n\nYou found a vulnerable young teenager, pretended to be her family, to steal the baby from her when she was in an incredibly difficult situation. Instead of supporting her and helping her get on her feet and trying to keep mum and baby together, you tricked her into giving up her baby to you. \n\nThat baby shouldn’t have you as their mother. Being raised by a narcissist will damage that baby.\n\nIf you aren’t evil, you will give parental right back to the mother and let her move back into the same room as her baby and try to be bonus grandma to the baby and mother to the teenager.", "YTA. For literally no reason, let's give you the benefit of the doubt and ignore the STRONG probability that you guys planned this all along (as birth mother accuses):\n\nYou are STILL the Asshole. She's literally half your age, two weeks postpartum, and probably still grappling with trauma from being homeless - of course she's having issues!!! You guys are have the advantage of maturity, the advantage of money & stability, and very likely the advantage of the law on your side. You should know better, and you can easily do better.\n\nThere's a fairly straightforward NTA way to handle this - help her get support systems in place, a job after she's recovered, an apartment or something, and set up a visitation schedule. I'm not saying buy her a house or whatever, but try to help her get one of those crappy $12/hour barista jobs or something and a tiny apartment with roommates. Once she's in a more stable place, hire her to babysit for you guys a couple days a week. She'll probably come around really quickly when she gets a sense of how hard taking care of herself is, much less her child, and she'll know she can be a reliable Aunty A in his life.", "YTA and a predator. You guys “volunteered” for the purpose of finding a human body to use, and then you used it, and then discarded that human like trash. \n\nI hope she gets help to get the adoption reversed. Given your lack of morals and ethics, you should not be parents anyway. God had it all figured out before this.", "**YTA**\n\n\nThe moment I began to read this my “spidey” senses began to tingle.\nYou are a vile, manipulative human being.\n\n\nIt sucks that you and your spouse are infertile, infertility can be a low blow to anyone.\nHowever, what you have done is down right cruel and disgusting.\n\n\nHow convenient that you started to “volunteer” with foster children and that a young, pregnant homeless teenager, with no baby daddy in the picture, came to your home.\n\nWhat a wonderful gesture to offer her a room, maternity clothes, food, paid medical expenses.\n\nBonding over her fertility and ability to carry a child to full term, while you spoke of wanting a child but are infertile.\n\nAnd to top it off, a lovely image that she could play “big sister”, IF she hands her child over to you.\n\n**YOU AND YOUR HUSBAND ARE PREDATORS!!**\n\n***How dare you manipulate this young woman and attempt to come here acting like some victim.***\n\n\nYou manipulated that young woman and you know it.\nDid you ever consider her post partum? Get her checked out? Or were you too concerned with her child?\n\n\nYou do not deserve to be called a mother to a stolen child, regardless if papers were signed or not.\nYou coerced that young girl and I would bet thousands of dollars, your plan all along was to throw her out when the time was right.\n\n\nYou and your husband deserve whatever negative toxic mess comes your way, and I hope it comes 3 fold.", "Absolutely YTA \nI'm deeply disgusted of you.", "Wow! YTA!!! Get ready for karma because you can't do something this evil and think you'll get away without any repercussions. Manipulation at its finest. How do you sleep at night?", "YTA. This is, without a shadow of doubt, one of the worst things I've ever read on this sub. I'm genuinely stunned. What you have done is horrendous and you should feel deep shame for what you've done.", "YTA. This was predatory behaviour from the start.", "Thats so fucking vile and evil, how are earth did you think this was okay\nYta", "So you pretended to be interested in volunteer work. This allowed you to make contact with the local unhoused youth population and ultimately achieve your real goal: you found a brood mare in distress.\n\nUpon selecting a good target, you ingratiated yourself and presented the idea of adoption as comforting and familial (she could be like a sister to Aiden, how sweet!)\n\nThen, as soon as the ink was dry and probably before her body had recovered, you discarded her husk along with the placenta. What a way to treat Aiden's sister, a human who just gave birth, and a girl you claimed to have bonded with.\n\nYTA. Monstrous.", "You wicked witch!!!! There are worse things I’m calling you!!! YTA and a HORRIBLE HORRIBLE  HORRIBLE VILE UGLY WOMAN. Karma is going to get you fast!!!!! Guess what sweetie you are NOT his mother and he will know one day and he will hate you for it. Be ready it’s coming. You reap what you sow cow.", "I’m adopted and this story broke my heart. I feel so sorry for Aiden. You manipulated his poor birth mother. She was led to believe she would have a connection with him and not only did you steal that from her, you stole it from “your” son. I’d give anything to know my birth mom. You’re a monster and a massive AH.\n\nYTA YTA YTA !!!!\n\nEDIT: Added punctuation", "YTA. And I don’t say this lightly you are evil and absolutely deplorable in your actions with this young woman!", "YTA - You could have helped that girl get back on her feet WITH HER SON, not take the baby and throw her to the streets because you felt threatened that she was showing love and affection to the baby.\n\nI don't know why not being able to have a kid makes some people do really questionable things, no matter how it affects others.\n\nYou do not deserve to be the babies mother with how you went about this and you've most likely just absolutely shattered and wrecked a young girls life.", "YTA. \n\nI hope she reports your husband and you to the state agency that deals with fostering. You literally preyed on this young woman. It's despicable.  Truly reprehensible. You may be great parents to this baby. You may legally be all good. But morally and ethically, you and your husband are awful people for what you did. (imo).", "Of course YTA you manipulated a poor young women in a dire circumstances and when you got what you could, you kicked her out. She had this baby in her belly and bonded with him. You feel entitled to this child almost like some sort of sick compensation for taking her in. How cruel you are", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nFor the past 7 years, my husband 43M and I 37F have been trying to have children, but we’ve been unsuccessful as we’ve went to specialist and have been assured that we can’t have children. Our hearts were broken and since then, we’ve wanted nothing less than to become parents and have something to call our own. \n\nLast year, we decided we would volunteer helping at foster homes and helping the youth and young adults that were struggling with homelessness. While doing this, we met our sons birth mother (A) 19F. She was pregnant and struggling with homelessness and we offered to take her in, help her with maternity clothes, healthcare, transportation with doctors appointments etc. She took us up on our offer and moved in, and thats when she began telling us that her child’s father wasn’t in the picture and she had no way to provide for him. She didn’t know what she was going to do and had no job or way of caring for him. She was 20 weeks pregnant around this time. \n\nAs our bond grew, we told her our struggles with having a child of our own and told her that it would mean the world to us to have a child as we are financially stable and a loving family. We offered to adopt him and have her be a sister figure to him, we told her that this was completely her decision and that we would support whatever she wanted. After a few weeks, she told us that she wanted us to adopt him once she gave birth and we agreed to an open adoption. We thanked her, and we supported her in every way she needed and she also had her own room in our home. \n\nFast forward, she gave birth to our son, Aiden. I was there for the birth and our bond was unexplainable. Shortly after, the next morning she signed off the adoption papers and terminated her rights. We then took him home along with her. About 2 weeks after his birth, she began becoming very clingy with our son. We explained that he was ours and she was welcome to help with him, but he was my son and I would make all decisions regarding him. This upset her, and she felt hurt, so we ultimately decided to ask her to move out and once the adoption was finalized, we haven’t had any contact with her since. We decided to close the adoption and we asked her not to contact us any further. \n\nHis birth mother thinks I’m the AH, and accuses me of manipulating her with false pretenses however this is not true and aiden is our son and I am his mother so I have to do what’s best for him. Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA", "YTA - you basically snatched a baby…..it is understandable she was attached to the baby post birth. What a terrible situation for everyone involved and sad.", "YTA", "YTA. This is so gross and predatory. I don’t believe for a second that you didn’t see her and thought “hmmm I wonder how I can get her to let me adopt her baby”. You wouldn’t have took her in out of the kindness of your heart, you knew what you were doing. That poor baby is going to grow up and learn what happened when he eventually contacts his birth mother and he’s going to cut you off completely. You’re evil.", "YTA, return the child to her, you cold hearted *bleeping sounds because Im not allowed to say what I want to say* \nYou manipulated this woman, you’re a predator. You weren’t helping her, you were trying to steal her child!", "Hopefully she is still in the cooldown period of the contact and can claim him back", "Yta and a major one. You knew exactly what you were doing with this girl and as soon as you got her baby you cut her off. You are beyond evil.", "You really typed all that with a justified mindset didn't you?\n\n\nYTA", "YTA and this is horrible. You kicked her out after she had the baby and told her not to contact you?  You did manipulate her with false pretenses, and I hope she sues to get her baby back.  You also mention in your post that you bonded with this girl.  What happened to that?", "Wow you took advantage and groomed the young girl. YTA. This is just so gross how you went about it. Pure evil.", "Evil", "I really, *really* hope this is bait because this is one of the most evil things I've ever read in my life. What the actual fuck.", "Wow, you should do an AMA about sociopathy or possibly even psychopathy. YTA and the worst thing I've ever read here.", "You preyed upon a vulnerable girl to get your dream fulfilled. That girl is probably emotionally distraught since she just gave birth 2 weeks ago and only 19. You are evil. TA is too light a term to describe how disgusting your actions have been.\n\nYTA x100000", "YTA\n\nYou lied to and manipulated a vulnerable young girl. You’re an absolute horrific asshole. \n\nI hope she is able to find a lawyer who would work pro-bono. She terminated her rights with specific conditions which YOU have now broken. It was not a closed adoption. \n\nI hope she gets her child back. And I hope that you never have another opportunity to prey on a vulnerable person. \n\nHire a surrogate or go through an adoption agency so that you will need to do things ethically.", "YTA you manipulated a young homeless girl and legally stole her baby!", "Are you serious? What is wrong with you? YTA. Not only are you the AH, you’re also pretty unethical and disgusting.", "YTA. You are predators who went looking for, then groomed a vulnerable teenager and knew exactly what you were doing. Sickening.", " YTA. How could you delude yourself into thinking otherwise?", "YTA.  And despicable and predatory.   You should be in jail.", "YTA.\n\nJesus Christ, you and your husband are monsters. I hope that mom gets a lawyer, and I hope karma bites you in the ass.", "YTA\n\nYou are vile. The newborn will grow up and will find out what you did. Not only did you take advantage of a homeless youth and cause her so much pain, bringing this child into your home under these circumstances will cause them so much pain in the long run. Did you think about any of this?", "Wow ! You preyed upon vulnerable woman and children , under the guise of assisting them ?!?!", "YTA doesn't cut it. This is just evil.\n\nYou took advantage of a vulnerable woman under the guise of \"charity\" and took her child from her under false pretences.", "YTA for being a predator", "YTA and an evil cold blooded one. Please, have some empathy AND re-read whats you wrote carefuly.", "YTA and really evil. I hope she gets out of that situation and legally exposes you. Wait til “Your” Sing finds out. Book your nursing home now.", "Not often do we get to see an OP so wretched, evil, sick, vile, and twisted as you. Holy shit. YTA and you make me ill.", "YTA. You knowingly took advantage of a vulnerable kid. You painted a fairy tale of how great it would be, and how she could be a \"sister figure\" to her baby. Once she signed the paperwork, you said \"Just kidding! You're kicked out and the adoption is closed.\"\n\n\nThe ONLY reason you volunteered to work with foster children was to try to get a baby. You knowingly lied and took advantage of her, and then kicked her to the streets as soon as the ink dried. \n\n\nI want to add that this girl was especially vulnerable. She was alone in every sense of the word: no family, no significant other, in the system, pregnant, and poor. She didn't have family to say \"Be careful around these two, they're manipulative and are just using you.\n\n\nHow do you sleep at night?", "YTA. How dare you even ask if you are the asshole?! There is no doubt about it. You are also evil. You did all what the actual mother accused you of. You manipulated her, made her think that she would be part of the child life and then threw her out! I bet you planned this from the start when you got her to move into your home.", "r/amithedevil", "Yta.  You could have helped her get on her feet with a job and such after she had the child.   Then, once she was stable, if she made the decision to relinquish her child, that would be different.", "YTA. And evil. SO EVIL!\n\nYou stole a baby. You lied and groomed and lovebombed so that you could steal a baby.\n\nI sincerely hope that poor girl has some legal recourse to take her baby back from you. You people should never have the ability to influence a child, much less raise a stolen one.", "YTA. This may be the most disgusting thing I've read on Reddit. \n\nOP I hope you make it right.  Aiden is not going to be impressed when he grows up and finds out what you did.", "YTA. Straight up evil. You took in a pregnant 19 year old, treated her well to gain her trust so you could make her give you her child, then threw her in the streets when she was no longer an incubator. You PROMISED that she would still be in the child's life, but i guess that wouldnt fit your vision of having \"someTHING to call our own\"", "When the baby grows up, how do you plan on explaining all this to them? This child will ask about the circumstances of their birth, and you will owe them an explanation. You may start working on what you will say now because something tells me it won't be an easy conversation.\n\nYou have to do what's best for your baby, huh? And that involves the baby's bio mom being on the streets? You're the worst kind of evil. The kind that's self-righteous and totally convinced you're in the right. YTA in every conceivable way.", "You're a freaking monster, no other words. You took advantage of a young girl who was in a bad situation to steal her baby. I hope she gets the adoption reversed and sue you. You and your husband are predators who don't deserve to be parents. YTA.", "YTA. Shame on you and your husband! \"Evil\" is the appropriate word to describe you. You scammed your way into a baby. This should be criminal. You should go to jail for this for a long, long time. Give the baby back to his real mother (in this case, his biological one).", "YTA!!! That poor girl. This sounds like or at least so very close to human trafficking. This is just awful, no words can even describe how much so.", "> I was there for the birth and our bond was unexplainable.\n\nThere was no bond. It was a baby around new faces. You know where that bond really was? With the birth mother. The one you got jealous of and forced out of the picture so you could steal her baby because you failed to have one of your own.\n\nYou and your husband are absolutely terrible people. You joined a group to find a person you could exploit and steal their child. You're both predators looking for someone you could manipulate to get what you want. Disgusting excuses for humans.\n\nMay every day be worse than the last for you.", "OP, this is honestly one of the most evil posts I've read in a long time and I do not say that lightly. I'm hoping you will take what I say to heart and do some soul searching. \n\nYou did take advantage of this young women. She was still a teen and in a very physically, financially, and emotionally vulnerable place. When she came to you about her fears in providing for her child, instead of being a rallying cry for her and helping her to get back on her feet, you said you'd adopt her child. This was not a good decision for her to make during such a vulnerable period. \n\nThen you kicked her out once she did the natural thing and started getting attached to her child because you wanted to have that attachment alone. That is just so unfathomable cruel. You let your desire for a newborn baby cloud your judgment to such a serious level, that I don't know how you can fix it. You've already taken a vulnerable teens baby without giving her a proper chance to make a clear decision herself. You could have always adopted her baby down the road if after a time she decided on her own she couldn't do it. \n\nAdditionally, how do you foresee this playing out in the future? Are you going to keep her completely away from her child? Do you plan to lie to the child about their birth mother or try to keep them from pursuing her? What about when said child finds out that you did this to their mother? \n\nYTA and I feel so deeply sad for this young women. She was effectively pressured into giving up her child and then suddenly forbidden contact when you decided she was showing too much attachment to them.\n\nEdit: missed that you closed the adoption, so you mean to keep her from seeing her child after your promised her access. This was a terrible decision that you will deeply regret down the line. One this child figures out he is adopted and searches for his birth mother and finds out what you did, he will leave you and never speak to you again. He will find her too. With technology the way it as and the ability to hire people to help you track your family, he will find her and know what you did.", "YTA. And a damned predator. This is the most disgusting thing I have read on here this week.", "YTA and you should probably be the reason a new law is created", "YTA.  You knew she wasn't in a right frame of mind.  It sounds like you deliberately sought out a desperate teen mother.  This girl was clearly not ready to give her baby up, and you took advantage of her circumstance.  Sure, alot of adoptions stem from the Mom not having means (the government not helping her find a way to keep her baby instead of having to give the child to people simply because they have the money is a whole other issue), but this is a bit different and not the way to adopt.\n\nI don't know where you live or what the adoption laws are there, but don't birth mothers have a certain amount of time to change their minds before the adoption is irreversible?  I thought adoptive parents are always warned not to get too attached until the point of no return has arrived.", "YTA. Holy shit. Does your victim have a legal fund I can donate to? You people are monsters.", "YTA - you basically groomed a teenager because she was pregnant and then had her sign her rights away before throwing her out. I think you're the biggest AH I've ever read about on this forum. Truly shocking. That poor girl should have had a lawyer and made sure the part about you living together was legally binding.\n\nYou took someone vulnerable and young and manipulated her into giving up her child because you are infertile. She is his mother, she carried him and gave birth. She has a bond with him and was going to want to do things with him. She's not a dog that you just whelped for the puppies. Hell, even dogs cry and mourn their babies when separated. You treated her worse than a dog. I hope when Aiden grows up and realizes what you did to his mother, that he cuts contact with you.", "You are the biggest asshole I’ve ever seen. How are you okay with stealing her kid under false pretenses that she gets to be apart of his life and then as soon as she starts being apart of his life you kick her out the door? God I don’t wish evil on anyone but you have karma coming your way and I hope it hits like a freight train. That girl is back to where she started minus the kid you manipulated her into giving up. Ffs open your god damn door back up and let her be a sister to that boy.", "So you’ve stolen a child. YTA. \nI hope she takes you to court.\nThat child is going to hate you when it grows up!", "YTA but honestly “asshole” isn’t strong enough. You’re a monster. You knew exactly what you were doing all along. My God, this sounds like a Lifetime movie. You preyed on a vulnerable young woman just to get s baby at any cost. You’re sick. I can’t believe this is legal.", "In 20 years, if reddit still exists you will be posting here asking if YTA for doing this when your son cuts contact for it. You cannot be a good parent and do something this selfishly cruel to \"obtain\" a son.", "YTA. You are evil and if you believe in hell, you're all set for a free ride there.\n\nI hope the baby's mother gets him back. Because if he has to grow up with you, he will never, EVER forgive you.", "YTA. I have been on reddit for 18 months and this was by far the easiest one for me to give. Ever. With regards to you, I will leave it at that.\nHowever, adoptive children often feel abandonment issues towards their birth parents. It IS better for the kid foe them to stay involved if they would like to. Let’s be honest, you did a 180 on this young lady for YOU, not Aiden. I hope he looks for her the moment after his 18th birthday party ends.", "YTA and I wish we could find this girl and set up a GoFundMe for her to get on her feet and a lawyer to get her baby back.", "You are the title holder of YATA. Congrats.", "YTA. You took in a vulnerable young woman, spent hours talking with her and taking care of her to cement a bond. Then suggested she let you adopt her baby, but it would be open and she could be a part of his life. Then once you secured that, you pulled the rug out from under her and forbid her from having contact. I don’t believe for one second this wasn’t the plan all along. You and and your husband are truly awful people. Poor girl and poor baby.", "YTA\n\nYou and your husband are predators. You sought that girl. You hunted down a homeless  pregnant teenager. You selected her for her vulnerability and lack of options. \nYou set her up. You lulled her in, made promises, gave her a “safe” home, and manipulated her into signing away her baby. You promised her a safe home and a good life for HERSELF as well as the baby. And then when she signed over the baby, you kicked her to the curb. \n\nFUCK YOU.", "YTA. The FBI should see this and you should be behind bars for human trafficking.", "I don't think I've ever read something as despicable as this from the wrong-doers point of view. I hope when Aiden eventually finds out what happened, that he cuts you out of his life permanently. You don't deserve to be a parent. YTA.", "You don't deserve anything at all YTA", "YTA - Honestly AH doesn’t even come close to what you are. I’m sure karma will catch up.", "YTA", "YTA, extremely TA!! There’s no scenario where you’re not. You preyed upon a young, vulnerable girl with no other options, promised her access to her child and took it away?? All because she was attached to something that lived in her body for nine months? You are a monster and I hope she gets custody back somehow. Does this girl have a gfm for legal fees because I’ll donate so she can get that baby away from these manipulative “parents”.", "OP and her Husband are The Aholes \n\nI knew it would be bad when she wrote 'something to own' but holy hell this couple make disney villains look innocent \n\nThey used the Foster system to fish for a victim to groom into giving them a child and then after getting what they wanted they got rid of the poor girl \n\n2 weeks post natal, anything could happen to that pool girl \n\nOP you and your husband don't deserve to be parents and I hope that poor girl finds a way to reverse the adoption and if not then I imagine that when her child is 18 and looks for her when he finds he is adopted (and he will) and finds out how you behaved I hope he never wants to see you again \n\nYou are evil and are predators who should be banned from being anywhere near vulnerable people", "You’re disgusting.", " Slight YTA\n\nYou said that she could be in his life as a sister figure and have now asked her not to contact you again. You went back on your word about her being in his life. This is where you are TA.\n\nIt is clear from her actions after he was born that she did love him, but knew he would have a better life without guys as you could afford to have him and care for him.\n\nI also understand from your point of you. He is legally your child, and you all agreed you would adopt him. You may feel like you don't want to be a shadow to her and feel as if you aren't his mum and can't make decisions regarding your son.", "[deleted]", "Ive been seeing alot of comments saying they groomed the girl im just wondering how tho they were volunteering at the place then befriended the girl then offered her a place to stay she accepted it she also agreed about the adoption so like she could have easily said no", "ESH. It sounds like you exploited her situation. With that being said, she is probably not able to care for her son properly. The child will be better off.", "At least set her up somewhere safe and help her get a job. Other than that, no you are NTA because she signed off on a closed adoption of Aiden.  People who are saying otherwise have not walked in your shoes.", "You’re not the asshole I don’t care for the other people say. She didn’t have to give up her child for adoption. There are plenty of programs to help single mothers.", "You are a CRUEL asshole… wow, shame on you", "and aiden is our son and I am his mother so I have to do what’s best for him.   \n\n\nThis is only an example, this whole post is giving me a massive ick.  \nThat's to say, you do OP", "Yta.  You promised to help her, be her family instead you stole her child. There is a special place in hell for kidnappers like you.", "Predator", "YTA.", "This has to be fake.", "Yta", "Poor woman. Maybe you and your husband just weren’t meant to be parents. A lack of compassion is not what we need more of in this world.", "r/AmITheDevil", "YTA, a predator, and will be one of the most prominent evildoers Am I the Devil has ever seen. Kicking her out was your plan all along, how do you even sleep at night?", "Always terrifying when two sociopaths find each other.\n\nNo doubt this was your plan all along, to groom a terrified young mother to sign her baby away to you (for free).Otherwise you would have worked they and agency and done infant foster to adopt. But then clearly neither of you would pass the psych eval.\n\nYour the indefensible AH and you know it.... Which is why you don't reply to any comment. She knows where you live. I hope she haunts you.... Forever", "There's a reason God didn't make you two parents", "YTA. \n\nLike those backyard breeders who throw away the female dogs that can no longer give them puppies to sell. \n\nIt’s obvious you only cared about yourself. She’s clearly struggling as she gave up her child.", "Im just glad that you and your husband cant get kids natural.", "YTA\n\nYou got close to this woman, bonded with her, and fed her false promises. She was easily manipulated. You made her think you wanted to help her when you never gave a damn. You manipulated her to get her child. \n\nShe needs to lawyer up. She did not agree to a closed adoption. You lied to get what you wanted. If you are in the US, birth parents still can reclaim some rights after an adoption, so she's got a good chance of at least forcing it back open. She is the biological mother and will always be. You will never sever that tie, especially as she has a case for coercion.  Pray the kid doesn't go looking for her when he's older cause this will likely not end well for you if she doesn't take action now and he finds her. Keeping a willing parent away is not easily forgiven", "predators on their hunt. I don’t buy the story of just “helping”, it was a hunt for vulnerable pregnant girl. she was hurt, desperate enough to believe in all that. YTA. OP would nor be good parents with such behaviour, manipulative AH.", "YTA doesn't begin to describe you're despicable vileness.  I hope you burn in hell.", "YTA. This completely reads as you manipulating a vulnerable teenager and then tossing her aside once you got what you wanted.\nI don’t think she wanted to give him up, she just didn’t have the resources and you essentially told her you would all be together under your roof. \nHopefully she gets the help she needs and given the circumstances I’m sure the adoption would be overturned, or whatever the legal term is.\nYou really don’t look good here.  This is extremely toxic and manipulative.", "YTA for telling her it would be an open adoption, having her sign the papers, and then saying “Nah we’re going to close the adoption actually, I know we told you you could be like a sister, but we lied. Get out of our lives” \n\nYou didn’t try to communicate with her or anything, you tricked that poor girl. \n\nEvil. \n\n*Also, I hope you realize one day, your child will turn 18 and there is absolutely nothing you can do to stop them from finding their birthmother. This child is going to resent you so much when they find out the truth of what you did…..", "YTA what a manipulative piece of fucking shit.", "I've never ever felt so disgusted by a post before.\n\nYTA but that isn't even enough to describe how hidious your soul is. This is truly the purest evil. Dear god...", "YTA and a despicable human being, you effectively stole that child. No-one will support what you did and Aiden will grow to hate you. He will find out the truth of his birth and you will never be able to make this right with him if you don’t reverse this now. \nYou need to find this young woman and make this situation right again, blame it on the overwhelming emotions of finally having a child, but make it right. You will never have piece of min until you do, the fear of this coming out will overshadow you and Aidan’s life. It will make you all miserable and Aiden WILL hate you.", "You are Quite Literally going to hell. YTA", "YTA if I were her I’d find a pro bono attorney who is just as appalled as I am and sue for rights. You used her hardships and emotional health against her. \n\nYou lied about the role she would play in this child’s life. You are evil", "YTA. Wait until your child learns what you’ve done.", "You were so desperate from a parent that you groomed in 19-year-old into thinking that you were her only option to care for her son, and then when she as a teenager, while she might be legally in adult she is still also a teenager, understandably had emotional reactions to not being able to parent The child she was groomed into giving up, and wanted to spend a bit of time with the child she just gave birth to, the child you claimed you were going to allow her to treat as a sibling (sometimes siblings get clingy with baby siblings It happens, not every older sibling absolutely despises their new baby so), You decided to go back on your word, close the adoption which she never agreed to, and completely cut her out of the baby's life. I honestly hope that your child sees this post one day, recognizes you for the evil people you are, and seeks out contact with their birth mother. Yta big time.", "“Something to call our own” ..you mean someone? This can’t be real but just in case it is- YTA", "YTA\n\nYou manipulated a vulnerable young girl, lied to her, and then threw her out. The baby that you now take care of will be found by his mother one day and learn the truth.\n\nKarma is a bitch.", " Sounds close enough to Handmaid’s gales to me.", "YTA and rest assured, if you do manage to keep hold of that poor baby, when he grows up and discovers the truth, which he will, he will abandon you and you’ll be alone. It’s only a matter of time. You’ll never be able to be happy or free because this evil deed will follow you wherever you go and karma will always be waiting for you, in this life or the next.", "You are a classic storybook villain. Pure evil.", "YTA you stole this baby from his mother and I hope she figures out she has 30 days to change her mind and do so. This is not your kid.", "You are definitely the AH, but far worse than that, you are vile. You took in a scared, pregnant, homeless teenager. You groomed her, you pretended to care about her, you took her baby, and then you threw her out because she was attached to the baby! Of course she was/is! She only agreed to the adoption because it was open and she could stay in her baby's life. You broke that deal. You USED her. \n\nYou do not deserve to be parents.", "YTA. Not only that, you are a predator. A monster. You sought out a vulnerable pregnant person, manipulated her, pretended to care for her, talked her into giving you her baby, insinuated that she’d be the baby’s sister (which implies you’d be parental figures to her), then booted her to the curb with nothing after you finalized the adoption. I don’t do religion. But, I kind of wish there was a hell for you to burn in for eternity.", "YTA", "You are out of your mind. Shame on you for manipulating a vulnerable woman like this. You aren’t Aiden’s mother - you’re the sick lady that tricked his mother and took him.", "Karma is going to have a great time with you. Hell has a seat awaiting you. There’s a reason you aren’t able to have kids.", "You’re a sick person OP I hope this poor woman tells everyone the kind of person you are I hope HER kid grows up to hate you", "I feel sick… \n\nYTA", "YTA. You know you lied to that girl. The \"sister figure\" scene lasted all of 5 minutes after she signed the papers. Life wll send you the bill for this one.", "YTA\nYou're a disgusting human being.", "YTA, you manipulated this young woman to steal her baby.", "YTA - not only an asshole, but a monster", "YTA and I hope she takes you to court for manipulating her into adoption. You're an evil and vile person and really don't deserve a child based on this behavior. What are you going to tell him when he grows up, looks for her, and finds out the truth? She agreed to adoption based on it being an OPEN adoption. You don't get to change that after the fact because she still wants contact with HER child. I hope your attorney finds out about this and drops you based on the ethics involved in this situation.", "YTA and what I want to say to you would get me banned off of Reddit. You are truly a disgusting person that deserves the absolute worst in life, alongside your husband.", "Everyone can see through all of this. You knew exactly what you were doing when you took this girl in. You are beyond despicable. Literally evil. YTA.", "YTA\n\nYou manipulated her, stole her child and then kicked her out on the streets making her homeless again?! This is so disgusting. You're not an asshole but an evil and cruel human being. \n\nHope when the child grows up finds out about this.\n\nagain YTA (should be more than that honestly)", "YTA", "YTA. And deep down you know it.", "Wow. I've never heard such a clear-cut evil YTA. \n\nYou lied to her. Stole her child. And then pretended it was all in the child's best interest. \n\nCan't wait to hear what you come up with when he eventually finds out he is adopted and wants to meet his birth mother.", "OP, you might be the most evil person ive seen on this sub", "If you love this child you will give him back to his mother. YTA.", "YTA.", "YTA.\n\nWhat an evil person you are.", "YTA and I think your child will resent you when they grow up and find out what you did.", "You are evil monsters. One day “your” son will grow up and hear this story and NEVER speak to you again and you will once again be childless as you deserve. YTA YTA YTA", "sounds like the handmaids tale", "Holy hell you are the devil. YTA \nSide note...Does anyone know how she can go about closing the adoption after an open adoption was agreed-upon? Is that enough for the birth mother to overturn the adoption?", "I hope this post gets so much attention that the media grabs it. Maybe it isn't too late yet for that period the birth mom has to change her mind. Maybe she doesn't know she can.", "Yta yta yta yta", "Yta and once her son finds out you better hope he only goes non contact with you and doesn’t do something much worse you’re an absolutely disgusting human being that can’t have children because you’re not a mother", "YTA You made promises which you broke. Maybe you don't think you manipulated your son's birth mom, but you most certainly did.", "YTA\n\nShe shouldn’t have been making that decision at that time with only your counselling.\n\nThat being done - you did go against the agreement. It was an open adoption. That is an agreement.\n\nLastly, it was simple as getting counselling to determine a good distance for her to live so she is detached and maybe visits. Live as a sister is a totally confusing and messed up plan, obviously she bonded with her baby - and that then is her son. \n\nAs much as you’ve wanted a child. Any reasonable person would also get outside counsel to ensure they’re not biased and potentially taking advantage of a child basically at 19/20, who is vulnerable. Especially considering how rightly regulated adopting is, for good reason, and you being in a very grey area with the power and age dynamic - you’re absolutely wrong.\n\n- Why didn’t you file for adoption through agencies?? \n\n- Did you have anyone give her counseling and therapy? \n\n- Think about this like adults, how’s this ok?? How are you fit parents if you can do this to someone else’s child? \n\n- what are you modelling for *your* son and going to tell him? Ready to be his cruella de ville?\n\n- Did you even talk to the birth mom’s family through this?? \n\n- Anyone in her corner to give her objective and unbiased support?\n\nYou did this for yourself and conned a kid out of her child, I don’t know where you’re in doubt?\n\nI’m sick for the mom, you just destroyed her. Good job fostering…", "wow op I’m not one for religion but you are going to absolutely burn in hell when you get there", "YTA for sure 😂🤣😂 but what's done is done and one day you will have to explain yourself to Jesus.", "“something” to call your own?\n\nThat’s a child not a possession ffs.\n\nYou preyed on a young and extremely vulnerable woman in order to gain possession of a child. And you made her homeless once again (postpartum too) once you got your prize. \n\n\nFor judgement: YTA, but really you are worse. I’ll get banned if I say what you really are.", "You're the asshole. That was her baby. Not yours.", "YTA. So you took this child in, under the guise that her child *and* her would be okay. She'd have a home. Instead, 2 weeks postpartum,  literally 14 days after pushing a child out, hormones everywhere. You kicked her out because she was *bonding with her biological child*?! May that girl find the grace she deserves, and I hope that child that you coerced and manipulated for is taken away from you. You're evil and cold hearted. Maybe you shouldn't be able to pass down that mentality.", "YTA and absolutely inhumane. But you aren't going to change with our judgments, are u? But you know what, life has a strange way to get back at people who are evil and karma will take care of u.", "This is one of the worst things I've read. I really hope it's fake. YTA", "Look I get it. We tried for years and years, I understand the all-consuming desire for a baby. I understand infertility. We went through IUIs and IVF and everything else. \n\nWhat you did was beyond evil. You were a predator who groomed and manipulated this woman into giving up her baby. Then you broke the terms of your agreement and closed the adoption after you agreed to an open adoption.\n\nThere are no words for how fucked up this is. You better hope karma is not real. YTA.", "YTA it looks pretty much like she thinks it does. You used her to get the baby you wanted and once you didn’t need her anymore you threw her out like trash. Poor girl.", "YTA holy shit you're evil af", "YTA", "YTA. You coerced and manipulated her then threw her away. You never gave her the time to make sure that she was comfortable with her decision.\n\nIt's people like you who give adoptive parents a bad name.", "Is this even legal? Holy crap. That's so scary. The young woman had her baby stolen by OP and OP's partner.", "YTA\n\nenjoy your stolen baby lady. That is such a dick move.", "YTA, and whenever Aiden finds out the real story as a teen or adult (by the way they WILL find out the truth no matter how hard you hide it) your child will likely never speak to you again because this is outright EVIL.", "Oh my god. You took advantage of her, groomed her, and now you're kicking her out. You're truly horrendous people. I just hope her son realizes it. YTA", "YTA. You exploited someone in a desperate situation. You told her it was “her decision” but you were the only thing standing between her and living on the streets. You don’t think she felt a bit of pressure there? I hope she’s able to legally prove that you coerced her into giving up her baby. Hell, I’d pitch in for her legal fees myself. Good luck living with yourself.", "You are a disgusting person. You likely only went to help homeless youths in order to do this. You even convinced her she’d have a sisterly role in her son’s life, implying that you would continue to support and care for her. Instead you tricked her, kicked her out & stole her son. Have you even considered what the child will think when he finds out about how you treated his birth mother? This is such a horrific situation, I hope she is able to receive legal help.", "YTA is just not even a strong enough statement here.  \nEvil, absolute evil what you did", "This is something out of Handmaid's Tale. I gave a baby up for adoption at 20 and had a close relationship with the adoptive parents, my situation was different as I never lived with them, I can't imagine how this girl must feel, I was informed in my decision and still had a mental breakdown postpartum and continue to suffer from depression from unresolved feelings regarding this and I'm 30. YTA. I hope this girl you cast out after she did what should have been a beautiful, informed, and selfless act for you can find help and support somehow before she ends up down a dark hole she can't get out of and I hope OP lives with that knowledge of causing such pain to this person everytime they look at their \"something\".", "This is so much more than YTA. You should be posting this in r/amithedevil\n\nWhat the actual hell is wrong with you manipulating this poor girl into giving you her baby and then slamming the door in her face?! You don’t deserve any child if that’s how you treat people. I hope she fights like hell to get him back from you.", "YTA and an evil person. Karma will take care of you with that baby that was never yours to take.", "This is absolutely disgusting and predatory, the fact that you’re comfortable admitting it publicly is absolutely foul.\n\nYTA and also quite possibly the literal devil.", "YTA. I hope you go to jail.", "YTA  \nThis is straight up sounding like an Episode of the Handmaid's Tale. You are vile and evil OP. May you get exactly what you deserve.", "You stole her baby and this will not end well for you.", "YTA You and Your husband are terrible people you groom a young pregnant woman down on her luck to give you her baby then get mad when she spends time With the baby?? Then you kick her to the curb?? Horrible Awful people.", "Are you green also? Because I do believe you're the wicked witch. YTA and a baby stealing witch", "Wow, I didn’t know that the actual devil used Reddit!\n\nYTA and a monster, really. This is just kidnapping with extra steps.\n\nThe child is going to rightfully fucking despise you when they find out!", "I would hope this young woman has access to a child advocate who will force you to either rescind the adoption or force you to live up to the terms you both initially agreed to in terms of an open adoption. Since it was signed open adoption you cannot decide to close the adoption, I hope someone listens to her and points her to an agency like the one I work for…we’d love to meet you and your lawyer.", "YTA.\n\nI stopped reading when you referred to a baby as “something to call our own.” Didn’t need to read further to know you’re an asshole.", "YTA You took a homeless and vulerable teen in and manipulated her into letting you adopt THEIR child and proceeded to kick her out, completely betraying her. You say you kicked them out because the want to help make decisions about their child when in reality, i'd bet that you would have done that anyways because you never cared about her, just how you could manipulate them into letting you legally steal her child.", "You used your position of power as “volunteers” and made this girl feel comfortable and as if you were her only option. That is biologically HER baby. Of course she was going to have difficulty with giving her baby away. But for you to kick her out after she gave you what you wanted is absolute EVIL. You don’t deserve that baby. I am infertile and I cannot even fathom this.\n\nYTA", "You’re worse than a AH you’re a predator and I hope you know the adoption can be over turned you lied.", "you horrible, horrible excuse of a human being. shame on you.", "YTA. You told her she would be in his life, then decide not to.", "YTA by a country-fucking-mile. The definition of predatory and immoral. People like you give fostering a bad rap. Did you do anything wrong legally? No. Did you do anything wrong morally? If you have to ask strangers on the internet you have no right being parents at all.", "Agree with the gist of the comments here. You're a sick fuck OP and 100% YTA.", "I’m shocked at the verdicts here. Glad that they are the way they are though. \n\nYTA.", "YTA. Big asshole and this is why people like you are meant to be kept away from volunteer roles with vulnerable women and children.", "YTA you people are straight evil. You coerced that poor woman into giving you her child I feel so badly for her.", "What the fuck ???? YTA YTA YTA", "YTA. You stole that woman’s baby.", "YTA and, as others have pointed out, a shitty, shitty human being.\n\nI have no doubt this was your asshole plan all along.\n\nThanks for making the world a worse place.", "WOW… as an adoptive parent of two.. what I read was so freaking wrong on so many levels. \nI bet you are the type of person that wants a puppy till it pee’s on your floor and you take it back to the pound.", "This is why adoption fucking sucks most of the time. “Something to call mine” is a really gross way to refer to a human. And the way you treated her was disgusting. ugh", "Agreed, this is just plain predatory behavior that should be illegal.\n\nEdit: YTA", "As an adoptee YTA the way you treated this poor girl is disgusting! I truly hope once your son grows up to legal age he can search for his birth mother and find out the truth of what you did… by the way closed adoptions fuck the child up I’d know because it happened to me. Shame on you", "I hope she can get the adoption reversed. OP deserves to have that child ripped from her arms and have them barren the rest of her life. No one who would manipulatively take another persons’s baby in this way should ever be a parent.", "Exactly!\n\nWhat OP did is straight up evil! \n\nMy heart goes out to that poor, poor girl. It makes me so sad to think about what she must be going through. Homeless, got her baby stolen, postpartum, betrayed. Absolutely breathtaking.", "Agree with this whole heartedly, but please add a YTA judgement to your comment or else the algorithm won't be able to read it as a judgement!", "I agree with this wholeheartedly!  If OP had really wanted to make this girl a sister to the baby, she would have done an adult adoption so the girl would also be their daughter.    They just wanted a baby.\n\nEdit to add: I don't know where you are from, but I hope the time limit to reverse the adoption hasn't run out, and this girl does just that!", "The way they talk about the experience wholly centres themselves, not the kid, not his birth mother. They wanted “something” they could call their own?? He’s not something, he’s not yours. He’s a person, a person that you stole from his mother. Can you imagine what he will do when he becomes an adult and learns that you did this??", "I have no idea how OP cannot see how predatory this was. They want a child so bad, they start volunteering with foster children…but instead of bonding with and adopting a foster child they take in a pregnant one and convince her to give them their baby…make it make sense. \n\nYTA OP. If there is still time, and love in your heart, you can reopen the adoption and stay true to your word. You said she vented about not having the financial means to care for the child, not that she didn’t want it. You told her even though the child is legally yours, she’d still get to be part of his life. This girl had to grow up way too quickly and made a decision thinking that you and your spouse cared about her and were for her best interests. There may still be time to make this right!", "This woman sounds like the villain in a VC Andrews novel.", "Don't worry. Their child will go searching for the birth mother one day and find out what they did to her.", "Yes this. If I were the birth mother, I would lawyer up and try to terminate your rights to the child, considering how you absolutely defrauded her out of her own pregnancy. YTA, I wish you exactly what you deserve", "Totally agree! How can someone talk about a mother being 'very clingy' with her two week old baby as if it was somehow a problem. If OP had any empathy she would be looking into supporting this young woman as a mother and taking on a grandmotherly role with the baby, not stealing a baby from a vulnerable teenager.", "YTD (you're the demon) we need a level higher than asshole for people like OP", "Agree 100%", "Perfectly said .", "Not going to lie, my stomach dropped when I read \"you're not an asshole\" because I was terrified the top comment was going in a *very* different direction...\n\nI hope that poor girl is able to find excellent legal representation once she gets her life together (though I'd prefer she did it now and found a family to adopt the child through proper channels). I don't believe for a second that OP and her husband didn't invite her into her lives solely in hopes of manipulating her into giving them her child.", "This couldn’t be any more right. Like wtf did OP just write. I just can’t. \n\nWhat’s the story she will tell her adopted son, I wonder?", "Not often that you see such so many of us in agreement here on this forum. OP, seconding that you are the absolute worst.", "But you don’t understand, she was there for the birth and the bond is unexplainable", "I hope the poor girl can find her way to a lawyer. Otherwise I hope OP realises that sooner or later the truth will out. This kid will find his bio family one day and learn what his adoptive parents did. Hopefully karma finds them one way or another. The biggest YTA imaginable.", "Absolutely - and closed adoption or not, you have stolen a vulnerable woman’s child and one day the child will find out what you did and they will NEVER forgive you. Nor should they. I know the intense pain of infertility, but nothing justifies what you have done.", "Jesus f-ing Christ. This is next level delusional, evil, soul/life destroying, stuff. I am appalled and horrified for that young woman. \n\nClingy?!?!? She GAVE BIRTH two weeks ago!", "Couldn’t agree with this statement more. OP is a horrible human and one day the child she stole is going to find out. I hope they cut OP off entirely and that life shows OP the same horrors she showed the young mother she preyed on like a vulture.", "ACCURATE!!\nWow! Promised an open adoption and then kicked her out and made it a closed adoption and told her to go away. That is beyond cruel!!\n\nYTA.", "Completely agree! Is there an Am I the Evil One (AIEO) sub is there? If so this absolutely belongs there.   \n\n\nIn the meantime I'm going to contact Disney. I'm going to pitch them this new villain.", "I would normally never say this, but I think it is a good thing that OP and her husband are not able to have children. They definitely do not deserve to have any.\n\nUnfortunately, they were able to manipulate a vulnerable young person in a very vile way.\n\nThey are despicable people and I hope they step on Lego, at least five times a day, for the rest of their lives.", "This. A child is a human being, not a human right. It’s very sad that some people who deserve children (generally speaking) will never have them, but no one has a right to another person. Buying people is illegal. OP needs to give the child to his mother right now. Where he belongs and where he will always belong as he is a wanted and loved child, by his mother.", "How do you know she didn’t want to give up the baby", "Only certain states have laws that make open adoption agreements enforceable.", "a closed adoption is pretty normal, not to be devils advocate. both parties need to agree.", "This. Omg what OP and her husband did was straight up predatory. They preyed on a young woman in a desperate situation, formed a false bond to gain her trust, promising an open adoption then once they got what they wanted kicked her to the curb. She can act like that's not what happened, that it became necessary because bio mom was attached but she's lieing to herself if she actually believes that.", "And they went there to find and choose a pregnant person! They shopped for her!\n\nAll while pretending they are just good volunteering people.", "OP sought out the most vulnerable children they could find - by \"volunteering\" with foster kids. It's absolutely disgusting.", "She saw that the girl didnt have a support system and decided to pretend to be one so she wouldnt tell OP no.", "He is NOT her baby. Poor kid.", "19 years old is an adult not a child", "Absolute predators. This is so messed up.", "Groomed. It would be entirely accurate to say they groomed her.", "This is it.     \n     \nThis isn't about kicking this girl out, it's about trolling the underbelly of society in the guise of helping those in need, only to find, befriend, and move in, a pregnant girl who has no where to go.  Then manipulated her with their tales of infertility, got her to sign over her rights, told her she could be a sister figure to her own daughter, and then in only two weeks, after the poor girl has acted only exactly as one would expect and she was told to, gets told it's time to leave?      \n     \nBe gone, back to the street with you!    \n    \nYTA YTA YTA", "Seriously, this lady sounds like an episode of Law and Order SVU.", "Thank You /u/Lazy-General332 for the award <3.", "My guess is that she was taken in under false pretenses, then felt obligated to give up her kid bc she didnt want to go back to the streets", "This person is definitely TA, but actually open adoptions aren't generally legally enforceable (minus perhaps some special contact arrangements coming from foster care, certainly not in bog standard infant adoption - not saying it couldn't happen, but I've never seen a legally binding open adoption agreement in private (ie not foster care) adoption) and the adopters can close them whenever they wish no matter what promises they may or may not have made.\n\n(This is one of the many reasons why there needs to be much better protections for parents who are considering relinquishing their child for adoption.)\n\n[https://adoption.org/open-adoption-agreements-legally-enforceable](https://adoption.org/open-adoption-agreements-legally-enforceable)", "And sealed that woman to a life of mental health issues, unless by miracle she is able to trust a good person one day and finds help…", ">Can you even close the adoption just because? Does she not have any rights?\n\nUnfortunately open adoption is not even a real thing legally most places and so she probably doesn't in terms of the open adoption. She may be able to get a lawyer and regain custody though since a lot of places have a one year buffer.", ">you helped at foster homes for this exact reason to scout out a potential surrogate mother without actually paying her to be a surrogate\n\nThis right here. This was intentional and predatory and we need better laws to protect these vulnerable moms from people like OP.", "This is sadly super common. They specifically go with the intention of cultivating relationships and feeling like trusted people so they can make young girls, who likely don't know what resources they have available to them to help support them through having a child, give up their children for them.", "Con artist, 100%!!!", "Replying to myself because not only did you steal her baby, you stole the entire family you promised her.  What an awful human you are.", "Yesssssss", ">threw her into the street.\n\nYeah, I mean the betrayal and closing the adoption is really really bad, but I'm not seeing much here about helping her get a stable life together which is kinda worse. Like she clearly needs to psychologically heal and come to terms with things, and now she's homeless?\n\nAnd these AHs work with homeless teens - they know exactly how dangerous and traumatizing it is because they've literally seen it.", "Lik 95% of people in prison have done less evil things than this woman. Ugh, i think satan is ashamed of her behavior.", "This would never be legal in my country. Thank Good. How unethical. \n\nOP: YTA. How dare you. You should have known better.", "I'd contribute to her GoFundMe for legal fees", "Not if the adoption is finalized.", "Seriously, this sounds like the Handmaid’s Tale method.", "I hope she DOES sue.", ">the only difference is you didn't arrange the pregnancy.\n\nI'd argue that that makes it worse tbh. Surrogacy is Surrogacy, the women who do it - depending on country laws - know exactly what the deal is - \"here's a cup of my husbands cum and a turkey baster, here's a profitable payment/a pregnancy stipend (in the UK Surrogacy for profit is unlawful, the parents you're being a surrogate for can provide a market rate stipend to fund maternity clothing, extra food, and a few luxuries for you - spa days and the like, but you can't have Surrogacy effectively stand in as financially on par with a proper job), in 9 months you give birth, hand over kid+sign here, thank you\"\n\nWhat OP did is groomed and manipulated a vulnerable young woman with 0 advocacy or knowledge into becoming a surrogate for her. I don't know US laws but at midway through in England you have a lot of options and routes, and there's a whole lot of legal checks and balances in terms of adoption to make sure shit like this doesn't happen", "This. I would donate to a crowdfunding for the birth mothers lawyer. I hope she sees this.", "Trafficking. This is human trafficking. Lying to a vulnerable, homeless, pregnant teenager in order to obtain her baby for themselves is a version of trafficking in human babies. \n\nA good lawyer could make a STRONG case for both teenaged mother and baby being trafficked (the former for the contents of her womb, the latter as part of a coercive \"adoption\" wherein the birth mother was unable to give informed consent because she was ignorant of the adoptive parents machinations - trolling foster programs for victims; pushing her out of the house after promising her a home and family as part of the adoption; etc.).", "Definitely. They knew what they were doing. And that’s exactly why they decided to house her and help with the pregnancy. It’s totally predatory", "Spot on! This post was so gross, thank you for saying what I was too horrified to muddle out. OP has no business being a parent if she treats people  (especially her son) like this.", "I feel sad for kids who are going to languish in foster care and be bounced back and forth to their unfit bio parents until they age out with no support system because assholes are trying to convince people that adoption is bad.", "The birth mother voluntarily gave up her parental rights. That cannot be taken back. Plus 'closing' the adoption could simply mean restricting her visitation. Which isn't illegal, it's just frowned upon.\n\n\nI hope this is a troll post because otherwise it means a cunning evil has won. Op (and her husband) is/are asshole(s). No question. They've pulled off the ultimate con, got 'their' baby, and did it legally. As I have my doubts on what Op meant, and what people are choosing to believe.", "It depends on the state sadly. In the US open adoptions are not legally enforceable from the side of the birth mother most of the time and often they are denied when they try to get their children back. The US adoption industry is extremely extremely predatory and coercive. There’s a reason it was mentioned in the roe decision. They pay for lobbyists to make sure mothers have almost no rights. If I were the mother though I would be dragging OP to court until the child was 18 to make sure he knew that he was stolen from someone who loved and wanted him.", "As soon as termination is signed, only the foster agency or adoption agency can take the child back and they don't return the child to the birth parent. After it's final-like this couple did- there's nothing anyone can do. While perfectly legal it's a really crap thing to do.", "No. This is NOT how open adoption is supposed to work. OP: YTA.\n\n- Reputable open adoption agencies make sure the birth mother’s wishes are taken into account and the contracts, at least in states like Oregon, contain language describing the legally enforceable minimum contact of the birth mother with the child (how many phone calls, letters, visits, photos, etc). OP gave this birth mother NONE of this. \n- while adoptive parents do provide compensation for “reasonable” birth expenses, these are supposed to be kept LOW so the birth mother doesn’t feel coerced to give up the baby. This birth mother was literally living with the adoptive parents! She depended on them for housing, food, clothing, everything! That’s a very bad idea because it sets up a dynamic where she “owes” them the baby!\n\nOP, not only are YTA, you’re also literal ghouls preying on down-on-their-luck mothers. Literally monsters. You joined this program with full intent of stealing a baby from a young, indigent woman. Not only are you assholes,  but if hell exists you’re going there. The ONLY way you’re not going to fuck up your baby and your karma forever is if you hire this woman her own lawyer and re-negotiate the terms of the adoption to give her access to her own child, or even reverse the adoption if she so chooses.\n\nBut you won’t because you are evil people.", "I feel like OP did not have a solid understanding of what the process of coming to terms with this arrangement could look like for birth mom.  I have a hard time going all the way to Y T A for something that I don't think either party could anticipate fully, but to be a supportive presence in birth mom's life prior to the adoption, then take the support from her, when she probably still very much needed it comes pretty close.  I don't get the sense anyone suggested getting outside help to work through the very complex and emotionally-loaded situation, nor do I see an indication that OP would be open to rebuilding a relationship in the future when all parties can come to a consensus regarding boundaries and roles.", "She agreed to the adoption because she was told she could still be in the babys life and have a connection with her child. We dont know if she would have ever agreed to it if the terms had been different. Op also took away the opportunity for the birth mom to find a couple to adopt her baby who would actually agree to an open adoption. this was manipulation", "No it won’t. Please research the adoption industry. This is a horrible thing to say. Stop telling people they aren’t fit to raise their own children. She wants her kid, it’s hers.", "I bet two people who are so cold and manipulative to take advantage of a 19 yo pregnant and homeless girl to pursue their own agenda are going to be amazing parents …", "there really aren't - she's 19, homeless and was lured with lies by OP. \n\nOP is behaving awfully and does not in any way have their child's interests in mind here", "These people took her into their home initially under the pretense that they wanted HER their. For herself. Nothing to do with her being pregnant. That they just wanted to welcome this teenaged girl into their home to help her get back on her feet.\n\nAnd even when she discussed her pregnancy with them, they reassured her that they STILL wanted her to BE A PART OF THEIR FAMILY, as a \"big sister\" (i.e. a foster/surrogate child to them) to her bio child. That they would adopt her baby and everyone would be one big happy family. \n\nWhy would she have sought out a program for single mothers when she thought she had been basically welcomed into a new family? That they wanted her to stay with them even after the adoption? She was a teenager who thought she'd found a loving home for herself, apart from the adoption.", "You are disgusting.", "It really is and i hope that she and her partner will take a look and realize how this could be harmful for the child in the future", "Also, the way she talked about having a child, she said she wanted some*thing* to call her own. Not \"i wanted a child\" or \"i wanted to be a mother\"", "I’m a closed adoption, so is my cousin. We are not fucked up. Every adoptees story and feelings are different.", "The fact that OP waited till she was in their home and being taken care of to propose the adoption. OP knew she wouldnt be able to say no", "2 weeks postpartum and now homeless. OP is straight up evil. Poor Aiden having parents like that.", "Calling OP the AH is too kind tho, we need a different flair for this kind of evil, manipulative behaviour.", "That's true, but if that happens, the bot will pass it on to a mod to sort out. It's obviously not ideal because it gives the mods more work, but it won't result in a lack of verdict.", "Poor thing probably has zero resources to reverse the adoption. And no where safe to take the baby.\n\nI can’t believe they stole him from her. I can’t believe that they didn’t understand the bond that a mother would feel with her child. I can’t believe how much they probably “claim” to love their son, and yet chose to close the adoption and needlessly separate him from his biological mother causing him lifelong trauma.\n\nEdit: just wanted to point out that the woman is now homeless (and babyless) at TWO WEEKS postpartum. I really, really hope this is a troll post. This is so awful I don’t want to believe it’s true.", ">If OP had really wanted to make this girl a sister to the baby, she would have done an adult adoption so the girl would also be their daughter. They just wanted a baby.\n\nYup", "The \"something\" part jumped out at me too.", "I assume by the time Aiden is in 6th grade, they'll be doing 23 and me and mapping their DNA in health class. This will definitely come back around for OP.", "Clingy, you know, like how mammals are instinctually designed to reach for one another postpartum to ensure survival of the species. \n\nThis whole post is so so gross.", "Because someone set on giving up the baby wouldn't jump at the chance of living in the same household as 'siblings' and would probably have suggested adoption from the get go. \n\nThey found a pregnant teen via their work with vulnerable kids and presented her with an ideal option - stay in your child's life _as family_ , and we'll provide everything you both need. \n\nEven OP admits that the bio-mum said she was out of options and didn't feel she could provide for the baby, not that she didn't want to be a mother.", "I didn’t know that - thank you for (nicely) telling me! I still feel terrible for the birth mom.", "Or some states don't allow open adoption, so it could of been just what they said", "it may be normal but it's not a good option unless there are good reasons (but there are none here)\n\nIt's often considered to be unethical and harmful to the baby", "Thank you for telling me that. I just assumed a contract was a contract. I still think OP is TA, though!", "Also they said she could be a sister figure, which would have to mean they would continue to be parent-figures to her.", "How dare the lady that carried this baby for 9 months be attached to it!", "It wouldn't have mattered if she was 16,19, 25, 32 or any age! She was a vulnerable Human in a desperate situation and was offered what likely sounded like an ideal solution! Her baby would be cared for by a well off family and she would still get to be in his life and help raise him. \n\nThen after 2 weeks (in which they do not mention anything significant happening beyond her being clingy with her newborn child) they kicked her out and cut off all contact. She could probably sue for fraud; but i doubt she has the means to do so. Rich people win again it seems!", "barely - esp one so vulnerable", "19 years old and grew up in foster care.  Was more than likely abused at least mentally if not physically and sexually too.  I'd wager that her brains not as devolved as 19 year old from good homes.", "19 years old is the *legal age of majority* in SOME places, for SOME purposes. That is NOT the same thing as being an adult by objective developmental standards. \n\n19-year-olds are NOT adults. They are adolescents. They may be legally *treated as adults*  by the government and/or court systems of certain countries for very specific and narrowly-defined purposes (e.g. serving in the military, smoking, voting, driving), but that doesn't actually make them adults. There are places where a 14-year-old with intellectual disability can be tried as an adult in a court of law. Doesn't make them an actual adult. The very fact this line varies from state to state, country to country, is evidence in and of itself that it is not an objective measurement of \"adulthood\". And in most cases the determination of \"legal age of majority\" is not made by developmental psychologists or other specialists but by lawyers (I know, because my dad was a government policy wonk in my country), for purposes that have nothing to do with whether teenagers that age are actual grownups. \n\nIf you believe that being the legal age of majority actually makes a teenager an \"adult\", then you don't understand how laws are created, or how those lines are drawn (and often changed over time for political expediency). It has nothing to do with being an adult.", "No, it's not. A 19 year old who was in the foster system and has no support in her life is a child.", "I can only imagine what Finn would have to say to her.", "I haven't been this upset by a post on here in quite some time. I cannot believe this sorry-bleep excuse of a human being had the gall to write this post. \n\nThere truly is a special place down below for assholes like this.", "Came here to say exactly this. I have a daughter in a beautiful functional open adoption and I'm very grateful they honored the open adoption and consider her mom a friend.", "I hope she explored whatever resources she has cause this is disgusting.", "I agree, I didnt expect them to let her live with them full time or something like that. But they should've got her help to make a life for herself, she just had a baby, could have post partum depression, but they were only thinking of themselves.\n\nThey used and abused the mother and then when she was no longer useful and they got what they wanted, they tossed her out with 'Never contact us again, thanks for the baby by the way, now live your life on the streets'", "I dunno. I bet a good lawyer could make the case that the contract was signed under duress.", "Most private adoption contracts have a 30 day clause where a birth parent can call off the adoption. Nonetheless, it appears OP coerced and manipulated this young woman. A decent attorney can get this adoption overturned.", "most places have a good down period where the birth mother can change her mind *after* the adoption is finalised", "Or an episode of Law and Order SVU.", "Came here to say this.\n\nWtf is wrong with this woman?  She is evil, cruel and selfish. Oh? And YTA\n\nI.hope that poor girl gets her baby back and they are prosecuted for baby snatching.", "Surrogacy is human trafficking. It's poor women being used and abused by rich women/men. It's never the other way around. It's human trafficking times two - the baby is bought and sold and the mother's womb and body is bought and sold. Childbirth is still very risky and one of the biggest risks to life women have.\n\nHaving children is not a human right. Babies are taken away from their mothers when they need them. It's a disgrace. Surrogacy doesn't center the child, it centers adults. That is the complete opposite of safeguarding and acceptable parenting.\n\n[https://thecritic.co.uk/end-womb-trafficking/](https://thecritic.co.uk/end-womb-trafficking/)", "Same. If she does, or if anyone else reading is in her situation, there are resources and help for you! There are legal groups that fight adoption specifically, you need only look and most of them work pro bono. Get your baby back.", "Absolutely, I could not have said it better myself. Spot on.", "Can this post be forwarded to some kind of government agency? Who even handles human trafficking?", "U/FBI get on it", "The people causing the problems arent adopting foster children. They are traffiicking babies.", "Are you calling me an asshole? I never said adoption was bad, but people like this shouldn’t adopt. So many young vulnerable women are preyed upon and used. So many adoptees are sharing their stories of the trauma they feel and are dealing with due to being adopted. There are ethical ways to adopt and this ain’t it. \n\nWhy am I an asshole?", "There are cases where adoption is perfectly fine, but don't pretend it doesn't come with issues. Trafficking and taking advantage of desperate women are 2 big issues. Foster kids in particular need better resources to protect them and help them transition into adulthood to prevent this sort of manipulation. We should be working to improve the foster care system in general", "Proud adoptee, aka  an \"asshole trying to convince people adoption is bad\". Why doesn't infant adoption exist in countries with functioning healthcare and social welfare nets? Is it...because infant adoption relies on coercion and poverty?", "Same", "A birth parent can request the adoption being undone up to a year.", "reareading the post and other comments, I think you may be right. I'll edit my post in a bit", "Yes, he will. Being raised in a stable household is better than growing up with an impoverished single mother. Stop telling people that they should raise kids they obviously aren’t fit to raise.", "Sorry, but you don’t control my comments. I’m allowed to say whatever I want to say, as long as it doesn’t violate any rules. I stand my opinion that she is an unfit mother. She’s homeless, a teenager and there’s no father in the picture. She cannot even care for herself, much less another human being. And what’s to say she won’t find herself pregnant again a year from now?  She obviously has too much on her plate already.", "Being homeless with a penniless 19 year old mother wouldn’t be in the child’s best interests.", "Couldn’t agree more", "Yeah that was bothersome", "I’m a closed adoption and I’m fucked 🫡", "Good for you, I’m only referring to my personal experience", "I agree. It all sounds manipulative AF. OP did not do this for Aiden’s best interests. It’s often beneficial for adoptive children to be able to know their birth parents. They get the story from the horse’s mouth and the reassurance they weren’t simply abandoned for the heck of it. OP did this for herself. Selfish is an understatement.", "Oh Lord. Only 2 weeks? I missed that.   \n\n\nIsn't there some kind of grace period meaning that the girl could get her baby back?", "and the baby!", "not arguing that. check my other reply for why I think this was a closed adoption made with ill intent.", "Right, then they would have enforced the bond between the “siblings”. Obviously the age difference and carrying the baby will make the birth mother more attached, but they could have handled this completely differently and reframed things into one family unit like they said they were going to.", "Exactly. And most parents would be THRILLED that their teen daughter was in love with her newborn sibling.", "Right?!? I was expecting the girl to have done something horrible and nearly unforgivable.\n\nThis is just sick and disgusting.", "Bonding with the baby was also what she was promised by OP. She wasnt crossing any boundaries", "Yes! She was ‘clingy’, uh, yeah, she was piped full of hormones because she had just given birth. They didn’t give two shits about that poor girl.", "Some states will overturn adoptions.", "You haven't said anything wrong.", "As a birth parent myself I can tell you that where I live this is 10000% false and after signing termination there is NO grace period. No grace period is more common than a grace period to change our mind.", "It's not a stable household when the parents are fucking mental enough to steal a child.", "She is fit to raise her child if she so chooses, it is her child. Stop pretending poverty makes someone an unfit parent, it’s classist and out of line. Further, adopted children have higher rates of serious mental health issues and many face a lifelong struggle to come to grips with the trauma they experienced as infants. Do your research.", "Plenty of children are raised by single parents everyday. Why do you assume she’ll be pregnant in a year? This comment is so full of classist judgments about a woman you know nothing about. She has a right to her child, full stop, it doesn’t matter what you think she’s capable of or not. It’s her kid. She’s unfit because she’s poor and young and OP swooped in to save the day by preying on a vulnerable young girl? Did you know that adopted children face serious mental health struggles at over twice the rate of the general population, or that separating an infant from its mother causes permanent trauma? You can’t even legally separate a puppy from its mother for six weeks but it’s fine for a human baby? Should all poor people have their children removed? The implications here that you’re saying are pretty, well, yuck tbh.", "Yes but their manipulation tactics made sure that them adopting the baby was the only option she was able to consider. \n\nShe could have gone to an agency and chosen another couple to adopt her son who would have actually allowed for an open adoption, or she might have been able to reconnect with a family member who would have cared for him. \n\nOP love bombed her into thinking she was family and then kicked her out once they got what they wanted.", "You know there are options other than that right?", "I bet two people who are so cold and manipulative to take advantage of a 19 yo pregnant and homeless girl to pursue their own agenda are going to be amazing parents …", "You generalized, you didn’t refer to just your experience.", "So don't speak in generalizations. Lots of closed adoptions have perfectly fine adoptees. My partner beinf one", "They could even have accepted her as a daughter figure and her baby as their grandkid. But they were more concerned with having 'their baby' than being involved in a baby's life in a way that was kindest and healthiest for the kid and his bio mum.", "And also lets be clear that her being \"clingy\" is code for *we were scared shitless she would change her mind, so we had to get rid of her.* \n\nThe mental gymnastics OP's conscience went through to write this post are Keri Struggish. \n\nSomeday, this kid will learn the truth about how she was brought into the world and OP and their spouse are going to have a shitstorm to contend with.", "Thank you. I am genuinely perplexed by this persons response and, what I feel, is unwarranted hostility.", "That sucks", "Actually, she doesn’t have a right to her child if she can’t take care of it.  This is not about single parents. This is about a homeless pregnant teenager with no father in the picture at birth.  \n\nShe has no stable living situation, no stable income and no stable emotional life.  It’s a terrible environment in which to raise a child.\n\nthere are plenty of stable, single parents out there.", "I actually didn’t. You’ll be blocked I’m not going to deal with your negativity, Nice try though", "It does. Especially with it being irrevocable in some places where you can sign in the hospital with a notary while still medicated post birth. That shit should be illegal.", "She does have a right to her child. Plenty of people have kids in tough situations, we don’t send the state in to confiscate every child born to someone couch surfing or unemployed. Children also grow up without fathers all the time unfortunately, we also don’t take all of them away. You know what’s a terrible situation for a child? When their fake mother has to tell them that they exploited their mother and stole him. That does some damage. \n\nIf she wants her child, there are programs and people that can help her to do that. She’s not abusive, she’s not on drugs, she’s just young and having a hard time, as many successful mothers do. Nothing here makes her unfit to parent. OP exploited a teenager and somehow she’s the more fit parent because she has money and a husband? You need to examine that worldview. It’s honestly horrifying and scary.", ">by the way closed adoptions fuck the child up\n\nYou quite literally did. If you'd said like, \"by the way closed adoptions ***can*** fuck the child up,\" it would have a different meaning, but you did make a sweeping generalization.", "Stop.  I’m a closed adoption and you don’t speak for me.", "The state decides who has the right to their child and who doesn’t.  This young woman is certainly a good candidate for a loss of parental rights."]}