{"id": 23498, "submission_id": "15dp5ue", "title": "AITA For telling my friends I will only drive certain ones around from now on?", "selftext": "Long story short I always drove my friends around as I was the oldest with the license and the best driver (drive and build racecars and race bikes) they now have their licenses but most have had it for under 1 year and have minimum of 3 crashes EACH. I had a nice mustang but it was old and cheap only worth about 10k as I was 17.  I just went out and treated myself to a 2017 with low miles that is extremely clean and nice and told them I won't drive them around with the exception of my one friend who respects shit as everyone else steps on seats, climbs over the console, gets makeup on shit, scratches the cars outside with rings and random stuff, leaves behind a bunch of trash and crumbs and stains from food and overall trashes and damages my stuff. Apparently I'm an asshole  and a piece of shit for not driving them around anymore because they don't respect my stuff and treat everything like shit. So I ask, am I the asshole here for telling them enough is enough and I won't let them trash my new car?", "created_utc": 1690733005, "permalink": "/r/AmItheAsshole/comments/15dp5ue/aita_for_telling_my_friends_i_will_only_drive/", "score": 28, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my friends I would only drive SOME of them around as most don't respect my property and trash my car and cause damage but others don't so I would drive them around but not the ones trashing it so now they think I'm an asshole and choosing friends and causing issues purely because I don't want to have to pay to fix the damages they cause or spend hours cleaning up after them\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - your car, your boundaries. Friends who don't respect boundaries aren't real friends.", "Totally NTA. I would be so angry if people treated my nice car that way.", "NTA.  If they don’t respect your stuff, the6 don’t respect you!", "NTA. It’s your choice.", "NTA.\n\nIt is your car. You are perfectly entitled to only drive people you want in your car around; they have no right to be driven anywhere by you. They do not respect your property, so they do not get to enjoy rides in it. That seems to be the simplest approach to me.\n\nIf you have told them before that you are uncomfortable with them climbing over the console, getting it dirty, and not taking their rubbish, then even more not the asshole. They should not need to be told not to do that full stop (the climbing over the console stuff sounds outright dangerous), but if they have been warned, ignored it and continued that behaviour, they get little sympathy for finding out there's consequences.", "NTA\n\nIt's YOUR car.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nLong story short I always drove my friends around as I was the oldest with the license and the best driver (drive and build racecars and race bikes) they now have their licenses but most have had it for under 1 year and have minimum of 3 crashes EACH. I had a nice mustang but it was old and cheap only worth about 10k as I was 17.  I just went out and treated myself to a 2017 with low miles that is extremely clean and nice and told them I won't drive them around with the exception of my one friend who respects shit as everyone else steps on seats, climbs over the console, gets makeup on shit, scratches the cars outside with rings and random stuff, leaves behind a bunch of trash and crumbs and stains from food and overall trashes and damages my stuff. Apparently I'm an asshole  and a piece of shit for not driving them around anymore because they don't respect my stuff and treat everything like shit. So I ask, am I the asshole here for telling them enough is enough and I won't let them trash my new car?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - even my children know not to dare put their feet on the chairs is someone’s car. What kind of friends are they? Scratching other cars? Leaves crumbs and rubbish? Makeup smears? They need to grow up and learn some lessons in respect", "I feel like I'm kinda an asshole for picking and choosing who I drive around instead of saying no one. I just can't afford to spend the time cleaning up and fixing it after they do shit to it", "Oh hon. You are so NTA. I have a lovely clean car. I keep it that way. You are completely in the right here. These brats are entitled idiots. If they actually appreciated the rides they would leave your car the way they found it. \n\nInteresting question. Have any of them paid for gas? If they never pay you for gas, AND they leave your car a pigsty, they are totally disrespecting you. Don’t let them use you. Take the people who keep your car clean. Those people are your true friends, because they respect your car rules. Your car rules are the same as mine have usually been, and I am 53. \n\nYour car, your rules. You paid for it, and you continue to pay for gas and insurance. Stand by them like a broken record. “No ride. You leave my car a mess” on repeat.", "No they don't pay me for gas but I don't ask either as it's never been an issue for me"]}