{"id": 23561, "submission_id": "15efzlt", "title": "AITA because I asked her to leave?", "selftext": "I live in a condo where there are several amenities. Some of them (like party rooms and movie rooms) require a reservation but are not locked so it’s common to see people there when no one has it booked.\r  \n\r  \nYesterday was a family members birthday and we booked one of the party rooms. Due to summer this amenities are very busy and we need to book it weeks in advance. We even put a sign on the door saying there was a private event going on (this is common so people that like to hang out on the places when there is no reservation know they should look for some other place).\r  \n\r  \nAt some point a lady enters the room with a few beers, opens the fridge and starts putting her stuff in there. We had the fridge full of food, deserts, beverages, so it was annoying to have someone we don't know just entering and going through our stuff. Then I, as the host, went to talk to her:\r  \n\r  \nExcuse me?\r  \n\r  \nYes?\r  \n\r  \nWhat are you doing?\r  \n\r  \nI am putting beverages in the fridge. 🤡\r  \n\r  \nI can see that but can’t you see we are hosting a private event here?\r  \n\r  \nSo?\r  \n\r  \nSo you can’t just enter here like that.\r  \n\r  \nWhy not?\r  \n\r  \nI just told you we are having a private event. There is even a sign at the entrance.\r  \n\r  \nBut the fridge is public. Everyone can use it.\r  \n\r  \nWhen there is no reservation, maybe, which is not the case right now.\r  \n\r  \nYou are telling me I can’t use the fridge?\r  \n\r  \nRight now no, you can’t. At least not like that.\r  \n\r  \nSo I can’t use the fridge?\r  \n\r  \nAs I just explained to you, when there is a reservation going on like right now, no, you can’t.\r  \n\r  \nYou are REALLY telling me I can’t use the fridge? (here I got tired of her attitude)\r  \n\r  \nYes, I am telling you that you CAN NOT use it. Is it clear now?\r  \n\r  \nThen she got her stuff and left.\r  \n\r  \nAfter a while another lady came over and asked to talk to me.\r  \n\r  \nHey what happened? Why did you kick my friend out?\r  \n\r  \nI just explained to her that there was a private event going on.\r  \n\r  \nAnd what is the problem? Everybody shares the fridge.\r  \n\r  \nThe problem is I we need to book this place in advance, before you can start security comes in and makes an inspection and I also need to leave a CAD 500.00 cheque with property manager as a guarantee for any damage, so I think its fair for me to just want my guests to be using this area during the time I reserved it for. Also, we are having a familly gathering so having people we don't know wandering around the room, and going through our stuff is not something I want to happen.\r  \n\r  \nThen she apologized and left but her attitude showed she thought I was being a petty AH. So AITA?", "created_utc": 1690809479, "permalink": "/r/AmItheAsshole/comments/15efzlt/aita_because_i_asked_her_to_leave/", "score": 1438, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Was I the Asshole for asking someone to leave a party room which I had booked for a private event?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA sounds like your property management needs  to do their job and inform ppl of the availability for use", "NTA\n\nIt was booked for a private event. Should have contacted the property management", "NTA. Sounds like they only care about themselves", "NTA - if you allowed them to stay, you would be liable for any damages they cause.", "NTA. Some people are either totally oblivious or entitled jerks. In some cases, they are both :)\n\nYou reserved & paid for that space. Therefor you had every right to ask that stranger to leave.", "NTA You might want management or security to come look at the place as soon as you are done and record it. The women might be vengeful and try to damage something to make you pay for it.", "I applaud your reserve, because I wouldn't have been anywhere near as patient. \n\nNTA.", "NTA but it seems like these rooms need to be secured or people need explaining by management that if the room is in use they cannot come in etc.   \nThose people are wildly out of order", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI live in a condo where there are several amenities. Some of them (like party rooms and movie rooms) require a reservation but are not locked so it’s common to see people there when no one has it booked.\r  \n\r  \nYesterday was a family members birthday and we booked one of the party rooms. Due to summer this amenities are very busy and we need to book it weeks in advance. We even put a sign on the door saying there was a private event going on (this is common so people that like to hang out on the places when there is no reservation know they should look for some other place).\r  \n\r  \nAt some point a lady enters the room with a few beers, opens the fridge and starts putting her stuff in there. We had the fridge full of food, deserts, beverages, so it was annoying to have someone we don't know just entering and going through our stuff. Then I, as the host, went to talk to her:\r  \n\r  \nExcuse me?\r  \n\r  \nYes?\r  \n\r  \nWhat are you doing?\r  \n\r  \nI am putting beverages in the fridge. 🤡\r  \n\r  \nI can see that but can’t you see we are hosting a private event here?\r  \n\r  \nSo?\r  \n\r  \nSo you can’t just enter here like that.\r  \n\r  \nWhy not?\r  \n\r  \nI just told you we are having a private event. There is even a sign at the entrance.\r  \n\r  \nBut the fridge is public. Everyone can use it.\r  \n\r  \nWhen there is no reservation, maybe, which is not the case right now.\r  \n\r  \nYou are telling me I can’t use the fridge?\r  \n\r  \nRight now no, you can’t. At least not like that.\r  \n\r  \nSo I can’t use the fridge?\r  \n\r  \nAs I just explained to you, when there is a reservation going on like right now, no, you can’t.\r  \n\r  \nYou are REALLY telling me I can’t use the fridge? (here I got tired of her attitude)\r  \n\r  \nYes, I am telling you that you CAN NOT use it. Is it clear now?\r  \n\r  \nThen she got her stuff and left.\r  \n\r  \nAfter a while another lady came over and asked to talk to me.\r  \n\r  \nHey what happened? Why did you kick my friend out?\r  \n\r  \nI just explained to her that there was a private event going on.\r  \n\r  \nAnd what is the problem? Everybody shares the fridge.\r  \n\r  \nThe problem is I we need to book this place in advance, before you can start security comes in and makes an inspection and I also need to leave a CAD 500.00 cheque with property manager as a guarantee for any damage, so I think its fair for me to just want my guests to be using this area during the time I reserved it for. Also, we are having a familly gathering so having people we don't know wandering around the room, and going through our stuff is not something I want to happen.\r  \n\r  \nThen she apologized and left but her attitude showed she thought I was being a petty AH. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Agreed. 100%. For the safety of the own building I would say. Lets say something gets broken and they want to charge me... I would say \"the place is open, who said they didnt break it after I left?\"", "NTA. Also, she’s an idiot because there’s a decent chance your guests would have gotten mixed up about which items were party supplies, and her beer would have been drunk by accident.", "Why would she even want to put her beers in the fridge while a stranger was having a party? Wouldn’t people assume they were for the party and drink them? NTA.", "NTA. I would've probably eventually just said \"fine, you can put your stuff in here, but while the fridge is in use for my event, all contents of the fridge are fair game for my guests. I'm not segregating or policing who grabs what.\"", "NTA but would love to see an update in petty revenge when you show up to her private function just to use the fridge 😝", "NTA\n\nYou booked the room. The entire room (*including* the fridge) was yours during your event.", "NTA", "\"We have guest who are just going in and out if the fridge. Don't be surprised if your beer disappears\" NTA", ">We even put a sign on the door saying there was a private event going on\n\nI don’t know if property management can fix illiteracy.", "I might have told her \"Thanks, we are going to enjoy that beer\".", "\"So you're saying I can't store my beer in the fridge?\"", "That's exactly what would have happened, and then she would have been pissed and complaining.\n\nSome people are just dense, OP.\n\nNTA", "Record before you leave the room op to have proof you and your guests didn't do anything", "You handled it beautifully and who cares if they didn’t like it?  Sounds like a property management issue.  NTA", "You reserved the room.\n\nYou put down a damage deposit.\n\nYou were in the right.\n\nMy guess in that the woman is a new tenant or has never had an issue becasue they never dealt with a reservation in the common area in the past.\n\nNTA", "NTA", "NTA, the two ladies are being rude.", "NTA - I would have contacted management the moment the 1st woman left .", "NTA  What the enitre hell?????  How can't just walk into a used room with beer and use the fridge WHILE THERE IS A FUNCTION GOING ON. And then to catch an attitude and send your friend in with an attitude is doubly crazy. They must be on something. I bet no one else in the building does that or let her do that to them.", "NTA.  Better patience than me for damn sure.", "NTA.", "op=NTA\n\nI've done this(leaving deposit etc) so I get where you are coming from.\n\nIf you were renting a hotel venue, people staying in the hotel don't get to just randomly come in and use the hotel banquet all--similar situation.\n\nSo no, her blinking beers could be kept somewhere else(or shifted to that fridge AFTER reservation was over).  \n\nThough you could have thanked her for the donation and drank her d\\*mn beer AFTER She took up space YOU needed in Fridge.", "NTA.  Honestly it would have been fun it you'd said \"How'd you know it was XX's birthday? Thanks for donating beers to our party\".", "NTA.  I live in a condo and we have a club room which can be reserved (with payment) for private events by residents.  The only public access is to the bathrooms in the clubroom for those using the pool or gym that are both adjacent to the clubroom, otherwise the room is off limits.", "NTA", "Well this morning I sent an e-mail to them explaining what happened and asking them to figure something out because with summer and having just 2 party rooms I am 100% sure this wont be the last time a situation like this will come up.", "Property management ain't taking calls on weekends.  \n\nAnd this does not count as a Maintenance \"emergency\".", "In the end it seemed to them that I was making a fuss over nothing, they had a look like \"ok have the fridge all for yourself then you asshole\" haha", "My guess is the second option (never dealt with a reservation), but when someone explains that to you, you acknowledge that and leave (that is what I would do), you don't try to fight over it. Haha", "I guess they are the kind of person that never book it, just are inconvenient to the ones playing by the book xD", "Not illiteracy just dump people. I worked at a gas station and our bathrooms were out of order, so we built a wall of styrofoam coolers and a large a frame sign blocking em off people constantly just picked the coolers and sign out of the way to use non flushable toilets. It is just entitlement", "Yeah, don’t give it another thought. 🍸", "Sounds like she doesn't understand the concept of a reserved room", "I dunno man- seemed like she came in to stock the  fridge with beer for the party and you stopped her! She was just trying to be neighbourly and make sure you didn’t run out…\n\nSerious- NTA, imagine your guests obviously drinking her beer from you know the party fridge!", "GET THE FUCK OUTTA HERE!", "NTA.\n\nWe had a similar situation a couple years ago on Christmas - we booked out the \"party room\" in the apartment and held Christmas breakfast/gifts in there. Sure enough, a little group of ladies came in for their morning cribbage games, ignoring all the signs stating the room was reserved and occupied. We tried to be nice and tell them that we'd be leaving in about an hour or so, but they weren't having it and kept playing the \"well what do you want us to do?\" card as we were being very clear in telling them we'd like them to leave **as we had reserved the room first.**\n\nThese K-dawgs called the property manager on us, who also told them the room was booked, and they kept asking the PM \"Well what are we supposed to do then? Where do you expect us to go play our cribbage game now?\"\n\nBottom line is if a room that's normally a shared space now indicates it's reserved for something, it's an asshole move to disregard that and think it's fine to just intrude on someone else's event.", "NTA. This is ridiculous.You reserved it for a private event. WTF.", "NTA. You paid to have exclusive use of the space. You should expect to have exclusive use of the space.", "NTA. You should have let her leave it and then drank it all.", "NTA.  Sounds like you explained the situation very clearly.", "INFO: So she can't use the fridge?", "NTA!", "But why male models?", "This is a failure on the property manager and their lack of passing on to the residents the information about a reservation.  You are NTAH.", "Nta", "Does the friend even live in the condos or was she just visiting? 'Cause that would be even more annoying. Also, why can't she keep the beer in her fridge if she lives in the condos or in the second person's fridge?", "Given all the AITA threads I've read I don't think I'd dare risk leaving alcohol in a \"public\" fridge, lol. \n\nOP is definitely NTA handling this lady regardless.", "... and then they need to lock them when they're not reserved. Who knows what people are using them for out of hours?", "This is exactly the kind of entitlement that annoys me \"*Well what are we supposed to do then? Where do you expect us to go play our cribbage game now*\" like, I dont fucking care, this is not your problem. Also, a place to play a game is not like an emergency or whatever.", "Are you 100% telling me I can’t use the fridge?", "Most property managers have a bunch of stock emails and signs going over rules and infractions that we send out periodically. The amazing thing is how people really don't pay attention until it is about them.", "If OP hadn't seen her put the beers in the fridge and they had an open fridge policy for their guests, I bet those beers would have been enjoyed by someone other than entitled lady.", "Right? The pure entitlement of it - like yes, Agnes, I understand you use this room every Saturday morning, but today the room is booked so you can't. What are you supposed to do? Clean your apartment and get ready to invite guests in, don't care, not my problem, go talk to the property manager and stop ruining my Christmas morning.", "“Sure you can. Thanks for donating to our party.”", "I don't understand people that just... repeat it but simpler. What's the point? Try to make yourself the victim by pretending to be dumb as rocks?", "Illiteracy does also mean lacking comprehension, particularly in regards to the written word.", "We had a problem here a couple weeks ago because people were going Wilde into the pool. Until one day someone broke a glass bottle at the pool and it had to be closed. After that PM sent a very harsh message saying exactly what you said (“there are several messages, signs, whatever”) and now they said they will take things to the next level (putting security at the pool on weekends, expelling people not behaving properly and seeking legal action). Unfortunately just after that things got better.", "Chef's kiss 🤌🏻", "NTA  \nI live in a similar circumstance with shared but rentable amenities. One of the problems we have, even when the amenities are not rented, is that people use the fridges to store their nastiness. In one circumstance, a resident was storing MOOSE MEAT in the amenity freezer for months on end, and flipped the F out when another resident got tired of it and threw the meat away.\n\nEven had you not rented it, the amenity fridge is not for storing personal items.", "NTA.  Some condo owners suck and EVERYONE knows a reserved room is off limits.  Property manager needs to make it more clear because that definitely shouldn’t have been on you. Her and her friend are complete morons.  She should offer up her own fridge if she was so insistent of inserting herself into the situation.", "NTA", "NTA. There are rules. She wasn’t following them.", "NTA. What else were you supposed to do? Invite her to the event? No.", "NTA. \n\nEtiquette they clearly don't understand. Besides, if she puts her stuff in the fridge, it's likely to be consumed by folks at the existing party!!!", "Dry 8th 9am", "NTA. Why would they think it was OK to keep going in to a private party? SMH", "No she was a guest.", "I feel like this is a general oversight to just let anyone use the room if it isn't booked. If it's booked you have to deposit 500 bucks as insurance but when you don't book it you won't pay for damages?", "As someone who works in retail and sees how little people actually read signs (I’ve seen people look around 5 signs saying ice cream\nDown/closed/feezer broken/closed for cleaning to see what we have)\n I’d suggest adding emojis or pictures to them. Maybe they can understand that.", "Yeah, that's even more rude and messed up. Like, she shouldn't be using the fridge at all.", ">we built a wall of styrofoam coolers and a large a frame sign blocking em off \n\nTo be fair, gas station employees do this just so they don't have to bother cleaning perfectly working toilets also. \n\nOften without actual permission from management, since it's legally required that public businesses have public bathrooms.", "I could also see it the other way around. The lady comes to retrieve her beverages and takes some of the party too including food.", "My family would definitely be diving into that.", "The point is a petty power play - she was trying to claim 'public space' and her right to use it, just to put someone else beneath her for a  few minutes.  She knew exactly what she was doing.", "My favorite response to dumb repeat questions is \"Asked and answered.\"", "Hmmm I’m confused on whether she can use the fridge or not… *Absolutely* puzzling…", "\"I mean you can put it in there, but we're probably gonna drink it if you do!\"", "NTA entitled people don't get it", "NTA\n\nI would have immediately called management to come to the party room. This is their mess with their lax on the rules that you should not be held accountable for people not respecting the rules.", "This. I am really not used to this. For me a paid/rentable place should be locked and accessible only with keys to whoever rented it. Specially if a damage deposit is required. I don’t know if this is the common here in canada (have not been here for long) but it’s really weird for me.", "Exactly. There was this one time we booked another room in the same building and as we were leaving (at the reservation end time) we crossed some guys (like 10 guys or so) and they were saying “hey they freed the room! Let’s go!” and instantly music started. I went straight to the concierge and demanded an “exit inspection” to assure everything was fine as i left. Imagine if I haven’t done that and someone went there and broke something as I left. I would have a big headache because they would discount my cheque, i would never be able to prove it wasn’t me or my guests and the guys that went there without a reservation probably wouldn’t even know about it. It’s crazy.", "Thank you!", "I'd have said, \"Sure! But I can't promise it'll be there when you come back for it!\"", "Glass and pools do not mix. The PM was 1000% right to go off. The glass could hurt people and can destroy the pool lining or filter system. If glass is in the pool it needs to be shut down and cleaned and it will cost money to repair. The PM's job is to keep the association budget on track. Depending on the size of the association and the budget, every pool closing can ruin the budget. Things got better because the PM laid down the law.", "NTA. You were in the right as long as you reserved the room -- including the fridge -- as your condo association requires.\n\nAs for the person's attitude \"showing\" this or that, don't fall into that trap. Until someone says something directly to your face, it's better to act like it never happened because it didn't. She didn't call you a petty AH. Don't take on problems or insults that you don't have.\n\nHope the party turned out well.", "NTA and those self entitled people deserved worse but by you not being more agressive   you denied them their victim card. Not that they didn't try tho.", "Hell even illiterate people lack enough reading comprehension to read the simplest signs.", "Hell even illiterate people lack enough reading comprehension to read the simplest signs.", "Hell even illiterate people lack enough reading comprehension to read the simplest signs.", "You seriously underestimate the entitlement of some ppl. I rented a private place for my wedding party on the beach. They told me they would put signage and we had a private toilet just for us. Guess what? They needed to put somebody outside because ppl would just keep on coming in. Including one lady with friends who moved my bags etc. to sit down on one of the tables and actually wanted to start a fight with me when I got pissed off that they didn’t only crash my wedding but also moved my bags from the sofa seat.", ">since it's legally required that public businesses have public bathrooms.\n\nNo they don't! If they meet certain parameters  public businesses are not required to have a public restroom. Little Caesars doesn't have a bathroom. Most pizza pickup locations don't have a public bathroom. Most dry cleaners I have been to don't have a public bathroom.", "NTA.", "Nope, you’re within your rights. What part of the reservation don’t they understand. If they had a problem they should have taken it with the leasing office personnel. You paid the club house rent/deposit so you’re entitled as well as responsible for use of the space.", "Weird that they leave it open, ours is always locked unless it’s been booked.", "Her right to use it but then it sounds like she was a friend of a resident. Why else would the second woman come in and ask \"why did you kick my friend out\"? Friend does not equal condo owner or renter.", "NTA. You reserved the room. Why did they need the fridge in the room where the private event was taking place? And yes, it is absolutely fair to only want YOUR guests using the fridge considering they were invited to the private event.", "We had reserved a small part of the local botanical gardens for my brother's wedding (and paid to do so), and we had people move the signs saying the area was reserved out of the way (we had them blocking the entrances so they were really obvious) so they could get past and wander around the background of the goddamn ceremony. Can't fix assholery.", "I sooo feel your pain... I also work in retail and sometimes our card payment is not working. I have signs all over the store in 2 languages. The amount of people that have read it is 0... One took the sign off from the place it was sitting on to look at something behind it, read it, put it back and was still surprised when I said that he couldn't pay by card...\nI'm still amazed everytime....", "Ah yes management, the 70 year old guy who owned a anon chain gas station.", "“I refer the honourable gentleman to the answer I gave some moments ago”.", "Can I use the fridge?", "> I just explained to her that there was a private event going on.", "If they had a problem they should have taken it with the leasing office personnel.", "> It is absolutely fair to only want YOUR guests using the fridge considering they were invited to the private event.", "Stolen comment. Downvote and report."]}