{"id": 23620, "submission_id": "15f0owr", "title": "AITA for asking my stepmother to walk me down the aisle at my wedding?", "selftext": "My (23F) father cheated on my stepmother with my bio mother, who was also married. My bio mother tried to tell her husband that I was his but he found out. He agreed to not leave her if she gave me to my dad. My stepmother is a wonderful woman and raised me like her own. I consider her my mother more than the woman who gave birth to me. My dad was a serial cheater and my stepmom and him divorced when I was about four. My mom and her husband also divorced and she married my dad when I was eight. \n\nThey split custody of me with my stepmom but I started spending more time with her as I got older and by the time I was 18 I was living with her pretty much full time. I honestly see her as my mother and I’m only calling her my stepmom in this post to avoid confusion. I’m getting married next month and I asked her to walk me down the aisle. I don’t have a great relationship with either of my bio parents.\n\nYesterday my dad called and said that he’s really excited to walk me down the aisle at my wedding and he’s been waiting for this day for my whole life. I told him that he’s not walking me down the aisle, my stepmom is. He got mad at me and called me rude and ungrateful for having her walk me down the aisle when both of my “real parents” are alive. I told him that she’s been a far better parent than either of my “real parents”. My bio mom called me this morning and said I’m a horrible daughter and said she’s not coming to my wedding if I walk down the aisle with her. AITA?", "created_utc": 1690859851, "permalink": "/r/AmItheAsshole/comments/15f0owr/aita_for_asking_my_stepmother_to_walk_me_down_the/", "score": 179, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because my stepmom is walking me down the aisle at my wedding even though both of my bio parents are alive and might not attend my wedding.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, I would do the same thing. Celebrate your day with your mom who loves you.", "NTA. There’s a saying where I’m from that basically says “a parent is not who made you, but who raised you.” Your mother has been, from what you’ve described, a far better parental figure than your bio parents. If you feel strongly about having your mom walk you down the aisle, this is your choice and not your bio parent’s choice to make. If they choose to not be part of this beautiful and unique day for you, that is their choice and they’ll have to live with it. All in all, congratulations on your big day and enjoy it!", "You are absolutely NTA. It’s your wedding and you get to choose who walks you down the aisle. Biology doesn’t make a good parent. Choose the parent that was really there for you but be ready for the consequences of that choice. Congrats on your upcoming wedding OP.", "NTA what a lovely tribute to your real mother who raised you through her pain of experiencing infidelity. \n\nThis nonsense of the dad walking down the aisle to give away us anachronistic and patriarchal. In 2023 it shouldn’t be an entitlement (same with nonsense if asking the father permission to marry). I love tgat you’re re-writing this by having the real person who raised you.", "Two less plates to pay for!\n\nSorry to be glib, but OP, these people contributed their DNA but after that just used you as a bargaining chip to blow up two marriages in facilitating theirs. The absolute gall of them now trying to claim any role in your wedding uninvited is shocking. \n\nBest wishes for a lovely wedding and fulfilling marriage", "NTA\n\nHonestly, sounds like a win if bio-mom doesn't come?\n\nYou don't owe anyone other than yourself and your partner **anything** on your wedding day.  It wouldn't matter if you'd been raised by two people who were always together and always raised you. You still get to pick who you want to walk you down the aisle. It's on your dad that he assumed it would be him, without ever asking what you wanted. \n\nI think it's beautiful that you've chosen your bonus-mom.\n\nWishing you and your fiance a lifetime of happiness!", "Nope NTA. Blood relation doesn’t always mean more important. The actions people take need to be taken into account. Let your stepmom walk you down the aisle.", "NTA Look at it as you are having a wonderful woman walk you down the aisle and you're also getting to save a little money because now you won't have 2 extra guests at the reception. That is a win-win!", "NTA and sounds like no great loss if neither of them come. Your stepmother is your real family.", "Not the AH. Good for you to decide to have your “step mom” walk you down the aisle. She was there for you and deserves the honor. Blood does not a family make. \nEnjoy your day. I suggest you go NC with the bio parents. They are not worth your time or consideration.", "NTA. Tell home wrecker it is what it is.", "NTA - Normal people would just be happy for you and help you celebrate.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (23F) father cheated on my stepmother with my bio mother, who was also married. My bio mother tried to tell her husband that I was his but he found out. He agreed to not leave her if she gave me to my dad. My stepmother is a wonderful woman and raised me like her own. I consider her my mother more than the woman who gave birth to me. My dad was a serial cheater and my stepmom and him divorced when I was about four. My mom and her husband also divorced and she married my dad when I was eight. \n\nThey split custody of me with my stepmom but I started spending more time with her as I got older and by the time I was 18 I was living with her pretty much full time. I honestly see her as my mother and I’m only calling her my stepmom in this post to avoid confusion. I’m getting married next month and I asked her to walk me down the aisle. I don’t have a great relationship with either of my bio parents.\n\nYesterday my dad called and said that he’s really excited to walk me down the aisle at my wedding and he’s been waiting for this day for my whole life. I told him that he’s not walking me down the aisle, my stepmom is. He got mad at me and called me rude and ungrateful for having her walk me down the aisle when both of my “real parents” are alive. I told him that she’s been a far better parent than either of my “real parents”. My bio mom called me this morning and said I’m a horrible daughter and said she’s not coming to my wedding if I walk down the aisle with her. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA it sounds like you have a great(step) Mom", "You are not TA. They are. What a wonderful person your stepmother is.", "There's a bonus as well which is that her bio parents might not come. Good thing to as they might find a way to ruin a marriage because it seems that that's all they're good at.", "Your biological parents effed around and found out.  Your bio folks think you're a horrible daughter? Well, they've been horrible parents.  The woman who actually stood up for you and parented is given the honour of walking you down the aisle.  NTA.", "NTA it’s your wedding you can choose who you walks you down the aisle or not. Just coz your dad is your dad doesn’t automatically mean he’s the one to walk you down the aisle especially as like you said he’s not really been a parent figure to you.", "NTA!\n\nsharing blood doesn't make people family.\nyour dad called you ungrateful? for what? for the sperm he gave? \nyour bio mom called you horrible? like how she gave up her \"real\" child when it was convenient to do so?\nthe audacity of some people 🗿🗿\n\nyour stepmom sounds wonderful. to accept a child that's not biologically yours and raise them to be good people is a thing not a lot of people are capable of.\n\nenjoy your day with the people you love\n\ncongratulations on your wedding!! wish you all the love for your life ahead!❤️\n\nedit to add judgement", "NTA. The position is for someone who has supported and stood by you, not necessarily a parent. If I were to meet someone and want to legally attach to them in my current dog’s lifetime, he would be the one walking with me, since his presence has given me the most support so far in life, and since my grandpa, who I was really close to is gone, my boy gets it by default. \n\nSome choose a grandparent or sibling (my uncle actually did double duty as a combination best man for my stepdad, and escort for my mom), some may want a best friend in the role, and some no one. All of these are valid and okay. You do you.", "NTA. \n\nHow exhausting to deal with such drama. Walk proudly down the aisle with someone who treats and respects you a daughter and was instrumental in raising you to be such a healthy person. Happy wedding!", "> My bio mom called me this morning and said I’m a horrible daughter and said she’s not coming to my wedding if I walk down the aisle with her.\n\nI’m certain this is painful in its own way, but your bio mom has offered a pretty perfect solution - your stepmom walks you down the aisle, and your bio parents stay home and let you have a peaceful day with the people who love and support you. \n\nI’d take her up on this and rescind both their invitations. NTA, and enjoy your wedding!", "Sounds like your true family will be at the wedding. Have your far better parent walk you down the aisle. NTA.", "Well congratulations! I’m so excited for your special day! \n\nYou are definitely NTA. Your mom sounds like a wonderful mom, woman and maybe grandma one day. Your birth donors are just mad that their horrible parenting and relationship with you will be on display. You don’t need them there and if they want to continue to be self centered and rude, it goes to show you more of their true colors. It is your day, you and your SO decide how you want it to look and don’t let anyone else tell you otherwise. \n\nSeems like if your egg donor came, she would make more drama about it all anyways. I think this is a wonderful and special way to show the woman who raised you how much she means to you. 🤍", "This feels like, “The blood of the covenant is thicker than the water of the womb\". Chose your family. \n\nNTA. Congratulations, OP!", "NTA. It’s certainly your decision only.", "NTA - It's your wedding, and you want your step-mom, who is the person who raised you, to walk you down the aisle. I think it's a lovely thing for you to do and I hope you have a wonderful day, and add to your happy memories with her. And I am sure that she is honoured and excited by your choice. \n\nIt's lovely that you are making the choice to publicly  acknowledge her importance to you \n\nAs for your bio-parents, don't engage or get involved in justifying your choice. If your mom says she won't come if your dad doesn't get to walk you up the aisle , then a calm \"OK, that's your choice. I'd like you to be there, but if you chose not to come, I will of course respect your choice\"", "NTA\n\nBio parents: “we’re not coming”\nMe thinking: do you promise?", "\"I'd like to be walked down the aisle by the one adult family b member in my life who respects marriage\"", "NTA. I know a tonne of folks whose step parents treat them better than their birth parents and whom they consider family more than the people who gave them their genes. Your parents don't get to reap the rewards of parenthood while doing none of the actual work. Your dad sounds like a ratbag (sorry) and your birth mum clearly also has some issues with honesty and fidelity etc etc", "NTA. Your mom tossed you aside for her marriage. Just do what you want, ignore those people.", "NTA your step mom stepped up when she had every reason to walk away.\nShe choose to be a wonderful parent.", "You can ask anyone you like to walk down the aisle.", "Nta\n\nCongratulations! Cheers to your wonderful future!\n\nMaybe someday, people will realize that parents are the ones who were there.", "NTA.  Problem solved.  Enjoy your wedding with the woman who raised and loved you selflessly.", "I think it's beautiful that her stepmom has been such an amazing parent to her when her bio parents were.... Not.... Especially when she was going through her own shit at the time. Of *course* she should get the honor of walking OP down the aisle!      \n\nLittle rant ahead, but I totally agree with you about the whole \"giving away\" tradition. Neither my late husband or my second husband asked my parents for \"permission\" to propose, and my parents never expected them to. They know I'm my own person and can make the decision for myself.       \n\nBut for the first wedding, I think we all just kind of assumed that my dad would walk me down the aisle (but not really give me away in the traditional sense, just as an escort I guess). But when I told my parents that my second husband and I got engaged, my dad asked if he'd still have the honor (emphasis on *honor*) of walking me down the aisle. I thought it was sweet that he asked, and since it was important to him I was absolutely okay with him escorting me. I would've asked him to do it regardless, but asking first was really sweet. But as a quick disclaimer: I shouldn't have walked by myself anyway because there were steps, and I absolutely would have fallen if I didn't have someone there to hold on to lol.", "It kind of breaks my heart that OP has never been able to count on her bio parents to be supportive and loving, but I am so glad that her \"step\"mom has taken on that role. If I knew who that woman was, I'd send her a bunch of flowers because she sounds like the kind of mom who really deserves them."]}