{"id": 23730, "submission_id": "15g9q4q", "title": "AITA: Am I The Asshole for not breaking off my vacation when my granmother died?", "selftext": "First of all, English is not my first language, please bare with me. \n\nSo, I went on a 5 day trip to France with a friend of mine and on the third day, my mother called me that my grandmother had died peacefully in her sleep that night. So I expressed my condoleances and asked how she's doing. She said that she's okay-ish but very sad but that she was with my brother and sister and that they're going to organise the funural with the three of them. I asked her if there's anything that she needs from me and she said no, that she just wanted to let me know.\nSo I hang up and went on my vacationy way. Ofcourse I was sad too, but I'm quite a practical girl and it's not as if I could say any goodbye to my grandmother because she had already died. (I know that's probably gonna rub some people the wrong way, but I couldn't change anything about the fact that she already died)\n\nSo my vacation ended and I got back home and two days after I got back, we had the funeral. A day after the funeral  I got in a huge fight with my mother and sister about me not coming home from my trip after the news that my grandmother had died. How I could do that to them and me being so selfish. So I expressed to them, that they hadnt asked me to come home once, and that in my eyes there was no need to come back home earlier, since I would be back on time to attend the funural. I can imagine they would've liked it for me to have come home, but they hadnt asked me becasue if the wouldve, id probably gone home., And as I said before, for me it wasn't necessary. \n\nTl:dr: grandmother died while I was on a 5 day trip. Got back before the funeral, attenderen said funeral, got into a huge fight with my mom and sister on how selfish I am for completing my trip and not coming back earlier. \n\nAm I the Asshole...?", "created_utc": 1690984903, "permalink": "/r/AmItheAsshole/comments/15g9q4q/aita_am_i_the_asshole_for_not_breaking_off_my/", "score": 37, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because didn't go back home when my grandmother died to be with my family.\nI didn't feel the need to be with them, nor did they ask me to. However, now they tell me that I am selfish and that might make me the asshole...\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you ask her if she needs you and she say no. If your mother wants you to get back home she should tell you direct you not mind reader.", "NTA, you clearly asked if they need support and your mom said no.", "NTA. \n\nYou asked if she needed anything, she said no. If she can't use her words, she can't put that on you. And as you stated, you were back in time for the funeral, plus you get to decide how and where and when you grieve, no one else. \n\nAdditionally, it was a 5 day trip and this took place on night 3. Given the expense and hassle of changing flights, I can't imagine you would have gotten home much earlier. Just from a purely practical standpoint, in your shoes, I'd actually have a ton more stress over trying to get home early (I live in the US so our airlines are just awful). I'd have to fly standby, I'd have to eat a bunch of costs, I like a plan so having it up in the air would make me anxious, and I would make it home... a day early, if the travel gods were on my side? \n\nMaybe if this was a 2 week trip I'd feel differently, but you were home fairly soon after the news, you were there for the funeral, you asked your mom what she needed from you. \n\nI think sometimes when death happens, people want to be mad at something, and in this case, they are directing their anger at you because being mad at death isn't particularly satisfying. Give your mom a few days and reach out. You don't owe her an apology, but you can give her some grace in her grief and take the high road and just say \"Mom, I love you and I'm sorry. I didn't mean to make you feel like I wasn't there for you, I did think things were okay and I misread your emotions.  I'm here for you now and I want to be here for you and with you, and I certainly don't want you angry at me now when you are already sad. Can you accept my apology and can we grieve together?\"", "NAH\nwhat you did was the most practical thing. \nI guess from their pov they see it like this:\n\n1) you say you were able to attend the funeral. But obviously you took no part in organizing it. Having organized my MILs funeral last year, I can tell you it's a lot of work and the people organizing need all the help they can get\n\n2) while you don't sound particularly close to your Gma, I'm guessing your mother was grieving a lot more since that's her mother. So she had to grieve and organize the funeral\n\n3) I'm guessing your sister also helped organize the funeral plus had to take onmmost of the burden of comforting your mother too\n\nTheir emotions were also high plus they had to see to so many other things as well.", "NTA \n\nJudging by the way you wrote you’re probably not super close with your grandma? It might be different if you could say your goodbyes if you made it home but since she has passed (may she RIP), plus you can make it to the funeral, I think it’s fine. If they wanted you to be back for support they should have asked.", "NTA. My mother always told us that if she died while we were on vacation, that no one was to tell us until we got home. My in-laws said the same. \n\nA friend was in Cuba when she got the word that her mother died. She cried the entire flight home on her already scheduled flight the next day and then had to drive from the airport on the country's busiest highway. Not only was it cruel to tell her the day before she would be home anyway when she couldn't do anything about it, but she could have been killed because she was crying while driving on a busy highway.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFirst of all, English is not my first language, please bare with me. \n\nSo, I went on a 5 day trip to France with a friend of mine and on the third day, my mother called me that my grandmother had died peacefully in her sleep that night. So I expressed my condoleances and asked how she's doing. She said that she's okay-ish but very sad but that she was with my brother and sister and that they're going to organise the funural with the three of them. I asked her if there's anything that she needs from me and she said no, that she just wanted to let me know.\nSo I hang up and went on my vacationy way. Ofcourse I was sad too, but I'm quite a practical girl and it's not as if I could say any goodbye to my grandmother because she had already died. (I know that's probably gonna rub some people the wrong way, but I couldn't change anything about the fact that she already died)\n\nSo my vacation ended and I got back home and two days after I got back, we had the funeral. A day after the funeral  I got in a huge fight with my mother and sister about me not coming home from my trip after the news that my grandmother had died. How I could do that to them and me being so selfish. So I expressed to them, that they hadnt asked me to come home once, and that in my eyes there was no need to come back home earlier, since I would be back on time to attend the funural. I can imagine they would've liked it for me to have come home, but they hadnt asked me becasue if the wouldve, id probably gone home., And as I said before, for me it wasn't necessary. \n\nTl:dr: grandmother died while I was on a 5 day trip. Got back before the funeral, attenderen said funeral, got into a huge fight with my mom and sister on how selfish I am for completing my trip and not coming back earlier. \n\nAm I the Asshole...?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. It happened to me once. My uncle passed away when i was away on a vacation. \n\nWent home 4 days after the funeral. Was told that i was selfish. I just ignore it. Everyone move on after few weeks.", "NTA, and I do not understand families that guilt trip each other like this. You had two days left—all kinds of things can go wrong when you try to book a last-minute flight. You could have easily spent one of those days in the airport, more if the connections didn't play out perfectly. You were smart to spend the last two days as planned, and you got home well before the actual funeral. Your mom and sister are just doing this to you because anger is easier to process than grief. You did nothing wrong.", "YTA.\n\nYou are not realizing your mom's mom just died.  It shouldnt even have to be asked, you cut your trip short and head home.  She is an emotional wreck and not thinking clearly.  \n\nNot popular, don't care.  Been in your moms shoes and told friend no.  I had moment of clarity and realized I needed my friends there.  Called them up, said I needed him.  \n\nNow dont be surprised if your relationship with your mom is deteriorated/gone.  This not her fault, it is only on you.  It also speaks what you value, and it speaks very lowly of you.  Uncle/Aunt would be different story, different bond.", "NTA. It’s not realistic to expect you to read your mother’s mind. She could have said something like “you don’t have to come home early, but it would be helpful to me and your sister if you did” - which would tell you that she wants you there if possible.\n\nI wonder if your mom has been taught to suppress her feelings, or at least never learned to express how she feels out loud? Sometimes when people don’t know how to say what they want, they get frustrated and blame others for not just knowing.", "NTA. Your mother is a grown woman, she had your two siblings with her, and it's not like you could just pop back home, without ending your holiday and forking out for a potentially expensive flight change. Grief can make people a bit crazy, unfortunately. Sorry for your loss.", "NTA.\nGrandmother of my husband passed away when we were on our honeymoon. We missed the funeral. Everybody understood.\nJust know that everybody grieves in their own way and it is so much easier to be angry than to be sad. Cut your mother some slack, I am sure she will come around.\nAnd my condoleance 🙂", "NTA, you asked if she needed you and she said no. She should have said yes if she did", "NTA. you have the right to grieve as YOU wish. Not as other perceive you should.", "NTA", "NTA\n\n&#x200B;\n\nYOur grandma certainly did not care.", "NTA Your grandmother counts the times you visited before her death. Not after", "NTA she could've said she needed you home if she really needed you. everyone grieves differently, you were perfectly within your rights to continue enjoying your vacation.\n\nim sorrry for your loss.", ">So I hang up and went on my vacationy way. \n\nI think that might be what disturbed them. You seemingly having fun while they were mourning", "NTA. She informed you, you asked if she needed anything and she said no. I'm guessing she knew when your vacation was over so she knew you would be home soon anyways. If she wanted you home earlier she should have said so. Death happens, it is sad and it is tragic, but that doesn't mean you stop living your life. It would have been one thing if the family had asked you to return and you said no because your vacation mattered more, but that isn't the case here.", "NTA enough with people expecting others to read their minds, you asked her if she needed anything and she said no. Then a few days later shes suddenly angry.", "I would have done the same in your situation.\nNTA", "NTA. \n\nWhen I was 14 I was at summer camp when my grandma died. My mom did not tell me or my sister until we came back— because THATS WHAT MY GRANDMA WANTED. I’m sure your grandma would have wanted you to enjoy your trip. \n\nYour mother needs to communicate. That’s on her.", "NTA. I’ve skipped entire funerals and never been yelled at about it. I only went to my grandfather’s funeral because none of my siblings were going (he wasn’t the greatest, to put it lightly) so I went to support my mom and she did not yell at or lose it on my siblings for not coming. My point is, your siblings were there to support her and you did come back not much later. You also asked directly if you were needed. They are probably just angry because of their grief.", "NTA \nIf you didn't want to go home you don't need to go home for anyone else. Like you say your grandmother had already passed away and you'd be home for the funeral , there's really nothing more you could have done.", "NTA I live in another country from the rest of my family. When my grandma passed away recently, my dad called and asked me to book the next flight available to be together. \n\nI do have to say that mourning together as a family was healing. Part of what is now going to be necessary is putting your grandma’s life in order. Make sure to be there to go through photo albums, old clothes, and all that. Even if your mom doesn’t ask for you to be there, she needs you there.", "NTA. You were there to support people at the funeral. \n\nYour experience exactly parallels mine. Husband's father died when we were in Ireland. His sister was there to see to the immediate details, like the funeral home collecting FIL  and arranging for the wake & mass, but there were no big decisions that the family had to make. Everything else had been pre-arranged and paid for long since. We could have ended our trip early but at best that would have put us home only a day before our scheduled return. I left the choice up to Husband, and he opted to continue. Yes, he was upset, but also somewhat relieved. His father had end-stage Alzheimer's  and the family had done a lot of ... I guess you'd call it \"pre-grieving.\" FIL's personality had already died, and all the family could do was wait for his body to finally give up.", "NTA. Maybe when the actual work of planning the funeral and arrangements started, they realized that perhaps you could have been able to help more. But they didn’t communicate that to you, so there was no reason for you to cut the trip short. You didn’t do anything wrong, and I’m sorry for your loss. Hopefully they will see reason after some time passes.", "my grandma passed a week and a half before my trip with my best friend, and I was told she would have wanted me to go and have fun. she and my family understood that it was sad she was gone but that she wanted me to still live and be happy. she traveled all the time and wanted me to do the same. what were you to do? sit there with them and be sad? you came to the funeral nta", "NTA - she was already dead.", "NTA booking a last second international flight would wreck my bank account. When my grandpa died I was at school across country and had to miss his funeral bc it would have been such a logistical nightmare for myself and for my family. \n\nYou booking a flight and rushing home to help plan a funeral with severe jet lag honestly could have created more stress for all involved. \n\nYou also literally asked what they needed from you and they said nothing. Honestly it sounds like your mom is grieving and is projecting that onto you. That sucks but it will probably die down when she's at stage 5", "It may have cost you money to change your tickets to return home early.  What could have you helped with if you had returned home early?  \n\nYou mother and your aunt are dealing with their grief and they took it out on you.  Most people act a bit irrationally when dealing with grief.\n\nNTA", "NTA. You asked if your mom was okay. You asked if they needed you and you were told no. Also, I don't know where you're from, or what the inter-country European transportation system is like, but could you feasibly have even gotten home faster? Like, in the US, if I was on vacation to say California, over a thousand miles away from my home and a several hour plane ride, it would be a big hassle and probably a large expense to go home two days early, if I could find a flight on short notice. Could it be done? Yes, but I probably wouldn't unless absolutely necessary and I would still probably get home 24 hours or so earlier than planned.", "NTA\n\nIf she wanted you to come back, she would have said so when you asked her, \"Do you need anything.\" You gave her the chance to say, \"please come home\" and she didn't. At no point in the story did you say someone messaged you going, \"Can you please come home\".", "NTA. There was nothing they needed from you at the time. You were back in time for the funeral. If they want to pick a fight after the fact, that's on them. You did nothing wrong.", "NTA", "Your sister or brother could have told you that your mom really wanted you to come home.  \n\nNTA", "Nta. You made it to the funeral and sometimes it's very complicated, stressful and cost a lot to move a flight and train tickets.", "NTA she should have VOICED her wishes rather than saying the complete opposite.", "Yeah.. that's a problem we have more often. She wants me to mindread what she wants. And I I say I can't read her mind, she's disappointed in not rasing me to be more empathetic. (I think she wants me to be telepathic too)", "She was just very disappointed that I didn't notice that she would've liked me to come home.", ">I think sometimes when death happens, people want to be mad at something, and in this case, they are directing their anger at you because being mad at death isn't particularly satisfying. Give your mom a few days and reach out. You don't owe her an apology, but you can give her some grace in her grief and take the high road and just say \"Mom, I love you and I'm sorry. I didn't mean to make you feel like I wasn't there for you, I did think things were okay and I misread your emotions. I'm here for you now and I want to be here for you and with you, and I certainly don't want you angry at me now when you are already sad. Can you accept my apology and can we grieve together?\"\n\nThis! I think this is a real important thing for me to realise. She's grieving too and maybe she needs an emotional relief. I'll talk to her. Thank you for your well written comment. :)", "Thank you for this point of view. I hadn't thought about that. I do feel like they could have asked when they needed help. But I do admit that I probably underestimated what they had to do and what they went through.", "I went over to her about every 3 to 4 weeks. She had dementia and in the end she didn't recognize me anymore, which felt like a gut punch everytime I went. If there were any signs that she was going to die in the upcoming days, I would have gone home to say my goodbyes, but that wasn't the case.", "I actually think that \"rule\" is a smart thing. I'm so sorry for your friend. \n\nI do think I would like to know when it's my parents, atleast so I could be back in time for their funeral. But I do totally understand the thought about telling people afterwards. It could become dangerous otherwise!", "I tried ignoring it, but it still doesn't sit right with me. It helps that you don't think I'm the asshole. :)", "I hadn't looked at it that way. That this might be their way to grief, or to not grief in a sense. Thanks for your response!", "The difference between your story and OP’s is that you actually told your friends what you needed. OP’s mom never said “actually nevermind, please come home”, she said no and did not elaborate for the rest of OP’s vacation.", "Thank you for this point of view. I hadn't realised that and thought the support of my sister and brother would be enough. I know I chose to stay, but I guess that's my way of processing the situation. Which is, I guess selfish. Maybe I had to be more aware of the situation from my mother, brother and sisters point of view.", "At the very least, don’t ask “Do you need me to do anything?” Ask, “What can I do to help?” There are plenty of things OP could have done while on vacation: writing the obituary, calling relatives, organizing a musical number, calling the funeral venue, etc.", ">I wonder if your mom has been taught to suppress her feelings, or at least never learned to express how she feels out loud? Sometimes when people don’t know how to say what they want, they get frustrated and blame others for not just knowing.\n\nMy mom has told me that her mother was never one to listen. She spoke more then she would listen. So yeah, maybe my mother hasn't learned how to properly express her wishes...", "Thank you, I'm actually happy that most people don't think iatah, cause I really started to doubt myself", ">Just know that everybody grieves in their own way and it is so much easier to be angry\n\nThis I hadn't even though about before a comment of another redditor. I'm just sad that now everyone is sad or angry, and I wish we could grief together. \n\nAnd thanks for you condoleances :)", "Thank you, I agree! I do wish I could grief together now, instead of being angry with eachother.", "I dont think she would have. She had dementia in the end, but when she was more clear headed, she always celebrated life the best way she could, including vacations ;)", "I'm not sure what you mean? BTA as in both the asshole?", "Thank you for your comment! I appreciate it", "I was too, its not like it didn't do anything to me. But for me, distraction is a really good emotion regulator.", "Absolutely, I would definitely have gone home (if possible with transportation) if they had asked. But they didn't, so it struck me ass odd that they were so mad. But I did kind of feel like an asshole because I didn't consider their feelings.", "Yup.. some people aren't really good at expressing their wants or needs...", "Thanks! Appreciate it :)", "My grandma was all for enjoying life, I do (want to) believe she would have been okay with it ;)", "I'm conflicted... I feel like they should have expressed their wishes, on the other hand, I hadn't realised all the things they had to organise and/or do..", "Well. I could have emotionally supported my family... I guess it was just also a way for me to grief. My cipingstyle is to distract myself.", " Thank you for this!\n\n>Part of what is now going to be necessary is putting your grandma’s life in order. Make sure to be there to go through photo albums, old clothes, and all that. Even if your mom doesn’t ask for you to be there, she needs you there.\n\nI do think I have to have a good talk with my mom. I feel alot around my grandmother dying, what I don't want to feel. I'm the only grandchild she didn't recognise anymore due to her dementia and I know that hasn't been her fault, but it did hurt me. I think I have to have a chat with my mom about both our feelings.", "My grandmother had alzheimers too.. I was the only grandchild she didn't recognise in the end... which did and does alot to my feelings. But thank you for your comment!", "Thank you!! I think I should have a good talk with them", "I guess they would have wanted more (emotional) support...", "That is in fact true", "I have the same problem with my mom. She was basically socialized to believe that it was rude or greedy to openly state that you want or need something (women's function being to care for children and support the men in their lives).\n\nThus, I was always supposed to intuit what I was supposed to do without her having to explicitly say it - or I was a lousy person who didn't care enough about her. (I am also a woman and was also not ever supposed to express wants or needs for anything not absolutely necessary - exceptions being things like birthday or Christmas presents - even that is fraught with lots of secret pitfalls...).\n\nAnyway ... I suspect that your mother and sister are inappropriately transferring their grief about your grandmother's death to the issue of you not knowing that you 'should' have come home early despite not being asked to come home and there being literally nothing you could have done that would have changed the situation.", "Tell your mom she needs to learn how to properly communicate.", "You're not a mind reader, don't let her hold you hostage emotionally because she failed to communicate what she needed", "Just tell her that you are very disapointed that she would rather have you read her mind than express her wishes. Serioulsy, people like your mom are the worst .", "That's such a bullshit manipulation. If she wanted you home she should have said so, NTA.", "But what would you have done when you got home early ? She already had family around to support her, and any arrangements would have been made before you got home. This happened on day 3 of five so realistically you would have only been able to to get home one day earlier. You don't say how you traveled to France, but if you flew getting an earlier flight may not even have been possible.", "You're welcome. I'm glad I could show you an alternative pov. Like I said, I definitely don't think you were wrong to just stay out the remaining 2 days and go home. But try to make up with your mum and sis because they deserve some grace in this situation.  They dont sound like bad people. Just emotionally overwhelmed. Hope everything works out.", "You are welcome.  Grief is odd.  When my dad died I was told my brother refused to flyout to say goodbye.  At first I didnt think much, but honestly we could have used him there.  It started to piss me off more and more I thought about it then decided to cut him off because he just didn't feel like coming and \"work wont give me time off to say goodbye to dad.\"   So it can be the opposite.   Hope your mom is dealing better.", "INFO: are we talking about getting an earlier train back from France to, say, Germany, or re-arranging return flights overseas (likely at huge cost)?", "I understand 🙂 talk to them", "Typo. I fixed. Hope you had an awesome time in France.", "As harsh as this may sound, especially given the situation, but you are NOT responsible for their feelings. Had they come to you and calmly, and respectfully expressed their feelings about you not immediately coming home, I can see how you might want to reflect on what you did or did not do and how you may have unintentionally caused them more pain. However, what they did was wait until only a DAY after the funeral to gang up on you and attack you with how they felt. Did they show any regard to how you were feeling when they berated you and argued with you? No. If they cannot communicate as adults then they don't deserve your concern because you are also grieving. Grief and being family does not give others the right to use those emotions as weapons against others.", "Yea, they should have expressed their wishes. If you feel bad about the planning they had to do, maybe offer to take over the planning of some future event to make that up to them.", "Therapy would also be great for you if this is how you’re feeling right now. Sometimes we need the ear of someone that is not involved to really resolve our issues. My sincere condolences, it’s hard right now, but try to focus on the good memories.", "Im sorry. I know it hurts that your grandmother didn't recognize you, but that is an unfortunate factor of the disease. Memories tend to disappear in reverse order, so that the newest ones, the ones that have the least impact on your brain, the ones that you don't reinforce by remembering over and over, get lost first.  She might have remembered you as a baby, remembered something like making  you a special quilt or taking you to the county fair carnival, but not remembered that you grew up. And it would be really confusing for her to be told \"I'm your grandchild OP\" when yesterday you were just an infant. She might even have thought that your mom(?)  was only a small child and that would be even more confusing. How could her 5-year-old have grown children? \n\nMy own mother, near the end, didn't remember that my father, her husband of 72 years, had died. She would say \"Your dad was just here a moment ago. I wonder where he went?\" (We told her he'd gone to the hardware store.) She could tell you all about the day they met, where and how and what girlfriend she was with, because she'd had 75+ years to make those memories firmly lodged. But that day that she lost him was gone completely.", ">She was basically socialized to believe that it was rude or greedy to openly state that you want or need something\n\nI think my mom has the same thing going. Its hard because I went into therapy to learn how to do that exact thing, but she didn't \"grow\" with me on that. I do feel bad for not realising better what she actually wanted.", "She thinks she is, and I'm just not sympathetic enough to know exactly what she means or needs.", "Thank you for this! This is exactly my feeling, but I just can't convince them this point of view...", "It bothers me too. Very unrelated side story. I went into therapy for about a year (3 days a week) to learn how to express myself and my feelings. And she just thinks I can read her mind. It's frustrating that I've been in such a long process and my mom hasn't grown with me....", "Yeah, she's not good at expressing..", "Yeah, I will initiate a talk about all of our feelings. I hope that will help sooth everything and so we can understand eachother better (for the future)", "My brother skipped my grandmother's funeral because tbh she wasn't the greatest person. I had to explain to him he should have gone because our dad's mom just died. He should have been there for him, not for her.", "I'm so sorry to hear about your situation. I'm not intending to let that happen and I think it would be a smart thing to do, to have a conversation with my mom about both our feelings before either one of us stays hurt to the point of no return.", "It was within Europe, but I did travel with airplane. Also keep in mind, that I was with a friend who would also have to buy a ticket back. But for me the travel back wasn't really a concern. I just really wanted to finish the trip.", "I will!", "Aah hahaha, thank you. I had an amazing time :)", "I think it'll be the best if I'm going to have a chat with my mom about everything.", ">Sometimes we need the ear of someone that is not involved\n\nHahaha, that's why I came to AITA :p", "Don't feel bad. It's not your responsibility to guess what others want. They can use their words when they want something.", "I’m sorry it’s like that with your mom of all people ://", "Sometimes people just can't be convinced, we need to make peace with that.", "That's true!", "Yeah... I'll have to have a talk I think", "Unfortunately, yes.."]}