{"id": 23748, "submission_id": "15gpj45", "title": "AITA Monthly Open Forum August 2023", "selftext": "We'll edit in a real post in the next few days, but we're behind and wanted to get something up.\n\n#Keep things civil. Rules still apply.\n\n#No links to posts/comments - if something requires context, send a [modmail](https://old.reddit.com/message/compose/?to=/r/AmItheAsshole) as a follow up.\n\n---\n\n##We're still accepting apps for new mods.\n\n####Please [see here for more info](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)", "created_utc": 1691024143, "permalink": "/r/AmItheAsshole/comments/15gpj45/aita_monthly_open_forum_august_2023/", "score": 8, "replies": ["[Me coming in to the monthly forum two hours after it was posted, only to see no comments...](https://media.giphy.com/media/6uGhT1O4sxpi8/giphy.gif)", "So weird to see barely any comments here!  I wonder where everyone is 🤷‍♂️\n\nAnyways… question for the amazing mod team.  I’ve sporadically noticed that posts asking about situations where OP cut off someone are removed for Rule 11.  Why are these posts not allowed in this subreddit?", "This is not nearly as fun as the OF I was promised. :(", "Haha same", "> The following posts are forever banned:\n\n> AITA for breaking up with/ghosting/cutting contact with _ (or not)\n\nA lot of OPs like to hide this question behind a different phrasing, such as \"AITA for putting my foot down\" or \"AITA for how I reacted\". Bonus points if they use one that would break the rules anyway if it were genuine, such as \"AITA for being upset\". \n\nBut yeah, most of the time, the real question comes down to \"I broke up/cut contact with someone and now want a public vote on which of us was worse\".", "I've been reading threads in this sub for quite a while before creating this account and one thing that strikes me is how unreasonably nasty some of the judgements on here can be. \n\nA decent portion of the posts made on here are what I would consider to be disagreements where one/both parties have committed fairly minor infractions.  There really aren't a huge number of posts that I read on here which make me think \"wow, that guy/girl must be a real piece of shit\". And yet pretty much invariably, at least a few of the top-rated comments will be absolutely scathing in their judgement of the party deemed to be the asshole. People will be told that they evidently don't give a shit about their partners because they were late picking them up. People will be told that they should break up with their partners because they acted somewhat petty on a single occasion. \n\nIt's frankly a bit ludicrous. I'll be honest, I've never had a conflict happen which I'd have wanted to post on here. Even if I were to, though, I'd be completely put off by how fucking cruel some of the judgements on here are. Don't know if this has always been the case here or if it's a recent phenomenon but I'd say it really kills the spirit of the sub.", "One thing I don't understand on this sub, is why other commenters get so personally offended when you have a different opinion on something.   Our views are shaped by our experiences, and people have gone through different things that will cause them to view a situation through a different lens, and then render a judgment accordingly.  Yes so many people will read something and resort to name calling because they disagree with you.", "Because who you chose to allow in your life, and other issues of consent, isn’t really up to moral arbitration/judgment. If they want to be judged for an action that led up to no longer being in contact that’s usually fine. But most posts like that are really asking are they the asshole", "I swear I have a situation that would easily violate that rule.  It’s quite spicy too.  Ugh!"]}