{"id": 23760, "submission_id": "15gs7ga", "title": "AITA for crying when I learned my son call’s his in-laws “mom” and “dad” when he calls us, his own parents, by our names?", "selftext": "My son has been referring to us by our first names, or otherwise sarcastically as sir or ma’am, since he was a teenager and it is something I have always despised. I hoped he would outgrow this phase but unfortunately it has been a habit of his for over two decades now. My husband and I are at present on a cross country trip and have stopped for a few days to visit our son and his partner.\n\nWhile we were present, they were discussing plans they have with his partner’s family who live in the area. My son asked his partner to “let mom and dad know we’ll be over by 3pm on Monday” in reference to his partners parents. At first I was in a moment of shock before the wave of emotions overtook me and I started to cry. No one offered to comfort me for a while, before my son-in-law asked me if I was okay or needed anything. I decided to be open with them and explain how it hurt me that my own son refuses to call me “mom” but will happily do so to someone else. I feel like he even made a point to do so right in front of me. Meanwhile my husband just decided to step outside because its overwhelming for him when I cry.\n\nMy son just asked me to calm down, and even felt it necessary to tell me I could either collect myself or otherwise we were free to leave. He seems to think I was so emotional as a ploy to manipulate him, rather than and honest display of how I feel. I just don’t know what happened to my once sweet little boy.", "created_utc": 1691031609, "permalink": "/r/AmItheAsshole/comments/15gs7ga/aita_for_crying_when_i_learned_my_son_calls_his/", "score": 128, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I was emotional that my own son calls me and his father by our first names, but calls his in-laws \"mom\" and \"dad\" so I began to cry. This is apparently manipulative.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO: what’s the missing reasons?", "Ahh, the missing missing reasons…\n\nYTA, it seems as though your crying episodes are frequent enough that your husband leaves to avoid dealing with whatever drama you’ve just instigated and your son is sooo over it and let you know fix yourself or leave. His partner was probably taken aback by your outburst and over the top reaction. \n\nStop asking others to validate you and make better choices.", "A lot of people will call their  in-laws  mom and dad or some variation.\n\nYou son didn't wake up one day and decide to call you and husband by your first names...so what happened?\n\nAns when you cry  he tells you to calm down or leave..sounds cold.   So, why?", "There seems to be a big lack of info.\n\nyou never told us why he did this. usually kids don't do this out of spite for TWO DECADES\n\nthere seems to a very valid reason. which you don't seem comfortable telling. Also given your son's reaction, he seems to have emotionally distanced himself from both of you. Probably for the same reason as to why he started calling you by your names.\n\nUsually for a kid to \"abandon\" their blood relatives and choose \"strangers\" as their new family, a lot of bad shit has to happen.\n\nUntil you tell us what happened/anyone involved in this story giving us proper context, I am gonna say YTA. It sounds like you are trying to emotionally blackmail him.", "YTA. \n\nHere's the thing: there's a reason he calls you by your first name. And to keep it up for 20 years, not just in a moment of teenage attitude, means it is a *big, important* reason that would have been impossible for a healthy person to miss. You need to stop having emotional outbursts (which everyone, even your husband, is clearly tired of) and honestly evaluate yourself. Get a professional (therapist) to help you dig through it all and to help you work on emotional regulation and self-awareness. \n\nIn the meantime, work to minimize the impact of your outbursts on other people. Don't wait for your husband to leave the room, go ahead and leave before you start leaking. Take a walk, journal, quietly reflect, and come back when you're ready to interact with people in a healthy, non-coersive way.", "I was reading an article recently, about how narcissistic parents tend to shower attention on their kids when in public, and how they turn on them when they stop being mindless-children. Those parents turn on the kids once they start growing up and the narc parent can't control them completely. \n\nthe loss of the \"sweet innocent baby boy\" reminded me of that.\n\nBut hey, so did the emotional manipulation... and you thinking that your son is somehow to blame and not that your an your husband's upbringing/parenting style and personality/disorders affected him so much that he knew there wasn't genuine love there. \n\n\"No-one offered to comfort me for a while\" - forgot this one too! Your performance fell a bit flat or the audience has recognized the manipulation for what it is.\n\nIt might be super duper helpful if you spoke with a mental health expert and did a fun little quiz to see if there is anything about your outlook on life that makes you treat your child horribly but you're unaware of it. \n\nI know to YOU it may feel people are against you, and people don't understand, but if you talk to a professional and get some insight into yourself, your relationships can be better. Use this as a wake up call. You and your husband somehow mistreated your son so much that he is unable to connect with you with affection. If you genuinely want to have a warm relationship with him, go get help, get professional support. If you have a name for the thing that makes you unable to connect with your kid, it'll benefit you.", "There's a lot of INFO missing, and unfortunately I imagine it wouldn't make you look good.\n\nYour son is obviously capable of and willing to get parental affection, but at an age kids start to figure out their parents' faults, he chose to no longer recognize you as such.\n\nIt's very sad, and I know it hurts and I'm sorry for you. But... experience says there's probably a lot there to unpack.\n\nAlso, using \"despise\" to talk about your son's behaviour, thinking he said something that's likely very natural for him just to spite you, the crying that nobody felt compelled to take seriously and complaining about the loss of the small child who didn't know you could do anything bad are classic narcissistic traits. I recommend you look into that.", "Question: You say you've always despised this and that your son refuses. Did you ever explicitly raise this issue with your son to share how you feel and ask to be called mom and dad?", "INFO: Has your son previously accused you of emotionally manipulating him?  Have you emotionally manipulated him?  And to be clear, that means using your emotions to get him to change his mind?  \n\nHave you previously been less than supportive of him? Your son is gay, would he have reason to think that you were homophobic or not supportive of his sexuality?  \n\nThere's a lot of missing missing reasons here.", "INFO: You must have discussed it with him before, why does he refer to you both as Sir and Ma'am?", "I'm going with YTA because there's clearly a reason your son doesn't like you, and I'm guessing it's probably due to homophobia or something\n\nEdit: spelling", "Missing … missing missing reasons 🎶🎶🎶", "Cannot rule without the whole picture. I think that your emotions are genuine, but you have purposefully excluded your son's perspective which is highly suspect.", "Need more info. What happened to cause your son to stop calling you mom and dad?", "YTA. I'm sure your sweet boy told you many times why he doesn't see you as his parents but that you ignored. Missing missing reasons all over the place.\n\n>No one offered to comfort me for a while\n\n[Stare at the camera]", "YTA there are some glaring omissions from your post, especially why he calls you by your first names. Based on how calm and articulate you describe him being, I don't believe that he's refused to ever give you a reason, so either you've ignored him, are denying it, or don't want to tell us.\n\nEveryone's response to your tears makes it clear that it's common behavior for you, since no one expressed any surprise, which makes it very much sound like your son is right that you use tears to manipulate. Unless you can give a clear answer for why he has distanced himself from you, I'm going to conclude that it's because of something you and/or your husband have done.", "Yeah… outside more info im going to guess YTA here because your child doesn’t refuse to call you “mom” for 20 years without a good reason. \n\nAlso, (maybe this is personally triggering for me why I see an issue but…) \n\nIs it your son’s partner, or husband? Cause you keep using the term “in-laws”, but refer to your son’s “partner.” \n\nNot that both can’t be true, but it does make me question just how queer-affirming you are…", "INFO : What part of the story are you omitting? If your son is affectionate towards his in-laws but not towards you, it means that he is at least able of filial affection towards someone just not towards his bio parents. What did the bio parents do to him? Why did no one offered to comfort you until someone felt awkward enough to step in?\n\nYou say you don't know what happened to your \"once sweet little boy\" and it's either true (meaning that you're so self-absorbed, self-centered, narcissistic, abusive, negligent and/or other that you really don't know what you did that might affect his affection towards) and you need to figure it out in a way that respects your son's boundaries or false and you can stop the pity party.", "Welp, this is a dysfunctional family situation, isn't it?  And it sounds like your son got what he wanted.  There's so much that's left untold, but there are hints, like you expecting someone to rush to comfort you when you make a scene (again), while your husband runs for the exit.  I suspect everyone sucks here.  \n\nThe best you can do is be glad of seeing your son, wish him well, and get some couples therapy with your husband when you get home to start untangling the past few decades of your life.  You'll likely all be better for it.", "YTA clearly there’s a reason he doesn’t call you mom.", "You're clearly leaving something out and I'm assuming it's lots of something based on a few things in your post.\n\n>I just don’t know what happened to my once sweet little boy.\n\nThis here? Where you tried to emotionally pull at the reader? You do that a lot with your husband and son? I'm sure you do based on your family's reactions. It's probably a big part of why he told you stop or leave. I feel like you were probably just trying to guilt trip your son and he sees through your BS. YTA.", "YTA so by your very sparce comments your husband insisted your children call you sir/ma'am and that you were controlling because his answer that he gave you despite it not being 'a true answer' in your opinion is that he called you that because you couldn't control what he said, also the crying being manipulative thing your son hinted at seems in my opinion something you have a pattern for doing which makes him immune and even tired of it", "YTA. You and your husband pretty much did this to yourselves. You pushed him into a place where he no longer saw you as \"mom\" and \"dad\", simply as authority figures. You drastically altered his perception of his own parents and he reacted accordingly. It sounds like his in-laws treat him like a son, why wouldn't he call them mom and dad?", "YTA. YOU need to take a look in the mirror and think about how YOU affect YOUR relationships. This is not all on your son. Stop playing the victim and start thinking about how you may have been emotionally unavailable to him over the years or whatever it is that’s made him not feel close to you.", "YTA. You left out all the reasons he calls you by your first names. He's not a little boy anymore. You and your husband obviously did something bad to him and that's why he distances himself from you now. You're just desperate to make yourself look like the victim but you're not.", "Not enough info for me", "Most people try to step away when they feel emotionally fragile. It's a vulnerability thing and that awareness how our response may not be appropriate in light of an action that wasn't toward us. So you waited around for comforting and your husband fled from your display... There is a wealth of information missing here.", "Yta. I can smell the narcisistic, manipulative person you are. You intentionally left out so much history for this to be judged in any neutral way. You're here to get attention.", "There’s a reason he doesn’t see you as “mom” and “dad” anymore. You both did something to sever or poison that relationship 20 years ago and he’s not over it. \n\nI’m 99% sure he did not call his in-laws mom and dad in front of you to rub it in. That’s just how he refers to them and it was natural. \n\nYou reacting that way may have been a natural response on your part. \n\nThe problem is that you have obviously done nothing to heal the gaping wound that already exists between you and your son. Until you do that, he doesn’t want to see your tears, doesn’t feel sorry for you, and is very suspicious of your motives. \n\nEven your husband can’t stand to be around your displays. \n\nYTA", "YTA. My mother is exactly like you. When I was a child/teenager, she cried and had emotional outburst for the most ridiculous things (like 10 years old me forgetting to wish her a happy wedding anniversary). It was my role to manage her emotions and calm her down. These tactics get old very quickly.I wouldn't be half as nice as your son if she pulled that shit on me.", "YTA. You and your husband forced your kids to call you “sir” and “ma’am” instead of mom and dad growing up, as an archaic way to show manner? And you are surprised?\n\nSo many missing reasons. And I won’t be surprised at all if abuse is the top one.\n\nYou failed as parents and are now reaping what you sowed.", "\n\n>\n\n>It would be silly to be so formal in every instance, but if we asked one of our children a question or to do something my husband wanted them to say “yes/no, sir.” All of my children addressed me as “mom” to get my attention, or to introduce me to their friends, or in other regular situations. My other two children still address me as “mom,” he’s the only one who doesn’t.\n\nInfo: Did you do something to change your husband’s mind and manners when he chose to bring his work persona home to his own kids, treating them as subordinates instead of young, developing humans? Or did you just also nod to your husband, “Sir, yes, sir,” and let him command his own children and exert a hierarchical structure in your shared HOME?", "Every person I’ve ever known who refers to their parents by their first names have always either had significantly dysfunctional relationships with them, do not respect them, or do not view as parents in any meaningful way.", "YTA - im sorry but this does sound overly dramatic, they’re just names.", "Son is either a shitty person or there's a missing reason.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy son has been referring to us by our first names, or otherwise sarcastically as sir or ma’am, since he was a teenager and it is something I have always despised. I hoped he would outgrow this phase but unfortunately it has been a habit of his for over two decades now. My husband and I are at present on a cross country trip and have stopped for a few days to visit our son and his partner.   \nWhile we were present, they were discussing plans they have with his partner’s family who live in the area. My son asked his partner to “let mom and dad know we’ll be over by 3pm on Monday” in reference to his partners parents. At first I was in a moment of shock before the wave of emotions overtook me and I started to cry. No one offered to comfort me for a while, before my son-in-law asked me if I was okay or needed anything. I decided to be open with them and explain how it hurt me that my own son refuses to call me “mom” but will happily do so to someone else. I feel like he even made a point to do so right in front of me. Meanwhile my husband just decided to step outside because its overwhelming for him when I cry.  \nMy son just asked me to calm down, and even felt it necessary to tell me I could either collect myself or otherwise we were free to leave. He seems to think I was so emotional as a ploy to manipulate him, rather than and honest display of how I feel. I just don’t know what happened to my once sweet little boy.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Your military household had your military-headed son calling you sir and ma'am. He never stopped. You heard him call his in-laws mom and dad and it hit a nerve with you. It's possible that your emotional outburst was a little extreme, if he told you to collect yourself or leave. OR he's a cold person who doesn't respond well to emotions. You and your husband might have raised him to be that way. Or maybe the military kicked that into him. \n\nAt any rate, I'm not willing to call you the AH. I think too many people on here are assuming that his childhood was terrible because of some words he said as a teenager about you being controlling. OR maybe you were horribly controlling parents. Sometimes military households have a lot of rules. You know better than we do. You must not be the worst ever, because he still allows you to visit his household and hang out with his partner. \n\nSo try to suck it up. Your son may never call you mom, but you still have a relationship. Open and honest communication is important, and if you burst into tears, it looks like both your husband and your son cannot deal with it. So it does you no favors. Try to enjoy your time with him and your partner. And take all the hate you've gotten on this thread with a grain of salt. \n\nI'm a mom of sons, too, and I expect they don't think I did everything perfectly, but they still hang out with me, too. So spend some time with your son. Apologize for crying and wrecking the vibe--tell him you love him and his partner and appreciate the relationship you have with them.", "Well it's a testament to your suckiness...I would never ever let my kids call me by first name", "YTA for lack of insight and lack of willingness to consider that someone else may be right. Have you & husband been assholes to this kid since they were a teenager? (See? Even a total stranger knows to use a neutral pronoun, is this significant here?) Do you usually use emotional ploys to manipulate people? We are missing a huge amount of information, but have plenty of your drama.", "Nah. You might have reasons to be upset (regrets perhaps) but he might be also just repeating something his wife says. If wife calls them mom and dad, he dies too. It's like calling your own parents grandma when the grandkids start doing it. Could be a possibility and maybe your taking it out of proportions.", "ESH. Your son purposely provoked you. You gave him the reaction he wanted. You both made a scene. Your husband didn’t stand up for himself as Dad, much less you as Mom. You are angry at your husband, son, and son-in-law for not helping you manage your own emotions. ESH. \n\nI’m guessing there’s a lot more dysfunction at play here than you’re willing to admit.", "NTA this is your son treating you like a non parent (occasionally my oldest does that but yeah he needs to realize his partners mother didn't birth him)", "You should have stopped him when he addressed you folks by your first names, but you allowed it to carry on for years. Your son is rude and inconsiderate. If I had a son like that I would cut him out our lives. He’s the AH.", "NTA", "NTA. Cut him off. He dgsf about you", "NTA If he couldn't call me mom, I wouldn't answer", "There is a reason your son doesn't call you Mother and Father, and you're not sharing it. Why. Share with us then maybe we could give a verdict but as it is now, no. Children do not do this and you know exactly what you did. The title of parent is something that is naturally given and has to be actually torn away and it doesn't sound like you did the tearing. It could be big things, it could be a series of small things, but they all tear away at the bond. Fess up and we will decide if we feel sorry for you. Edit INFO", "Info: when you asked him why he doesn’t call you mom, what did he say?  And did you apologize in a genuine manner?", "NTA. There’s a lot of projection here in the commente. But at a basic level, is it ok to feel emotional about your son calling someone else the titles of endearment you have always wished for? Yes it is. Is it productive? Maybe not. You need to have a deeper conversation with your son about why he feels this way.", "Maybe you shouldn't have treated your gay son like shit when he was a teen huh? Ever think of that? YTA BIG TIME.", "Missing reasons.  INFO tell me the missing reasons.\n\nYTA or your husband is most likely both.", "Now that Ive read all the comments Ill just sit here and wait for further trickle truthing,  actually no need to wait, YTA", "Seconding the INFO requests: I feel like there’s something you’re not telling us. There’s probably a reason for the fact that your son latched on to his in-laws as parental figures rather than yourself and your husband. \n\nI understand feeling upset that your son doesn’t refer to you as mom, but ultimately if you were carrying on crying “for a while”, it does come off as manipulative.", "There is obviously some reason that he doesn't call you mom and dad. What the hell did you guys do to him? Even if you add more details I refuse to believe that he sarcastically calls you anything that isn't your fault. Children don't just turn on their parents. I will assume that you were horribly controlling? Mean? Army like? \n\nPerhaps you should be grateful that your son has found a family who treats him well.", "YTA.  This injury is self inflicted.", "Stopped calling you mum and dad as a teenager and then moved across the country - INFO - how did you react to him coming out? Did the words ‘you are not our son’ or some variation come out of your mouth?", "How did your title get demoted? Sounds like you have some things to talk about with your son and you need to listen to him and be empathetic. There’s a good chance that you did him wrong when he was younger and that’s why he can’t bear to call you mom and dad.", "Her saying that no one “offered to comfort her” and even her own husband stepped outside because he finds her crying “overwhelming” says a lot.", "There’s gotta be SO MUCH MORE to this. I’m betting it has to do with how they treated their gay son as a teen since that’s when it started", "Yeah I won't say YTA... But I'd wager on it\n\nETA nah YTA for sure actually after reading OP's comments.", "My first thought\n\nWhat are you hiding lady? 👀 Tell us, we need more than that.", "Bingo.", "I knew this was going to be top comment lol", "I’m going to go out on a limb and guess OP has no insight into the fact that her reaction was over the top and that she handled it poorly, which I would venture to guess is part of the problem. \n\nIf son was chronically exposed to this behavior growing up (eg, made to feel responsible for calming emotional outbursts), which seems likely since he asked her to get it together or leave, and since she mentioned he hates it when she cries, it’s likely he became a “parentified” child, and has zero patience for continuing to allow himself to be forced into the rescuer role as an adult. \n\nOP, there’s a lot of information missing here, be it by design or due to lack of insight. It’s understandable to be upset if your kid doesn’t call you mom, but blowing an off the cuff remark about the parents in law that could have meant any of 100 different things out of proportion and forcing the whole family to deal with it instead of regulating your emotions and privately discussing it with your son at a more appropriate time was a YTA move, short of more info. Sure, maybe son’s a heartless jerk, but that isn’t really coming through in what was provided.", "Exactly! Lol a lot of info has been left out", "[OP eventually admitted](https://old.reddit.com/r/AmItheAsshole/comments/15gs7ga/aita_for_crying_when_i_learned_my_son_calls_his/juklktj/) that her husband told him to do that:\n\n>That was something my husband insisted on with our children to help them learn manners. When we would ask out son to not call us by our first names he would revert to that, knowing full well we couldn't claim to be upset with him over it.", "Well said, DeliciousKitty!", "👏🏻👏🏻👏🏻", "Yes I have asked him before. When he was younger, though, pressing the issue only made it worse. That's just how teenagers are, I figured. However I haven't brought this up much with him in adulthood. He has spent a lot of time all around the globe and I feared for his safety and figured it was best for me to not bring up certain topics so he would continue to call me when he was able.", "Yes he is gay but that has never been an issue for us. As a mother I just always knew, especially when his first crush was Peter Pan. I always did my best to outwardly show support for the GLBTs so he would know I would support him when he was ready. He was always the hardest on himself, though, I think he felt he had something to prove to himself. Really I think that's why he put so much into JROTC and his career because it clearly wasn't for his father.", "That was something my husband insisted on with our children to help them learn manners. When we would ask out son to not call us by our first names he would revert to that, knowing full well we couldn't claim to be upset with him over it.", "You said it before I could. Had a pretty bad mom who: took favorites, never got braces as a kid when my siblings did, her saying I love you and hugs were literal years apart, but verbal abuse was decently common(almost daily if you include subtle remarks) biggest one was when my dog got cancer and said she couldn't believe it. Mf I had cancer", "They are married but I've never heard my son say husband, only partner. I've merely been trying to use the same language he does to not cause offense.", "Heh, you aren't the only one who noticed that. I'm reserving judgment on it since OP may just be garden-variety overbearing and emotionally manipulative, but it made me wonder", "Keep reading her comments. Plenty of missing reasons. Amazed son hasn’t kicked them to the curb long ago.", "Why are you making it weird lol assuming what someone’s kids pronouns are", "I'm sorry, but do you know us? This is our youngest son I'm writing about, so yes I am using the correct gender words to refer to him. It's our middle child who is nonbinary and uses they.", "The son is a gay man. OP and her husband forced military protocol about addressing others in the home.", "Lol, OP commented that she and her husband made the kids address them as Sir and Madam. They're getting exactly what they asked for.", "Don't worry, he can call them Sir or Ma'am like they forced him to do when he was younger. Maybe he only sees as parents people who he actually consider his parents", "Did you consider that maybe if you had parents like them, you would cut THEM out of your life? \n\nAnd that's kinda what the son is already doing, he emotionally distanced himself a long time ago, and when she expects to be comforted for making a scene, he sets his boundary of not letting her manipulate him. \n\nA sweet baby boy that was raised so well as OP says, don't start randomly disrespecting his parents without reason. \n\nBut it's pretty convenient for OP to say she just doesn't know why.", "I'm betting there is a whole lots of reasons that explain why the son doesn't want to call them mom and dad 1nd wouldn't make him NTA", "lol it seems it's him who already cut them off (at least emotionally) a long time ago but go on, they would be making him a favor.", "Well the parents are the one that forced him to say sir and ma’am instead of mom and dad. Actions —-> consequences", "Accept, her son-in-law did offer to comfort her, which she totally seemed to ignore.\n\n>  before my son-in-law asked me if I was okay or needed anything.", "We distanced ourselves from him and now he's distant. Surprised pikachu face.", "how do we know he's gay? genuinely confused, where does it say that?", "I just checked up on all of OPs comments.\n\nI am still not sure she is telling everything.\n\nShe clearly was upset with her husband's demand to be formal like in the military. But she seemingly did nothing about it. So she let the issue escalate into something bigger. She could have stopped this long ago, but never did. Her husband/family seems to have gotten used to her emotional outbursts to a point where it's just an annoyance to them. Especially for the husband. Their marriage doesn't seem very healthy.\nAnd I might be wrong there, but it sounds like the son and father had/still have a very difficult relationship. This seems to have caused some alienation between the son and his parents. Which then also extended to the mom because she was weirdly inconsistent with how to deal with her husband's at home military behaviour.", "Applause indeed!", "So what was his answer?", "So it sounds like it’s time to ask again. Assuming you actually want to hear the answer, because I have a feeling you’re not going to like it…", "> Really I think that's why he put so much into JROTC and his career because it clearly wasn't for his father.\n\nWait, was your husband in the military?  Did he order and command your son around?  Instead of just being a father?  Is that why your son calls you sir and ma'am?  \n\nYou know why your son stopped calling you mom and dad as a teenager.  That's the issue, and it's not going away.", "\"The GLBTs\"????????? I'm really side-eyeing you on this one (and all the rest of it, but...um...🤨)", "YTA. It sounds like you raised him like he was in boot camp and are now upset he keeps you at arms length. What did you expect to happen? He was your child not some cadet. I don’t blame him for keeping things formal. You and your husband set the tone for this relationship.", "My father tried that too. Also military. But MY mom stood up to him told him that was ridiculous and she would always be “mom”.\n\nYou asked for this, so this is what you get.", "Hahahahahahaha. YTA. So much.", "Here's the very first of your missing reasons. You were never \"mom and dad\" to begin with, so I don't know where you get off crying about it, now. YTA.", "Sounds like this is your and husbands fault then", "Right. Crucial info that you deliberately left out of your post.\n\nYou ALREADY KNOW WHY he calls you that, so WHY are you holding it against him now. YTA\n\nI bet his new parents are nicer to him than you and your husband ever were", "Finally, the truth is out!  Your husband asked your son to call you guys sir and ma'am.  And well, he's just respecting his CO's orders, isn't he.  You got a problem with that?  Take it up with your husband.", "And after this outrageous power play on your own children, you're surprised one of them still harbors resentment?", "So did he ever call you mom and dad?", "YTA.\n\nLeave it alone, he’s an adult. If he chooses to call you by your first name or surname or sir and ma’am (as you yourself forced him to do when he was a child) that’s his right. So long as he doesn’t refer to you with slurs he can use all 3 option. There is no law that forces him to call you mom and dad.", "LMFAO I am not sure why you had to make this post when the YTA is this clear.", "[deleted]", "Fair enough, that is a good metric to use", "So you have never asked or talked about what he prefers you say when referring to his husband?? Gotta say, if you don’t know your son well enough to have honest conversations and instead playing copycat to avoid offense, well you probably aren’t close enough to be called mom. \n\nYou are treating him like a polite acquaintance. Why are you expecting more from him?", "OP literally commented about it right [above](https://www.reddit.com/r/AmItheAsshole/comments/15gs7ga/aita_for_crying_when_i_learned_my_son_calls_his/jukr3eu/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=1&utm_term=1&context=3) you. The only other comment in this reply section.", "OP says son-in-law tried to comfort her", "OP mentions her son-in-law asked if she was OK. Since there is no mention of any family being prese t besides the son and his partner, the son-in-law must be the son's parter.", "he's married to a dude. it's in the post.\n\n>My husband and I are at present on a cross country trip and have stopped for a few days to visit our son and his partner. \n\n>my son-in-law asked me", "Agreed, this is classic Missing Missing Reasons.", "He was a teenager then, he never gave me a true answer. My husband feels he was just struggling with the expectations of him as a young man.", "As a military kid myself, I wouldn’t be surprised at all if husband literally told son to call them sir & ma’am and that’s how they ended up here.", "Yes my husband was, and so was our son. Clearly we impressed good values upon him, even during his teenage rebellious phase, and he's had a good career and is now himself retired.", "I'm glad I'm not alone on that.  \n\n\nAs someone who also called their parents by their first name, OP knows damn well why her son does that. She just thought Reddit would be easier to manipulate.", "Narcissists loooove weaponized incompetence.", "Yeah, she can get JROTC, but stumbles over the “GLBT”… maybe a typo OR it says a lot about where the support in this family really gets aimed at.", "I did always stand up for my children so they didn’t have to grow up too fast. I was the one who stood up for my son when he decided to decline the USNA, and while my husband was disappointed at the time he’s now very proud of everything our son has accomplished while enlisted.", "Yes of course. It would be silly to be so formal in every instance, but if we asked one of our children a question or to do something my husband wanted them to say “yes/no, sir.” All of my children addressed me as “mom” to get my attention, or to introduce me to their friends, or in other regular situations. My other two children still address me as “mom,” he’s the only one who doesn’t.", "Uh, that wasn't a jab at me yeah? Seeing as it seems to be at OP but a reply on my comment", "This", "ohhhhh i see now, i'm horrible with family tree stuff, thank you!!", "You're deflecting. What was his answer?", "Not a \"true\" answer? Or not an answer you wanted to hear. Because every time I've heard a parent loudly bewailing how their adult children are distant from them and they \"have no idea why\", it turns out the childen have laid it all out in the open many times and their parents deny it and refuse to listen. You know why, he's told you, you just don't like the answer", "\n\n>Clearly we impressed good values upon him\n\nIf you believe you’ve raised your son well, then I trust he knows what he’s doing and why he’s calling you the way he does. Your story is incomplete. You can’t put missing pieces away.", "Interesting the questions you choose to answer, and which you choose to ignore.  \n\nI'm done hunting for your missing missing reasons.  YTA\n\nEdit, and [OP finally admitted i](https://old.reddit.com/r/AmItheAsshole/comments/15gs7ga/aita_for_crying_when_i_learned_my_son_calls_his/juklktj/)t, her husband insisted that the son call them sir and ma'am:\n\n\"That was something my husband insisted on with our children to help them learn manners. When we would ask out son to not call us by our first names he would revert to that, knowing full well we couldn't claim to be upset with him over it.\"", "Did your husband demand for you both to be referred to as sir and ma’am when your son was growing up?", "Clearly you've made him miserable, since he doesn't even consider you his parents", "For real! I was like whaaat......", "That’s great! But that doesn’t seem to be an issue here. What did you say when your husband taught him to call you “ma’am”? Did you say “no, I’m mom”?", "It would be silly to call your Dad sir in any instance", "This isn't your son's fault.  Stop blaming him and stop being so dramatic about it.", "Ooof. You weren't running a military school, you were trying to raise children. Y'all fucked up.", "You can reap the seeds you have sowed.", "Yup. That was for op. So sorry. I’ll see if I can stick it under the correct comment. Haven’t had my coffee yet", "Alright well, usually he would say something along the lines of, \"you can't control everything I say\" or just a look with no verbal response.", "OP's answers are the Issendai estranged parents analysis come to life. Like wow what a masterclass.", "Very astute observations.  It seems unfortunate that OP is able or willing to self reflect at this time.", "Yep, that's it:\n\n>That was something my husband insisted on with our children to help them learn manners. When we would ask out son to not call us by our first names he would revert to that, knowing full well we couldn't claim to be upset with him over it.\n\nhttps://old.reddit.com/r/AmItheAsshole/comments/15gs7ga/aita_for_crying_when_i_learned_my_son_calls_his/juklktj/", "Depends on where you're from.   Most men I know say sir to their fathers through regular conversation.", "All good g, I always look for constructive criticism so just checking", "Allow me to interpret:\n\"Along the lines of 'you can't control everything I say'\" = he said exactly why but I don't like remembering why my son thinks I'm controlling\n\n\"Just a look with no verbal response\" = I wore him out and he was exasperated, because I demanded an answer that he had already given except I brushed it off as \"not a true answer\"\n\n\nLook, I'm kinda sorry for you, but I really sympathise with your son a lot more.", "I think you need to look inside and see why your son really started calling you by your name. As it stands YTA because it sounds like you and husband were very controlling and militaristic around your family maybe he finally feels loved and accepted with his partners family, who never had lofty expectations, and it’s easier to just accept their unconditional love.", "Ikr? It's such a mystery why he's distant from them, I just can't figure it out at all /s yikes", "Where are you from? I've never met anyone who calls their father sir and wasn't abused", "Cheers. Thanks for pointing it out tho. Deleted and corrected. And now for some coffee.", "I feel like your interpretation is spot on but she is still leaving out the real answer and this is just part of what he said.", "Seriously it's damn near word for word perfect to the script. Kind of amazing to see such a quintessential case of missing missing reasons in the wild, as it were.", "Guessing you never spent a lot of time in the south.   The difference in acceptable manners were a culture shock when I moved away from there.", "Yes, many questionable practices are quite normal in the south"]}