{"id": 2386, "submission_id": "yw0xwt", "title": "AITA for yelling at my mom about the haircut she gave me and going to my dad's?", "selftext": " I (17F) was recently told by my mom that I should schedule a hair appointment because the ends of my hair were getting really split. I called and they told me they were basically all booked for the next month due to someone needing a surgery and having to move appointments around.I told my mom that and she said she could do it, and I kinda decided why not, I guess it’s good to not have a fuckton of split ends.\n\nSo she set up a chair and got the scissors and shit, and began doing her work. I was scrolling through Instagram but after the first two cuts I noticed there was a massive amount of hair on the floor. I asked her why there was so much hair on the floor and she said my hair was really damaged.\n\nI got up and looked in the mirror and she had cut it at basically my shoulders (for context, my hair is basically to my ass). I asked her what the fuck she was thinking and she just repeated that it was damaged like some sort of malfunctioning spam call program.\n\nI looked at a few chunks of undamaged hair in the mirror and there was 1, maybe 2 at most inches of split ends. I asked her why in the everliving fuck she had basically cut off 2 feet of hair for no reason and she now said “I accidentally cut off a bit too much”.\n\nI pretty much had to let her finish because there was already too much gone to do anything else about it, so she kept cutting and then claimed she had “made it uneven by mistake” so she took even more off.\n\nIn the end, I was left with basically a bob cut at my chin. I was pissed as hell so I grabbed my school shit and a few clothes and drove over to my dad’s house. About an hour later, my mom came over to pick me up and take “her” car (my parents split the payments with me 50/50, so she doesn’t own it) and told my dad “it’s her custody week and she’s just being a typical upset teenager”. My dad told her to go home or he was going to call the cops, so she left, but I got a nasty text which summed up to “I tried to do something nice for you and in return you violated your custody agreement with the car I pay for.”\n\nI told her I would be more than happy to go back to her house if she cut her hair like mine (she also has really long hair) and she refused, so I’m just gonna stay at my dad’s for the time being.", "created_utc": 1668527349, "permalink": "/r/AmItheAsshole/comments/yw0xwt/aita_for_yelling_at_my_mom_about_the_haircut_she/", "score": 3028, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I yelled at my mother and violated the custody agreements by going to my dad's house on my mom's time. I also used a car she pays for a part of.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Clearly NTA. Cutting off 2 feet of hair is no accident. It was deliberate.", "NTA at all. I truly don’t understand how someone can accidentally turn a dead-ends trim into cutting off 2 feet of hair. And then she’s just going to stand by her actions? While saying she wouldn’t want the same thing done to her hair? I hate to say it but this seems intentional. Your mom needs help.\n\nNinja edit: FURTHERMORE you said you noticed the large amount of hair on the floor after 2 cuts? So in the first 2 cuts she took it up to your shoulders. There is no way this wasn’t on purpose. I’m so angry for you.", "NTA, it wasn't a mistake she cut that much off. Never let a parent cut your hair unless you want a buzz cut or they're a stylist/barber.", "You asking her to butcher her own hair like your own is the most inspiring thing I have read today! NTA! I am so sorry for the loss of years of hair growth! That's traumatizing.", "NTA, cutting someone's hair without their permission is considered assault in some places. It's different with a parent and a child I think, but the same concept still follows. She violated what you wanted and she said she would do, and it's not a small mistake either, it will take you years to grow back what she cut off. The fact that she even tried to be upset at you over it is astounding, even if we ignore the fact that she literally went to her ex husband's house and tried to take your car.", "Sounds like you're entitled to be annoyed with your mother, and she's just trampled all over your boundaries without so much as a by-your-leave.\n\nShe really didn't \"try to do something nice for you\" if she cut off two feet of your hair when you were expecting her to trim the ends.\n\nNTA", "NTA. Unfortunately this seems like jealousy and some other unresolved issues. Your hair is an extension of yourself and she took it upon herself to literally chop up your trust in her by cutting off all your hair and worse being unapologetic about and petty. Glad your dad is there for you and in the mean time they make amazing extensions for affordable prices now if you need some camouflage, I had a bad haircut from a salon and had to do this.", "First off, you, the child, cannot “violate” the custody agreement. It is between her and your father. In fact, based on your age, you likely have the power to adjust it to your liking, at this point, were it ever to be addressed in court.\n\nSecond, find out in whose name the car is, because I have a feeling this will not be the last time she declares it “hers” and tries to manipulate you with it. See if it can be in your father’s name only.\n\nThird, let this be a lesson to you as you enter adulthood. Adults make mistakes, and the mature ones own up to them and apologize. Mature adults also respect autonomy. You would have lived with split ends for a few more days. You will live now, and your hair will grow back, but the point is she didn’t need to “solve the problem” then and there. She should have stopped when she realized she was out of her depth and let you get evened out by a stylist/barber.", "Sounds like she didn't like your hair being that long and took the opportunity when it presented itself.\n\nNTA", "NTA. If I had fucked up my daughter's hair and hurt her feelings I would feel so guilty I'd be sick. I would be apologizing and offering to get a matching cut immediately. It makes me feel like crying even thinking of doing something like that. I don't know what your mother is thinking, or what she may be going through, or what your relationship is like, but I can tell you nothing you could have done would deserve this. I'm so sorry, I hope you come to love your new cut and that you get the apology you deserve.", "NTA. You asked to cut of some ends, not 2 whole feet. As someone with long hair I could not imagine losing all of it from my ass to my shoulders.", "NTA\n\nFirst off, fuck the custody agreement. She sounds like the type who would be thrilled if you left your dads house early if he ever some way violated your trust or privacy. Best part here is when you offered her a taste of her own medicine and she was like “What, no why would I want my hair to look like yours?”", "I'm a hairstylist and I would never do this to my kids! They have asked but I refuse. Now color yes. She did it on purpose. NTA. I would ask your dad to talk to his lawyer about it.", "NTA. That sounds like she definitely did it on purpose.", "NTA, she did that on purpose so stay with your dad. What she did is a form of abuse/ assault.", "NTA. She did it intentionally", "NTA\n\nStay with your dad. \n\nThe car complicates the situation with your mom. The name on the title determines ownership, not who makes the payments. If your moms name is on the title, legally she can take that from you.\n\nIf you trust your dad, this could be a good time to get the title of the car sorted out so that he passes it to you when you turn 18. \n\nYou may need to get the courts involved now to show that you are staying with your dad and to force her to put the title in your dad's name.", "NTA, and I like your potential resolution of your mother getting a similar cut; it's telling that she refused. There was no kindness in her cutting your hair.", "NTA, with that much hair and how much she cut there's no way that was an accident", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n I (17F) was recently told by my mom that I should schedule a hair appointment because the ends of my hair were getting really split. I called and they told me they were basically all booked for the next month due to someone needing a surgery and having to move appointments around.I told my mom that and she said she could do it, and I kinda decided why not, I guess it’s good to not have a fuckton of split ends.\n\nSo she set up a chair and got the scissors and shit, and began doing her work. I was scrolling through Instagram but after the first two cuts I noticed there was a massive amount of hair on the floor. I asked her why there was so much hair on the floor and she said my hair was really damaged.\n\nI got up and looked in the mirror and she had cut it at basically my shoulders (for context, my hair is basically to my ass). I asked her what the fuck she was thinking and she just repeated that it was damaged like some sort of malfunctioning spam call program.\n\nI looked at a few chunks of undamaged hair in the mirror and there was 1, maybe 2 at most inches of split ends. I asked her why in the everliving fuck she had basically cut off 2 feet of hair for no reason and she now said “I accidentally cut off a bit too much”.\n\nI pretty much had to let her finish because there was already too much gone to do anything else about it, so she kept cutting and then claimed she had “made it uneven by mistake” so she took even more off.\n\nIn the end, I was left with basically a bob cut at my chin. I was pissed as hell so I grabbed my school shit and a few clothes and drove over to my dad’s house. About an hour later, my mom came over to pick me up and take “her” car (my parents split the payments with me 50/50, so she doesn’t own it) and told my dad “it’s her custody week and she’s just being a typical upset teenager”. My dad told her to go home or he was going to call the cops, so she left, but I got a nasty text which summed up to “I tried to do something nice for you and in return you violated your custody agreement with the car I pay for.”\n\nI told her I would be more than happy to go back to her house if she cut her hair like mine (she also has really long hair) and she refused, so I’m just gonna stay at my dad’s for the time being.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. First of all I want to say I'm so sorry this happened to you even when you plan to cut off a lot of hair it can be so traumatizing but what your mom did is just downright cruel. My father did this to me when I was young because he didn't like the color of my hair took me to the hairdresser told me we were getting it trimmed I end up walking out of there with just a couple of inches of hair like a pixie cut I think I cried for a week! I can't believe she did this to you and it unfortunately seems intentional I don't blame you for going to your father's at all but for what it's worth I'm sure you look great either way and I saw someone mention extensions which really can look real and help with your confidence while your hair grows. Good luck and sorry your mom sucks the fact that she refused to cut her hair the same way speaks volumes Mom is the only ah here.", "INFO: had she mentioned any complaints about your hair pre cut? Were you both in any conflict beforehand?", "&#x200B;\n\nI can definitely understand your frustration because our hair is part of what defines us and makes us feel beautiful.  Losing your gorgeous locks is a sudden change that you were just not ready for and your mom was out of line in cutting that much off.  She should have known you wanted just a trim, and perhaps an in depth conversation beforehand would have helped.  Every mother around the world has made this horrible decision to cut the hair of their child, and most of the time it is a horrible idea!  Mine used tape to mark a \"straight line\" and used old scissors from a dirty junk drawer that were NOT sharp, but hey...it grew back!Cool off a bit and hang with dad and then look at some photos online on some style ideas.  You might be pleasantly surprised at how sexy shorter hair can be and how fun and easy it can be to manage!  It brings out some lovely features!  Make that appointment at the salon to fix it up a bit into a style that suits your pretty face and go pick up some mousse and hairspray and have some fun!", "ESH. Lot of judgment calls on all sides. But maybe she did a mistake with your hair. As a not professional in the hair cutting business i can only say it is hard to do evenly and right. Also your dad threaten to call the cops is an interesting move. You are understandably not happy but your mother tried. Also you demanding her to let a professional cut her hair short isn't really the best move and makes a bad impression on me. If you really KNOW she did this with intent you should have written it that way, but it seems to me like an amateur cuttin hair and doing a bad job.", "Maybe MAYBE if she had cut 1-2 inches off, realized it was crooked, and then tried to fix it by cutting off 1-2 more, that might've been a genuine mistake.  But going from her butt to her shoulders was clearly deliberate.", ">Never let a parent cut your hair unless you want a buzz cut or they're a stylist/barber.\n\nOr even if they are. My mom used the opportunity of cutting my hair to engage in experimentation, so a lot of times at the end I just shaved it all off.", "This. A friend of mine’s father forced him to get a buzz cut as a child, and even 40 years later you could see the pain it caused him when he talked about it. My nephew had long hair all the way through elementary and middle school. His mom said as long as he kept it clean, he could wear it however he wanted.", "That was not an accident", "She's 17 so leave the word sexy out point blank. And no,no decent mother would butcher their child's hair like that, it's not just hair to alot of people,the mother did that on purpose to hurt her child, ops NTA the mother is a huge one.", "Hair clear down to her waist to a bob under her chin is a HUGE \"mistake\" to make.  If she's THAT bad with scissors, she should never have had them in her hands at all for fear she'd cut off her own fingers.", "\\*shrugs\\* as an amateur i can only say it is hard. Also threatening with the \"call the police\" and hatin each other seems so much better in the long run...", "Cutting one or two inches, realizing it was crooked and then cutting one or two inches off is much different than chopping it clear to her shoulders on the first couple cuts.  And I say that as an amateur that has cut my family's hair before.  You can always take more off, you can't put it back on.", "NTA your mom sounds jealous of your hair to me. You and your dad can go to court and get custody change your old enough now to choose.", "NTA - There was a post similar to this yesterday. I have no idea why parents think just because they can pick up a pair of scissors that they can cut hair properly. I’m so sorry this happened to you.", "NTA Wow!  That was deliberate and such a shitty thing to do.  Then she demands \"her\" car back.  Your mom needs professional help.", "NTA but honestly ask your dad if he would be willing to go to court to change custody plan, your old enough to have this be your choice, and hay she did was traumatic and deliberately done,", "Is she jealous of you by any chance? This is not an accident. NTA.", "There is no other salon near you so your mom had to do this? She manipulated you for some reason. NTA.", "Goooooosh, I know this isn't what you'd want at all, but the idea of you going to a salon, getting a tight fade under a wolf cut, lift the remaining, and dye it like....green.\n\nNTA", "NTA\n\n&#x200B;\n\nGo back to court and see if you can stay 100 % with your dad, and never go back to your abusive mom.\n\n&#x200B;\n\nDocument everything.", "I'm petty, and very protective of my hair.\n\nOnce, my mother gave me a bad haircut (and she was a hairdresser). I didn't speak to her for 3 weeks and wore a cap or a hat for months, everytime I was out of my room. She never touched my hair again (I was 15, now 40)\n\nIn your case, I would not have contact with my mom until my hair has grown back to what it was before the cut. Thrust has been broken and it is not something that is easily repaired.\n\nBut like I said, I'm petty AND stubborn. Feel free to do what's best for you.", "NTA.  Taking off a couple of inches would have been all that was necessary.  Even if she cut off 4-5 inches, it wouldn't have been too bad (considering how long her hair was), but to take off 2 feet wasn't an accident.  This was done on purpose.  No wonder OP doesn't want to be with her mother at this point.\n\nThe mother was clearly in the wrong here and owes OP a huge apology.", "NTA at all. I'm so petty I'd tell her I'd see her again when my hair had grown out and then just stopped talking to her", "NTA your mother is a massive asshole. There is no way that was an accident. I don't know if she is one of those disgusting people who get jealous of their children but it sure sounds like something like that. She sounds completely unhinged. I'd be worried for your safety if you stay in that woman's house. I would permanently stay with your father from now on and try not to let her be a part of anything including paying part of your car. Do not let that insane asshole have any kind of control over you. This is so off I wouldn't even meet her outside of a public well populated area.", "I  would go back and cut her hair off in her sleep, then move in with my dad full time.", "My spacial awareness and physical coordination are poor. I think I could easily cut 6 inches off in error. For this reason I would never go near anyone's head, and especially not my own child's, with scissors. \n\n2 foot in someone is, I agree, no accident.", "OP pointed out that mother dearest also has really long hair. I bet this was a jealousy issue.", "In the UK cutting someone's hair like this is criminal assault.", "My mother did this to me when I was in college. Talked me into a small trim and then cut my hair to the top of my shoulders. She kept laughing like a hyena and saying \"Whoops\". My hair was so long it used to get caught in my car door all the time. I got so many compliments on it I guess she couldn't stand it. The only thing I could do was act like I didn't even care. She was a mean girl mother.", "If it were truly an accident she would have apologized. That to me she biggest indicator of deliberate action. The complete lack of remorse.", "This. \n\nDuring the first Lockdown I asked my mom to cut my angled bob (she'd done it before with better results than the salon) and she had a brainfart and cut the angles upwards from the back instead of having the back as the highpoint of the cut. Mistakes happen. \n\nBut a whole two foot of hair isn't a mistake. And if it were, she'd have been apologetic from the moment she noticed she was going wrong.", "Should’ve told OP then. Not continued to cut off an excess amount without her consent", "I’m mad FOR the OP. Not a stylist, but I cut my husband, dad, and son’s hair. But I ALWAYS make sure it’s what they want. And if my sister wanted her hair cut, you can bet I’d be YouTubing the heck out of it first. What is wrong with people?", "Hair can be sexy and yes...parents do dumb crap.  My point was not to stay angry, but to make the best out of a super crappy situation.  \n\nI don't know their relationship in general so I can't say if the mother is spiteful and did it on purpose or if she really did think the hair was dead...or if she was jealous of her hair!   Who knows...we don't know much more than what is written here.  I do know that the best way to move forward is to try to make it work...and watch mom with scissors in the future!", "While your advice is practical, the tone suggests the OP \"get over it\" while she takes steps to make the situation tenable. This \"we all make mistakes, let's forgive each other\" mindset only works when the person in the wrong understands and regrets the harm they've caused. OP is feeling angry, hurt, and betrayed by her own mother. The very least a mother would offer is a heartfelt apology, surely?", "Oh come off it, this wasn't an \"oh it's crooked\" issue, it's cutting off **two whole feet**.", "NTA.  Maybe I'm just a spiteful person, but in my minds eye, I see Momma waking up from a nap with much shorter hair.", "My mum did the same to me, she would cut all of our hair when we were kids and the last time I ever let her touch my hair was when I was about 11 or 12. Normally she’d measure it out and do the proper precise cuts but this time she’d been trying to get me to cut it quite short and I’d said no (she wanted it just below my ears - it was down to my mid back and I wanted to keep it long and just take a few inches off). So she pretended to agree, but when she went to cut it she pulled all my hair into a bunch behind my back and then did one big snip and was like ‘all done!’. Even as a kid I could tell straight away that it was wrong, it would be all uneven! At the front my hair was now the length I’d wanted but it was waaayy shorter at the back! I told her and she acted like she’d just suddenly forgotten how to cut hair even though she’d been doing it for us for years, like ‘oh silly me, you’re right, it will be uneven! I’ll have to even it out now.’ So she gave me the haircut she wanted and I had to just deal with it, I couldn’t even call her out on what she did. I hated the look, it took me ages to grow it back out, it was too short to stay in a ponytail which was annoying because I played a lot of sports. I lost a lot of trust in my mum because of that, she completely disregarded what I’d told her I wanted for my body and did whatever she wanted and then lied about it. NTA op, your mum knew what she was doing because even if your hair WAS actually damaged she shouldn’t have cut that much off without checking with you.", "NTA.  This really hit me where I live.  I had a pushy narcissistic mom who was a hairdresser.  Not a great one, she had a shop in our home, and did a lot of women in the community for cheap.  Since she was such a narcissist and had to have her way all the time, she would nag and nag and nag at me until I let het cut my hair.  Worse, she one time chased me around the house, gave me a permanent I didn't want. and when I went to school the next day, people asked what the heck happened to my hair. \n\nNeedless to say, once I went to college, I grew my hair long and only came home for Thanksgiving, Christmas and Easter.  College was 25 miles from home. \n\nI totally feel your pain, and your mom doesn't deserve to ever see you again.", "NTA\n\nAn accident was me using the wrong attachment for the electric razor and cutting my partner's hair half an inch shorter than it should've been. Cutting butt length hair to chin length is deliberate.\n\nDoes your mom ever act like you're in competition with her or something? This seems like she was trying to bring you down in some way idk... like now she is the only one with beautiful long hair... idk I may be reaching here... (btw I'm sure you look great and your hair is beautiful; I just am trying to infer her logic)\n\nSorry she's being this way and I'm glad your dad has your back!", "My mom did the same thing! It sucked. NTA. Lesson learned hopefully. Only go to someone who knows what they are doing.", "NTA\n\nCutting that much off and obviously lying makes her the AH. Even if what she said had been true and it was really that badly damaged then she'd still be the AH for not doing anything about it sooner and letting it get like that. Either way she sucks.", "I know I shouldn't encourage this but I want someone to cut the mom's hair so bad", "NTA. She obviously know how important hair is since she refused to cut her hair like yours. And this is clearly intentional keep going with her “mistake”.", "NTA your mother sounds like a mean girl who never grew up.\n\nAsk your dad what options there are to stay with him full time", "NTA. You can’t violate custody order. If you were in front of judge and told him it was your decision to go to your dad’s, the judge would ask what the problem is. Your mom definitely acted maliciously and I would not go back to her. She really thinks she’s the victim in all of this.", "Yikes. Never zone out with the scissors in someone else's hands. If you only want a trim, TRIM YOUR OWN HAIR.\n\nNTA. This is a lesson everyone learns, usually at a much younger age, but still. Your mom did something awful and won't cop to it. That really sucks. Never give anyone the opportunity to do that to you again.\n\nHas she been wanting to cut your hair for a long time and this was her chance? Jealousy or something, maybe?", "Time for a little old fashioned “Bernice Bobs Her Hair” revenge. NTA.", "Nta, your mom sounds like the typical textbook narcisst and she probably cut your hair bc she wanted to be the only one in the house with super long hair, I would stay forever if I were you", "NTA.  I think what your mother did was deliberate and malicious.  Don't trust her with anything important in future.", "NTA\n\nTell her to waste the money on going to court over custody of a driving 17 year old and see how far that gets her.", "It was deliberate", "Nta", "You should cut her hair while she's sleeping g", "Your mom is clearly jealous of you. I’m so sorry. NTA whatsoever.", "NTA. I would also be furious, if I had a bob cut instead of my long hair.", ">if she cut her hair like mine\n\nOr let you cut her hair", "NTA\n\nThe ‘best’ case scenario here is she was careless, clumsily tried to fix her mistake and lied. Worst, she really is so jealous of her child that she did it on purpose.\n\nIn either case you would not be the AH. She claimed she was doing a nice thing for you (no, she insisted you need a haircut), restored to emotional blackmail and has shown a few controlling behaviours while still not apologising", "This was on purpose.  Nasty thing that as your mother she gets to lie and pretend this was an accident when it was clearly premeditated.  Sorry OP. You're NTA.  My mom did things like this to me. It sucks.", "I got a haircut like this when I was your age. The difference was 1) I was drunk\\* at a party 2) so was the guy I talked into cutting my hair 3) he cut it waist length to shoulders, but it was super crooked so he stopped instead of trying to \"even it out\" 4)my Mom freaked the ever loving out (really loud for my hungover self) when she saw it in the morning and made me call an actual hairdresser for an \"emergency haircut\".\n\nAnd yes, it was over a guy. And yes I did regret it, but then I grew to love my new haircut - I even ended up getting a fancy asymmetrical bob a few months later (please don't judge - it was the 80s)\n\n\\*this is how old I am - I could legally drink at that age in my state\n\nedit to add NTA", "I dont know if you live in the states and if so I dont know what the laws are like in that state but in mine at least at 17 you can legally move out (or choose the parent to live with) now as I am working on adopting my nephew (already a foster parent) I have learned that in my state, at 14 they can choose which parent/guardian to live with as long as it is a stable environment\n\nyou are definitely NTA hun. I am so sorry this happened to you. If you can I would look into the laws for where you live. Wish you the best, sending good vibes ~~~", "NTA.  She knew what she was doing if it was THAT much hair.  There's something else going on here.", "NTA at all. When I was a teen and had really long hair. I lived in a hot state and had gym at the end of my school day with sports after so I’d throw it up in a ponytail. Well my mom got mad and said if she ever saw it in one again she was cutting it. I forgot a few months later came home with it up she was drunk and cut the ponytail right above the hair tie.", "NTA\n\nI've cut hair before.  I'm not good at it AT ALL.  But even I would never take off several inches at a time to trim split ends.  Maybe several millimeters.", "NTA,\n\nI think you're in the right spot, you'll come back when you're allowed to cut her hair. You may need to figure out something with the car if she decides to go legal. I'm not sure she'll be able to do much over your custody as it's you being the driver for it but that's very regional/situational.  \n\n\nBut yeah, I think you need to stick to your guns as this was very clearly malicious.", "NTA I would be fantasizing about cutting moms hair when she’s sleeping", "Good news hair grows. Bad news you have every right to be furious. Now that you have a cut you don’t really like how about, highlights, fun color anything to make you feel better about yourself. Bonus points for you if your mom hates different colors like green, blue, pink and you get those colors.", "I would have told her that i am going to cut her hair as revenge", "NTA. I understand completely. When I was 11...(45 now). I had hair down past my butt. Went to a salon.  The crazy hair lady. Cut my hair up to my shoulders. Now back in those days I was extremely shy. But my mom had to drag me out of there. I was devastated.   And due to the \"trauma\" I've never ever been back to a salon. And I never will.  This should not have happened to you. Then for her to act like it wasn't a issue....", "NTA. My hair is super long, too, and I would be BEYOND LIVID if someone \\[especially my mom!\\] did this to me. I feel angry and feisty just thinking about it! I'm so sorry your mom cut your hair.", "NTA. It seems like your mom did this deliberately. Is she threatened by you appearance wise? Does she see you as competition? Seems weird.", "Depends on how incompetent your mother is and if there was an intention for harm. Bear in mind you agreed to the haircut", "NTA and I think it's time to take a bunch of pictures and videos because your dad should go back to court.", "Mom's jealous of you... sorry op.", "Ok, some of us have parents who aren't assholes, you know. My mum isn't a hairstylist or anything of the sort, but was perfectly able to cut our dead ends or even somewhat stylish hair cuts for the boys. Bit of a generalisation this.", "I asked my mom to buzz my head during lockdown and i had lots of convincing to do lol. She was so worried if messing up... making me bald.", "I remember when I was a kid, my mom would always trim my hair at home. It is long and straight so it's easy enough. My grandma apparently couldn't handle this and insisted I needed to go to a hair dresser when I was 10, she went ask the time so I guess she wanted me to have that experience too.  She took me to one and told them to just trim the split ends.  The hair dresser cut off half a foot.  I was obviously upset, half a foot is not a trim. Then the hair dresser started yelling at me that she was just cutting off the split ends and if she had cut all of them off she would have cut it up to here (more than half way up my back, my hair had been butt length before) and she did me a favor by not cutting more of it. \n\n\nI don't trust hair dresser at this point (has an additional bad experience after that and have refused to go back).  There a big difference between a trim and cutting of 6 inches or 2 feet.   I can't even process that.   There is no way that this was an accident, I don't know what OPs mom's problem is, but it was absolutely intentional. Your hands don't just slip and go \"whoops I was cutting down by your butt and my hands just flew up to your shoulders as I was cutting.   Twice.  Isn't that crazy?\".  NTA, and I hope OP can get the custody agreement adjusted to not go back, I think she can at her age decide where she wants to live.", "Love this!", "Love this!", "Sounds like there are a lot of us with hair trauma induced by our mothers. I got to the point where I couldn't even stand to have my mother touch me, much less cut my hair again.", "Totally agree.  My hairdresser mom really gave me a fear of hairdressers that  tookdecades to get over.", "It's mot an accident to cut a hair that is up to someone's butt to shoulder lengths lol... u have to have some serious disability to end up making a mistake like that. A very, very fucking poor hand coordination", "Ewww.  Why are you sexualizing OP's hair cut.", "Op agreed to have the tip cut and the mom said she could do it. Op did not consent to have two feet less damn it", "Really? Never heard of something like that. Do you have to prove malicious intent or something?", " She sounds like the type who would be thrilled if you left your dads house early if he ever some way violated your trust or privacy.", "Woah, how awful.", "I’m so sorry that happened", "By the time I was in college, I wouldn't let my mom, a hairdresser, touch my hair.  I have another post on this thread about what she did to me.", "Yeah I think so too", "My daughter prefers I cut her hair. I actually hate doing it, because I’m a perfectionist and feel that it would be so much better with a stylist. I am willing to pay for a stylist to do it, but she insists. Even when I work very hard to make sure I leave myself plenty of extra, I feel it always ends up shorter than I intended. I have learned to stop if the unevenness is minor because otherwise I’ll never stop cutting.", "Nothing good has ever come from my attempts at cutting my hair. I'd never go near anybody else's", "[removed]", "[removed]", "Its actually the same in Germany", "Same, my mom let me cut her hair a few times, and no matter what I do it never works out like what I picture in my head.", "Well, except my son. He can’t talk yet. But I usually make sure it’s out of his eyes and short enough not to get stuff stuck in it. He seems happy afterwords and continues to play.", "My mom doesn't cut my hair because I've always just gone to a stylist, but she knows how to. My brother is so used to having her cut his hair that he'll visit on weekends and she'll cut his hair where he's there. She was a theatre director/producer for decades, and costumes/hair/everything, they were skills she picked up.", "I cut my own hair and I’m pretty horrible but like that was fucking on purpose 100 percent", "Sounds like you're entitled to be annoyed with your mother,", "[deleted]", "Should’ve told OP then. Not continued to cut off an excess amount without her consent", "It violates your bodily autonomy, so legally that's why it's assault", "I think this was malicious. You don't cut of this much hair by accident.", "They see your hair as a \"body part\" because it grows on your body and cutting it off without being allowed to/ cutting of more than being talked about is the same as punching somebody in the face or something. I Had a dude cut off girls hair in class as a joke and he got charged and had to work in a social facility.\n\nOfc its Not an offense if you mutually decide to get your hair cut..like if i asked my mum to cut my hair its not a problem but as soon as she cut it way shorter/ damaged it heavily on purpose i could call the cops", "Your hair is part of your body and you choose what happens to it. OP agreed to 1 or 2 inches off, and their mum took 2 feet off. That's like if your surgeon said they were going to remove your appendix and instead took your kidneys. Both cases count as assault because they violated your body autonomy. I'm not sure which countries specifically but I think America is one of them that counts throwing a cup of water at someone as assault", "[deleted]", "Idk if its different in other countries but being unprepared and an Idiot could be the reason. Its not your profession and you dont have any experiences with it so you shouldnt be doing it. If you do and fuck up..that would be your own fault then. Its not malicious but your own stupidity which could get you charged then. \nBut there is a different term for it then which says you didnt do it on purpose but still did it so you can be charged.", "Requiring malice isn’t a concept for assault in all jurisdictions, you’re applying your own country’s requirement. For example, where I live, if there is intent to carry out the action then it can constitute assault regardless of whether it’s malicious or not.", "NTA.  I'm so sorry this happened to you.  \n\nWhen I was 14 my Mum had her hairdresser cut off my hair, which was down to my lower back, and I was given a very short hairstyle.  Like, above the ear short.  I looked like a baby faced middle aged woman.  Her excuse was that I didn't brush it properly.  Turned out that was a symptom of my then undiagnosed ADHD.  I'm 41 now and I've still never quite forgiven her for it.\n\nIt's important for everyone to have bodily autonomy, especially as a young person, and she took that away from you when you trusted her with your hair.\n\nIt says a lot that she wasn't willing to cut her hair, but was willing to cut yours and deny any wrongdoing.", "NTA.  I think your conditions are fair.  She should get a chin-length bob, too.  Will she pay for extensions?", "NTA -- and I'm not saying that you should stick gum in her hair but if gum does end up in it then it would be really bad to get it stuck close to her scalp and under the top layer", "NTA, and at 17, i think you should be able to stay at your dad's if you want. Your mom didn't accidentally cut off that much hair. Not sure why after she ruined your hair, she needed to cut off 3 or 4 more inches. I wouldn't have let her \"straighten\" out the lines and dealt with an uneven cut till you could get into a salon (I'm not blaming you for your hair, I just would have stopped her sooner) \n\nPersonally I'd probably try to live with my dad on the regular at this point.", "Nta. Take revenge and cut her hair, its only fair.", "NTA\n\n\n>she also has really long hair\n\nThat's why she did it. She resented your hair because it drew comparisons and detracted from her attention.", "NTA, also make sure your dad has the agreement that he is paying for the car as well. if needed talk to the Judge, what would she do once you are 18 and can choose to stay with your dad", "NTA. What in the Mommy Dearest is your mom's problem?", "Nta, shave her head lol. It just takes one good streak an d she has to go bald lol", "NTA. She did it on purpose. I wouldn’t ever trust her again she probably was jealous of your hair. I am not a vindictive person but her hair needs to be cut short too.", "Nta\nShe did it on purpose.", "Omg definitely NTA. She had no business cutting your hair! Either she thought she knew what she was doing and didn’t. Or for whatever reason she wanted to cut all your hair off. Either way, not cool!! She could of stopped cutting the first “mistake” she made, but she deliberately decided to keep cutting. So sorry OP, but hard lesson learned not to let her near your hair with scissors!", "NTA.  Your mom was jealous of your hair.  There was no way her chopping off all your hair wasn't deliberate and intentional from the start.", "NTA\n\nDoesn’t sound like an accident, and considering she’s your mom that’s twice as gross.\n\nI’d stay at dads as long as possible. Not only did she set out to intentionally cause you negative feelings, but when confronted she tried to gaslight you about how she was doing something nice and you’re overreacting.\n\nAlso, you’re not violating any custody agreement, because you’re not bound by it. Your father is. You’ll be 18 soon, I doubt a judge is going to care once you give your opinion and tell this story.", "NTA.  Go through court to have the custody agreement changed so you dont have to go over there anymore.  She could have let your hair go for the month until you got an appointment, but she just had to \"fix\" it herself.  She did this to you on purpose and now is trying to play the victim.", "NTA.  It appears this was intentional.  How is your relationship with her in general?  If that is the worst she has done to you, you probably got off easy.  \n\nAt 17, I think you can persuade the court to let you live with the parent you wish.  Not sure about the car.  That probably depends on whose name is on the registration.", "NTA. My father did something much worse when I was about 6 because he was angry I cut off my bangs with safety shears. I ended up with a bob for 9 years because of the trauma associated with having my hair cut.", "NTA You're 17, a court is highly unlikely to force you to go back. What she did counts as assault.", "NTA. This was intentional. Ignore her whining. If your jurisdiction allows kids to choose where they live ask your dad to contact his lawyer. Don't go back to her house without your father or another adult with you, and only to collect the rest of your belongings.\n\nAgain, this was not an accident, she did this either on purpose or with willful indifference. Hair grows back, trust doesn't necessarily do the same.", "Are you in the US? Because in some states this is considered battery no flipping way she didn't do this on purpose. Sorry OP.", "NTA. It’s extremely clear she did this on purpose. So sorry OP!", "/u/Mission-Budget2474 I have hair to my waist and this would fucking devastate me. And I’m over twice your age. If anybody….ANYBODY tells you it isn’t a big deal, it’s just hair, etc. I will personally call them and tell them to fuck off \n\nNTA and I have theories why your mom did this cuz of *LOTS* of experiences with this exact situation, but just know your mom sucks for this and it was deliberate.", "She did it on purpose.  NTA.", "She did this on purpose", "NTA\n\nThis was not a “doing something nice” thing, this was a power play ala passive aggression dressed up as nice.\n\nWilling to bet OP and her Mom have been butting heads over Mom’s need to control her life.\n\nHair is one of the first things people control about their body’s.  It’s also something girls will target to destroy when they hate someone, particularly if they know the person has any pride in their appearance.\n\nOP stay with your Dad.  Give her the car if you have to, but I would not set foot back in that house without someone present to make sure you are safe.", "NTA she did this on purpose.", "OP I am really sorry. I feel really bad for your situation. Your hair, your clothing and your preferences are your personal choices. Any changes that you do not do by will is wrong. I am sorry you felt violated. I am that your dad stood up for you.", "Getting your Johnson stuck in jacuzzi could be considered a mistake or accident. Cutting off 2ft/60cm was deliberate.\n\nNTA.", "You are 17. Stay at your dads til you are 18. Shes awful. NTA.", "NTA. Cut her hair in her sleep.", "NTA\n\nDon’t go back. There’s zero chance that haircut was an accident.", "NTA\n\nYour Mum cut your hair deliberately for some reason and didn’t care that you would be upset. You should stay with your Dad", "Honestly I’d be tempted to cut her hair in her sleep and say I was just trying to do something nice for you…", "OP, your mama changed your hair to suit herself and it will take months, if not years, to get it back to the way it was. \n\nNow is the time to take that back. Your mama gave you a little chin length bob? Ask yourself… what haircut would your mama absolutely *hate*? Shaved on one side? Pixie cut? Ever thought about pink, (or some other color)? Hmmm? \n\nLet your mama know-every damn time she looks at you -that *she* started this ball rolling. *You*would have been perfectly happy with your long long hair. You are young, you won’t have to kowtow to an employers dress code for *years*. Have some *fun*. See what you can come up with. \n\nI am so sorry this happened to you.  NTA and good luck.", "NTA\n\nShe did this on purpose op. Nobody \"accidentally\" cuts off *two feet of hair*. This was her manipulating you into a haircut *she* wanted you to have.\n\nUnless she has literal cataracts I have to say this was intentional.\n\nPersonally I'd tell her I'm not staying over until it grows back if I were you but I'm petty as hell.", "I'm calling BS on this post. \n\nYou let your mum cut your hair? Yeah right. \n\nYour mum cut 2 feet off your hair and you didn't notice? Pull the other one.", "Yep, she knew exactly what she was doing. Ass long hair to a chin bob? Mother was definitely trying to ruin the daughter's looks. Jealousy or to get back at her ex-husband (like when one parent kills the child to get back at the ex)", "Also, you’re 17. In the US you can change that custody agreement and have a say in front of a judge", "This wasn't a mistake. This was deliberate by a jealous mother.", "With OPs age I’m guessing she doesn’t know about car titles yet. Actually it’s not her moms either until it’s paid off but I’m guessing her moms name is on the loan. In the states you need to be at least 18 to co-sign on a loan.", "i wouldnt say youre reaching at all; especially for older women, having long healthy hair is a sign of feminity, and from what happened to OP, im sure her mom couldnt stand that someone with that same feature lives with her AND is also a lot younger than her (\"shes feminine AND youthful? shes the beauty ideal!! im a washed up mess compared to her!!\")\n\nit definitely reeks of jealousy and competitiveness, and im so sorry that OP is the victim of this.", "Yup.", "There is a difference between a few inches of hair, and a few feet.", "It's the same in the US. It is assault.  It is a civil issue though and because of Ops age it would be hard to press.", "[deleted]", "It is pretty much anywhere.", "At the risk of someone saying “you are assuming/armchair shrinking” I’m positive this is the case. \n\nMy hair is super long. The amount of people I’ve known who had hair this length and it was cut maliciously is at least, by my brief count, over 20 women (not including males). Ppl I personally know. And of that group a good portion of it had hair “trimmed” by envious maternal figures. \n\nThe response to long hair is almost always strong and it isn’t always positive.", "I've cut my son's hair all but one time that he's had it done. I used to cut my friends' hair growing up. We'd get the clippers and a comb out and go to town. Agreed, not all parents are assholes, and not all are incapable of cutting hair even if they aren't a stylist or barber.", "My 12yo, amab NB-ish kiddo has mid-back length golden curly hair.  It looks gorgeous, and while I'd love to tidy up an inch or two of few dead ends, they're vehemently against it (it's been at least 4 years since it was last given a little trim) so I'm not going to push.  [I used to have waist length hair and did my own trims, so yes I do know how to only take off a tiny bit! :-) ]\n\nMy fear is that they are starting a new, much larger high school in a different area next year, and that some of the kids there might not be as accepting of them as at their current school and could possibly enact some sort of hazing / revenge by cutting a big hunk of their hair.  It would be utterly traumatic to them.  It's one of the things I will be going over with the staff before they start, to ensure they have a good culture about inclusiveness and bodily autonomy, what constitutes assault etc, and I am absolutely prepared to go Full Mama Bear if needed.", "I'm still not over: I never went to a proper hairdresser of my whole life. Trust issues, thanks Mom!\n\nI just trim the ends when they are damaged and call it a day. I don't care if it's uneven, nobody but me touch my hair. I work with my hair tucked under a headband anyway so nobody ever noticed.", "WTF?!  Sexualizing?!  No...not what I did.  Take a big step back.  I'm talking about hair and that's ALL!  Why are you looking at sexualizing a 17 year old?!  Geezuz.", "i am sobbing at the mental image of that haircut. like some kind of edgy medieval pageboy, amazing.", "Cutting people's hair without their permission is assault in lots of jurisdictions", "Pressuring/coercing you into letting someone do it isn't assault, just snipping without permission. It's like the kids punching Billy Elliot in the boxing ring - he doesn't want to be there but they're not breaking the law.", "I can't count the number of times my mother has c been creepy about my long hair, including drifting in my direction with scissors.  Even into my 40s.  No way was this accidental, I agree.", "The number of times I've had to threaten loudly to leave the salon of they don't stop trying to cut off more hair than I requested is crazy. Even worse is the number of times they didn't ask and just chopped off 5 -8 inches is just mind boggling. \n  \nI barely get split ends, don't heat treat, colour, only wash every 5 days, etc. It's mostly since I'm lazy af and trying to blow it dry was like doing a contortion act and I know I couldn't be bothered to keep up with dying and growing it out would be annoying.\n  \nMy hair is pristine- I would get trims to even out the ends since it would grow a bit unevenly, and so someone else would wash it for me- it was a lot of work to wash!   \n  \nAnd yet it would get hacked by hairdressers with ISSUES on a regular basis.   \n  \nThen again I seem to be just as bad for my hair dressers as they are for my hair- every time I find a good one they've moved salons and I couldn't get their new info (pre insta days) or moved out of town, because life happens. Sigh. I have (relatively) shorter hair now, and have to bully a hairdresser into taking as much off as I actually want them to. Where were they when my hair was long?!", "I lost my long long hair to alopecia and have had some nasty things said behind my back (that I heard) about how I deserved it for “showing off” with my “in your face hair”. \n\n(Im now bald but saving on shampoo!! And cut those people out of my life.)", "When I had classic length hair, I learned to trim my own hair because I didn't trust anyone with my hair. (Even hair salon people would make uncalled for comments like \"you should donate it.\") \n\nPeople are hell of creepy around long hair.", "Bad bot! Copying this comment https://www.reddit.com/r/amitheasshole/comments/yw0xwt/_/iwhtbqr", "I cut my kids hair when they were younger, and I used to cut my ex's hair (or shave it) and another friend had me do it too.", "Hair down to your rump, And you cut it off at the shoulder. That isn't hard, that's done on purpose. Not something you accidently do.", "Then as an amateur you're not qualified to tell OP her mom just made a mistake. She didn't", "You don't accidently cut off 2+ feet of hair. If you're getting dead ends trimmed, it's a few inches at most. Especially when the hair goes down to their rump and mom decides to cut it shoulder length.", "I'm not sexualizing op, I'm calling YOU out for sexualizing her hair.  You telling her that short hair can be sexy was completely unnecessary. I can think of half a dozen more appropriate words like \"nice, pretty, elegant, beautiful, good, easy to care for\" which are all words that describe appearance without bringing sex into it.  You're the one who told a 17 year old a hair style could be sexy.  Check yourself before accusing me of what you didn't.", "It's harsh, I had my hair chopped last year from waist to shoulders because my 9 year old daughter wanted to donate her hair to help children with cancer (she also had waist length hair that I absolutely loved) because my mum lost her hair through chemo and it made my daughter sad. The night before she was due to get it cut (we'd spent weeks discussing it to make certain she was sure) she got really upset because we wouldn't be 'twins' anymore so I told her I'd donate mine as well and we could grow it back together.  I can't imagine chopping her hair off through jealousy It's just horrible, OP your Mum is horrible, stay with your Dad.", "Devil's Advocate.", "Did your long hair look better than your mom's, by chance? I get heavy \"mom is jealous\" vibes from this. \n\nNTA It was clearly intentional. You can't trust her, now.", "💇🛌", "NTA\n\nShe didn’t do it on accident and isn’t sorry about it either.", "NTA. That was in no way an accident. For the future, as soon as you catch someone cutting your hair in a way you don't like get tf out of the chair and wait to see someone you trust to see what can be done. Also, with long hair you can do a decent job on split ends YOURSELF because it's long enough to see. Mostly you need a mirror and a friend to check that it's even in the back. If you ever had some \"urgent\" split ends situation come up again after it grows back out :(", "NTA. Cutting someone's hair like that is assault. And you are old enough to decide who you want to live with", "NTA -  It was not an acident. I am a petty AH so I would go home and while she was sleeping cut a huge long chunk of her hair off.", "NTA", "NTA. The thing about ass-long hair is it tends to get frizzy. Sounds like she’s confusing split ends for for frizzy hair.\n\nAnd either. You don’t go chopping off hair from the ass to the shoulders without clearly showing with your scissors where you intend to cut.\n\nShe did you dirty. It takes forever to grow hair that long, because REAL split ends start cropping up and you have to constantly trim them to get to that length. Your young. So I hope it grows fast. But it takes most people at least half a year probably a year or more for the rest of us, to grow back hair from the shoulder to butt.\n\nI’m sorry this happened to you.", "NTA. Make her pay for a wig or extensions until your hair grows out", "NTA. \n\nHow do you accidentally cut off 2 feet of hair when she was suppose to just *trim* it?", "NTA.  Reconsider the custody agreement and document everything.  I would be tempted to say she wouldn't see you again at least until your hair grows back.", "NTA she cut your hair short like that on purpose. it's always weird as fuck when mothers are this way with their daughters... jealously much? I think so. you notice she didnt cut her hair.....", "NTA if your mom pushes to hard talk to your dad about changing the custody agreement, at your age they will very likely go with what you want", "NTA. I don't even cut my 4 year old's hair without his permission (currently hoping he'll let me cut just enough to get it out of his eyes-- it's shoulder length and he wants to \"be beautiful like mommy\"), and with that I stay as close to what I tell him I'm doing as I possibly can. \n\nI can't believe anyone would chop their child's hair like that unless A. They wouldn't brush it and it was a matted mess or B. They had their express permission to do exactly that. \nAt 17 the first shouldn't apply to you. Sorry your mom's an AH, stay with your dad!", "NTA.\n\nWhat other things, like this, has she done to harm you?\n\nKeep your distance when you're 18. She did this on purpose.", "NTA and I'm so sorry your mom broke your trust. I know it's about more than just the hair. She violated your trust and that may be considered assault. I would bring that up to your dad, get a screenshot of all the texts, and write down verbal exchanges you can remember. \n\nThis sucks I'm just so sorry OP.", "I had hair down to my waist, went to a salon and they messed it up so badly I ended up with a bob. I cried all the way home. It's been years and I've never really gotten over it. I've committed to growing my hair out again, because I miss it! If I was this devastated at a stupid person's stupid mistake, I can only imagine how you feel with your own mother intentionally hacking all your beautiful hair off. I wouldn't be able to look at her.\n\nBTW, I'm taking biotin and using a special growth shampoo (Bioxsine forte), and I bought a silk pillowcase to minimize fraying. It really helps, it's growing much faster than it used to, but I'm still looking at at least 3 years' growth before it reaches my waist again (it's currently at my shoulder blades).", "NTA. Cut your moms hair when she’s sleeping. She deliberately did that.", "You didn't violate your custody agreement.  You have no custody agreement -- you never signed anything like that, right?  Your PARENTS have a custody agreement between them regarding the custody of you.\n\nAs soon as she realized she wasn't able to do it right, she should have gone straight to YouTube to learn how to make it not horrible.  Here's a tip:  tape.  Put scotch tape on the hair in a straight line, then cut the hair along the top edge of the tape.  It won't look great, but it won't necessitate cutting 12 inches off, either.", "NTA.  This was obviously done intentionally.  Do you have any idea why she did this?  Did you  have a good relationship with your mom before this?", "NTA - But you should look into a CreaClip.  I haven't had to pay for a cut in years and it comes out perfect every time.  Of course, you'll have to wait for your hair to grow out some to use it.  Sorry your mom did that, I would have been devastated.", "NTA and OOOOOWEEEEEEEE!!!! I would have put nair in her shampoo! I have relatively long hair (mid-back) but it took a long time to get it healthy enough to grow like this. I am very picky on how it's cut and the ONLY person I let trim it for 10 years passed away 2 years ago and I've just been trimming it on my own since. To get rid of split ends I twist small pieces and snip the ends that stick out with scissors made for taking out stitches. I do my entire head like once a month and if the ends feel dry I snip like a millimeter off. I am so sorry about your hair, that was a shitty thing to do. Get some prenatal vitamins, eat lots of protein and it should grow pretty quickly. Try my method of tackling split ends and if that works you will never have to go thru this again. Loreal Elvive shampoo was also my lifesaver!", "YTA for swearing at your mom.", "YTA. Your mom didn’t shave you bald. Hair grows. You told her it was alright to cut it. Did she go a little overboard? Sure. But as someone who once had to sport a “Carol Brady” haircut at 14 because I begged for shorter hair and my mom couldn’t get it even, I feel no sympathy. Like none. There are so many worse things that could happen to you.\n\nNext time, plan your haircuts better.", "The mom sold the hair.", "no.1 reason i never let my stepmom touch my hair. she hated how long my hair was (almost as long as op’s) for whatever reason even though it was well maintained. she’s a licensed hairstylist & does her own hair and my dad’s so i know she was capable of chopping just split ends. i have a feeling op’s mom hated how long her hair was, & decided to play the “oh no i made a mistake” card….NTA", "To add to your point. Since when is a haircut so urgent it needs to be done right now?", "Yep... someone's jealous!", "Or you want a bowl cut", "Agreed. Perhaps I’ve grown too mean into adulthood but I contribute to regret not taking equivalent action more when growing up.", "Good god, I'm sorry. My mother fucked me up good, but she wasn't *jealous* of me like that. It's just creepy.", "I did that to my husband's hair a couple times with the angled razor. Luckily that's mistake of mms rather than inches.", "Like it or not women's hair (particularly very long hair) has a strange fascination and symbolic significance for some people. It attracts a truly ugly sort of jealousy and malicious cutting is far more common than one would ever expect. It's a deeply cruel and borderline violent act which is masked by the fact that it technically does not cause physical pain. \n\nMost of my life I've kept my hair around chin length or a couple inches longer. A handful of times I've grown it out longer; every time it reaches 2+ inches past my shoulders I start getting occasional weird, emotionally charged comments about it.", "GOD that's weird. I cut my long hair as a teenager due to headaches, but have started growing it again with the sides shaved, and if I achieve my butt length plait and someone cuts it the hair cutting isn't going to be the only assault. (I'm anticipating about 5 years with my growth rate; it's just reached chin length from a #1).", "Yep. I had my split ends cut… and they took six inches… i was devastated as it takes forever for my type of hair to grow long. It took me a long time to realize it was pettiness; as the stylist had to wear weave. Many at the shop did; and being a teenager, and thoughtless I had said something about never needing/having too.\n\nStill lesson learned", "What does this mean? “amab NB-ish“", "Which means OP should document it. Please help your dad cover his bases if she calls the cops on him.", "And in the US", "See I’ve always had the opposite when I had super long hair I went from butt length the shoulder blade length. Trying to get them to do that was like pulling teeth because they wanted me to keep my hair long until I asked them if they were going to come take care of it for me. For me when my hair is long it snarls so bad at a certain length so I was cutting it because I was tired of dealing with it. \n\n\nDoesn’t help I don’t like hair dressers most of the time I’ve had them butcher cuts so many times now. I know only pay the higher end places to cut my hair because they actually seem to listen and have people who specialize in certain areas and haven’t butchered my hair.", "You are so lucky!! I’m super jealous (not in the creepy-psycho-with-scissors way) as my hair won’t grow past my shoulder blades, and takes forever to get there. I would similarly get time behind bars if someone cut it as short as poor OP. Took me 6 years to go from a chin-length bob to the bottom of my shoulder blades.", "This! Tons of people cut their kids’ hair without ruining it. Mom in this scenario is either way too careless with her daughter’s hair, or intentionally cut that much off (sadly I think it may be the latter, and as a Momma that really upsets me).", "Assigned male at birth, non-binary ‘ish’, which given kiddo’s age I’m assuming means their identity is in the process of being figured out and not concretely settled on non-binary.", "I'm assuming:\n\nAMAB = Assigned Male at Birth\n\nNB = Non-Binary", "Assigned male at birth, non-binary-ish (not official term, but if I had to guess they're still in the gender confusion state that many trans and non gender confirming people go through)", "That’s such a beautiful thing to do! Your daughter will treasure that moment. I hope your mum is better.", "That would've been so hard to do! I think it's beautiful that not only did your daughter want to do that, but that you were willing to do it with her.", "I swear for my next haircut I'm going to bring in a pair of shears of my own, chop off a chunk in front of them and say, \"now even it out, please\" but I think that might come off too aggressive, lol", "NTA \n\ntell her you'll be back when your hair is back to the original length.", "NTA i would go No contact until my hair grows back. Your dad can get sole custody over the assault.", "\\> \"I told my mom that and she said she could do it\"  \n\n\nI assume you =-know-= your mom... So the answer depends on what qualifies your mother to cut hair?  IF your mom is a professional hair dresser then she is in the wrong.  Such treatment is testimony to a lack of skill, and I would be pissed.  However if she is not (I'm assuming she isn't)... and you asked her to do it anyway... then you got what you -asked- for even if you don't like it.", " NTA. Your mom intended to wreck your hair.", "Your mother assaulted you. NTA. There is no way this was an accident. If you are old enough to drive,  you are old enough to decide which parent you live with.", "I'm so sorry that happened to you and no, NTA. What was done to you was completely wrong.  \n\n\nReminds me of how the first 18 years of my life I couldn't pick my hairstyle. When I was 18 and moved out, I finally got to let my hair grow. I'm 28 now and my hair is the longest its ever been. Meanwhile, my younger siblings got to do all sorts of things that weren't allowed for me. Dye their hair, have any style they want.", "NTA If I slept in the same house as her, she would be bald the next morning when she woke up.", "NTA. That was an A move on your mom's part and she had to know it. Complete b.s. and I'm sorry that happened.", "NTA.  My mother did something similar just after turning 12.  She took me to a hairdresser that we had never been to before and got them to cut it.  It was nearly waist-length and she got them to cut it into a 'boys' haircut.  Just before going back to school.", "She violated your trust.\n\nNTA", "NTA. She should be glad you're staying with your father. It gives you time to cool down and not retaliate in kind.", "Moms gotta sleep sometime. Fair play", "Hair grows back, family relationships do not. Just stay with your father. Just let her pay child support. Your daddy can take care of all of your needs from now on. You don't sound like you care for her anyway considering how you spoke to her. You will probably both be happy. And your daddy won't call the police on your mother. I suspect you are more like your father than your mother.", "NTA, but also you will survive this awful haircut. I promise. We survived scene hair. You’ve got this. It was a terrible thing for your mom to do, and she reacted horribly.", "If any one here with hair trauma lives in the lansing Michigan area and would like a stylist that listens to their hair needs and is patient with traumatized clients, I would be happy to take you on. I love doing hair and making people happy and would love to show you what a difference the right stylist makes. If we aren't a good fit for each other I've a couple of stylists I trust to cut my own hair and I don't typically let anyone cut my hair, I refuse to let anyone else color my hair either.", "Go to court with this.", "NTA, i can see why youre livid. my hair is to my belly button and if that happened to me, i would have thrown something. she clearly didn't do it on accident she did it on purpose.", "NTA. This was not an accident. Sounds like your mother had an issue with your hair and waited until you dropped your guard so she could make you look the way she wanted you to.\n\nYou literally can't trust this woman with your hair. It sounds like you should stay with your dad and if you are in an area where this is assault, you should probably press charges since your mother is threatening you", "NTA. This sounds like one of those jealous older woman things. Some women have learned that their only value is in looking young and sexy, so when their youth fades, they can get resentful of their daughters, and other young women.", "NTA. \n\n1) Custody agreements are between parents. Not between parents and kids. When the kids can get up and leave like you did… good luck on the parents trying to force a kid to go to their place. \n2) I would be upset too. Once she realized she was screwing up your hair, she should have taken you to a salon. There are lots of them around, didn’t have to be to a specific one. Any body else would have been better. \n3) next time, do it yourself. Lots of video online on how to cut your own hair. \n\nHang in there.", " NTA. Also you're 17, you can probably get custody changed at this point.", "this is abuse plain and simple.", "NTA. You just learned a valuable lesson about your mother. She is not to be trusted. You will be 18 soon enough and she is playing a dangerous game given that what she has done has created estrangement.", "NTA. She did this out of jealousy. A person's hair is a very personal and important part of how they see themselves and how they wish others to see them. This was a horrible thing for your mother to do.", "NTA. Call cps and tell your dad to change the agreement.", "Clearly NTA, her mother said she was going to cut her dead ends and basically cut off 2 feet of freaking hair. That was definitely on purpose. How does a inch or so go to 2 feet. (Let that sink in)", "I don't speak inches but I still know \"2 inches\" isn't an adult humans entire back in length.\n\nNta, it was deliberate, my question is why?", "NTA. I would had left after those first two cuts and showed it to your dad and waited for a free appointmet at a real hairstylist. If you feel petty then cut her hair when she doesn’t expect it.", "More than 2 feet.\n\nThe mother cut it even shorter after OP’s first complaint. \n\nThe woman is deranged.\n\nNTA", "Sounds like Mom was jealous of daughters hair and decided to get rid of it", "When my mom was trimming my hair, she accidentally gave me bangs, and I cried so hard. She felt so bad and apologized over and over! She's cut my hair since, but knows never to touch my bangs again. And she's done a great job! \n\nMoral of the story-- a good mom would apologize and try to make it right.", "This was a setup by the mother, plain and simple.", "Hope you have a good photo of you with long hair. That could influence the judge in terms of the severity of your loss and the unlikelihood that it was accidental.", "she asked for a couple inches off. it’s not hard to do at all. nothing will make mom chopping off almost all of her hair even reasonable. anyone with a brain can do it.", "Oh give me a break. You wanted the hair cut when you were 14, SHE DID NOT. A little overboard? Her hair was waist length and mom made it to her chin. I have long hair, and I know how terrified I am even hearing that. Mom insisted on cutting her hair, it’s not that hard to take off a couple of inches, trim the ends enough to not have the unevenness noticeable, and leave it alone until she can get it fixed. Just because worse could happen doesn’t mean this wasn’t bad.", "Male here, why do some women get jealous of others hair?", "My mom can certainly do a  basic cut like op asked for without making a \"mistake \" like op mom did.   Some of us do have decent parents.", "Oh yes. My sister and I are in our 40s with long hair and our mother has been on our cases since we hit 30 that \" older\" ?(TF?!?) people should not have long hair.", "Doubt it. I'm a hairstylist and my daughter has hair to her waist. I refuse to cut it for her. To one point where she cut it herself and made me even it out. I'm 60, not an envious maternal figure.", "Sending your NB kiddo all the best wishes in the world!", "Like the O'Hare Air guy from the Lorax\n\nhttps://seuss.fandom.com/wiki/Aloysius_O%27Hare", "If you wear wigs, (or even if you don't) I'd be tempted to buy a really long wig and wear it solely around those people just to spite them.", "Many salons sell the customer hair they chop off. I don't mind as long they follow what the customers wants. But chopping off more is sneaky. Definitely would protest. NTA", "Yep. I trim and color my own. I hate for it to be blunt on the bottom and stylists just don't seem to understand when I tell them DON'T CUT STRAIGHT ACROSS!  So I twist it and use tiny surgical scissors to snip the ends that stick out and barely snip the ends if they feel dry.", "Oh honey that’s horrible. What a horrid thing to do to someone who trusts you over an off handed remark.", "I agree you can make a report and hold the right to press charges at the moment. They should tell you how long you will have to press charges...I would, I love my long hair", "Just watch some Brad Mondo videos and teach yourself. My hair isn’t to my butt anymore, but it used to be and I’ve been cutting it myself for years, but his tutorials have definitely upped my game!", "Have you taken anything like keratin or biotin? 6 years to grow that much might be an indication something else is wrong or that your body isn’t absorbing something properly (it was for me, and this was my first sign - my hair stopped growing). Apologies if this is not new information, I just wish somebody had told me sooner.", "I agree with the other person that said you might not be absorbing properly. I take biotin daily and my hair grows kind of ridiculously fast. I was just looking at pictures of myself from 9 months ago when we did headshots at work and my hair is a solid 4 inches longer than it was then.", "Oh wow, I hope the suggestions others gave you help! Everyone seems to have an innate length at which all the follicles dying individually kind of catches up and the bulk doesn't seem to get longer, but shoulder blades is unusually short I would have guessed. \n\nI'm blessed with hair that is ridiculously thick and grows fast, but am also 0% inclined to spend any time at all on my hair, and if I could afford it I'd want a weekly barber appointment with the sides!", "I don’t blame you I’d gotten to the point where I just had my bf cut it. It was an easy straight across and looked just as good as when they did it and it was free lol. Now with my haircut I have to go do it about every 3-5 months because I have very little hair and looks bad if I don’t and if it’s cut wrong I look like a little boy. Not a good look so took me awhile to find a new stylist when we moved. \n\nI now recommend people go to slightly more expensive places if they can afford it because they don’t push products as much on me or if they do it’s a suggestion so I can get the same style that they did on it. Additionally I’ve always come out happy with the hair cuts and no regret.", "Thank you and u/URSmarterThanILook for the suggestion. I had assumed my multivitamin had it, but it sure doesn’t. I will experiment with keratin and biotin supplements. It’s been a long time since I’ve tried it.\n\nIve been experimenting since I noticed the lack of growth about a year ago. Mostly with hair treatments. I could write a whole blog about it tbh. Right now I’m on regular scalp massages with Mane Choice Manetabolism drops and washing with thinning hair shampoo. I think it’s doing something because I’m losing less hair in the shower.", "Thanks so much, I hope so too. I want rapunzel hair so bad 🥲", "You can get supplements at any CVS/walgreens and they’re super cheap! It should also help your nails! I’m glad you found a solution to the immediate problem that seems to be working for you. If it stops, there are some really great customized/specially formulated for your hair shampoo companies out there. I’m a big fan of [Prose](https://www.prose.com).\n\nI’m really not trying to pry, and apologies if this is - but how much hair are you losing in the shower? \n\nWhen I first got sick, losing like clumps of hair and super slow growth were my first symptoms. I ended up in organ failure for a little while before we figured out I had a food allergy presenting in a weird way. The same thing happened to my friend in college, and it turned out she had the same.", "Oh girl that’s so scary! Both of y’all had a food allergy? I had no idea that could present in that way! Thank you for sharing and I’m happy to hear you found the culprit. I’m glad you brought that up actually because I’m seeing an allergy specialist soon. (I’m told I presented an allergy to penicillin when I was a baby and I want to see if I’ve grown out of it since I met my deductible) Might as well get a whole panel done. Esp since my digestion is weird too.\n\nIt’s hard to gauge if the amount of hair I lose in the shower is normal or not. I wash my hair once MAYBE twice a week, and when it gets greasy looking I pin it up in a high twist. So basically by the time I pull it down, I assume I’m removing all the shedded hair since I pinned it. With that said, that was my justification for why it was, indeed, quite a lot of hair I was losing. Like you know when you put shampoo in your palm and it’s like… the diameter of a golf-tennis ball but flat? That’s about how much hair I was losing. Now it’s literally a few strands. The difference is insane.", "Seriously! She found out in college she was allergic to walnuts because her hair fell out. I was a moron who didn’t take food allergy seriously - turned out I was celiac… after several trips to the hospital. Celiac and related problems really fuck with your digestion. \n\nMy body basically stopped absorbing any nutrients, my digestion basically shut down/slowed to the point that I was never hungry, couldn’t eat much when I was, and I was seriously in danger of a heart attack, even though I was eating food that should have nourished me. I’m really only just now getting better. Not to scare you - just to say these things are really important and hair is such an early warning sign!\n\n\nIt might not be anything, you might totally have something else, but I’m recognizing a lot of what I went through in what you’re saying. \n\n\nYou should not only get a strict allergen test done, but also an intolerance/sensitivity test. I got [this one](https://www.everlywell.com/products/food-sensitivity-comprehensive-test/), and while I didn’t have an Ig “allergen” to milk, but when the food test came back and blared “stop drinking cows milk”, all of my symptoms ceased. and I had *weird* symptoms, a lot to do with digestion and esophageal issues. And once again I was malnourished, despite a generally healthy diet.\n\n\n People tend to think anything that isn’t immediate anaphylactic isn’t an allergy - I am pretty sure my throwing up every time I have milk is more than just “intolerance”, but people don’t get it until I say allergy.  \n\n\nIf you were losing a golf ball worth of hair every time you washed it, twice a week, that’s *not* normal. It’s really good that it’s just a few strands! That is much more normal, and happens to everyone. \n\n\nI hope all is well for you and turns out well, and I hope none of this ends up being important information. May your hair just be a little picky, and your internal organs all healthy and thriving. Definitely see that doctor, just in case. Never hurts. I’m glad I could share something that might help and wasn’t on your radar. The body is a crazy thing.", "NTA\n\nIt's no wonder your dad divorced her.", "At 17, the custody agreement doesn't mean much. Your mom just caused major damage to your relationship. Let that sink in - because this was on purpose 100%. \n\n\"I've got rid of the dead ends, but it's uneven, do we should get that fixed when you have a hair appointment.\" - acceptable\n\n\"I'm not a trained hair professional, so I'll just keep cutting until you have a bowl cut.\" - unacceptable.\n\nTrying to take your car away when you go to your dad's, claiming her 1/4 stake in it - unacceptable.\n\nNTA", "Oh wow! Darling, let's cut to the chase here: 1: She violated you. 2: YOU can't violate custody agreements, and 3: KEEP THOSE TEXTS!!! And screenshot everything else she sends! \n\nNTA", "I'm so sorry for you, Op. You're NTA for yelling at your mom. There's no reason she should have cut it to your shoulders; it seems intentional to me. My mom has owned a salon for most of my life, and has been the only person to ever cut my hair. I cannot imagine a mother doing this to their child.", "I personally don’t care about hair it grows back i had butt length hair then shaved it to a 3. But OP is not me and this 100% seemed malicious you need to document it for the courts hun. I know it sucks and you may feel self conscious but try rock the hair while it grows out hopefully it doesn’t take long. NTA", "NTA. She violated your trust and your body. She deliberately sabatoged you, this is something that a highschool bully would pull, not a mother who cares about you. She wasnt trying to do something nice and she knows it. \n\nShould dye it electric pink or something super cute to give her the finger. To make the most out of a shitty situation and take your control back.", "At 17 you get to pick where you stay. Absolutely NTA, sounds like she did it intentionally, and her texts are Absolutely uncalled for.", "Nta. This is actually a form of assault believe it or not. She cut off more hair than you agreed to. Also you’re 17. The court would rule on your favour custody wise anyway.", "Why do I think mom was jealous of OP and did this on purpose?  \n\nWondering if someone recently commented to mom how lovely OP’s hair was, said nothing about mom’s and now by god mom took care of that. \n\nOP if your dad is agreeable I would see if you can’t have the custody changed so you just stay with your dad?", "NTA. Honestly, it sounds like she got some bad news about *her* long hair and decided to take it out on you…regardless of the reasoning behind it this was clearly done with malice.", "Hmm", "Ok maybe. But I will say In the times friends convinced me to try/cut their hair if frequently ended up shorter than I intended trying to make it even.", "Oh God, of course NTA.\nMy hair is just like yours was, down to my butt. I'm too shy to ever say if I don't like a haircut, and even I would just start crying if that happened to me. It's not a teenager thing too- I felt that way when I was a teenager; I'm 25 now and I still feel that way.\nI hope she's able to understand that long hair like that takes a lot of effort to maintain, and being attached to it is not superficial or 'not a big deal'.", "The mom totally wanted to chop off OP’s hair. No way she’s that bad at cutting hair", "Not necessarily. This is why you should never let an amateur cut your hair though. They have no idea what they are doing. Taking off the initial few inches then cutting off a little more on this side to even it out, ooh! Now the other side, just a little more over here to balance it out, oops, now it’s uneven the other way… people who think they can easily cut a couple of inches off the ends of long hair rarely can, even more so if it’s thick.", "I had very long hair, to about elbows, in middle school, but didn't take care of it. Like, I didn't know how to do a high pony, and it gets frizzy and wavy. And then I got head lice for the second time. After she had treated my hair, mom made me get it cut, at least the scraggly ends that tangled.\n\nWell the scraggly split ends went up to mid shoulder blade. The stylist was very apologetic but I cried at home all day. The poor woman was so worried when I went back a few weeks later to get a bob.", "Maybe a lil Nair in the Pantene?", "I wonder if she cut his hair too?", "Cutting off a foot or more of hair isn't \"a little overboard\" and in some places is considered assault.  Your complete lack of empathy is disturbing", "No?\n\nCutting someone's hair *without permission* is probably assault in most places.\n\nIf giving someone who agreed to let you cut their hair a terrible haircut is shitty but it's not \"criminal assault.\"", "How do you “accidentally” give somebody bangs?", "That’s not how it works. It you buy a car with a loan - it’s still your car - but the financing company keeps the title as security for the car. Same as when you buy a house with a mortgage - it is still your house, with the bank holding title as security given the loan is secured on the house.", "Ever notice how people with -that- mentality are typically the ones who have these kinds of problems?  \n\nIt's simple... you want something done right... no matter how hard it is to do... hire a professional.  Anyone less you can't complain about.", "yep. My mom always kept my hair around shoulder lenght as a kid, but when i was 10ish i started to fight her about it and let my hair grow. She was always talking shit about me looking like a caveman, my hair being too much trouble, messy, the cost of shampoo and hair products (really) and getting my aunts to dogpile on me and tell me to get it cut. I refused to cut it and by 17 it was hip length (and my hair is 3A/3B , so straightened it was so long it covered my ass).\n\nI don't know what got to my mom, but i guess she had some kind of crisis when we were looking for a dress for my HS grad because she started being extra mean to me and then cut my hair while i was asleep that day. Her reasoning was that i was \"too arrogant and vain\".\n\n\nI had to wear it straightened as a bob, because curly it was barely by my chin.\n\n\nNow i keep it just above my shoulders because it's convenient and i don't get headaches because of the weight anymore, but whenever some family member asks me why i cut it/ don't let it grow i tell them my mom cut it because she was jealous and i'm afraid she'll do it again. she goes crazy lmao", "I have long, fine hair, and at this point no one is allowed to touch it except my husband. Or me.\n\nI spent a lot of time looking up Youtube videos to learn how to cut it myself when it's needed.", "mom told her to let her do it. the daughter is absolutely allowed to be upset over it.", "Really? because my mom held me down and forcibly cut my hair in High School because I was caught kissing a boy.", "Yeah, every time my hair got down to my rear I would get a trim to even it up and every damn time i would come out with it armpit length. Didn’t matter if i switched stylists or salons, or showed them with my hands exactly how much i wanted off.", "I stopped going to hairdressers because of this. Ask for two inches off, they take off a foot or more. They don’t listen. They don’t follow instructions. They don’t care.\n\nOf course not all for those who will get upset at my statement. I’ve had some great hairdressers. But either they moved or I moved and I had to find new and when I had long hair, it just didn’t work, so I gave up.", "I used to get headaches after a long day, but I learned a couple fun hairstyles that help mitigate it. My favorite is the Tudor crown braid, which not only prevents headaches but also tangles, and looks both playful and approachable (unlike my previous go-to bun). \nIt does take about ten to fifteen minutes to put up, but it’s worth it to me because it stays put all day.", "When I cut off all my hair -- going from shoulderblade length to a close crop -- I had to talk the stylist into it. At length. It's my goddamn hair! Cut it the fuck off!! \n\nshe didn't even cut it short enough; I had to get it taken down even further by someone else to get to the \"men's\" haircut I wanted.", "Yeah, nobody makes a mistake that big. Not sure why your mom wanted to wreck your hair but she went way overboard whatever her goal was. Is there only one salon where you are? Why not go to a different one? Pretty much anyone can off split ends. Well, not your mom. lol. But a hair stylist could. \n\nI think it's fine for you to stay at dad's for a bit. Mom broke your trust. Take a day or two to get over that before heading back.", "That’s cut her hair off while she’s sleeping territory.", "yeah no, thats completely her fault.", "NTA- I would’ve cried", "She did it on purpose. She can fuck off. NTA.", "NTA. That isn’t a mistake.", "N.T.A.  \n\n\nWhat she did is basically assault. There is no way that was an accident, and as someone with long hair herself, she would have been more than aware of how the length was important.  \n\n\nAnd then to put HER custody agreement with your dad on your shoulders is total abuse garbage.   \n\n\nGood for you for sticking to your guns and refusing to go back until she cuts her hair. It's the least she could do.", "YOUR MOM is NTA.", "NTA\n\nI've been in a similar situation with my divorced parents. The car argument is such bs too. In my case my dad did own the car so it was slightly more accurate but I just told him to take it back. Tired of divorced parents 'giving' their kid a car then trying to take it away as soon as they violate the godforsaken custody agreement. A+ to your dad for standing up for you!", "NTA. What the everloving fk did I just read?! It’s a bit freaky because right at this moment my daughter is in the bath. I’m scrolling through reddit killing time. Straight after she gets out we were going to go trim the split ends off her hair. And here I am wondering how little can I cut and still have it healthy looking because she’s sad she doesn’t have enough to braid…\n\nSome mothers really shouldn’t be mothers.", "OP I am not telling you to definitely cut your mom's hair the same length in her sleep because that's bad advice... But it is what I would do if someone did that to me.", "NTA. Go to a judge and say you want to live with dad full-time. She’ll pay child support to your dad — who can likely then pay more to your car since he’d have more money (especially since your narcissistic mom would stop paying towards your car).\n\nOP, I’m so sorry this happened to you. She 100% did this on purpose out of some fucked envy. Personally, I’d go no-contact unless she chopped off all her hair.", "NTA\n\nThat’s abuse. Your mother just assaulted you.", "She is jealous of you", "ESH\nYour mom did a bad thing, but, you are a minor and should try to be cool-headed and show a bit more respect. It'll grow back.", "Did she start by taking a section at your nape and trimming that, then bringing  the rest of the hair down in sections?\n\nIf so, she is n t a and it's an ESH situation. Long hair is usually broken and wispy at the nape and hairdressers know to make the first section on hair like yours much higher, almost halfway up. That way the true overall length is visible and they'll make their first cut at a suitable spot. Otherwise if they make their \"guide\" lower down and just take off a tiny bit they'll suddenly have six inch overhang as the longer pieces come down.  Source: apprentice hairdresser me, long ago.", "Y’all a bunch of whiny B’s, cUtTiNg SoMeONEs HaIr LiKE tHaT iS AsSAULt", "Wait what? It’s impossible for a kid to trust their parent to trim their hair? \n\nShe literally said in the post that she noticed after two snips.", "Be careful, clutch those pearls any tighter and you'll fucking shatter them", "It is the parent's job to not do bad things to their child. Why should she be the cool-headed one and show respect when her mom showed her none? She also was cool-headed and mature by removing herself from the bad environment instead of being overly confrontational.", "I mean would it matter how and why she started? Clearly it ended with her deciding to cut it into a bob that OP stated she did not want", "I already said why.", "Hubby likes his styled and goes to the barber to get it done, eldest son likes when i do his hair all over same length (he has ADHD and a small bit of anxiety that took us 7 yrs to get to this far) his little brother has had similar issues but is more flexible in who cuts his hair so we let him decide. I would never change their hair length or style without their permission and they aren't even in double digits for ages yet!! NTA huni and make sure your dad keeps having your back cause what your mum did is uncalled for and very much A H ish", "I bought a home and I have the title. The bank just has a lien on the property.", "Stop the bs a literal toddler wouldn’t do that mistake . Unless you have the iq of the pair of scissor the mom was using you know that", "Those ppl are awful and don’t deserve you. Glad they are out of your life!", "LOL I can still relate to this!", "Well said. I agree.", "That sounds badass!\n\nI’m gonna be probably annoying and recommend the scalp massager things. The blood flow REALLY helps it grow faster. I went through some trauma and my hair fell out in places.", "IN YOUR SLEEP? I don’t want to get banned so just imagine what I wish to say. And 3A/B hair?! My heart hurts for you.", "The fuck? I don't get how so many mothers can be jealous like that. I fuckin hope my children are better looking, richer, more popular, smarter, more fulfilled, etc. than I am (not that I'm unhappy, just by default I want them to have the best life possible).", "Ain’t that some shit? You made an offhand comment not intending to belittle anybody and a professional decides to be vengeful. I’m so sorry that happened to you.", "Right. So this isn’t about you. It’s about someone who cuts their kid’s hair maliciously. That isn’t you.", "My sons (7 and 10) only started going to the barber's a couple of years ago. The oldest was scared and kept tensing up, and the youngest was far too squirmy. So, they had to make do with my mushroom shags, which is the only short style I know how to do.  In my defense, I don't think they hated it, because they still get their hair cut in a similar style. Just,  you know, better.", "I've done that a couple of times! First was I cut off 2 feet of hair while I was pregnant (long hair + bad morning sickness = bad news) and the hairdresser wouldn't do it so my BFF did the first cut and then the hairdresser evened it up. Fast forward 10 years I cut off about 18 inches of hair before I had surgery and then about 3 weeks post-op I went to a hairdresser and asked him to even it up.", "In hairstylists defense, it’s usually to cover their butts. I have heard too many stories where a stylist gives someone exactly what they want but when they regret it they turn on the stylist. That’s why stylists will often try to suggest an in between cut first, before committing to something as drastic as butt length to a pixie cut for example. \n\nThis is why I’m so glad I have such a great relationship with my hairstylist - I’m not trying to convince a new person to do a major cut, I’m evolving my style with her alongside me!", "Yeah. I took to keeping a photo of myself with a pixie cut as “proof” that I knew what I was talking about before anyone would touch my hair!", "NTA, What in the hell was she thinking?? You have every right to be upset…and if she takes your dad to court the judge will rip her a new one for doing that to you. She’s an idiot!", "NTA", " NTA \n\nYour mom deliberately sabotaged you.", "First thing is I’m so sorry about your hair not turning out how you want because she didn’t do what you wanted. I have long hair and I would be very upset if someone did that to me. You have every right to be upset with her so your NTA!", "OMG NTA OP. When I was in elementary school, I had beautiful, long dark hair. My mother decided one day to give me a \"surf cut\" which is basically a \"bowl-on-head special\". I also wore glasses and had chubby cheeks at the time so guess who got bullied relentlessly in school every day? You guessed it. \n\nIt was so awful, that when we went to visit my aunt right after she did it, my aunt slammed the front door in my mother's face and didn't speak to her for over a month. \n\nMy mother was a hair model in the 60s and a hairdresser. My aunt also owned a hairdressing shop many years prior so it's not like she didn't know what she was doing. \n\nSidenote for laughs: I used to love seeing my uncle when my aunt decided to give him perms in the 80s. He'd have the cape, the perm rods on his head, the whole 9 yards. He hated it so much but went through with it with no complaints because she loved his hair curly.", "**>>I told her I would be more than happy to go back to her house if she cut her hair like mine<<**\n\nI like your way of thinking OP! Just genius! \n\nNTA", "NTA. You don’t accidentally cut off that much hair. And by age 17 you should be able to decide who you want to live with or stay with regardless of custody agreements.", "NTA. Put hair remover on her shampoo. JK.", "UK is a weird place. Someone cuts your hair against your will? **Assault!** \nA woman rapes a man? **No, that's not possible, not rape, women cant rape**", "Same in the USA", "Mum better not sleep too heavy. Would hate for OP to help her out with a trim while she’s asleep.", "Exactly. I know several people that regularly got decent haircuts from parents or grandparents growing up. And during the covid lockdown, plenty of people gave or received amateur haircuts to/from family members or roommates. \n\nThe problem with OP's mom isn't that she's not a barber/stylist, it's that she's a careless, inconsiderate, untrustworthy AH.", "It's assault in Norway too", "Well, that's just disturbing.  It's *hair*, jesus, and having nice, super long hair usually requires a lot of care and upkeep, it doesn't just happen for most people.  I can't imagine seeing that and assaulting someone over it.", "Serious question, why are people jealous of that? That seems stupid.\n\nI am gonna be honest, when I see people with long hair I pity and/or admire them because of how much work that is.  \nWhen my hair gets just a little long (for reference Beatles hair cut), it's already too long and too much work.", ">Pressuring/coercing you into letting someone do it isn't assault\n\nActually it is. Just like pressuring/coercing someone into having Sex with you is rape. You forced the other person into doing something they didn't want to/feel comfortable doing!", "Ugh, that sucks. I have had short hair most of my life, at the moment it's long (for me at least, a little over shoulder length). And every time I go to the hairdresser they show me how much they are going to cut off before they start. I thought that this was a normal procedure, but reading all those stories here I seem to be lucky.", "I literally drive an hour in a tiny country to visit my hairdresser. I finally found a good one and I’m not letting go", "I'll repeat what others said. That was deliberate and not an accident. What a sweetheart your mom is... NOT. \n\nNTA", "You're NTA. Now I'm really wondering why she cut your hair. To say you \"violated your custody agreement\" is such a weird turn of phrase to say to HER CHILD.", "N T A. That \"hair cut\" took a special kind of nerve. She may ~~have the idea~~ thought you look better with bobbed style, but yes, she should have (edit: had) the same for herself. With a sincere apology. Next time just try a ponytail haircut hack.", "NTA i had a mum like yours, shes jealous of your looks and cut your hair off to spite you. Sounds mental but id put money on it.", "NTA. Cutting that much hair is deliberate. But unless you live in a rural area with only one salon, call another professional next time instead of letting a parent or anyone with no experience, no professional tools, and no reputation or business to maintain do it.", "Unfortunately this is a hard lesson to learn. So many people I know have trusted a family member to 'cut their dead ends off'. \n\nHell I trusted my husband because he convinced me he was Vidal Sassoon in a former life!!\n\nHe soon proved he wasn't!! Thankfully mine was only my fringe but I did walk around looking like Friar Tuck for a longer period than I wanted.\n\nThe only bright side is , you now know not to trust anyone to cut your hair. \n\nYou rock that bob until it grows back :)", "NTA. I don't know how the rest of your relationship with your mom works but I think there some jealousy/narcissistic  tendencies there, to cut your daughters hair that way there's no way she did it by accident, have you by any chance started dating or she broke up with a BF? It's very disturbing what she did because she probably did it to make herself look better.", "Blah blah custody agreement. At this point you're likely old enough to just not go back there if this is what she's like. NTA.", "NTA, but I have a question. Is there really only one place nearby that cuts hair?", "Sounds like something my mom would do. My guess is that she was jealous of your hair and wanted to make herself feel better. NTA.", "NTA. I couldn't ever forgive someone for this. If she ever forces you to go back to her, I would take a rasor and shave in her hair. Make her regret what she done to you! But I am patty and doesn't mind lowering myself to that level.", "Pro-tip never let a parent cut your hair....ever.\n\nNTA", "NTA \n\nI can’t fathom how this even happened if she cut and it wasn’t even she should have stopped and taken you to another hair salon not continued.", "I mean, in some countries it IS assault.", "Horrible take. Respect is not owed.", "Speaking as a person who once had waist length hair...\nWhen waist length hair is being trimmed, the hairdresser is literally bending down at your waist and cutting it there. They are not standing up straight. How could you be unaware of that?\n\nIf you've only had shorter hair you probably can't imagine how different it feels from getting shorter hair trimmed, where the scissors are actually near your neck.  The pulling against your scalp is hugely different. \n\nI want to hear from other people who have also personally experienced the physical feeling of having waist length hair cut into shoulder length. I want to know if they think it could happen without them noticing till the point of no return, and in only 2 snips.", "But would do wonders to change the custody agreement...", "You're forgetting she gave her mother permission to cut her hair, which was a huge mistake.  Unless your mother is a licensed beautician, she wasn't qualified to trim hair of any length.  My mother used to trim my sister's bangs badly.  My sister ended up going to beauty school.  Now she does it herself.  Lesson one:  don't slouch and look at your phone during a haircut.  It will be crooked.  Hold your head up.  Lesson two:  pay attention, so you can stop anything troubling, like more than a few inches of hair disappearing.  Hair salons will take clients for emergencies, like Mom cuts.  But never let her near your hair again.", "I have had super long hair and I’ve had pixie cut hair. Distracted and on my phone (like OP was) it felt no different to me if they were doing small sections the way the mom was.\n\nSeems like OP trusted her mom and didn’t pay much attention to the start of the haircut. I know I’ve definitely not realized just how short my haircut was getting until I glanced into the mirror.", "What? I...What? NTA", "I’ve found that when you’re going against societal norms, people wanna convince you to stick with it (don’t cut your hair! get married! keep working in that office you hate!), but once you’re confident in yourself, especially if it’s either societally conventional or unconventional, they want nothing but to tear you down (how dare she flaunt her long hair! who does she think she is wearing that outfit! that’s cringe!). I think that’s what you’re experiencing versus the original commenter.", "And lots of people will never get hip length hair again if it is cut.", "thank you. She even woke me up to be sure she could see my reaction, she knew i was very insecure as a teen and my hair was my only pride. That witch.", "You're a great parent! Mine chose to had children instead of therapy, sadly. It was great for her until each one of us started to grow up and move, talk, be independent and develop a personality. She wanted dolls, not human beings.", "Other way around here, afab, nb-ish 13 year old, who got rid of their long mane a couple months ago...", "That makes sense. My mum is my hairdresser and has been my whole life, she was in college getting her level 1 certificate when she got pregnant with me, so she just does exactly what I tell her to because she knows I know what I want. Since I trust her she also gets to do fun things sometimes, for my 18th birthday she did a custom blend of colours as a surprise and it was beautiful, my hair looked like an oil slick.", "NTA. I once cut my daughter’s hair and it got too short. She cried. I felt like shit. That’s how your mother should feel if it really was a mistake. I said I am sorry. Hair grew back. We are ok.", "Ur mom is jealous of u. That's the way I see it.", "Do you have the same colour hair as your mother? Longer? Thicker? Or is it just better than hers?  Because I was just wondering if this was done out of spite and jealousy. I will tell her that she is never touching my hair ever again even if I have to go to a salon and pay $250 because she clearly can't be trusted", "I used to cut my kids' hair when they were little and in no way cutting from waist to shoulders was accidental. She did it on purpose. NTA", "NTA\n\n100% What a sick power move from her. She wanted your hair to be short and took advantage of the moment. Your father clearly saw it for what it was!\n\n(And I'm someone who doesn't care for long hair, but this here is just wow...)\n\nI would be raging. A chin-length bob is the worst haircut I can imagine on myself. Maybe your father can take you to get extensions just to spite her.\n\nEdit: also the \"dramatic teenager\" card. Oh how I love it", "NTA. L mom. Narcissist probably", "NTA, but this is why you never let anybody, not even family cut your hair, you learnt a good lesson about only using professional services and not \"hiring\" layman.\n\nThat being said I agree that this was intentional, I'm guessing your hair was better than hers.", "She did that out of spite, there is no was she accidentally put the scissors that high and cut", "Yes its an assault to cut someone’s hair like someone said like that\nIts costs parents custody\nAnyone remember the teen with the highlights mom permitted but her ex didnt and it was forcefully cut", "Mom needa assault charges against her", "Because it is assault", "2 *inches*. That's what people cut for split ends. 4 inches max. OP's mom cut 2 **feet** of her hair", "Perhaps not (though I can't concur), but, courtesy is. Two wrongs don't make a right.", "Funny it’s not just in the uk", "She put my hair she cut off in a brown lunch bag and said \" Your boyfriend loves your long hair, here give him this when he complains.\" She was laughing. Very competitive-sometimes when I stupidly trusted her she pulled this kind of thing. You never knew when it was coming.", "Uh-huh... Suuure, buddy.", "Well, i only heard about the UK, but yeah sadly you are right", "Mom ASKED her to do it, Would it be ok if her brother, or her cousin asked her?  What about a 6 year old?  A 97 year old?  A hobo?  A hippo? A rabbit?\n\nIT\"S YOUR HEAD, YOU ARE RESPONSIBLE OF IT AT ALL TIMES!!!  You know that your mom is not a hair dresser, and If it was malicious on mom's behalf she would have known it.  She know her momma and knows when she says, \"I think you chop all your hair off...\"  she probably shouldn't be trusted to cut your hair.\n\nI could understand if she was 10 years younger, but... she's not.  This is a very good lesson for a 17 year old to take responsibility... to not cut corners.", "I (40f) was diagnosed with ME a while ago, and caring for even shoulder length hair became exhausting. (I have super thick hair which takes a lot of work to shampoo!) I've had it very short before, about an inch long, which seemed like the best way to go. I walked into my usual hairdresser and asked for an inch and a half clip. (That's the longest they do with clippers.) It was a nightmare from start to finish.\n\n\"Oh, but you have such wonderful thick hair!\"\n\"I know, that's why I want it short.\"\n\"Having it a bit longer means you can style it more!\"\n\"I can barely wash it, let alone style it, and it lives under a hat.\"\n\"Have you asked your partner what he thinks?\"\n\"SHE doesn't mind what I do.\"\n\"Won't he be surprised?\"\n\"SHE is sat just over there waiting for me.\"\n\"I'm going to cut it longer with the scissors and style it a bit, then you can decide if you want a little more off.\"\n\"No thank you, the clippers will be fine.\"\n\"Well, I can cut it that short with scissors, it's easier than the clippers.\" *Proceeds to cut it too long*\n\"Shorter please.\"\n\nI could go on, it was utterly ridiculous! Something similar happened when our then 7 year old daughter wanted her hair cut. They wouldn't listen to a thing she said, even with both parents stood right there saying to do what she wanted!\n\nCovering your ass I get, but hairdressers take it to a whole new level!", "What every parent should hope for ❤️", "I have raised 6 children including 4 girls.  I am a software engineer, and an artist (Singer/song writer) but as a teenager I made money by cutting boys hair all over the neighborhood.  I have offered to cut -ALL- their hairs, and without exception... from age 4 every one of them said \"HELL NO, DAD!!!\"\n\nBecause every one of them knew that I'm not a professional.  They all know that I have cut aunts and uncles hairs.  My son just had a graduation party and wanted a hair cut and his MOM and STEP DAD tried to talking him into asking him to cut it...  and I had just recently cut Mikes (The step dad) Hair.  And Jaydenn (17 at the time) said HELL NO!!!  \n\n\nI don't blame him.  It's -HIS- head, he's responsible for it."]}