{"id": 23919, "submission_id": "15ip2c8", "title": "AITA for \"stealing the spotlight\" at a wedding?", "selftext": "I (16F) went to a wedding of my parents' friend's son. A bit of background: I've been playing piano my whole life and am frequently asked to play at events. I haven't personally met the groom since I was a baby, and I've never met the bride nor her family until the wedding. \n\nA few days before the wedding, my parents told me I would be performing a piece on the piano during reception. I didn't think anything of it because I had previously played at other weddings several times, so I prepared for it not knowing there was a severe miscommunication coming up.\n\nThe groom's father, who was my family's friend, met me during the reception and guided me to the piano, where I begun to play the piece. I really thought it was totally fine because it seemed the father of the groom had organized the event and coordinated it all with the bride and groom's blessing. However, a bit after I started to play the bride walked up to me, looking very angry and demanded I stop. \n\nShe then blew up at me. She said that it was her wedding and her day and reprimanded me for having the audacity to try to steal the spotlight at her wedding. It became very obvious to me that she was not filled in/informed whatsoever of me playing. I told her I thought I was invited to play, and she said she doesn't even know who I am. The groom's father rushed over and tried to explain, but it was clear I had already upset her on such an important day.\n\nI really feel so bad. The last thing I wanted to do was ruin her big day. The reason I made this post is I really want to reach out to her to apologize, but my family is telling me not to because she was TA for yelling at me. Her words were harsh, but I can understand the frustration because who would want some random girl playing piano at her wedding? AITA? \n\n&#x200B;", "created_utc": 1691220528, "permalink": "/r/AmItheAsshole/comments/15ip2c8/aita_for_stealing_the_spotlight_at_a_wedding/", "score": 391, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to know if my playing at her wedding was inappropriate. It might make me the asshole because such an important moment in her life will be tainted by that negative experience, and I think I may be the asshole for being responsible.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your family is right in telling you not to apologize, because you have nothing to apologize for. You were told to play at the event, you were led to the piano by the person you thought organized the event, you played. You weren't even part of the miscommunication. \n\nI understand that a wedding can be a lot of stress, but the one that made this a bad situation was the bride, not you. She could've just let you finish playing and nobody would've thought anything of it, instead she decided to make a scene on her own \"special day\".", "NTA, there was definitely a miscommunication. But also the bride should stop and think about why a young woman playing a nice tune on the piano made her so insecure.", "NTA. If there is an AH, it's the groom's father who arranged the whole thing without coordinating with the newlyweds.", "NTA, not at all. I'm sorry you had to go through such a shameful situation like that.", "Got a feeling this extends beyond a wedding and deep into some interfamilial scuffles. Me thinks this wasn’t informed to the couple as it was the goal to steal the spotlight, and they used you as a tool to do it.\n\nYou’re sweet for wanting to apologise, honestly sounds like a good idea to at least reach out, maybe to the groom? Do keep in mind that any insults you might receive aren’t deserved and that you did everything right. \n\nNTA OP.\n\nEdit: do wanna specify the apology in the lines of “sorry this happened” and an attempt to explain. OP didn’t do anything bad here. Just wanted to distinguish", "NTA, the bride sounds really self-absorbed. There's no way you did anything wrong and it's not on you to do an in-depth investigation on who all is informed when someone from the \"inner circle\" asks you to contribute to the wedding and nothing seems fishy about it. Honestly I think a lot of brides would either react to the surprise as \"huh, that's nice\" at the very worst. It's not unusual to have live music played at a wedding or for friends/family to do something in honor of the bride/groom. Honestly if you don't plan on having a long-term relationship with her, I would just kind of sit back and let their family deal with it. You already told her you were invited to play and I don't think you have anything else to apologize for after explaining that", "NTA at all. You have a very good heart, OP. I wish you didn’t have to go through this. I hope you get a well deserved apology from the bride.", "NTA\n\nYou are 16, so still techincially a child. You were just doing as you were told.", "NTA but neither is the bride. The groom's father can't just arrange a performance at the wedding without checking with the couple that they want it!", "It’s tricky to figure out who the AH is here but one thing is clear — it’s not you.  NTA", "NTA\n\nAlso no need to appologize!\nAt best, say \"sorry for the miscommunication\".\n\nBut i'd suggest reaching to the couple and informing them (politely) who arranged it for you to play there.\n\nIf there has been any social media posts about it, do the same there.\n\nTell people who arranged it *and* state you have no intention in getting involved in what seems to be a very sticky situation.", "You're definitely NTA.", "NTA\nHiring musicians is pretty common at weddings, as is asking musical friends to play.", "no way you're the asshole, you did literally what yu were asked, I think it's the bride that has some anger management issues instead 😂\n\nIt's not like you walked down the isle pretending to be the bride or something", "NAH, you weren't informed so wasn't the bride. If it weighs on you that much, you can say you are sorry, but to be honest, you did nothing wrong, it was the groom's father, who did", "NTA\n\nThe groom's father made the arrangement and most people would be delighted to have a pianist play live at the wedding. Her behaviour was crass. She didn't wait for the explanation which the FIL was trying to give. She behaved badly.\n\nYou have nothing to apologise for and you are far too generous to this rather unpleasant woman.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (16F) went to a wedding of my parents' friend's son. A bit of background: I've been playing piano my whole life and am frequently asked to play at events. I haven't personally met the groom since I was a baby, and I've never met the bride nor her family until the wedding. \n\nA few days before the wedding, my parents told me I would be performing a piece on the piano during reception. I didn't think anything of it because I had previously played at other weddings several times, so I prepared for it not knowing there was a severe miscommunication coming up.\n\nThe groom's father, who was my family's friend, met me during the reception and guided me to the piano, where I begun to play the piece. I really thought it was totally fine because it seemed the father of the groom had organized the event and coordinated it all with the bride and groom's blessing. However, a bit after I started to play the bride walked up to me, looking very angry and demanded I stop. \n\nShe then blew up at me. She said that it was her wedding and her day and reprimanded me for having the audacity to try to steal the spotlight at her wedding. It became very obvious to me that she was not filled in/informed whatsoever of me playing. I told her I thought I was invited to play, and she said she doesn't even know who I am. The groom's father rushed over and tried to explain, but it was clear I had already upset her on such an important day.\n\nI really feel so bad. The last thing I wanted to do was ruin her big day. The reason I made this post is I really want to reach out to her to apologize, but my family is telling me not to because she was TA for yelling at me. Her words were harsh, but I can understand the frustration because who would want some random girl playing piano at her wedding? AITA? \n\n&#x200B;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don't know if this woman was going to yell at the DJ for playing the wedding playlist and stealing her spotlight. She was very very delusion to think that a wedding pianist and performer can steal her bride spotlight. NTA.", "NTA. It's not your fault that nobody checked with her and she shouldn't have blown up at you like that.", "NTA, this sounds like an issue between the bride and the in laws. I think you were set up specifically to upset the bride which is extremely unfair on you and not your fault.", "That's what I was thinking, why is it bad for someone to play the piano? Would have loved it myself...", "I think the grooms father and the bride are AHs.  \nThe bride could have gone up to her quietly and asked her to stop instead she yells at the poor girl even after it was explained she was asked to do it", "Eh, I dunno, surprise musical performances are a thing in some social circles.\n\nI had a surprise trumpeter announce my arrival at the wedding. And my husband and some relatives arranged a surprise chamber piece.", "It’s bad because it’s her wedding and no one asked her. Would you also love if your MIL got up and sang an I requested song for everyone? OP is NTA but neither is the bride for spotting someone she didn’t even know from an unscheduled performance at her wedding.", "If MIL could sing then yeah would be great actually but then I like people enjoying themselves and never needed everything to be all about me not even my wedding. I'd see it as free entertainment honestly. \nNow if they were awful I'd get someone to discreetly remove them and probably have a good laugh about it with my mates. So yeah still not going to ruin things with an overreaction.\n\nNow the bride could have asked hubby/in-laws if they knew what was going on as I would assume it was a surprise and want to thank them.", "NTA. You didn’t create this problem, the parents of the groom apparently wanted to surprise them with a live pianist for their wedding. It was a nice idea, but under most circumstances people who have live music at their wedding want the music to enhance the event, not *be* the event (or a spotlight moment at the event).", "You're NTA here, not one bit! \nIf something like that happened at my wedding, I would either just go along with it since it's such an obviously nice thing to do, or if I didn't like it I would approach the wedding organiser to ask who this girl at the piano is. Under no circumstances would I make a scene and make a child playing a song for me feel bad about herself!\nAlso the entire \"spotlight\" attitude is so narcissistic, are you being concentrated on your new husband and your love, or are you concentrated on yourself, your looks and checking how many people are watching you at any given time? Smh\n\nYou have nothing to apologize for whatsoever. The bride and her father need to apologize to you.", "NTA. You were invited to play. Both the grooms father and the bride are TA, him for asking you to play but not clearing it with the bride, her for blowing up at you when you tried to explain", "How are OPs parents not furious with their friend who put their minor child in this position?", "NTA - don’t stress - bride sounds unhinged", "NTA. I don't know what happened there, but think, somebody arranged for the piano to be placed there. There were plans into your performance. If it was a surprise for the couple, or not, the bride was an AH to yell at you. She could have waited for you to finish. Gosh.", "What is with the bride? I’d be THRILLED with a live performance at my wedding! So beautiful! NTA", "NAH except the brides father. You don't add a musical number to someone else's wedding! Especially since the bride didn't know you. All she saw was a complete stranger stage a concert in the middle of her wedding\n\nIn the future always confirm with the bride and groom", "NTA.", "YOU did nothing wrong.  You were given inaccurate information.\n\nThe people who \"ruined \" her day , the people who didn't communicate with each other are the ones who responsible.\n\nNTA", "Oh god NTA, this is entirely on the adults who couldn’t get their shit together. And the bride for yelling at a teenager playing piano. How embarrassing for her.", "NTA\nYou did not just walk up and start playing randomly. You were requested to play and taken to the piano by the father of the groom. Maybe the parent's of the groom did not bother checking with the bride but that is on them not you.\n\nYou don't need to say or do anything more.", "She could have stood up with her husband and danced to live music, a personal serenade on her wedding day. She could have applauded the first song and encouraged a full set of music and told the guests that it was arranged as a gift by FIL as a special welcome into the family.\n\nThis was a situation that feels not quite like choosing sourness when life hands you lemons, but more like life handing you cupcakes and choosing to stomp on them into the ground instead of licking the frosting.", "I don't think it was intended to be something like that. It could have just been a \"kind gesture that didn't go as planned\".\n\nWhen my cousin got married, her fiancés female relative (who our side of the family haven't seen before, and who I still have no information about) started to play the guitar to them in the middle of the dinner without informing any one before hand. It was seen as a nice and sweet gesture. So it might have been something similar, just trying to be nice and have some nice music playing.\n\nObviously, it can be some family dynamic thing as well. I just have a hard time seeing it. But op is obviously NTA here as she was told to do that and lead to the piano", "Are you serious?  Obviously she either knew nothing about OP being scheduled to play or the groom's father suggested it, got downvoted, and he had OP play anyway.  The bride obviously didn't handle it well, but she was also under no obligation Miss Mary Sunshine about the surprise piano recital.", "It’s probably as you say, but it’s kind of odd that she was just plonked down at the piano and told to play with no introduction at all. The dad didn’t even call the couple over to listen. It would look to anyone who wasn’t in on it like some random teen just decided to put on a show. But maybe groom’s dad is simply that clueless or he went off to find them but bride got there before he had time to snag her. Could be innocent, but looks peculiar", "Yes, this. My cousin had her fiancés female relative play the guitar to her/her fiancé during the dinner (our side of the family don't know anything about her other than she is related to the fiancé).\n\nShe also had her brother attempt (very poorly) to give her a trumpet announcement when she walked down \"the isle\" (we were outdoors in a park so she walked out from behind some bushes on a dirt road lol). It was just intended as some fun and sweet gestures on their big day", "Have you ever been to a wedding where there was a piano just sitting there, nobody using it?", "I read this as\n\n'It's her day, she doesn't need to act like a rational adult.\"", "Sounds like clueless people leading a teen to preform. It would be really weird and pretty rude to just start playing the piano unprompted for no reason no matter how well you play. And that could be what it looked like to the bride and I can understand her being pissed off. I'm pretty willing to go NAH, but things should have been communicated better.", "NTA,  neither is she. You were asked and should've been consulted. Maybe it was a \"surprise \" that horribly backfired. The apology is not on you but if you want to go for it.", "NTA\n\nThis isn't on you in any way, shape or form.\n\nIt's not like you just played on your own initiative.", "NTA there was miscommunication but nothing was your fault, it was the family friend. He never should have arranged that without discussing it with the bride and groom.", "NTA. It seems that you have been drawn into some weird family politics, and for a family that isn't even your own.\n\nYou don't owe anybody an apology and I hope you continue to kick ass at pianoing (pretty sure that's the right adjective...) in the future.", "*..instead she decided to make a scene..*\n\nThis is the part that always amazes me. A bride in a big white dress, in full regalia, stomping up to someone like a bouncer at a club. She can send a bridesmaid, but no. I can only imagine how it looked to the guests. \n\nOP, please don’t apologize, you did nothing wrong. It takes a special kind of crazy to be jealous of a 16 year old kid. I guarantee you that if some guy were sent to play the piano, the bride wouldn’t have batted an eyelid. Smh \n\nNTA", "Unless he paid for it all....also it was a simple piano piece at a reception with music, it wasn't a stripper.", "Seriously? The bride who attacked and upset an actual child in front of a wedding full of people is NTA? That’s the stance you want to take publicly?", "The piano playing probably wasn't an event until the bride started shouting. OP started playing with no introduction or fanfare, the guests probably thought it was nice background music, if they thought about it at all.", "Those who did not communicate with each other are responsible.", "I mean, if you see a teenage girl playing piano in any circumstances and yell at her for stealing your spotlight, you’re probably gonna be the asshole.", "“She was under no obligation to behave like a decent adult and not verbally attack a literal child in front of a wedding full of people.”", "I'm NOT defending the bride, and I'm not calling OP an AH.  I'm simply not agreeing the bride should be thrilled at a \"surprise performance\".\n\nEdit - left out the very important NOT in my comment.  My fingers didn't keep up with my brain.", "nailed it", "I think that guy is being dumb but I've been to plenty of formal events where there was a piano nearby and noone using it.", "I have, but what does that matter?  What point are you trying to make?", "A lot of places that might be used for wedding venues just have one. Like it lives there all the time, whether there's a wedding or not.", "I don't think the OP was an AH, and I said the bride didn't handle the situation well.  I was addressing the post above mine.  It's ridiculous the bride should have danced, clapped, and encouraged more music when it was obviously something she didn't want at her reception.", "Great! I hope all those things happen at your wedding but weddings aren’t generally great places for surprises. I don’t think the bride was an asshole at all and her FIL owes her and OP an apology.", ">It would be really weird and pretty rude to just start playing the piano unprompted for no reason no matter how well you pl\n\nAt a public venue with a piano there to be played?  Why is that rude?", "And he's saying that you defending the bride is ridiculous.", "Its even more ridiculous to throw a strop and act like a 2 yeat old having a tantrum in front of everyone", "The bride was a giant AH.  Who goes off on a 16 year old playing piano as if she has some devious plan to *steal the spotlight* from a bride.  What sort of weirdness is this.", "Because it is a wedding reception and at most receptions there is a very clear “switch” to music that either includes a band or a dj. It’s usually after the food and speeches. \n\nIdk the timing on when she played. She could have been playing while people were eating to sort of ambiance or background noise. \n\nBut in real life people don’t just expect someone to jump on a piano just because it’s there. That would mean that any random person at that wedding could do the same, and that’s probably what the bride thought she was doing. Being a random teenager who felt the urge to play. She was an AH but she didn’t know OP.", "It's rude if that's not part of the schedule of the day. (I don't mean OP. She was fine; she was led to believe she was scheduled. I mean in general.) So you go into a wedding and there's a piano sitting there. You'd just start playing? Even if there was already music playing, or a speech happening? A lot of buildings have pianos in them; it doesn't mean it's always the moment for you to play a solo.", "NTA\n\nYou were invited, just not by the bride. What happened wasn't your fault, and her behavior was out of line, so there is no need for you to apologize to her.\n\nIf I were at a wedding with a pianist, I would assume it was something to make the day special, rather than something to upstage the bride.\n\n&#x200B;\n\nI give it eight months.", "Obviously NTA. Like what too often happens with weddings, the couple's family took liberties and made plans without bothering to clear it with the couple. That was 100% their fault. You don't owe anyone apologies and neither does the bride. Your parent's friends are the ones who were out of line.", "....I am so over this \"steal my spotlight\" nonsense....I find the vanity repugnant....the NEEDING to be the center of attention is pathetic to me\n\nNTA OP...you did nothing wrong. You were guided by trusted adults and it was not on you. The bride was a complete AH for treating you the way she did and do not apologize or feel bad. She needs to grow up.", "Unless it was a 9 ft grand piano, in the center of the room, with a spotlight on it, and you were pounding out Chopin's Polonaise with full force... you weren't stealing any bride's spotlight.\n\nShe's being ridiculous. Was she mad at the band or DJ for playing music? Have a problem with the groomsman's shiny shoes being too distracting? And how dare that damn sun shine so bright, doesn't it know she's the focus? And don't get me started on that carpeting in the church, how dare it be so attention seeking...  \n\nNTA.\n\nPersonally, I don't know why you were expected to attend (or dragged to) a wedding where you have a virtually no connection whatsoever with either party, or even know them. And what's with this \"command performance\" nonsense, you were \"told\" you were playing... not \"asked.\" What's with that?", "Omg 😆 can you imagine having the audacity of accusing a 16 year old of “stealing her spotlight”? Oh you can’t? Yeah neither can I. My god, it is not ops fault that you are insecure", "The fault lies with the bride for losing her shit at someone doing something as innocuous as playing a piano that was clearly at a venue and not cordoned off.  People who are so sensitive need to prepare for that and in this case the bride should have had the piano moved since she is sensitive.", "NTA she actually ruined her wedding by throwing a fit!", "NTA.  Not your fault.  The guy who stuck you at the piano is to blame 100%.", "NTA: I'm so sorry this happened to you. You didn't do anything wrong.", "NTA don't apologize", "NTA, whoever organized it and didn't tell the bride was. She could have handled it better though.", "NTA. It was obviously a miscommunication by the adults. OP did nothing wrong.", "What did you play? Great Balls of Fire? \n\nThat poor groom. It’s possible he could deal with the bride for the rest of his life.  :|", "NTA\n\nIf the adults didn't communicate with the bride-groom is their mistake, not yours. Is sweet that you feel like apologizing for making her feel bad but I agree with your parents that maybe she should have approached in a better way instead of just yelling at you.\n\nIt wasn't your fault, you just followed the instructions that they gave you and they should be the ones apologizing to you.", "NTA\n\nNeither is the bride. The groom's father definitely is, though.", "NTA - you could apologise to smooth things over but it i the dad in law's fuck up!", "NTA Sounds like she was being a drama queen, not you", "NTA, I don't think you *need* to apologize, but it might make you feel better to reach out and just explain the situation. She very much over reacted but I'm a people pleaser so I would feel like you do I think. \n\nIf you do reach out just explain what happened and that you assumed it was a request from her and the groom, apologize for the miscommunication but also stand firm that you didn't do anything intentionally wrong and she needs to apologize for her reaction to the situation.", "NTA. Okay maybe I'll get downvoted for this but Opie I think it's better to just call or try to communicate to the bride. After everything I agree you don't have to apologize because basically you were invited into the wedding and also told by not just your parents but also the father of the groom to play a piece on the piano for the wedding day. \n\nI don't know how they do it in other countries but usually the bride should be at least informed and clearly from the way she did the yelling she wasn't informed so I would say that she is kind of the a-hole because she should have at least waited until you came down the stage and then had a discussion about it because that was so not called for and it's not like you were begging to perform at her special day. All I can say is that you just reach out and then you voice out your concerns, you don't apologize you just apologize for the whole misunderstanding but you did nothing wrong you were told and it's not like you could have called the bride and groom beforehand to say thank you for the opportunity and such like that but it is what it is and you shouldn't feel bad you should at least know where to start from and try to see if you can salvage at least a courtesy talk. Yeah if you want. But still NTA", "I paid a guy to play the piano at my wedding - we enjoyed it. This \"nothing can distract the attendees from uninterrupted adoration of the bride\" thing is perverse.", "ESH except OP. Even if the bride had this sprung upon her and didn't want it, going off at and publicly humiliating a literal child tips her over into AH territory. But I guess it did ensure the spotlight was back on her!", "The bride isn't an asshole for being upset, but she definitely made an ass out of herself by how she reacted.", "I think it's a lot more likely that it was already there (and FOG knew it would be) than that someone moved a whole-ass piano for the occasion. Hotels, churches, fraternal halls, all kinds of places just have one around.", "She had no clue fil arranged it. A piano song at a wedding is usually not a dance song. \n\nAnd when you pay $20-50,000 for a wedding, and something goes wrong, you don't stop to think \"let's make lemonade\". You try to fix what was wrong. \n\nRemember, the bride had no clue who op was, or that this was happening.", "She wasn’t obligated to but she certainly chose to be a dick about it. She freaked out at a teenager. She made a scene, not OP.", "Meh my ex-husband’s cousin (close family) got up and drunkenly sang a song at our wedding- it was unplanned and I didn’t love it but I didn’t freak out - it was over in 4 minutes. It didn’t ruin my day or anyone else’s. Most people made no comment on it at all. A few thought it was goofy. A few loved it. It didn’t require anyone to freak out that’s for sure.", "Their* wedding. \n\nGrooms obviously ok with it. It’s a piano. If that offends her this much she needs to get over herself.", "its the grooms wedding too, yes he shouldve told the bride but its not ONLY her wedding", "It's her day she doesn't need to cater to anyone one who is doing something they were not supposed to. She had every right to be pissed. The only A here is the grooms dad for doing this to both of them.", "I keep saying it:  OP isn't an AH, and the bride could have behaved better.", "Obviously it’s both their wedding but I’d put money down on the fact that she’s done the burden share of actual planning for the wedding.", "Lol no, the AH is the adult who yelled at a child", "she didnt have the right to yell at a child so shes an asshole too", "*should* have behaved better", "It's not a public venue, it's a private event with a schedule of events (that apparently didn't include piano music, but that's not OP's fault)", "> you go into a wedding and there's a piano sitting there. You'd just start playing\n\nI'm terrible at piano but if my sister started playing I'd see no issue with it.  \n\nThe venue put it there to be played.  If you're too sensitive to handle it being played lest it steal your thunder the onus is on you to make sure it's moved or to make sure to tell everyone that playing any musical instruments will steal your thunder.", ">Because it is a wedding reception and at most receptions there is a very clear “switch” to music that either includes a band or a dj. It’s usually after the food and speeches. \n\nShe is 16 and most pianos set in the middle of a public venue are meant to be played.  Also many weddings have background music during cocktails. Perhaps you haven't been to such weddings. \n\n>But in real life people don’t just expect someone to jump on a piano just because it’s there.\n\nIn real life pianos on the middle of public places are there to be played.  Unless they are in a museum or cordoned off.  It's exactly why pianos that aren't meant to be played are cordoned off because otherwise people correctly assumed that they are there to be played. \n\n>That would mean that any random person at that wedding could do the same, and that’s probably what the bride thought she was doing.\n\nWhich is what the piano was there for.  And doesn't mean that anyone was trying to steal her thunder.  A random person playing a piano is not trying to steal your thunder and yelling at then for doing so is ridiculous. \n\n>Being a random teenager who felt the urge to play. She was an AH but she didn’t know OP.\n\nAnd so the correct impulse was to assume that someone randomly playing a piano in the middle of a public venue was out to steal your thunder?  If the bride was this sensitive she should have had the piano moved or cordoned off.", "At a venue the public is allowed into.  A public venue.  OP was there, the piano was there are not cordoned off.  Since the venue is open to the public a reasonable assumption is that members of the public would play it.  Be it at an event or otherwise.", "The venue put it there because some events will need one, and it's easier to bring a piano in once and leave it there than to move it all the time. It doesn't mean channel Rachmaninoff when the DJ is spinning Uptown Funk.", "So much hostility lol\n\n… I literally said the bride was an AH so idk why you’re arguing with me about it. We also don’t know where the piano was placed exactly so “in the middle” doesn’t mean anything. I also said she could’ve been there for background noise and ambiance, again… don’t know why you picked a fight about that. \n\nAgain, none of this was OP’s fault, it clearly lies with the FIL but to think that just because a piano is present at a **wedding reception** meant anyone was free to play it during anytime is crazy lol. Imagine wanting to get to the speeches but you have to wait because somebodies third cousin decided they wanted to do a random 15 minute jazz session because a piano just so happens to be nearby. Or having a band that’s been paid and ready to start their set but not until your niece finishes her recital piece for everyone lol", ">The venue put it there because some events will need one, and it's easier to bring a piano in once and leave it there than to move it all the tim\n\nSo then it's there to be played it wasn't roped or cordoned off.  Pianos have wheels, it wasn't wheeled into a discrete corner.  It was there to be used.", "In this case, the FOG may have moved it because he planned it. I mean in general. If you go somewhere and there's a piano in the corner, and no one is expecting you to play it, read the room."]}