{"id": 24086, "submission_id": "15kjm8b", "title": "AITA for not wanting to pay for the entire bar tab at my MIL wake.", "selftext": "My husband’s mother passed away from a long battle with cancer. I do not get along with my SIL and my MIL never accepted me. My husband and I show up to the wake. It was being held at my MIL’s favorite bar. My SIL pulls my husband and I aside to inform us that we will be paying for the entire open bar tab for about 75 people. My husband and I are speechless. We live paycheck to paycheck and would have to put it on a high interest credit card. My SIL brought a lot of home made food to feed the guests, so she felt she had done her part. I suggest that the tab be stopped at $400 and then the guests would have to pay out of pocket. My SIL bulked at this suggestion. This was the first time I had experienced a funeral in the Midwest. I had no idea the family of the deceased fed the mourners who came to the funeral/wake. Where I grew up in California the guests bring food as a way of comforting the family directly affected by the loss. After the wake was over my husband and I spent 2 hours washing all the dishes, while my SIL sat at the bar drinking beer. The final tab plus tip was $1275.00. AITA for not wanting to pay this.", "created_utc": 1691412010, "permalink": "/r/AmItheAsshole/comments/15kjm8b/aita_for_not_wanting_to_pay_for_the_entire_bar/", "score": 104, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for not wanting to pay the entire bar tab? I feel my SIL should have paid atleast half or the tab be turned off at $400.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Absolutely NTA. You are not on the hook for any costs you didn't know of and agree to in advance, as part of the event planning. Full stop. \n\nIt seems like the family dynamic for you with your husband's family is tough. Ideally he would have been coordinating with his family around the details of the event including who was paying for what part. Obviously SOMEBODY planned it. SIL? Holding an event in a bar - where the majority of the expense is alcohol - and bringing homemade food feels calculated, set up to minimize the sister's expense while maximizing yours. \n\nYour offer of a compromise was generous and reasonable. At this point you should pay $0, or if you're feeling kind, contribute $400 as you offered towards the total.", "Nta. I would have turned around and left. You should NOT have paid. You were wrong to pay.", "NTA. You and husband should have walked out. Let SIL pay. Over $1000 for booze??? Naw, that's not cool", "NTA. No reasonable person does something like that, particularly with someone in the financial situation of you and your husband. You obviously didn’t book the bar so you’re not legally responsible for the tab, so hold your ground. If you want to give your SIL $400 to assist with the cost, that’s nice.", "NTA - born and raised in Midwest and I cannot recall a single time I have been to a funeral/wake and there was alcohol that I didn’t pay for. That’s not a regional tradition whatsoever. Your SIL is a completely tool and your husband should’ve stood up to her and told her off. You need to have a serious discussion with your husband about boundaries moving forward (if you haven’t already).", "turn around and leave. just like that. why would you pay? NTA", "Dafuq Nta and don’t pay. Your mil’s estate can pay. \n\nI’m betting the food cost $200 and that sil is planning to plunder the estate and has already lifted her mother’s cash and small valuables from her home.", "NTA. To be clear, that's not how things work in the midwest. Yes, it's common for the family of deceased to pay for food/drinks, but you don't spring it on someone that they have to pay without having any previous discussion about it.", "NTA, if your SIL wanted an open bar she should pay for it!!!!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband’s mother passed away from a long battle with cancer. I do not get along with my SIL and my MIL never accepted me. My husband and I show up to the wake. It was being held at my MIL’s favorite bar. My SIL pulls my husband and I aside to inform us that we will be paying for the entire open bar tab for about 75 people. My husband and I are speechless. We live paycheck to paycheck and would have to put it on a high interest credit card. My SIL brought a lot of home made food to feed the guests, so she felt she had done her part. I suggest that the tab be stopped at $400 and then the guests would have to pay out of pocket. My SIL bulked at this suggestion. This was the first time I had experienced a funeral in the Midwest. I had no idea the family of the deceased fed the mourners who came to the funeral/wake. Where I grew up in California the guests bring food as a way of comforting the family directly affected by the loss. After the wake was over my husband and I spent 2 hours washing all the dishes, while my SIL sat at the bar drinking beer. The final tab plus tip was $1275.00. AITA for not wanting to pay this.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Absolutely NTA\n\nFirst of all, I'm as confounded as you. I come from a religious tradition (Judaism) where mourners (immediate family) aren't meant to do ANYTHING for the first 7 days after the funeral, including cooking for themselves, and the community generally rallies around to provide food not only immediately after the funeral but for those 7 days of mourning for the family while they focus on grieving.\n\nI can't imagine treating a wake/post-funeral gathering like a party where the deceased's grieving children are expected to act like \"hosts\" and provide food and drink for everyone else. Honestly, I get that different cultures have different traditions, but expecting someone who just lost a parent to cook for other people like they're \"guests\" or pay for them to drink at the bar just seems horrifying to me, even if you COULD afford it. Like, who expects that of someone who is grieving their parent? \"Hi, I'm here to reminisce about your recently deceased mum with you . . . mind buying me (and everyone else) a beer?\" Wut? Again, even if toasting the deceased is your tradition, they should be paying for you! \n\nBut the bottom line here is that *you are never responsible for paying for anything you didn't agree to*. I assume that your SIL arranged for the wake to be at your MIL's favourite bar. Unless you consented in advance to share the cost of an open bar, you are not responsible for it. She can pay, the money can, as another commenter suggested, be taken from your late MIL's estate (which is really the most appropriate thing), or you can offer to contribute a small amount that is within your budget. But you are ABSOLUTELY NOT responsible for the whole tab just because she decided that. I guarantee she didn't spend $1200 worth of time and money on the food.", "NTA. Was the MIL indigent? Otherwise, why wouldn’t funeral expenses be submitted to her “estate” for reimbursement?", "NTA. Absolutely not.", "INFO - The OP question is \"not *wanting* to pay\". How did that *not wanting* work out into action? Specifically did the bar get paid its money?", "NTA. \n\nI have been to more midwest funerals than I can count, and while many have had bar time the family of the deceased was never expected to pay. In fact, for all funerals I’ve attended that moved to a bar people usually pay for the drinks of those closest to the deceased. It’s absolutely ridiculous that SIL put the bar tab on you.", "NTA  all that should have been discussed before hand so it will give everybody involved the chance to look for budgets and places that can be afforded by everyone involved.", "She never wrote a Will. And died with minimal assets.", "I told my husband to stand up to his sister and make her pay at least half. But he didn’t. He put the entire bill on our credit card.", ">INFO - The OP question is \"not wanting to pay\". How did that not wanting work out into action? Specifically did the bar get paid its money?\n\nSorry, but then it is too late. You just should have left then. Hope you will get something from the will to cover this costs. Best if there is money, show this bill as part of funeral costs - maybe you get it covered by her inheritance. But as I know the American healthcare she might be out of any money after such a battle", "Then honestly, your husband is the problem here. First, this is not necessarily a Midwest thing. Every family/religious group are going to have their own traditions. Since this is your husband’s family though, he should have been aware in advance, or at least kept himself in the loop for his mother’s arrangements. I mean, they had the wake in a bar. He should have discussed this with his sister beforehand.", "unless it is in your name, i would just leave.", "NTA.  \n\nYour SIL offered the open bar, she is responsible for paying for it. She has no right (legally or morally) to decide that someone else has to pay for something without prior discussion and agreement.\n\nI'd probably have your husband pay the $400 offered to be nice, but not a penny more.", "NTA- your husband is.\n\nHonestly expenses come up with funerals.\n\nAfter the $400 limit you suggested I'd say every birthday and Christmas gift for your husband is going to be paying off that debit.\n\nI hate to say it but I can't help but wonder if your sister and mother-in-law planned it", "NTA but it's concerning that your husband didn't work this out with his sister in advance. It's ideal for wake/funeral costs to be paid for from the deceased's estate, but not unusual for the family who's hosting the wake/funeral to contribute as needed. It's a little odd to me that your husband just turned up at his mother's wake without (apparently) having been involved in planning it: was all the planning left to your SIL? Because that might explain her otherwise very strange behavior.", "NTA\n\nSIL is the AH for not discussing it and making arrangement prior.  \n\nI am not familiar with having these types of events at a bar.   I hope the family is holding up ok.", "NTA", "I'm from the Midwest and have spent most of my life here. I've been to plenty of funerals and wakes, and at precisely none of them was there an open bar where the family of the deceased was covering the tab. This is literally the first time I've ever heard of this being a thing, to say nothing of your SIL springing it on you *at the wake* that you and your husband were covering the tab.\n\nNTA, and don't pay that tab. That's ridiculous.", "Oh dear god! I would have upped and left there and then. NTA.", "NTA. I'm from Wisconsin. This is *not* how our funerals go. It's absurd. You should not pay a bar tab for 75 people. Have you already paid it?", "NTA-  I just don’t understand how you and husband has to pay.  Who talked to the establishment for the open bar?  Was there a contract and who signed it?  I would not be washing dishes and I would give them the $400 as I promised and would have left.  They cannot hold you responsible for someone else agreement.", "this is NOT a midwest thing. this is a THEM thing.", "Whoever opened the tab is responsible for it. It's time to perfect your Irish goodbye and sick the next person with the bill. Nta", "NTA, No way you should pay for that at all. I don't know any Midwest etiquette either but will confirm that growing up in Southern California, guests usually brought food and drinks to the wake.", "NTA. You neither arranged it nor agreed to pay", " NTA. That’s absolute bullshit. NO ONE has the right to stick you with that bill. Contribute what you think is fair and reasonable, and stand your ground.", " Sister wanted to put on a big rich act order what you want drink and be merry I bet she didn't once tell anyone it was not her paying", "NTA.    You were generous at even being willing to pay $400.  Your SIL is an AH.  That tab thing should have been  discussed before anyone was invited.  I lived in Midwest my whole life and never heard of having a wake at a bar.", "NTA - that is not how it works.", "NTA.\nAnd this might have been SIL/MIL plan. To make you look bad at her wake", "INFO\n\nWas your husband involved in organizing the funeral and the wake? \n\nGenerally speaking, may there be reason for your SIL to be resentful towards your household in relation with the MIL situation? Were there medical bills or funeral expenses that you couldn't contribute towards and they fell on her?", "NTA, this is not a cultural practice of the Midwest... everyone would've paid for their own tab in this situatino.", "NTA. Not the way it works. My memorial service will be in an Irish pub, and the money for this has already been put aside. Also, apps to nibble on. I want a joyous celebration with no tears. \n\nThe food people bring to the house is comfort for the family. \n\nFor my bf's father (then Mom's) funeral, the \"committee\" at the church made tons of food for a reception in the church hall.  It was lovely.\n\nIn my family, we had a luncheon, which was paid for from my parents' estate.", "[removed]", "Same. I’ve lived my entire life in the Midwest and anytime I was fed after a funeral it was paid for by the estate. For most funerals wine and beer are free, but where you’re responsible for the cost if you choose to get hard liquor. But again that tab was paid for by the estate. And I’ve been to plenty of funerals where there are afterwards drinks at the bar and various relatives buy a round to toast the deceased. But I have never heard of one sibling being asked to pay a fully open bar tab out of pocket, especially not having that sprung on them. Even in the more passive aggressive parts of the Midwest, that would be considered so incredibly tacky. If I were you, I wouldn’t pay it all. You didn’t choose an open bar and you offered a $400 cap which is extremely generous in the face of SILs rudeness. Anything beyond that is on her.", "Exactly this.", "honey you got played... I'm from the Midwest too. You didn't have to do this. Funerals and wakes aren't one size fits all.", "Your SIL is an asshole and you and your husband are both spineless.\n\nWhen someone tries to run game on you the answer is a hard no, not a negotiation. Alkies can pay for their own booze.", "Then NTA. You didn't let your family confusion effect the vendor so there is no way that you are TA.", "Sounds quite unfair…. You were told of it when u got there and literally had no say. Your sister in law likely paid $200 for the food. Sounds she purposely put the biggest expense on ur shoulders.", "Absolutely. No one should have been obligated to pay a bill but the husband here should have been involved and asking questions the minute planning started."]}