{"id": 24127, "submission_id": "15kwawg", "title": "AITA for telling somebody they weren’t really homeless?", "selftext": "There’s a kid in my high school who got an article in the school newspaper published about him because he was ‘homeless’ and managed to get into an Ivy League school.\n\nFrom what the article says, his parents had to leave the state and he was left without a solid place to live but basically lived with a couple of his friends’s families throughout the year. He then wrote his college essay about how he was homeless and got into an Ivy. \n\nI understand homeless doesn’t have to mean living on the streets, but from the article he was chilling at a couple people’s houses for months at a time each, and didn’t have to seriously worry about where he was sleeping next. So I don’t see that as homeless.\n\nThe next time I saw him, he asked if I had read the article, and I confronted him, saying that jt sounded like he wasn’t really homeless and was embellishing for the sake of college essays. He got angry and called me a huge AH and said that it was still a struggle because he felt ‘out of place’ living with his friends and eating their food and all. I told him, sure, that’s a struggle, but that’s not what being homeless is. He called me an AH and walked away.\n\nLater, a lot of his friends started slamming me online, saying I was a huge AH for invalidating his struggles.\n\nAITA?", "created_utc": 1691440643, "permalink": "/r/AmItheAsshole/comments/15kwawg/aita_for_telling_somebody_they_werent_really/", "score": 741, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > This guy from school claimed to be homeless in his college essays and got into some prestigious schools, and I told him he wasn’t really homeless. This might make me TA because according to his friends I’m invalidating his struggle\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, couch surfing is still homelessness as someone who has been homeless.", "YTA -- Educate yourself then apologize to him. He matches a definition of homelessness (source: [https://rednoseday.org/news/what-are-four-types-homelessness](https://rednoseday.org/news/what-are-four-types-homelessness))\n\nHidden Homelessness: *Individuals who live with others temporarily without a permanent home are considered “hidden homeless,” as it is often most unnoticed. Since they lack access to housing support resources and cannot be identified, they are 'hidden' from national statistics on homelessness*.Many in the “hidden homeless” population **are younger people who have experienced a sudden catastrophic life change**, trauma, or challenges as a result.", "YTA Gatekeeping homelessness? I think you need to take a moment or two and learn about the types of homelessness. It's not a one size fits all situation. Hidden homelessness is when people temporarily live with other people.  In sum, you need to educate yourself before you make broad generalized statements about an issue so you don't look like an ass.", "This is called \"unstably housed\" and for (most) intents and purposes this is considered to have the same vulnerability as street-surviving folks.\n\nWhatever you may think, he actually ALWAYS had to worry about where he slept that night. He had to worry about being an immaculate house guest, not overstepping in the slightest, etc. Have you ever lived anywhere that you could just be booted from in a snap, that way? That is stressful af.\n\nDon't make assumptions because you're envious of him being more famous than you.", "YTA\n\nSo why didn't you just tell him you were jealous?", "YTA\n\nhence the shift to using “houseless” to describe those living on the street \n\nyou clearly come from an ignorant standpoint wherein you don’t understand the importance of a solid, reliable home. \n\nthe emotional value, social value, it is a *need* especially when you’re growing up and going through such a tumultuous time as is \n\nthis individual has not embellished their struggles whatsoever and you have got to expand your world view and the way you empathise with people", "Yes, YTA. While he had a place to live and eat, he was pretty much at the mercy of the people who let him stay with them. There was always a chance that he would have to leave. And I’m sure it wasn’t the same feeling of security for him than living under your parent’s’ roof would be", "YTA - the kid was couch surfing because he was homeless.", "YTA \n\nWhat’s it matter to you? What did you possibly see the outcome of confrontation to be? You got the information about how he lived from the article so he wasn’t misrepresenting his struggles.", "YTA: He was without a home, aka homeless. He was staying at people's houses by their generosity. They could at any time tell him it was time to move on. There was no security or stability there.\n\nAnd as another poster wrote: What was the point in calling him out? Did it change anything? Do anything for you? Sometimes it's best to keep your opinions to yourself.", "YTA you don't know his life", "YTA. First, because you’re wrong about him being homeless. He was.\n\nSecond, because it takes a lot more than a hard luck story to get into an Ivy. He obviously has other merits as well.", "YTA \n\nCouch surfing is still homelessness", "Today we’re gatekeeeping *checks notes* homelessness. \n\nYou sound jealous. You’re not “calling out” anything. You *are* invalidating him/his experience because it doesn’t align with your definitions and assumptions.\n\nYTA.", "Almost the exact thing happened to me my senior year. My parents moved and left me and my dog. I live in an RV at a KOA my last year of high school and no one knew except my boyfriend (at the time who was graduated from high school). I had an RV to sleep in every night but I would consider this as me being homeless. I was too ashamed to couch surf. YTA I would've just left it alone tbh...", "Couch surfing is literally one of the main definitions of homelessness YTA", "YTA\n\nFirst, you don't get to define homeless. Couch-surfing, even at extremely supportive friends homes, is still homeless. He doesn't have a home near there and is relying on the good grace of his friends. \n\nSecond, in your comments you mention in the article he talks about getting financial support, via unlimited credit card and whatnot. So in an article about his college essay, it brings up those concerns, how do you know he never mentions that in the essay? Unless the article states he was openly deceptive, it sounds like he's being pretty upfront about the situation he's in. He's referencing that his friends are letting him stay for months, that his parents gave him an unlimited credit card, he's not pretending to be sleeping under a highway overpass. \n\nHonestly just sounds like sour grapes on your end.", "YTA. He has no guarantee of a place to stay when he’s couch surfing at the grace of his friends’ families. That would be an incredibly difficult existence for a young person.", "Homeless doesn't necessarily mean on the streets.\n\nSofa surfing is still homeless.  He is staying in other peoples homes and depends on their generosity.  He cannot relax and be at home.  \n\nYTA", "I rarely want to break the “don’t be mean to the poster” rule, but man it is hard for this one.\n\nYTA. The kids parents were gone, we was staying with friends and constantly switching. In fact, there was a non-zero chance he could have ended up on the street.\n\nYou are young, so I’ll forgive it, but you are well past asshole in this.", "You’re just jealous because he got into an Ivy League school and you weren’t good enough to make it, even with a more stable home life. It’s kinda funny ngl", "YTA his parents fucking abandoned him and he had to couch surf. He didn’t have a home you said yourself he didn’t have a solid place to stay and that must be so stressful and upsetting. He went from not having an actual place to live to Ivy League and it’s still impressive.", "YTA. He didn't have a home, he was a guest in various places. Whether or not you see that as homeless, it's homeless. You don't have to seriously worry about where you're sleeping next in order to be homeless, and as a guest couch-surfing at other people's houses you actually DO have to worry about where you're sleeping next, because for any reason at all from 'we can't afford you staying here any more' all the way to 'I'm tired of you being here, get out' the person whose guest you are can in fact take away that bed in a heartbeat.\n\nEven if you personally didn't think it was homelessness, it was also none of your business. You didn't have to confront him or say those things. You chose to. You say you understand that homelessness doesn't mean living on the streets, then say he wasn't homeless because he could couch-surf and wasn't living on the streets.\n\nHe still managed to get into an Ivy League school despite being home and food insecure and, definitionally, homeless. Nothing he went through hurts you in any way, the article doesn't hurt you, his getting into an Ivy League school doesn't hurt you, so why did you use it to hurt him?", "YTA. Couch surfing is homeless. \"Van Life\" is homeless. What your friends is, is homeless", "YTA and you sound jealous.  He was clearly homeless and lucky to have a strong support system.  You should be congratulating him for overcoming the obstacles in his life and achieving success in his educational goals.  You should also be grateful you haven't experienced that level of instability and insecurity in your lifetime.", "YTA\n\nBeing homeless means not having a permanent place to stay. He didn't have a permanent place to stay because he had to leave when he could no longer stay with friend after friend.", "YTA. You hater.", "Yta. As someone who had to do that in high school, yes that is homeless. You never know if a small disagreement will lead to you being kicked out. You’re always worried that you won’t have a place to stay tomorrow. They can kick you out with a minutes notice.\n\nAlso legally, a child who is doing this is classified as homeless", "YTA for invalidating his struggle and thinking it’s your place to insert your opinions on homelessness/his situation in general. Why do you care so much?\n\nETA: OP has their own struggles with homelessness, which they are using to further invalidate this kid’s experience by basically saying, “you couldn’t have been homeless because I know what *real* homelessness looks like”… so yeah, still YTA. It’s not a competition.", "AH I am a teacher and had to take training. That meets the definition under the McKinney Vento Act.", "Sounds like you're jealous? YTA come on now", "YTA. A major one. \n\nThis child experienced housing insecurity. That is a significant hardship. The fact that their parents moved and left then behind without stable housing and adult supervision hints at other issues. \n\nMentioning those hardships  in an application essay provides the colleges context for evaluating his achievements. \n\nYou accused him embellishment, but did you read his application essay! Of course not. It wasn't written for your eyes.", "YTA. You don’t get to decide if someone is actually homeless or not. You can privately disagree with the definition, but you’re definitely an asshole for confronting him about it. He had to rely on other people for a place to live. If any of those people had kicked him out, he would’ve had to go to a homeless, shelter, or been on the streets. \n\nI was homeless for a few months when I was in high school and I don’t wish the experience on anyone.", "EDIT: To add vote.  YTA.  I mean, you said it yourself, it doesn't necessarily mean \"on the streets.\"  And, (as you can see by the US Gov't definition), it doesn't.\n\nYour friend fits the \"lacks a fixed, regular, and adequate nighttime residence.\"\n\n&#x200B;\n\n* The United State Department of Housing and Urban Development (HUD) provides four broad categories of homelessness:\n   * Individuals and families who lack a fixed, regular, and adequate nighttime residence,which includes a subset for an individual who is exiting an institution where he or she resided for 90 days or less and who resided in an emergency shelter or a place not meant for human habitation immediately before entering that institution;\n   * Individuals and families who will imminently lose their primary nighttime residence;\n   * Unaccompanied youth and families with children and youth who are defined as homeless under other federal statutes who do not otherwise qualify as homeless under this definition; or\n   * Individuals and families who are fleeing, or are attempting to flee, domestic violence,dating violence, sexual assault, stalking, or other dangerous or life-threatening conditions that relate to violence against the individual or a family member.  \n\n\nEDIT: Just for the record, it is a HUGE mental and emotional burden to be homeless even if it's not the \"on the streets\" version.  It doesn't matter if you \"didn't really have to worry\" about a roof over your head or not.  Not having your own place, having to haul water, wood, use a generator because there's no electricity, etc. and so on.   You have no idea how miserable it can be and how mentally, physically, and emotionally draining it is.", "YTA\n\nHomeless doesn’t have to mean living on the street/in a homeless shelter. As long as he didn’t claim that that was his reality he’s fine. And never having a consistent place to stay and always being dependent on the kindness of others with the threat of possibly becoming completely un-housed would be horrible for a high-schooler. You should apologize and think before you *confront* someone again.", "YTA and sound jealous that this person  has accomplished more than you despite you not having to overcome what he did. We", "YTA\n\nI think you are confusing 'home' and 'place to live'. They can mean the same thing but they don't have to.", "Soft YTA. You’re young & haven’t learned it all yet. If you’re writing this from the comfort of your own bedroom & can trust it will still be your bedroom in a month, 6 weeks, a year, then you’re fortunate in your stability. The other dude sadly not so much. In the U.K we have homeless hostels, these people have a room in the hostel but they’re essentially homeless, it’s not a permanent residence, it’s a stop gap until they have a home provided by the local council. They are rightly known as ‘homeless’ hostels, not ‘bros who don’t sleep on the street’ hostels. \n\nI don’t think you are intentionally malicious, but you do sound a bit strong in your convictions for someone who can’t have researched what homeless means before forming an opinion, homeless doesn’t always mean a sleeping bag in shop doorway bumming crusts off strangers.", "**YTA just for letting half of the information out of the main post**, and spreading more meaningful information through comments.   \n\n\n*The is the only information you provided* \n\n* his parents had to leave\n* he was left without a solid place to live\n* but basically lived with a couple of his friends’s families throughout the year\n\n*And then your opinion*  \n\" but from the article he was chilling at a couple people’s houses for months at a time each, and didn’t have to seriously worry about where he was sleeping next\"\n\nYou never mentioned, other than spread in several different comments, that:\n\n* their parents left him their home\n* he planned the year in advance to finish school.", "Yeah, YTA!", "YTA", "INFO: do you know why he didn't move with his parents?", "YTA", "OP, did you get into an Ivy League school or other prestigious university?", "Let me simplify it ….. if someone addicted to drugs , gets kicked out of their house and can’t return until they are sober , they are homeless. Even if the addict has a home but can’t get sober , they are homeless. Sure they have a place once they are sober , but might be homeless for weeks until they sober up . The guy from your school couldn’t go home for whatever reasons (distance) , he sounds pretty homeless .", "YTA. He didn’t simply slap a label on himself; he wrote an essay about his experiences. It’s those experiences, and his discussion of them, that won him his Ivy place. Not whether or not he checks the “homeless” box. And for a kid, couch-surfing for a year is a significant experience of marginal living. He doesn’t have to be sleeping under a tree.", "NTA, given OP's context in his comments.\n\nThe kid had a house with his parents. His parents worked out that he would continue to live with friends for the sake of his college applications. He had access to the resources of *both* his parents and his friends' parents. A truly homeless 17-year-old would have none of that. He embellished it and called it \"homelessness\" for the sake of college applications. The very same applications he and his parents used to justify making arrangements for him to live with other families.\n\nSo, what, why is this bad? Well, it's bad because *Ivy League schools actually hate poor people*. I tried applying Ivy and was quickly sussed out as a poor kid. I didn't know how to write a good essay, my resume formatting was trash, I didn't own a suit to go to character interviews, and I didn't do charity work as a teenager, I had to work and have a job. When I was later, *actually homeless*, I mentioned it in law school during interviews for prestigious positions as a struggle I overcame. This *actual* homelessness immediately marked me as poor and disgusting, and none of the interviewers liked it or responded positively. I only started landing prestigious positions when I learned better and never mentioned my poor upbringing.\n\nRich people like rich people with fake sob stories. They do not like poor people. The kid in OP's story leveraged that fake sympathy rich people like to extend to kids that are not too poor, too uncouth, or too dirty to get into an Ivy League school. Meanwhile, actual high-achieving kids that are *actually homeless* would not get a modicum of the same regard. Kids facing broken homes or foster care, bouncing from one tenuous situation to another, also wouldn't get the benefit of being \"homeless.\" This was 100% manufactured homelessness for college applications.\n\nHe and his friends are manipulative rich people being raised by manipulative rich parents that understand that the goal of being like this is to keep actually disadvantaged kids out of the prestigious positions that they, by virtue of their higher birth, supposedly deserve. And they will make sure they get them, by hook or by crook.\n\nEdit: go find the OP's comments where he mentioned the kid had a car *his parents paid for* and an unlimited credit card *his parents paid for*. This is 100% a rich kid manufacturing bullshit for sympathy from other rich people and they'll all sneer from the deck of their future yacht at actual homeless people. This is truly disgusting levels of duplicity and you all should not feel sorry for that kid.", "You're younger, so I understand where you might get this idea (I know how that sounds, but hand to god, I'm not trying to be condescending), but YTA here. Couch surfing is legal homelessness, it IS traumatizing being thrown into it, it is not at ALL a stable position to be in, and I guarantee you he was not just \"chilling\" (having taught many kids in this boat, a chill veneer often doesn't mean much, and it doesn't take a lot for it to fall apart.) Homelessness is as homelessness does; if they weren't \"really\" homeless, then they sure wouldn't have to keep moving to avoid living in their car.\n\nThink about it this way. Do you consider repeated temporary squatting in abandoned buildings after losing your house \"not really\" homelessness?\n\nYou need to know you are seeing this from afar and do not know the behind-the-scenes turmoil going on here. He lost his home and couldn't do anything about it, in high school, while prepping for college; that's no joke.", "Based on the fact (in the comments) that his parents didn't actually abandon him, NTA.", "NTA, based on OP follow up answers stating that the friend wasn’t abandoned by his parents. He chose to stay behind for the year and where he was staying was worked out in advance of his parents move. \n\nI’ve seen this happen when the parents have to move for work or military and the kids want to finish their senior year with their friends.", "He CHOSE not to move with his parents? Like he had the option to do so but refused to? NTA", "what is wrong with people in this sub?! this kid was 100% not homeless", "NTA - He was embellishing.  If he chose (see OP's comment) to stay with friends for a year that was planned in advance and could have gone to live with his parents at any time, had money from his parents, and decided to stay in the area so he could finish his schooling he is not Homeless.\n\nGood for him that he could work out getting accepted at an Ivy League school.  Well done, but he was clearly embellishing a situation he chose to live in.\n\nEdited because I can't spell embellishing correctly.", "A friend's friend is Mexican. His father was in the foreign service. He wrote his college application essays on how he was forced into exile and how hard it was. He got into an Ivy too.\n\nOP is NTA.", "I think everyone has a different definition of homeless. My personal definition is when someone lives in the streets. This kid was obviously not in the streets from what you told us but I understand why he would call it homeless considering it’s not a stable living situation and he’s relying on the charity of others to have a roof over his head.", "YTA", "YTA.", "Info: What was preventing him from going with his parents? Did they just go ‘f you’ and ditch him or did he just not want to change schools?", "Unpopular opinion, but NTA. As OP pointed out he did have access to another home, it was just in another state. He presumably had a choice and chose to live with generous friends. I do not want to diminish how difficult it would have been to move his senior year, the weight of feeling out of place with another family, etc. These are very really struggles worthy of a college essay. But by using the word “homeless” he is invoking imagery knowingly associated with living on the streets or in a camp without options or agency. Whoever chose to use the word “homeless” in the article strategically used it for dramatic effect and personal gain. \n\nFor example, foster children live in foster homes without options and yet are not considered homeless despite the often temporary nature of their stays.", "YTA. I’ve been in his position before. My dad died and mom kicked me out. I couch surfed and stayed with friends my senior year of high school. I was indeed homeless and it was one of the most stressful periods of my life. I’ve spoken about this before on Reddit so this isn’t coming out of the blue or being made up just for this post.\n\nAnd you know what? I didn’t get into an Ivy League even though I had fantastic grades. Being homeless is not a magical elevator for college admissions. This guy busted his ass despite the shit hand given to him and did better than even I did. Kudos to him.\n\nShame on you for being so bitter and jealous of a homeless kid.", "Get fucked and stay fucked.   \n\n\nI hope you fall helplessly in love with someone who fucks your best friend while you're forced to watch.", "He was staying with people for months at a time.. you’re not the asshole lol.", "ESH, him for representing himself falsely and you for trying to call him out for clout. You could have left well enough alone but instead you tried to put someone down.", "NTA", "NTAH Dude was legit couch serfing for months, yipty doo. He got into a college, at the end who cares, plently of people work their butt off and dont brag about it. \nDude is bragging about shit that a lot of other people have done, sucks parents left most peoples parents either left or are divorced.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThere’s a kid in my high school who got an article in the school newspaper published about him because he was ‘homeless’ and managed to get into an Ivy League school.\n\nFrom what the article says, his parents had to leave the state and he was left without a solid place to live but basically lived with a couple of his friends’s families throughout the year. He then wrote his college essay about how he was homeless and got into an Ivy. \n\nI understand homeless doesn’t have to mean living on the streets, but from the article he was chilling at a couple people’s houses for months at a time each, and didn’t have to seriously worry about where he was sleeping next. So I don’t see that as homeless.\n\nThe next time I saw him, he asked if I had read the article, and I confronted him, saying that jt sounded like he wasn’t really homeless and was embellishing for the sake of college essays. He got angry and called me a huge AH and said that it was still a struggle because he felt ‘out of place’ living with his friends and eating their food and all. I told him, sure, that’s a struggle, but that’s not what being homeless is. He called me an AH and walked away.\n\nLater, a lot of his friends started slamming me online, saying I was a huge AH for invalidating his struggles.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH, OP you left out far too many details that you’re filling in later in the replies, that’s why you’re getting flamed lol.\n\nAnyways it sounds like the guy had stable finances behind him, and was just staying around so he could continue at the school. I agree that claiming to be homeless when it’s by choice is not something I’d be overly praising someone for managing, and I would also roll my eyes a little at an article about it.\n\nProbably should have just let it be tho, cause you never really know what’s going on that you aren’t aware of.", "YTA. You're equating homelessness with destitution and abandonment, but that's not what homelessness is. TONS of homeless people technically \"have a choice.\" People who run away often have a home that they could return to, but they may decide to stay gone. People with substance abuse issues often have a home they could return to, but they may decide to stay gone. People who are risking everything to follow their dreams often have a home they could return to, but they may decide to stay gone. They're still homeless even if they're choosing to be homeless.\n\nI'm curious, though. You said that the essay was included in the article. What were some of the things mentioned in the essay that weren't true? There must have been contradictions if you think he misrepresented himself. Maybe if you tell us what those were, we would understand your perspective better.", "YTA\n\n\"I understand homeless doesn’t have to mean living on the streets, but from the article he was chilling at a couple people’s houses for months at a time each, and didn’t have to seriously worry about where he was sleeping next. So I don’t see that as homeless.\"\n\nDoes he have the stability of a home of his own? Nope. That's the VERY definition of homelessness. You should educate yourself and apologize immediately as he IS in fact homeless", "YTA - there is just no point to confronting someone over this.  Just let him do his thing.  What the hell did you think you were going to accomplish?  Not everything needs to be \"called out\"", "NTA imo, I’ve couch surfed and lived precariously and while it isn’t fun and I don’t invalidate his struggles, “homeless” just isn’t what I’d call his situation or mine when I went through it too. I guess we don’t know the whole story, but at best I think his language was a little flippant or just inaccurate. Maybe you were insensitive but I think he was a little too. Not like he slept in a car, shelter, or god forbid on the street.", "Your main concern was they were not homeless because they slept indoors, how about taking the fact their parents left and didnt take them?", "YTA and sounds like you are a bit jealous they got more successful?", "Info: were you homeless as in on the streets? Or is this coming from a completely privileged ignorant point of view to just disqualify your friends struggles and accomplishments?", "YTA. That is homeless", "YTA and you're objectively wrong. He is the very definition of homeless.", "Yta", "NTA\n\nHe wasn’t homeless, he could as well live with his parents in the different state. Choosing to couchserf for a while to avoid switching schools is hardly qualifies as being homeless and diminishes the struggle of those who become homeless not out of their own will. Next people will be saying that living at your grandparents or other relatives for convenience of commuting to school is homelessness.", "YTA just because why does this matter so much to you? Technically he could be considered homeless since he was couch surfing between friends. Sure he could have gone to live with his parents but maybe there was a reason he didn't? But honestly who cares and why does this matter so much to you?", "YTA, he was homeles. He was relying on other people's kindness who could at any moment tell him he was no longer welcome. He did not have secure housing. Many homeless people couch surf from time to time. Staying at friends houses is not the same as having a home.", "Take your friend’s achievements as inspiration that you too can overcome your previous challenges and have a good outcome in life. Do you! And quit spending all your energy on others issues and convincing others that there are people manipulating the system-yep! Move on. Study and apply to your own colleges you aspire to go to,  and tell your own story in your essay.", "It’s literally in the definition of homelessness for students needing homelessness services. OP can’t just decide what is and isn’t homelessness.", "I don’t count living in somebody’s house for months with full financial support couch surfing", "Thanks for sharing.  People who live in residential hotels are also considered homeless.  When I was in high school I knew a few people who lived in hotels with kitchenettes because they couldn't afford first/last/deposit or had prior evictions.", "He didn’t lack resources though.", "> Whatever you may think, he actually ALWAYS had to worry about where he slept that night. He had to worry about being an immaculate house guest, not overstepping in the slightest, etc. \n\nBut he quite literally he had a home he could return to if that is the case", "[removed]", "I am jealous of him, not for the reasons you think, but because he didn’t have to experience actual homelessness", "Except he literally did have a home. He could’ve lived with his parents in the state they moved to, and chose not to", "Sure, I don’t disagree, but that’s not the same as being homeless", "Living in somebody’s house for months at a time with the full support of that person and their parents isn’t being homeless", "Agreed. While it's your right to have an opinion I don't see what you possibly gain by this. Unless you take satisfaction in hurting people's feelings.\n\nEdit:\n\nIt feels like there might be an aspect of jealousy. Did you also apply to ivy league schools were you accepted?", "Because I feel he embellished his essays and that’s unfair to other kids who didn’t", "Except he had a home, it was planned out where he would live a year in advance", "So simple but so true. You never know the whole story.", "I’m going off his own words from the article", "I don’t count living in somebody’s house for months with full financial support couch surfing", "I don’t think having a home and choosing not to live in it aligns with anybody’s definition of homeless", "lived* not live. This was years ago now", "I think that’s different than having a house and a bed and a family to come back to everyday", "The essay was attached to the article, so I saw it only mentioned being homeless and not the other pertinent details. As for couch surfing, he quite literally had a home in another state he could’ve lived in with his parents", "He did have a guarantee, he and his friends planned out where he’d be staying the entire year in advance", "He literally can though. He had a home in another state where his parents were, he chose not to move with them", "But he literally had a home, his parents wanted him to come with them and he chose not to", "Unfounded assumption but alright lol", "His parents didn’t abandon him, he chose to stay here and worked out a plan to live with people in advance. He could’ve gone to his parents’s place anytime", "Where does it say the parents left him?", "He literally did have a home though, with his parents, that he chose not to live in.", "Living in people’s homes for months at a time with their full financial support is hardly couch surfing", "He didn’t have insecurity though, he quite literally had a home", "If he’s kicked out, he can go back to his actual home", "Jealous of the Ivy League admission. Obviously", "I mean, the dude asked about his essay.", "Of him for getting the benefits of being homeless without having been homeless? Yes, who wouldn’t", "Yes, I did read his essay, because it was attached to the article", "But he has tons of resources.", "I’ve actually been homeless, so I can say having a home and choosing not to live there isn’t homeless", "He felt moving to a new school halfway through high school would be detrimental to college applications", "I’m going into junior year of high school, so who knows yet?", "Distance wasn’t an issue, he had a car, and money for plane tickets", "Why are you assuming he was couch surfing? The parents made the arrangements, he was probably staying in guests bedrooms.", "Exactly, I don’t see how that’s being homeless. He has a home he could go to, and he chose not to", "Agreed. The kid was/is not at risk of missing a meal, a place to sleep, or the opportunity to buy clothing or school supplies. There is no more uncertainty in his life than anyone else in his class. While he is technically homeless, he is not materially disadvantaged by it.", "I mean he probably would’ve had to stay in school longer and make up credits because all state requirements are different instead of graduating on time with his friends. I don’t know if that’s really a choice.", "Jesus why don't posters on AmITheAsshole ever put the relevant information in the *post?* It's like the main post is just background info and then OP's comments change the entire ruling.\n\nI was about to write YTA until I read the comments. Just saying the kid was couch surfing from house to house after his parents left him behind vs he planned to stay there in advance to finish school and had funding from his parents is two very different things! NTA", "I will admit that's actually kind of funny", "This thread has just been a treasure trove of rich kids exaggerating things to get into Ivy Leagues. I'm now honestly glad they turned me down. I don't think I could have stomached all those belly aching complaining pick mes for long without turning to drugs.", "The latter, he wanted to stay at the school he was in", "Growing up in foster care is its own thing and it's government enforced", "Not really the same position since his parents were paying for his car and cc... He was definitely not couch surfing since the parents made the arrangements in advance.", "He didn’t get kicked out, he chose not to live with his parents", "Wouldn’t be worse than the life I have already lol", "How did he falsely represent himself? He didn't have a home. Yes he had friends houses he can sleep at but that was not his \"home\". \n\nIf I allow a homeless person to sleep on my couch......they're still homeless", "The scholarship winner is not ESH. He meets criteria:\n\nHidden Homelessness: Individuals who live with others temporarily without a permanent home are considered “hidden homeless,” as it is often most unnoticed. Since they lack access to housing support resources and cannot be identified, they are 'hidden' from national statistics on homelessness.Many in the “hidden homeless” population are younger people who have experienced a sudden catastrophic life change, trauma, or challenges as a result.", "I wasn’t calling him out for clout", "Exactly. I feel like it’s insulting to people who’ve actually been homeless to call having a home he could go to and choosing to couch surf instead homeless", "His parents wanted him to come with them, he said no because he wanted to stay at the same school", "Yes, as I said numerous times, I was homeless and on the streets", "Because I was homeless", "Yes it is, the people who are offering to help can tell them to leave at any point.", "Turns out what you do or don’t “count” doesn’t actually mean anything. You’re just simmering in your own bitter-brew for pretty much no reason. Have you ever considered minding your own business?", "Excellent reminder and example.", "if the resources weren’t his, then he’s at someone’s mercy all the time. he’s homeless, but has some support for the time being, at any time that could change.", "Why are you so resistant to accepting unhoused despite the sound information this community is posting.", "How the hell would you know?!", "Either you're willfully misinterpreting the point or you're hyperfocusing on the idea that \"building you currently have permission to sleep in\" = \"a home.\"\n\nAlso, what do you even care? What meaning are you assigning to the situation such that you come out offended? Either way, his housing status is protected just like a street-survivor. If our shitty government \"respects\" this, surely you can figure it out too.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Info, and no sarcasm on my part;\n\nHave you ever experienced homelessness? \n\nIf not, how do you define it?\n\nEither way, was his story actual falsehoods or does it track with what you believe happened? \n\nLastly, how well do you know this person and what he experienced?", "get therapy", "two things: \n\n1) your OP didn’t say that you quite literally said “was left without a solid place to live”\n\n2) you do not know this individual’s circumstances. his reasoning for not moving literally to an entire other state in his FINAL year of school (which is enough of a reason in itself, if you would use your brain) \n\nyou’re desperate for someone to tell you you’re right but even if this individual had no ‘real’ reason to not move away, ‘choosing’ to remain, you still had no right to speak on it.\n\nmind the business that pays you OP", "Challenging your judgement.", "Where was his home, then? If he wasn't homeless?", "You continually challenge your judgement; the very thing you asked the community to provide. This is not a debate sub.", "Yes u/lets_talk_aboutsplet is correct and the scholarship winner was homeless.", "So, the guy doesn’t fit your definition of homeless therefore he wasn’t homeless…. \n\nHe didn’t have permanent residency because he was jumping around from home to home because… wait for it… he didn’t have a home… as a kid…", "Yes it is. \n\nYour classmate fits the legal definition of a homeless student. And as you describe the situation, they were enrolled in school using the legal protections afforded to homeless students.", "Stop arguing and take your judgment. YTA for constantly arguing.", "I hate to break this to you, but life is not and never will be fair YTA", "You just said “from the articles he was chillin at friends houses” so all the information is in the article and he’s not embellishing. Mind your own business.", "I can promise you that every college essay ever is embellished. But he still wrote about his experience. You don’t get a say in whether or not that experience was valid.", "40+% of Harvard kids are legacy and donors, you should be way more upset about that since that’s actually unfair. They have every advantage in life AND application bonuses", "Having a home in a year planned out doesn't mean he wasn't homeless. I mean, I can plan to have a kid in a year, but up until that sucker crowns, I'm still childless. I can plan on graduating in a year but until I get that diploma, I'm still a non-graduate. I can plan on winning the lotto or getting that big, well-paying job, but until I do, I'm still broke. \n\nAnything could have happened to make that plan fall apart, but whether it did or not doesn't mean he wasn't homeless before that home came to fruition.", "He wrote the article?", "Why bother posting if you’re just going to argue with everyone who disagrees with you?", "No cares what you consider. You are irrelevant.", "How do you know he had full financial support? And what his living conditions were?", "Except for everyone in this thread who are telling you otherwise…", "You clearly don’t know the definition of “home”. Someone else’s home is not your home simply bc you stay there. He didn’t have his own home making him home-less. This kid doesn’t have to live in a box to be considered homeless. It just sounds like you can’t handle the glare from all the limelight he’s getting. Grow up.", "It definitely does. Let's give a hypothetical:\nBobby has a house, a partner, and 2 kids. Bobby likes to party hard, but his partner tells him he can't set a bad example for their children. Bobby leaves home and IS HOMELESS because he chooses to keep his partying lifestyle.\n\nAnother one:\nSusie is a teenager who wants to become an actress. She lives in Kansas with her parents, but she decides to pursue her acting dreams. She leaves home and IS HOMELESS because she chooses to pursue her acting dreams.\n\nNow, let's look at this guy's situation:\nHe's a teenager who lives with his parents. His parents are moving, but he decided he wants to finish his last year of high school where he started. He stays, his parents leave, and he IS HOMELESS because he chose to continue his schooling.\n\nAll 3 of these people may stay with friends and be cared for and have money... But they're all homeless.", "A family and YOUR family aren’t the same you sound bitter about not getting in to an ivy", "Send proof; this is an unusual practice. Higher education does not publish such documents it increases their liability.", "So a struggling actor lives in their van when they move to LA to make it as an actor, but could always live back at home in Ohio, are they homeless or not?", "Just because it was planned ahead of time doesn’t mean things can’t change. A year is a long time, what if people decide to go on holiday and they can’t have him at their place? What happens if someone unexpectedly dies or he has a falling out with the next friend he’s supposed to stay with? It’s not the same as living on the streets and begging but that is a scary situation to be in.", "That's not a guarantee. The parents could have backed out at any moment", "Many people who live in hotels, shelters, couch surf have family and friends in others states but we don't require them to move there. He is autonomous and as u/Coffee-Historian-11 pointed out he may have chosen to live in your city to meet graduation requirements rather than move and miss graduating with the same timeline.", "I had a friend who followed his parents when they moved during the last few months of his senior year. Because of the differing state requirements he ended up needed to take a whole extra year of school because he didn’t have the right credits. \n\nI don’t blame your friend for couch surfing, that’s what I wish my friend would’ve done instead of graduating high school at age 19, almost 20 and wasting a whole year of his life. Your friend didn’t really have a place to live but at least he didn’t have to waste a whole year making up credits because of the timing of when his family moved.", "Then you should have been clearer in your post. \n\nYou make it sound like they left him.", "He lived in a city with others temporarily; this is defined as homelessness.", "Why did you leave this out of the post.  This *totally* changes what you are saying.", "Seems pretty founded to me. You told a guy that was homeless that he wasn’t and overplayed his life struggles for college admissions. If that doesn’t scream out jealousy, I don’t know what does lmao", "I would edit this into the post as I think it’s important context.", "“His parents had to leave the state and he was left”", "YTA still. For several reasons:\n\nFor arguing with your ruling, and for leaving out vital context from your post. Also, for your definition of 'couch surfing' not being 'real homelessness' regardless of your friend's situation or not. \n\nAlso, people are still homeless even if they chose to be homeless. My mother chose to be homeless. She was still homeless. \n\nI stand by my ruling. YTA.", "You said his parents left the state. How was he going to finish school if he went with them? Stop being a jerk.", "Having a place to sleep and food to eat is not “Full financial support.” Did he get an allowance for entertainment? Did these people buy him clothes and personal items? Did they pay for him to participate in sports and activities as if he were their own child? You honestly have no idea, and the odds are he did not have full financial support, just help with necessities. The fact that he moved from house to house shows there was no family that fully committed to providing him full financial support.", "One of my children’s friends got kicked out from home at Xmas at 15 by their abusive parent. My bestie and I took turns having the kid live with us (usually a few weeks at a time), converting space (such as a dining room) into a bedroom for them, and they knew we wouldn’t put them on the street. We also paid for their expenses like food, new clothes (wasn’t allowed to take anything from home) and school supplies.\n\nThey had somewhere to stay and were cared for but they were also still homeless because this arrangement was not a thing that could be upheld for a longer period of time and was impacting our own families even though they are a nice kid but the space was just overcrowded with an extra person living there who also needed their own space. \n\nWe managed to find them support with youth homeless services but it took almost 3 months because they refused to deal with the kid until they were 16 without the parent’s permission which the parent refused to give but the kid didn’t want to go back because of the abuse.\n\nEdit to add: they were cared for and had a place to sleep but they were also homeless because there was no permanence possible in this situation and they had to move between the two houses every few weeks.", "I've read through some other comments and although it was his own choice to not uproot himself and couch surf he was clearly both insecure and homeless.  Having safe shelter is not the same as having a home.", "Do you not know how much it can hurt you to move schools, especially in senior year? If he wanted to go to college on time no that wasn’t an option", "That was my assumption. OP mentioned they’re two years younger and not applying to college yet… but I still suspect jealousy plays a big role.", "That’s not an invitation for “your experiences aren’t real”. OP’s response was rude.", "Exactly, if this dude got a place and potentially housing/funds in place of someone literally living on the streets and it was posted on here, you damn straight they'd be up in arms about it! NTA.", "Please share paragraphs 1, 3, and 4.", "Where in your post did you say he chose not to live there? You said his family left & he couch surfed?", "And that is an incredibly valid reason to not uproot himself and live with his parents in another state.", "You should update your post, because that really changes the situation if he decided to stay. That said, he obviously wasn't homeless but it was also kind of a dick move to confront him about it.", "Could you direct quote from the article or his essay? That'd be the fairest way to explain it", "So take a plane to school everyday ?", "Yup, even so, a sofa in a house is a darn site better than a box in an alley or cosying up in a newspaper on a bench... although lots of benches are homeless-proofed these days - what a wonderful world we live in.", "Sure, but I ain’t mad at him for using it as an experience to get into an Ivy. Use what you got. \n\nThe experience of staying behind to be with friends probably got a lot more awkward than he expected after the first few weeks.", "It is a choice. I've moved states and transferred schools a handful of times and never had a problem with credits or anything like that. Everything should move with you. Sure, all states are different but it was still a choice and he still made it. If his parents straight up ditched him or they got evicted and all that, that's a different story.", "Yeah I was 100% OP is the asshole then I read the comments and he mentioned the kid had the full support of his parents, and basically manufactured his homelessness for the benefit of college applications, which is also the very same reason he did not move with his parents.\n\nNow I'm like this \"homeless\" kid and his parents are absolutely trash. And then they had the audacity to sell this fake sob story to the media. While there's no doubt hundreds of genius kids dying to get into amazing schools and go on to cure cancer or something that will actually benefit society they could have used that admission slot, but won't get it because *they're actually poor.*\n\nYikes, the post is misleading. Well, OP is a teenager. Can't fault them for not knowing how to write or communicate that well.", "So he wasn’t ‘made’ homeless, he actively chose it.\n\nYou might want to include that in the post. It’s relevant", "His family still presumably had a home and as a dependent he had access to it, even though it was not convenient because of school. He also had arranged long term housing from friends. \n\nThere are degrees of homelessness (those who can't make rent and squat, those who crash with friends and family, those who sleep in cars, those who sleep in shelters) but when people talk about \"the homeless\" or refer to people as \"homeless\" in common language they are talking those on the extreme end. Under a broad definition the kid is \"homeless\" but using that word makes people think he's living in a tent beneath an overpass. \n\nIf you let someone sleep on your couch once, they might still be homeless, but if they sleep on your couch every night for a year they are just a roommate who isn't paying rent.\n\nWhen we are talking about the issues around homelessness: addiction, violence in shelters, violence from police, schizoaffective disorders, discrimination, lack of access to education, lack of access to banking services; none of them apply to this kid. The challenges of homelessness that would make it hard to get into an Ivy league college were not present. While not technically stolen valor this is like the guy who got drafted in October of 1945 writing an essay about his military service during WW2. While not technically untrue the information it conveys is misleading.", "Agreed.  Homeless and lacking shelter are two separate things.   You can be homeless and have shelter.  I fell into tough times years ago and lived in my camper without power or water in Walmart parking lots.  I had no mailing address, but I had my own mattress and my belongings in a hardsided box to sleep in so was I really homeless?  Yes.  I was homeless.", "Narrowly meeting a criteria from ?The Red Nose Day Website? (why are you treating a single UK based charity best know for dumb tv bits, sexism and poverty porn as the ultimate source of truth here?) does not mean he was misrepresenting his situation by calling himself homeless. \n\nWhen people use that term it evokes the challenges of life on the street: lack of food, addiction, serious mental health struggles, violence from the police, violence from other homeless people, discrimination, lack of access to banking services, lack of access to education, etc. . This kid did not deal with this world. I think using the term to represent couch surfing with friends your senior year is kinda distasteful. Not enough to call someone out on it to their face but I would definitely think they are an AH.", "Why then? What good did it do?", "Yeah ok", "In that case, he can go and live in his actual house in another state. So when he has a home and further options, how is he homeless?", "He also had a home in the state where his parents were, so how is he homeless when he literally had a home?", "Because he literally had a home and chose not to live there?", "OP doesn’t want a judgment just for everyone to be like “omg you’re right he wasn’t homeless!!!!!!!”", "His own words", "No, I mean his parents literally had a home for him in the state they moved to and he chose not to live there", "> your OP didn’t say that you quite literally said “was left without a solid place to live”\n\nYes, because he decided not to live in the house he had\n\n> you do not know this individual’s circumstances. his reasoning for not moving literally to an entire other state in his FINAL year of school\n\nI do, because he said why he didn’t want to mov. As for his reasoning, didn’t say it wasn’t solid, I just said having a home and not living in it makes you not homeless", "All the places he lived for months at a time", "?", "He did have a home, though. Multiple. By your logic, somebody that travels for work and lives in hotels would be homeless", "How? He literally had a home he could’ve gone to but chose not to", "So? It should still be called out", "Why are you talking about the article when I’m talking about him embellishing his college essays?", "Except he’s claiming he’s homeless when he literally had a home. Cmon", "He’s also a legacy", "He was interviewed and quoted in it", "The people that have spent this entire thread debating and discussing what I consider clearly disagree lol", "The article which quoted his words", "Nobody’s saying that having a home makes you homeless", "I’m just going into junior year, haven’t applied yet. And yes, he could’ve lived with his family too but chose not to", "We’re not in higher education so I’m not sure why they’re relevant", "Of course they’re not homeless. They have a home", "If it fell through, then he could’ve lived in his home in another state with his parents. As per the article, they wanted him to join them and he chose not to because he felt moving schools in the middle of high school would be detrimental to his applications", "In that case he had his parents house in another state. They wanted him to come with them, but he chose not to.", "Different scenario when they’re your parents and you’re a minor. Plus, he was never at danger at not graduating at the same timeline", "If you don’t have a permanent residence elsewhere, sure", "They are adding this to make them look better.", "To start I’m two years below him in school so I haven’t had a chance to apply to begin with. Second, he literally had a home in another state with his parents but chose not to live there", "Yes. It does not say they left him, as in they bolted without him knowing. That may be the case, or it may not. He could have chosen to stay. If that's the case, that's on him, not the parents.\n\nAt no point does it say they abandoned him purposely without a home. That's purely an assumption on your part.", "By enrolling in school in his new state?", "Yes, from the article itself he said his parents provided him a unlimited credit card and he was free to go to their house in another state whenever he wanted", "Seriously?  This sounds like a pre-determined living arrangement so that he could finish at the same High School and not have to switch in his last year.  It was worked out between his parents and the people he lived with.  That isn't homeless.  Do you really think that if no one would take him he couldn't have gone back to live with his parents?", "This isn’t a comparable situation, this guy had a home and parents that wanted him there but chose not to live there", "At any time if a plan fell through, he could’ve returned home. So no, not homeless or insecure", "It wasn’t senior year, I don’t know where you’re getting that from", "Honestly. People are ridiculous", "Why would i do that?", "I didn’t, but I’ve said it in several comments", "Sure, I didn’t say that was invalid. I just said he’s quite literally not homeless when he has a home", "Yeah what's with all the relevant context being put in the comments? That's what the post is for", "No? Move there and go to school there", "I’ve had a friend who had to do a whole extra year because the state requirements were different and they absolutely refused to accept that his parents were moving three months before he was originally supposed to graduate. So it just depends.", "Yes", "So basically based on the definition he was homeless but he just wasn't homeless enough", "Wow two paragraphs to put down efforts to define unhoused. Instead of providing a 'better' source you pass judgement on the scholarship winner not knowing his story which may have included mental health struggles, etc. \n\nMany good people have posted here to further clarify unhoused which this Ivy League bound person matches. You feeling distasteful is to be addressed with the scholarship committee; they found a smart applicant who happened to be homeless to level up his education. Those that voted were certainly OK with his submission.  \n\nA second  source of UK definitions with text matching (verifying) my previous post: UK Homeless Categories: [https://www.crisis.org.uk/ending-homelessness/about-homelessness/](https://www.crisis.org.uk/ending-homelessness/about-homelessness/)", "I feel it’s morally unfair to embellish your essays and get into top schools. Other kids that didn’t get in who were honest got fucked", ">without a solid place to live\n\nYour words. Sounds like he didn’t have a proper home.", "while a home is available to him, there could be reasons he isn’t living there. there are a lot of unhoused people that live on the street because their living options are not suitable.", "Listen, there's no reason to be jealous about this guy getting into Harvard. It's obvious to all of us that you don't possess the requisite intellect for admission anyway.", "Once again, you seem to be hyperfocused on this idea rather than seeing the points anyone else is making.\n\nAgain I posit: What the hell business is this of yours anyway? Why do you care? What does HIS situation mean to YOU?", "“left”\nhas implications of having no other choice, words have meaning \n\nif you’re so narrow minded that you won’t consider, idk, the *reasons* he had for not wanting to move? he was just super difficult you think? just wanted a nice sob story for his essay? no matter what the reasoning, it’s not easy and watch what you’re speaking on as i’ve been both homeless and houseless which clearly you don’t even have the capacity to empathise with. \n\nget to grips that you were in the wrong OP. find happiness, sorry you didn’t get into an Ivy League or whatever your issue with this individual is.", "That's not a home, that's couch surfing, which is not uncommon within the homeless community.  YTA", "The definition of homeless is \"lacking a fixed residence,\" so \"all the places\" is literally the lacking of a fixed residence...", "Those people usually have homes they go back to when they’re not traveling for work.", "> somebody that travels for work and lives in hotels would be homeless\n\nYes? If they didn't have a home to go home to between assignments and they were couch surfing on friends' couches instead, that'd totally qualify as homeless. If they had their parents' house as a sort of home base because they traveled so much, then no, not homeless.", "If the traveling worker has a permanent place of there own then they do have a home and are not homeless. \n\nIf they do not, then they are homeless. \n\nHe just doesn’t fit your definition of homeless and that bugs you.", "No, it's not the same.  The work traveler has a permanent residence.  They stay in hotels knowing it's temporary and have a place they know they can return to.", "If they didn’t have a home that they were based at then yeah, they’d be homeless.", "Did he have a home to which he could have gone? \n\nYou don't know that. Nor do you have the perspective to understand that parents leaving their child behind without stable housing and supervision is a huge red flag.\n\nRegardless. as a society we  decided that homeless  children must be exempt from the laws that limit students to the school  in their catchment area.\n\nIf we did not, some students would have to move frequently between schools and districts, and that would effectively deny them an education. It does not matter the child is moving from alley to alley or couch to couch.\n\nAs a homeless student, your classmate was entitled to remain in place at his school.", "NO, because there is no \"it\" here to call out -- the dude is actually homeless, irrespective of whether or not he sleeps comfortably.  Try this thought experiment: WHERE IS HIS HOME????\n\nYTA, and you dig yourself deeper with every comment.", "College essays are for admission into a college. From what you say an article was published about him being homeless and getting into an ivy and then he wrote his admission essay about being homeless . That makes no sense. Why would he tell a newspaper the truth and not the college admins? They could easily tell he was lying by the article.", "So you read his essay and it straight up said he was homeless living on the streets, no financial support, etc?", "He didn’t have a home. His parents moved out of state and he had the opportunity to stay at friends’ homes. C’mon.", "I think you’re making that up bc people are saying YTA", "So the journalist was telling his story.", "post his quotes then", "Stop being a judgemental ass. You don’t get to dictate what other people could do or will do, or how difficult something was for them. Focus this energy on yourself buddy because you’re being negative for no reason other than to bring someone down", "Post the article and the essay, as others have mentioned. Your writing is not specific thus I interpreted the article and essay was printed via the college/university's scholarship department. In a separate thread you state you have the essay and an article published by a non-high school local source but you refuse to share these documents upon which your opinion was formed.", "So, you're viewing homeless in an extremely rigid lens. Let's say someone flees an abusive household, and is sleeping on the streets in lieu of going home to that, by your logic they're not homeless as they have a place they CAN go back to and have a home. \n\nIn my example above, the actor wants to be an actor, and LA gives the best opportunity to do it. They're willing to be homeless to do that. Having a bed available states away doesn't change your sleeping arrangements that night. Not every person on the street has zero beds available to them. Your classmate made a similar choice, they felt that completing high school at the same school gave them a much better opportunity and were willing to be (albeit it sounds like affluently) homeless to do it.", "And what about kids who chose to leave an abusive home and ended up living in a shelter, on the streets or hopefully couch surfing? Aren’t they homeless? YTA", "But \"could theoretically have a home if he lived in a different place entirely\" is meaningfully different from \"has a home that he's just not going to.\" \n\nHe, in his current circumstance, is homeless. He could not be if he were willing to uproot his entire life, but that's not the case.\n\nHe made a choice to be homeless for the sake of other things, sure. representing it as anything else is dishonest. But, ultimately, he still is having to struggle with the insecurity that comes along with being homeless.", "you saw his transcripts?", "You know every single requirement in every single state? And you have his classes memorized? I’m saying there’s more to this than you’re seeing and there are a lot of reasons, especially graduating on time, *especially* for someone who wants to go to an Ivy League school that someone wouldn’t want to love during their senior year. There’s a lot he’d have to give up and living with his parents might be the only reason to move, which was clearly not enough to outweigh all the negatives of moving during his last year of high school.", "You are wrong. As mentioned, people can be homeless in one city while having multiple housing options through friends and family in other cities and states.", "Thanks.....little dipshit....I only read a few comments, difficult to tolerate his responses....", "Ah gotcha, you’re young and immature. Sorry, I took the jaded part of your name too literally. When you grow up a little, maybe in your second or third year of college, you’ll realize how stupid you’re being right now haha. It’s all good though, we’ve all gone through this phase myself included, albeit not as severe as you.\n\nTo put it simply, you have an easy life, and have no idea what real life actually consists of if you’re that young. It’s not even a comment on your intelligence and general competence, you’re literally just too sheltered and young to have experienced enough of life to realize what this person went through. \n\nDo you know the reason he didn’t move with his parents? Sounds like he would have needed to move in his last year of uni. If you’re a productive person, unexpectedly moving to a different part of the country would severely hinder you doing the things you actually want to do. Clubs, work, classes, friendships, relationships. They’re all affected. \n\nWhen you’re young and don’t really try as hard as you can, I certainly didn’t, you don’t have as strong of an attachment to things like that. Usually most people don’t until they grow up. This guy seemed to be far more mature than the average person and decided for himself that the disruption to his life wasn’t worth living with his parents. Say what you will about it being stupid, there’s definitely a case for it, but he’s shown more determination and perseverance than almost everyone I’ve ever met in doing that.\n\nYou are you, not him. You have no idea what his life at home looked like, and why he chose to leave. Don’t just assume things because you feel you already have a strong grasp of what’s happening in a situation that in no way involves you, it’s childish. I forgive you for it though lmao, I certainly did it a lot when I was younger, you just need to grow out of it.\n\nI hope college admissions go well for you, truly. Remember, it’s not just what’s on the common app that they care about. Admissions officers want tough, intelligent, hardworking people who have authenticity leaking out from them. If you’re just doing “the right things” to get to college, that’s not good enough. They need to know you’re your own person, and can make decisions to pursue things you truly care about without being forced into it by someone else. What shows that more than choosing to be homeless and still having the balls to apply for an Ivy Laague. \n\nAnyways, just think about it, and sorry for coming off more aggressive. I have a lot less patience for people that act like you do when they’re older lmao", "Good that means there is still time for people to alert schools that you might apply to that you are a bully to a homeless kid. I hope he turns you in for harassing him. Who made you judge and jury of this kid’s life?", "Terribly sorry old chap, but Mamma and Pappa only offered me the Rolls Royce and I wanted the Aston Martin. So instead I borrowed a few of my chums sports cars instead - therefore I am carless - as I actually don't own a 6-figure car myself.\n\nThis place both entertains and confuses me in equal measure.\n\n\\*edit - just incase some don't get it, the example above needs a /s at the end.", "That should be included in the post if you want a different judgment.", "I agree. But OP didn’t give enough information for a proper judgment. And honestly the tone of his post and his whiny arguing make him TA regardless.", "Because one typically goes to college after their senior year, not junior, sophomore, or freshman, and you stated he did this for a year", "Why wouldn't you?\n\nYou think he misrepresented his struggles. Show us how he represented them. \n\nPlease, show us how he introduced himself to the admissions committee and how he presented the impact that his housing situation posed to his academics, applications, or prospects.", "Because we’re calling you out on your bs bro. You’ve contradicted yourself numerous times in both your comments and even the OP. You just come off as jealous and almost entitled.", "Ok so he choose to be homeless to finish school . Not sure why you’re so obsessed with it . Either way , he’s homeless…… Guy choose school over his living situation, no wonder he got into a good school .", "Yup, I said all states are different. But it was still a choice, a crappy one, but a choice nonetheless.", "Yeah, I'd agree with that sentiment. It's like British or Boer South Africans calling themselves African American. Like yeah you are technically African and American but when people use those words they mean something else.", "College admissions essays are about selling yourself in order to get accepted. You’re kidding yourself if you don’t think most essays aren’t embellished in some sort of way.", "He didn’t have a solid place to live once he chose not to live in his actual home. He still had an actual home", "LOL...:)", "Well, to start, I was homeless myself, so I find somebody who literally had a home claiming to be homeless infuriating", "It can, but in a literal sense, left means left. You’re reading too much into it. \n\nAs for why, he said why— because he didn’t want to switch schools", "I don’t agree. If it’s planned out where he’d stay a year in advance, and he did have a home in another state where his parents lived, that’s not really being homeless", "Yes, and he had a fixed residence in another state he chose not to live in", "So did he, it was just in another state", "He had his parents’s home in another state as a home base, he just chose not to live there", "By your own definition, he has a permanent home in another state he could go to at any time and chose not to, so how is he homeless", "So does he. His parents have a house, just in another state because they moved", "He did too, it’s just in another state", "Which part doesn’t make sense? An article was published, mentioning among other things how he wrote his essay on being homeless. I find that latter part unfair due to being an embellishment", "It was part of the article so yes", "Yes, and his parents have a home that he could live in, but chose not to. So he quite literally had a home", "You’re free to think that. Doesn’t make it untrue", "The journalist was recording questions and the answers given", "I didn’t dictate that. He said himself in the article he had the opportunity to live with his parents in their new home but chose not to because he didn’t want to switch schools", "Because it’s not meant to be shared online. So no, I won’t", "They don’t have a safe home. He does", "I don’t think of it that way, if you have a home you could easily return to, that takes a lot of the pressures of couch surfing away", "No, I read his article", "To start, I don’t know why you’re assuming he would’ve had to leave during his senior year, that’s in accurate. Secondly, I’m referring to his own words", "Legally that’s not the case", "I’ve actually been homeless, so no, I haven’t had an easier life than him. I just think having a home to return to and choosing not to live in it doesn’t make one homeless", "You joke, but he had a 60k car.", "Yes, he did this for sophomore year, and then his parents returned, and later, he applied to colleges", "Exactly. I’d like to see this article since OP loves to quote from the source without providing it. Feel like there’s a lot of scale tipping details in there.", "Again, what reason do I have to do that?", "Now we are up to the homeless student applied Early Decision.\n\nSo this student's parents had no way of providing him with stable housing and adult supervision when they moved, but also....they can afford tuition, room, and board at an Ivy League college regardless of the financial aid package.\n\nSure. Sure. Sure.", "No, he could’ve finished school easily there too.", "So what? Just because a lot of people do something doesn’t make it moral", "Ah there it is! So there is a personal connection there. I'm sorry you were homeless buddy, truly. Sounds like y'all both made it out, and sure maybe you deserved a news article too. If you want to stay indignant about another's situation, have at it.", "Clearly you don't agree OR want other people's opinions, since all you've done is disagree with everyone. Why did you ask if you're TA if you're not willing to accept anyone's answer?", "So I emigrated. And if I could always go to my parent’s home in another country. But my life is here now. And if I ever lost my housing here, while “I would have a home in a another country but am choosing not to go”, I would technically be homeless if I chose to stay in the place I’ve lived in longer than I lived there.", "Which was unmentioned in your Am I the Asshole query.", "The actual label is irrelevant, since he wrote an essay about his experiences. He didn’t just say “I’m homeless” and get admitted.", "That's very different for a child vs an adult with a career.", "You don’t consider him homeless and thats okay. \n\nWhats not okay is that you feel the need to put someone else down because that other person doesn’t fulfill the criteria in a particular way. \n\nAlthough, his parents were in another state and he could have lived with them he chose not to and become homeless in order to finish school, making him homeless  but with shelter. That comes with its own challenges. \n\nThere are a lot of homeless people with family to take them in but for one reason or another, mostly mental health and drug addiction, they chose to remain homeless. That doesn’t make them any less homeless.", "So you don’t even know the content of the college essays it was just all from the article? The administration office will certainly have access to the article so I don’t know what you’re worried about. His use of the word homeless?", "I’ve seen your other comments about this. I get that you think he had the option to move states and therefore have a home. But clearly the whole family and friend group agreed to this situation, which left him technically homeless. Doesn’t matter if you agree with that or not. \n\nYou came here for a judgment and so many people are telling you that you’re wrong. Either accept it or move on. But your constant fighting isn’t going to change anyone’s mind.", "Recording is standard practice.\n\nHuman interest stories are designed to sell papers.", "Because he was making a sacrifice for his education goals. You are trying to dictate what he could have and should have done. But it means nothing. If you’re unhappy with his choices tough. Being an ass about it isn’t going to change anything you’re just being antagonistic because you disapprove of someone else’s life choices. If you dislike his choices so much then guess what, don’t make the same ones but back off of him. What are you trying to accomplish with this. It won’t change anything. His experience is his and he’s gotten where he intended to with his choice to not uproot his education mid year. You don’t have to like it but you won’t change it so get over it", "I call BS\n\nAny published article featuring the essay distributed can be posted online. Publications have editors that 'clear' all printed material. So, where is the attachment?", "But who gets to define what counts as \"easily\"?\nI mean, from what you say, his parents live in a whole different state. That doesn't sound easy to me.", "and did he mention it or just never address it?", "Based on what legalities? \n\nYou've been provided several sources that rebuke your statement.", "Sorry you were homeless, that’s really rough and not something anyone should go through. That said, if anyone should understand him, I would have thought it would be you given what you just said. \n\nAt the end of the day, he didn’t have a home to come back to. Yes homelessness is a by product of our actions, but it doesn’t mean that the struggle of homelessness isn’t real. \n\nYou wouldn’t tell someone living on the street that they’re not homeless because there are government programs available. Since you’ve been homeless, you yourself know that’s ridiculous. Government programs don’t always help and are sometimes even harmful. \n\nMy point being is you don’t know his situation. I didn’t realize you were homeless, so sorry about saying your life was just easier. It probably didn’t feel good to be called out by someone who didn’t have the full picture of your story. In exactly the same way though, you’re doing that to him. You don’t know what happened in his life, you don’t really have a right to comment.\n\nAt the end of the day, he didn’t have a home that was his own, therefore he was homeless. Not every single person considers “homeless” to mean literally on the street, just a word that describes someone who doesn’t have consistent housing, which he didn’t.\n\nAs for you not getting why he’d choose to do that when he had a home, again it just goes back to he had his reasons, and your perspective on his actions doesn’t really mean anything tbh. It’s his life, not yours.", "You should have said that in your post then", "Show us that you weren't TA.\n\nThis was an application to an Ivy League school. The admissions committee wouldn't have been impressed  with \"being homeless was hard and it affected me\". Your classmate would have elaborated and explained how his housing situation impacted his academics, extracurriculars, work, etc. \n\nYou have the essay. Post a link, copy and paste, scan and attach, do whatever.", "He could also stay in that school and choose to be homeless for another year ……", "Your morals aren’t the same as everyone else’s morals. If the majority of people are embellishing their stories, then it stands to reason that embellishment isn’t, in fact, immoral. You may consider it to be, and that’s fine, but it doesn’t make it so.", "He wasn’t homeless. He had a home he could’ve gone to and he chose not to live in it.", "I’m just asking, when he literally had a home, how is he homeless?", "I’m mentioning it now. His parents had to move for work, and wanted him to join him, but he refused because he felt changing high schools halfway through school would hurt his college applications", "That’s basically what his essay was", "Still, he had a home to go to", "Your definition of homeless is not having a home to live in. He does, and chose not to live in it. Willfully refusing to live in a home you have doesn’t mean you suddenly don’t have a home", "No, the essay was attached to the article", "Semantics is a poor argument here. ‘Technically homeless’ or not, he had a joke he could return to.", "Your point is?", "Nope, it’s an unauthorized student paper, why would they post it online", "From the article, he had a car, his parents paid for it, and they gave him an unlimited credit card. So it’s not that hard to get two states over", "Yes, he mentioned it, and said the issue wasn’t regarding grades or graduation but extracurricular leadership positions", "The laws?", "> didn’t have a home to come back to\n\nHe literally did though. He had a home in a different state, and the means to get there whenever he needed. Regardless of if he didn’t live in it or not, he literally did have a home", "I didn’t need see the need because I didn’t think people would assume", "I won’t expose an essay not meant for people beyond my school, no", "Yes, if he chose it it’s not that serious", "By that logic, racism was okay in the 1800s or whatever because most people agreed to it. Which is obviously untrue, because majority opinion doesn’t determine morality", "I'm sorry that you're having such trouble with this. Not sure why you even posted here though, clearly you believe you are not an asshole for being offended at a stranger's situation.\n\nOut of curiosity, what outcome would you deem to be \"just,\" here? To placate your own sensibilities?", "HE DID NOT HAVE A HOME!", "Yes it would. Do you not realize that some schools have different graduation requirements? There are some classes he would have taken before for no reason, and some classes he would have missed previous years and had to make up. Plus some schools have different senior projects, some of which need to be started in your freshman year in order to be completed on time", "Waaait i really really hope you won’t study law, because how can you call him having a fixed home when he never lived there?\nHes an adult, hes not a tenant, how the hell in your mind does he live there?\nI mean i don’t know how it is in the US, but here in Germany that would 100% wouldn’t be having a home.", "A single word? Wow, literacy really is dead.", "Ah yes, the super classic \"it's super easy for a 17yo to make their way across state lines when kicked out of a home last minute and has school the next day\"", "My definition of homeless is not owning a home or having permanent residence. \n\nBeing homeless doesn’t mean living in the streets under a bridge, tent, etc… although that is typically what you see. Maybe thats why you don’t see him as homeless.", "I’m not sure what your problem is. Since you learned about the kid’s life from the article, presumably it matches what he wrote about in his admission essay (since otherwise the university would be able to catch him in a lie). He was admitted based on his discussion of his experiences, in that essay. It’s an essay, not a single word. So even if you think he wasn’t really “homeless” — that’s not what his Ivy admission was based on anyway.", "Why does this bother you so much? He wrote an essay and got into college based on his experience and you are so hellbent on making him out to be an AH. Why? Who cares?", "\"Homeless Student Gets Into Princeton\" sells papers. \n\nIt makes the high school and the district look amazing.", "What's the name of the paper?", "so his commitments and activities that furthered his studies and contributed to his mental health/quality of life?", "Do you know why he didn’t live with his parents? Granted this is just wild speculation, but if his home life was bad enough, he may have felt that he couldn’t really call it his home. You have no idea of, or at least didn’t mention, any sort of abuse or other conflict in his person life. Even though he “had a home”, it wouldn’t have been a real option necessarily, even if it looked like that from the outside.\n\nHow did you fall into homelessness if you don’t mind me asking?", "That’s what people do when you leave out information. Are you leaving out anything else?", "This was a high school newspaper?  \n\nOh, honey.  \n\nDo you really not understand why the SCHOOL paper would publish an article that is essentially a congratulatory note to the SCHOOL, the district, and the faculty/staff?", "We aren’t talking about how “serious” him being homeless is in the current moment …… clearly not to serious if he choose it ….. guess what , some people choose to be homeless for periods of time in their lives ……doesn’t mean they are broke or have no other option .", "No, by my logic, racism has never been okay, because I’m morally opposed to racism of all kinds. But by all means, pretend that exaggerating on a college essay is at all similar to racism.", "What kind of logic is that? If a stranger does something immoral, are they justified because you don’t know them? He had a home with his parents in another state, and chose not to live there, thus quite literally he wasn’t homeless.\n\nAnd the just outcome is that he doesn’t exaggerate im college essays", "He literally did. With his parents", "So? Im going off his exact words that said otherwise", "At the very least, he had the distinct opportunity to have a home whenever he wanted", "A riff off of the theme of homelessness that neglected to mention he had a home", "He didn’t get kicked out of home. His parents moved and wanted him to move with them, but he chose not to because he didn’t want to switch schools.", "He had a home with his parents. He could’ve lived there. He chose not to, because he felt staying here would be best for his college applications.", "The essay was quite different than the article", "OP was homeless and I am pretty sure all of this is due to their own issues with that. they say in a comment that they know what homelessness is really like. it doesn’t seem like they really wanted the judgment given", "Because a) he embellished his experiences and b) as somebody that’s actually been homeless it’s infuriating he had a home and was still claiming to be homeless", "Yes, if only it was an actual homeless student that does. Maybe next year, if I get in, it will be me", "Why would i tell you the name of an unauthorized paper that can’t be found online?", "Nope, they’re extracurriculars so outside the scope of his studies.", "Because he felt moving to another state and school halfway through high school would be bad for his college applications due to losing out on opportunities for leadership positions in school and such\n\nAnd because my mom was an addict when I was younger, so I was homeless from 7 to 9", "It’s what people do when they’re illogical. As for if I’m leaving out anything else, I’ll tell you if I recall anything further", "It’s not an official paper run by district", "That belief is incompatible with your belief that what the majority believes determines morality. As for them being similar, I’m not saying they are. I’m illustrating where your logic falls apart", "YTA .", "YTA\n\nThis is super weird and nasty. What the hell is wrong with you?\n\nYour obsession with taking this guy down (despite being objectively wrong), over something that is literally none of your business, is super creepy. You post and comments are deeply disturbing.\n\nYou are targeting someone who is homeless, being super petty and spiteful over a wilful lack of understanding of what it means to be homeless. Again, over something that is none of your business.\n\nDo you kick puppies for fun? You display a disturbing lack of empathy dude.", "YTA. I wouldn’t consider that homeless either, but you sound like a hater and a matter-of-fact kind of guy. Let him have it and get over yourself.\nYou gain nothing expect looking like an asshole confronting him", "YTA I worked as a case manager at a domestic violence shelter. The kids residing there we’re considered homeless by the state and local school district. \n\nYou sound very insensitive and I’m having a hard time understanding why you felt the need to confront him on something none of your business. \n\nHe definitely should be applauded for working through instability and making it to an ivy.", "YTA, his parents left the state and left him behind and he had to bounce between two different families.  So yes, he was homeless.  Plenty of homeless people end up couch surfing just like he did, they have a roof over their heads but they certainly don't have stability or a place they can call their own.  Homelessness comes in many forms.  You are definitely an asshole.  Maybe learn more about what homelessness entails before you start criticizing people and acting all high and mighty, especially when you are blatantly wrong.", "YTA. That’s homelessness. You owe them an apology.", "YTA. A huge one. He literally meets the legal definition of homelessness under the federal McKinney-Vento Act.", "YTA, he was homeless according to the definition that schools and gov entities use. Also, stay in your lane.", ">So I don’t see that as homeless.\n\nIt doesn't matter what you \"see\" as homeless. Homeless means without a home, and he didn't have a home. You were wrong, you are wrong, and you owe him an apology.", "Wow. You just may be the biggest A H that I’ve ever seen on here. You also sound quite bitter and jealous. Grow up.", "I'm extremely proud that he is going to an Ivy League school despite what he went through. However the comment below explains it perfectly and takes this as a lesson and do not ever diminish other people's experiences.  YTA \n\nYou owe him an apology. \n\n\n\n[comment](https://www.reddit.com/r/AmItheAsshole/comments/15kwawg/aita_for_telling_somebody_they_werent_really/jv7l4j7?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=2)", "YTA, I'm currently homeless due to my rental being sold. My kids are with their dad and im living between friends trying to get another house. I have no options to move in with them permanently. I'm classed as homeless by the South Australian housing authority. If I run out of friends im sleeping in my car until I can get a place. Your classmate is also fitting the same definition of homelessness that I do. Just because he isn't living in his car or on the street doesn't mean he isn't homeless", "OP, I look forward to you growing up, re-reading this and cringing mightilty. If you don't cringe, you haven't developed beyond your teens.\n\nYTA in fireworks.", "YTA, yes, he was homeless. The places he was staying at were never his home. He was an extended guest. That's not the same thing as having a home.", "YTA. Hidden homelessness is real and still has a profound effect on people. I was in his situation for a few months once and you're constantly aware that you're only one 'I need my own space for a while, sorry' away from a night on the streets. He absolutely was homeless.", "Yes", "YTA. So is someone who is staying in a shelter not homeless? He doesn’t have a home, therefore he is homeless.", "A home is as simple as four walls and a roof, but much more than that.\nHousing insecurity is a huge stressor. \nI've been homeless, like actually slept in parks at 16. That was my choice. Not easy not safe. \nI've lived with parents that bailed on me. I've lived with home insecurity during a lot of my formative years. I'm not young any more. But I remeber couch surfing when I was under 10 and my parents were going through a shitty patch.(basically physical abuse forced my mom to stay with friends with 2 kids in towe)\nI had a home every night I stayed with family according to you. Tomorrow was never promised. I felt in control sleeping in a park. Furthest thought from reality. Again in my late 20s through the great recession, went through a bad breakup. I had to couch surf. Even after I found roommates, i moved ev÷Ryan 6 months. Couch surfing isn't homeless. There is no safe feeling in being that unstable. Yes you are right. Kid ain't homeless. And yes your an asshole for pointing out the obvious and ignoring the reality he is experiencing in the temporary nature of his housing.", "YTA", "Envy.", "NTA did yall miss the part about the guy **choosing** to stay with friends in the current state instead of going with his parents to live at their new home in another state? \n\nIs it really homeless if you choose to be when you have the option not to be?", "YTA \n\nThis was my life in college. I was living at home working 30 hours/wk, going full time to the local CC. My dad got us evicted, and he decided to move in with his girlfriend 3 hours away. I didn't have a car and had to hurridly pack my stuff.\nThankfully (I thought), I could move in with a friend's family. I found out quickly that they were abusive and fought all the time.\nMoved in with an acquaintance, and that was quieter and generally safer but had other issues. \nI lived with a friend's mom until her daughter came home and they needed the room.\nCouch surfed all summer until my dad moved back to town when his gf broke up with him.\n\nMy grades suffered, my work suffered, and my tiny savings account was drained. Did I have a roof over my head? Yes. I never slept on the street. But the trauma and stress of that time in my life was insane and I wouldn't wish it on anyone.", "YTA Green is an ugly color on you.", "Did he have a home? NO. He couch surfed. That's homeless. YTA", "YTA - they got into an Ivy League school, you didn't.", "I came here for this. I lived in a friend's car, on another friends couch, and was tricked into being roommates with a girl who made me pay $200 to sleep on her floor in the living room.\n\nI still have PTSD from the 6 months of homelessness. I slept on the street one night and almost died from frostbite. But the other places were pretty bad too.", "Also known as secondary homelessness", "Lol, this isn’t a “catastrophic” life change. \n\nHis parents moved out of state. He *chose* to stay, even though he could have gone with them. He was *privileged* enough to have friends who had families with the resources to support him for free while he finished his last year of school. \n\nHis “homelessness” was a choice based on his *preference* not to leave his friends; not because his family lacked the means to support or provide a home for him. \n\nHe’s a fraud. NTA.", "“Unstably housed by choice.”  \n\nNot worthy of praise or sympathy.", "OP is accusing the student of lying about being homeless for the purpose of remaining on their school of origin.\n\nWhich would involve significant failures at both the school and district levels.", "Regardless of your opinion, it is homelessness.", "Resources for homeless people do.", "Pretty sure OP is salty that the guy got into an Ivy.", "Thats not what it sounds like in your post.", "Let's actually not doxx a random stranger for the crime of OP not thinking they're homeless enough.", "Listen... Some people who live on the streets have family that they choose not to live with. People who have beds in shelters may have family they choose not to live with.\n\nKids/teens can choose to stay elsewhere or be kicked out of their parent's home for one reason or another. Just because they are (hypothetically) given a place to sleep at a friend's doesn't mean they aren't homeless.\n\nEveryone's life is different, and they make choices based on what makes the most sense for them, including what provides the best options available or what keeps them the safest.  Does it make them any less homeless just because they have parents, siblings, or a spouse that they have opted out of living with? No.\n\nWere this a friend of yours, you would have a better understanding of the difficulties this kid went through. He made the best of a sour situation and was able to use the experience for his benefit.  He did not get into the Ivy League solely based on his essay, so don't act like that was the case.\n\nEdit: I see that you've experienced homelessness. Stop focusing on him, and start doing what is right for you. Just because he's been dealt a different hand than you doesn't make his struggles any less real to him.", "It’s weird that you seem to be “hyperfocused”on the fact that your “homeless by choice” friend actually had a home that he could have gone to at any point but rather chose to exercise a large amount of social privilege by living for free with the families of friends who had the resources to support him. \n\nCrazy!", "The point is you’re gatekeeping the definition of homeless. I’m sorry you’ve experienced homelessness yourself, I don’t wish that on anyone, but that doesn’t negate his reality. I would agree there are varying degrees of difficulty that people experience, as in a spectrum vs binary thinking. But your thought process is binary, that’s the problem.", "Man, you had to have a lot of patience to tease it out, but you did it! The rest of us thank you, now we can stop wondering why this guy is so butthurt about this.", "YTA\n\nPeople don't have to be sleeping on the streets to be considered homeless and who the F are you to try and gate keep who qualifies?", "You try bouncing around on couches for a year. tell me when it starts to feel like home", "YTA and extremely narrow minded and ignorant to the different forms of homelessness; next time, just keep your mouth shut since it's obvious that you a) don't know what you're taking and b) have no idea what his family dynamic or actual situation is.", "While in my 19's-20's I slept on the floor in a basement that happened to also be a garage. My two buddies let me stay there. And I would NOT have relived that shitshow. Just because he had a place to be, it's hard AF to live in someone else's home and use their space and eat from their generosity. Honestly, stopping and talking with homeless or impoverished people is something I encourage everyone to do. It could make the world better.", "You gave the definition of secondary homelessness. He was homeless - yta. You definitely do not \"know\" what homelessness is.", "YTA. Not only were you wrong to think it, you were wrong and an asshole to point this out to him for no reason at all and making him feel less than because he wasn’t homeless ENOUGH for you.  YTA forever for this.", "He didn't have permanent housing. ergo he was homeless. \n\nYTA", "Hello, I am a lifelong Poor and have been homeless more than once. \nMy homelessness involved staying in family shelters/tents in campgrounds with my family. Some people's homelessness involves literally being on the street 24/7. It doesn't mean I WASN'T homeless, it just means other people had much worse experiences. \n\nI mean if he lied about his direct experiences, yes that would be fucked up, but if his essay described his life accurately, the label of \"homeless\" doesn't even really matter.\n\nI do get why this is annoying for you, but this is not a thing you need to bother gatekeeping. Your friend WOULD be considered homeless by any welfare agency. \n\nYou ARE being a huge asshole, you ARE invalidating his experiences, and you're too stuck in your own view of things to understand that. Good luck.", "YTA. This kid may have had some soft places to land, but he didn't have a home. His struggle is valid. (And sidenote: so is someone's struggle who DOES have a home that isn't homey—a place that doesn't feel safe or stable or welcoming.) \n\nSounds like the article portrayed his struggle accurately, so unless he outright LIED in his essays with stories of living in the streets, then you have nothing to call him out on.", "YTA. I lived in a car with my dad on and off three times.Twice in high school and once in my sophomore  year of college during summer. So you're saying I wasn't fucking homeless because I had a car to sleep in and I lived out of motels when we had a little bit of money. \n\nHe was homeless whether want to believe it or not. It's not up to you to decide what's considered homelessness or not.", "NTA - even without the extra comments, this dude basically lied on his college apps by engineering a situation that meets the technical definition of the term without any of the hardship it actually entails.", "NTA. This thread is full of morons", "If he was couch surfing by choice because he just didn’t want to change schools then he is not homeless. If he had no choice, ie his parents were abusive or something he is homeless.", "NTA. He wasn't homeless. He stayed behind to graduate with his friends and planned it out in advance before his parents moved.", "YTA - I worked at a homelessness charity and he fits the definition. Couch-surfing, having a temporary roof over your head...doesn't mean you have a home", "YTA. Everyone knows couch surfing isn’t considered living at a home. It’s a lot harder than you think because couch surfing isn’t a stable home, it isn’t always liveable, sometimes, it’s difficult to get to and some people end up getting kicked out. Homelessness stems further than not living in a home. You have no right to judge him on it", "YTA you don't get to decide the severity of someone's homelessness just because it doesn't fit your preconceived notions of what it is. Not having a concrete place to call home **is** homeless and that's what this guy went through. Do you think that couch surfing and trying to maintain your position at a competitive university is easy? You need to apologize to him and have a long hard look at yourself. Ask yourself why you feel the need to challenge people on their own lived experiences and berate them when they don't see things exactly the way that you do.", "NAH. College application essays are a scam incentivizing trauma stories. Your friend just found an excellent way to spin his story in a way that admissions found appealing. He’s not an AH for playing the admissions game, and you’re not an AH for being upset that real issues become just another plot point for an admissions essay.", "YTA", "You don’t know everyone’s situation at all.\n\nMy family is rich. Really rich. But only because of my grandmother. And only because of my great grandparents.\n\nNot my parents.\n\nYet, everyone around me assumed that because I’m the rich kid, I had a perfect life and all of the privilege in the world.\n\nNot at all. My parents neglected me in every way possible. My father did his best, but he was working constantly to pay off child support. My mother would hoard the CS money and starve us. She would only buy food for herself to binge and purge in the middle of the night. She would verbally and physically abuse me. Daily I would come to school, my eyes swollen from crying nightly and every morning due to the constant stress I was under. Not to mention the eating disorder I developed which nearly killed me.\n\nIf not for my grandmother, I would be dead by now. \n\nYTA. Stop with the assumptions.", "YTA", "I have a family member who claims homelessness when it suits her needs. Never spent a day on the streets. NTA", "YTA and I bet you're jealous he got into an Ivy.", "YTA. \nLegally speaking, he was absolutely considered homeless. The couple he was staying with had no obligation to let him stay, and he could have been kicked out at a moment's notice. Given that they're family friends, they probably *wouldn't* do that, but homelessness has a pretty broad legal definition, especially as applied to students.", "Nta. He was a taken care of kid that just didn't want to move with his parents so he stayed with friends and had a car and credit card his parents paid for.", "YTA. Perhaps you’re correct- if he just decided he wanted to stay local for the last few months of senior year instead of moving with his parents, he was absolutely in the wrong. However, it’s not really any of your business to say anything. Perhaps he was milking a situation he wasn’t in, or perhaps he truly was homeless. Regardless, keep your opinions to yourself when you’re unsure.", "YTA - So what he is not suffering enough for you, Sounds like he is living off the kindness of friends, But is a thin line away from having nowhere to stay, Like if they have problems and need to move home he loses a place or he they have a argument he could get kicked out.  He is not living on the street yet but could be at any point.", "YTA", "NTA. Sounds like he was given the option of travelling with parents to new state or finishing off his school year with his friends and not having to deal with a new school and took that option. You don't just kick out a kid when you leave state, not the least of which it's illegal. A couple of friends families put him up for the year, I've heard this happen several times before because a new job comes up but it's a terrible time to leave school. Sure most non shitty families just do what is best for their kid or the person with the new job moves and the other partner stays for their kid then moves out after.\n\nhe wasn't homeless, he dealt with the same thing every divorced parents kid does in having a different house they felt slightly odd with, that's life.\n\nBeing actually homeless, not knowing where your next meal was coming from, working or living out of a car is not the same thing.", "YTA. must be nice to know that at anytime, you can go home somewhere to relax without care throughout your entire life.  also, good job on shitting on other people suffering.  i am sure your parents must be proud.", "YTA he didn't have a home. Yes he was floating from couch to couch. Guess what buttercup he is homeless. \nWhat woudl have happened to him if one of those families decided to not allow him to stay. \nHow about this Learn about being Homeless and all the different variants of being homeless.", "Former homeless person here: I have put up with the kind of attitude OP is displaying towards this kid, and I gotta agree that OP is totally TA.  My husband and I spent almost two years in Florida trying to get ourselves to where we could afford to get a place, and not only did that NOT work, but we both had accidents that had us both convinced that the state of Florida was trying to kill us.\n\nWe’re back in Colorado now, and between the first lockdown and waiting for months to get an answer out of The Emergency Rental Assistance Program, we were homeless the entire freaking time.\n\nSo OP, YTA, and a huge one at that.", "NTA", "The school district would also absolutely consider the boy homeless. Any student who is living in housing that is not in the name of their nuclear family (or the adult who has custody of them) is considered eligible under McKinney-Vento status due to being homeless. There’s no rule that says they have to be on the streets.", "Yup. Just because this person absolutely doesn’t have it as bad as the dude sleeping on a cardboard sheet at the bus stop doesn’t mean that he’s not homeless. Having perhaps fewer or less severe challenges than others doesn’t make this kid’s insignificant.", "YTA, OP! I was homeless for over two months this year after leaving my abusive ex. I lived in motels, Air BNB rooms, and on a friend’s couch. All this while I had to mask and go to work every day, pretending everything was fine. Every dime I made pretty much went to staying off the streets which made it impossible to save. I busted my ass to get funding through different non profits for first and last to get myself into an apartment. \n\nWhen I told people about it after the fact, some said I wasn’t really homeless because I wasn’t in a tent outside. The struggle is real regardless and your dismissive attitude about his struggles says a lot about you.", "Plus the whole point of college essays is to play up how you overcame your challenges. Nobody writes one about their charmed life.", "Aren't house and home synonyms?  If I pay to live in a hotel for a year...I'm homeless but not houseless?  And if I pay month to month for an apartment, I'm neither?", "One of the only sane comments on this entire thread of delusional people. How the hell is everyone attacking this kid who was actually homeless, for calling out some schmuck abusing the system? \n\nFor all of you \"oh this technically meets the barest minimum legal definition of homelessness\" please show me some stats on how many homeless people have fully paid for cars and credit cards.", "This needs to be upvoted more. People are delusional if they think Ivy league colleges/universities accepts *poor people*...\n\nAnd NTA OP. \n\nThe A H is that fake person pretending to be homeless and is gobbling up fake sympathy. 🙄", "Yeah the comments put this in a totally different light. I agree with you 💯", "There's a ton of info that OP left out of the post that might affect this judgement. Not sure where I land on this one.\n\n\"His parents didn’t abandon him, he chose to stay here and worked out a plan to live with people in advance. He could’ve gone to his parents’s place anytime\"\n\n\"Except he had a home, it was planned out where he would live a year in advance\"\n\n\"From the article, he had a car, his parents paid for it, and they gave him an unlimited credit card. So it’s not that hard to get two states over\"\n\n\"You joke, but he had a 60k car.\"\n\n\"If it fell through, then he could’ve lived in his home in another state with his parents. As per the article, they wanted him to join them and he chose not to because he felt moving schools in the middle of high school would be detrimental to his applications\"\n\n\"he felt moving to another state and school halfway through high school would be bad for his college applications due to losing out on opportunities for leadership positions in school and such\"\n\n\"he was never at danger at not graduating at the same timeline\"\n\n\"he mentioned it, and said the issue wasn’t regarding grades or graduation but extracurricular leadership positions\"\n\n\"he did this for sophomore year, and then his parents returned, and later, he applied to colleges\"\n\n\"He said himself in the article he had the opportunity to live with his parents in their new home but chose not to because he didn’t want to switch schools\"\n\n\"homeless?\nI’ve actually been homeless, so no, I haven’t had an easier life than him. I just think having a home to return to and choosing not to live in it doesn’t make one homeless\"\n\n\"because my mom was an addict when I was younger, so I was homeless from 7 to 9\"\n\n\"'Were you on the street during that time? How did you survive?'\n\nSometimes, and sometimes in shelters. I don’t know, I’ve mostly blocked out that part of my life.\"\n\n\"I did read his essay, because it was attached to the article\"\n\n----\n\nHowever, also relevant but somewhat confusing info:\n\n\"I’m not American\"\n\n\"I’m from an ethnic minority that’s currently being genocided right now\"\n\n\"his parents are wealthy and sent him to boarding school in the US. I later joined him on scholarship\"\n\n\"'So this all happened in the us? His parents moved states within the us, not within Myanmar? Again another important detail'\n\nYes, it happened in the US\"\n\n\"he was neither a child nor a US citizen when this happened\"\n\n\"You realize there’s a civil war in Myanmar that disrupted people’s education, right?\"\n\n\"'Then how old was he in sophomore year when this all happened?'\n\n19\"\n\n\"And what state did this happen in?\n\nRhode Island\"\n\n\"I said he enrolled in a school in the US, which was in Rhode Island. Not that he was physically in the US, because he wasn’t\"\n\n-----\n\nThat was OP's last comment and there's no update about what they mean that this other student wasn't physically in the US.", "I don't get it.  How is living for a year in a hotel different from renting an apartment month to month?", "I guess I don't get the difference between renting a hotel for 2 months or renting an apartment.", ">so I can say having a home and choosing not to live there isn’t homeless\n\nno, actually, you can't", "edgy", "Most places have tenant rights if they stay more than a few weeks.", "After reading this I agree with Op.", "This totally changes my vote", "This should be higher up. Individual comments don’t make a difference, but the sum of this very much impacts it.", "I was ready to call OP and A H but after reading this, the student was not really homeless. He had a home to return to and was provided for by his parents.", "Yeah I could kinda tell from OP it was gonna be one of those, and I understand people being defensive of genuinely homeless who are sofa surfing etc, but that top comment was so fucking Reddit.\n\n'No he's 100% homeless you're a horrible man' if they don't have a registered address in bel air with 5 servants they're homeless you evil capitalist", "Are you suggesting that people who don't live with their families are homeless?", "Homeless by choice? If they own a home in another state, that sounds better than what I've got going on (renting).", "So why didn't you go live with not your parents to get into the ivy league then? You can either admit he had a lack of resources or admit you're jealous of his \"dedication\" to what you apparently think is a grift, but you gotta pick one.", "then if he’s a legacy, he probably got in because he’s a legacy and that’s a sound statistic about the advantage it provides. so you’re mad about an essay that was probably never read by an admissions committee and will be forgotten once the school newsletter for next week comes out.", "kinda weird this detail is only coming out now that the judgment is overwhelmingly not in your favor.", "what’s kind of wild about the fact OP has not posted the article is that he has repeated its not on the internet, so it’s not searchable. Given some censors, there would be no way to trace where or which school it is.", "so if it’s not online, and thus not traceable, why wouldn’t you post it with all the identifying information redacted?", "If you have the spare time to nitpick what someone else is going through it’s because you’re bitter and lame. \n\nStop pretending it’s about “morality.” You’re just mad he got into a good school while he was homeless. You are clearly not and have never been homeless, never had to experience constant instability and feeling like you’re leeching off of people just in order to exist.\n\nThis type of behavior is super lame. I hope you grow out of it because you sound absolutely miserable to be around.", "YTA and are obviously jealous about them getting into an Ivy", "YTA and flat-out wrong. I'm afraid I can't expand without getting myself banned, but other commenters have covered it thoroughly.", "YTA, he didn’t really have a place where he could call a home. He kept moving around.", "NTA I'm a former homeless individual. My life was park bench sleeping, running from the cops, being arrested for being homeless and trespassing as well as eating out of the garbage. That dude had an extended stay at his buddies house who I'm sure took very good care of him. Fuck his asshole friends.", "NTA\n\nOMG you are the BIGGEST asshole. \n\nAnd a whole bunch of other stuff I started with….but then I read further and realized holy crapballs this guy is a fucking piece of work!!!\n\nHe was definitely not homeless.", "Your ignorance doesn’t mean you’re right. It’d be a good thing to learn young.", "Then he can always go to his wealthy parents home. Or use that credit card for a hotel room. Sure he’s technically homeless. But why would you support him using this self-imposed slight inconvenience to slide his way into an Ivy? Don’t folks who have no better options deserve more than having some privileged dude take advantage of his slight inconvenience?", "Obviously not you dunce stop being deliberately obtuse 🙄", "Oh so now it's not cool to pick at one another over irrelevant facts? This thread lol.", "Semantics to make op feel guilty. Yta bro", "He wasn't at the mercy of the people he was staying with though, him and his parents set it up with his friends beforehand and at any time he could have decided to go live with his parents again at their new place. If that's homelessness then foreign exchange students are also homeless.", "He had a home he chose not to go to. He was visiting. Not homeless.", "I don't even say I've experienced homelessness despite the fact that my dad and I ended up living in hotels. I've called it \"virtually homeless.\" I mean, maybe I shouldn't anymore, but I wanted to acknowledge that I was never without a roof over my head, that others have had it worse than me. Not because I'm ashamed but because I don't want to oversell how hard I've had it. Reading this shit is like, the audacity!", "Hi you’re just deliberately missing the point there were no irrelevant facts being used to pick on anyone you’re just antagonistic for bi reasin I’m blocking you now", "This kid chooses to live away from his family so he can have better extracurricular leadership opportunities. Has a $60k car, parents worked out his living situation, a credit card and has a home with parents two states away at any time he wants it. But he’s homeless and OP is an AH? \n\nThis dude is using his privilege to become “homeless” so he can slide his way into an Ivy and you all are killing OP for calling him out?\n\nWealthy person *choosing* to be technically homeless to gain some advantage is the AH move, not the OP.", "NTA. I have to assume that most of the YTA comments were from before you gave extra infomation because this scenario is not homelessness. Homelessness, including couch surfing is where you are reliant on (and at the mercy of) the good will and charity of others supporting you because you have no other safe, affordable options. If that kid is \"homeless\", so are kids at boarding schools, anyone who lives in the same house as their landlord or has done a homestay. As it was all arranged beforehand, the parents were very likely paying the family he lived with to cover all his costs and he was boarding with them. \n\nDespite what Redditors seem to think, it is definitely a choice to not live with his parents. I changed high schools four times due to my parents jobs and maintained excellent grades. Many, many kids change highschools in their senior years and do just fine.\n\nI think it is unfair to call OP jealous. This is very similar to AH who make up a disability. It undermines and mocks people who genuinely struggle. People say \" that guy got into an ivy league school while homeless so the kid sleeping on the streets at night to avoid abuse must just not be trying hard enough\". Except it is completely different. Calling boarding with a safe and stable family because you don't want to switch schools, without stress or hardship of not knowing if or how long you will be safe \"homelessness\" is insulting and demeaning to those who do know that fear.", "YTA he was homeless. He had no place that he belonged to. No place where he could be comfortable and relaxed and himself. That's what being homeless is. It's not being house less it's being homeless. You don't realise how important a home is until you don't have one. You behaved like an entitled selfish ass.", "I think living with friends for months as agreed upon in advance as a sure thing, count as \"permanent housing\"", "And even if it wasn't why do you care if he embellished to get a step ahead?", "It's also called precariously housed and it can be a nightmare. Like sure, you're not on the streets but you don't need to be in the worst case scenario to feel the effects.", "YTA. Is your last name Mirriam or Webster? Because unless you write dictionaries for a living, you don’t get to define homelessness.\n\nSo it doesn’t really matter if you read his story & “don’t see that as homeless”. What you “see” &/or “don’t see” as homeless is worth less than gum on someone’s shoe.\n\nQuit talking out your ass & making a fool of yourself. Educate yourself.", "There was a helluva lot of security sleeping in other rich peoples houses. He had a home, a60k car and an unlimited credit card. How many homeless people have that, ehhh buster?", "Why did I have to scroll this fucking far. Thank you", "All the YTA responses must feel strongly about the \\*checks notes\\* homelessness epidemic in the foreign exchange student community, which was pretty much exactly what the kid in the OP was doing.", "yeah NTA in this specific instance.\n\na long time ago my dad kicked me out and my mom currently had 2 kids, a dog and a cat staying with her in a 1 bedroom flat. it was about a 6 month + period where i crashed at a friends and lived out of bags.\n\ni still struggle to call that homelessness. i was unemployed and completely broke. living off the kindness of a friend's family until i got back on my feet. \n\ni described it as homeless before and felt immediate guilt.\n\ni can't imagine spinning what this guy went through as homelessness.", "Poor baby sorry your writing skills are trash, has nothing to do with the OP, who got into an Ivy League while homeless. Couch surfing is homelessness, good on you for never having to experience it. Imagine gate keeping what homelessness is lmao", "Yep, I'm blown away by all the \"YTAs\"  His follow up answers elaborate even further that the boy chose to stay behind. AND had an unlimited credit card paid for by his parents and access to a vehicle paid for by parents. Absolutely not homeless in any way shape or form.", "He didn't represent himself falsely by this fellow's own words.  The op just doesn't believe that the definition of homeless is considered homeless.  He disbelieves valid dictionary definitions just to be spitefully angry.  YTA op.", "Except he wasn't homeless. He chose not to live at home.", "And you too. This guy was not homeless.", "He was homeless. You should educate yourself. Housing planned in advance. 60k car, credit card with high limit. Not homeless.", "Oh so you’re gatekeeping homelessness now?", "Except it's by his own choice. His parents have a home. He refuse to live in it. Not homeless", "This should be higher up!!! Everyone read this before your judgement!\n\n@OP, be better at explaining things on reddit. Its unforgiving when you leave out such important details!\n\nNTA", "In the 1920s my grandma had a high school student as a lodger. His mom and stepdad were moving and he didn't want to.", "A motel and not all my money goes into renting an apartment. It costs way more to live in a motel. There’s no where to cook in a motel. You cannot receive mail there. You really can’t even begin to understand the differences? Come on now…", "No, he was in those places at other people's mercy. That's literally homelessness. I know you changed the details afterwards but just for the record, friends letting you crash on their couch/spare room cause you have no place to go IS HOMELESSNESS.", "NTA he was living at friends houses his parents had set up before they left. He could have left with them and stayed at their new house but he didn't want to. He wasn't homeless.", "Kids who run away or are thrown out but will be allowed to return if they ”fix” whatever their parents deem is wrong with them also have an ”actual home”.\n\nYou are focusing on homeless as a strictly financial issue. Not even the financial situation of the person without a permenant home but the financial situation of the people volontering to help. That seems to make you feel like this kid is taking support from the ”real” homeless.\n\nHe might have had it better than someone sleeping on the street, but you are gatekeeping how homelessness looks like and how it is caused. Your limited view on what being homeless is something organisations that work with these issues are activly trying to change. If you have such strong opinions on this issue that you would start an argument about it, then you should read up on the current debate and the basic arguments involved. It might not make you sympethetic to this specific kid, but it might help you understand why others would support him. It could help you not be so angry about it.", "Go back and read it again. The kid is not homeless.", "He had a 60k car and an unlimited credit card. He very well could have made it across state lines", "You are actually wrong on this. A study was done recently that showed lower income students under about the 60th percentile for income had an INCREASED chance of college acceptance as did the top .1% of income. It's the upper middle class in the 60-99th percentile of income that are penalized in college admissions. This was based on similar academic qualifications. (Search up the article in NYT for more info and the chart)", ">some stats on how many homeless people have fully paid for cars and credit cards.\n\nUh, a fair bit. Many people lose their home bit keep their vehicles. Keeping mobile is arguably more important to trying to improve your life after such events that would have led to that. Also, unless they were always on the edge of poverty people have credit cards. Yes there's a subsection that don't, and a smaller subsection who don't even have a debit card because they can't pay the monthly fee regardless of how small but you're painting homelessness in a weird light too. Now whether there's anything  available on those cards or whether they are maxed out but some payments have been made so they don't have it revoked is another matter.\n\nNot arguing about this case in particular, but your broad statements don't hold up more generally.", "Except he wasnt", "It's also called precariously housed which is more commonly used in social services, government, surveys etc."]}