{"id": 24157, "submission_id": "15lb4qy", "title": "AITA for charging my wife's brother ?", "selftext": "Hi y'all, so I'm here dumbfounded and trying to understand what I did wrong, and now I'm asking you people for your opinion.\n\nA few days ago, my girlfriend asked me if I could design the Logo for her brother's new business. I'm a freelance logo designer, and usually I'm booked, but these days I had free slots, so I told her that I could do it. She asked me if I could do a free draft as a favor.\n\nI agreed, and we started with the free draft. I did it within a day, and her brother loved it and asked if I could finish it and also the brand identity for his business. I told him that this would cost him, and he happily agreed.\n\nI finished in two days and sent him the receipt. A few hours later, my girlfriend calls me and tells me that I am the asshole for charging him. I told her that he agreed to pay, and she responded by telling me that I shouldn't have asked for payment and that even if he offered, I should've refused.\n\nShe blocked me after that and has been sleeping at her friend's house since.\n\nI had been thinking that maybe I was wrong for charging her brother; she requested that I do a free draft for her brother.\n\nSo guys, AITA here?", "created_utc": 1691480456, "permalink": "/r/AmItheAsshole/comments/15lb4qy/aita_for_charging_my_wifes_brother/", "score": 1020, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I charged my wife's brother for providing a service which went out of scope of her initial request to provide a free service.\n2. Charging her brother despite being a relative\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You are a professional logo designer, and you deserve to be paid for your work. You did a free draft as a favor, but that doesn't mean you have to do the whole project for free. Your wife's brother agreed to pay you, and he should respect your agreement. Your wife is being unreasonable and disrespectful of your skills and time.", "NTA. It's business.", "NTA it is rude af to expect people we know to give us their labor for free.", "NTA. You're not a mind reader on her preferences and your time is valuable. The free draft was cool of you. If brother had an issue with paying he should have bowed out.", "NTA\n\nFree draft OK, then professional layout for payrnent. This is the way how it works for a freelancer with relatives.\n\nOr you dont work for relatives, what would be best for your own health.", "NTA and good job identifying that your girlfriend expects you to be leeched from. I bet she has a good job where she works really hard and brings in good money /s", "NTA.\n\n* You're a professional, and this is your job. There's no justification for expecting you to work for free.\n* This is a business relationship between you and your girlfriend's brother, so it's actually none of her business.\n* A draft isn't the finished product.\n\nThe only person going back on clearly set expectations is your girlfriend.", "NTA. You're a professional, and your time and skills have value.", "NTA. This is your job. You did a draft for free then he agreed to pay for the finished work. If she wants to work for free, she can do so.", "NTA. Keep her blocked and change the locks.", "NTA. You were asked for a free draft, not a free finished product. Besides, he agreed to pay for the final product. If your girlfriend wants to break up with you over this, then that’s where the cards fell. At the end of the day this is how you pay your bills. If you relent and give him the finished product for free, what’s next? More free products to please her? No, let her walk out the door if that’s her choice.", "NTA - unless you explicitly said at the beginning that there was no charge, why *wouldn't* there be a charge??", "NTA. Speaking as a massage therapist - anyone with specific skills is always going to have family try to take advantage. You were very generous to do the free draft but you 100% deserve to be paid for your work. You were clear with him up front so you didn't do anything wrong. 2 days a good chunk of time you could have been using to generate income.", "NTA and her brother agreed to the costs, why should you work for free…he didn’t expect you to or he would have said no", "NTA your wife doesn't seem to understand business and you don't mix family, friends and business. This is not a hobby it's your job and I would feel disrespected at her behavior. You did a nice favor when he asked for more you let him know he would have to pay because that wasn't what was agreed upon. Running to her friends house over this seems highly immature and it looks like she just needed a reason to leave or get made.", "NTA - she's an AH for wanting you to do work for free. major red flag, dump her and block her. her bad attitude won't pay the bills, your work does.", "NTA but it’s a teachable moment \n\nNext time someone asks for something among your friends and family, clarify upfront the budget. Before a free sample is provided, the final client needs to know the cost of the final delivery as well as the payment terms \n\nPeople need to understand it’s your livelihood \n\nA lot of relationships are damaged in this type of situation so be prepared for it.", "Wait, is she your girlfriend or your wife?", "NTA --- Ask her if her boss asked her to work for free would she do it?", "NTA. Good work isn’t free", "NTA. It's so frustrating that ppl don't see freelance artist as a real job. \n\nThis is a business transaction between you and the brother. You provided a service and now he owes you compensation. Simple as that. \n\nYour gf needs to butt out. She also needs to start valuing your work.", "NTA\n\nfriends and family (and family of girlfriends) should respect you enough to understand that this is your job. they should want to support you.\n\nyou should have charged him, and if he also agreed then i don’t see what your girlfriends big thing is", "Friends and family should be our first customers to help our businesses grow, not demand or expect free service. It's this expectation that we get free stuff that makes it so hard for people to succeed.\n\nIs her brother offering his skills to people for free?\n\nNTA", "NTA. Designer here too. No freebies, especially to family and friends. They are the ones that disrespect you the most, as clearly shown by your gf. Hopefully it’s ex gf now.", "Nta. That’s your literal job, people don’t do things for free in the real world. Tell her to leave Barbieland", "NTA", "NTA - you did a free draft at your girlfriends request, her brother approved and you entered in to a business arrangement with him. Time is money! He was clearly happy to pay for the service and that’s agreement you have with him is nothing to do with your girlfriend.", "Nta sounds like miscommunication. You didn’t charge for the draft. He asked for an official logo, you told him the price, he agreed. If she is your gf, cut her loose because if this is how she behaves when there’s trouble then you are better off with out her.", "Info: why is she even involved? Is this her business (literally) as well?", "NTA. I’m a writer and my former spouse used to offer my services for free. Nope. Writing is my profession as design is yours. You did the right thing. If gf wasn’t happy, she could have paid instead.", "NTA. Even her brother agreed to charge you. On a sidenote, blocking you for a disagreement that doesn't even affect her is a real red flag. If you aren't married yet (post uses both wife and gf interchangeably) you should seriously reconsider the relationship.", "Info: Did u give him mates rates? She shouldn’t block you and leave though you guys need to talk about that. How did she find out he paid?\n\nIs she wife or girlfriend I’m confused", "Blocked you? I would divorce. NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi y'all, so I'm here dumbfounded and trying to understand what I did wrong, and now I'm asking you people for your opinion.\n\nA few days ago, my girlfriend asked me if I could design the Logo for her brother's new business. I'm a freelance logo designer, and usually I'm booked, but these days I had free slots, so I told her that I could do it. She asked me if I could do a free draft as a favor.\n\nI agreed, and we started with the free draft. I did it within a day, and her brother loved it and asked if I could finish it and also the brand identity for his business. I told him that this would cost him, and he happily agreed.\n\nI finished in two days and sent him the receipt. A few hours later, my girlfriend calls me and tells me that I am the asshole for charging him. I told her that he agreed to pay, and she responded by telling me that I shouldn't have asked for payment and that even if he offered, I should've refused.\n\nShe blocked me after that and has been sleeping at her friend's house since.\n\nI had been thinking that maybe I was wrong for charging her brother; she requested that I do a free draft for her brother.\n\nSo guys, AITA here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Info:\n\nDoes your girlfriend or her family help your family for free?", "Some businesses actually charge their friends more.  Even after their friends realized it, they didn't throw a tantrum.", "Mate, you forgot to spell ex girlfriend wrong. She's making a big issue out of nothing and is throwing a big tantrom for no fucking reason. Dump her, she wants to block you, fine, you're a single dude with plenty of options, go take them. Her brother not only asked you to finish the draft but he also agreed to pay you. Nothing wrong here. Especially if he's not complaining. Move on and find someone more mature than this stupid excuse for a gf.", "Is she your wife or girlfriend?", "NTA \n\nDoes she realize your business is what puts a roof over your head and food on the table\n\nShe is really childish in the way she behaves over you wanting to be paid for your work, looking back you should not have mixed business and family, but you learn as  long as you live.", "NTA. I hope your wife comes to her senses about this.", "Thanks, for helping, I was very worried and accusing myself.", "Reassuring, thanks", "This is my first time, I was worried that maybe I crossed boundaries somehow by charging a relative.", "From now on I'm not gonna work for relatives at all", "Thanks for helping out, I am considering all options and this thread is helping a lot.", "Thanks for this, it helps a lot as I was torn and convinced that I might have Crossed some invisible social behavior line.", "So she blocked me and I'm guessing she wants it over too. Good for me ?", "I totally agree, lessons learned and I have decided never to work for relatives.", "My wife, just identified that I made a boo boo after your comment", "Thanks, totally 👍", "I hope she understands this, she is a bit emotional and I guess she values her brother more than me. And this is what drives her behavior I think.", "Yes and I totally agree, instead of supporting and helping, they desire free service.", "I guess he told her and I gave him the regular $55 an hour that I charge everyone, I charge for drafts too so that was free for him.", "I'm guessing if this is how you make a living you probably charged more than he had expected. He was probably fine at the idea of paying until the bill came due, then complained to her about the cost  thinking he'd get a 'family discount'. \n\nYour talent is how you pay your Bill's, just bc your schtooping his sister doesn't entitle the family to your labor.\n\nNta\n\nBut how much did you charge? Just curious", "There’s a joke that goes “at a party a doctor is complaining to a lawyer about being approached for advice for free. The lawyer told him to start charging, send invoices. People got the point pretty quickly. The doctor thanks him for the advice and a few days later he gets an invoice from the lawyer.” My personal rule is never work for and with family and friends.", "Good morning and your decision is a good way for this problem.", "No worries! I am so tired of seeing freelancers getting paid in “exposure”. Exposure doesn’t pay the bills.", "NTA at all. Your wife is though. I’m concerned she blocks you when she doesn’t get her way, that is very immature and I wonder in what other ways she is controlling or manipulative.", "Nope. It would have been a different story if you hadn't mentioned payment upfront, leading to confusion. But you did. He asked for the work knowing he would have to pay. You did nothing wrong.", "Wise decision", "that there is a pretty big boo-boo, calling the wife your girlfriend.   \n\nOut of curiosity btw... Does your wife help with any of the work for your business?  Has her brother helped you guys out with anything without receiving payment?  This kind of stuff factors in.  With the face value you gave us in your post, NTA.  But if your BIL mows your lawn every week for free or something, then might vote might change", "Just a Freudian slip", "That’s mates rates if you didn’t charge for the draft. You did nothing wrong and the blocking and leaving home is not acceptable I’d advise you to address it.", "Thanks 🙏", "Actually not, she has her own things to deal with and takes very little interest in my business, also her brother lives in another state and I only saw him once. So no, he does not help or do anything that would warrant free service.", "Thanks I'm trying to get in touch with her", "Thanks I'm trying to get in touch with her", "Alright, my NTA vote stays put!", "She wants you to pester her she’s gonna ignore u im a woman I know", "Thanks", "Agreed, NTA.   \nShe asked if you could do the free draft as a favor, you did that. He got a free draft, he wanted more work and was more than happy to pay. You didn't go back on your word. It's pretty straight forward.", "Weird that you’d refer to your wife as your girlfriend. That’s a big slip up", "A few years ago I was getting married and my mum was making my wedding dress, she got far too ill and couldn't do it so I was just going to buy a normal dress. About a week before my wedding my mums neighbour came to me to offer to make my wedding dress for me for free (this is her job and what she uses to pay her bills). She literally did it in four days and was amazing I then put money in an envelope and gave her it for making my dress because I appreciated her wonderful offer. When people appreciate you as a person and the work they do you pay for their services. NTA", "There has to be something more going on that just you charging for your work. She is behaving like a teenager right now. Married couples don't block each other. They discuss the issue like adults and come to a resolution. Something is missing here", "NTA - my uncle is a mechanic, and he still charges me for working on my car.  He gives a \"family discount\" by only charging me what he pays for parts and a little off the labour fee, but he still charges.", "Dude I help with deliveries for my sister(flower bouquets, arrangements etc). And help her when she makes flower arrangements for events. She pays me . At first I didn't want any money(still accepted) and continued to accept the money and refused when I thought she gave me too much. What I am trying to say. Labor shouldn't be free, even among family.", "NTA  \n\n\nBut you might offer them a 50% discount to resolve the situation.", "This is your job. Just because someone is a friend/relative doesn’t mean this should be free. NTA. Your gf is one.", "NAH. You \\*could\\* have done him a solid, but you asked and he agreed to pay. Your wife(?) being upset makes sense too; she was asking for a family discount and kindness and feels embarrassed.", "NTA but I  think should be more concerned that you have a girlfriend", "If you hire a friend for their craftmanship, you should be happy to support their business by paying.\n\nOn the other hand, if you expect to ever need the services of brother's firm anytime in the fututre, you could've both probably saved money by making some kind of i.o.u. deal.\n\nAt the end of the day, the \"you don't charge family money\" thing is a cultural/traditional thing, but her reaction was nonetheless ridiculous.\n\nNTA and neither is bro, you mightve (maybe) made a faux pas but wife needs to be an adult", "Your wife is the AH. Dump her, and leave her belongings on the driveway for her to come pickup", "NTA. No one’s skills are for free. You have bills to pay.", "NTA. Your gf tried to gift *your* labour to her family without asking you for it. She asked for a free draft. You did that.\nHe loved it and agreed to the compensation. Her not managing her emotions around undiscussed expectations is her responsibility. Not yours.", "NTA, you’re a professional and this is how you make your living. I’d like to think you gave him a slight discount but you absolutely do not have to", "NTA. People in your life who try to mooch free services from freelancers they know are the absolute worst.", "NTA, there's a UK phrase \"[mates' rates](https://dictionary.cambridge.org/dictionary/english/mates-rate)\" that means that friends and family get preferential treatment.\n\nSuch as extra attention to detail, fast turnaround. Or a discount, maybe. Not a freebie.", "NTA you have a business you don’t work for free. I have a beautician in the family I still pay for my hair brows and lashes to be done. Why because product costs money it takes a lot of time and she is running a business. Your GF is very unreasonable.", "As a person who has been self employed since the 80's.. I fucking HATE it when people just expect my time for free.. I may offer, that's my choice, but to expect? fuck off. Family or not.   \nNTA", "NTA.  You did the initial work free.  He wanted more, you said it would cost X amount and he agreed.  Your girlfriend is taking the piss.", "NTA.  He agreed to pay and should", "NTA greed is strong in this one", "I’d do free work to help family get a business going. Not heaps but I’d def give them a day or two. \nGirlfriend’s brother, probably not. *Wife’s* brother is different. If you can’t help family, even distant, what’s the point?\nIf he agreed to pay then he should do so but Ida helped out", "NTA\n\nYou checked the brother was happy to pay for your services, and he agreed. It wasn’t wrong for you to ask, and it wasn’t wrong for him to agree (or to disagree, if he was so inclined).\n\nIt’s not wrong to do things for free for family. \nBut it’s also not wrong to be paid for your work. \n\nMy sister is a qualified interior designer and lighting expert. My home is currently going through major repairs after a natural disaster. \nWhen we’re ready for carpet, paint, furniture and lighting, I will be asking her to do up a plan for me. And I will be insisting on paying her. \n\nPeople deserve to be paid for their work. \nEven if they’re related to you.", "NTA. Hers was a massive overreaction. Her brother was happy to pay so what's the problem?", "Nope, she's the AH.  You had an agreement and it was fine until...\n\nWhat freebies does she offer family and friends?", "NTA. For some reason, some people think artists should work for free. It’s a ridiculously common problem. Artists deserve to be paid for their work. Your girlfriend is one of those people who want art made but doesn’t want the artist paid for it. That would be a dealbreaker for me (artist).", "NTA but your wife is. Your BIL seemed fine with the arrangement i.e. paying for a service/product that he wanted.\n\nAlso when did people start just blocking their spouses when there's a disagreement? If this is a cold shoulder tactic it's going too far.", "NTA \nYou're a professional, you shouldn't be expected to hand out free work regardless of relationship.", "I've been friends with someone for over a decade.  \nShe does digital art as a hobby, it's taken her a lot of time and effort to develop her skills. When one of my cats sadly passed she created a portrait of him as a gift. I asked her to do my other cats as well FULLY expecting to pay her for her time and skills. \n\nI hate it when people expect things for free just because (insert random relationship) \n\nIf it wasn't clear already you're NTA but your wife needs to get her head out of the sand.", "i am a retired seamstress and i have family ask me to do weddings and such....i do the bride for free, that is my wedding gift to her,  but  i get paid for all the other stuff related to said wedding...i work from home, so i charge much less than a bridal/ alteration shop, but still....", "INFO: Did you tell him how much it would cost before you did the work, or was seeing the invoice the first time BIL found out how much you charge?", "Wow. NTA. It's your job. It's nuts that she would think you would do it for free. And then to block you cause you disagree? \n\nLet her keep you blocked and move on. She clearly doesn't understand how jobs or life works and is very immature. I'd be worried that she offered your free services to her brother. If you continue with this or give in how many other people is she going to offer your services to", "NTA she was wrong to ask you to do it for free. My niece does art. I commissioned her, I’m her first customer. We worked together to create an invoice. I’m teaching her to value her work, skill and time and the fact that business is business, there’s no friend or family in business. Get written contracts and no freebie’s unless she chooses to give someone a art piece as a gift or to support a real charity. Yes sometimes people need help but It must be your choice to do that, those that ask/guilt/manipulate/pressure you for free or discounts does not respect or value you, your time etc… no one’s else’s needs outweighs you needs and paying your bills. \n\nWhy does your gf feel her brothers needs super exes yours and what you’re doing for him will help him look professional and make money but he can’t pay you for your creative work which is more then a quick doodle we do on the corner or our pages, a lot of thought, time and effort goes into it. If there was a lawyer would she be asking for free to do her brothers contracts for his business. Sir business is business and there is no gf in business and her vag is not unique enough to allow her to think it’s more valuable than precious gemstones and you do it entitled her to go around pimping you out to her family and friends for free services from your business. \n\nIf she can’t respect and value you move on. Her conflict resolution skills are lacking but may just give you time to figure out if you can work with her", "YTA for lying - your girlfriend left you a year ago after a car accident(?) and wants a share of your business, but now you’re married to someone else who you call your girlfriend who is also causing trouble with your business? Bullshit.", "NTA.  You did a professional job and he loves it. It is none of your wife/GF's business about your agreement with her brother.", "Nta.", "NTA. Sounds like you should  start offering  your wife to work for free for family and see how she feels.  You did nothing wrong.  She is immature and doesnt handle this as an adult.", "I feel like she could’ve talked to you even and been like “Babe can we work something out to help my brother out.” If she felt like she wanted to do that and the two of you guys could’ve talked it out and figured it out btw the two of you. I don’t think you’re wrong or that you should give your work away for free but I think she could have came to you with what she was thinking about before getting mad and maybe asked if you guys could figure something out. Maybe he can’t afford it and you could’ve came to an agreement that helped him, made her feel good about it, and also didn’t undermine you work or encourage this in the future.", "NTA. Hook him up with a discount, though.", "Well it depends on how successful you are really. If you're loaded and they're poor I'd say somewhat the AH.\n\nBut this is something everyone who starts a business have problems with. Friends and family are often very late with supporting your new endeavour and might even expect items for free.\n\nIf you're in a somewhat similar economic situation is say NTA, but of course remember not to expect Freebies when he gets his shit started. As an after thought you could maybe have asked a favour in return at a later date.\n\nOh, and btw Google \"Askers Vs. Guessers\"", "The balls on his gf, giving away OP's skills for free!", "In this case it's not quite that.\n\nInstead, it's that variety of asshole which believes the labor of their family/friend is theirs to volunteer, and is immensely upset when that labor is not given (for free) at their direction.\n\nWe also see it with, for instance, parents who believe the labor of their adult children is theirs to direct. \"I volunteered you to spend Saturday shaving Mrs McGillicuddy's bunion.\"\n\nHow dare you not do as I direct!", "Wait… hold up… his wife blocked him I thought he accidentally called his girlfriend his wife cause blocking your partner is a more dating thing to do cause it’s kinda like “la la la I’m not listening” wtf…", "Not true, I do things for free all the time, and in many families unpaid labour is expected. \n\ni.o.u. deals are a thing etc", "I wanted to know that answer too ! The OP has not made that clear at all", "I don't get this \"mate's rates\" mentality some people have. Like if someone is my friend, if anything I want to pay full rate plus a big fat tip because I want to support them and see their business and creativity thrive. If I'm taking time away from them that they could use for paid work, I'm being a shitty friend.\n\nNTA.", "[removed]", "NTA.\n\nHonestly with friends or relatives it’s always best to compensate them if they provide you a service that is their profession unless they insist on doing it for free. Even then it’s still best to pay them back one way or another. \n\nI’ve seen so many barters or handshake deals between friends/family end up nasty. One party thinks they got taken advantage of or the other party thinks they didn’t get enough.it’s easier to just agree to compensation, maybe with a “family discount”, and stick to that agreed price.", "Fair point.", "And only send stuff with watermarks until everything is paid", "2 things\nWife, you never asked me to do the whole job for free, if you had asked I would have considered. I was happy to do what you asked of me and had no idea you felt strongly about working for your brother for free. \n\nNow that that’s out of the way, there are some serious concerns about communication in the marriage. If wife wants something, she should tell you, and not be over the top about something she never asked for. She blocked you!?!? Seems like childish behavior to me but maybe this was a divorce worthy type deal to her. At the end of the day if this was enough to shake the foundations of the relationship, get out while you can. Imagine what you have in store when a real problem arises down the road.", "I would hope not, if she’s your wife…? But maybe that last part was a joke? Anyway, NTA for the post. If your wife/girlfriend has work that she charges for, it might help her understand your viewpoint if you compare it to her doing the same thing for your family.", "Iou is still tit-for-tat. Doesn’t matter, it doesn’t change the fact that he was told the amount to be paid and agreed to pay it. And in all honesty, family/friends that support and want you to succeed don’t demand free things. They help you out with your ventures.", "A very wealthy businessman I once knew, had only one piece of advice.\n\n\"In business, your friends are your enemies.\"", "Total bill for full branding including, social media, stationary items as well as branding guidelines was $650 which is way below what bigger design firm charge.", "Was he aware the price would be that much? Without any research, someone might be expecting a lower price so even though he agreed to pay, it might have surprised him. I'm not saying you should have charged less, but if a price wasn't discussed beforehand I'd guess this is the root of the problem.\n\nIf it was discussed though, no idea what her problem is.", "I have a dog boarding kennel. I now bluntly inform everyone I don't entertain \"friends and family discount\" I have rescues that need to be fed and I'm choosing to lose income on them and if they're in a position to keep pets they're in a position to pay. Took a while for them to get over it but yeah that's that. Just because someone is family or friends does not mean that their dog's food won't cost me money, the place magically goes rent free or that my employees don't need to clean up after them. I refuse to give any dog under my care sub-par treatment and quality care costs money.", "NOT. F\\*ck her and her entitle behaviour.", "NTA, your wife is wildly out of line on this.", "INFO\n\nDid he know the actual cost ***before*** you did the work and invoiced him?", "NTA, but I might suggest always discussing $ up front in a situation like this. The gentle way I do it in my business is simply asking THEM what sort of budget they have. If it’s a super low-ball budget I gently explain to them the realities of what my job entails and what I generally charge. Usually an agreement can be made up front as to what you are willing to do within their budget. Always get the hard conversations out of the way first so that you can simply focus on your work.", "YTA. Communicate with your GF next time.", "NTA, as said you said you'd have to charge to charge and her brother agreed so you're not the asshole", "NTA\n\nFollow up and be as professional as possible but ensure you get that fee without much delay.\n\nHas he paid yet or still stalling?", "I have artists in my family.  If I wanted them to do work for friends or inlaws I would pay them.  It's a little trickier because it's not like you can pay yourself really, but uh, your wife does understand that this is your job right?", "NTA. You don’t work for free and you and the brother discussed this ahead of time. \n\nBlocking you over this is immature and petty. How old are y’all? That’s not how adults handle things.", "NTA. Your wife never explicitly said that you should do this work for free. I get that it’s for her brother but what’s next? Free work for friends? He agreed to pay, I don’t see what the problem is. Also, she blocked you and has temporarily moved out over this? Sounds like you have more important things to deal with. That’s an extreme reaction for something that’s so small.", "Sounds like you dodged a bullet.  Collect from the brother and move on to a new girlfriend.", "NTA. You did a free draft. Your gf doesn’t know your industry enough to know the difference between a free draft and a free end product. Would you have given the brother a free end product if she had asked? How big is her family and how many more requests could you see if this nature? You two need to discuss and get on the same page.", "NTA, her brother agreed to pay so what is the problem? Why should you do your work for free because that's her brother? That's actually crazy of her to ask and with her behaviour afterwards you be digging a bullet here. Does she not respect what you do? I'm so confused.", "NTA, sorry your gf is so unhinged", "NTA - if he was aware of the cost. your girlfriend is way entitled. And blocking someone in the middle of an argument? That is definitely not ok.", "Ask her why she feels your time is worth nothing and she feels she has the right to abuse it?", "NTA why should you work for free? That's how you support yourself.", "r/ChoosingBeggars", "My sweetie is a professional potter. She also had a friend who does graphic design. They often use each other's services. They barter or actually pay money to each other..", "NTA. He agreed to pay, and you should not work for free unless you want to.", "NTA- She is getting into your business with her brother and she has no place. My husband does this sometimes and I have to remind him that I have a business to run, if I don’t charge, I don’t get paid. A lot of times family/friends are customers, that would be a huge loss! You have to run a business. He agreed to the price. She’s very presumptuous to think she has a voice in your business dealings. If she is going to go to these lengths now, I’d say you dodged a bullet in the long run…", "NTA", "NTA. If she thought you should offer to do the whole thing for free, she should have said that in the first place. Does she understand how design work usually progresses from draft logo -> client review and approval -> full branding? \n\nLike I guess I'm trying to understand, is this a lack of understanding/bad assumptions on her part, or was she trying to run a bait and switch on you and is pissed that you broke her plans by working quickly and communicating with her brother directly.", "NTA She asked for a free draft which she got, she didn’t ask for free intellectual property. Nobody is entitled to your work for free or even a discount.", "NTA.  Your girlfriend however...", "NTA If you and bro are happy, why is she getting involved with what is clearly *not her business*? She sounds like the type who will end up volunteering you for stuff without your consent so she can reap the kindhearted credits.", "Nta people got to pay for services even if you know them", "Its your livliehood... why should you do it for free? Plus, with her severe reaction, you dodged a bullet my man. Set her free to torment some other dude.", "Your not an AH but a lot of people will do work for close relatives for free, I've done plenty of electrical work for my wife's parents and siblings for no more than a cup of tea while I'm working and a pint when I'm finished its good to keep them onside.", "NTA. You should be happy your girlfriend left. I would invite her to stay gone.", "NTA and not it's time to find a new girlfriend because she clearly believes that she owns you, your time, and your business. Even a spouse does not have those rights. She is telling you that it's over. Believe her.", "NTA\n\n&#x200B;\n\nDon't do it - That would mean YOUR business making less money so HERs could make MORE.", "Sleeping at her friend’s house? If she blows up over something that small, she’s the ass. A free draft is fine. He agreed to pay and you provided the product. What does she have to do with that transaction?", "NTA\n\nAnd frankly if that's how she behaves I'd let her friend keep her. \n\nDoes she work for free?", "NTA\n\nI have a few skill sets - artist/illustrator, writer of various things, designer, and...\n\nAlways dealing with people who value my skills enough to want my work, not enough to pay me.\n\nIt's your profession, people should pay you for time and effort.", "NTA. You can't live in a house made of favors.", "OP should ask his sister for free work from the boyfriend's business and see what she says. /s", "Yeah when working for relatives or friends giving them a discount or free estimate is sensible,  but never working for free.", "Yes he did, we were In communication throughout the whole process", "Thanks for the comments, actually he knew what he had to pay, we discussed it and he was in communication throughout.", "OP, is it your wife or girlfriend? You refer to her as both, but blocking you doesn’t sound at all like spouse behavior. Either way, NTA. I’m a graphic designer, and I’ve done logos for my brother in law and charged for them. He got a discount, but I still charged.", "Is the wife in this story the same person who dumped you after a car accident in your previous post? \nNTA either way. But just curious.... if it is the same person I think you need to recognise a pattern in behaviour here. \nKnow your worth. You can do better. \nI repeat NTA 100%", "Yes, this is correct.\n\nThere is a old word going around:\n\nTo never ever mix business and money with family and relatives. To outcoming is never good but often bad.", "[removed]", "your wife sounds childish to say the least", "You choosing to do the labour for free is understandable. People expecting it to be free is absolutely WRONG. Just because it happens doesn't make it right. The people doing the labour have bills to pay too and if they're going to spend time, labour and their own investment into the work it's their prerogative whether they want to donate the same or if they value it enough to charge. Bullying, threatening, playing mind games and all the other cheap tricks many play on people expecting said payment does not 'unwrong' it.", "He already did the initial consultation for free so it’s irrelevant here.", "Then definitely NTA\n\nHe could have simply said that was more than he was expecting and not continued, so that is 100% on him\n\n*Maybe* he mentioned to his sister it was more than he was expecting, but since he was still happy to pay, the issue is with the GF, not you", ">I don't get this \"mate's rates\" mentality some people have.\n\nI've found that when I've offered my friends cheaper rates they have never respected my professionalism and, as a result, a number took ages to pay me.\n\nI now never offer cheaper rates. I'll either do something for free (and say that it's free) or charge normally for it.", ">  If I'm taking time away from them that they could use for paid work, I'm being a shitty friend.\n\nI've found that side jobs, especially ones that pay less than your main job, are the absolute worst about \"mates rates\" because a side job \"isn't taking away from your 'real' job.\" I work on cars a lot in my spare time, and make some money fixing vehicles (to pay for my project cars). I make 60+ an hour at my main job, I usually charge 20-40/hr (I'm up front about it, it depends on the level of ass pain and if I'm going to them/they come to me). But that's not my day job, the pay rate is lower than my day job and people see me working on (my own) cars for \"free\" and figure that I should work on theirs for free too.", "Mates Rates can apply if you are trying to do a favour or just wanna be nice to someone that is struggling.\n\nBut it shouldn't really be standard.\n\nUnless you have some sort of deal.\n\nLike, wasn't really mates rates, but growing up i got 20% discount on every shop in the high street of my city, cause my dad owned a shop on that high street.\n\nPretty much all the owners joined the scheme and it got extended to employees of all the businesses as well iirc.\n\n\nApparantely worked well as selling more stuff at a discount is better than not selling stuff at all.", "Why am I seeing comments saying the BIL is a freeloader/bludger when the OP says BIL happily agreed to pay and it’s the girlfriend who is complaining? Has the OP been edited?", "[removed]", "Totally! And if someone is trying to make a creative passion into a lucrative source of income, even if they have no intention of leaving their primary employment, that's the thing I want to support.\n\nIf my friend works for a design agency and I go to that agency because I know my friend works there, I have to pay full rate, and that money doesn't just go to my friend but also the profits of their employer. And I don't get to argue. If my friend is an accountant but has a side business doing design because they enjoy it and want to earn a bit of money doing it, it would be a dick move of me to eat up their personal time expecting them to do free labour for me.\n\nIt's not a way I'd expect a friend to behave and I really don't understand anyone who gets angry at their friends for not giving them a discount they randomly feel entitled to.", "Yeah I know a lot of community schemes like that which encourage people to support local businesses.\n\nWhen I say \"mate's rates\" I mean it more in the sense that an individual expects discounts from someone running a small business or service just because they're friends. It's entitled to assume you're going to get a discount, or to pay for parts but not labour, unless it's explicitly stated that that's the situation for someone who is struggling, for instance.\n\nIf someone chooses to offer discounted rates to certain people, that's entirely their business. But assuming you're going to get a discount without a conversation first is tacky, imo.", "I just paid $1000 for a logo in Canada. It was more expensive than I realized, but my partner had worked previously with the designer and ity first foray into commissioning design work. I love my logo! And it’s the face of my business. Perhaps show your girlfriend and her relative what the going rate is for this type of work.", "JFC that's cheap. I'm a small business owner and I'd be stoked at getting that sort of deal (and a little worried that my sister's bf was ripping himself off).", "As the other guy said, when you said \"I told him that this would cost him, and he happily agreed\" did you make it clear the ballpark of *how much* this would cost him? \n\nI ask, because I've gotten fucked over on part and especially labor rates before (part time mechanic) from friends because they don't realize how fast time can add up, even at a discounted rate. Going forward I've been very sure to give them a ballpark that is above the bare minimum expected, and then they can be surprised if it's less, not pissed off that it's more.", ">I finished in two days and sent him the receipt. A few hours later, my girlfriend calls me and tells me that I am the asshole for charging him\n\nLike I said I was guessing, but the way my fanily communicates if they have a question for my spouse is through me. My first thought when reading this was BIL saw the bill and called his sister to complain about charging so much (which honestly it isnt much but he was probably expecting cheaper) then she's all 'why is he even charging you?' \n\nIf BIL didnt have an issue GF probably wouldnt have found out so fast\n\nBut this is just what I assumed based off people.", "My point being is if you happen to have a group of amtes that all give each other a discount it makes sense.\n\nBut like, if you are the only one capable of giving mates rates then nah mate.\n\nLike if a doctor, Nurse, Police retail worker or whatever wants mates rates then no fuck off.\n\nBut if a plumber wants mates rates but also gives mates rates then grand.\n\nI think thats where it comes from, from further back in time when self employed people capable of giving a discount were more common.", "It’s very typical for freelancers to charge $2,000+ for a logo/brand identity system. Like Op said, agencies charge way more. One agency in my area charges around $40,000 for that same service. OP’s brother in law got a deal, but I agree price should have been discussed before completing the project.", "Really though, all we know is he was sent the bill, and later the GF was mad at OP.\n\nThere's no indication that the brother had any issue with the bill. This could be him just telling his sister, and she took it on herself to go off at OP.", "That's not that much for a custom design logo", "That could just as easily be the GF taking it on herself to tell at OP. There's no evidence he was unhappy with the price.", "That's not the case here though and very rarely is. Lots of people don't have jobs where they're allowed to offer that at all. \n\nThis situation, and most like it, is when one person is making another person feel like they are in wrong for charging for their expertise and labour, despite the person providing a service that they have every right to charge for so that they can pay their own bills at the end of the day. The person expecting the discount isn't offering anything in return apart from an existing relationship.", "She's your wife and she's blocking you over this?\n\nYikes", ">That's not the case here though and very rarely is.\n\nThats my point, i was just outlining where its ok to describe why this isn't OK.\n\nBut it can be boiled down to Mates Rates is something to be given, not asked for.", ">She asked me if I could do a free draft as a favor.\n\n>I agreed\n\nWell, you didn't mention the actual cost to your wife/gf. It's quite possible that what you called \"free draft\" was assumed to be \"free\" on her side. YTA for that\n\nStill, her blocking n leaving you is an overreaction especially if she is longtime gf or wife. Are you sure that's the reason?", "NTA - I get so frustrated when family members automatically assume that they should get free stuff or family discounts from their loved ones businesses. Why wouldn’t you want to support your loved ones fully? You’re worth your time and skill - your girlfriend is the AH. You and the brother are not.", "Well, you certainly don't need to do work for free for your ex's brother, so while you were nta before, now you're doubly nta\n\nEdit. I assumed gf, because she was so childish, not gonna bother changing it, but geez she's immature.", "NTA no one should be offering your work to others for free except you.  She is being obnoxious about this and good riddance if she stays away.", "NTA.  This is your livelihood.  This is your craft.  You agreed to a free draft & he agreed to pay for the finished product.  End of story.  Clearly her bro respects that your a business man & your GF has no respect for your job.  Just bc she's your GF, that does not entitle her bro to a freebie.", "NTA. You did the free draft. He liked the work and asked you to proceed at a mutually satisfactory rate. GF should take a step back. \n\nIt's also pretty extreme that she is staying with a friend rather than return home. Is this how you want live your life? Filled with drama? Filled with \"*but family*\" excuses? Asking you to work for free? This is your livelihood, not a hobby.", "NTA \n\nI made that mistake asking my best mate if his photographer gf could cover our wedding for free. He called me out, we had a chat, and agreed on a rate. You’re def in the right here", "NTA.\n\nYour GF is entitled -- entitled to your labor on a whim.   Her brother was fine with the cost.", "NTA.  You made it very clear.  Your GF is crazy, and you need to get your stuff and leave.", "Your wife seems pretty cheap and doesn't value your time.  As a freelancer time is money and you took 3 days out of your work to do a solid for this guy and your wife is mad?  Holy cow... NTAH.", "Isn’t this your living? You did a free draft. NTA.", "NTA but let this be a valuable lesson. Never go into business with family or friends unless you are prepared for situations like this.", "NTA a o one should work for free. That’s not how it works. Otherwise it’s charity.", "I mean, she's your ex girlfriend now, but you are NTA. This is why you do not mix business with personal.", "Your girlfriend has a sense of entitlement. The brother happily agreed. Girlfriend needs to stay out of it. And if she's being this pettyand childish about it, do you REALLY want to continue a relationship?", "NTA 100%", "NTA.  Doing any free work was more than generous.  And he agreed to pay with no complaint.", "NTA - The free draft was okay, but you deserved to be paid for the final product. Also, he literally AGREED to pay. You did nothing wrong here", "NTA   she may as well of asked you to take your wallet so she can stick her hand in and pull out some money, it's a polite robbery in disguise of a favour. I'd second think your relationship though, this is a major red flag if she is this pissed over something that is none of her business. Like really? She is sleeping in a friend's house now?  xD she is a literally child not getting her own way. I'd dump her if I was you dude.", "NTA She has no right to demand you offer her brother FREE services.  This is your lively hood.  Dump her", "NTA. That’s your livelihood. You did the free draft, which was more than sufficient. Nepotism only goes so far. Doesn’t mean you give away the farm. Plus, this woman isn’t even your spouse according to the post content (the headline is a misnomer though).", "NTA.  If you stay with this woman, she will be expecting freebies for her family, friends, casual acquaintances, etc., etc.  Not to mention she is throwing a temper tantrum trying to get her way.", "She is acting really childish in this response. Assuming this is all that happened just refusing to talk and leaving the house.\n\nEven if she wanted you to do it for free her wording was wierd saying a free draft. Not a free logo\n\nNTA\n\nEdit: forgot to say the verdict.", "NTA. Freelance graphic designer here. The only time I do anything for free is if I offer to. That being said, I would *never* do a logo/branding for free. That is literally someone's business identity, and shouldn't be done for free IMO.", "You are not wrong and your girlfriend is totally mental.  I think you should see this as an opportunity to date a better person. NTA", "NTA but I find it odd you can't decide whether you have a wife or a girlfriend.", "She asked for a free logo... He asked for additional brand identity for this business. There is a lot that goes into it. Yes, it's nice to help family with skills you have but that doesn't mean it has to all be free.\n\n&#x200B;\n\nNTA.", "NTA\n\nThis is your job. You agreed to terms. You completely the job and executed the terms", "This is why I tell artist friends to not do work for family. They always have shit expectations and don't respect your time", "She has nothing to do with this.\n\nNTA", "NTA and your girlfriend is acting like a child. You are a professional and deserve to be paid for your labor. Her brother understands that, even if she doesn't. But the immaturity of her response is alarming.", "NTA, but wife or girlfriend?", "NTA. Freeloaders are assholes.", "NTA - Sounds like she was looking for a way out anyway. Now she’s using this to blame you.", "NTA- your girlfriend seems incredibly disrespectful and immature. You were considerate enough to do a free draft for him and he happily paid for the full thing. \n\nYour girlfriend blocking you and sleeping elsewhere is quite ridiculous. Perhaps speak to the brother and see if he can explain to her considering he was happy to pay the cost? If not, maybe give her a few days and then try to have a sit down chat with her about it. \n\nIf shes still rude and angry about it, then I’d be giving up on her, but that’s just me. Blocking over a minor issue is incredibly immature behaviour for adults.", "NTA. There was no agreement for a free, final product, and wife/girlfriend can't make that arrangement on her brother's behalf. He was getting the services. He should have said no if he didn't want to pay. Isn't he an adult?\n\nAnd why is girlfriend having such a severe reaction to this business transaction? It sounds extreme and irrationally punitive for something that her brother should complain about if he wants to. Is gf picking fights?\n\nWhy do you say wife and then girlfriend?", "NTA\n\nThe only free labor you should give is labor you don't normally get paid for. That means you may help friends and family move, or watch their kids, or help them renovate, as long as you're not a professional mover, babysitter or renovator.", "nta, she doesn't have a say in what happens at your work and her brother said yes when you said he would have to pay, he didn't offer it or smth, also why should you not charge him? did she say why?", "NTA\n\nHowever, it sounds like the GF has the problem, not her brother. What a brat. Tell her to get over it or kick rocks.", "NTA You agreed to a free draft, not the entire project to be free. She's being unreasonable.", "Sounds like you need to Run. There is probably something else going on. She may be cheating or is interested in another guy. Girls are good at mental gymnastics to make it your fault, and they are completely justified in their actions. \n\nBe polite and just separate from this woman. Don't look into whatever it is for your own sanity. Trust me, you will not feel better after knowing the truth. \nBest off luck", "Her brother knew the cost, we discussed it and he was also in communication the whole time. The draft was free and I didn't charge for it. I charged only the time I spent finishing and creating the rest of the collateral.", "Is it wife or girlfriend?\n\nEither way NTA. Did u give a discount?\n\nEven if u didn’t u r good just curious", "NTA,  \nA good friend, family neither asks nor expects a discount for your work.  If you offer it that is on your own volition but I know personally(I do photography on the side) the minute someone asks for a discount because \"They're a friend\" I immediately withdraw the offer to do anything for them as I usually take that as a flag that they're going to be difficult as fuck and likely strain/destroy the relationship through the request.", "Is she a gf or wife. If she's a gf, I think you just dodged a bullet. If she's your wife, you guys have a lot of work ahead of yourselves.", "Mates rates and favours don't pay the bills.", "I'm wondering if your wife misled her brother and said everything would be free, then brother agreed to pay to avoid confrontation with you, then maybe brother told your wife something untrue to make it sound like you \"cheated\" the brother. Wife's response is extremely strange. I would look into exactly what was said between her and brother to see if you were painted in an untrue light. \n\nEven so, she should have checked into your version of events.", "You only cross a boundary if someone put one there. Apparently gf put a boundary against you charging family. I wonder what she would have said if you charged your sibling for work? Would she hound you and move out?\n\nYou did exactly what she asked and provided a free draft. The agreement with BIL was between you and him, not the three of you. Btw, for all you know BIL was telling gf how happy he was with the great word and fantastic rate. You don't know that he went whining to gf. I suspect she took offence that you charged at all. That is not fair given that this is how you support yourself. This is your business, not a hobby. You are an artist and deserve to be fairly paid. You gave a nice discount to BIL.", "I have my own business and family/friends get charged for everything.", "Wait so is she your wife or your girlfriend? I'm very confused", "If this is how she normally reacts to relatively small problems that don’t even involve her, then yeah this is good for you. Running away from her problems and ignoring them is not a good way to solve problems.", "NTA OP but maybe you should edit your post with this information because a lot of commenters think that you just surprised your BIL with the fee.\n\nI repair computers/laptops, crochet afghans and do some woodworking (tv stands, tables and other items like these) and I stopped doing these things for family/friends because they expected me to just give them my time, service and eat the cost of supplies for free or at rock bottom prices.", "Totally agree!  My cousin is a tattoo artist and she did a large back piece for me - she was all for giving me a family discount and I said no, I'm taking up two days of your time, I'm paying you what you'd be able to make in that time otherwise.  \"Mates rates\" is basically asking people to give you money for no reason.", "He *did* give him a family discount. The first draft was free! And if bil didn't do any research on how much a logo would cost and then complained, he's absolutely the asshole here, as is wife for thinking he should do the whole thing for free or something ridiculous like $100.", "No she is now, I met this woman only a few months ago and we both fell in love. She is an amazing person and this is why I was surprised by her behavior this time around. \nShe is caring and loving but blocking me for her brother is what I'm unable to understand.", "I'm pretty baffled by the number of stories on AITA that end with blocking and/or \"and my partner/spouse went to sleep at their friend's/sibling's/parent's house\".  In 23 years I've never had a falling out with my partner that resulted in either of us being so angry we couldn't sleep in the same bed, let alone not even be able to stay in the same house.  I couldn't even contemplate blocking him anywhere.", "See I have a number of marketable skills people call on me for. If I know they can't afford my normal rates, I try to arrange an equal trade off. I have kids, I have home improvement projects in 2 houses that I need help with, I need pet sitting occasionally. I just compare what I'd spend paying someone for what I need to what it would cost said person to hire me and offer a trade of time/labor/expertise instead. Works out pretty well because when I trade a favor for a favor I set the other person up for success and a smooth day.", "I have a tattoo artist friend who is the same with me! I've been going to her since she was an apprentice and I have to argue with her to get her to charge me a full rate instead of the apprentice rate I paid for my first tattoo even though she runs her own studio now. Bless her, she's an angel but I know how much effort running a studio is for her when she's trying to make the situation as fair as possible for the artists she works with. I want her to flourish so much and that's not going to happen if I don't pay her what she's worth.", "this is why we don’t marry people after only a few months of knowing them. you really don’t know your wife at all.", "Yes I know it's cheap and I am planning on optimizing my pricing soon. But you are right she should have been thankful and instead this.", "No, $650 sounds VERY reasonable for a professional, original logo.", "he could also have told her he likes his new logo and he was surprised it didn't cost as much as he thought and then she blew off bc she thought he wouldn't have to pay", "I don't know why you were downvoted because as a woman, I know a lot of women who do this.  One was my Ex-DIL who would do things like this when she got mad.  Sit outside in the car, in the winter, with the kids or go stay at her mother's house until my son begged and apologized enough to her satisfaction.", "I told him that this would cost him, and he happily agreed.\n\nSounds like a discussion to me.\n\nNTA.", "I get that based on what I've read here but before that I had literally no idea. If this guy had the same level of awareness as I do, that might explain the issue a bit.", "He is saying the small 2 hour window is possible evidence, and yet they're only speculating.", "I dunno either tbh I’ve seen it done so many times I won’t go anywhere I normally go away to cool off, or I’m in the right and I’ll allow u to apologise when I’m ready.\n\nIt’s not so much the not talking that isn’t right if u r upset, I know some ppl who it to make u sweat. \n\nI just think if you are married u can’t just up and leave not for small-medium arguments anyway.\n\nI dunno how old they are but from 28 onwards u have to stop behaving like that \n\nI think it damages the relationship in the long run it’s not like you have to argue to resolve and if u can’t drop it get back to it after\n\nEdit: even my gen z kids r more emotionally mature than that\n\nEdit: unless of course it’s a domestic violence emotional abuse thing", "That's not evidence, then", "Right? That's super concerning", "You give someone an inch, when they expect a mile. This is why I never do business with friends or family. They will judge you and act like they are doing you a favor.\n\nNTA", "NTA, but your wife is. She blocked you & staying at a friend's? That is nit how you act when married & you don't get your way. \n\nEdit: spelling", "NTA- but I would let brother know it's on the house and tell wife that moving forward you will not be doing anyone any \"favors\". This is something that could cause a huge rift in your family life that is not worth it. In order to prevent it happening again I just wouldn't even work with any family period even if they agree to pay because then it opens the door to this bs.", "NTA. I don’t know why people expect free stuff from their friends and family’s businesses. If you have a friend, use their business and not others to support them, but don’t expect free stuff. They might, but don’t have to, give you a friends and family discount.", "[removed]", "NTA\n\nWhich one is it? Wife or girlfriend?\n\nThe terms were discussed between you and the client. She has no say on the matter.\n\nAnd in no way is this an offense warranting leaving the home for. Either there is something more going on, or your relationship is not well.", "Friends and family should insist on paying full price to support an independent contractor.", "NTA. Family doesn’t mean everything is for free. The draft was free and BIL agreed to pay. Very immature of the wife to block you for this. People forget you need to make some money out of your work/business.", "Is your girlfriend a child? WTH? She needs to be single for awhile to figure her s#!!t out. And good riddance.", "NTA. This is your job, of course you're going to charge. You can give a discount if you want, but to expect free work is ridiculous (but unfortunately not uncommon). Too many people don't respect arts and media the way they should tbh. Sounds like your wife is one of those people", "NTA- my boyfriend freelances as well. He does work for his own sister and BIL and my mom has sent him referrals as well. Every single one of them pay him his full rate. Because they are business people too and realize they are paying for a service.", "So I have a bunch of artist friends. You know what I do when I want art from them? I pay their full commission rates, that's what.\n\nNTA", "Former wedding photographer here. I totally get it...people think you should work for free especially when it makes them look good! I've had people expect $1500 wedding packages for free because \"but, we're family!\" Yeah and if it took me a few minutes I'd absolutely snap some pics for you, but were talking working a whole 8 hour wedding then editing several hours every night for a week! Ridiculous! They way I see it you said you would do the draft free and you did! Then BIL decided to order products and THAT is where the cost comes in. \n\nIf she had expected you to make anything he wanted for free she should have specified that so you could turn her down flat! I think she figured there would be time to talk to you about not charging him at all and things moved faster than she expected. You are NTA and her childish behavior blocking you tells you that she's just mad her \"get you to do free work to make her look good to BIL\" ploy didn't work!", "NTA I can absolutely understand why she would think you wouldn’t charge her brother. The problem here is you were upfront, and he agreed to pay. Getting mad after the fact is ridiculous.", "NTA this is not a hobby it's your profession. as a gift you gave him the rough out and explain for you to take it further would have a cost and he understood.\n\nI wonder if your g/f (ex?) had promised it would be free and she thinks she looks bad now.", "NTA. Next time it’s her uncle, friend, old time friends husband,,, you do this for a living. Not for free.", "NTA. One of my friends is a photographer, and I booked her to do a photoshoot before I moved away. Did I pay her for her services? ABSOLUTELY! That's her job, it's how she makes her living. It doesn't matter if the person is family, a friend, or a stranger, if you hire someone for their services, you pay them. You did the draft for free, as she requested, but anything after that requires payment.", "NTA!! You agreed to do the draft for free, but the actual work is paid. You always deserve to get paid for your work. Now is this a GF or Wife? You have said both", "Agreed. When I commissioned my stepsister for a painting, I fully expected to pay her. And I did. She gave me a discount because we're family, but she still put time, effort, and supplies into making me a gorgeous painting and she deserves to be paid for that. Family shouldn't automatically mean you can take advantage of them", "She’s not even OP’s wife though, just his girlfriend.  The entitlement she’s showing is kinda insane", " He called me out, we had a chat, and agreed on a rate. You’re def in the right here", "Claims she's a wife but called her girlfriend twice.  Not convincing.", "Eh, families provide free services/labor to each other all the time. Especially domestic labor (cooking, childcare, etc.).\n\nMaybe that's where her head is.", "Close friends and family can/maybe should get a close friends and family price. That's it. Asking for any more than that is rude IMO. They should also want to pay you for your time and effort because they are your close friend/family as well and want to support you. Of course there may be other dynamics, like if you were a millionaire and he was struggling or something, then maybe don't charge him?", "Your wife needs to stay out of it. You had an agreement with her brother, not her. If he later decided it cost too much and complained to your wife, she should have directed him to you, and to leave her out of it. This is why doing business with family is more trouble than it's worth.  Let her stay at her friends. It's a manipulation tactic to get her way. If you really want to clap back on this, you can tell her you consider her actions as abandonment of the marriage, and see what she does from there. If she values you and your marriage she will come home and act like an adult. If she puts up more of a fuss, you know you are lower in her priorities than her brother.", "Twice?", "Unless it’s in one of OP’s comments, I don’t see anywhere it says the brother is unhappy with there being a charge for the final product. My guess is the gf found out the final product wasn’t free and she’s the one having the hissy fit about it.", "This is my concern, why would she leave over a job you did?  Does she always throw temper tantrums if things don't go exactly how she thinks they should?  If this is normal behavior for her, you may want to take the opportunity to get away before you have kids with her.  I hate suggesting divorce, but she sure did create some major drama over nothing.  I would leave her be.  NTA", "I'm suddenly very grateful for my friends.  I recently started a small business and every single friend who's bought from me has paid me full price, even though I've given them a discount.  I offered one friend who has done some pretty awesome advertising for me a free item and she refused to take it for free, refused to take a discount and ordered 5 more items, refusing the discount on all of them.", "NTA, you that’s almost free for the amount of work you did.", "I cant get a tech into my building without a $500 charge.  I would guess the cost much much more in my corporate environment. Like $10,000 for something like that...", "I agree with you. Also, to be fair, the brother should have asked how much first.", "Even after their friends realized it, they didn't throw a tantrum.", "But many people probably don't know that.", "Don't worry it's the femcels downvoting everything they see", "She is way too immature to be a wife.", "Do you know what speculating means? We are missing information. For the sake of the discourse some of us are making assumptions and running with that. All of this contributes to the overall discussion. Thus unraveling a little more truth.", "Better yet, I'll ask you a simple question. How do you think the information got to his girlfriend? \n\nThis is all moot anyway. Op mentions brother agreed to price to begin with. Wich would make you ultimately correct I believe.", "NTA- $650? Honey, that *was* the family discount.", "YTA. Mega super big time. Why couldn’t you do it for free?", "ESH.\n\nShe overreacted, even though you and her brother had an agreement. Who knows what she told her brother regarding your assistance. This isn't cool.\n\nWhat I do find odd, unless you didn't specify this in the post, is - did you send him a quote for the work? From the post, it seems completed the work, and then told him the amount. Which, to me, isn't the right way to go about it... I've never worked with a contractor that doesn't give an estimate up front. \n\nAlso, you did agree to \"design the Logo for her brother's new business\" - which if she isn't well rehearsed in your job's day-to-day, to her that meant do the whole thing (including taking it from draft to ready).. not just offer a 'draft'. So this is why I think you're also TA, if you charged him for this part.\n\nThe 'brand identity' stuff seems like a side-proposal, which should have been estimated, agreed upon, completed, and then paid for. This shouldn't have been a surprise, and you didn't make any promises saying that it would be free.\n\nIn the end, I wouldn't have charged a family member (or potential to-be).. but to each their own. If your GF temporarily moved out because of this, oh boy.. you have a lot to deal with. Best of luck.", "Your GF \"blocked you.\" WTF. Is your GF over the age of 19?\n\nNTA.", "Guarantee bil went running to sis. NTA", "NTA - your gf is the asshole, dump her..", "What with these posts of SOs being so quick with the block button?", "NTA. You should not be using “friends” to get discounts. That is their livelihood and they should be paid. She is *only* a gf. Plus you worked a business deal with your client which was not her.", "NTA\n\nYou are a professional, this is your livelihood and you deserve to be paid for your work. You already went out and did a free draft as a favor, it doesn't obligate you to do a whole project for free. Your wife's brother apparently agreed with your POV, probably because he understands owning an independent business and how quickly supposed friends and family will come around asking for free services. \n\nYour wife is being unreasonable and her overreaction is intense, even if she had been in the right about accepting money. Has she had a pattern of being disrespectful of your skills and time in regards to your design business?", "Feels like there's something missing here.  Does your girlfriend not understand what a draft is?  Did she tell her brother it would be gratis?  It seems like there's been some misunderstanding.\n\nOh, woopsie, WIFE.  Well, I'm going to admit that I probably wouldn't charge family in the same way I would charge a client.  Doesn't mean you're the asshole, but maybe you could've been more clear with your wife.", "WAIT!! Is she your WIFE or GF?  The title to your post said wife. \nNTA. You should be paid for services rendered. You could discount if you want,  but time IS money.", "NTA. I’m a freelance graphic designer and my husband is a musician. Our real friends understand these are our livelihoods, and would NEVER expect  our work for free. Unfortunately, this is often the exception and not the rule \n\nMany people think music or art are just hobbies and anyone can do it. You’re not paying me because I’m so naturally talented (which would be fine if that were the case!!!). Clients pay me because I have spent years in school learning, for my 25+ years of professional experience, for my knowledge of history, technique and best practices, to access the tools of my trade (sketching, design software, Pantone books, etc.), and you’re paying for my creative thinking time as well as my actual labor creating/designing your work, testing it, and packaging up the deliverables. \n\nI offer a friends and family rate, and I work out pricing ahead of schedule IN WRITING. I should take deposits because I certainly have been burned before. And I do no work on spec or trade. I’ve learned those lessons the hard way too. Oh, and if anyone ever tells me that it’ll be great exposure for my work, that’s crap. I’ve gotten a lot of referrals from PAID clients. I’ve literally never gotten work from an “exposure” gig. No getting paid after they make money either…that’s called an investment where you should be guaranteed a certain amount of interest or percentage back based on the value of your initial investment. Not, I’ll pay you if this logo makes me any money. Cuz it won’t, a logo isn’t going to make you money directly.\n\nYour GF sounds unreasonable. Presumably, you are creating a logo for her brother’s business where he will make money. Presumably he wants a professionally designed logo to look more out together, and to help him pitch/land clients. Why does he get to make money on your back and labor, while you get to give him your work for free? If she wanted to gift him a logo, she could have paid you for your time and given him a gift. That she’s upset after you already worked out a deal with her brother is suspicious. And, what is with the silent treatment?! Grown-ups use our words and if we need space, we say that and take it. Then, we come back and discuss the issue calmly, when we’re in a place to both speak AND listen. \n\nBut, you’re partially to blame here as well—you need to better scope out the project, e.g. what exactly is a draft (a sketch? How may concepts? How many sketches?). Basically, state what you’ll be doing and what the actual deliverable(s) are and of course your pricing. Really, most of project management is managing peoples’ expectations. You could have walked ur gf thru the process so she understood a draft is not a final logo and that the final deliverable would cost money. Still, I think she’s acting entitled since she neither bothered to work out the details with you in advance, and based on how she’s reacting to the whole situation now\n\nTough spot to be in! I’ve been there and it’s no fun!! Good luck!!!", "That’s an incredible deal. And you were FAST! I wouldn’t touch it for less than $2,500", "NTA.  Apparently your GF does not respect your abilities or profession and does not comprehend that this is your JOB.  It's how you make money.  GF is TAH.  NOT you.", "NTA. The \"brother-in-law discount\" exists, but it's never a 100% discount, and he's not even your real brother-in-law.\n\nBesides, it's important protection for both you and the brother that he pay you for this service, so that you have a documented business contract with him. If it turns out that your design inadvertently infringed on another company's, having done work that was not under a formal business relationship might have complicated making a claim with your errors and omissions insurance policy.", "NTA dont try to butter her uo or apologize you did nothing wrong. \n\nShe probably offered it for me thinking nothing of your effort nd skills and now shes embarassed because you asked payment. Red flag. She would cntinue to not look at your time and skills as something worth money and ask for free stuff if you let her win this one.", "NTA. People should pay their friends MORE than asking, not less. I always tip super well but especially with my friends.", "NTA\n\nYou were clear and upfront about the costs, and he agreed.\n\nYou need to find out if she's mad because her brother is mad, or if she's mad herself.\n\nI'm going to guess she's mad herself. Like, she bragged up and down that she has this great connection in a boyfriend who can do all this stuff, and he's willing to do favors just because he loves her type deal. Sort of like how many women will volunteer their husbands for handyman tasks or to help people move: it grants a woman prestige to have a man willing to do stuff that costs him.\n\nWhich you popped by treating it like a real business exchange. That could be super embarrassing to her, which she's hiding as anger.\n\nIf her brother is fine with it and also thinking she's crazy, understand that if you get back with her, you'll need some careful boundaries, many delicate conversations, and to slowly retrain some of her behaviors. Her freaking out is not cool, nor is volunteering you for free labor.\n\nIf her brother IS the one complaining behind your back, I would end the relationship. You don't need someone who tells you one thing and spreads another to everyone, and her behaving the same way means she is similarly unreasonable. You marry a whole family, not just a member, and two people in the same family acting the same way means that's just how they are, and you're in for a world of hurt and drama if you stay.", "Wife or GF? That's kind of a huge distinction to not be clear on for context. \n\nThat said, NTA, but next time get a contract, even if it's from family/friends as they are the most likely to screw you over on not paying or trying to get free stuff.", "You did a free draft. He liked it enough to want a full completion which includes a contract and money. Her brother being a professional agreed to it. Enough said. Definitely NTA. This is your job and he knows it which is why he didn't object to the agreement.", "You can't go to their job and just take whatever you want for free. It shouldn't be expected of you.\nYou are self employed, not a volunteer service.\n\nNTA", "NTA this is your job most friends and family are happy to pay because they know that this pays your bills. if they think it should be free then they have an issue. and it seems like bil is happy to pay and respects your job. your girlfriend however is a different story.", "Freelance doesn't mean free, family or not...  That's called taking advantage..  NTA", "Nta. Not at all. Your gf is being unreasonable. If she was a landlord or a car saleman, got your family member a house/car, is she going to charge them? Of course she would. It was even discussed beforehand. I would possibly given a family/friends discount if i liked the person. But this is business. And your gf sounds very entitled. Not even just for herself but family as well.", "Fake.  He didn’t keep his story straight between the title(wife) and story(girlfriend)", "NTA.\n\nI see from your comments that she is, in fact, your wife and not your GF. Not sure how you made that mistake, but either way you are not the AH. Making the argument she did and even being angry, that's already AH territory.\n\nBut *blocking* you? Seriously? She literally *blocked* her own husband over a fight, that too one where she was 100% in the wrong?\n\nA divorce is not as easy as a break-up, but looks like you need to look into it.", "NTA. You may choose to have a friends and family rate but this is your profession so you should be paid for your effort.", "NTA at all. Sounds like she has other issues she needs to deal with and this sounds like a relationship you don't want to be in. To block you and just leave is childish unless she has the intentions of breaking up with you. If you stated up front that it would cost and he agreed you are most definitely NOT in the wrong. If it was never stated than I could see where she may be blinded sided by a bill, but if this is your work and you could have been helping someone else and get paid for it, they have no right to be angry. I understand it is family, but business is business as well.", "NTA, she is your girlfriend or wife? Red flag either way. She is being completely unreasonable.", "What happened to the rule that you don't abuse friendships for money? If you must use a friend for business, you pay them more than their asking price because you want them to be successful!", "This is why you ALWAYS have a contract, friends/family be damned. Just from having friends that are wedding photographers, the number of them who have been screwed by family/friends after offering a discounted service for wedding photos, it's crazy to me that people don't do contracts for paid work just assuming everything will be fine.", "On another post from 20 days ago he said he didn't even have a girlfriend yet so this is all probably bullshit 🤷🏻‍♀️", "I mean yes and I agree with you, I'm just responding to \"people don't do [that] in the real world\"", "Wait, you MET her a *few months* ago??... And she's your wife now?\n\nIDK why but I read your post as she was your GF... Wait, I circled back.. Title says wife, post says gf.", "When I give a big discount like that, I make site the client knows. I even put it in their final invoice, like full price crossed out and discounted total so they see just how much they are saving", "Probably why people should take 30 seconds, a deep breath, research costs and compare before getting mad at someone.", ">I think it damages the relationship in the long run it’s not like you have to argue to resolve and if u can’t drop it get back to it after\n\nThis is what ended up happening to my son and his now Ex; it destroyed their marriage (they were in their early 20's).  She was just this type of woman, which, even I had the displeasure of experiencing.  Like for example, we knew they were having financial problems, so my Mom and I went out and brought the kids (3 theirs, 1 hers) 5 school uniforms each.  She for some reason took issue with this and threw the uniforms in the trash.  My Mom saw her do it and cussed her out, telling her to NEVER throw her money away.  If she didn't want the uniforms, give them back to us and we'll get our money back.  Well, she called herself mad at us and didn't speak to us while expecting us to apologize to her for helping them out.  My Mom and I didn't apologize for trying to help when we know they really couldn't afford uniforms for 4 kids.   \nWe weren't asking them to pay us back and they were living with us rent free as they were saving to buy a house.  Oh yeah, when my son found out, the kids ended up wearing the uniforms.", "I think in this case it was an age to thing on top of that 4 children to manage, financial stress and everyone living together she must have been overwhelmed. I dunno what the uniform thing was about pride? Guilt? Maybe she wanted to do the shopping for it herself? I wouldn’t, but some ppl do. Either way it was a communication problem if you don’t tell people how their actions affected you how can they rectify it or take accountability for it? \n\nI think she was going to her friends/family to get some space it was a case of cabin fever. I know you tried to make her feel at home but she probably couldn’t relax or just be upset as she felt like a guest. This is just a guess tbf I’m just saying when I was 20 I didn’t have great emotional intelligence either. I dunno if this resonates it’s purely speculation on my part but if it does maybe you can give her some grace for the past.", "NTA: literally all I'm reading is that your girlfriend deosnt know how money and business work 🤣 if someone pays you to do something but they ask for something extra, then of course you charge them.", ">AITA for charging my wife's brother ?\n\n>A few days ago, my girlfriend asked me \n\nYTA for FAKENESS", "NTA. She asked you for something specific, a free draft of the logo. You did that. If it was just the logo that you were asked to finish, I could maybe see throwing someone a bone and doing it for free but he also asked for brand identity. Once the request became more the free option went out the window. \n\nDid you discuss the rate upfront when he agreed? If so, she has nothing to complain about. That was an agreement between you two. Any complaints or discussions between them (like her promising something she shouldn't have) are just that. Between them.", "NTA \n\nYour wife blocked you and is staying at her friends bc you charged her brother for WORK you did for him, that was agreed to...\n\nIs your wife 14?", "NTA.  Take the money and run or you will be doing everything for her family for free.", "NTA, but non-designers don't understand the difference between a draft, a fully fleshed out logo and a whole godsdamn brand.\n\nAlso, kinds /r/AmItheEx vibes here, and it sounds like that would not be a loss on your part.", "NTA! Working people do not work for free. Only the most clueless do not get this reality. \"...he agreed to pay...\" What's not to understand?", "I", "Let her stay at her friend's house. Who else will she promise your free work too? You have to earn a living.NTA.", "NTA it’s very strange she expects you to give her brother free work when he wasn’t expecting it to be free.\nShe seems to be using you to provide favours for other people", "NTA.  He agreed.  Tell your now Ex that Freelance does not mean \"Free Service\" to family and friends ! You pay like everyone else!", "Your time is valuable. This man agreed to pay. NTA.", "\"If you're good at something never do it for free\"-Joker", "What’s her brothers business? Is it assumed you won’t have to pay whenever you solicit the business?", "She knew you were going to charge him. That's she aske for a free draft instead of a free logo full stop. If she wants him to have a freebie she needs to put on her big girl panties and ask you to design for free or design it herself. She's got absolutely nothing to be upset about.", "If you want to be beyond cordial, you can talk to BIL and say it seems like there might have been some miscommunication, so if he doesn't plan on using the logo, you're happy to refund him in exchange for a return of the license to use the logo and other IP.  \n\nBut if he uses it anyway, then you have an odd situation on your hands, of either suing him or just shittalking him at each family gathering.", "Pretty sure you can edit to fix an error like that. Not gonna judge WHY you might have done that. Not my business, but certainly also NTA. The free draft was a nice courtesy when asked for it. Sure, a family discount might even have been a good idea. But unless asked for and agreed, you aren't entitled to offer anything for discount or free. Plus, he seemed happy with the arrangement no? So its none of her business really.", "Is there a zero missing from the end?", "NTA.  I second the motion.  It's not just getting one logo, but one design and several renderings for different uses.", "If he was surprised about the price, he should have reacted accordingly. 'Hey, OP, I am aware you told me it will cost, but does it need to be so much?' or something.\n\nBut to OP: Check out the subreddit r/ChoosingBeggars. There are many stories of different artists who are asked to do stuff for free, for 'exposure' or similar. Especially if it's family or friends who act out entitled.", "Definitely optimize your pricing. My husband has a side gig doing websites/hosting and his prices are currently way too low, but he feels bad raising his prices. He understands me when I tell him that he doesn't have to overcharge, but undercharging makes you look like you don't even value your own work. (And my husband is good at what he does.) He still hasn't raised his rates to the going rate though. (Argh.)  \n\nSo for your own career, raise your rates, OP!  And good luck. Also, NTA, your girlfriend was way out of line. It's not up to her to offer your services for free.", "From experience: optimize sooner; don’t put it off.", "NTA. Your significant other needs to realize that after her brother spoke to you and agreed to your terms, it was now a business transaction and no longer a favor.", "NTA \n\nYet another ridiculous OTT reaction from a partner", "so is she your wife or girlfriend? but honestly not cool. there's a difference between a draft and final product.", "She volunteered you for Free...her brother wants to pay. Get the money and run", "NTA. You completed the free draft and gave it to him. The business was between you and her brother.  Seems your GF is expecting you to provide your services to friends and family for free.", "Nope NTA, your gf expected you to do your job for free", "NTA - the general rule for family & friends is full price or free to avoid the drama of family discounts getting extended to people they want to give it to, etc. Free for immediate family and full price for everyone else. Otherwise everyone your sis is friends with will be told they're getting free work from you.", "YTA for making this up. Is she your wife or your girlfriend? LOL!", "The hell? Absolutely NTA. You worked and deserve to be paid for your work. Sounds like your GF doesn’t respect the work that you do, a little bit.", "Why does it say \"my wife\" and then \"my girlfriend\" ? Which is it?", "NTA, why is your girlfriend pushing her way into the middle of a business deal she has zero involvement with? That's a HUGE red flag for the future of your relationship!", "Um, if your friend is a doctor or dentist or tattooist, you still expect to pay for their services rendered.\n\nIt was a straightforward contract - you gave a family discount by doing the draft for free, when he approved, you indicated fees would be involved.\n\nNTA", "My ex-fil (yes we’re still friends) is a brilliant man business wise. First he never trades or barters. Just pay what you owe and you never have to worry if one person or the other feels taken advantage of. Second most people don’t realize doing something free for someone costs you double. Once for doing the work itself and second for taking up that time when you could have been working and making money in that time. My parents were the only ones I did free things for and they never asked or expected anything which made it even more fun anyway.", "“You are a professional logo designer” said no professional graphic designer ever.", "Absolutely this. OP, go home. Your wife can go somewhere else. Does she have a job? If so, make sure to volunteer her work for free whenever you can!\n\nDon't really, but she's absolutely in the wrong.", "It’s not his wit. It’s his freeloading girlfriend", "Yeah, I don’t usually jump to “I call b.s.” but this one has me leaning towards it.", "NTA. As a graphic designer myself, I hate when friends and family expect freebies. If I offer for free, that's me being extremely generous. I already give a \"friends and family\" discount. \n\nYou did actual work. This is your job. You let him know ahead of time it would cost money. He AGREED TO IT. You wife is throwing a tantrum...why? She asked for a free draft and you did that. Does she not understand that you did what was asked for free, and that you were only charging for the additional agreed upon services? That's my only thought, that she is confused and thinks you said you'd do a draft for free and then didn't. \n\nOtherwise, your wife is a major AH for thinking that family should just get paid work for free.", "NTA people close to you should want to readily support your business not leach off of you.", "NTA. \n\nBut did the brother get upset at being charged? Or is she just mad that he’s being charged?", "OP is making this stuff up. \n\nHis post history literally gives this all away. YTA.", "NTA.  This is what you do to keep your bills paid.  You did the free draft she asked for, you weren't obligated to do anything else without payment and her brother agreed to pay you.   Personally, I'd ask the girlfriend if she is comfortable paying for your groceries and electric bill for the next month since she wants you to forego the income to pay for those things yourself.", "Hint: it’s fake"]}