{"id": 24185, "submission_id": "15lmt82", "title": "AITA for telling the people renting land from my in-laws they should be nicer to me if they want to keep renting when my husband takes over the lease?", "selftext": "My husband and I, and his parents, live on their farm. We renovated it to make it a hobby farm again. There are three pastures: two my husband uses and the third we were repairing to use it. My ILs were aware of this.\n\nDuring our repairs, one of the neighbors asked my ILs about renting out the pasture because they had too many heads for the land they already had. My ILs agreed because it was the \"right\" thing to do according to their faith and it'd generate a bit more income for them before they moved. My husband and I weren't happy about it but stuck a pin in our plans to see how things played out until the end of the lease to see if something could be worked out to accommodate everyone.\n\nWe're now 3 months into this arrangement and it's been a nightmare. The path to the pasture goes right by our house since it's close to it. They have complained about my smoking the good stuff on my porch no matter what time I go out to smoke. They complain that I play music they don't want their kids to hear. They complain that we use our firepit which is about 50 yards from the pasture. I reached the end of my patience yesterday: When I'm getting ready in the mornings or after a shower I walk around our house nude. My ILs house isn't anywhere in sight and we're tucked off our road going through the farm so our curtains are always open. If I see the renter's truck going over before I shower I either close the curtains or just get dressed. No one was at the pasture yesterday when I took my shower and I didn't see the truck after so I just walked around the house for a while. After about 25 minutes there was a knock at the door.\n\nIt was the neighbors. They complained that I needed to be more considerate and 'act decent' by putting clothes on because I should be well aware by now they bring their kids with them to take care of the cattle, and they don't want their kids seeing that. Then they started about how they're paying good money to use the pasture and paid out of pocket to make it usable. I stopped them there and told them they didn't do all the work to make it usable, it was already halfway done because of my husband and me. I also told them, paraphrasing here, \"You don't own the farm, you're only renting one pasture so you've got no right to tell me what to do in and around my own house. Don't want to accidentally see something? Stop looking at our windows. If you want any chance of having your lease renewed after my husband takes over, you should stop acting so self-important, act like the people of faith you claim to be, and be nicer to me.\"\n\nThey told my ILs about it who took it to my husband. He’s fine with what I said as he’s had his own issues with them, but we’re wondering if we should apologize to ILs and the neighbors to keep the peace if I handled it wrong. We'd like some outsider views, so AITA?\n\nAdditional info: We are not waiting for my ILs to die, nor is it a matter of 'if' he inherits but 'when'. Early inheriting is a thing that reduces the inheritance tax here and makes the transfer go more smoothly. They've already started the process for turning the farm over to my husband's ownership so that when they move in with BIL in 1-2 years its already done or at the very least, close to completion.", "created_utc": 1691511676, "permalink": "/r/AmItheAsshole/comments/15lmt82/aita_for_telling_the_people_renting_land_from_my/", "score": 6054, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I told the people renting a pasture from my in-laws they need to be nicer to me and stop complaining about what I do in/around my house if they want their lease renewed once my husband takes over.\n\n(2) My in-laws are renting the pasture next to our house to them so I might have to change some of my daily habits to accomodate since they are paying my in-laws to use it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. I honestly feel bad for this family, dangling a threat over their heads because YOU GUYS are acting like asholes. Loud, aggressive music, weed smell all the time, like wtf. I’d be mad too.", "NTA.  Why do you need to keep the peace?  You hold all of the cards.  You need to be respected and if your neighbors can't do it, they need to not rent you pasture in the future.  End of discussion.", "It’s giving plantation owner. YTA.", "ESH - you were not in the wrong in any way until the comment which amounts to 'be nice to me or else'.\n\nThey have been entitled arses, and there's nothing wrong with the petty revenge you've been taking in your own home and surroundings.\n\nBut threatening them, when you don't own the property, and it is likely that your husband will inherit it is a bit of an arsehole move", "I foresee a pig farm in the near future.", "NTA. These people aren’t living on the land; they live elsewhere and are just renting the pasture. I can’t see how they have any right to tell you how to live in your own house.", "YTA. Get off your power trip.", "NAH\n\nRespectfully, I think the difference in class is that your actions in smoking marijuana, period, playing loud music, and walking around nude is that your actions are crude, not that they are acting self-important.\n\nBut I so think it's little more than a difference in class.", "“Act like the people of faith you claim to be” - I love this. They’re just mad they got called out on their bullshit. NTA.", "You sound pretty darn entitled and self-important seeing as you don't own the farm either. They're still gonna be your neighbours after you take over - which hasn't happened yet - and generally it's a good idea to be on the neighbours good side. Like it or not they do currently have access and use rights to the land (and to not have their animals bothered by fire pit smoke) as renters and they only people they \"have to be nice to\" is their landlord - your inlaws. YTA just for the attitude. Maybe they have a point about your smoking etc.", "YTA. \n\nIt does sound like a nightmare but not for the reason you think.\n\nLet’s get this out of the way: you’re not doing what you want on your property. This is not your own house. You’re there at the invitation of your in laws. \n\nHowever, even so, the question isn’t what is legal but what is asshole. And you’re being a terrible neighbor and daughter in law. If you want to have a working relationship with these people and your in laws then you need to apologize and work toward a solution. \n\nNow, it doesn’t sound like your neighbors are wonderful either, but as tenants they likely have more rights than you do in this situation. So it’s time for you to stand back and eat some humble pie.", "When has \"you better be nice to me or else\" NOT been YTA kind of move? When you own the land, you can make those kind of statements. It's inappropriate to do so before. There were plenty of other tactics to take in dealing with them. \n\nYou are perfectly justified in being irritated about their constant complaints. You have the right to enjoy your secluded home without interference by judgemental neighbors to whom your parents are doing a favor in the first place. But you need to keep your reaction in the right lane. \n\nOne last thing, and a little off point, but relevant. When walking around nude in your own home with the windows open, remember that this is the digital age. And people are mean.", "NTA. You're both effectively your IL's tenants. What you do on your leasehold is your business and what they do on their leasehold is theirs. Only the ILs get a say because they're the landlords. It's maybe a bit rude to point out that your husband will eventually be the landlord, but well, they started it by being snoops about what you do on your land. Maybe apologize to the ILs for not deescalating the drama, but the neighbors suck. They're tenants, not your landlords.", "YTA it’s not your property and depending on where you live inheritance is his not yours.", "NTA. They shouldn't be looking to begin with. Aren't they there to work?", "NTA.  These neighbors are exceptionally entitled.", "ESH. As someone who rents land I had to lol at your “we did half the work” comment. That means you didn’t finish whatever you started. The neighbor spent time and money fixing something that he apparently didn’t even bill the actual landlord for. You sound very entitled to something that isn’t yours or even your husbands yet\n\nEdit: after further comments from OP I’d like to iterate that OP is much less an AH than the neighbor. Her response sucked so I’ll stick to my judgement", "ESH\n\nThem for being a PITA, you for being mean af.\n\nI do have to ask if you had your windows open when you walked around the house nude. If you have, then you're the AH for that alone. It's also distasteful to threaten them when the land is not yet yours or your husband's. That being said, the others are things your neighbours are blowing out of proportion. Unlike you walking around nude, the smoking, the firepit, and the music are things you can tell 'em to screw off. But don't pretend you're in the right. Apologize to your ILs for what you said about the lease, but tell them that you're not gonna change your ways just because they can't control their children or have a problem with what you do.", "YTA. My guess is you and your husband moved into an established community with defined mores. It's not shocking to me that your neighbors aren't nuts about your smoking pot on the porch, or playing loud music. And it's a good bet that these people aren't deliberate \"peepers\" either. Something happened that made either the neighbors or your kids see you nude. \n\nAnd, I get it, a big \"so what.\" Pot is legal, your music probably isn't breaking any laws, and you're allowed to walk around the house naked. But these things are uncool in the community where you've decided to settle. Surely you could make some concession to community standards? I mean, God invented ear buds for a reason. \n\nAnd finally, the \"You don't own the farm,\" line. Neither, sweetheart, do YOU. At best you're a renter, same as your neighbors are. Try sounding a tad less entitled, a little more respectful of the community, and a little more respectful of the fact that the neighbors are paying your in laws to use this land. They have certain rights.", "NTA\n\nIf I'm understanding this correctly; your husband is close to inheriting/taking over this property. Your neighbors need to respect the rules y'all lay out, so it's good to confront them before it becomes a bigger issue.", "OP probably is NTA here, but, OP also should be careful. Sure seems to me OP is assuming an awful lot, and if the IL's don't agree, her and her hubby might find themselves the odd ones out in the relationship. Especially as the IL's are people of faith, who almost certainly wouldn't appreciate OP smoking weed, drinking, walking around nude, and listening to what I assume is pretty loud and aggressive music, to have the neighbours complain about it.\n\nAll 4 of those things are something that people of faith might have some serious problems with, and OP should be careful in what assumptions she makes and what statements she utters. IL's might say \"when your husband owns it, eh? Yeah, that's not going to happen as long as you are still married to him.\"", "Edit: I've been convinced this is more of an ESH than anything else besides the In Laws.\n\nYTA. It's not your land. They are legally paying for it. None of this is your business. Deal with it when the takeover does happen if you want.", "NTA.  You're not completely in the right but not in the wrong either.  Much of the circumstances are outside of your control.  The way I see it you have two obligations here:\n\n1. **As a neighbor** you have the moral duty to be at least minimally neighborly.  Don't play music so loud it's unpleasant from their property.  Don't smoke \"the good stuff\" where they can smell it, don't expose yourself to them etc.\n2. **As a landlord** You're more the co-landlord in this which is not your choice exactly but your tangentially obligated by the terms of the lease.  In this you have the obligation to ensure they have the use of the property they paid for.  In this case they just need to keep their livestock secured and cared for which requires occasional access to the land and indefinite occupation by the livestock. etc.\n\nMy recommended course of action would be to take the easy steps to appease them.  Make sure they know you're doing this as a good faith gesture, not out of a perceived obligation.  Make sure they know this is YOUR HOME and is to be treaded as such.  That no intrusions into your personal space will be tolerated outside of what's required in your role as a neighbor and landlord.  That you will make a good-faith effort to be a good neighbor but they have no say what you do or don't do in your personal space and once they've voiced their opinion on a matter and you've heard it, the discussion on the matter is over.  In general I'd go above and beyond what's expected to be a good neighbor, but not to the point where I'm being a doormat or suffering significant impact to my quality of life.  You'll presumably have to live close to these people for some time so some effort is warranted.\n\nAs for the specifics of what to do next, I'd make them a pie, cookies, etc. as a good-faith offering and go visit them at their house.  Express that I'm sorry they have objections to the way I conduct myself in my own home but it is my home and they're not entitled to control that.  But, as a neighbor you **both** have an obligation to be neighborly.  So I'd ensure they have my phone number and tell them if they'll text me before heading to the property that you'll ensure your decent and otherwise take into account their wishes but only to a point of not being obnoxious.  If they can't respect your personal space and privacy in your own home then you'll seek to end any relationship making that a problem as soon as is convenient to do so.", "Nta.  They're crossing ask kinda of lines. There's no way I'd renew their lease.", "NTA. You seem kind of intolerant to be honest but they are very presumptuous and rude to be criticizing you so harshly when they simply rent a portion of the land from you. The fact is, no one needs to uphold this arrangement if it isn't working. You guys wouldn't be T A if you ended the agreement because you simply dislike having to share your space even with paying 'tenants'. I think your delivery left somethings to be desired, it sounded vaguely threatening and holier than thou.\n\nAnd BTW, I'm unsure of the legalities of this but people have been charged with indecent exposure inside their own homes, in certain circumstances. While you have historically been removed from others, if you now have a business arrangement with individuals who need to cross by your windows to conduct said business, you might indeed be a bit more careful about the risk of them seeing you nude.", "YTA. I don't even need to read the beyond the title, you saying anything like that is pretentious af and I would move before I ever kissed your ass to keep a lease. \n\nActing awfully entitled over land that isn't even yours. If I were the in-laws, I would probably tell y'all you need to figure out new living arrangements so that you don't create a feud with the renters.", "Yta for how you handled this. \"Please take all complaints to the land owners.\"", "You might NOT end up with that land! Your IL’s might decide to sell it to them!", "YTA. You sound like an inconsiderate neighbor. They’re paying for where they live. You live for free. Humble yourself.", "NTA, but I'd make sure that whatever agreement your husband has with his parents is in writing because they're not acting like people who plan on handing anything over.", "The neighbors sounds like jerks who should mind their own business. NTA", "LOL.....NTA.\n\nWhat nerve!  They're ***leasing*** a pasture and want to have input into what happens around it?  That's when you bring out the thong bikini and lay out.  With a pitcher of wine, music blasting, and roaches nearby.\n\nEdit to say: double check on the notification laws regarding agricultural leases.  Where I'm from, folks have to be notified by a certain date that the landowner will not be continuing with the current lease-holder.  If deadline missed, you're locked in with the same people.  We had to send a certified letter of notification to meet legal standards.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I, and his parents, live on their farm. We renovated it to make it a hobby farm again. There are three pastures: two my husband uses and the third we were repairing to use it. My ILs were aware of this.\r  \n\r  \nDuring our repairs, one of the neighbors asked my ILs about renting out the pasture because they had too many heads for the land they already had. My ILs agreed because it was the \"right\" thing to do according to their faith and it'd generate a bit more income for them before they moved. My husband and I weren't happy about it but stuck a pin in our plans to see how things played out until the end of the lease to see if something could be worked out to accommodate everyone.\r  \n\r  \nWe're now 3 months into this arrangement and it's been a nightmare. The path to the pasture goes right by our house since it's close to it. They have complained about my smoking the good stuff on my porch no matter what time I go out to smoke. They complain that I play music they don't want their kids to hear. They complain that we use our firepit which is about 50 yards from the pasture. I reached the end of my patience yesterday: When I'm getting ready in the mornings or after a shower I walk around our house nude. My ILs house isn't anywhere in sight and we're tucked off our road going through the farm so our curtains are always open. If I see the renter's truck going over before I shower I either close the curtains or just get dressed. No one was at the pasture yesterday when I took my shower and I didn't see the truck after so I just walked around the house for a while. After about 25 minutes there was a knock at the door.\r  \n\r  \nIt was the neighbors. They complained that I needed to be more considerate and 'act decent' by putting clothes on because I should be well aware by now they bring their kids with them to take care of the cattle, and they don't want their kids seeing that. Then they started about how they're paying good money to use the pasture and paid out of pocket to make it usable. I stopped them there and told them they didn't do all the work to make it usable, it was already halfway done because of my husband and me. I also told them, paraphrasing here, \"You don't own the farm, you're only renting one pasture so you've got no right to tell me what to do in and around my own house. Don't want to accidentally see something? Stop looking at our windows. If you want any chance of having your lease renewed after my husband takes over, you should stop acting so self-important, act like the people of faith you claim to be, and be nicer to me.\"\r  \n\r  \nThey told my ILs about it who took it to my husband. He’s fine with what I said as he’s had his own issues with them, but we’re wondering if we should apologize to ILs and the neighbors to keep the peace if I handled it wrong. We'd like some outsider views, so AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[deleted]", "YTA. Theres no rule that says they have to be nice or act exactly the way you want. they paid for the land and they get to use the land. that's the end of it. You should be nicer to them if you want to keep collecting all that sweet sweet rent money", "NTA but I hope your in laws see it that way too because they sound like they already didn’t chose your husband when they leased the pasture", "So many nerds in this subreddit jfc.\n\nApologize to the in-laws if you want, but NTA.", "This thread is wild. \n\nNTA-doesn’t matter who owns what. You can be naked in your own house and you can smoke weed if it’s legal in your state. And even if it’s not, still kind of a gray area. And I’ve never know a farm that doesn’t have a burn pit or the occasional bonfire or even a wood grill or stove or fireplace or something that otherwise makes smoke. I mean smoke kind of goes with a farm.", "Then don't rent the land.", "You say it’s a good idea to be on the neighbors good side, but what about the idea of the neighbor being on your good side?", "How come op has to play nice with the neighbors, but the neighbors don't have to play nice with op?", "Not the windows themselves, no, only the curtains stay open. Whenever I notice they're over at the pasture, I either dress or close the curtains.", "Yes, we moved here to help them out and repair the farm since they couldn't take care of it themselves anymore and he'll be inheriting it in the next couple of years when they move to live with my BIL.", "They don't own her house because they rent a fucking field near it. Do you get to tell your neighbors what to fucking do because you rent a house in proximity to them. No, no the fuck you don't.", "The house is absolutely their land…. They’re legally paying to keep CATTLE ON ONE SMALL PART of the land.\n\nSo demanding to be in control of what happens in the house that they are in NO WAY paying for…. Absolutely makes OP. NTA", "They can't hear the music from their house though, they hear it when they're tending to the cattle in the rented pasture. I don't wear noise cancelling headphones for safety reasons when I'm working outside so I play music over a bluetooth speaker. Same with the pot, its not from their house, its the pasture.\n\nTheir actual house and property is 2 miles away. There's really no way to adhere to all of their complaints when they come and go at sporadic times. They have my husband's and IL's numbers but don't give heads up because they feel like that's having to ask further permission to use the pasture.", "Re-read the story, OP or husband don't own the land, the in laws do. They have no say on the lease as it is as realistically they're freeloading.", "I agree with your comment but I feel like it’s more of an ESH because the neighbors can’t dictate what another tenant does at their home.", "They are not living on the piece of land they are driving their cattle by the house. That is what the rent thay iece of land for They have a private house further away.", "What does that have to do with the price of eggs?\n\nDoesn’t sound like anything they are doing impedes the cattle work on the land with which the neighbors  are paying.\n\nThe renters could have just spoken to the parents about their concern about what’s happening instead of approaching OP - the neighbors aren’t paying for use of the land OP is living on and have no rights to dictate their behavior. The owners of the property do, however. \n\nNow - I can see where YTA may slip in based on the whole “be nice to me or when we own this we’ll show you” situation. \n\nOP doesn’t own the land, so they may not want to threaten people based on what *might* happen in the future. THAT’S where I think OP was TA. \n\nDon’t scramble your eggs before their laid. Or something…", "They don't live there, they're running cattle.", "She's not their neighbour.  They're leasing a *pasture*, not a house.", "Except we don't want their rent money, my husband was against them renting the pasture because we were turning that portion of the farm into a cat sanctuary.", "Where is OP trying to get them to change their behaviour? She just wants them to leave her alone.", "The neighbours, as far as I can see, have only asked they don't bother their livestock they pay to have in the pasture with fire pit smoke (from an unnecessarily close fire pit), don't smoke weed around their children, and don't wander around naked in front of open windows (you don't have to always be leering in to see) when there's children around. They aren't lording it over them going \"well we're gonna end your lease\" acting like they own the place like OP is when she doesn't own it anymore than they do. OP is TA.", "See above comment", "Then you're still the AH for that. You can walk around your own house nude if you can cover up your windows and doors. Unless they're specifically looking inside your house, in which case it's a different crime, you're still wrong to walk around nude when your windows are open, regardless of whether they're in the pasture or not.", "Frankly, your in-laws are low key the biggest assholes here, for agreeing to a high-commitment rental with the neighbors, knowing full well that they're handing the property off to yall soon.", "And neither does she. The takeover has not occurred. She can have her say when it does.", "Except it's not their land. The takeover has not happened yet.", "That's not the business of the neighbors though. I would be interested to know what the ILs - who evidently own all the property and who made this arrangement - have to say about this. The neighbors seem like they are being unfairly demanding and critical but to your point, at least the neighbors pay rent. OP's account SUGGESTS that her husband will be 'taking over' at some point.", "I don’t know what you mean about the price of the eggs \n\n\nBut I think the renters speaking to op before the parents was the better way to go about it if op wasn’t on a power trip. Then it wouldn’t come across as the tenants ‘bad mouthing’ op or anything. Like if I had an issue with a neighbor I’d take it up with the neighbor before going over their head", "Whatever, they’re still *paying* for the land there, you’re freeloading. They also spent a lot of money to increase the value of it, at least half according to you. They deserve to be able to make complaints if you are lowering the quality of what they are paying for.\n\nAnd yeah, kids shouldn’t be looking in your windows, but kids do rude things sometimes. Or maybe they don’t even mean to be looking into your windows, you’re just visible when they look at the house. You’re weird for choosing to not cover up knowing kids can see into your house. Just close the curtains before you shower. Not that hard.", "[deleted]", "Their house is on neighboring land, and they are also renting a pasture on the same land OP lives on (but does not own).\n\nso they are both neighbors and co-tenants", "They are their neighbors. They just ALSO have a right of way to access land they are renting.", "But it's not your land yet. It's your in laws.", "Are you and your husband wealthy? Because it sounds like you're very comfortable lighting money on fire. \n\nThat aside, YTA for being needlessly antagonistic with folks renting land you don't own.", "And when it’s your land you can do that, but for now it’s none of your fucking business", "I did, it's what I was commenting on. You're just wrong.", "Mate. They live rurally. The ONLY time someone will be around is these people. I walk around naked all the time in my house? It’s very common on farms as it’s rare someone’s around outside. \n\nTry living rurally before commenting silly stuff about how rural people should behave in a rural setting?….", "...what?!? This is crazy talk.", "It is. I could understand them wanting extra income since they're both retired now but neither my husband or BIL would let them go without. Especially with them moving in with my BIL soon. They have an account they've been putting extra money into for their parents. Personally, I think it's mostly them all moving in the same church circles that prompted it.", "And yet you're advocating for renters OF A FIELD to be able to control her in her own fucking house. Make that shit make sense. So clearly, you think they should have more power here than her. Why?", "That’s absolutely fine? As a son set to take over my family farm…. That’s not the own you seem to think?\n\nTaking over a farm is a long complex process that only ends when your parents die usually haha. \n\nOP and her husband will not own the land for years. He WILL however be in control of how it’s used and by who shortly if he’s taking over. So he will absolutely be in a position to say. “We want to use this ourselves and are sick of you policing our home so we’re not renting to you anymore”\n\nWhich means…. That whether he OWNS the property or not really doesn’t mean anything. what matters if if he CONTROLS the property. Which it’s clearly stated he mostly does and will completely soon?", "I mean, if you had neighbors that were blatantly smoking dope, playing loud obnoxious music, lighting fires, and walking around in plain sight nude, all of which was being exposed to your child; would you say something?  \n\n\nThe in-laws don't have to pass that pasture on, they could always sub-divide the property and sell the pasture if they wanted.", "It’s hard to be sure, but from the post with the exception of the initial nudity complaint the neighbors have been going to the ILs and then the ILs have been telling OP/OP husband to clean up her act. So she’s not only upsetting the neighbors, but her ILs possibly. If she keeps being a nuisance the ILs might kick them out/start making them pay rent/or sell the pasture to the neighbors to prevent her from using the possibility of ownership to get her way", "The price of eggs is as relevant to the field rental as OP dancing around nude or smoking pot.\n\nIe none at all", "It's literally OP's Husband's property. Most wouldn't call the landowners spouse a freeloader.", "[removed]", "It also doesn't entitle you to tell your neighbors what to do within the confines of their own house and yard. Do you do that at your house?", "How is people complaining to her about everything she does not her business?!?", "For real. She already explained how isolated their house is.", "Probably. While I would recommend being a bit more diplomatic with these neighbors, it's effectively your Husband's land, and whether it's today or next year, you're gonna start managing it as such.", "No it’s not?", "While his parents own it they are in control of the land. And who it eventually goes to.", "I don't think I would. The neighbors aren't paying to LIVE there, they are paying to use the pasture presumably for farming. I'd be more likely to not bring my child there than to criticize those who live nearby. People should be free to do what they want, within reason, on their own property and I put smoking dope and playing music I don't like on that list. I do realize both have potential to impact others nearby but should a neighbor be in a position to tell someone else they can't smoke or listen to music because it offends the neighbor?", "No it’s not, it’s the parents property. They just live there. That’s why the neighbors go to the parents about complaints or renting.", "It’s literally not her husband’s property. It’s literally his parents’ property.", "Nah, it's OP's husband's parent's property.", "Nudity is still illegal even in/on your own property when it’s visible to others. They’re completely in the right.", "[deleted]", "I'll take your suggestion and try to be a bit more diplomatic with them. Thanks. Otherwise, yeah, he doesn't officially own the farm yet but we already work it, paid for all the renovations we did, and manage the rest of the farm accounts.", "Gonna have to be a BIT more specific mate…. 😂😂  or just a weak attempt at a one liner?..", "If his parents own the land… and let their son control it… what does it matter who owns it? Or is arguing semantics the only one you have? 😂🤦‍♂️\n\nAlso HIGHLY doubt OPs husbands parents are going to change his inheritance because his wife clapped back at renters who thought they should be able to CONTROL what OP does in her own home? But hey you fantasize however you’d like 😉🤔", "It sounds like the husband is near inheriting the property. If the husband and OP take over the property in the next year or so, then the neighbors better start respecting them sooner.", "OP's husband is set to take over this land in the near future, if we're to believe OP. It's semantics as to who owns the property right at this moment, if the neighbors are going to want to continue to lease the property, they're gonna have to respect OP and her husband at some point.", "[removed]", "That's probably because you aren't looking in their windows like these people clearly are. And yet you sided with them. How odd.", "These other commenters don't seem to understand the concept of owning property. I'd also make your husband hold your in-laws to task, and maybe try to have them limit the developments that your neighbors make on the property.", "Yeah, so it’s not theirs yet. And I’m sure they’ll be just as good of a landlord as they are a neighbor. She’s trying to flex power she doesn’t even have yet. I’m sure they’ll be looking for a new place very quickly.", "It’s not semantics. OP’s husband potentially inheriting it in the future doesn’t mean they own it now.", "> Nudity is also generally illegal on a person’s own property if the nude person is visible to the public, such as through an open window or sunbathing naked in the yard\n\nhttps://www.legalmatch.com/law-library/article/understanding-nudity-laws.html#:~:text=Nudity%20is%20also%20generally%20illegal,sunbathing%20naked%20in%20the%20yard.\n\nLoud, cocky and wrong. Embarrassing.", "Again, if it is going to be their property in a year, OP and her husband have no obligation to continue leasing to the neighbors, and the neighbors need to realize that. If I was set to inherit a property or an asset, I would hate to see random people making a mess of things just as I'd be set to take over.", "OP says there is a set plan for her Husband to take over in the immediate future. That means OP's husband is going to be able to revoke the lease with the neighbors in the immediate future. The neighbors seem ignorant of this.", "Lol someone doesn’t realize pastures you rent out aren’t “public land”….. loud, cocky and wrong indeed mate??…. 😂🤦‍♂️ \n\nThey live ON A FARM. The land around their house is NOT public in any way? Wanna try again(", "[removed]", "Where did OP say it’s going to be their property in a year? It sounds like her husband will inherit it when his parents pass.", "What? They’re not making a mess of it. They, by op’s admission put in their own money for at least half the work that made the pasture usable. They’re making it more valuable of an asset.\n\nOp is the one that’s going to make it harder to rent out by being inconsiderate", "He doesn’t own it yet, plans can change. Don’t count your chickens before they’re hatched and all that.", "Someone doesn’t realize “Visible to the public” means other people, not public property. If you’re naked in front of your window and I’m mowing my lawn, which is my private property, that would still count as indecent exposure\n\nEven if it was another house you own and are renting to me, it’s still indecent exposure. \n\nA piece of glass doesn’t protect you from exposing your junk to people, especially kids.", "You have no idea what you’re taking about. Indecent exposure laws don’t hinge on you exposing yourself for sexual reasons, it just hinges on you exposing yourself. You have the reading comprehension of a walnut. The part you quotes just mean factors of children or nudity meant to arouse will have different levels of consequences than nudity like this. If I take my top off only because it’s hot, I will still get In legal trouble for indecent exposure, even though it’s not sexually motivated. It’s saying Ones with kids or sexual motivations are more clear cut, duh. Because that’s p*dophilia and sexual assault. What you quote in no way states that those are the only stipulations to making it illegal. And it doesn’t negate what *I* quoted that said being nude in your own property is still illegal if it’s visible to others.\n\nAnd they’re now being made aware that their nudity *is* visible to children. Like do you think that a guy can get away with standing in front of a window with this dick out and get away with it by saying ‘no no officer, it wasn’t sexual I assure you.”\n\nEven in the law you sighted. She’s still committing a crime because **it is visible to a child** and you’re saying they’re wrong for altering her of that because they’re ‘dictating her life choices” lol\n\nIf it’s visible by other people, it’s still indecent exposure even if it’s not by a ‘public road.’ It only hinges on it being visible by other people.", "OP has commented that her in-laws are moving to live with their other son within the next year or so, leaving the property to OP's husband.", "It doesn't matter, because it's not the neighbor's property. While it might not TECHNICALLY be OP's land at the moment, that won't matter that much if she and her husband revoke the lease the minute they take over.", "While you aren't wrong, I'd say it be more unwise and irresponsible to inherit the property with no plan to deal with people who had been sharecropping under previous management.", "Jesus mate. READ. If I’m in my home. Surrounded by MY OWN private property. And you drive past on a PRIVATE road. I OWN to use PRIVATE PROPERTY that you rent from me. That’s not public. That’s private. They don’t rent a house. They rent an empty field to put their cows in. That DOES NOT make OPs private home surrounded completely by their privately owned land. A public place. \n\nAlso you would have zero control over music from the house next door unless it’s a late night noise complaint and same goes for smoking the good stuff?….. \n\nYou literally completely changed the scenario to try and make that work. So again. Wanna try a THIRD time to get it right?…. 😂🤣", "NTA. These people are making it uncomfortable in your own house. You should absolutely be allowed to do what you want, especially inside. They have no right to come knocking on your door telling that you're \"indecent\". Imo the smoking is also well within your rights, as is the fire pit of course. The music is the only potential real issue, maybe it should be played quieter? The entitlement reeks from them otherwise though.", "NTA, The fact is they shouldn't be snooping in you. It seems like you're on your own land, and they are on their own (rented land). You both have your rights to use your property as you want, but they have no right to impede on how you are living IN YOUR OWN HOUSE. Maybe it's a little power trippy to say that, but it seems well deserved. Enjoy your good stuff 😉", "NTA. The agreement is over renting the pasture, they have no legal, social, or moral claim to anything else. They are being inconsiderate, controlling, inappropriate, and they’re clearly overreaching. They’re harassing you and potentially trespassing.\n\nBased on their continued behavior, there’s nothing you can say that’s going to get them to stop. You may want to look into how to void the rental agreement. Though definitely consult with a lawyer before taking any action, if you go that route. \n\nIf that’s not feasible, then have the ILs tell them to stop, and just ignore any future attempts by them.", "NTA you're in your house. on your property and they don't like what you're doing. don't like the music you play? would they like to come and make sure they approve of your wall art? \n\nMake sure the IL's know what sort of stuff they complain about in your home and as for the neighbors. when you control the land, cancel the lease.", "From one naked stoned lady to another - NTA", "I wouldn't even entertain the idea of renewing the lease", "NTA", "Just ignore it all and don't renew the lease. Let them sell the cattle or rent elsewhere. Seems like you guys had plans for it anyway.", "Respectfully... If you wanna have a good time living there you need to not be a total ass. Snark sure, full asshole threatening them before you even own the property... No. \n\nThe thing about farms is they all talk to eachother. And anyone else with ears. Theyll more then gossip about you and then you have a community who tolerates you as they like your in-laws. \n\nIt's a fine line to walk and you need to keep the relations good. Cos if you ever need help you'll be 100% on your own.", "NTA. Tell them you'll let them out of their lease so they could move elsewhere if they like.  Otherwise, they need to deal with it.", "NTA. And don’t renew the lease.", "NTA. They’re snooping, busybody, peeping toms who need to be kind to people.", "Nta. But you sound like a piece of work", "YTA, and I say that as a country girl with cattle whose house has no curtains in a few areas because of how private it is. You are not the owner, and you sound like you're being disruptive. The tenants suck too, but clearly they had an understanding with the ACTUAL owners, who you don't mention are fine with the tenants attitudes or not?? They should not be complaining about your music (sorry, cows don't care, and unless you're SUPER obnoxious, they should get over it), and I live in an area weed is legal without ever having smoked it, I'm still fine with the smell. No pearl clutching needed. But you do get into AH territory by saying you walk around nude, knowing you have tenants, and only accomodating them if you explicitly see them. Your in-laws rented it, it's not private anymore, get a freakin robe.", "NTA\n\n The whole \"apologizing to keep the peace\" idea needs to just die. It never does any good, and it allows one party to walk all over the other. Do not apologize, you have nothing to apologize for, at all", "ESH\n\nIf your purchasing this property from your in laws and have committed a lot of sweat equity and time into the property I think it’s ok for you to be emotionally attached and entitled over the property.\n\nIf you’re inheriting it and not making any monetary agreements for exchange of property you should respect your ILs decisions and business arrangements for the remainder of the time they own the property.\n\nThe weeds nobody’s business maybe go to a different side of the house so it doesn’t blow that way if you see people out there, that’s just common courtesy even with a cigarette.\n\nSolution to your nudity since you know you have renters that come and go at random times, is quite honestly to close the curtains facing said pasture during naked time, is it annoying? Sure, but it’s the right thing to do.\n\nTo summarize, you were being an asshole in the way you spoke but not an asshole in the way you feel 😂", "ESH\n\nYou seem to feel entitled to the land that your ILs own, and your comments to the renters are rude and vaguely threatening even though you have no power over their lease. You're also negating the work they DID put into the pasture after you didn't finish what you started. \n\nThey don't get to dictate how you act in your own home, and if they have issues with your behavior, they should have considered that before renting that pasture. \n\nY'all are all being jerks and I wouldn't want to deal with any of you.", "Lolol. All the reasonable people are downvoted to hell, eevryone that thinks it’s cool that OP is being a YTA are the top comments. This sub I swear…..", "NTA - your Husband's property = his rules, which coincide with your rules.\n\nThey're just annoyed they got called out on their bs, word of advice, don't renew regardless\n\nedit: BTW OP, have you considered adding a pig pen to the farm, perhaps right next to the land they're leasing.", "Man it'll be fun to see this in a year when you're complaining about the hogs that the neighbor put up against your land.", "YTA\n\nIf you want total privacy in your own home, buy your own land and prevent people from coming anywhere near it.\n\nIt's unreasonable to walk around your house naked when you know there's a possibility of people passing by and seeing in. You know the path to the pasture goes right by your house, you didn't close the curtains, so obviously there's a chance that someone will see in. It's unfair of you to subject them to that. \n\nYou shouldn't have to stop smoking, but it is your responsibility to ensure that you're not making anyone uncomfortable with it otherwise you're being disrespectful. People who live in countries where it's illegal manage to not get caught, you can smoke while being discrete.\n\nYou don't own the land, your husband hasn't inherited it yet, so I'd argue the people who are actually paying to use the land have much more of a say in this than you do.\n\nI'd think twice about trying to push out people who are bringing in income to the farm and are improving the soil condition because of personal differences, you might regret that when your husband inherits the farm. Farming is difficult and I don't think it's wise to lose an income stream over this.", "ESH i'd apologize to the inlaws, but explain why there's this conflict. It's not that i think you've done anything wrong, but they're trying to do right in the world and you've got conflict with people they're working with.", "[removed]", "NTA", "NTA.\nYou can do what you like in your own house. They are more than welcome to rent land elsewhere.\nAnd what on earth are they doing looking in your house anyway.\n\nYou don't need to apologise to anyone, and as soon as that lease is up, get them off your land, even if you do nothing with the land other than waltz around naked on it 😁", "NTA. Don't apologize. I can't even believe the audacity of those people. I wouldn't renew their lease either.", "NTA. I wouldn’t entertain extending their lease *at all* after it expires. One and done!", "NTA", "This entire setup was doomed to fail from the beginning. In Laws rented to people who are kinda stuck up (IMO) and you're very much not. The second they asked for you to turn off the music/stop smoking you were put in an impossible situation. Since they do not wish to give you a heads up when they come over (reasonable I think) you either A. ignore them or B. essentially allow them to veto whichever activities they don't like on your property. \n\nNTA, but I agree with the commenters saying you need to be careful. The entire community is likely cut from the same cloth as your annoying neighbors", "NTA", "Nta. Apologize to the inlaws for them getting dragged into neighbor drama. Do not apologize to the neighbors. They big time entitled AH", "Let me get this straight.  They are leasing land to run their cattle and they think that gives them the right to determine how you live in your own home?  That would be a big NOPE when they ask to renew the lease.\n\nNTA", "NTA\n\nCancel their lease.", "NTA, but maybe apologize to your ILs for having to deal with the people complaining to them, just to keep the familial peace.", "Get some net curtains in case they take pics of you naked. NTA", "I was prepared to say YTA after reading the headline, but no, NTA lol", "NTA.  Fuck em.  Be naked and puff away.", "NTA   seems like some hypocrisy is going on", "NTA. You’re on your own property and they are harassing you. They do not get to dictate what you on your own property.", "The land isn't your husband's yet so you should apologize to your in-laws.", "YTA.  Not for thinking or feeling how you do but for showing it.  You don't control things yet and 'those crazy people' may have creative ways to thwart you.  You are still playing by other people's rules (the IL) until your name is on the deed.", "Don't apologize. You have nothing to apologize for. Wow, I loved the way you mprevor kiss told them off. If it were me, I would break their lease right now. They seem very entitled.", "In suburbia smoking weed or listening to loud music can really bother neighbors so I kinda understand the complaints then. But if my \"neighbor\" lived 2 miles away and I still got complaints because they had access to a pasture my patience would be very tested to say the least", "[removed]", "Our farm’s burn pit made Fallujah seem like an oxygen bar. Being around it probably altered my DNA in heretofore scientifically impossible ways.", "[removed]", "[removed]", "Nerds? On the internet?  Now I've heard it all!", "Yeah, that would work if the neighbors owned the pasture, but they're just renting it. I imagine that there was a stipulation that the land would be used for cattle. If they put in a pig farm, then they might get evicted.", "Doesn’t even have to be a pig farm. Farmers are almost always willing to help each other out. Get sick? Gary down the way will help with the cows, Jody will make sure the stalls get mucked and the horses fed. Hell Carey can diagnose and fix that old tractor round back faster than you can call the mechanic. But if they don’t like you, you’re on your own. And farming alone is damn near impossible.", "Yep.  Goodbye property value.", "Life on the land is not so cut and dry.  Talk travels fast and this pair is new.  Then there was a mention of church... ouch.  Gossip central. If someone needs help, neighbors usually show up to lend a hand in a heartbeat.  Without that help it can get bad, fast.", "absolutely hillarious that you start off by saying that OP is \"assuming a lot\", and then go on to make blanket assumptions about everyone involved.", "My ILs have never had a problem with my smoking weed or the walking nude, they do it plenty. They do care about what their church circles say but they've only got two kids, my husband and BIL. They want the farm to stay in the family. BIL doesn't want to live on the farm and my husband does, he's already managing most of it and on the accounts. I am also on some of the accounts. All they're waiting for to move is for BIL's new house to be ready and set up.", "Yep! We're wanting to place a sort of cat sanctuary where that pasture is so barn cats can have a new home instead of getting dumped on the street or let loose.", "Also never make threats about something you never know if it’ll be forever guaranteed. Using a future inheritance as a form of a threat is always a dumb move. Your IL might decide to give him nothing or they might sell if part of the land tomorrow.", "My husband is inheriting it, but we have put forth the money and resources to renovate the farm and get it back into working order. We both work it and are raising some livestock so we have sweat and cash tied up into it. We're also on most of the accounts so either myself and my husband can order repairs and materials as needed and sign off on things.\n\nI'll probably just swap my houseplants for some other plants so closing curtains doesn't affect them.", "this is the most accurate take, I think. idk where op gets off, she married into this property and it's not officially her husband's yet. so much could change.", "Yes, we didn't finish because they kept pestering my IL's about the fence and moving their cattle asap and my IL's stipulation was that they could move the cattle faster if they finished the fence. They didn't do any work out of the goodness of their heart, they did it because they were trying to put 50 cows on 15 acres at their place.", ">The neighbor spent time and money fixing something that he apparently didn’t even bill the actual landlord fo\n\nThey're the ones that approached the land owners and asked for this deal though, so how the fuck are they going to throw that back in their face?", "Presumably the renter knew the state of the land they were renting and the work required; not that it was rented to them as ready for their needs.", "Just because it’s the digital age, doesn’t just suddenly give you the right to take photos of someone nude inside their own home..even if the windows are open…. It’s illegal….", "That's because too many posters here think that smoking weed and playing loud music are perfectly acceptable.  I could care less about either, but I do know that part of being a good  neighbor is compromising when possible.", "Agreed, and I would definitely apologize to the inlaws for escalating the situation. They're now dealing with pissy tenants because of this little spat.", "Well, considering the neighbors are renting, they should worry about OP putting in a hog farm.", "People don't just get to walk up to your house and tell you how to live tho. If anything it should be ESH. Neighbors aren't entitled to decide what music you listen to, where/when you smoke, or how you dress on your property. Totally agree tho OP didn't handle it well and made threats predicted on a future arrangement that was not set in stone.", "She should apologize for what exactly?? Listening music??", "Even if she doesn’t own the house it’s still her legal residence. Are renters not allowed to smoke weed or unveil their horrendous flesh? This is country. There’s still a ton of room even between the field and the house she lives in. Those neighbors should just leave her alone.", "If you look into someone’s windows you should be expecting to see someone’s junk lmao. They aren’t paying for the land. They’re paying for a pasture, not the land the house is in. You’re a ridiculously entitled human being", "So you guess a bunch of stuff and say OP is an AH for not adjusting to these made up things.\n\nEven if all of your hypotheticals are true, it's their property and they can live however the fuck they want.", "Imagine pissing off that farm, who's 100% going to talk to others... Who will tell the feed supply people, who will tell the farrier and then someone said something at the pub and oh look... Everyone knows. \n\nThere's being snarky which is fine and then... This. Threatening someone is a sure fire way to ensure once the in-laws are gone, there's zero goodwill towards that property and if they ever need help.. they are fucked.", "So it’s totally fine that the neighbors are telling her what she can and can’t do at and inside her home? Sounds like they’ve been harassing her for months", ">they paid for the land and they get to use the land. that's the end of it. \n\nExactly, they don't get to harass the property owners over the actions of people. \n\n\nYou're an idiot because you're half right, they do have the ability to be there, but you're forgetting they have no right to demand behavior of someone else.", ">they paid for the land and they get to use the land.\n\nBut they didn't pay for OPs house. They can control whats going on in the pasture but its rude to attempt to dictate how she behaves in her own home or on her own porch.", "What about using the land entitles them to come onto land that isn’t theirs and make demands exactly?", "Lmao, so if I walk up to your door when you're going about your business and tell you to be decent, you're going to apologize?\n\n\nYou're a liar and a fucking half.", "You sound fun", "Adults should have the right to listen to whatever music and smoke whatever plant they want on their own property. And in many states/countries, they do in fact have that right. \n\nStuck up family can stop renting if it bothers them.", "So she’s not allowed to do what she wants within her home and on the property where she lives? Are you skipping straight over the harassment she’s faced from the AHs next door?", "God forbid people do whatever they want in their own home. So she shouldn't listen the muaic she likes cause their kids might hear it?? Who cares? Why do they bring their kids to look through her windows??", "Sorry, but they have zero business complaining about OP smoking the green, nor do they have any business policing what OP does or doesn't wear in their own home. Continual complaints make the renters the AH if they refuse to take no for an answer.", "Bc they’re on a farm? Wtf are you talking about?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "But they don't live at the pasture they are renting, so hearing music played while they come to feed/check up on the animals seems overly controlling and out of line.", "Except OP isn't smoking or walking around nude or playing music on the land these people rent. So no, they don't get a say.", "> I'd argue the people who are actually paying to use the land have much more of a say in this than you do\n\nThey rent the ***LAND***.  They get no say over OP living at their house.", "You don't inherit property until the previous owner is dead.  I realize you're probably using the term informally/colloquially, but when they move and hand over the reins, will they still own it, or are they transferring it to you?\n\nIf they're still the landowners, they could legally continue to make agreements with your neighbors.  You might need a lease agreement to prevent interference.", "...Hint hint, the pig farm is to dispose of the neighbors' bodies.", "Ok. Definitely let them kick rocks then. Good luck.", "you guys sound super cool.", "ok, so the only criticism that's remotely valid is being visibly nude from within your own home which is kind of a meh issue. I'd slap some 1-way window coverings on select windows and go about my business as usual.  If they complain further I'd just tell them: \"They only way you could be affected by that is if you were some places you're not supposed to be\" maybe followed by a sassy \"your access to the property doesn't include hanging arround my home, tend to your animals and mind your own business\" then immediately end the conversation.", "INFO - Why did you post here if you aren't going to even listen to several thought out, conscientious replies that say you should be more considerate overall and try to be a better neighbor?  The post above is a perfect example.  They just outlines some potential issues as well as how you can help to maintain the peace. You, like in your other replies, just argue back and repeat the same things over and over, indicating you won't change a bit. This part makes YTA.", "They are not freeloading. The parents can't work the farm anymore and asked them to move on the pand and help out.\n\nOP's husband is managing the farm and handling all the accounts, and OP is helping out.\n\nOP's husband & BIl have set up an account that they both are putting in money to support their parents in retirement.\n\nThe farm is now their permanent resdence, and they are working on fixing the farm up and managing it.\n\nYeesh.", "I hope they long lease lol. \n\nImagine how infuriated she would be, to realise they got an extended land lease that they cannot back out of even when hubby inherits. \n\nIt'd be delicious.", "But you don’t own it YET and that’s the point. Sure they’re being annoying but you’re being presumptive and wilfully difficult over something you don’t own or control.", "Your IL’s were wanting to collect income off their property. They said they were being “pestered” so they could speed up the process with you. Like I’ve said the tenant is often the pain sponge for the landlord. You both can blame him so there is less conflict between you.\n\nIf he was truly annoying your IL’s they would have told him no.\n\nOf course he didn’t fix the property out of the goodness of his heart. He needed it to be operational. That still takes time and money. He was obviously more motivated than you to get it done", "1) I said ESH\n2) OP is not the landlord.\n3) You have no idea what the deal was. The landowners made the deal.\n4) The landlords sided with the tenants", "I’m sure. I’ve rented plenty of farms that needed some work. The farm increases in value because of me and I’ll be lucky if I recoup my cost. On its surface it’s a bad deal for the tenant. But hopefully it builds a good relationship with the landlord and you do business with them for years.\n\nOP is NOT the landowner. I can not tell you how often the family of a landowner thinks they are in charge. Tenant is often the pain sponge for the landlord. Keeps the family from arguing with each other.", "They are renting a pasture but they have their own land.", "I also agree with the comment but disagree with both of your verdicts - NTA. Handling this sub-optimally doesn’t make OP an AH. The neighbors are still on a campaign of pointless harassment against someone just trying to live her life.", "The question isn’t what’s allowed. The question is what’s being an asshole. Those aren’t the same thing.", "Hey, buddy: The community is conservative enough that the faith of at least two of the couples involved is mentioned. It's conservative enough that people are complaining about music and about pot. True peepers do NOT come to your house and say, \"I can see you naked.\" It is NOT the OP's property. Maybe look up \"hypothetical.\" Have a great day.", "Pretty much. They are actually paying to use the land. If I was paying rent to use somebodies land, I would expect I should be able to use the land without  the actual landowners entitled daughter in law smoking pot near my kids, walking around naked passing open windows, and playing vulgar music loud enough for them to hear. \n\nBeing asked not to do shit like that isn't a huge ask of anyone. It almost comes across as daughter in law purposefully making them uncomfortable because her and hubby weren't happy that the in-laws decided to rent the pasture for some actual money. Instead of letting them use it for their hobbies.", "No she wants them gone so she can use that pasture herself.", "It’s NOT their own property though", "It's no so much MUSIC, it's the words. They are complaining that OP doesn't play \"godly christian\" music and may have a song on with words they don't like.", "I fully agree. I was trying to think of the urban equivalent, in my neighborhood some apartments will rent parking spots to other houses. If someone rented one behind my apartment and they bitched that I was smoking/listening to loud music when they had to park I would probably just laugh at them", "No they will not own it anymore, everything will be transferred to my husband.", "Well, pigs will eat just about anything.", "I will certainly take the window coverings into consideration, thanks for the suggestion!", "I am going to, but the commentator also stated some things in their response that were inaccurate and I gave clarification, such as the issues with the music and pot aren't because they can smell/hear from their house, but when driving by my house or in the pasture. If they could hear the music from their house 2 miles away I absolutely would understand and keep it down.\n\nJust as the suggestion was made that the neighbors be asked to call to give warning they're coming, and that avenue has been tried and denied by them. I have no problem at all with apologizing to my in-laws and will be doing so.", "The post you mentioned gave some suggestions, but considering that the renters do not live nearby they are not really applicable.  I'm not sure why you don't seem to agree that OP has the right to enjoy their music and house as they please without the input of people who DO NOT LIVE THERE.\n\nWhether OP was appropriate in they way they spoke to the renter is what is up for debate", "1. OP isn't ESH because they live their life in their home\n\n2. If we are ignoring that OP has a home on the land and the entire family is operating under the assumption that the land will be passed on....then shouldn't the tenant have went to the landlord to begin with instead of harassing OP?\n\n\n3. Presumably OP does, since they say the tenants are only entitled to one of the parcels\n\n4. Where'd you get that from? The parents passed on the complaint to the husband, and the husband supports OP. Where does it say how the parents feel?\n\nIf anything them passing the buck to the son just shows they're disinvolved with the land and let their son manage it.", "Yeah, and the land that the neighbors own is two miles from OP's house, so they probably wouldn't be affected by it that much.", "The fire pit was there first? They also complain about the weed when they don't have the kids with them. I can be smoking while they pull up and they complain. I can't wear noise-cancelling headphones when working with equipment or animals, kind of a big safety concern. But I'm supposed to turn it off and stop working because they don't like electronic and dance regardless of whether or not their kids are with them. Hence why if I know they're at the pasture, I close the curtains or cover up. Yet their demands are I just not do any of it, because they could be there at any time.", "Idk why you’re being downvoted cause these are all legitimate requests.", "OP is definitely an AH for threatening lease renewal on land she and her husband don’t even own.", "And clearly the majority consensus is that  constantly telling someone they have to abide by your personal religious standards is more asinine than telling them to harassing you over some weed", "Yeah, and expecting your home to be your home where you aren’t bothered by people who are renting land separate from that home is not being an asshole", ">I'm guessing\n\nThat's hypocritical, the story mentions two families and you're using that to guess about an entire community\n\nAnd the idea that you have to conform with the community you live in is plain wrong", "You seem to be completely misunderstanding what happened in this post. OP has been topless inside her own home, smoking on her own porch, and using a fire pit on her property. The neighbors are renting a field that puts them about 50 yards away from all this, and have been complaining about her and to her.\n\nYou thinks she’s an asshole for telling people off after they repeatedly harassed her?", "No, but it is her family’s property and her *home*", "Guess it's time to play some Andrew Dice Clay, then.", "You better hope they don't decide to sell that pasture to their church friends.", "No, this is the first time they talked to my ILs, all other times they spoke to me directly. My ILs are concerned about church gossip regarding the neighbors.", "In town? Probably not, but I understand that some people are that full of it.  In the country, out of sight and away from your property?  Hell no. Why would you think of doing that?", "The commenter never said OP is an AH for how they live their life. They said OP is an AH for throwing the work they did in the renters’ face like that somehow negates the time and labor the renters put into the land. It was a dick move by OP.", "maybe bc he had to embellish a bunch of shit not from the post to make them ‘legitimate’ as you say?", "I didn’t say he was a nice guy either. Amending my vote to ESH.", "She's trying to push people off land she does not own yet. my understanding is in laws own the land. She is the one threatening to kick them off after the takeover. The takeover has not occurred yet.", "Because they’re paying for the land and she doesn’t own the land. If they have a problem they need to take it up with the landowner. If she has a problem with the renters, she needs to take it up with the landowner. her threatening people she has no legal standing over is going to cause far more issues than keeping her mouth shut and waiting until she owns the land and terminating the contract", "Yes. Exactly it’s not hers. Even when the husband inherits it. It IS NOT HERS. Pretty sure if I any of us was smoking weed and being naked often our neighbours and agencies would ALSO complain. It’s the real world. Not her property.", "I would put NWA & Public Enemy on repeat.  Yes I am old", "I was thinking about Ozzy Osbourne because for people like that, he's practically Satan's Number One.\n\nDespite y'know the fact that he's Christian and literally prays before his concerts. So, actually more godly than probably most of what they listen to.", "That's a perfectly good response considering the tenants started with:\n\n>Then they started about how they're paying good money to use the pasture and paid out of pocket to make it usable.\n\nThey're the ones that need the land and approached the land owners to rent it. Whayever they're paying and whatever improvements they made are because they need it. Then they throw that at OPs face because of nudity in her own home, or music and pot on her own porch.", "Thank you! I didn’t mention why the neighbors were AHs because it was self explanatory. OP has every right to do what she wants in her home.", "That’s a funny pair of sentences, but I’m glad to hear it! I still disagree with that but not enough to fight about lol", "She’s suggesting the the neighbors should act more neighborly, because they’ve been constantly harassing her for how she behaves in and around her home.", "You can't read, stop talking. \n\n\n\nThe issues came from the renters harassing the property owners over OP. \n\n\nThey only got threatened after demanding OP obey their demands in her own home.\n\n\nAlso, if she lives on the same property as the pasture, those people harassing her are in more trouble than her, because even though they're renting, they have no right to make continuous and spurious harass campaigns as they have been. \n\n\nSo again, learn to read, then speak.", "She’s in the middle of nowhere and you expect her to change her living habits, in her own home, to cater to some entitled peeping toms?\n\nLike OP said - if they don’t want to see her naked, stop looking in her windows. I have no sympathy for anyone triggered by smelling weed *outside*. These people don’t even live on the property but want to dictate how the actual habitants of the property live their lives? Give me a break.", "It’s where she lives. Whether or not she owns it is entirely irrelevant bc the people who do own it allow her to live there & allow her to do what she does on the property. You trying to force this distinction when it doesn’t even matter is weird", "I love how you assume your husband's brother won't get an interest in the farm.", "Nah. Kick them the fuck out when your husband inherits the land. They act like shitbags because they never have consequences and hide behind religion. Fuck them.", "The tenants are AHs, OP was an AH right back. Justified or not, they both suck.", "Usually I don’t bother to read or respond to comments arguing against my comments because I’m aware that, odds are, I end up debating with someone who goes to high school, but I happened to see yours. In a civilized society, we work to cohabit peacefully. We don’t play super loud music when we know people are trying to sleep, we don’t smoke weed outside when there are other people around (I’m a HEAVY weed smoker because of severe and chronic knee pain but I have self control). Kindness is better than being snarky, I think.", "Who owns her home? Is that under the in laws as well?", "OP and spouse are NOT the property owners owners. Not of their house, nor of the pasture the neighbours are renting from OP’s husband’s parents.", "Yes. They are renting a WORKSPACE next to her home (where they’ve said they’re bringing children) and providing income to her in laws. Any person would be respectful of that, surely. As and when op actually owns the land then she can dictate to the renters where to shove their complaints. Until then she doesn’t have a leg to stand on. \n\nIdk how you can think OP is completely devoid of any responsibility to be a good neighbour to them whilst they are paying the in laws. She’s just being petty because she didn’t want them to rent out the pasture. But AS ITS NOT HER DAMN PROPERTY and therefore didn’t have a vote the in laws did it anyway.", "He won't, he has no interest in moving back to the farm or anything to do with it. Only thing he asks is that if any of his kids wind up interested that they be allowed to come out and visit for long holidays.", "[deleted]", "Nope, responding in kind after being harassed multiple times in your home does not make you an AH.\n\nThat's just something we disagree on.", "All of those are great. Also have nothing to do with living rurally on a farm? The renters don’t LIVE there. They come to work with cattle. Are you not allowed to play loud music during the day in the city? Yep. You sure are. Are you allowed to smoke on your own deck in the city? Yep. Yep you are. \n\nKindness is great…. It’s also a privilege. The renters lost that privilege when they started trying to dictate what OP does in her own home that literally doesn’t affect them at all.", "Does it matter? Whether or not she owns it it’s her home. Her legal residence. And neighbors are trying to police her morality while she resides there. As you’ve been insisting already, tenants have rights. That includes against harassment by religious neighbors.", "To obtain residents rights, you don't need to own the domicile. \n\n\nEither have legal ID with the address, stay there for a certain period of time and/or pay a certain amount, or some combination of the 3. \n\n\nThose pasture renters are harassing OP. \n\nShe's well within her rights to call the cops to start a paper trail so she can get a civil court resolution.", "My husband is inheriting it when my IL's move to live with his brother. That's in the next couple of years, they're just waiting on BIL's house to be finished.", "NTA they were being rude, disrespectful and entitled. They needed to be put in their place. Don't renew their lease once the land changes hands. They don't deserve it", "HOW DARE YOU FORCE THEIR COWS TO GET HIGH WITH YOU BY EXPOSING THOSE POOR HEIFERS TO YOUR SMOKE?!?!? Didn't you know even the tiniest WHIFF might make them grow horns abd lose their morals? \n\nDoes anyone know if this is possible? \n\nNTA btw.", "\"My ILs agreed because it was the \"right\" thing to do according to their faith...\"\n\nHmm, odd mention but ok.\n\n(Reads the rest)\n\nAh, there it is. People being nosy, pushy and entitled because their religion doesn't agree with YOUR lifestyle. Def NTA. I wouldn't even give them the possibility of renewal of the agreement. Ignore them entirely and when the day comes that you take over the property, end it right then and there. \"Take your cattle and self-righteous attitude and GTFO\"", "Well, I disagree with smoking, good or bad stuff, and with walking around nude. But its your place so you get to do what you like there. Its one of the Laws of the Medes and the Persians in this country and most places fit to live in around the world. People who try to tell others how to live on their own property deserve to have the door slammed in their faces IMHO. In my book you are very clearly NTA. And for the record I'm one of those pesky people of faith. \n\nPlus you get points for having and using a firepit, everyone should have one!", "NTA. fuck em", "NTA! This is a classic scenario. Neighbors begin to use, paid or unpaid, one's property, then gradually act as if the borrowed/rented land is their property. Stand your ground. ...then when the time is right, do not renew their lease. Consult a real estate lawyer as they may try to make a claim based on a history of use.", "YTA, for wanting to be a landlord (derogatory)", "Lots of comments here must not be from folks who own or have ever been around farms. \n\nThe entitlement you have is wild af. You don’t own anything. \n\nLaughed when I read hobby farm. Laughed even harder when I read OP is wanting a cat sanctuary.\n\nYou will lose this land. Bet.", "Had to re-read this a few times. \n\nHobby farm?!? Hahaha! \n\nI wouldn’t threaten those folks with things you can’t possibly enforce. You don’t own the land. \n\nSmoke all the dope you want in the nude. Fire away, homie. That’s your right. \n\nShould be careful, though. If the folks renting it are true farmers, your life will be hell. You don’t want that. \n\nStop with the entitlement. Nobody has the time or patience to deal with that shit.", "YTA - you are super entitled", "People are way too prudish about nudity. You were doing your thing in your own house. It's not like you and your husband were boinking on the front porch in broad daylight. NTA.", "YTA to your in-laws. You're telling their lessors that, once they're dead, you're not gonna do what your in-laws say is the right thing?   Don't run your mouth about what you'll do with your living in-laws land once they're dead. It's gross and greedy.\n\nIf I heard my kid or their wife with my kids support saying that to someone, the odds of me selling one-third of the pasture land or changing my will so they get it goes up.", "You handled it perfectly. Used logic and common sense. Course when people throw religion into it, common sense and logic don't add up to much, so your point probably did not get across to them. Applogise to your IL for having to deal with the renters, but you don't need to apologise to the renters or change your ways.", "ESH - your both acting like AHs and you each have different leverage, you likely will own the land in a few years (weird flex waiting for the ILS to die but you do you) but they are established in the community, small town life is very different given the relationships you have with your neighbours. Your ILs are right to be worried, they know how the town functions.", "Nta. \n\nBut your hubs should work with them on where they may be able to create a new entrance.  That would solve a lot.\n\nIt would also make th ils happy you compromised.", "NTA., but you will have to abide by your inlaws' wishes within reason. You do have certain tenants rights even though they're your inlaws and you're presumably not paying them, and conversely they are your landlords and can make certain requirements for continuing to use their house.\n\nOn the issue of nudity, in some jursidictions you can be found guilty of indecent exposure inside your own house if you don't take reasonable measures for people outside your house to see you. Your inlaws have created an easement for outsiders to pass by your house on their way to a pasture they have contractual rights to, and they can see you naked in your house when they pass by, so my advice to you is invest in either a bathrobe or curtains.\n\nIf your area is under a burn ban during this hot, dry summer, the pasture renters may have a point about your fire pit, and could report you to the fire marshall. Even if a burn ban doesn't apply, if your fire pit did set fire to the pasture they are renting, they could conceivably sue you for the loss of the use of the pasture, especially if they could not find another pasture to rent this late in the season, the loss of money for improvements to the pasture, and the loss of any cattle by the fire.\n\nIf pot smoking is legal in your jurisdiction, the pasture renters have no right to complain about you smoking it in your residence, including on your porch.\n\nThe pasture renters have no right to complain about the music you play, the sound from your music is not crossing your property and onto someone else's at a decibel level that would constitute a noise violation, and they have no right to expect to be protected from sound as they use an easement through private property.\n\nBut in the end, while your inlaws are still living, it comes down to what rules your inlaws, your landlord, want to enforce with you. They would be within their rights to make the house you live in a nonsmoking house, with a reasonable notice period. They could prohibit the use of the fire pit immediately if they wanted to. And they could require that you keep the curtains drawn on the side of the house that faces the easement when you are naked.", "We've invaded your privacy and didn't like it. Please stop doing things in your own private residence that I don't like.... \n\nI would have just told them to be happy I bothered to put clothes on before answering the door.... Also that generally any complaint about my behavior makes me so much less likely to actually do what they want", "NTA\nAs for the apology, I think it might benefit y’all to apologize to your In-Laws for HOW you said it, but you don’t need to defend WHAT you said; the leasers should better understand what is and (more importantly) is not up to them to decide.", "NTA, probably easier to just not renew with them honestly. You warned them, and they tried to go and tattle on you. They seem like too much effort to deal with, and it will only get messier when you guys actually get ownership.", "NTA\nLove the line about people of faith!", "INFO: How long have they been renting pasture from the in-laws?", "INFO:  What exactly is this faith that your in-laws profess that requires them to fuck over their own child for money?", "Nope, sounds like you handled it exactly as you should. \n\nNTA", "NTA - \n\nThere's no way I'd re-rent the pasture to them.  The first complaint from them and it would have been over.   \n\nWarning them when you have no real power is kinda weak though.  What happens if the ILS last another 10-20 years?", "Initially I was going to say yes, TA. You're literally \"(land)lording\" your potential power over them.\n\nHOWEVER, they're busybodies who've overstepped their bounds, and trying to police your behavior and quiet enjoyment of your land makes you NTA, and them fully TA.", "NTA. I wouldn’t continue to rent to them either.", "NTA you have every right to do what you want in and around your own home. They want to impose the rules of their own faith on you and are mad you aren't following them. If they don't like it, then they shouldn't look your way.", "NTA your land, home... you do what you want. They don't own the land you aren't on the pasture they are renting.", "the solution here is simple, they should have less animals or more pasture of their own", "NTA but close your curtains and be sure your music isn’t too loud depending on the time.", "NTA", "At first, when I read the title. I immediately thought, YTA. Then I read the whole post.\nI'm going with NTA. They seem really self-important. You should be able to do whatever you want on your own land.", "Well, they can try to convince the parents, those people are down right nasty!!", "NTA.  They want to keep renting the pasture, they need to not be jerks.  In other words, your pasture your rules.  They are welcome to not rent from you, and figure it out themselves.", "NTA", "NTA, like at all, not even remotely. In fact you sound awesome.\n\nScrew these nosy tenants.", "NTA. Don't apologize. They're being entitled a holes. You did the right thing.", "NTA.  They seem to be butting into your personal life too much.", "NTA. fug'em", "NTA\n\nYou have every right to walk around in whatever you desire in your own home.  They are renting the pasture, not the road, not the house, not your yard.  The pasture.  That is all.  \n\nYou were planning to use that pasture when the neighbor approached your ILs, and I see both sides.  \n\nMeanwhile, they are tenants.  Any time the lease is up for renewal, your ILs and husband have the option to end the lease.  They need to realize that.  \n\nBesides, how often are they there?  If cattle.... well, most people I know with cattle are only there to make sure the cattle have food and water and all is well, then go on to the next chore!  They shouldn't be spending lots of time with their children nearby.\n\nBesides, doesn't the Bible say that God made man in his own image?  So why are they so badly wanting you to cover up?", "NTA and it's kind of stupid of them to contact the In Laws because\n\n 1: it's a temporary solution for them to have their way\n\nAnd 2: once your husband actually DOES take over the lease and the in laws don't have a say, what are they going to do? They'll have just bitten the hand that fed them and all for a few moments of self righteousness.", "Get an attorney now as I promise they will squat if you don't. Be proactive.", "Fuck ‘em, NTA.", "NTA\n\nVery entitled people", "The only way I would say **soft** Y T A would be if it blew back onto your inlaws and caused them any significant issues.", "NTA ...but don't count your chickens before they've hatched.  Is the land already signed over to your husband? If not, I would tread lightly around the in-laws until it's a done deal.", "NTA. Anyone who complains about what they see through your windows clearly is putting their nose where it doesn't belong!", "I'm team ESH. The tenants have some unreasonable requests, however, I disagree with the way OP escalated the situation and tried to flex.\n\nOP, if you're really wanting to live the farm life, you'll do better by not alienating your neighbours and fellow farmers. You can say you disagree without trying to play a trump card.", "NTA - Definitely check any lease agreements and make sure you and your husband are protected from any squatter's rights or any other property disputes.\n\nThat said, there's no harm in a fake apology. But be sure to include that you're not changing your behavior, just apologizing for the discussion escalating to where it did. It keeps the peace, and clearly informs them of what to expect from their neighbors (you) who are doing nothing wrong. Then, when the time comes, go ahead and evict them from your land without warning at your earliest convenience. No more threats or warnings—they make you either predictable or weak.", "Damn. I was ready to say you were the ass, based off just the title.\n\nBut they have the nerve to tell you what to do in your own space, on your own time??\n\nFuck them. Sounds like you tried your best. 🤷‍♂️", "NTA these people are ridiculously entitled and rude af!!!!", "I’d say NTA for the most part, when you are in your home, you can do whatever the hell you want, however the whole, when I own this farm you better watch out, kinda seems like a little bit of entitlement, and counting your eggs before they hatch kind of deal.", "I like to sleep naked and I walk around my house naked all the time. I also smoke weed in my garage or backyard. I have a medical Marijuana license so i can legally enjoy my weed. Plus I love my local dispensary store because it smells amazing and has so many different things to try. \nMy neighbors also walk around naked and sometimes join me in smoking. If one of us catches a glimpse of the other being naked than we mind are own business and say nothing. All my neighbors are older couples so we just enjoy being conformable in our own home. No one is looking for a show. Please do not apologize or renew their lease. You did nothing wrong OP. You were being conformable in your own home when they went onto your property and invaded your privacy by looking into your house. There is nothing to apologize for and you absolutely weren't trying to \"corrupt\" their children. Also your neighbors children are farm children so they have definitely watched animals fucking and giving birth. I doubt seeing a naked woman is going to turn them into sex maniacs. NTA and I'm super petty, so I would put Satanic images all over my house and have an outdoor séance to summon \"corrupting\" spirits. But that's just me and I enjoy being petty.", "Megan Thee Stallion, girls in the hood- play it loud.", "NTA. Early Donna summer", "NTA - Please be aware that People of Faith can be really creepy these days. \nThese folks in particular are shit stirrers.\nFrankly due to that? I'd talk to the inlaws about ending their lease and proceeding with whatever your plans were for that area.", "Even if it's not legal to smoke weed, it's *none of the renter's f'ing business what OP does in and around her own home*", "This. \n\nIf you're going to complain about how things smell on a farm you probably shouldn't be a farmer.", "I'm wondering how they repaired a pasture. I grew up on a farm and we had some pastures. I never heard anyone refer to repairing a pasture. People fixed fence and sprayed thistles. No one repaired a pasture. I go back and forth wondering if this is fake because it isn't worded like anyone would word it if they farmed. \n\nUnless the son purchases the land the ILs will own it until both are gone. They can continue to rent to whomever they choose, including these people the OP doesn't like. Even if the son rents part of the land the ILs can rent part of it to someone else. It's their decision, just like the current arrangement was their decision. I would be most concerned about offending the ILs. If they decide that someone running around naked isn't what they want on their land they could rent the whole thing to someone else. Until the son owns the land what the OP thinks doesn't matter. She can dislike the other rents and they can dislike her. In the end the decisions will be made by her ILs", "Exactly - seems like the renters are thinking of the land as their own at this point, and OP set them straight on that. NTA.", "NTA, I can't stand bigotry, but be careful. They have the same faith as your IL. They will try to turn them against you. Maybe talk to your IL how it makes you uncomfortable that they stated that they look into your windows...", "Exactly. They want Op to apologize. These people can't tolerate not having the last word. That's why they went to the in laws. DO NOT APOLOGIZE.", "You mean the faith built on hypocrisy and condescension? Sounds like they're being perfect followers to me.", "Yep! Husband already looked into that in case things went south with the arrangement and wouldn't want to renew. Which I think he's already on that path after all of this and them calling the sheriff on him and his friends who were fishing at the pond. Clear across the farm. Nowhere near the rented pasture.", "That's how it was for us. We had to give our neighbor a year notice that we would be taking over our farm again", ">What nerve!  They're   \n>  \n>leasin a pasture and want to have input into what happens around it?  That's when you bring out the thong bikini and lay out.  With a pitcher of wine, music blasting, and roaches nearby.\n\nCorrect, however it does not belong to her or her husband yet and she's claiming ownership of something she does not own.  She should have been more diplomatic about the situation.", "Why should someone who is just walking/driving past my house get to complain about my music? If they were complaining about being able to hear it from their own house, that would make sense. But that isn’t what’s happening.", "My guess is the husband/father enjoys his peeping, but the kids tattled to Mommy and therefore he had to act outraged.", "Yeah. I predict the rental agreement will be cancelled. I would not even warn these neighbors. They will find out the hard way.", "Instantly went to the “Schitt’s Creek” episode in the last season.", "Also is weed even legal where she lives? She really pisses this neighbor off and he could potentially ruin her life.", "New comment from OP says these renters called the sheriff about her husband fishing on his own land (fine, on his parents land), not the leased land. So the renters sound a bit unhinged in general. Uncertain she would ever be able to make them happy.", "Dude gtfo with your whack ass opinion. Oh god how dare she be naked in her own house and smoke weed.", "She nor her husband own the land, so they can't break the lease.", "I too would be intolerant of people peering into my home, the actions of the nosy or perverted. How do you think that's ok behavior.", "Totally. ILs sound alive and healthy, a lot could happen. Who knows, they might change their will and leave everything to the church. OP might divorce their son. It's presumptuous of OP to assume she'll be the Farm Queen and oust her subjects. \n\nESH for OP and the pasture renters (for not minding their own biz)\n\nNTA for ILs and husband.", "The voice of reason!", "I don't think the OP wants to be a landlord.  It seems to be the inlaws.  Of it works, they might consider continuing to be landlords, but I don't think it will work.", "Dude...OP and her husband are clearly part of the family who own and live on the land and it's very reasonable for them to be considered by all but the law to be \"the owners\" as such. Let's say a husband and wife live in a house that's registered in the wife's name. Is the husband just a houseguest, according to your philosophy? \n\n\"You better be nice to me or else\" is appropriate in **all** voluntary relationships where \"else\" means ending the relationship. No one has the right to rent your land, be your boy/girlfriend, borrow your things, et cetera. Those are privileges they earn by — among other things — treating you with respect.\n\nThe only party outside of their lane in this case is the neighbor family. They have not only acted rudely but illegally. OP is entirely justified to draw a hard line: If you don't like what our family does on the land we own, this is not the pasture for you. Move elsewhere.", ">This sub I swear…..\n\nFull of children", "Sorry, but prevailing property law in a majority of states is that improvements to leasehold are the property of the landowner unless otherwise specified in the lease. This rule is sometimes broken in the case of new structures (e.g., if renters built a shed) in which case they *might* be able to take landowners to court for compensation *if* landowner agreed to the construction ex ante. If this is a commercial lease, since it's a pasture, they're out of luck entirely. \n\nMore than likely that OP's in-laws already own whatever improvements neighbors made and OP's husband, if indeed his parents' documented heir & beneficiary, is in fact quite literally entitled to them. Lmao.", "They rented A PASTURE, not OP’s house! They have no right to tell OP how to live in their house or on their non-leased acreage.", "I'm glad I'm not the only one that was laughing. And brother in law doesn't care about any of it either, just give it all to OP and her husband since they fixed some fence and will let his kids come visit someday. Wonder who's going to pay the taxes on this gifted hobby farm? Be better off selling weed instead of smoking it.", "It's not husband's property YET.", "Nah its not waiting for ILs to die, they've already started the process to turn over ownership to my husband so the farm is completely his when they move in with BIL in the next 1-2 years.", "3 months.", "Nothing if they last another 10-20 years. They've already started the process of turning the farm over to my husband's ownership. When they move in the next 1-2 years (barring unforeseen obstacles) the farm will belong solely to my husband.", "I don't think it's the volume but the \"ungodliness\" of the music they don't like.", "Damn! I love this analogy!", "Agreed, and I would definitely apologize to the inlaws for escalating the situation. They're now dealing with pissy tenants because of this little spat.", "Exactly. If I hear someone describe themselves as a “god fearing” whatever, my trust in them generally evaporates.", "I misread that as condensation for a second and got  **so** confused, lol.", "getting the law involved for fishing? definitely NTA, hope you can sever ties with these people soon", "They called the Sherrif on him for.... fishing on his own damn land??!", "calling the sheriff is so insane they need to go", "Should see about getting your husband's name on the property now, can always let the in-laws live there until they are ready to move.", "Oh true, you're absolutely right. I'd strikethrough that part if I could figure it out on mobile.", "That made me laugh. Thank you.", "The help part could be an issue and my ILs are more worried about their church circles while they're still here. At the same time, my husband is from here, still has friends here that are regular visitors and have had their own issues with the guy as well. \n\nIts honestly an interesting set-up. There's two main religions here, Christians and Mennonites. They have separate churches and do things separately but run some of the same worship circles. Like there's a divide in some aspects that neither side gets along, but then they do on other things.", "Didn't even think of that...", "That's normal. \"You made these potentially erroneous assumptions, what if you made these assumptions? Your conclusion would be wildly different. You should confirm your assumptions are correct.\"\n\nYou should reevaluate your comment.", "They are trying to bully you and may use their church, don't put up with it but be prepared for them to try and weaponise the congregation", "For real, the OP sounds annoying as hell. Neighbors sound less annoying but still quite annoying. ESH", "The \"just wait until my husband has it\" is what did it for me.", "Lmao people trying to act like your neighbors can dictate what you wear in your own home just because they built part of a fence. Reddit is so wild", "Where did I say improvements wouldn’t still be the landowners property? These type of transactions happen all the time in farming. The tenant is almost always getting the raw end of the deal. That’s why OP dismissing the money the tenant spent makes her an asshole too\n\nAnd beneficiary means nothing in this case. This is between the current landlord and tenant. Judging from OP’s comments and asking if she should apologize to the in-laws leads me to believe the IL’s have sided with the tenant", "Right, and the OP is a tenant as well. It's common decency to play nice with others. They are essentially neighbors with a landlord in common. I own acreage for my cattle, but I also board my horse in A PASTURE (apparently needs to be in all caps) and my teen rides in their arena. Why would I NOT be like \"YO, put on a robe, I'm paying rent here and your tatas are hanging out every time I turn around?\" That's a REASONABLE request.", "People don't tend to stare at their feet when they're walking, they look around. If I'm walking down the street, I don't expect to see someone naked. Do you expect people to walk around staring at the floor? What about driving, do you think it's a good idea to stare at the foot well? People observe their surroundings, it's normal human behaviour. If you know that your windows are facing an access road (i.e., there's likely to be people there) and you stand in front of one naked, don't be surprised if you offend someone.\n\nIt's not about what someone can do in their own home (curtains so exist you know) it's about forcing their nudity on someone else. How is that entitled? \n\nI think you're the entitled one, just because it's your home you don't get to walk around naked with the curtains open knowing children might see.\n\nThey're renting the land which includes use of an access road, which goes by the house. So what if they don't rent the land the house is on? They have every right to use it without expecting their children to see nudity.\n\nI'm wondering whether this is a cultural thing, I'm from Europe and I don't think my personal freedoms extend as far as potentially showing a child my naked body, regardless of the context. It seems really weird to me that people would be defending OP but most seem to be on their side.", "unless ILs plan to undercut their own child to please the renters, I don't see any situation where OP's husband can't make the rules. In which case while OP and husband can't do anything about it legally, they can make the surrounding area that is their property so undesirable, that the renters cut their losses.\n\nFor example, add a pig pen near the border of their property and the neighbors, but still firmly on their property line. My uncle had a farm and let me tell you, I'd barely survive a day with the smell they produce", "That is not my concern. However the OP makes a claim that the other person acts self important. I do not find that credible.", "\"Sorry, but they have zero business complaining about OP smoking the green\"\n\nHard no.", "Oh ok I couldn’t tell from the post if this has been some kind of long term arrangement", "that’s their whole point.", ">sture and paid out of pocket to make it usable. I stopped them there and told them they didn't do al\n\nYeah. I never use businesses that advertise with that little jesus fish. I do not trust them at all.", "I almost snap my eyestalks when people say that crap", "For fishing on his own property!", "Yes, we chalked it up to maybe they somehow did not see my husband's very distinguishable truck parked there and only saw the unknown vehicles.", "They’re allowed to do what they like with their property for the income for 2 years.\n\nUnless OP and her husband would compensate them similarly, then they should have been given the right of first refusal.", "Talk to a lawyer first! There are differences in taxes when property is given to someone vs inheriting it. Sometimes big differences.", "No! \n\nIf not done right this could add a ton of extra tax once fully inherited. Check with a lawyer first. This is too expensive a transaction to mess up.", "If you're after a giggle about Mennonites mixing with others in a small town, check out Letterkenny.\n\nHere's an introduction: https://www.youtube.com/watch?v=7TcuPpgmoNo&ab_channel=Crave\n\nAnd a little more: https://www.youtube.com/watch?v=Xc1Zip9Z-pc&t=5s&ab_channel=LetterkennyProblems", "heres a safe assumption- people typically know their families better than strangers on the internet do. take a lap", "Neighbour's perving on OP in her own home and impeding her quiet enjoyment, the sense of entitlement is astounding.", "Yeah, that's an asshole take, but call her an asshole on that, not the landlord issue.", ">My ILs agreed because it was the \"right\" thing to do according to their faith and it'd generate a bit more income for them\n\nDoesn't sound like they're doing it for the income.", "Yes, he already had his cattle whereas our endeavor is much more time-consuming since it required repairing the fence, had to install a new water well for a water tank, installing new buildings, and since it's going to be a sanctuary of sorts, a whole mess of other time-consuming aspects legal and otherwise. Being more motivated had nothing to do with it.", "\"didn't even bill the actual landlord for\" -- implication that this would be appropriate suggests you think tenant is owed some benefit of their improvement outside of whatever it provided for them during the lifespan of the lease. They aren't. They weren't being nice; they never had the right to bill the LL in the first place. That door closed when they (more than likely) signed a contract without that special provision.\n\nWhen it comes to commercial landlords and major landowners I don't doubt you are correct. But that isn't the case here. This isn't some exploitative arrangement. It's a contract entered into willingly between two parties on equal footing. The neighbors are themselves nearby landowners. That isn't the \"raw end of the deal\"; it's the neighbor making a financial calculation to incur a business cost to raise his for-profit cattle on someone else's land, same as the rent. That's not a favor, it's a quid pro quo.\n\nAnd regardless: the money the tenant spent does not give them the right to interfere with the landowner's quiet enjoyment of their own property, and especially not to commit a felony -- like taking nude pictures of a person through a window.\n\n\\[As a final note, edit in response to your untimely edit: Reference to OP's husband as legal beneficiary is in direct response to your snarky remark that OP and husband are acting \"entitled\" to those improvements; funny enough, from the perspective of one area of the law, they indeed are.\\]", "The house isn’t on the pasture land though. And tenants still have the legal right to be naked in their leased apartment/room/house as long as they are the sole occupants and everyone living in the dwelling agrees. ETA: and their cows don’t graze in OP’s house.", "I don’t stare at my feet or look into peoples windows because I’m not an idiot or a creep. I look where I’m going like normal people do. You want to justify being a creep but no, looking in peoples windows is not normal human behavior.", "At this time, with a signed lease, I don't think the IL's will get into a spat with the renters, especially since they run in the same church/social circles.\n\nI grew up on a farm. Hobby farmers who do something like the pig pen are the ones who end up losing out. It's not going to bother most farmers, will cost the hobby farmers in both time and money, and will inconvenience the hobby farmers most since. Not to mention of their pigs get loose and cause damage to the leased property.\n\nFarmers also tend to not be openly hostile to each other because they know that one day, they'll need their neighbour to help them out.", "Sad part is most of it is electronica and dance so not many words or bands like Nightwish. \n\nThough there is something oddly wholesome about playing In This Moment or B.O.T.D.F. quietly in the house at night and your 77y/o ILs come up for dinner and start wiggle dancing or making rock hands.", "Farm rave? Farm rave!", "Time for some Wu Tang.\n\nC.R.E.A.M.  \\~ *Dollar dollar bill, y'all*", "There is a song called H.W.C. NSFW or kids under 15. Play it on the way home! Play this outside!", "Want go old school? Play some Warlock. A woman belting out some demonesque metal ought to set them over the edge.", "Need some Zeal and Ardor - blood in the river.\n\n“A good lord is a dark one\nA good lord is the one that brings the fire\nThe riverbed will run red with the blood of the saints and the blood of the holy (Is the one that brings the fire)”", ">. If someone rented one behind my apartment and they bitched that I was smoking/listening to loud music\n\nThat's different . When you park a car, you usually leave. However, if  someone had to stay and listen to smoking and loud music,  You would hear complaints. The comparison  would be if someone rented an office space and your next door neighbor kept smoking and walking around naked.", "Are you in the US? Double check with a lawyer that you don’t get stuck with a tax bill if you haven’t already. If you have, ignore me.", "That in writing? What’s to stop them from insisting it’s “just like yours” while maintaining ownership once they move, just to ensure these church pals aren’t inconvenienced?", "They go through bone like butter, as the story goes.", "Deflecting and changing the subject. Thanks for confirming that you agree with me on my point.\n\nI agree with your deflection as well, but you didn't have to puff your feathers at me", "Pfft, not me. I'd get those old fashioned white pull down shades, and a really powerful projection lamp, and give them a shadow puppet porn show for the ages, while blasting the song Silhouettes. Probably the version by the Nylons, because I'm old but not THAT old.", "I put [this](https://www.amazon.com/gp/product/B000H5XTKG/) (with [this](https://www.amazon.com/gp/product/B00433SIQI/)) on my master bedroom window so I'd not have to think twice if anyone could see me when they shouldn't.  Looks kind of like a 1-way mirror from the outside.", "I don't see you being argumentative at all, you're just answering everything straight forward. \n\nI'd be rid of this nuisance neighbor as soon as I was able. They've got some nerve trying to tell you how to live on your own property.", "Clean up her act? Excuse me but I consider walking around naked in your own home and smoking on your own porch and listening to music in your own home to be fairly reasonable especially in a rural setting where the neighbors can't see or hear you. In order to do that they have to be actively hanging around. If I were moving livestock I would be focusing on tne job not what my neighbour's were doing, in their own home. I imagine it's either legal or decriminilised where OP is", "Maybe you can link to your pearl supplier", "Literally says more income for them. Would love to hear the in-laws and tenants perspective", "You are getting the land one day so you will be the one gaining the equity for ANY work done. You dismissing the money he has invested because you also spent money makes you an AH. Honestly they sound like much bigger AHs than you though. I’m sorry if you feel I am just gunning for you. As a farmer who has lost money improving other people’s property only to get kicked off after it just strikes a chord with me", "It would totally be appropriate to bill a landlord for work done! More often than not that is the case. Of course, that would have to be agreed upon ahead of time. I took OP’s post to mean that they did it on their own outside of the lease, or maybe it was a condition of the lease. There is not enough information to really discuss any of this.\n\nMy point is we know the tenant spent money to improve this property. OP will directly benefit from the equity down the road. She dismissed the tenants time and money and that’s not right even if they are rude prudes.\n\n\nThe prude neighbors are assholes that goes without saying. But her response sucked so I stick by my judgment", "Granted it's been a minute since I've dealt with pigs, but they'll probably be fine then. I know the stench travels pretty far but that's been where people were really raising hogs.", "You don't have to stare in someone's window to catch a glimpse in. Yeah people look where they're going but they also look around them, people don't walk around with their head fixated in one spot. So you're telling me you've never caught a glimpse into a house you're passing, you don't observe your surroundings? Peripheral vision is a thing, so depending on how close the house is to the acces road (not mentioned) you don't even have to be looking directly into the house to catch a glimpse. If your eyes sense movement it's normal to look, it's like a knee-jerk reaction.\n\nOP never mentioned they were staring into the windows either so you're jumping to conclusions here.\n\n\"You just want to justify being a creep\" yeah, no. Don't try and tell me what my intentions are. But I'll humour you for a moment. Let's assume the complainant or their children are purposefully looking into OP's window to be creepy. Then they complain that OP is walking around naked, why would they be complaining about that if they're a creep? Complaining lowers the possibility of doing it again, since they had no way of knowing how OP would react, it's possible that OP could've reacted by closing the curtains. Do you see why what your suggesting is illogical?\n\nI'm going to agree to disagree if you're unable to debate this without insulting me or thinking about the implications of what you're saying.\n\nIf you want to walk in front of uncovered windows naked knowing a child could be outside and might see, that's none of my business. But it could well become the business of the police, since that could be considered indecent exposure.", "fair enough, my personal experience with pig pens though is I never want to be near one again, I can't handle the smell lol", "I am very much seconding the RATM suggestion then.", "I'm not a fan of Electric or Nightwish music, but my husband loves those. I only ask him to turn it off if I have a migraine.", "This sounds genuinely SO nice. I’m envious of your farm situation! I’m stuck in a city between two airbnbs.", "Really piss them off, play Styper and the Newsboys!", "If you're up for feeling petty, try Mindless Self Indulgence or Combichrist", "Ghost. DEFINITELY Ghost. Specifically “Year Zero”, where everyone chants “Hail Satan”, and the song begins with a recitation of Demonic names: Belial, Behemoth, Beelzebub //Asmodeus, Satanas, Lucifer", "AC/DC's \"Highway to Hell\" needs to be high on the play list.", "Or Sir- Mix- a- Lot.", "Little Boy Blue -\r  \nHe needed the money!", "Nah forget that, full aural assault. Behemoth, Children of Bodom, Cradle of Filth, Dillinger Escape Plan, some Slipknot for good measure.", "Oh dang!! Bringing out the big guns!!!", "Nooo...Dennis Leary 🤙", "Marilyn manson", "I play Marilyn Manson for people like this. It usually works too.", "I think a good mix of vintage hip hop a la NWA, vintage heavy metal a la Ozzy Osborne, and some newer satanic death metal would do the trick. Maybe throw in some Jethro Tull numbers focused on Christian hypocrisy for added spice.", "Bless you for speaking reason because I’m sitting here like “Grow a cannabis plant the size of a couch and smoke it whilst doing invented, but seemingly satanic rituals.”", "Oh man. That'd be the last time they would ever see me.", "Make sure to take the hair and teeth out, you don't want to go sieving through pig shit now do ya?", "Lol funny but that would push being glimpsed nude in my house from legal to illegal. It's not considered indecent exposure if someone sees you nude in your yard or window on private property so long as there's no intent to cause arousal.", "You're focusing on two words and ignoring the rest of the sentence.", "I can admit that dismissing the money and work he invested was wrong, and I probably wouldn't have done so if he hadn't had the attitude that he did everything for it, because, well, he hadn't. His cows have water and the well houses are protected from damage via cattle (seen what those buggers do to trees and well houses!) because of the work we did, which is going to save him money in the long run. At the very least I will apologize to him for that, and will definitely be apologizing to my ILs for them getting involved.\n\nI totally get why it struck a chord with you and that does suck, and I'm sorry that happened to you. We did try our best to go into this with an open mind when our known plan was pulled out from under us to see if it could work in the long-term with continuing a lease with them. But, I was also pushing the 3k character mark so only mentioned my dealings with them. My husband has had his issues as well, such as the renters calling the sheriff on my husband and his friends for trespassing while hubby & friends were fishing at our pond clear across the farm and nowhere near the rented pasture. My husband's truck is preeetttyy distinguishable.", "I hear that if you say literally enough, your garbage opinion becomes fact.", "I concur!!! I hated it growing up and still do! Lol", "RATM \"fuck you, I wont do what you tell me\"", "I'm with you on the \"old\" part, but I'd add some Lords of Acid to spice it up a bit.", "Warren Zevon \"Mr. Bad example\"", "Time for OP to start blaring Ram Ranch", "I didn't know that. Time to play some Ozzy. I usually go with van Halen running with the devil.  Highway to hell. 🤪", "Almost every Ghost fan I know (myself included) grew up around these kinds of \"people of faith,\" lol. It's satisfying to belt that shit out.", "Cake - Satan Is My Motor or Sheep Go To Heaven", "Love that one!", "Jack and Jill went up the hill\n\nBoth with a buck and a quarter.\n\nJill came down with two-fifty.", "I bet they'd really enjoy \"The Heretic Anthem\" and \"Surfacing.\"  (two of my faves to belt out)", "Being more diplomatic doesn't mean you have to be nice. Diplomacy is as much of a weapon as a sword, tank or nuke. Mongols won plenty of battles with some right words in the right spot.\n\nNext time they complain, explain that their complaints are taking up administrative time that will impact the leasing price. Just how the economy is. Let's see. Five complaints, lease has to go up $X dollars. Sorry friend. Wish I help you out, but customer is always right. Six complaints? Welp, now it's $Y come renewal. If you renew.\n\nTalk over with husband first. But make it clear the complaints need to stop, or you need to compensated for your time. Time listening to useless complaints is wasting your profitable time.\n\nOTOH, folks can complain to me at $100/per all day long and I'd be happy to take their cash. Probably want to have husband deliver the news on the new pricing structure. Make sure in-laws buy in as well.\n\nBut make it clear to all parties. Either you get no complaints, or you get paid. You don't care which they chose, but it's going to be one of the two.", "From experience, it's not uncommon for farm succession plans to take years. Even if its all planned out and agreed to, the older generation is often very, very slow to completely let go. That's the reason I'd suggest being diplomatic. It could very well stretch out longer than you anticipate.", "So could they back out of the plan?  Has anything been signed?", "…you forgot “in the nude”. Gotta do the seemingly Satanic rituals in the nude for full effect.", "If his parents own the land they can veto what their son decides.  Do you not understand how land ownership works? 🤣🤣🤣\n\nIf OP continues to be obnoxious they may change their minds on inheritance. No one is owed an inheritance as much as you would like to fantasize they are. 🤣🤣🤣🤣", "It’s not irrelevant as OP made it relevant when they threw it in the tenants faces or did you skim over that part", "Is that why people keep repeating that land ownership doesn’t matter? Finally it makes sense!", "Word!", "If those church people keep harassing the op, they will need Lawyers, Guns and Money.", "Haha yes, maybe Eeyore too cuz a song can never have too many \"fuuuuuck\" references", "I love how you assume it’s an assumption.", "She didn’t say she owned it to the tenants, did she? no, she threw reality into their faces, & they deserved it", "You don't need to own land to have rights. Which applies to the op and the folks who lease the pasture. So as long as op isn't breaking any laws, and the only one I could see being broken is the weed, but we don't know where she lives. Everything else listed isn't against the law and I'm sure if it was breaking city/town ordinances, the lessors would have called the cops by now.", "Actually, my state's law is that nude sunbathing on private property or being glimpsed nude through a window on private property is legal so long as it is not done with the intent to cause arousal. And I sure as hell am not standing at the window putting on a show while I do household chores.", "Also they’re asking her not to do two illegal (mostly illegal throughout the world) acts (smoking weed and public decency) because news flash the laws don’t stop applying to you because you’re in a house you live in. Like wow so mean of them how dare they.", "Weed is legal for recreational use, and being seen nude through your window on private property is also legal. It becomes indecency and illegal if nudity is exhibited with the intent to cause arousal.", "A huge portion of America has legalized weed, & playing music loud that someone doesn’t like for religious reasons actually isn’t illegal anywhere, they’re out in the boonies, no one is getting noise citations out in the boonies, moron", "I could see them doubling down with stuff about the \"ravages of lust\" and what not.", "Loud Christian’s always act the craziest and most judgemental", "Unfortunately, they are acting like most judgmental religious jerks. They think others within their purview need to follow their religious rules. I loved this phrase because most judgmental religious people don't even live up to their own rules that they cherry-pick.", "You’re on your own property. Sunbath nude. Don’t forget the sunscreen.", "The problem is that the house belongs to the in-laws. The in-laws choose the renters and until the husband owns the property it will continue to be the choice of the in-laws. All of the older farmers, where I grew up, kept their land until they died. They might rent to their kids and grandkids but they owned it and decided who would rent it. My grandmother owned her property until she died at 88. My dad died first and then my mom owned their property until she died at 83. My other grandparent's property is still in a family trust and is still rented to various people. \n\nIf the in-laws continue to choose to rent to the obnoxious people then they will.", "I understand this reference. Poor girl, that story is sad af.", "The process has already been started.", "The have nots have found the thread.", "OP needs to be absolutely positive her in laws aren’t pissed. \n\nIf they’re on the neighbors side, they could easily write a long lease that would transfer *with* ownership..", "Lolol. All the reasonable people are downvoted to hell, eevryone that thinks it’s cool that OP is being a YTA are the top comments. This sub I swear…..", "Neither side has a monopoly on bigotry and hypocrisy. Yes, a huge number of Christians are hypocrites. And a huge number of people talk a good game about racism, but just happen to live in the whitest suburb available, and send their kids to the whitest school they can get them into. And don't get me started on all the people who are sooo concerned about the environment. Most of them don't live any differently from the rest of us, burning fossil fuel like there's no tomorrow. Hypocrisy is pretty much universal, but it is usually only pointed out in right wing Christians.", "Is he inheriting it or going to rent it? There is a huge difference. Most farmers leave their land to all of their kids equally, usually meaning the one who remains to farm is renting part of the land from siblings. You don't inherit until the owner dies. You can purchase sooner than that or you can rent sooner than that. If they go to live with your BIL I don't see them disinheriting him and giving it all to your husband.", "I'm beginning to more clearly see why the neighbors aren't happy.\n\nYou do realize that the entire point of a barn cat is for it to be loose to hunt vermin in the area, right? Are you trying to imply that you'll be \"rescuing\" whatever cats happen to wander by simply by virtue of them being loose? Are you also intending to ignore the fact that a large congregation of cats like this will result in more predators being drawn to the area and causing more issues for neighbors?", "You may be on the accounts but that is not the same as owning. Why would they just sign over ownership to your husband? Why cut the other son out entirely. Most people leave everything to their kids equally and then it is either sold or the one who stays on the farm rents the share the other siblings inherited. I can't see them completely cutting out the son who is going to take them in. He may not want to farm but they won't financially cut him out.", "This person understands farming.", "So is indecent exposure, which is what it is when you make yourself visible while nude. knowing the area is trafficked makes it an act of intent.", "Hell no. The in laws can pull out on the plans at any giving moment. Knowing what it takes to live on farm land, among other things that often is being able to cooperate with neighbours because you need each other, this is red flag to hand it over to OP and her husband. \n\nIt’s also disrespectful towards the in laws because it’s their land and they have made a decision to let their neighbour use the land. OP can’t go around flexing like she has any say in the matter.", "NTA, these people should mind their own business but OP should be careful about pissing off her in laws. She should not don't count her chickens before they hatch.", "Same", "He's inheriting it, they're doing an early inheritance. My BIL wants nothing to do with the farm and has already said he's fine with my husband having it all.", "Just say you prayed and the *Lord All Mighty* told you to smoke weed naked and commune with the land He had blessed you with.", "You're bizarrely confident about what these people you've never met are going to do.", "They're the ones that approached the land owners and asked for this deal though, so how the fuck are they going to throw that back in their face?", "[removed]", "Still, that's too much of a busybody. Its up to your family to police the pond, not them. They don't know what arrangements are being made (for all they know, there's a standing arrangement for certain people to come out occaisionally and fish without any need to notify you).", "Your Inlaws are hard core assholes. They dumped this problem on your lap while taking money from their kids.", "He has been! Early inheritance reduces the inheritance taxes and will make the transition of ownership easier.", "I can't imagine they will just give away the land before they die. A lifetime of work given away and then what, living off of their kids. I've never known a farmer who did this. They will likely rent it or sell it but they won't give it away.", "Could your in-laws be renting to some neighbors as a way to keep track of how you and your husband are doing on the farm? Renting to someone who will need to drive by your house on their way to check their livestock seems like a way to check up on you without you realizing it. \n\nI wouldn't assume your in-laws will leave you running everything if you can't get along with the neighbors. Getting along with the neighbors is one of the most basic parts of farming. Say that your cattle get out. Your neighbor will stop and put them in and come and tell you that they got out but if you are rude your neighbor will keep going and let you handle it all on your own, meaning your cattle may be gone before you know anything about it. It's the same for every other thing that might happen. You need to get along well enough that if your neighbor sees smoke they will check to see what's on fire and whether you need help. If you are sick you will want and need the help of the neighbors. Not only do you need to be nice. You need to be helping when and where you can.", "If their son and his wife can't seem to get along with the neighbors the parents might choose to sell everything to people who do get along.", "Yes, the process for early inheritance/turning over ownership is already started. Most matters they already defer people to my husband to sort out and handle.", "A deed?", "The farmers you know aren't every farmer or hobby farmer in the world- they want the farm to stay in the family but also acknowledge they can't manage it or the related legalities and paperwork anymore without someone double-checking behind them. They are doing an early inheritance for my husband so it's not something to be dealt with after their deaths and will be less expensive for my husband if they do it now. My BIL wants nothing to do with the farm and has given his full blessing, in writing, to turn it all over to my husband. \n\nYou can also repair a pasture- the fence, new well, new water tanks, getting rid of mesquite, new security cameras, new cattle guards.", "Thank you! I think I'm going to love this.", "And his parents are okay with these people calling the police on their son? Really?", "They do sound terrible haha. You need to have a talk with your in-laws. Best of luck to you!\n\nEdit to add: I would do what I can to get them off. They sound like the type that may put up a fight. Start the process now during the current crop year. If you wait till winter they can fight and probably get another year out of it. Maybe pay them for the fence and tell your in-laws you will take over rent (if possible)", "I’m in the KC area and it’s absolutely hilarious to have a bunch of Midwestern people screaming Hail Satan!!!", "I’m seeing them on Friday with my bestie, her wife, and her youngest daughter. I’m 56, my bestie is 51. I took her to a Ghost show a year ago last February and she is HOOKED, so we’re road tripping!", "I'm not sure the OP understands the concept of owning property. As of now, she says they are making improvements on property they don't own. She says the neighbors are doing the same. She says they will inherit it when the in-laws go to live with her BIL but inheritance happens after they die. She doesn't say that they will rent it after the parents move and she doesn't say that they will buy the property.\n\nIt all sounds kind of fake like someone wanting to wind people up over uppity religious people.", "Pasture is either rented for a set price/year or it is rented as a set price per head of livestock/year. There will be a limit on the head of livestock so that the pasture isn't overgrazed.\n\nEveryone would mock a farmer talking like you suggest. In a rural area your neighbors are your first aid. They are your fire department. They will be your paramedics. They keep an eye out and keep strangers from doing things like stealing your cattle. The last thing you want to do is get into a pissing match with the neighbors. Their fire department is likely all volunteer. The volunteers decide whether to drop everything and go to put out the fire. They could decide to not get out of bed in the night or not drop what they are doing during the day. Some of your neighbors will be the local paramedics. They are more likely to drop everything, even if they hate you, but again, they can always be too busy or take their time. The same for getting your cattle out of the pasture if it is on fire. The same for noticing if there is a stranger's trailer loading cattle out of your pasture. They just might not see anything. \n\nBeing on good terms is critical.", "They could. Not a single thing in the post makes it seem like the IL will do that? They came to find out the rest of the story and that’s about where it seems to end?…\n\nYou’re right. They ARENT owed an inheritance. Again though. What evidence do you have this will occur? Your own fantasy? Cool story bro. What does it have to do with reality? 😉", " In Ontario you are allowed to walk around topless. It just depends where you live.", "\"inheritance happens after they die\"\n\nYou've seriously never heard of people passing over inherited property early, whether to reduce tax or just because they're downsizing?", "Yes the reality that ONCE she owns it she has a say. Ergo until then SHE DOESNT how is that hard to grasp.", "It’s not hard to grasp? It literally just doesn’t matter lmao she’s not saying ‘I’m taking the land back’ or some shit like that", "Define \"mostly illegal throughout the world\"? \n\nhttps://www.dailymail.co.uk/travel/travel_news/article-9512913/Map-reveals-countries-allow-nude-sunbathing-theres-state-state-guide-U-S-rules.html", "YTA", "This could be applied to literally EVERY religious militant EVERYWHERE in the world. If only they actually learned the lessons taught in their sacred texts ….", "Actually no, that statement is bullshit. Being religious doesn't mean they're required to put up with or endlessly forgive others behaving poorly. It generally comes with a requirement to improve yourself and others, and hold people in general to higher standards.", "they are just driving by as the path goes past the house, according to OP.  so it's an invasion of OP's privacy.  Not sure how much they could actually see from inside the pasture itself. OP only said the firepit is 50 yards from the pasture, not sure what the distance is to the house itself.", ">When has \"you better be nice to me or else\" NOT been YTA kind of move?\n\nyeah, kinda agree with this.  this was not the right thing to say,  would have been better to remind the neighbours that you are in your house and entitled to privacy, and they are just driving past on the path and have no need to be looking in your windows. they are supposed to be looking at the path they are driving on, and they need to stop spying on you and respect your right to do as you please in your home.", "strongly agree with this. They are only renting a single pasture now, but you can't be too careful, they might have an eye on acquiring the IL's farm. If they manage to run OP and her hubby off, those elderly people will be alone and easy prey for religious manipulation. Next thing you know, the neighbors have the title and the elderly parents have just a pittance to show for selling their farm. I've seen stuff like this happen IRL.\n\nIf OP says to the inlaws, that she's uncomfortable because these people are watching her, they look into her windows, they catalogue whatever music she plays in the house, they watch her on the porch, they watch her at the fire pit, they seem to watching everything she does, and it's weirding her out, maybe the ILs will take against the neighbors a little and rein them in. It would actually be good to get the ILs to be a bit suspicious of these people, because who complains about this stuff if you are just driving past some place? \\[*The path to the pasture goes right by our house since it's close to it*.\\]", "Daaaang these people really can't help themselves. They really called the cops on their *landlord* for fishing in their own pond? Something very wrong with these people.", "This is 💯 the case. Especially if OP showers the same time every day.", "Can I pay YOU to come smoke the good stuff, listen to EDM, and work in your cat sanctuary??", "I may be naive but I don't think getting caught smoking a joint is going to ruin anyone's life anymore", "Right?! What a goof.", "It actually isn't if the nakedness can be seen from a public or common place, or from your own house. Basically, unless you have to crawl under a fence and trespass to get the nude pics, you're completely in the clear. \n\nWhat you do with the naked pictures after is another thing, though. Revenge porn laws exist now, so they wouldn't be able to just show everyone to shame and get back at her. But....revenge porn also tends to be poorly enforced and require the victims to bring forth the charges and.evidemce and what not. So if they posted her naked pics on the church bulletin board, I can't see her having much recourse.", "...they are.\n\nIn what universe is it wrong to play music loud when you live literal miles from anyone? They're not next door neighbors.", "Then OP can shock and horrify the children for years then.  No one gets to tell me what to do in my home.", "That just means \"I can do whatever awful shit I like, but as long as I go to church, I'm a good person\"", "Pig farms create huge downwind odor. People threaten to put them in to drive the neighbors away.", "No the point is that the shelters are always full of barn cats that get abandoned and euthanized after they've been dropped off at shelters, or on the sides of the roads, or when the people owning the farms are on their last legs and with no living relatives. Whereas we can build an enclosed, protected area, spay and neuter, and get them in the working cat registry so they can find new farms or businesses to 'work' on. Anywhere that needs pest control can adopt a working cat for free.", "Possession could depending on how much she keeps in the house.", "BIL is perfectly happy with the proposed arrangement and has said so in writing.", "Respectfully bro, if you think the person having trouble cooperating and coexisting is OP, you need to read again.", "And what judge would sign a warrant yo search an entire home over this in the US?", "No, I know the neighbours are ass holes but OP is unnecessary and wrongfully escalating the conflict by pulling “this will be my husbands land so you better treat me better” when she does not have any say in who is using the land, now or in the future. Furthermore the in laws or the husband might be dependent of a good relation with the neighbours now or in the future and she might just soured it more than necessary. She is stating that it brings in cash that are welcomed. The local farming communities are often tight knitted and being in bad grace can lead to heaps of problems. It can be anything from not being granted access to roads, shut out of joint hunting, sharing equipment to not having anyone renting land. Seen many people burn bridges which comes to haunt them years later when they need a favour they could not for see.", "Plans they put on hold because the IL didn’t confer with their son WHOM they are transferring inheritance too and leaving within a year. 🤷‍♀️ like ya. You’re gone.\n\nLandlord use of property be gone.", "I'm Canadian, and the thought of raiding someone's house over weed is kind of funny ngl. Instead of worrying about taking away women's rights and putting weed smokers in jail, maybe they should deal with the 100s of real problems they have", "A lot?", "I’m old too, it would be Eazy E Gimme That Nut.", "This situation calls for metal, no question. Metal is great for clearing a room of tightly-wound douchebags with sticks up their asses.\n\nHowever, there’s something to be said for just playing the song from the Terence & Philip movie too. I’d pay to see the looks on their faces.", "No, we've been here for 5 years already and have helped plenty of people, have not had any issues with anyone else when little hiccups arose. Their main reasoning was 1. 'What will our church say if they found out we said no to someone in need' and 2. 1-2 years of extra income for when they move in with BIL.\n\nOriginally the renters were really aggressive and pushy for a 10 year lease and ILs told them 5 years or nothing because they weren't going to put a long term lease in place that they weren't going to be there to see to the end.\n\nI'm not trying to argue with you, but the getting along with the neighbors goes both ways. Exactly how many months of being harrassed and told to not do anything in or around my own home to 'be a good neighbor' am I supposed to endure? They've been handled with politeness for 3 months and have yet to reciprocate. They're already being done a favor by being rented the pasture because of their poor management via getting more cattle than they had land to support. Its my husband and myself chasing off coyotes and mountain lions from that pasture at night. Its us that are dealing with their kids riding their ATVs through the other pastures, or through the gardens of either house and politely asking the renters to put a stop to it with no avail. What sense does it make to constantly antagonize the two people you know are going to be in charge when your lease is up and its time to renew? They've already been asked to give a call ahead as a heads up so I don't go outside to smoke, or turn the music down, or any of the other things they complain about (like keeping our cat out of the window somehow because it gets their dog running around?) and they refused that request. Why call the sheriff on people clear across the farm, nowhere near the rented pasture and cite 'protecting my cattle' when questioned about it? Why not bring up the firepit with my ILs the evening my ILs were there instead of walking away and only complaining about it to my husband and me when ILs weren't around unless you're going out of your way to be a pain and a bully that wants to enforce your will on everyone else?", "Connect it to an outdoor speaker and a motion sensor so it starts playing any time they drive past to the pasture.", "Darling come here, F me up the \n\nThanks for the reminder how much I loved this band. Kittens are horrified about the current dance party though.", "Mmm I'm thinking a little AC/DC. Highway to Hell or Big Balls are a couple of faves to make the church biddies blush.", "I love that song. It's so over the top it never fails to make me laugh.", "If you don't understand the situation you don't have to comment on it.", "What state is that?", "NTA it’s your land, your home, your life. Do what u want", "Faith can be a very convincing justification for trying to control someone. Unless that someone sees through it. You have seen through it.\n\nNice work. Keep resisting the self-righteous pricks until you can show them exactly what being holier than thou earns them.", "NTA\n\nMaybe apologize to your in laws if you’ve hurt their feelings at all. Kind of an olive branch? But in no way apologize for what you’ve said. \n\nIt’s your home. The neighbours can’t dictate what you do in your home and they are trying to. Maybe talk to your in laws about how THAT particular pasture’s path is so close to you and that it shouldn’t be rented out again, because it’s too close and invasive?", "NTA, sounds like you need to order some strippers and a PA system and do an in depth exploration of the entire wu tang discography on a Sunday afternoon when they are on their property.", "nta. they aren't even that put out they are just trying to control your behavior in general. cancel that lease as fast as possible. \n\nmaybe apologize to your in-laws for the drama spilling over, but otherwise yaint do nothing wrong", "It’s giving “my father will hear about this”", "Nta. You should come right out and say to make other plans.", "For renters, the other family seems pretty entitled trying to tell you what to do in and around your own home.  NTAH at all.  Stick to your guns.", "You are allowed to do whatever you want in your own house! Your are not the asshole!", "So after you smacked them down, they went to your ILs and your husband to… tell on you???", "NTA - fuck them.", "NTA. You have a reasonable expectation of privacy in your own home, and it’s no one’s business what you do there (as long as you’re not causing harm).", "Nta", "When you take over don’t renew their lease. Get them out of there.", "Tenants don’t get to dictate how you live in your home.  Tell them to stay within the boundaries of the land agreement.", "I don't understand the audacity of some ppl. If I accidentally saw my neighbors walking around naked while I was on their property, I would do everything possible to induce sudden onset amnesia after suddenly remembering an urgent appointment I had on the complete opposite side of the world. No way in hell would I tell anyone about it, much less confront said neighbors! No torture known to man or god would drag that confession out of me.", " NTA\n\nPerhaps speak to the ILs to see if they perceive any harm has been done to them and then if appropriate apologise to the ILs. Do not apologise to the renter.", "Performative religiosity", "NTA. Do NOT apologize that only sets a precedent that they are in any way correct or right. \n\nPut that conversation in writing - and re-iterate your points. Be sure to include a termination date for use of YOUR (future) land.", "NTA. Seriously, how often are they in the pasture? Are these dairy cattle? Otherwise, I don't see why they would need to be over there more than twice a day in the summer.", "Stop talking to the tenants.  ask your in laws to please tell the tenants they are not allowed to go to your house, to MYOB and stop harassing you. Explain that these tenants are trying to police what you wear inside your house, what you do on the porch and banning the firepit. \n\nAnd then keep a low profile and close your curtains. I'm sure your ILs don't want all this hassle but they are stuck with the pasture lease for now, so for their sake try and keep the peace.", "NTA\n\nI was annoyed just reading this. I reccomend a spite playlist for when they are in earshot. \n\nFuck you - red hot Chilli peppers\nNobody speak - dj shadow & run the jewels\nBig balls - acdc\nFuck her gently- tenacious D\nWap - by Niki manaj? (Not my genre of music but I think it was her) \nBad touch - bloodhound gang", " You don’t owe them an apology. You told them something they need to hear and learn. Besides,  deep down they like it because, as religious people, they have a need to feel persecuted and to feel superior.", "NTA", "NTA: don’t say anything else. Or serve them an eviction notice because you have a right to privacy and peace in your own home and that includes their pestering you on your private property, which yes they are renting at your good graces.", "NTA but look into your laws. Walking around naked in your house with the curtains open could be against the law.", "NTA\nThey are going out of their way to be a nuisance. They are using land. They are not your landlord or keepers. If they disagree about the way you live your life that is too bad.", "NTA\n\nThe audacity of people saying you shouldn't be able to walk around your own home starkers.  I would implement topless tuesdays on my land just to spite them.", "They need to shut up and stay in their lane.", "NTA. The whole notion that you have any requirement to live the way these people want in your own home because they happen to pass by it is psychotic. Personally I'd have already ended the arrangement if it was in my power, and I understand that it's not your choice at the moment but them acting this way is utterly unacceptable.", "NTA\n\nNext time they knock on your door for walking around nude tell them you're calling the sheriff for them being peeping tom's", "They are acting like they own the place.  Ridiculous.", "NTA. Just *imagine* trying to tell these people how to act in *their* home.", "Last time I checked looking into people houses is illegal in most places. I had a coworker of my brother's partner make comments about me walking around the house naked. I informed my brother that being a peeping tom is still considered a crime in this state. My brother's partner hasn't really spoken to me since.", "NTA\n\nI recently purchased a house with about 20 acres of land in a rural area.  \n\nNearest neighbor is a guy who's a \"pastor\" of a \"church\" with 5 members with services held in his house.\n\nThey don't like my LGBTQ flag I hung out front? Cool now I have a trans flag too and I have been playing RuPaul's Supermodel when I'm in the woodshop.\n\nDon't like seeing me smoking weed on my property in a legal state? Well guess I gotta sit on my front porch and puff on a huge blunt.\n\nDon't like seeing my son (who's 19) kiss his girlfriend (who's 20)? Guess they're gonna make out in the driveway and who am I to stop them?", "Well you are exploiting them so...", "Bb", "You should have kept that little nugget to yourself and enjoyed seeing the neighbours faces when they realised that your husband is their new landlord. Just going off the title, you're in ah territory.", "I think if they are renting and have children around them they should have a right to not see you naked and not have the children see you naked. That doesn't seem like an unreasonable request. I'm assuming when the in-laws give you the property they will end up moving on. Have they had any complaints against your in-laws or only you? I just don't think it makes a good landlord to have a power trip over the renters and especially attacking their faith.", "ETAH - I dont need to go in on why they are ass holes. I do think it was an ass hole move against your in laws. It’s your in laws land and until it is your husbands both you and your husband should respect the fact that you don’t own anything. I’d be deeply upset with my long time gf if she ever pulled a move like that. It’s disrespectful against your in laws using it in a conflict against people your in laws have a relationship to. From my point of view, if the land becomes only your husbands, it still stands it’s not yours and you should not use it as a threat. If your husband on the other hand wants to nothing to do with them for treating you poorly than it’s all fine, but it’s not up to you to decide.", "yes", "They say that good fences make good neighbors. Though you're in-law's intentions were good this doesn't seem to be a good fit or at least these people feel like they're doing you a favor. I would go ahead and apologize and explain at the time of the apology that this probably isn't a good fit to continue after the lease expires. They'll realize why.", "ESH\n\nYou’re not legally in the wrong for sure but it sounds like you’re being kind of an obnoxious neighbor. Regardless, leveraging your control of a property and threatening their livelihood over an interpersonal dispute is kind of a dick move. \n\nThey’re being intolerant and definitely being worse neighbors than you. You’re not wrong to be upset with them. I would be too.", "YTA - Are you auditioning for the role of the \"Wicked Landlady\"? Kindness goes a long way, not threats.", "ESH. They’re wrong, but you sound unpleasant.", "YTA\n\nThey are paying good money for use of that pasture, and are therefore entitled to use it. You have made things a pain in the ass the entire time and behaved poorly (the drug use, the fire/ smoke near their animals, the blaring, intrusive music, and the nudism), so they're allowed to complain about you.\n\nYou're acting like a crappy neighbor, so it's not a surprise they're complaining about you to the landlord.\n\nYou're also perfectly allowed to decide what to do with your own property....once it's your own property. If you think you will never need their rental money or help, then end the lease and part ways amicably. \n\nDo be aware that your in laws will still be around after they transfer the property, and will still be pissed at you if you do crap that makes their life harder. Your neighbors will also be around long after the transfer, even if they stop renting. And also be aware that the lease might extend after the land transfer. \n\nWhy not act like a grown up and talk with these people to set a time of the day to expect them, where you'll put clothes on and avoid them, or figure some way to get along? The in laws have managed it for years/ decades, why are you having such trouble?", "YTA", "[deleted]", "I so planned on thinking I’d be voting y-t-a based on the title.  But absolutely no, these people are horrible & I’d end their lease the moment you’re able.  (I’d even pressure the in-laws to end it if its renewal comes up before your husband takes over.  The “right thing to do” isn’t forcing your son & DIL to put up with horrible people’s shit.)  NTA", "They're there 2-3 times a day and my husband has seen them driving near the very outer property lines all around the farm. Their kids drive ATVs over to supposedly look at the cows but they keep trying to drive all over the farm. They're Angus cows being used primarily for meat.", "Do they really have a secluded home, though?", "It’s not a YTA move because they won’t mind their damn business on someone else’s property. You keep that shit up and I’ll have future control of the rental agreement. You bet I’ll tell them to straighten up if they want to keep it.", "um, I think it's too late for that strategy because these same tenants called the sheriff on the husband and his buddies for fishing at the pond.  Pond has nothing to do with the pasture, it's way the other side of the farm.  These people are targeting OP and her husband, probably want them gone from the farm entirely. So much for good Christian neighbors!", "I don't think that applies to a private path, plus she was inside her house.  OP didn't know that they were driving by, she checked before she took her shower and they weren't around.  If she's in her house, what are they gonna see as they drive past but just a quick flash of nakedness? they can fix this by looking at the path not the house.", "Why should you be tolerant of assholes behaving the way they are? You don’t have to tolerate the intolerant.", "That’s not at all how that works. There’s a ton of nuance and you’d have to be acting very overtly lewd to catch charges.", "How many times *should* the neighbors forgive OP then? 7? Maybe 70x7 times, like it says in Matthew 18?  Do you think they’ve hit their 490 forgivenesses yet?\n\nReligion isn’t about holding *others* to a higher standard. It’s about holding *yourself* to a higher standard. Others aren’t obligated to play by your rules.\n\nDoesn’t sound like OP is behaving poorly. It sounds like these neighbors are offended that she doesn’t share the same views as they do, and isn’t behaving how they would like, while *in her own home.*", "THEY CALLED THE SHERIFF ON THEIR \"LANDLORD\"???? FOR USING HIS LAND???? \n\nHAHAHAHHAHAHAHAHAHAHHAHAHAHAHA\n\nNTA and heck them OP keep on having a good time.", "This. You've got to get along with the neighbors. If you prove to the parents that you can't get along with the neighbors, I can see them deciding that you will fail so they should rent it all to the neighbors.", "So, typical behavior of the self righteous.", "Right; talk to the in-laws and explain/apologize if necessary, but renters deserve nothing.", "Tenants they allowed in good faith only", "Same here. And if there's the 'fish' on their business card, car, anything, it's been my experience that I'll be sorry if I don't walk the other way.\n\n**OP = NTA**", "Nope. They’re on private property. You wouldn’t be able to see them if you weren’t on their property. Try again.", "yes! that reflective tint works really well in the daytime, anyone looking at your window will see their own reflection, but you can still see out and it helps keep your space cool in the summer. Used it at my office for downstairs where we had glass front and glass door. Gave employees a bit of privacy from people looking in that window instead of going to main door.  \n\nJust be warned, at night, if you have lights on inside, the reflective part doesn't work and people can see inside your home.", "They told her to not listen to music anymore cause their kids might hear it. If that's not self important, i don't know what it is", "They're renting OP's in-laws pasture, which OP lives next to. The in-laws are aware of the smoking and have no issue with it. So, yeah, they have no business telling OP not to smoke at OP's home.", "Cool. They’ll still be using her property for *years*.", "[deleted]", "Well, it *could* be illegal. Taking Florida as an example, no license is required for fishing on/from *your own* homestead (DH might be OK there, not sure, since he doesn't own it, but does live there. Regardless, the friends clearly wouldn't get a pass), or in a *fish pond* (purpose-built, not a natural pond) under 20 acres on private property. Fishing on private property (not yours) in a natural water body without a license could very well be a violation (not to let the renters off the hook - they're still AHs for calling). Plus (again, just using FL as an example) the friends may have all been licensed anyway, it's cheap enough - residents $17 annually for freshwater. (obviously, your local/state regulations may vary - wildly..)\n\n(all this being said, OP prooooooobably doesn't want to get in a pissing match over (often quite complicated) fishing regulations with people who may actually know the rules better. If that is the way this goes, get 'em the hell off your land ASAP!)", "Is it possible they are trying to get you guys to move? Since they rent from the IL's - do they think you guys are just living there and hoping to either to get them to kick you out or annoy you enough to leave?\n\nIt just seems *super* bizarre to me for someone who's just renting a pasture to be making so many unreasonable demands of the people who actually live on/own the farm they are just renting a pasture from.", "That would depend on the nature of the music.", ">The in-laws are aware of the smoking and have no issue with it.\n\nSo what? There is a difference between right and wrong. Smoking weed is wrong, or at the very least undesirable. The OP is unwarranted responding to a shaming of her own undesirable behavior by stating that the other party is self-important. It is the OP who is taking an action that is a negative reflection and influence. This the OP has a right to do, and not a small amount of power. But it does limit her *credibility* in saying of others that they have a sense of being \"self-important.\"", "I’ve seen many pigs eat many men.", "Smoking is not wrong. Not sure where you picked up such puritanical beliefs, but I would suggest you acquaint yourself with modernity. But that's beside the point. It is pretty self-important to dictate to others what they can and cannot do in their own home, especially when said home is on a farm. This isn't a situation where people are forced to be close or interact (like apartments), that would be different, instead they are literally on a farm with tons of room. If the other family doesn't like what OP gets up to, they can go ahead and mind their own business and steer clear of OP.", "2 Live Crew on repeat as loud as possible. My husband is a musician, so we have enough speakers to make it seem like a Taylor Swift concert lol", "Behemoth- O’ Father O’ Satan O’ Sun is a banger of a track", "Are you somewhere other than the US?\n\n\"Early inheritance\" isnt a legal term. People use it to refer to transferring assets to the next generation, but often it's simply a gift.  For real estate that can be as simple as notorized signatures on a quitclaim or warranty deed, and paying a filing fee with the county to record the deed. Not a real lengthy process.  Is there a trust involved?", "Even in the illegal weed states in the US smoking a joint on the porch is not enough for a warrant to search the home, unless we are talking a child protective services case. You are right to see it as ridiculous. \n\nPeople are going to call me a lair for this but I deal with warrants at work everyday and this simply isn’t enough to create probable cause for a search unless someone is being bribed.", "Ha! Just imagine opening a gate for your cows and then hear off in the distance...\n\n\"FACE DOWN! ASS UP!\"", "Haven’t heard that but may check it out!", ">So could they back out of the plan? Has anything been signed?\r\n\nYes, people have been cut out of wills before because they  pissed the person off.  A will and a succession can always be changed.  It just seems like she was tired of their constant nagging-.  \n\nThe way you handle people that constantly nag is to tell them of the issues that you have with them and what you would like them to do. Usually they back off and just ignoring what they say to begin with..  However since this is not her farm & her iL chose to rent it, she should be diplomatic about this process.", "The Satanist is the album, Negral wrote most the album while battling leukemia. A true masterpiece of an album", "ESH. You have no right to be upset over land you do not own. Neighbors have no right to tell you what to wear when you’re on your own property", "Just make sure your IL’s not think YTA.", "THIS, OP. THIS.", "You should edit that into the original post. That will russle some jimmies in your favor.", "The whiny pasture-renting neighbors should keep this in mind… they aren’t being very likable", "If her husband owned it yes it's hers as well..but just because his parents own it don't make it theirs too..is she sleeping with her father in.law that's how your wording it. Husband wife relations have different  rights than his sperm made my husband relations.", "If you can be easily seen, in the US it's still indecent exposure. This could literally ruin your life because they have kids and that's a ticket straight to the Registry.", "If you have to advertise that you are a Christian, then it must not be appearant in how you act. I get this feeling also when I hear \"you can trust me, I'm an honest politician.\"\n\nNTA OP If others are correct you may not be able to be naked with open windows, but you got a thong or bikini? If your state allows smoking, then smoke em if you got em. And especially crank up the jams until 11:00. Do you know any bikers or rainbow coalition to invite over. Or just have theme nights/days. That will curl their hairs like never b4.  You got \"In-da-gadda-da- vida\" on I tunes. Or \"Fire\" by Arther Brown.", "Still though. Not their business! What makes them think they have solo access to your farm because they RENT some of it. Jfc", "They are on their rented property lol rented from the inlaws that she knows is close..she just wants to give a peep show", "It doesn’t sound like this would qualify as public though. They are on private land. Just because the neighbors are leasing the property doesn’t mean it becomes public.", "This is in fact, almost entirely wrong. Depending on the state, as long as you are on your personal land, you can be bare-ass naked regardless of view *as long as the nudity isn’t sexual in nature* \n\nThe *Plain View Doctrine*, only states that police can seize evidence without a warrant as long as it is out in the open and can be seen from a lawful position.", "*laughs in Oregonian* as long as it isn't sexual you can be anywhere you want naked as a jay bird here. Keep your repressive bullshit in your own state, because that shit ain't federal. Hell, we have an organized naked bike ride. Pretty sure they've got a mountain to coast one at this point. Sounds uncomfortable, but to each their own.", "Or just blast heavy European techno all night until the livestock get spooked and nobody gets any sleep (from noise, or uppers, or both).", "Have a source on that? Almost everything I can find from any known case law says that being naked on private land, if able to be seen from anyone where they are legally allowed to be, is not considered legal.\n\nA few states deem it as legal if it's not sexual in nature, where in some states you can be hit with indecent exposure simply for urinating outside in your own yard.", "So she can tell them where they can look while on their rented property?", "Good point.", "[deleted]", "That was a great clap back!", "If these neighbors have managed to have a decent relationship with your ILs before this I'm sorry to admit but YTA  (E  S. H) maybe. I've only lived in city/urban areas so I'm not speaking from experience but farming communities or similar areas play by different social rules. Being or having a good neighbor can literally mean life or death if an emergency occurs then your family requires assistance from someone nearby. There are countless stories on the internet about how rural conflicts can escalate or just be a major pain in the ass ( look for the story about the  pissed off neighbors whose revenge included increasing the number of pigs on their land  to strategically maximize the atrocious smell ((before breaking any law/penalties/violations/audits)) to purposefully \"contaminate\" the air drifting onto their new neighbor's property. Enlist your ILs to set up a meeting between your family/neighbors so yall can work together on a resolution that works for all parties involved...Just because you're right doesn't absolve you from being judged as the AH", "No they need to respect the rules of the current landlord not one from the future I'm sure it ticked the il.off if it didn't they wouldn't have went to their son about it.", "So someone can stand in the window, dick out, waving at passersby and it's not an issue, right?", "Being charged with indecent exposure to a minor will tho. Doesn't matter if you are in your house or not. If you can be seen, that can count", "Fuck can they run.", "Fair enough. As a final quick aside, compensation by landlord is certainly not \"more often than not the case.\" This very issue is litigated all the time. Tenants are constantly shocked to find they are owed nothing.\n\nIf tenant is a smart businessman, he'll have made that money back in the sale of his livestock/their byproducts, as you'd recoup any other business expense. Any gain in equity is not due any thanks for neighbors' \"time and money\"; this was not a favor, it was a business transaction. For all we know, the value of the expanded herd far outweighs the gain in value from a fence. We have no idea who truly derived the benefit of the bargain. (And if we really wanted to get technical we'd balance the gain in equity from the fence against the loss of value to the homeowner caused by neighbors obstructing full enjoyment and use of their property -- fire pit, porch, etc.)\n\nTo me, two life lessons control here: First, if you're a prick to someone, expect them to be a prick in return; and second, a man's home is his castle. Neighbors got what they asked for.", "My state it's illegal to stand in your home in front of a open window knowing children can view...it would be a sexual crime against a child.", "I guess I can’t speak for anyone but myself. But I’ve done this for 20 years and I’ve had leases for crop share, cash rent, flex rent, etc. I would never do any improvement on a property without direct permission from the landlord. Its hard for me to imagine a peer doing something like that. They wouldn’t last long in this business. In almost every case I will be compensated for my work. If not there would be an amortization schedule over so many years. IE if I tile a field for $1,000 an acre and I take 10% off per year, I will get 50% of my money back if I only farm it 5 years", "Yeah, I agree it seems foolish not to demand recompense in writing before beginning work. Interesting to hear your perspective.\n\nThanks for what you do so the rest of us pricks on the internet can have something to eat!", "Ha no problem! When I’m in a tractor I think I have the best job in the world. But the paperwork, volatile markets, and politics of it all can be a real drag", "The neighbors should f\\*ck off, and you should let them know now the lease will not be renewed.  The sheer audacity of their complaints is breathtaking (in a bad way).", "How do they not understand that the section they are renting does not include yours? 😂 there’s no argument to be had, next time they make demands of any kind just ask them “or what”. But also, you need to understand if the in-laws are on your side or not. I get it’s their son but what a nightmare if they really liked the neighbors and decided you were difficult and crude causing everybody problems and maybe shouldn’t have a place there for now. Life throws curve balls", "There’s a lot here. First of all, my advice is to not jeopardize the rent income for your IL’s, as they will be moving in a couple of years and will need that money. This means being as polite as you can, because it’s your ILs who will lose that money, not you. \n\nSecond, do you intend to keep leasing that pasture when you move in, for a little income, or start your own plans right away? Get that square in your mind. \n\nYou got in the habit of walking around nude because you live out in the sticks. That was nice and relaxing. But now you’ve got renters driving by, so you’re no longer secluded. If you keep walking around bare naked with the curtains open, one day, you’re going to flash their kids, and you’ll get a knock on your door by the cops for indecent exposure. Most states have laws against exposing yourself through an open window where it’s visible from other people. You really don’t want to put yourself in the position of arguing before a judge how unfair it is to cover your nudity in front of kids. And, again, you risk losing this revenue stream for your IL’s, who were already kind and generous enough to let you two take over their farm. \n\nWhy in the world would you mock their faith if they don’t want their kids to see you naked? \n\nNow, you have a point that they have no business telling you what music to listen to or what to smoke on your own property. You would have had the high ground if that were it.", "ESH. You are right to stick up for yourself. They can't dictate what you do in your own home. So they should not say anything about the music or you smoking weed. I think you were too rude to them though. If their children really are helping them with the animals, and they have to go right by your house in order to so, I do think you should be more cognizant of your nudity. I also think that you were wrong to threaten them about the use of the property. Especially when they have contributed to fixing up the property. That's money that YOU didn't have to spend on it. It sounds like they did you a solid already in that regard. So perhaps a little more grace could be given on both sides here.", "YTA . This is not your land nor your renters . You are playing loud music , smoking weed all over the place in front of their kids , and wandering out naked. Honestly you just sound like trashy nightmare neighbours", "Pretty sure they don’t want to be", "Pretty sure that’s a threat to….not be a landlord anymore", "Unless they change it. My great uncle gave his land to his sister. My mother thought it would go to her until she got a big head and started acting like it was hers before it became hers. Grandmom sold it and payed for her funeral and paid her bills off. \n\nThe il can still sell the land or even a part of it. And if they ask they can buy it they just might sell to them and say well you get all the rest of the farm.", "You’re NTA. I would apologize to the in-laws for causing them any trouble, but I would NOT apologize to the neighbors. I would also take whatever steps to formally end the lease for when your husband takes over— that might mean your in laws need to send the official paperwork unless you want to be dealing with these people for another year. \n\nI’m not well versed in farming, but I’ve read that it’s good to let a field go fallow every so often when it comes to grazing."]}