{"id": 24189, "submission_id": "15lk2j5", "title": "AITA for laughing at SIL’s concern?", "selftext": "This is a nonissue between my husband and I, but SIL has made it into one so I’d like to see what others think.\n\nHusband and I (both 29) have two kids (5f/3f). If I vacuum when they’re watching tv, I let them turn the volume up a little. This only happens when it’s out for long periods of time (cleaning day) as they abandon the tv eventually.\n\nSIL (32f) came by with her kids (5m/4f/3m) for a surprise visit on cleaning day. Our 5 year old had a birthday party the previous weekend so the house was a wreck and my husband was at work so it was just me and the kids upstairs. I keep the house locked up, so she let herself in with a spare key we gave out for emergencies. We were all in the play room when they busted in, it absolutely scared the shit out of me.\n\nI turned the vacuum off (5 year old turned the tv down) and I apologized for not seeing her calls/texts, because obviously in cleaning I’d missed something and she totally didn’t just let herself into my locked house, but SIL informed me she hadn’t called or texted. They were in the neighborhood to drop off a present since they missed the party due to vacation. She saw my car here but nobody answered the door so she just let everyone in. \n\nBefore I could ask her why she thought she could just let herself into my locked house without notifying me (we aren’t close with them like that), she went off on me for letting the girls “run rampant with the tv while I’m not paying attention to them”, that it was dangerous for so much noise to be distracting me at once and she could have been some random person letting themselves inside to do “god only knows”, cringey shudder included. \n\nIt wasn’t the most mature response, but I was so befuddled that I just started laughing hysterically. One moment I’m mindlessly vacuuming up popcorn and the next I’m being lectured on the care of my kids by an uninvited house guest. I asked if this random person would also use their emergency only spare key to get inside which caused her to turn red and develop a stutter. She malfunctioned further when I asked if she had remembered to lock the door again behind her. She told me that my daughter can forget about her present and she corralled her kids before hastily leaving. I had to lock the door again after her too, of course. \n\nI texted my husband to let him know what happened and he told me he would deal with it so I left it. When he came home later that evening, he had their spare key. Apparently he stopped by after work to chat and she started in on him too. His brother wasn’t home at the time so instead of engaging he just asked for the key back, which she threw at him, and he left. \n\nSince then, we’ve gotten calls from family asking why I laughed in the face of SIL’s “genuine concern” and if we’re being safe with our kids. Most seem to understand when I explain the whole situation but some still took SIL’s side or said I should have handled it differently. AITA?", "created_utc": 1691505553, "permalink": "/r/AmItheAsshole/comments/15lk2j5/aita_for_laughing_at_sils_concern/", "score": 329, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be an asshole because I laughed away a concern brought up towards my children from an uninvited house guest when I could have addressed the concern or used more mature and appropriate language to convey myself.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but your SIL is. Change locks/rekey locks because she might have made copies. Find someone else to be your emergency keyholder as SIL cannot be trusted anymore. And good on your husband for having your back on this. (I'd be wondering how many other times she's used that emergency key that you never found out about...)", "NTA\n\nShe just walked into your home with no notification using the emergency-only key.  When called out on it, she childishly said your kid won't get a present.  What if the kids were visiting friends and you were having alone time with your husband?  Awkward!", "NTA.  Oh boy.   I think you handled this perfectly, including the laugh. Especially because of the laugh.   You don't owe her any explanation.   What kind of person punishes a child in this situation and holds back her gift.   Wow.  \n\nYour husband gets a round of applause also.  \n\nYour SIL needs to get a life, get off her high horse (makes her ass look big) and definitely needs to grow up.", "I am glad you have your key back.\n\nYour SIL had no right to walk into your home.  She hadn't called or texted you ahead of time. You couldn't hear the doorbell because you had a vacuum on.\n\nShe startled you and made assumptions that the kids were running rampant, when they were not.\n\nNTA", "So SIL was all judge, judge, judge and in your business but couldn’t handle the fallout. Even worse, she got back at you via your child. Tell family to pipe down, the SIL comment about the key is plainly ridiculous. Your hubby was fabulous for having your back tho\n\nNTA but SIL and family are huge ones", "NTA. The hysterical laughter sounds like an odd response but otherwise you were completely reasonable. It's pretty funny to me that SIL is now doing damage control by trying to rally family members about how 'she was only concerned'. It flies in the face of logic that you were dangerously distracted seeing that she let herself in, uninvited, by misusing an emergency key, which an intruder would obviously not have. What, we as parents aren't allowed to have a moment in which there are loud sounds in the house, or to be immersed in a task? It sounds like she needed a lesson, and got it, so stand your ground with the criticisms from family.", "NTA \n\nAnd the family members calling you are definitely getting a very edited version of the events from SIL’s point of view. So hopefully they’ll let it go if and when they get the full story.", "NTA lmao SIL way overstepped her boundaries and deserved to be laughed at and embarrassed. I hope you eventually tell her that all of Reddit is laughing at her rudeness too", "Info: did they tell you how you should have reacted to this insanity?", "At the end of the day this woman entered your home without permission and thats not ok. NTA.", "Go husband! I love that he just took the key. Both of you are NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis is a nonissue between my husband and I, but SIL has made it into one so I’d like to see what others think.\n\nHusband and I (both 29) have two kids (5f/3f). If I vacuum when they’re watching tv, I let them turn the volume up a little. This only happens when it’s out for long periods of time (cleaning day) as they abandon the tv eventually.\n\nSIL (32f) came by with her kids (5m/4f/3m) for a surprise visit on cleaning day. Our 5 year old had a birthday party the previous weekend so the house was a wreck and my husband was at work so it was just me and the kids upstairs. I keep the house locked up, so she let herself in with a spare key we gave out for emergencies. We were all in the play room when they busted in, it absolutely scared the shit out of me.\n\nI turned the vacuum off (5 year old turned the tv down) and I apologized for not seeing her calls/texts, because obviously in cleaning I’d missed something and she totally didn’t just let herself into my locked house, but SIL informed me she hadn’t called or texted. They were in the neighborhood to drop off a present since they missed the party due to vacation. She saw my car here but nobody answered the door so she just let everyone in. \n\nBefore I could ask her why she thought she could just let herself into my locked house without notifying me (we aren’t close with them like that), she went off on me for letting the girls “run rampant with the tv while I’m not paying attention to them”, that it was dangerous for so much noise to be distracting me at once and she could have been some random person letting themselves inside to do “god only knows”, cringey shudder included. \n\nIt wasn’t the most mature response, but I was so befuddled that I just started laughing hysterically. One moment I’m mindlessly vacuuming up popcorn and the next I’m being lectured on the care of my kids by an uninvited house guest. I asked if this random person would also use their emergency only spare key to get inside which caused her to turn red and develop a stutter. She malfunctioned further when I asked if she had remembered to lock the door again behind her. She told me that my daughter can forget about her present and she corralled her kids before hastily leaving. I had to lock the door again after her too, of course. \n\nI texted my husband to let him know what happened and he told me he would deal with it so I left it. When he came home later that evening, he had their spare key. Apparently he stopped by after work to chat and she started in on him too. His brother wasn’t home at the time so instead of engaging he just asked for the key back, which she threw at him, and he left. \n\nSince then, we’ve gotten calls from family asking why I laughed in the face of SIL’s “genuine concern” and if we’re being safe with our kids. Most seem to understand when I explain the whole situation but some still took SIL’s side or said I should have handled it differently. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I had to go back and look if your SIL has kids. Any person with kids, or who was a child themselves(so everyone), has had this tv/vacuum routine…", "My husband has someone coming out this week to change our locks thankfully. And I was wondering the same thing actually! This has never happened before but she sure felt at-home enough to just walk in with us here despite not answering the door.", "Haha! Thankfully my kid is happy with everything she has. I was afraid her feelings would be hurt because SIL wasn’t quiet about leaving with it but she told me she doesn’t want a present from a meanie 😂", "Yes the laugh is really the best possible reaction to insanity.", "I was running on empty from the birthday party activity and I had a million things going through my mind, so the shock of having her in my face and three more screaming kids just blew a fuse I guess 😅 I don’t usually laugh like that but it almost felt like I was the butt of a joke for a second.", "Most that I’ve talked to have said they only got half the story or straight up lies. It’s disgusting how far she’s blowing everything out of proportion considering I wasn’t going to say anything to anyone about it.", "I’ve come to realize that more family members than I’d like to admit are a little insane 😬 they either grasp the concept of emergency key or they skate right past it and defend the insanity because “she’s older and has more kids so she knows better than me”.", "He’s a keeper for sure!", "Right? that's weird. I watch my son's family pets when they are out of town. That is the ONLY time I use my key to their house. I can't imagine feeling at home enough to just walk in whenever I want to. And then I'm there just enough to do my job (walk the dogs, feed all the animals, etc) and that's it. I don't hang out, I don't nose around. These people who feel free to just walk in...wow.", "Your child is awesome. This is internet gold right here.", "Her behavior was ridiculous to the point of being laughable, for sure.", "It’s your home and your kids and your husband was the one demanding the keys back, but only you get shit?", "Hero! You got her by the short and curlies when she thought she was going to give you a lecture.\n\nNTA. Keep being awesome \n\n(ps your SIL is next level petty for punishing your daughter for SILs rightfully earned embarrassment)", "YTA, but because you're damaging your children's hearing by telling them 'just turn the TV up while I'm vacuuming.'  Also, teaching them that their wants supersede anything else, and if anything is temporarily preventing them from doing what they want, they just just go harder.\n\nAlso, personal advice, never give out 'emergency keys.'  In the event of an actual emergency, emergency services will have zero issue gaining entry to your house without a key.", "NTA I doubt she was actually concerned simply covering up for letting herself in and not calling/texting before dropping by", "NTA.  She literally let herself into your home uninvited & then tried to tell you, you weren't doing a good job parenting.  WTF gives her the entitlement?  I love your reaction.  Instead of letting it get to you, you laughed at her.  That's priceless.", "NTA. She is a rude, inconsiderate, overstepping harpy. She doesn't need a key to your house.", "> This has never happened before but she sure felt at-home enough to just walk in with us here despite not answering the door.\n\n\nThat you know of.  She may have been in your house numerous times, and this is the first time she did it when you were there.", "She wanted to make herself look better in case you did mention it to others", "My husband brought that up too. It makes me ill thinking she could have been in our house without us knowing. Maybe she was telling on herself 😅", "NTA and \"she malfunctioned further\" is now the only phrase I'll ever need in my life ever. Thank you, OP.", "NTA. She needs to mind her own business. If your kids are clean, fed, and happy and not in danger she needs to worry about herself. She clearly has no boundaries and you and your husband had every right to handle it the way you did. If we are being honest, she is lucky all you did was laugh as majority of people would have started screaming at her the second she entered your home unannounced. Then they would have torn into her more for worrying about your kids when she should be worried about her own. And then to punish your CHILD for her behavior and you laughing is pathetic. Good for your husband for backing you up on this and taking the key back.", "NTA", "NTA Your SIL is a HUGE one though. I'm glad your husband took the key back, but you still might think about changing the locks. She was rude and out of line.", "Info: what has been your husbands brothers reaction to all this? More cos I’m just nosey at this point 😂\n\nNTA for the same reason as everyone else. Consider a security camera x", "NTA\n\nYou learned a couple of useful things. One is that your husband has a spine.", "NTA.  If they take her side, ask them why a person that let's themself in uninvited to a locked house where they can hear a vacuum and then give opinions on parenting deserves anything more than hysterical laughter?  Your response to her ridiculousness was on point.", "I have keys for various relatives’ houses (due to reasons). If I let myself in, I am calling out ‘Hello?’ from the moment I’ve got the door open.  NTA", "NTA and you know it.", "BIL thankfully has a good head on his shoulders. He called my husband the next day to apologize and I know SIL wasn’t happy about it, my husband said she was yelling in the background 😅", "Your kid is a legend, what a burn!", "Guess you know whom to trust by now", "LOL! Good update", "I have had a friend's keys for 20+ years. The only time I have ever let myself in was when I was taking care of their pets and plants while they were out of town. These are close friends I have known for 40 years and I would never let myself in without their advance knowledge and permission.", "Nta. Your SIL had no business letting herself in nor lecturing you nor throwing her key - sorry, your key - at her brother. She overstepped and she's too embarrassed to admit it.", "Genuine concern?  I'm guessing your SIL comes over a lot more often than you know, I'm glad you got your key back.  NTAH in any way.  Notice how a huge majority of the stories here are regarding 'in-laws'?", "NTA- Your SIL apparently needed to learn a boundary and did.", "Definitely internet gold. SIL is a meanie!", "NTA. Who takes away kid’s present? Who acts like this??", "This", "NTA - my niece had a key to my house.  \nShe knew she was welcome anytime.  \nBUT I’d appreciate some notice.  \nI heard my door open one night, looked at my clock it was 2:21 am.  \nI picked up the metal bat from under my bed and waited around the corner of the front door ready to beat the intruder over the head.   \nShe missed getting a concussion by my ability to stop the bat mid flight.  \nApparently she had missed the bus and my house was easier to get too than hers.  \nI just told her that next time at least text me and went to bed.  \nI think I scared her.  \nNext time she called first 😂", ">I asked if this random person would also use their emergency only spare key to get inside \n\nI love that you came up with that in the moment.\n\nNTA", "i have keys to my friend’s place for pet sitting as well. i send them pictures of their pets while i’m there as a subtle way to let them know when i’m in their house. this practice has been very well received by everyone i’ve ever pet-sat for."]}