{"id": 24202, "submission_id": "15lmyjw", "title": "AITA for saying my mum is not welcome in my life", "selftext": "*TW: mention of ED*\n\nI (17F) have been living with my mum for all of my life. Her and my dad broke up when I was 2 and I haven’t been close with him since. I have no bad feelings against my dad but I don talk to him a lot. \n\nMy mum has always been tough and has brought me up with tough love. when I was younger it really hurt bc she was the type of mum not to say I love you back. I know that she loves me but it stung not to hear it from time to time. \n\nover the years whenever my family came over they would always pick on me about my weight and body. it made me feel insecure as they would have a ongoing joke about it and would always make me doubt and question myself. my cousins have literally gotten me a huge packet of sugar for my birthday and said “she would probably finish it in 5 mins” my mum was included in this and would burst out laughing whenever someone would bring it up saying that she had to hide the sugar so that i don’t finish it. \n\nthe body shamming would cause me not to eat as much trying to cut down in sugar and carbs and missing important meals of the day. it got to the point where I started feeling dizzy and would get headaches to the point where I would throw up bc the pain was too much. \n\nIt hurt me to think that my own mum would think that of me and when I tried to tell her about it she said that i was being “weak” and letting my “feelings” get the best of me. \n\nA few days ago we got into a fight about me doing nothing in the house and she called me a “fat lazy pig who does nothing but eat”. she also said that if I went and got a blood test it would say that I have diabetes. \n\nthis was my breaking point so I screamed at her that she lost the privilege to call me her daughter and to me she’s just my birth giver.  I packed my stuff and left and have been staying over at my friends house. \n\nI don’t know what to do as she has been calling and texting me non stop but there was no clear sign of her apologising. I feel bad as she has tried to raise me to be tough but it’s not who I am. \n\nAITA?", "created_utc": 1691512019, "permalink": "/r/AmItheAsshole/comments/15lmyjw/aita_for_saying_my_mum_is_not_welcome_in_my_life/", "score": 52, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I called my mum my birth giver knowing that she tried her best to raise me tough\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nAt 17 you can and should take control over your weight and diet, but if you were overweight as a child whose fault is that? Did you secretly steal candy bars from shops at 6yo? Did you get a job at 11yo and spend the money on crisps? No, an overweight child is exclusively the fault of the parents (barring health issues).\n\nSo your mum was negligent, and then she joined in to make fun of you. That's *horrible*.", "Nta.  Your mom is abusive.", "NTA, your mother wasn’t parenting you, it wasn’t “tough love”, it was abuse.  Call your dad and see if he would let you go live with him.", "NTA your mom sucks. Sucks harder than most moms. Who doesn’t tell their child they love them??? This whole story is very sad. Im so sorry you’ve gone through this.", "NTA. Your mother isn’t so good at the parenting thing. There’s a right way and a wrong to promote healthy habits in kids. She’s doing it wrong. Instead of shaming you, she should encourage you to eat more healthy foods and probably get you to a doctor to make sure you don’t have a medical condition affecting your weight.", "NTA and maybe time to see if your dad wants to be involved in your life. Make plans for how to live outside of your house when you are a legal adult.", ">I feel bad as she has tried to raise me to be tough but it’s not who I am.\n\nNo she didn't. She raised you to be a punching bag.\n\nIf she wanted you to be tough, she'd teach you to have self respect and not take crap from anyone. By just constantly insulting you all she taught you was \"you should accept hate and insults and bile thrown at you and you should never complain\". Does that sound tough to you?\n\nBeing tough means being able to endure pain and hurt, but it also means knowing when to fight back, and it also means protecting those who need your help. Attacking children over their appearance is not tough, it's *weak.* It shows deep down your mum is a frightened bully that can only feel better about herself by attacking those she knows are weaker than her. And when called out on it, she continues to make you look small in order to try to convince herself she's tough.\n\nNTA", "NTA. Unfortunately, people still believe that fat people are fat because they choose to be and because they are lazy when there is so much scientific evidence that points to genetics and mental health issues. I’m sorry to say that your mother is a huge AH for allowing anyone else to bully you, and for participating in that bullying. And if you have health insurance that covers mental health care, I recommend you seek counseling from someone who specializes in weight management. I would also try to get in to see acphysician. Unfortunately, all that will require you to return to your mothers house. If that happens, you should make sure that you are fully participating in doing chores around the house. Good luck.", "NTA and \"tough love\" is a lie. If our lives are tough, real love is where we go to be safe, not a place where they make our lives harder to make everything else pale in comparison. Love supports us as we weather tough things, and it helps us face the world by the side of someone we trust (I'm talking any kind of love, family/friend/romantic/etc)\n\nYour mom isn't showing you love, and you don't deserve how she treats you. I'm proud of you for walking away and I'm glad your friend is there for you", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n*TW: mention of ED*\n\nI (17F) have been living with my mum for all of my life. Her and my dad broke up when I was 2 and I haven’t been close with him since. I have no bad feelings against my dad but I don talk to him a lot. \n\nMy mum has always been tough and has brought me up with tough love. when I was younger it really hurt bc she was the type of mum not to say I love you back. I know that she loves me but it stung not to hear it from time to time. \n\nover the years whenever my family came over they would always pick on me about my weight and body. it made me feel insecure as they would have a ongoing joke about it and would always make me doubt and question myself. my cousins have literally gotten me a huge packet of sugar for my birthday and said “she would probably finish it in 5 mins” my mum was included in this and would burst out laughing whenever someone would bring it up saying that she had to hide the sugar so that i don’t finish it. \n\nthe body shamming would cause me not to eat as much trying to cut down in sugar and carbs and missing important meals of the day. it got to the point where I started feeling dizzy and would get headaches to the point where I would throw up bc the pain was too much. \n\nIt hurt me to think that my own mum would think that of me and when I tried to tell her about it she said that i was being “weak” and letting my “feelings” get the best of me. \n\nA few days ago we got into a fight about me doing nothing in the house and she called me a “fat lazy pig who does nothing but eat”. she also said that if I went and got a blood test it would say that I have diabetes. \n\nthis was my breaking point so I screamed at her that she lost the privilege to call me her daughter and to me she’s just my birth giver.  I packed my stuff and left and have been staying over at my friends house. \n\nI don’t know what to do as she has been calling and texting me non stop but there was no clear sign of her apologising. I feel bad as she has tried to raise me to be tough but it’s not who I am. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta I can feel you for having bad relationship to your mom", "NTA what-so-ever. First off, I am soooo sorry you are dealing and have been dealing with this your entire life. Your mother and seemingly your entire family is EXTREMELY abusive. Even if you were 400+ LBS, family that \"loves you\" would come to you privately and say they're worried about your health and try to push you to live a healthier lifestyle, not belittle you and make you feel like garbage. You have every right to feel how you feel and you have every right to never talk to her again. I promise that you will find \"non-blood\" family that will truly love you for who you are. It sounds like you already have at least 1 friend that fits that statement. I hope you find your place in this world and I hope you look in the mirror and love who you see.  Your weight does not define who you are as a person. You have a long beautiful life ahead of you and negativity like this is not going to give you that. Break the chain and leave this toxic ass family.", "You're NTA and I hope you can find a safe place to stay permanently you finish your education and leave for good. Don't waste another minute worrying about your egg donor. Concentrate on making the best future you can.", "Stay as far away from her if you can. Also, if you have diabetes it’s very likely you were born with it, or developed it early bc of how she fed you. Not your fault. I hope you can get a new start in life and flourish away from her."]}