{"id": 24230, "submission_id": "15m3nw3", "title": "AITA for refusing to become friends with my husband's former wife after donating bone marrow to my stepson?", "selftext": "I've been married to \"Chris\" for 10 years. Before me, he was married to \"Lacey\" for 8 but they were together since high school. They have four kids. Chris and I have two.\n\nLacey hated me. It was beyond our personalities. I think she was bitter over being divorced and seeing the man who she was with since 16 move on. But that's her problem not mine. We've gotten into it a few times. I'm not apologizing to her because I'm happy and she's not.\n\nChris and Lacey's youngest son \"Jacob\" was diagnosed with stage 3 lymphoma and needed a bone marrow transplant. Unfortunately no one in his family was a match. I also got tested and was a match. Lacey actually asked me if I was going to donate like I'm some kind of witch.\n\nOf course I donated and Jacob is in remission as of this year and is your average 13yo kid. Lacey has started to come around to me because she knows what I did for Jacob. That's her favorite son. It's bizarre to have her ask me how I'm doing or send me random flowers.\n\nThe truth is that I don't want to be friends with her. The damage has been done between us and my life is peaceful without her. I'd do what I did a million more times if I had to. No need to shower me with accolades. Just leave me alone. That's exactly what I told her.\n\nShe told me that what I said was the most hurtful thing anyone has ever said or done to her. My husband said I should apologize but I refuse to apologize for setting up boundaries with someone I can't stand.", "created_utc": 1691552006, "permalink": "/r/AmItheAsshole/comments/15m3nw3/aita_for_refusing_to_become_friends_with_my/", "score": 1177, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My husband's ex wife and I don't get along. Their son came down with cancer and no one in the family was a suitable match. I tested and was a match and donated. Now she's trying to be my BFF and I told her I'm still not interested and to leave me alone.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "\"I had to literally save your child's life (which by the way, I did not do for *you*) in order for you to change your view of me. But I didn't deserve your hatred for all those years, and you deciding that I'm now 'good enough' doesn't magically undo the way you treated me when you thought that I wasn't 'good enough.' You owe me years worth of apologies and attempts to make it up to me. But the best way for you to start making it up to me is to leave me alone. The fact that you refuse to do that and are instead trying to make me feel bad for you tends to indicate that you aren't actually sorry for how you treated me. And if you don't regret what you did, then what are we even talking about?\"\n\nNTA. You never owe anyone your friendship. As long as you treat her politely (even if it is distant politeness) whenever your paths cross, you have fulfilled your social obligation.\n\nAnd I'd be curious why your husband thinks you owe her an apology for establishing a legitimate boundary.", "NTA. You’re allowed to have boundaries and She needs to respect your boundaries.", "OP I agree with you 100% - why in the world can't people respect other people's boundaries?  If you want nothing to do with them, then why can't they leave you alone because you said there's nothing more to say?  The damage has been done, there's no going back to rectify the situation, you came through for Jacob which is what you did as a co-parent, you want life to be as it was before everything happened.  People look like I'm crazy when I tell them the same thing when I have moved on from their drama.  Stick to what makes you at peace.", "NTA. Asking to be left alone and not be guilted about it is not a big ask. And you are owed a favour", "I'm gonna get hate for this but NTA.\n\nThe best thanks she can give is to leave you alone. But she couldn't even do that.", "NTA\n\nI’m so glad you were a match for Jacob. Best of luck to him as he recovers.\n\nLacey is feeling gratitude and guilt and all manner of feelings rolled into a ball. It’s great that she’s appreciative of what you did. But it’s not okay for her to insist you be bestest buddy buddies now, and it’s *certainly* not okay for her to claim that you not wanting to be friends is hurtful to her when she’s rejected you from the outset.\n\nYou don’t need to be besties with your husband’s ex. That’s a perfectly acceptable boundary. She needs to accept it. And so does your husband.", "NTA.  This person said it better than I can:  https://old.reddit.com/r/AmItheAsshole/comments/15m3nw3/aita_for_refusing_to_become_friends_with_my/jveeekr/", "NTA but the way you talked to her makes me ishh. Did he cheat on her with you? Or did you guys get together when they were separated?", "INFO: How soon after they split did you and Chris get together? Did that play into her feelings?\n\nI can't say I am fond of the way you talk about her. \"I am happy and she's not\" and the like.", "I wouldn't say YTA, but I do say Eesh, for handling that without a bit more grace.  I totally understand why you wouldn't want to be friends with her.  I think I would've said basically the same thing but phrased it more softly, like  \"I don't want accolades, I love your kid/s and would do it again in a heartbeat. I don't want an on-going conflict, but I also don't want to stay in touch or be friends.  I won't ever say a word against you in front of your children, but you and I cannot be friends, that ship sailed.  Wish you only the best\"    \nJMO.", "YTA. This woman is the mother of your children’s siblings.  Of course she was hurt that her ex moved on and probably painted you as a witch. Now she has been humbled as she found out you can be a good person. But you are still acting like a bitter witch yourself!  Get over it. Again, this woman is the mother of your children’s siblings! The better your relationship with her, the better it is for your children and your step children. \n\nIf saying the simple words, I’m sorry, is so hard try, hey xxxx we kind of were in a rut of bad feelings and bad communication and you got past it before I did. I reacted in a negative way, and I am ready to move past that.  No sorry on that, just a statement of fact. \n\nBut if your heart really is so full of hate that you can’t get past it, well I feel sorry for you and your soon to be ex-husband and your kids and your soon to be ex step kids.", "People can change you know? She is doing the effort to say sorry, shouldn't you try too. I don't say let her be your best friend, but for your Patchwork family it's at least worth a try. And seriously if your husband would divorce you and found a third family you surely wouldn't love no 3 too.", "ESH - it sucks she was so awful to you, but some people change after huge terrifying life events. I really think you could handle this with a little more kindness. You did something so kind, so loving…and now she sees you in a different light. You don’t have to be friends with her, but it won’t kill you to not run her olive branch through a wood chipper. At the end of the day you’re still helping I parent, so any improvement in this relationship is a good thing.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI've been married to \"Chris\" for 10 years. Before me, he was married to \"Lacey\" for 8 but they were together since high school. They have four kids. Chris and I have two.\n\nLacey hated me. It was beyond our personalities. I think she was bitter over being divorced and seeing the man who she was with since 16 move on. But that's her problem not mine. We've gotten into it a few times. I'm not apologizing to her because I'm happy and she's not.\n\nChris and Lacey's youngest son \"Jacob\" was diagnosed with stage 3 lymphoma and needed a bone marrow transplant. Unfortunately no one in his family was a match. I also got tested and was a match. Lacey actually asked me if I was going to donate like I'm some kind of witch.\n\nOf course I donated and Jacob is in remission as of this year and is your average 13yo kid. Lacey has started to come around to me because she knows what I did for Jacob. That's her favorite son. It's bizarre to have her ask me how I'm doing or send me random flowers.\n\nThe truth is that I don't want to be friends with her. The damage has been done between us and my life is peaceful without her. I'd do what I did a million more times if I had to. No need to shower me with accolades. Just leave me alone. That's exactly what I told her.\n\nShe told me that what I said was the most hurtful thing anyone has ever said or done to her. My husband said I should apologize but I refuse to apologize for setting up boundaries with someone I can't stand.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I get the feeling she's buttering you up in case the kid needs a match for something down the line", "OMG this.  You nailed it", "OP is not owed a favor for doing what parental figures should do. She didn't do anyone a favor by donating bone marrow.", "About three years", "She’s still trying to make op the bad person in this situation. Imagine being terrible to someone for years and just expecting them to become friends with you.\n\nhttps://www.reddit.com/r/AmItheAsshole/comments/15m3nw3/aita_for_refusing_to_become_friends_with_my/jveeekr/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3\n\nThis should be the top comment because a lot of people here seem to think she should just accept her", "That heavily depends on whether OP is actually a parental figure. Step-parents are often treated differently from real parents, and this feels like one of those situations. \n\nOr at the very least, the ex didn’t seem to want OP to act like a parental figure. In which case, I say the favour still stands.", "Did he leave her while she was pregnant? \n\nIn the end, a working co-parenting relationship is best for kids of any age. It's late but it could happen if you are both willing. \n\nESH overall.", "NTA. She's receiving the energy she sent. You gave bone marrow to her son. It hzd nothing to do with her", "NTA\n\nThere’s nothing to apologize for. She was awful to you. You donating bone marrow is about the kid, not her. She’s the collateral beneficiary, but it doesn’t mean you have to forget her past behavior. I don’t even understand why your husband would want you to apologize! She needs to apologize for years of bad behavior.", "Nope, you’re good, 1Mx NTA. And you don’t know her any apologies. And you do not owe her any time. You did what you did because you’re a good human being.\n\nShe’s not entitled to the time of day from you. And they can all stuff their “apologies”.", "Wow you donated bone marrow to her kid and she's STILL managed to set up a situation where you're in the wrong and she's the victim- what skill!", "> My husband said I should apologize\n\nYour husband is ridiculous. You owe this person less than nothing.", "NTA \n\nif the \"most hurtful thing anyone has ever said or done to her\" was someone telling her \"i don't want to be friends with you because you treated me like shit\" she must have lead a blessed life", "NTA. Her brain is scrambling for a way to get things back to \"normal\" where she can be the \"victim\" and you are the \"villain\" again, hence her dramatic reaction to your reasonable \"we don't have to be friends\" line in the sand. And the part she's likely finding difficult to reconcile is that you did the selfless thing. And you're still being selfless about it by not lording your good deed over her. \n\nThat's a her problem. \n\nEnjoy your boundaries and your life.", "INFO:\n\nWhy do I get the feeling there is a missing reason here?\n\nYou paint her to be the bitter jealous ex-wife while the math is questionable at best. \n\nShe is grateful and is trying to show that, doesn't make up for all the other stuff but this feels iffy.", "YTA.  But you are both parenting their children. Is it worth it.", "Hard to say without more info about the conversation. You're not TA for not wanting to be friends, but you may have been TA for the way you communicated that.", "Wish I had an award to give you!!! \n🥇", "This is the way, very well written!!", "Where do you see the math not adding up?", "People can change. And the way they *demonstrate* that change is by profusely apologizing for their actions and trying to repair the harm they've done while giving absolute respect to the boundaries of the person they've harmed.\n\nOP's description of the ex's behavior doesn't indicate a woman who has changed or even one trying to say sorry: instead, it sounds like someone who superficially wants to sweep the past under the rug but is unwilling to put forth any real effort into self-reflection. And we can see how superficial it is by looking at her response to OP's boundaries: instead of acknowledging that OP has every right to feel that way, the ex is trying to guilt OP into comforting *her*", "This comment is of equivalent worth to an award.", "That timing doesn't make sense - you've been married 10 years but he was seperated 3 before you met and the step son is 13 .... So you married as soon as you met and he left his ex wife while she was pregnant or immediately after birth?\n\nAlso what's the age gap and why did their marriage end? I feel like there is a lot missing.", "It's adds up in the no affair sense, but the final results don't match 'bitter jealous ex' it equals 'left while pregnant with three young kids so reasonable hostility expected'.\n\nEdit: Happy Cake Day 🎉", "NTA - you didn’t do it for her. \nShe just doesn’t want to be the person that hates the woman who saved her son’s life.  \nHer wanting to be your friend is all about her.", "Not sure what you have to apoligize for. You told her that you do not want to be friends with her. You don't need or want her thanks for helping your stepson. \n\nTelling her you would prefer to just have things the as they were between, maintaining distance, is fine. \n\nAsk your husband to point out specificly what you have to apologize for. He won't be able to. Her getting her feelings hurt because yod don't want to be friends is not on you. \n\nNTA", "NTA\n\nYou didn't do Lacey any favours, you helped out Jacob.\n\nYou don't have to accept anything from Lacey.", "NTA  Some people do have a hard time understanding that yes, you are willing to help save her son's life but at the same time, you don't want her involved in your's in any way, shape or form because of her previous issues she had with you.  You did what you thought was right and are okay with not being her bestie.", "You gave your bone marrow and now you need to be friends and apologize to her?\n\nWtf is wrong with people?\n\nNTA.", "NTA. If you don’t want to have a relationship with someone, you don’t have to. You’re adults and it’s that simple.", "INFO: entirely depends on what you said and how you said it. Are you an asshole for not wanting to be her friend? Of course not. \n\nThis can go either way. This could be a nervous, desperate mum cautiously asking if ‘you would actually donate’? And you’ve taken that the wrong way. And you interpret everything she says in a bad light. Or it could be she does hate you and it did take this marrow donation for her to like you somewhat. \n\nShe could be reaching out to ‘bury the hatchet’ and sending you flowers as a genuine act of gratitude. And you could have told her very sharply and with anger and insults ‘just leave me alone’. Or it could be she messaged you and you politely said ‘just leave me alone’.\n\nWhen people hold grudges for years, a lot goes on between the lines. It’s impossible to say if you acted like an asshole with what you wrote cos there’s so much that isn’t here. Especially her intentions and also what and how she and you actually said things. \n\n‘Just leave me alone’ is rarely taken as ‘the most hurtful thing anyone has ever said or done to ‘me’. There’s a LOT missing from this…", "NTA\n\nShe hated your guts for nothing you did wrong and only when you became of use to her, she started appreciating you? You taking care, at least in part, of her kids wasn't enough to make her at least tolerate or accept you? F her.", "ofcourse we are missing the info of how the first relationship ended. maybe it was an affair and lacey was right to be bitter.", "YTA", "YTA, So dramatic...she's not trying to be your friend she's just trying to be grateful. If she didn't do anything and carried on as before, you'd probably call her an asshole. Unless she's actively trying to hang out with you, just take the flowers and move on with your life.", "NAH", "i wouldn’t say your TA but y’all should definitely ease the tension and quit acting to snobby to eacother for the kids sake since they are the most important people here", "NTA never will be", "NTA", "NTA. She should be happy enough that you are so kind that her bitterness towards you did not affect the relationship to your stepson", "NTA...   such a twisted Ex..  her flip side could reappear at any time to suit her.. best stay well away..", "Sorry, hit the wrong award. Think of it an Oscar for best writing", "Best comment ever. OP should text this word to word.", "This is the way", "This is exactly what OP needs to say.", "Bravo, this is it.", "This!! Imagine you spend all these years likely venting to your friends and family about how \"horrible\" your ex's new wife is; and then they save your child's life and ask for nothing in return. Kinda makes you look like the AH doesnt it?", "The woman is embarrassed and begging forgiveness for her own behavior to the woman who literally saved her son’s life.", "Yeah, that apology should be; *”I’m sorry I’m not a complete pushover that’s so desperate for validation and friends that I let someone who has treated me like dirt for 10+ years stomp all over my boundaries and pretend to be her BFF, **after** she implied that I wasn’t going to donate life saving bone marrow to my stepson! I’m sorry I’m not able to do that kind of acting, to protect her guilty feelings to be soothed!”* \nNTA", "Agree. Don’t know how people are making judgements when there is information missing here and what we are offered is very clearly biased", "I agree with this - not necessarily with the YTA vote, but I also didn't get the impression that the ex wife was trying to be OP's friend. Sending flowers to thank her and asking how she is isn't an overture to friendship, it's just basic civility in this situation, and that is a good thing because their relationship should be civil.", "Aka: I want to hate op but I got nothing so I'm going to insinuate bullshit like some 17th century housewife bleating about witchcraft.", "So the woman was “of course” hurt and treated OP like a witch, but if OP is hurt by the years of that treatment and doesn’t want a closer relationship, then she really is a witch? And she should apologize to the woman who as been unkind to her for years with no apology, because she didn’t move past the woman’s rudeness as fast as the woman moved past her own behaviour? Fuck that.", "Except she hasn't said sorry, yet has made OP the bad guy for not wanting to be her friend. She is manipulative as fuck", "A favour to... be left alone? She's not asking for a house ffs.", "Wait, what?", ">She didn't do anyone a favor by donating bone marrow\n\nExcept... maybe the god damn kid who has cancer? Lol", "OP is 28 at the youngest and her husband is 37 at most (dating at 16+8 years with ex +3 between +10 with op).", "I’m team NTA, because everyone can set the boundary of “I don’t want you in my life” for pretty much any reason, but, I agree, I also didn’t like the tone throughout the post🤣", "NTA. If that is the most hurtful thing anyone has ever said or done to her, then she has lived an incredibly privileged and sheltered life. But I highly doubt that it is, instead she is just trying to make herself the victim and you the villain, again.", "NTA. The Situation is complicated, and maybe the Bone marrow thing broke the Spell his ex was under. But it is up to you to decide what you want. As long as you dont hold it over her head (which you did not) all is good imo.", "NTA\n\n A little late now for friendship. Your life is peaceful and happy as it is. Plus, if the youngest kid is 13, in 5 years, you won't need to deal with her at all, except maybe at special events.", "You don’t have to be friends, but being gracious in this situation would have solidified a more peaceful family dynamic. Tension between moms rarely goes unnoticed. You saved her son. Something she couldn’t do. Then this woman who’s she’s treated so awfully who represents so much anger inside, is a match. Suddenly not only could you save his life you were willing to do so, because of how much you love him. What a humbling experience it must have been for her to feel so much guilt and gratitude at the same time. \n\nAlso, I’m so curious you left out all ages of adults and kids. Was there any overlap between where they ended and you two began? I’m wondering what could fuel 10 years of animosity.", "YTA Of course she’s going to be grateful to you for saving her son’s life. She’s not trying to hang out with you. Just accept her greeting or the flowers and move on. You seem to enjoy hating her.", "INFO - *how* you told her you didn’t want a new relationship with her is the critical detail to the AH designation. That detail isn’t in your post. Your desire to not have a relationship is not an AH thing. How you went about shutting down Lacey’s attempts to start a relationship is everything in making an AH judgment t in your situation.", "Yta\nYou sound very sooty.  I happty shes ot. Maybe she is trying to thank u. Accept it gracefully ad move.  This is your step-kids mother.  Your attitude will hurt them.  Shes not going to be left out at their life even ta.  How do u think hour attitude is going to affect step kids. Youre not  invited?", "INFO: are you related to Jacob by blood?  Because the chances of two unrelated people having compatible bone marrow, even if they're the same race, is at least 1 in 10,000 (from what I've read).  That's why they depend on a massive database of willing bone marrow donors rather than asking friends of the recipient to get tested.\n\nI would have believed you were a kidney match, but not for this.", "INFO: how old was jacob when he was diagnosed/you donated bone marrow?", "NTA.\n\nYour husband needs to shut his trap up. You did a wonderful thing, and you do not need to pay for it with having to be all buddy-buddy with his ex who you don't want to get along with.", "Nta this is the consequence of bridge burning", "NTA OP.  You don’t need to apologize to someone who treated you like crap, and only came around when you donated bone marrow to your stepson.  Be polite whenever your husband’s ex comes around, and if by her actions she shows that she is truly sorry for the way she treated you, then MAYBE consider giving her a chance.", "NTA.  You can be civil, but if you don't want to be friends no one says you have to be.  You definitely don't owe her an apology.  Where was her apology for years of attitude towards you?  By the way, that was an amazing thing you did.", "Why should I apologize to the ex? He has never been nice to her until now!!! The husband really has some nerve to be pissed at his wife. I guess the ex openly admits that it is her favorite son, how cruel to the other kids!!!!", "Nta. You are never obligated to give anyone your time or attention or to be friendly to anyone if you don’t want to. Her past behavior, current attitude, all of that is irrelevant imo. You don’t want to be friends and she needs to take the hint.", "Nta, it sounds like she wanted to pretend the 10 previous years never happened. She wants a clean slate with no accountability. \n\nIt’s insulting you had to do this courageous act before she would be nice to you.", "NTA", "\"If you truly want to thank me for saving your son's life - even though I did it for him, not for you - ***then please leave me alone***\"\n\nNTA", "NTA The relationship you have with him is entirely different to the relationship you have with her. She's said her thank yous, time to move on.", "NTA", "If what you said to her was the most hateful thing she's had in her life, evah, then I genuinely worry for her - what's it going to be like for her when she realises that there's a whole world outside her princess bedroom?! Seriously, you've done fantastic. You saved her child's life. That does not mean that she can't fuck off, then fuck off some more; had she treated you with any common courtesy then that might be different.\n\nI'd have a serious word with your husband, though, if I were you, he needs to listen. NTA", "NTA. But I mean, she clearly feels like she owes you something. \nIt’s not fair of her to have treated you how she did. \nAlthough it would be ridiculous if anyone to not say they understood to a degree.", "NTA. It's nice that she is grateful. But you're right. You don't need anything from her.", "NTA.  You need to show your husband this post and replies", "You saved the child's life which is NTA point number 1. Another NTA point is that you chose not to be friends with someone you can't stand and won't care for you.", "NTA - you do not owe her friendship. \n\nYou do not like her. \nYou have reasons to not like her. \nShe has to let it go.", "NTA, I'm sure she's said worse about you or to you.", "Holy shit. This is the perfect response. Please copy and paste this into an email or text and send it ASAP. \n\nCan I just say this…..\n\nSome people are assholes. The don’t use the right words and always say the wrong thing and offend people. And, even though she is guilting you and you have no reason or obligation to become BFF’s with her. You SAVED HER CHILD’S LIFE. She probably feels like you also saved her life. You saved her family’s life. I cannot even imagine what losing a child would be like. And then the person that saved his life was the very person you treated like shit just because she married your ex. \n\nI am not saying you should give her a chance. I’m not saying to relax any boundaries. But, FUCK!  you’re a goddamned hero. Thank you for helping that boy. You’re an absolutely excellent human being. You 100% deserve the peace you want. I hope you get it. And I hope Jacob’s mom learns the grace she needs to respect your boundaries. \n\nJust, honestly….. I don’t know if I could leave you alone. I think I would beg for your forgiveness until someone had to finally lock me away.", "He probably wants her to apologise just so he doesn’t have to deal with the aggro", "Why do you think you’d get hate for that?", "Why does she need to bury the hatchet? She donated marrow something she didn’t have to do and technically she could have done it and demanded to remain anonymous if she wanted to. This woman’s been rude and nasty to her up until this point and OP asked to be left alone. She’s not responsible for easing the guilty conscious of a grown adult who acted like a temperamental child. Just because you apologize to someone for your bad behavior doesn’t mean they have to pretend like it never happened and be friends to ease your guilt.", ">Just leave me alone’ is rarely taken as ‘the most hurtful thing anyone has ever said or done to ‘me’.\n\nI guess the ex wants to go back to a \"time\" where op was the villain and she was the good one.", "OP said she met her husband 3 years after the divorce, so no.", "Given she came in his life when he was 3 and it's been 10 years, he'd be 13.", "OP is not acting like a bitter witch or full of hate. She simply has no interest in suddenly playing nice with someone who has treated her like crap for years because now the ex feels guilty. Asking to be left alone is not unreasonable. In what world does OP owe ex the apology? Let husband deal with his co-parent.", "[removed]", "[removed]", "What are redditors going to say when they do away with the awards? \n\nI wish Reddit still had awards and that I had one to give you?", "Totally agree. And if you apologize then it will confirm in her mind that you did something wrong.", "there’s this thing called bodily autonomy and no one can make another person donate anything, legally, she’s also not blood related so your point is moot.", "More than likely the old 'keeping the peace' bs.", "OP mentioned some love-bombing and no apologies for past behavior. Not sure where you're getting 'begging forgiveness'.", "It's very reddit to affirm the majority opinion but pretend it's controversial.", ">Why does she need to bury the hatchet? \n\nWho said she does? No-one in this thread said she needs to bury the hatchet...\n\n>She’s not responsible for easing the guilty conscious of a grown adult who acted like a temperamental child. \n\nYou have half of one side of the story. Probably best not to make such snap judgements. \n\n>and OP asked to be left alone.\n\nNo-one takes a simple request to be left alone as \"the most hurtful thing you've said or done...\" OP clearly isn't sharing the full story of what was said or done here. As I said, anyone in this story could be the asshole or there could be a lot of nuance. There's *clearly* a lot that hasn't been shared and a lot that has been left out through bias.", "That's exactly it, you're \"guessing\" about what the ex is thinking based solely on an obviously biased post by OP. It could very well by the ex is an asshole. But OP *chose* to omit some obvious information about what was actually said and how it was said. No-one legitimately takes \"just leave me alone\" as \"the most hurtful thing anyone has ever said or done to me\"... more was said and done. We have no idea who the asshole is... but OP hasn't been entirely honest.", "That wasn't my question. My question is when did she give bone marrow. If it was recently i'll agree with the n-t-a but if it was like back when he was 5 or something that's a different story", "But she’s a woman. In the US women don’t have bodily autonomy.", "Or as an early poster it may have been an unpopular opinion at the time. Not everyone is an AH.", "> You have half of one side of the story. Probably best not to make such snap judgements.\n\nThis entire sub is based on making judgements from one side of the story.", ">you're \"guessing\"\n\nSo are you\n\nThe point that op doesn't have to be friends with her still stands. This woman hated her for years and now wants to be bffs?? Lol. In 5 years she won't have to deal with her anymore.", "Then maybe the ex should be hostile to the HUSBAND WHO LEFT HER and not the innocent woman who none of them had met yet?", "You got me there", ">This entire sub is based on making judgements from one side of the story.\r\n\nYep, that's true. As is true that OP's story doesn't add up. Again, no-one says they are \"the most hurt ever\" by \"just leave me alone\". So yeah... INFO. Clearly there is something missing OP isn't telling us which prevents us from saying she isn't the asshole...", ">So are you\n\nNo... I am not. I am literally asking for more INFO. Saying we can't tell who the asshole is based on what's been said so far. Check the very first word of my comment. And then check yourself...\n\nEDIT: I believe the person below blocked me and called me a stupid fuck in Romanian, after they couldn't take admitting they were wrong... I guess we found one asshole here.", "Maybe she is. Maybe there are 101 things we don't know about the situation.", "Check yourself prosta dracu'", "Okay, then why is she taking it on someone who had nothing to do with it?"]}