{"id": 24239, "submission_id": "15matc1", "title": "AITA for telling my mother I will never forgive her for how she believed my sister’s lies over me a few years ago?", "selftext": "I bought a computer for study a few months ago. About 2 years ago my sister spilled tea all over it, she never apologised, never admitted it, never offered to pay for a new one. I am convinced my mother doesn’t believe me what happened that night and that is why she has never said anything to her about it. For the record I am 28 and she is 33. I am still upset about it today but whatever. I bought a new one a few months ago and have resulted in becoming possessive over it. I’m scared it will be broken again and I don’t let people touch it. The other day I got up for two minutes, sister came back from a walk, I usually put the thing away when she is around. I got up for two minutes and by the time I got back she had thrown her rubbish on it to spite me. Ice cream wrapping just to spite me. I was crying and screaming in frustration begging her to stay away from it. Mum told us to shut up calling us animals. I turned on her and told her to shut up. I’m trying to protect my property and I’m not spending more money. I told her she sat back and did nothing while the computer was being broken the last time and how she believed my sisters lies over me, which I’ll never forgive her for. \n\nI know I probably overreacted, I just got so upset. AITA?", "created_utc": 1691575031, "permalink": "/r/AmItheAsshole/comments/15matc1/aita_for_telling_my_mother_i_will_never_forgive/", "score": 3236, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I believe I might be the asshole when I screamed at my mum to shut up because I overreacted over a computer\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Are the ages right here?    You both seem and sound about mid teenager .", "ESH\n\nYou are 28. And your sister is 33. Is there a reason why you need your mother to mediate between you two like you are 12 years old? When I fight with my adult sibling I don’t go to my mother telling her “you need to scold them”. It would be ridiculous.", "NTA for being protective… but you guys are grown adults so I have a hard time believing the ages and validity of this post 😐. Save up and move out if you dislike your sister and mum that much, laptops get broken. Yes it sucks that your sister(to you) broke it and it wasn’t replaced but things happen. If no one died and no one injured it can be fixed and you learn to move on, which you need to move on by moving out and living your own life where you are around people you currently dislike. \nIts that or you have a mature conversation with your mum, apologise for shouting at her (even if you disagree), and get to the bottom of what happened to your laptop. But its been two years and it was just a laptop… harsh but again no one died and no one was injured.", "ESH  \n\n\n28 and 33 and you're still living with your mother? Screaming and wailing, you both need to grow up and get away from each other. Quit dragging your mother into this ridiculous crap.", "NTA \n\nInteresting that commenters feel different about this so far :o \n\nI do think it was an overreaction on your end and you would benefit from communicating and regulating your emotions in a more productive way, however i think your hurt feelings for 1. your sister not respecting your things as is and even intentionally tries to irritate you or get you legit mad and 2. you feeling that your mom doesnt care about you, your items, your hurt feelings, your felt unfairness and the disrespect of your sister is definitely valid and that it released in that (maybe over the top way) is very understandable to me!\n\nI‘m guessing the laptop situation is not the only event that made you feel disrespected by your sister and uncared for by your mother. There is a lot of work to be done here between all of you in my opinion", "ESH\n\nThis seems like a very toxic environment, and if I had to guess this goes way deeper than a computer.", "I’m sorry, is this real? Are there actually grown ass adults that act this way?", "ESH and you guys need to get some therapy. Your brains seem stuck at a 13 year old level. Obviously you can’t make your family go to therapy, but do yourself a favor and get there like, yesterday. And for God’s sake if you can find any way out of that house GTFO. Super unhealthy dynamic.", "Bit of an overreaction on your part don’t you think? You’ll never forgive your mother for not getting in the middle of her two grown ass daughters fights?? Grow up, you are too old for that shit. \n\nYou can be upset at your sister. But don’t rely on your mommy to get in the middle of you two in your thirties.", "ESH - You need to move out and so does your sister! I’m guessing your mother didn’t want to take sides.", "YTA. You overreacted and can't emotionally regulate which needs work. Your sister is childish and you both need to move out of your mom's house. Also, I'm not sure that the title matches the story. If you're dramatically screaming at your mom you'll never forgive her because years ago your sister lied about spilling something on a laptop and your mom isn't on your side/is over it, you need to speak to a mental health professional.", "ESH. You two are grown women. Why does your mother need to be involved at all?", "Have you tried destroying your sisters things? Throwing trash or pouring mouldy food on her jewellery. Tell her anything done to your items, you will double it back to her. She breaks it? You take her belongings and sell them.\n\nNTA", "YTA. That's a really shitty thing to say to your mom over a material object. I could understand if your sisters lies harmed you in anyway or they beat you or..literally anything other than this.", "NTA. Your frustration about your sister damaging your computer is valid. While emotions ran high, effective communication is crucial. Express your feelings calmly, focusing on finding a solution. Set boundaries for your belongings in a constructive way to avoid escalation. It's vital to discuss the incident with your sister, explaining its impact and hearing her side. Holding onto grudges can harm your well-being, so consider forgiveness for your own peace of mind. Instead of saying you'll never forgive your mother, express your feelings openly about needing her support. Family dynamics are complex; seeking a healthier approach to conflicts can lead to better resolutions and relationships.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI bought a computer for study a few months ago. About 2 years ago my sister spilled tea all over it, she never apologised, never admitted it, never offered to pay for a new one. I am convinced my mother doesn’t believe me what happened that night and that is why she has never said anything to her about it. For the record I am 28 and she is 33. I am still upset about it today but whatever. I bought a new one a few months ago and have resulted in becoming possessive over it. I’m scared it will be broken again and I don’t let people touch it. The other day I got up for two minutes, sister came back from a walk, I usually put the thing away when she is around. I got up for two minutes and by the time I got back she had thrown her rubbish on it to spite me. Ice cream wrapping just to spite me. I was crying and screaming in frustration begging her to stay away from it. Mum told us to shut up calling us animals. I turned on her and told her to shut up. I’m trying to protect my property and I’m not spending more money. I told her she sat back and did nothing while the computer was being broken the last time and how she believed my sisters lies over me, which I’ll never forgive her for. \n\nI know I probably overreacted, I just got so upset. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Not every culture has parents expecting their kids to leave the minute they turn 18. In some countries, children live with their parents way into adulthood and the parents and children both like it.\n\nHowever, in this case, I would’ve moved out if I were OP. Seems like a toxic environment overall with the mom siding with the sister, sister hell bent on making OP’s life miserable, OP not saying anything till they exploded. I agree with ESH, but OP sucks the least.", "Right? You'd think someone in the household can act mature enough about the situation but they all act like angsty teenagers", "33 isn’t a fresh 18. Move out!", "Why though? It’s not necessary for kids to move out as long as they’re contributing in some way. Why can’t they live with their parents till they get married or a job takes them elsewhere? You don’t have to do something you don’t want to but you have to respect when someone else makes that choice.", "Sounds like the mom doesn’t have much choice here.", "Care to mention how you managed to deduce that? Because no where is this implied or stated.", "Adult daughters throw garbage on each other’s things, scream, throw tantrums, etc. \n\nThose are your dream roommates??", "Switching from “a few years ago” to “a few months ago” back to “a few years ago” just in the title and the first two sentences really breaks the immersion. Part of fiction writing (or any writing) is proofreading.", "NTA. But you are both old and should beliving on your own now. Why isnt that?", "ESH. Are you and your sister actual idiots? 28 and 33 and you behave by throwing rubbish on each others belongs, screaming and wailing and running to your mother. I’d say you need to move out but  both of you sound absolutely dysfunctional and hardly capable of participating in society so I’m not sure how you’d go if you didn’t have mummy-dear with you.", "you did not. if my sister ever broke my pc she would not see daylight again until i have gotten adequate replacement. and stand your ground on the mother front. also high time to ditch them. NTA", "NTA.  It sounds like there's a LOT going on besides this one incident: but it's reasonable to get mad when someone throws sticky rubbish on your computer.  Especially when she's already ruined one.  \n\nSounds like you need to talk to a family counsellor, though.  That's not a healthy dynamic.", "ESH \n\nYou and your sister would fit right in with my students. I teach 12 to 16 year olds btw. Grow up and stop running to Mummy to sort things out for you.", "28 and 33 - ESH for both living at home!", "Why are you both living with mommy? \n28 and 33 adults need to be living on your own.", "ESH. Grow up, both of you.", "ESH  are you sure the ages aren't 8 and 13? Sounds like there are bigger problems if you and your sister are 28 and 33, living at your parents, and crying over ice cream wrappers.", "I'm older than you.\n\nWhen I spend time with my mum, I find myself more like my teenage-self.\n\nYou all might want to consider some space.\n\nSo an ESH for the way you are all treating yourselves rather than the question.", "ESH.  You are 28.  Dont bring this to your mother just sue your sister", "Okay, no, there are definitely the numbers 2 and 3 in front of those ages, reading this sounded like an 8 year old and a 3 year old arguing.", "Well, not forgiving is one, telling her that is two. It hurts you that she believes ur sister over you, therefore you cant forgive her. Which means its an emotional thing, not one you have actual reason for.", "28 and 33? Maybe, I don't know, grow up?", "Most adults never change after highschool.\n\nHalf my job feels like I'm taking care of larger and older 10 year olds.\n\nThat's what I get for becoming a supervisor I guess...", "[removed]", "I don't think that's an inconsistency, just a poor grasp of how pronouns work.\n\n> I bought a computer for study a few months ago. About 2 years ago my sister spilled tea all over it\n\nI think \"it\" is just being used here to mean an older computer. That is a confusing and wrong way to use \"it\", but by OP's own account they and their entire family are idiots so it would track.", "Why?", "OP doesn't have to forgive either of them if they're going to be assholes to her.", "Spoken like person who seems rich. You try replace laptop after laptop while the real culprit walks off scott free and the mother is playing stupid favourite's and letting all this go on.", ">In some countries, children live with their parents way into adulthood and the parents and children both like it.\n\nIn this case, it sounds as if they do not, in fact, like it.", "True but staying in their childhood home doesn't usually equate to continuing to act like children!", "And not every family has this soap opera shit with their adult children. You're missing the point trying to get on your soapbox.", "Lmao. You can think that baseless opinion all you want.", "Yes, which is why I said I agree with the ESH judgement.", "Lol. I could say the same about your's but anyway we digress.", "Because they scream and wail and throw ice cream wrappers on each other's computers!  That's why full adults need to . . . adult!!", "You don’t actually have to respect the choices other people make. You can respect their right to make the choice, but it’s perfectly fine to not respect certain choices or the people who make them", "Why are you talking about imaginary scenarios that aren't in the story you're commenting on?", "Unhinged people maybe. Normal people don't do this", "I don't know if you've realised this, but you've included OP in this.. \"They.. each other's\" - it is only the sister behaving like this. By wording it like everyone is at fault, there is no accountability for the person actually acting badly.", "Mom is free to kick them out. You don’t have any idea as to why they’re staying there. Maybe they’re taking care of mom financially, fired from their job, kicked out of their apartment, simply like living with each other. We literally have no clue. So maybe stop with the assumption that mom is against it.", "28 year old woman can barely afford a laptop but you think she’s supporting her mom financially? 😂😂😂\n\nIt’s pretty obvious you live in your parents’ basement and took my comment way too personally. You should move out too 👍", "You seem a wee unhinged. All this person said was in many cultures this is common, yes even into their 30s people stay at home and some live with their parents forever.\n\nBut also in this economy, it's actually an increasing statistic that people are staying with their parents much longer as the housing market is out of control.", "Ooooorrrrr can't afford the laptop *because* they support mom financially....", "NTA. Siblings that think just through relation *what's mine is yours* really fucking get my goat. My sister and her BF stole a $2k bike of mine twenty years ago and even though *she has admitted to me to flogging it and selling it for drug money* she refuses to pay me back. She has a great job and could easily pay me back but simply refuses to.\n\nI hate her for it.\n\nNTA.", "NTA- your sister sounds horrible and your mom sounds like an enabler.\n\nAnd it sounds like you reached your breaking point.  Is there any way you could have an alternative living situation because what you are living in is not healthy.", "NTA, but your sister sure is.  Are you able to move out?  I would be scared to live with a sister like yours with no parental support in the house.", "Sorry, but you sound like kids of 10-14, not like grown ups. Yes,  you are overreacting, but it is not that relevant what your mother did and whom she sided with.\n\nWhat happened was your sister, a fully grown up woman, 33 years of age, damaged your property, and refused  to take responsibility for that. Right now she basically shows, that she doesn't regret what she did, and will happily do that that again.\n\nGiven, that you are 28 - move out and rent. If you can't afford a place, then share the place. Worse comes to worse - limit your stays at home (there is free internet in the libraries - you could use your computer mainly there).  Then such fights, whether your mother told you sister or didn't becomes irrelevant.", "NTA. Your sister obviously did it on purpose to get a reaction out of you which speaks a lot for her character. I’d have yelled too if my parents had a habit of excusing my sister’s terrible behavior.", "NTA. I know it's often hard to leave parents house in this economy, but I can assure you that your whole relationships, both with your sister and with your mother, will improve the moment you will find a way to go live by yourself.", "NTA wtf is your sisters problem? Not cool to scream at your mom, but I get it. You’re rightfully frustrated. If she thinks it’s funny to purposefully fuck w your expensive belongings, start treating her the exact same way she treats you. It won’t make her a better person or anything and it’s not the right thing to do, but it might feel good (lol) and it’s not your moms job to police her. You need to force her to correct her behavior and she won’t do it through reasonable means.", "NTA. I had this happen to me so many times. My mother ALWAYS took every else's word over mine and my siblings knew it and took advantage of it. Scapegoat child. . It festers.", "I didn't realise that if you lived with your parents as an adult you just had gracefully accept that adult siblings can trash your stuff.  Noted.\n\nESH.  She sounds spiteful and you sound dramatic.  Lock your stuff up around your whole family.", "NTA for eventually melting down but you need to get away from your mother and sister", "ESH, who can tell from your description?  How exactly did this happen:  \" I bought a computer for study a few months ago\"  \"about 2 years ago my sister spilled  tea all over it, \"  ?", "Nta.  Your mom sounds like she really screwed you two up.", "ESH. You’re all adults and yet you are carrying on like children.", "ESH. You're grown adults acting like you're 5.", "Your family is exhausting.  ESH.", "Fuckin hell move out! You’re all too damn old for this shit", "ESH\n\nYou guys sound five. Act like adults.\n\nI'm not surprised your mom is just done and doesn't care.", "Can't you move out on your own?  28 and 33?", "At your age why are both of you still living at home?", "Why are you as grown ass adults, still living at your parents house? Unless you have special needs, you should have flown the nest years ago. Do you have a disability or a special needs that would require 24/7/365 care? \n\nGet a roommate if you can't afford rent by yourself. If you choose to stay, then suffer the consequences of immaturity into perpetuity. \n\nESH", "ESH.  Move out.", "ESH You all sound exhausting.\n\nAct your age instead of like toddlers.    \n\nI can understand why your mom told you both to shut up.    \n\nIt must a joy to live with you both.", "ESH.  You're 28, 33, and at least (hopefully) 51, and your family dynamic is screaming, backbiting and insulting each other.\n\nI'm sorry you grew up in that dynamic, and it's not your fault, but you're more than old enough now to recognize how toxic it is, and it's your responsibility to dig yourself out of it.", "ESH. Time for both of you to grow up and move out. Woof.", "ESH Why are y’all acting like children? Ruining your mother’s life", "You’re 28 and your sister is 33, you’re both living at home acting like toddlers and dragging your mom into your conflicts. \n\nBoth of you should move out and get out of each other’s hair. This is way beyond putting a dirty wrapper on your computer.\n\nESH. Your mother must be exhausted.", "This is not real. This was clearly written by a 12 year old. Anybody who believes this is beyond help.", "As you stated, you are convinced your mom doesn’t believe you and this is why she doesn’t say anything but that sounds like projection. You can’t throw how you feel onto your mother. Perhaps she didn’t say anything because she didn’t care to get involved. \nYour problems with your sister are just that. YOUR problems.. not your mom’s.", "You’re 28 if you had your own place to stay you wouldn’t be dealing with mommy and mommy’s favorite child.", "NTA\n\nYou were never reimbursed and clearly buying a new computer takes a significant chunk out of your disposable income.", "ESH....\n\nBut reading all that...you're 28 and 33? This sounds like 7 and 12. What is wrong with you guys? Your mom isn't wrong, you're both animals.", "ESH. You’re both adults ffs. Throwing trash on a computer? Crying and screaming about it? You need to find your own place to live..", "ESH.This would make more sense if you were 13 and 8. I don't agree with people saying grown adults can't live with their parents, but I do think you and your sister are acting like absolute toddlers, screaming and crying and throwing tantrums. So in your case yes you all need to get away from each other asap, grow up and learn to communicate like proper adults.", "ESH. Why do either of you still live with your mother? If you know your sister is an AH who likes to destroy your belongings, don't leave anything out for her to mess with. Your mother has nothing to do with any of this, as far as I can tell. Lock up your valuables or carry it with you at all times.\n\nYour real issue is that you shouldn't be living with either of those women. Crying and screaming is not how adults set boundaries or fix problems.", "Sorry did you mistype? Surely you meant you are 8 and 13?  ESH including your mum for not throwing you both onto the street.\n\nIt's time to grow up, move out and get your own place where your property will be safe. Do you need this computer for your job? Perhaps it might be better to keep it safe in your room while you aren't using it. And maybe get some therapy for your entirely childish reaction. Your sister is an AH too - your entire family dynamic isn't working and you need to make a break.", "Why are you both still living at home & acting like hormonal teens?", "Lol y’all are both losers", "ESH, time to move out.", "NTA but damn the two of you sound like teenagers", "Girl just move out\n\nNTA", "Move out already.", "even for adults its not unreasonable to be upset when someone believes a liar", "Have you never worked in a customer service position? Lol, kidding, but **yes, they do!**. I work for a power company and I've been screamed at and cussed at because a major storm caused a power outage. People are ridiculous.", "[deleted]", "Not every country has median wages that people can afford to live on. Case in point: Greece has an average salary of 800 euros a month. Rents have skyrocketed thanks to airbnb, digital nomads, tourism and the golden visa scheme, such that 10 euros per square metre is the average rent you can expect to pay. That means you would need 400 euros for an itty bitty 40 square metre studio. You also need to eat and pay bills & taxes on your salary. So yeah, if you can live with your parents, that probably helps keep you above the poverty line.", "Unfortunately, rental prices and home prices (in America, at least), have skyrocketed. A lot of my coworkers live with their parents still, because they literally can't afford to move out, even though we have one of the better paying jobs in our area. I make the equivalent of the household median income for the county I live in, yet still can't afford to live on my own, because the cheapest rents around (which are far and few between) are $1000/mo+...and we live in a small town in a very rural area where most jobs pay $15/hr or less (and I make $20.52/hr, which is about the household median income for this area). The houses have all been bought up by rich assholes who rent them out as air bnbs (because it's a \"touristy\" area in the mountains), or bought by rich old ass mofos to be their \"summer home\".\n\nHowever, I do agree that they're both acting like toddlers. Grow up and use your words instead of crying and yelling.", "Her mother probably established this pattern when they were preteens.", "What a goofy comment", "....OP is autistic, older sister is not.", "This fucking move out it sounds so toxic", "shhh please let's keep these 3 ridiculous people concentrated in one place rather than spreading them around", "Not all cultures are same. For example, in LATAM is extremely hard to be independent and more so if you come from a poor background, none of us know where OP is from hence we should see past the ages (people can still be assholes regardless of their grown ass age) \nNot everybody is a gringo so take that into account", "Just last month a major landlord in my city suddenly raised rent from $850 to $1600. I know more than 1 person who is having to move back in with relatives as a result. \n\nJudging people for living with parents is so 1980s when you could live alone and put yourself through college by simply working a part time job. Not all of us have the same opportunities you had grandpa, get over yourself.", "It's never too late to put the lay of the land on an entitled, spoiled little witch.", "This one needs more upvotes. It’s insane how the comments section is vilifying OP just because she still lives with their parents as an adult, like the economy and housing market isn’t absolutely fucked and like it’s somehow “equivalently childish” to hit a limit after soneone breaks your stuff and then throws trash on it just to upset you on purpose. \n\nI agree with the comments that OP should try to move out… BUT, because their sister is abusive and their mother is an enabler at best. They’ll be better off living on their own ASAP, even if it’s financially rough. Living in an abusive situation can stunt your emotional development, but it’s not an inappropriate reaction *under the circumstances*. \n\nNTA, OP.", "How’s the mom’s fault? Why does she needs to mediate between her 2 adult daughters? OP needs to grow up", "This! When I go back home I swear I go back to my fifteen year old self and it’s not pretty. I think it’s time to move the hell out OP", "For REAL", "[deleted]", "In my country people live with their parents until the late 20s because the economy is shit. People want to move out they can't afford it though", "I 100% agree, idk why you got downvoted, seems like no-one wants to hear the truth 👍\n\n\nI take back what I said, OP is autistic, Source: Previous Post history. You have to look at the situation from a slightly different angle and perspective now. My apologies for my previous comments.", "> I am convinced my mother doesn’t believe me what happened that night and that is why she has never said anything to her about it\n\nYeah, but do we even know that the mother believed a lie? From the quoted statement, it's not even clear that the mother believed the sister. She could have easily ignored a dispute between her adult daughters, and OP interpreted that as taking a side.", "OP DOESN'T even know the mother believed the sister, though. OP just said: 'I'm convinced my mother doesn't believe me what happened that night, and that is why she has never said anything to her'.\n\nMaybe the mother just wants to stay out of squabbles between adult children, and/or doesn't feel she can be sure enough what happened either way (whether it was accidental or intentional). Indeed, she certainly seemed sick of their fighting over the latest incident (ice cream wrappers and other things put down on the top of the computer, which may or may not have been done to wind OP up) - telling them BOTH to stop behaving 'like animals'.\n\nOP and her sister both sound very immature and childish. This is basically like one young child trying to wind up her sibling, by messing with her toy - and the other running to Mum about it. As frustrating as the sister may be, OP needs to stop trying to drag their mother into 'disciplining' the sister (at their age). \n\nIf OP can't afford to move out, she needs to either deal with her sister herself (hell, threaten to break her stuff also, if you need to stoop that low). Or she needs to lock her stuff in her room, away from her sister. This was an argument about the assumption that her sister (returning from a walk), deliberately placed things down on OP's computer. Screaming and crying, and threatening to 'never forgive' her mother (because her mother didn't 'discipline' her sister a few years ago), is too much at 28.", "Yeah, OP really needs to get on winning a lottery already. Not sure why they haven't yet.", "Some people can’t afford to constantly buy hundreds of dollars in laptops and a lot of people can’t afford rent", "And not every culture is western. I think some people, particularly Americans, think all of reddit live by their standards. In some cultures, women don't move out until they are married.", "yeah the hispanic american culture im from is fine with kids staying a long time for example.\n\nthat said 28 and 33 with full time jobs is a bit unusual even for us.\n\nbut that aside even for adults its not unreasonable to be upset when someone believes a liar", "Actually, pretty much every culture apart from post-1940s USA has people generally stay with their parents until they have a good reason not to. You only get people moving out almost immediately when you have massive expansion of the housing and jobs markets, but it's what boomers grew up with so it's what they think is normal.\n\nIt's like how we think of Christmas as snowy almost entirely because there was a cold snap through Dickens' childhood.", "I think you forgot about the Greek insolvency issue from a decade ago that almost collapsed the EU.   Tons of national debt was wiped out in complex refinancing schemes which are still having broad effects on the economy.    Gonna be awhile before that country can actually climb onto equal footing with other countries in the EU.", "Probably because she enabled sister acting like this all through their childhoods. It’s almost certainly a pattern, not a one-off.", "Clearly not OPs sister. The only way to get through to them, is display the same behaviour back.", "Yeah no one HAS to do anything. It is just the way forward if OP wants peace of mind.\n\nThey are 28 and 33 not 8 and 13.", "[deleted]", "I think you forgot Europe, or at least big parts of it. I left home at 18 to share an apartment with a friend. Most of my friends did. It’s not like you go from home to living on your own but yeah, it’s standard in many places outside US to try living as an adult before you absolutely have to.", "[deleted]", "Ah yes, how could I forget? /s Seriously though, low salaries have been a thing in Greece for as long as I can remember. And I can remember back to 1997.", "[deleted]", "The only way OP is getting peace of mind is moving away from those assholes and going low contact. They don't deserve forgiveness. Especially the sister who continues to spite her for her dumbass mistake that she took no accountability for.", "OK, but shifting to shared living without your parents is still different to getting your own individual place", "I know...back in the day, THAT is how generational wealth was built.\n\nFamily home was inherited, one child would stay home, care for the aging parents, handle upkeep, repairs, while not having to come up with a rent/mortgage payment...granny died in the house surrounded by her loved ones & the house did not go to the state for her nursing home bills. \n\nThis is how my grandparents played it, how my parents played it, and how I'm playing it.", "a 33 and 28 year old aren’t kids. I understand what you’re saying, but it is irrelevant in this poster’s case", "Why? Because they're fighting as if they're children!  They're not kids, they're adults.", "Because they both act like 10 year olds. Once they move out, their personalities can develop and they can become adults. They're all in a state of arrested development, and OP can't even leave a room without his belongings being tampered with by his awful sister. Op is screaming at his mother, who calls them animals. This isn't working for anyone.", "It’s necessary for these people", "Because they’re relying on their mother to deal with their childish arguments. There is nothing wrong with living at home at any age, just remember to act that age.", "Why? Because these 2 girls act like they're still teens. They haven't been allowed to mature like living in the real world makes you grow up fast. They are still in the same relationship dynamic since high school.", "Because if this is a case between 12 and 14 yo they\n\na) Not fully mature\n\nb) CAn't move out\n\nc) Really need to rely on parents for mediation\n\nd) They don't truly earn money, and  thus can't cover the property damage.", "It very much is", "That's a stupid analogy because this isn't a burning house. In the same analogy, if you touch a stove and it's hot, you won't touch it again. If it never hurts you, you'll keep touching it.\n\nAlso go rent her a house if moving out is so easy. It isn't so easy to move out in a lot of cases.", "Yeah based on the one dimensional picture that the internet sees... sure.", "Yes, but not really the point here, don’t you think?\n\nIn Northern Europe you move out of your parents house pretty early. It’s definitely not a US only thing.\n\nThere are some pretty nice stats on the [eurostat](https://images.app.goo.gl/4WPh3LCW3573rsxh9) site if you want to check", "Of course. But the important part is getting out from under your parents’ wing (and roof), for the sake of your own independence and personal growth. Moving out of your parents’ house does not equate to living alone. \n\nOP and her sister seems to be stuck in a children’s dynamic.", "No they don't. She's doing it to his laptop, but there's no mention of him doing similar to her stuff.", "I mean... I can see what they kean herr.  This very much reads like the exact kind of petty bs you see in adult siblings who have never struck out as adults. They are continuing the toxic dynamic of their childhood. Its a specific flavor of unhinged that very much can be traced back to not moving out. Not everyone who never moves out has this problem, obviously, but i can see the connection.", "Normal people don't get posted here though", "The sister is the asshole but what is OP accomplishing by losing their mind like this? This is what their dynamic with their sister is like. This is what the dynamic with the sister will always be like until they stop sharing a roof. \n\nMove out, don't move out, sister to blame, mother to blame, OP to blame, doesn't matter. This is a sick dynamic they have going and something needs to change.\n\nOP is demanding that the mother mediate their disputes still despite their advanced ages. I mean...has OP paused to.tnink now screwed up that is?", "This is the issue of emotional abuse, it is the death of 1000 papercuts. This particular papercut was the one to send OP onto actually releasing her feelings - which have been ignored, belittled or denied for likely, her lifetime. \n\nWhen you grow up under this kind of influence, it is incredibly difficult to get out of it, especially when OP is manipulated and guilted for trying to prove her needs are real. Sadly, OP is still under the belief that if she explains her situation in the \"right way\", her mother will come to understand her perspective. \n\nIf you reached out to a loved one and constantly had your hand slapped back, and told that you're too sensitive because you're upset about your sore hand - just get over it, it wouldn't occur to you that the pain was inflicted - only that you're too sensitive and it must be your fault. But even as adults, we continue to reach out for the approval of those that slapped us because we've been trained to.", "Move out with what money and where? Being able to afford a computer doesn't necessarily mean someone can afford rent. And in a lot of cultures moving out is absolutely not possible", "Saving this for the next time I want my mother's approval.", "Then it's time to grow up and get along!", "You both sound 12", "I get your frustration over the laptop but holy crap you both sound so immature. I had to go back to read you were really 28 and 33! I don’t blame you for still living at home either because rent is ridiculous but if your sister is that bad you might want to think of moving out. Rent a room somewhere if an apartment is too expensive. If you can’t move out for religious reasons I suggest you all have a family meeting. ESH", " NTA", "NTA. Based on this brief story, it sounds like your mother may have just gotten used to your sister's immature behavior and you were right to call her out. Especially given that your mother had nothing to say when your sister \"misbehaved\" but spoke up the moment you reacted.", "I think you have a typo, do you mean you are 8 and your sister is 3?  What does your mother have to do with any of this?\n\nESH", "YTA you shouldn’t disrespect your mum like that, you and your sister need to grow the fuck up!", "ESH. \n\nYour sister sucks for breaking it the first time and for being so petty like that.\n\nAnd I have nothing against y’all living at home despite your age, it’s a great way to save money.\n\nBut holy hell, y’all can’t act like you are 10. Trying to break stuff and then complaining to mom. Y’all are adults and both have been for over 10 years. What the heck is up with your family?", "im confused why your mum is involved at all this sounds like its between you and your sister. \n\ni mean its good to for your mum to know what happened and how that reflects on your sister, but it's like youre hoping for mum to ground your sister or something lmao", "ESH,\n\nGood grief what an over reaction.  Don’t have it in communal spaces!", "NTA", "Yta get over yourself", "NTA protect your computer and move out", "‘Screaming and crying’ ? At 28? Are you for real. Both you and your sister as assholes. Good grief", "Lol are you sure you’re not 12? Also why are all of you living with your mom in your 30s?", "Ok… look… for this particular issue, NTA. She never believes you & it’s created trust issues. That’s fair.\n\nBut good lord you both sound like 12 year olds (at best). Everyone needs to grow up here, inc your mother.", "I'd love to see everyone calling OP immature act poised, calm, and collected when they see their expensive sh*t get destroyed a second time by the same person. OP should move out if they can though, because it sounds like they're in an environment that's going to continue to stress them out unnecessarily.", "Wow you sure your aren’t 13 and 15?", "ESH. Your sister for baiting you, you for letting her bait you and flipping out. Your mom might not be an asshole though, maybe your mother Just doesn't want to get in the middle of a fight between a 33-year-old and a 28-year-old. It is time for you to move out. \nNot the asshole for getting angry at your sister for ruining your computer the first time. But the asshole for staying in a place where you have to hide your computer whenever your sister is around.", "NTA AT ALL! Your sister is a massive AH and you are not overreacting whatsoever… I am sorry your mom is also treating you like this because anyone in your place would be overly protective extremely upset about this… your mother and sister are 1000% in the wrong", "ESH\n\nYou’re 28. Move the fuck out.", "I understand why you feel that way but trust me mothers are special and rare. Treasure yours. I always thought my mum favoured my siblings over me because I was like the black sheep but trust me after a lot of therapy and self reflection it was mainly me. Sometimes sister would get more attention due to her being Ill but I took that on the chin. I have lost my mum now earlier and unexpectedly so please don’t waste your mum and time with her. You are being slightly childish you are a grown up now so come on stop being the AH and just accept your sister is clearly a child too and both of you think the same.", "NTA.", "NTA. You're pissed at your mom for not believing your older sister ruined your last laptop. \n\nFair. \n\nYou're cautious around sister by putting the laptop out of sight when you're not using it. \n\nFair again. \n\nYou took two years to buy a new laptop, and you now keep it hidden when you're not using it so that sister can't damage it.   You walk away for 2 minutes while sister is out only to come back and find that not only has she come home, but has immediately put stuff on the laptop out of spite. You get angry (as is your right) and mom comes out yelling about something and you defend yourself (as is your right). OP I hope you're able to get out of that dynamic somehow.", "Sister is the asshole. It must sucks to have an older sister who acts like a f* brat! Also, I don't know why some comments are responding to you still living with your parents when that isn't the issue here?! Ah and your mother also is a bit of an asshole here. She should have believed 50-50 of each. Not just disregard one and believe one! You are NTA here! Wanting to be heard and believed and understood isn't an asshole move. Not wanting to spend 500/1000+ on another laptop, for the third time, is understandable! Also, while is isn't the issue you're adressing here, if you can move out, you should think about it!\n\nI hope all goes well for you.", "Sounds like there is a bit missing from this story?", "NTA. Move out. Want to protect your stuff and not deal w ur sister and mom? Move out. Ur wasting ur breath and ur energy bc they obviously have not shown compassion or care for your personal boundaries", "ESH.\n\nBoth of y'all need to grow up.", "ESH.\n\n>For the record I am 28 and she is 33.\n\nYou misspelled \"8\" and \"13.\"", "ESH, you're grown ups, stop taking your squabbles to your mother and work on getting out of her house. She simply didn't want to get involved because it had nothing to do with her and there's no way to prove anything with \"he said, she said\", she sounds exhausted with having 2 grown daughters who act like bickering teens.", "INFO: If this is a concern, why is the computer in a public space? Why isn't it in your private space?", "ESH... unless you and your sister are really two and four years old, but even then mom's parenting still sucks.", "Wow. I honestly thought you both would be teenagers, not 30+. \n\nGrow the hell up and leave if you are gonna act like that.  If I were your mom, I would be frustrated as hell with both of my adult children acting like angry toddlers.\n\nESH", "... everything okay upstairs? This is unhinged", "YTA - your sister sucks too but what exactly was your mother supposed to do about an issue 2 years ago between her adult children.  Did you want your sister grounded? Be mad at your sister not your mom.", "NTA, at that age you guys should clearly be able to pay for your own mistakes. But your sister is not able to do that and your mom did just sit idly by. But it’s time to put some action into those words, no one can touch your property if they don’t have access to them. If possible move out, if not, add some locks to your things.", "Are you 12?\n\nMove out.", "You're 28. Move on. If you're not treated with respect by mother and sister, find a different place. Don't give them the ability to reduce your to screaming. If finances allow, get a therapist to parent you into more useful reactions to frustration - no one will want a screaming adult in their life.", "I think you had a typo with the ages. Did you mean to type 8 & 3?\n\nSounds like a pretty juvenile post and quite frankly made up.\n\nNice try though.", "NTA move out and away from these toxic people", "Screaming and wailing, you both need to grow up and get away from each other.", "I know a lot of friends family don’t want them to move out unless they have to for college/work/getting married. Due to cultural customs and simple family tradition. Lol not everyone hates their parents/children.", "I think there is more to the question why these women are still living with their mother and have not yet learned to set boundaries within this setting. For example, why does OP need her mother's judgement as to who's at fault  when her computer was broken?", "Possibly the first American who believes that it is a sin to be over 18 and live in your parents' house has already left, OP never said where she is from, or about her culture, or if she is the owner of the house, I understand that it is It is customary in the United States to throw your children out like garbage at 18 or 16, but not everyone is like that, NTA op", "Everybody is not an American.", "It's not the fact that they're still living with their mother that bothers me. It's the fact that my 16yo daughter seems more mature.", "I agree wholeheartedly.\n\nIt doesn't sound like a multi-generational household culture. It sounds like two immature people fighting like teenagers and their mother enabling it.\n\nCrying, wailing, being spiteful, and dumping ice cream wrappers on expensive pieces of tech... I am totally envisioning the sisters in Cinderella.", "That this is the top comment is disgusting. \n\nMost of the front page is about how hard it is to find a good job and how high house prices are, and you’re shaming OP for being financially responsible.", "I mean, I’m almost 28 and I’d love to move out, I just can’t. Waiting list for social housing is enormous, and renting a place is expensive as fuck. Buying a house will never be an option for me either, I don’t earn enough money.", "We don't know the full story. Depending on where they live, the housing market is disgusting and unaffordable rn. For all we know, they both could've been living on their own, but had to move back in with their mom due to unaffordable housing, job loss, etc. Not so easy to just tell OP to move out, as we don't know the full circumstances. I do agree with the ESH judgement and the fact they are that age and still acting like children and AHs to each other. OP needs to protect their stuff, but their sister sounds insufferable.", "Well that was culturally insensitive...", "In some countries girls should not move out till they get married..", "Goofy ahh comment people in some cultures stay with their parents, care for them, pay for their medical bills etc… until they get married wether you agree with it or not.", "it’s actually quite normal, especially in the UK, to live with your parents until that age because of living costs", "That's why it is ESH and not YTA.", "Years ago sister destroyed a computer. Recently they've purchased another and have anxiety about their sister destroying the new one", "i was a little shocked tbh. yeah same I do agree that all of them need some distance/space to themselves and probably should move out but the way you said it \"vilifying OP because she still lives with their parents\" is so accurate! \n\nI'm listening to a podcast/content creator/psychologist (Dr. Kirk Honda from \"Psychology in Seattle\") and he often talks about how in the US its SUCH a huge thing and gets judged so harshly when you still live with your parents after a certain age and how in different cultures its literally the norm and no problem to live longer with your parents and that the American fixation on being self sufficient and independent is pretty bad for relationships and loneliness and general happiness...  \n\n\nthat said I do think it would be a good idea for OP to move out :D", "It's more the description of her reaction to me. I'd expect someone under 12 to possibly respond in the manner described. I'd honestly be upset if my 8 year old reacted like OP. It's just anoutlandish emotionally unstable reaction.", "It has nothing to do with still living at home. They are acting like a literal child. Screaming and crying over something like this? Lol. Grow up. Put a lock on your door and leave your computer in there only. There are so many options to make this a non issue.", "Thirty fucking years old.\n \nIt's time to leave the nest.", "I think it’s more the fact that they are 28 and 33 and still acting like they’re 12.\n\nPeople can live with their parents into adulthood and still act like mature adults. OP and their sister have not done this.", "Lol \"the minute they turn 18\". This is over 5 million minutes after they turned 18", "They live in Ireland, but ok.", "Proof?", "what is the mature/proper reaction to having your sibling break your previous computer and then deliberately trashing your new computer?", "It’s normal to hit a breaking point when one is chronically in a stressful situation. Don’t be an asshole to abuse victims for eventually reacting.", ">28 and 33 with full time jobs is a bit unusual even for us\n\nIt's not. At least from where I am, as long as you don't get married and you contribute economically, you stay with your parents as long as you can.\n\nThe oldest one I know of was a cousin that stayed with his mom until he was 40 something and got married, then moved to another state.\n\nAnother friend that's 33 yo still lives with her mom. \n\nAlmost all of my friends from school (25-30 yo) still are living with their parents.", "Lol \"cold snap\" as a descriptor of the Little Ice Age.", ">Actually, pretty much every culture apart from post-1940s USA has people generally stay with their parents until they have a good reason not to. \n\nthat is not true. I've never even been to the USA", "[removed]", "The sister is 33?", "literally been an adult for a decade", "Abuse, lol.", "44 and I still live with my mum , she’s retired and I work to pay the rent and stuff , tbh it’s more like a friendship than a mother child relationship now as we just get on so well and I don’t see the point in us living seperatly just because society says I should have my own place .", "It’s clearly not working well for them. \n\nSomeone will come to this sub with an issue that is happening largely (though not solely) because of a group living situation and because the living situation is cultural everyone is supposed to pretend it’s not the primary issue?", "They should move out because they clearly hate each other, lol.", "I agree with your point , but in this instance OP and his sister and children in adult bodies. \n\nTheir behaviour is disgusting- they need to move out and learn what it is to be an adult.", "I moved out for college at 18 and never looked back. Hard for me to picture wanting to live with my parents at age 33", "Sister enjoys provoking OP, and mother doesn't like OP's response. Doesn't seem like living together is a healthy choice for any of them, does it?", "Because that's not what's normal in the US so anyone doing it differently to the US is wrong and weird.", "If I lived with unhinged people at 28 I would...move out.", "They included her in \"They scream and wail and throw ice cream wrappers on each other's computers\"\n\nI don't know if you've realised this but the OP was screaming and wailing. Everybody is at fault. OP told her mother she will never forgive her because the sister broke her laptop. They are both embarrassingly childlike and toxic", "Everyone is at fault, though. OPs reaction was childish and unhinged", "Screaming at sister and her benefactor is an adult response? OP is part of the noxious cycle of behaviors.", "even for adults its not unreasonable to be upset when someone believes a liar", "No doubt this is toxic behaviour, yet a lifetime of not being believed by a caregiver over the clear actions of your sibling would send anyone to scream eventually. \n\nNot sure why you're being passive aggressive in your response, but you're welcome to your own opinion.", " My mother ALWAYS took every else's word over mine and my siblings knew it and took advantage of it. Scapegoat child. . It festers.", "I completely get that. And after a while it feels like you can't even do something about it. Keep feeling trapped. I sympathise. In another comment I put some limited suggestions about how OP can introduce some distance between themselves and their sister and I'm kinda hoping that even doing something small will allow OP to feel like the situation is in their hands to change someday", "There are things you can do even when you can't move out. None of them are easy or fair but it is possible. The key one is minimising time at home. If one can structure their day to achieve this, it will get OP out of the way of their sister. Another one while also not easy is shifting their day. Sister nocturnal? Shift the day earlier. Sister an early bird? Start getting up and going to bed later. \n\nLock on the door is probably a non-starter but if it is possible, definitely worth considering. \n\nI'm not blind to the fact that moving out might not be doable but the point I'm making is that this issue is one of proximity. If you can't geographically separate, look into ways to separate while still sharing a house.", "I was being exactly as passive aggressive as you so the same question applies.\n\nAnd yes there is doubt. Much of it. We have literally know way of knowing that you are just projecting.", "Ah friend, best of luck to you.. I say this as someone still trying not to wilt every time I make a pun and she looks at me witheringly \"So funny.\"\n\nThis is the same woman who bought me a standup comedy course for Xmas. 💀", "Our self confidence can grow even in tiny increments, but it takes a lot to stand against family. Especially if that family has groomed a scapegoat that they don't want to run away. But here's hoping for the best for OP 🤞", "Where does sister go though? It's 40C out in my hometown and short of traveling everyday to a mall, there's really no place to go, not to mention going out everyday even if you spend no money will lead to a lot of drama at home in a lot of places.\n\nChanging schedule doesn't work because your parents set your schedule, everyone's schedule. Look I get what you're saying, but none of it is feasible for a lot of people. Whether OP lives in such a household, I don't know. But based on the living at home at 28 and 33 thing + negligent parent, it sounds like she does", "Spending time outside 9/10 times means spending more money. You can’t just loiter at cafes and coffee places. Lots of places don’t have well funded or any libraries at all. Staying outside isn’t feasible with the weather some days, and idk about you but I can’t work on a laptop outside, even in the shade.", "When I fight with my adult sibling I don’t go to my mother telling her “you need to scold them”. It would be ridiculous.", "You're 28 years old and you were \"crying and screaming in frustration\" because your 33 year old sister put ice cream wrapping on your computer? Of course your mom sat back and did nothing when your other computer was broken last time - you and your sister are full adults. Leave your mom alone with this, she's probably exhausted because she has to keep parenting adults. My god.", "NTA- if I had to guess, I would assume this is not just about the computer. My parents, mostly my mom, believed everything my brother did and I was the scapegoat of the family for my entire childhood and into early adulthood. It hurts and it makes you feel like you can’t trust your own experiences and this is a result of that. Perhaps I’m projecting, but it definitely seems deeper than the post suggests.", "This sounds like an issue bigger than just a computer. Have you thought about removing yourself from the situation with your family? I’ll just give an ESH for a judgement, but it sounds like you could use some help.", "YTA and a child. You both need to cut apron strings and grow up. Wow.", "ESH. Both of you need to move out. Grown ass women acting like teenagers", "ESH. You seem to have a dis-functional relationship with your family.", "ESH, and no way you're 33 and 28. I'm thinking more 13 and 18.", "NTA. Sounds like your frustrations have a foundation for their existence. I'd be reacting rather similar. \n\nMy little sister accidentally dumped my phone in a bowl of chocolate milk she had leftover from cereal once. That was over 10 years ago now and I STILL don't let her near my electronics. Actually, I don't let most people around my electronics since that incident.", "Move out.", "ESH\n\nTwo fully grown adults are screaming and expecting their mother to mediate their argument. You two need to have an actual conversation about this instead of screaming at each other like teens.", "ESH. You are 28 and your sis is 33 and you both live at home? I'd be sick of listening to the two of you squabble. It's time to move out and have your own space for your own stuff.", "ESH, what does your mom have to do with this? Y'all grown, take your sister to small claims court or something.", "NTA, just move out", "Move out, problem solved. Then your poor mother can have some peace", "NaH but perhaps a solution would be for you to get place alone.  You all sound tiring", "YTA you’re 28. Grow up", "Yta.  Its not your moms place to take sides, you are both grown women. Crying & screaming over a wrapper?! Seriously?! Grow up. If you don't want it ruined, pick up after yourself. What kind of person tells their mom to shut up?!? That alone makes you an AH. As far as her sitting back & doing nothing, thats EXACTLY  what she was supposed to do. You are grown. Handle your own business w/o tattling to mommy & putting her in the middle (of something she has no control of). And you will never forgive her?!? I truly hope your mom takes that to heart & does the same because all i hear in your posts are ways you did wrong to her. And possibly even your sister  (did you really see her spill stuff or are you assuming? Not that you would tell us the truth now anyway). But not forgiving your mom when she didnt even do anything is vile. And if your that bitter, stop using your mom by living off her. Wow. Grow up alrdy, your mom deserves so much better", "ESH yall both childish and I cant believe you threw a temper tantrum like a alittle ass kid", "YTA and so is she. You're both acting like children and it's well past time to grow up. Screaming and crying over a wrapper to get your sister in trouble is something my kids would have pulled when they were 8. Unless you're destitute, it's time to get away from your toxic relationship with your sister and find your own space.", "ESH. Grow up.", "Why the hell are you two (apparently) still living with your mother, FFS?", "Are the ages off by 20 years here? ESH.", "ESH.  grow up, stop throwing tantums and move out. She can't destroy anything that way.", "YTA.\n\nPlease work with a therapist. Not only do you have a rage problem, your thinking is very, very broken. It must be miserable.", "I would more so like to know why y'all's grown butts still live at home and no matter the answer to that,  why you're still acting like bratty children?", "ESH. Good LORD. Your mommy isn't supposed to punish your sister on your behalf when you're both almost 30/beyond. Your mom is only slightly an AH for raising two children who refuse to grow up.\n\n\"I'll never forgive you for not making my 30-year-old sister GO TO HER ROOM!\" How embarrassing for you all.", "Tell them both point blank:\n\n> Next time sister damages or destroys my property I am suing her for the full value of replacement and filing a police report. I've been very generous by eating the $(CostOfFirstComputer) loss of the computer dhe destroyed because she's family but if she's going to continuously treat me and my property with less respect than she gives total strangers im she is not treating me like family and that courtesy will stop. \n\nNTA", ">I bought a computer for study a few months ago. About 2 years ago my sister spilled tea all over it, she never apologised, never admitted it, never offered to pay for a new one. \n\nSooooo which is it? Did this occur months ago or years ago? This doesn’t make any sense.\n\nAlso you’re both full adults screaming and crying over a laptop? Good Lord, why did it come to that? \n\nYTA.", "Are you 28 or 13 lmao. ESH besides your mom, she probably is sick of you and your sisters shit. Grow up", "I'd be throwing hands sorry! Sometimes a good sibling smackdown is deserved. Start training now!", "Everyone is an asshole here. You are 28 and are having screaming and crying fights with your sister, y'all ARE behaving like animals. Therapy. Find a new place to live. All of you are being ridiculous.", "ESH. You and your sister need to grow up and learn to resolve issues in an adult manner. You don’t even know for sure your mom took her side, you’re just convinced she did. Which sounds to me like she didn’t intervene and fix your argument for you. I wouldn’t either if my kids were 31 and 26 fighting over a laptop. Especially if there’s no proof of either side being right or wrong. Honestly you sound just as bratty as your sister telling your mom to shut up and that you won’t forgive her over a perceived slight in her own house.", "NTA\n\nYour sister is the biggest one and your mother is a smaller one.\n\nIs your sister jealous of you?", "ESH are you teenagers? Good grief, OP you and your sister are immature. What was your mom supposed to say to a fully grown adult? Was she supposed to punish her? Lol", "> I bought a computer for study a few months ago. About 2 years ago my sister spilled tea all over it, \n\nINFO: How did your sister spill tea two years ago over something you bought a few months ago?\n\n\nAnyway, NTA, but holy fuck you both need to move out. You're both just about middle aged and are in a supremely toxic environment. Time to not live at home.", "I think you got the ages wrong.  You sound like you're 8 and she sounds like she's 13. \"Crying and screaming in frustration\"?!?!  Seriously?  At 28?!?!  Also, still living with Mom at your ages?  And what does Dad have to say about all this?  Or is he not in the picture (shocker)?  Anyway, NTA.", "ESH \n\nKeep your laptop in your room, it might be a nuisance but would you rather buy a third laptop?  \n\nIf you’re both to still living at home and contributing then your mum needs to realise she still has SOME parental responsibility and is the head of the home. \n\nYour sister needs therapy.", "NTA.\n\nInfo: What was your mom's parenting style growing up? Did you and your sister fight a lot? Did your mom have a tendency to stay out of it? If so, she may have interpreted the computer as just another episode in the two of you bickering. Doesn't make it right necessarily, just might be the logic.\n\nAdditionally, my late husband's mother loved all her children and could never believe when they got older that any of them could do anything bad/awful. This caused her to be silent on many occasions when one sibling had clearly been wronged\n\nI would say move out of your family home when able. Sister sounds like kind of a jerk tbf", "NTA your sister is. you can't blame your mother though your sister is like 30 she can't do shit to her.", "Cutting the cord is way overdue!  Going to your mommy to settle things between your sister when you've been an adult for over a decade is crazy.", "Boy, Saturday night at your household sure sounds like a barrel 'o fun.  ESH", "Seriously, this reads like they are 8 and 13, not 28 and 33.", ">  Is there a reason why you need your mother to mediate between you two\n\nPresumably the same reason why two women verging on middle aged are still living at home; Mom's thoroughly complicit in creating this environment of dependency.", "Because this fiction is written by 12 years old.", "Redditor fails to grasp pretty clear information, blames the writer lol", "Yeah it honestly sounds like maybe this is how hard she has to react to feel heard by her shitty family. Not saying it’s okay, but feeling that invalidated and stepped on makes you snap eventually. Definitely needs work on emotional regulation, but that’s a learned skill - granted it’s surprising she hasn’t worked on it by now. I think it’d take getting out of that toxic environment for OP to really see her own behavior and make changes.", "Holy crap. I somehow skipped over the ages and thought I was reading about children/teens in the 11-16 range. \n\nAdults don’t behave like this, so I wasn’t wrong. ESH: sister for behaving childishly like a 12 year old, OP for crying and screaming and blowing up like a 14 year old, and mom for failed parenting.\n\nI do think both kids need to move out. Not because I think adult children should do that - I don’t - but because these kids have been stuck in puberty for 15-20 years and aren’t growing up. This family isn’t working out, they need to move on.", "Sorry some of us are poor", "Holy crap. I somehow skipped over the ages and thought I was reading about children/teens in the 11-16 range. \n\nAdults don’t behave like this, so I wasn’t wrong. ESH: sister for behaving childishly like a 12 year old, OP for crying and screaming and blowing up like a 14 year old, and mom for failed parenting.\n\nI do think both kids need to move out. Not because I think adult children should do that - I don’t - but because these kids have been stuck in puberty for 15-20 years and aren’t growing up. This family isn’t working out, they need to move on.", "Yeah, like, are we sure the ages aren't 10 to 20 years younger for each???? How are you 28 and 33 and still acting like immature teenagers, putting garbage on eachother's things and SCREAMING?!!!\n\n(Not calling anyone out for living with their parents with COL vs Wage ratios the way they are, but... geeze. Grow up, OP)", "There are even countries in Europe where young people can’t afford to move out. It’s sad but in some regions the economy is messed up.", "Thought it was going to 13 and 11", "Why would living with your mother make you TA?", "I feel the same way.  Most adults have more responsibility because society forces it on them, but when they pretend they are wiser and more mature than teens, it's pretty laughable.", "Screaming and wailing is never reasonable. By definition, this behavior is the antithesis of reasonable. \n\nFeel how you will, but behave like an adult.", "Redditor believes that all the posts on AITA are real", "Why are you blaming mom for not getting into their mess? They are grown women who should be able to handle it without bringing their mommy into it & forcing her to pick sides. I imagine they do this with everything", "> In some countries, children live with their parents way into adulthood and the parents and children both like it.\n\nAnd OPs post illustrates why other cultures widely view it as creepy and debilitating. It produces adults who act like children and think it's normal.", "Both Girls are acting like teenagers", "Possibly some redditors are ignorant of US cultural norms, and assume that every tragic story on Reddit represents the majority of the US.", "Those that shame others for living with family tend to forget that America isn't the certain of the universe. They also forget the current economic state is making so a lot of people regardless of cultural status have to live with their family.", "It's pretty clear from the post that neither sibling has every been an adult, and mom is sick of both of them.", "> By definition, this behavior is the antithesis of reasonable\n\nDefinition of what?", "Could be fake, but the reasoning isn't because they mixed up their timeline", "OP has posted about upcoming trips to both Stockholm and Berlin within the past three days.", "It’s a very normal kind of reaction for someone who has been emotionally abused to a breaking point, regardless of age or “maturity”.", "It’s time to stop blaming the generation who graduated into an unprecedentedly terrible combination of stagnant wages and rampant inflation for not being able to easily afford to do that.", "You're cautious around sister by putting the laptop out of sight when you're not using it.", "I also never understood why living with parents and paying rent it’s shameful and a failure, but living with strangers is encouraged and a part of growing up. Like you’re still sharing a home with someone. Our culture has just decided one is shameful.", "Screaming and wailing is an appropriate response to a two-years-ago problem?", "Have you looked at our economy? Being 33 doesn’t get you an automatic pay raise. Comments like this are always so out of touch with the reality many adults are facing across the world.", "Keep it out of reach, for starters. Move away from her as soon as possible. Address her like a petulant child when she acts like it. Try adulting, just a little.", "Fair enough! Was just trying to give benefit of the doubt to the situation", "...history", "Because your mom is sick of cleaning after you. Move out so she can finally relax", "To be independent people, and not just shadows of your parents and perpetual children, like OP and his sister are.", "Maybe their parents don't want adult dependants.", "> Why though?\n\nBecause it’s a toxic relationship. She says she will never forgive her mother. If she means that, then sharing a roof with her is a poisonous, unhealthy situation.", "How are you ever going to be a good partner when you haven't yet learned to be responsible alone?", "I think that's delightful. I'm 28, and I moved back in with my mom after college because I wanted to work in our city and it seemed downright stupid for two single adults working in the same area to pay two separate rents/mortgages, two water bills, two power bills, two grocery bills, etc., and neither of us could easily afford it anyway. We split the expenses and make each others' lives easier. \n\nSometimes we go out independently with our own friends for drinks or dinner, and sometimes we go out together to get lunch or go to the art museum or see a movie on a Sunday afternoon. We both have some health issues, so when she's not doing so hot I'll do a bit more to let her rest, and then when I'm not doing so hot she'll do the same for me. We're still a family even though we're not as young as we once were. We want to help each other, and I'm glad we can.", "That's what happened to my grandpa. My dad lived with him for about 15-16 years and when he died used his portion of the money to buy the house. When he went on hospice he lived at my house until he passed, later on the house was sold to my cousins. My wifes family though, put their grandma in a home, this decision was made way above my paygrade (son's and daughters, grandkids just heard the final decision). I would of taken her in, she was a great lady. Regardless, She perseveres in the home. Completely wiping out the bank account and causing them to start selling off property to keep her in the home . Personally I don't want to die in a home and let the kids know that their inheritance will be almost nothing if I go to a home.", "Lol. Yes, because she would out herself worse than the screaming and crying on this app, where she wants everyone to say \"You poor dear! \" Come on.", "Well, as you can see they are not normal.. Sooo move out..", "What part of \"I was crying and screaming\" did you miss? Do you imagine this is normal behavior for a 28 year old woman? Because, it is not. It is the behavior of a 12 year old - as is her 33 year old sister's.", "My parents would have happily let me live in their house forever if i wanted, but i didn't want to b/c my mother still treats my sisters and I like we're children, even though we're adults.\n\nShe was controlling, argumentative, would hone in on my every move and question every single thing I would do.  \n\nI HAD to move out even though I really wasn't financially ready to.  But it was toxic.\n\nIn situations like this and OP, they really should move out ASAP.  It's not healthy.\n\nIn a situation where parents treat their kids like adults and let them live their lives then that's totally different.", "Exactly, well put. Her mother must be exhausted about both of them", "Unfortunately that is the issue with generational trauma. It is a cycle that will continue for OP, unless she gets some professional help.", "It is not normal. It is the behaviour of a victim of emotional abuse reacting to a lifetime of a dysfunctional family system. \n\nDo you trust your siblings alone with your belongings for two minutes? Or are you under constant awareness that an expensive possession of yours could be destroyed because they've done it before - and the person you expected to support you, denied your experience? It is stressful to be hypervigilant.", "That's the sole reason why I couldn't put ESH.  The mother is probably exhausted not only with both of them still living at home, but acting like this, too.", "When you're an adult, you shouldn't be reaching out to mommy to solve your issues with your sister... period.", "I was about to say, ya'll realize we are in a housing crisis, right? The average person can't afford to live alone. OP and her sister are being childish but it isn't as simple as move out for most people.", "If you want to stay living in your parents home then be civil to one another and do whatever possible to make it an enjoyable experience for your provider. This is the price you pay in lieu of rent. Otherwise get out.", "Honestly as a parent of small children OP’s story makes me want to cry. You’re saying all the petty bullshit, all the screaming fights, all the aimless cyclical attempts at revenge, all the determination to get one over on each other even while I’m literally pulling them apart… it may not end for another thirty years???", "Single bedrooms homes are renting for 1500+ where I’m at while the average salary is still under $15 and they’d if you’re lucky to get scheduled full time. I really cannot stand how much Reddit loves to shame adults for living with parents but I guess living with random strangers you hate is more “adult”.", "Hey a roommate that's not family that destroys your property out of spite... You don't have to be able to afford living alone to not live at home.", "Nowhere does it say OP doesn't pay rent. Also nowhere does it say what country OP is from. In plenty of places women simply aren't allowed to leave. There is no _want_ involved", "I'm sorry it came across that way, it wasn't my intention. I'll try to be more clear with my comments in future.\n\nToxic families are difficult to escape, regardless of age. Having the self-awareness to understand that it is a toxic relationship depends on someone showing you what a healthy and mature one would look like.", "Literally everyone in this scenario needs to grow up. I can't believe you guys are 28 and 33. I would have thought 12 and 17. You were crying over an ice cream wrapper and your sister was so petty. It's ridiculous. You're an adult, so is your sister. Why are you depending on your mom to do anything about any of this? Your sister should have replaced the laptop she broke, yes. But your mom cannot punish her or force her to do so. Why do you think she can? ESH", "No, u r not. It's ur propriety and She has ti respect that", "Nta", "If you didn't say you were 28 and 33, I would've thought you were in your teens because you sound like children. I'm not going to point fingers but the whole household sounds kinda toxic...", "Pretty sure your mother just doesn’t want to get involved in this at all. You both are adults and apparently live in her home. Sort out your own shit and start acting your ages. Why tf does your mother have to do this?\n\nESH", "just move out bruh. You sound like me, a literal teenager", "Your main question that you brought here is that you told your mother you would never forgive her, because you decided her not saying something to your sister about spilling tea on your laptop meant your mother believed your sister's lies, and you want to know if you overreacted and were the asshole. The answer is an unequivocal **YTA.** Your sister was 31 and you were 26, ie both adults, both old enough to deal with conflict with each other without one of you running to your mommy. THAT'S probably why your mother didn't get involved. Playing mind reader and deciding she took your sister's side was wrong, and declaring you would never forgive your mother over your perception of her not getting involved in a childish spat over a computer was you being a histrionic drama queen.\n\nYou and your sister were both acting like little children, her throwing trash on your computer just to spite you, you screaming and crying and acting helpless when all you had to do was pick it up and walk away. No wonder your mother snapped when she's having to deal with two grown daughters living with her and acting like bickering little kids. I don't care if in your culture it's common for grown women to still be living with their parents in their late 20-early 30s, in your case, it's not working, because neither of you is capable of acting like a mature adult or acting civilly with each other, so you shouldn't be living with each other, for your own good, for the sake of salvaging a sisterly relationship, for the sake of your mother's peace of mind. You both need to move out, be independent, and grow the hell up.", "I’m sorry but what is wrong with the both of you", "You a grown ass woman get an apartment ffs.  ESH", "NTA but why are you still living where she can access your things?", "ESH. YTA for wailing like a child and expecting your mommy to solve your problems with your sister. Your sister is TA because of her childish behavior of trying to trash your computer (really, what the fuck, she is acting like a bratty 8 year old) and for not apologizing before. Your mom is a little bit TA because she should have told you two to solve your own problems long ago. She is NOT T A for calling you animals, because really, how the fuck does she put up with that shit. I would have kicked you out long ago, I need peace in my home not two adults behaving like little bratty kids.", "NTA. I hope you can move out soon. You are adults; forget what your mother thinks and tell your sister to grow up.", "You’re 28 and telling your mother to shut up over rubbish on your laptop? Sounds like the silver spoon of falling out of your mouth. Shut up and move out, or quit your bitching. Beggars can’t be choosers", "why is your sister staying with you yet . ask her to leave and go to her Husband's house. sympathy to you , never expect women to understand mens bond to machines. Better break foundation powders and lips of her if she tries anything again.", "ESH. You both need to grow up.", "ESH. Two grown ups living with mommy arguing like children. Time to move out and get your own private space where if they are invited over you can safely stow away any belongings you wish.", "Sounds like 28 and 33 going on 10 and 15.  YTMajorA for yelling at your mom at all while she is letting you live in her house.  It isn't her responsibility to protect your shite.  I get cultures are different living with your parents at that age is fine but she is not responsible for disciplining anyone when you are full grown adults.\n\nKeep your shite locked in your room.", "ESH except your mom. Are you fucking kidding me? You are 28 years old and acting like my little sister who is ten?\n\nYou and your sibling are petulant and childish.\n\nYou should be ashamed of yourself.\n\nI feel bad for your mother. She is probably wracking her brain over where the hell she went wrong in raising you 2.\n\nAlso you know the best way to protect your things from your sister? Move out, go to college.\n\nGet out of your moms hair for a while you drama queen.", "Grow up. Who needs their mommy still at that age.", "I feel as though there isn't enough information to form a strong conclusion on whether you were wrong or not, but I'm leaning toward YTA.\n\nYou're expecting your mother to issue a punishment over a dispute that doesn't concern her. What happened between you and your sister concerning the computer needed to be resolved between you two and not coming to a compromise or reasonable solution doesn't mean your mother is against you. She is NOT responsible for your possessions. You even mentioned you THOUGHT (implying that you have zero confirmation) your mother chose her side, suggesting that you simply overreacted and lashed out over something YOU don't know is factual.\n\nYou're supposed to be grown women. I assume based on the poor behavior that you're both consistently ensuing arguments or getting into confrontations which has put your mother at her breaking point. Again, there seems to be some important information missing and I gradually accept that I might be wrong. Based on what you DID provide, YTA and so is your sister.", "YTA - It can be really frustrating when someone close to you doesn't respect your propriety and even more so when you feel like your mother isn't helping you. BUT, there's the catch, you are both adults. It is not your mom job anymore to discipline your sister nor to stop you both from fighting. It is your responsibility to deal with this problem. Try dealing with this situation by yourself. Either move out, or deal with the conflict the way you see fit (communication, retaliation, no contact)", "Drizella and Anastasia.", "ESH, You're 28, still living with your Mom, and you can't talk to your sister like an adult. Move out, and learn some social skills.", "Your sister is an asshole", "I think it is hilarious everyone is assuming OP is a woman. Dude, if you are a man by any chance...just lol. And you and your sister are both failures and should be ashamed", "You're the older sister, she's only 13, so you have to be more mature here. At 18, you should know better than to get aggressive with your sister.\n\nHug and make up. You girls are almost grown! Are you still going to carry on like this at 20?", "ESH.  Both of you need to grow up.", "You will probably have multiple laptops in your life. You will only have one mother. Adjust your perspective", "Sounds like your sister is the golden child and a spoiled brat. You both are adults. Your mother is not responsible for either of your actions. I think all you can do is either tell your sister to pay you for the damage laptop and give her the damage laptop and if she doesn't want to pay for it. Only choice is to sue. I would also recommend to move somewhere else too", "ESH You are not 33 and 28. That is a blatant lie.", "Yall are acting like kids grow up. Move out esh", "ESH it's not about living at home in your late 20s/early 30s; its being in your late 20s/early 30s and acting like 10 year olds", "Did I read right? Sis is 33? Or 13? Coz this is immature and evil shit!\n\nDo you live with them and why?\n\nNTA", "ESH \n\nYour sister for ruining your computer, lying, throwing rubbish on your new computer \n\nYour mother for not believing you in the first place, and raising you to behave like children despite being in your late twenties and early thirties \n\nYou for acting like a child \n\nSeriously, I had to double check the ages- I wouldn't tolerate this kind of behaviour from my primary-school age nephew. It's time to grow up.", "NTA \nyour sister destroyed your stuff and thought it would be ok, then your mom tried to deny everything but I do have a question\n\nAre you actually 28 I'm 16 and I don't even act like this........", ">Are there actually grown ass adults that act this way?\n\nAll the damn time.  When I was a high school teacher, the parents were worse than the kids.  When I worked retail before that, the oldest customers were always the worst.", "The way OP describes it sounds very funny and ridiculous but tbh at any age, if my sister broke my computer (expensive af) and then did that little extra thing to my new one (still expensive af) to annoy me, I would have stabbed her to death with a fork, gotta be honest.", "My 2 and 3 year olds fight like this. If I thought they'd be living with me in their 30s still doing the same thing I'd probably end it now, lol", ">28 and 33 and you're still living with your mother? \n\nNothing wrong with that.  This hyper-independent, gtfo at 18 on the dot, attitude is weird and usually unhealthy.\n\nBut everyone does need to grow up here.  It's in their attitudes, not their living arrangements.", "im sorry but this is such an out of touch comment. It's not so easy to just live on your own when prices are too high and pay isnt enough.\n\nI'm 26 and live with my mom and my sister who is 24. You think I WANT to keep living with them? I love them both to death but I want privacy. However its not as easy as JUST moving out. I just finished law school and even if I hadnt gone to law school, the job i have wouldnt be enough to pay for rent and necessities and it pays over $21/hr\n\nSo i choose to live with them so I can start saving money to eventually move out and buy a house. This whole \"you're too old to live with your parents\" bullshit needs to stop since its so outdated and out of touch", "OP is being vilified for expecting her mom to mediate disputes among two adults. They’re not even young adults at that. They’re just straight adults.  OP is acting like she expects her mom to discipline her 30+ daughter over this and is mad that she hasn’t.", "Their mother should not be expected to address this problem between her two adult children, and OP should grow tf up and stop whining to her mommy, expecting her to solve it.", "28 and 33 is far from \"the minute they turn 18\". Honestly I don't care that they all live together. It's rough out there. Everything is so damn expensive. But the fighting like children and then trying to get mommy to punish her sister is absolutely ludicrous.", "Mom didn't side with the sister, she chose not to take sides, which is the right thing to do when your children are in their late 20s and early 30s and should be solving their conflicts without running to tattle to mommy.", "I agree, when people move out is dependent on a lot of factors. 18 doesn’t have to be an automatic “get out” line. But I don’t think that really even matters because wth with these reactions?! OP and her sister need to get a grip and grow up! OP states that she’s convinced her mom believes her sister, but maybe mom decided 26 and 31 year olds could mediate their own disputes. ESH.", "Usually I agree with the first paragraph, but it looks like OP and her sister would REALLY benefit from having to take care of themselves for once.", "Yeah, my thinking of ESH has nothing to do with the sisters still living at home (as someone in their late 30s and 3 housemates). Their childish behavior is what gets me.", "I have two sons, and they had their moments in their youth, but they're the same age now as these two women, they're not young girls living at home. I couldn't even imagine screaming and carrying on like that in front of my mother.", "These people are not 18 but 30 and living in an unhealthy environment (we can only go by what was posted).\n\nAmericans move out too early and the rest move out too late it seems.", "I'm not American either.   \n\n\nBut 28 and 33 still living with mother referring their squabbles? Mom has raised them. If they choose to live at home, more power to them, but don't put the mother through this shit at this age....", "> I got up for two minutes and by the time I got back she had thrown her rubbish on it to spite me. Ice cream wrapping just to spite me. I was crying and screaming in frustration begging her to stay away from it. Mum told us to shut up calling us animals.\n\nWhen you act like this at 28 and 33 years of age?", "... do you know any teens?  Most of them are far more reckless and unwise than adults.  While I'd love to get my mom to scold my brother for old times' sake, I know it's a silly idea.  The soi-disant adults in this story are outliers.", "OP, an adult, is mad at mommy because mommy didn’t punish her then 31-year-old adult sibling for breaking a laptop. \n\nWhat did you want your mom to do? Tell her she’s grounded? \n\nOP is acting like a child. It is not mom’s responsibility to say anything to anyone. She is done raising children. They’re adults. Figure it out or don’t but leave your mom alone.", "I think she meant she bought a computer a few months before sister broke it. But I agree the writing is very confusing and adds to my doubts that OP is actually 12, not 28.", "Did you come up with this theory yourself? XD", "So? I’m 28, almost 29 and, I’m still living at home. I can’t afford to live on my own and, my mother doesn’t mind. I can stay here as long as I need/want too.", "She didn't trash it, she put a wrapper on it. It's obnoxious but she didn't destroy it.", "In the moment OP described? Pick up your computer and walk away, NOT impotently scream and cry and hope mommy will intervene.", "The sister is acting very badly, but there's nothing there to hold against OP.", "Let's also check those charts for comparison of age moving out, their cost of living, and their minimum wage.  If an 18 year old is about to move out and into an apartment because a full-time minimum wage job allows them to afford it, no shit they're gonna consider moving out.\n\nCost of living and stagnated wages, along with the cost of housing exploding, is a very good reason for adults to still be living at home.  I was set to move out fall of 2020 - and then lockdown happened.  So I wasn't able to go to school and work anymore, I wasn't able to save and buy a car (used cars where I live now cost a minimum of 20,000 for something 20 years old), and wasn't able to move out as a result of all of that.\n\nAnd since I was a student at the time, I didn't qualify for CERB.  So even if I tried to, I wasn't gonna be able to afford it *anyway*.", "It Seems like at a certain point one’s personal growth is stunted by being able to defer/rely on your parents for so much. This is a prime example as it’s obvious that OP nor their sister understand how to communicate without acting like children.", "Difference is they are still acting like children and expecting their mommy to handle their issues. Ridiculous.", "I’ve heard of cultures allowing children in schooling to stay, in what culture are they staying with parents “well into adulthood” as the norm?", "She's contributing DRAMA. So is the sister. Mum should have kicked them both to the curb years ago.", "Because living alone is incredibly beneficial in most cases, even if you have a perfect family. The two just don't compare and it's a shame that a lot of people wait for a marriage or a job to be independent.\n\nUnless they have financial issues or some kind of disability, these ''kids'' would do better outside of this environment.", "Because she needs to learn how to be an adult instead of an overgrown, coddled AH who acts like a preteen.", "This is Reddit. Everything is abuse. Good thing OP is an adult and can remove herself from this horrible abusive situation if it’s so bad.", "[deleted]", "This is a perfect example that many people don’t really mature until they’re independent. I understand that in some cultures, people don’t automatically move out in their college years. But I also understand that if they don’t leave their childhood home, they never really escape their childhood dynamic. That’s how you end up with a 28 year old and a 33 year old acting like childish brats.", "Except they're also not wrong.  Culturally, it is the US (and by infection, Canada) who are the odd ones out in the world for people being *expected* to move out in their teens/twenties.\n\nAnd that's the core difference here.  Europe, it isn't a cultural expectation.  North America, it *is*.", "I'm a fully functional adult.\n\nBut not if I end up on a trip or holiday or gathering with my brother. \n\nInevitably someone ends up storming off and slamming doors. \n\nI'm reasonably sure he's also at least a mostly functional adult. \n\nJust can't live together. And clearly OP can't live with her sister.", "OP could have closed her laptop and walked away, problem solved. Instead she chose to scream and cry and act helpless and expect mommy to come in and punish her sister for her, so yes, OP is ABSOLUTELY a part of the problem, too.", "Op needs to handle this with her sister or move out, not wail and expect mommy to solve her sibling problems.", "[deleted]", "Maybe in this particular instance, but plenty of people live with family for a variety of reasons in normal, sane ways.\n\nAnd really, in this economy?  Barring issues like OP is having, it's foolish to NOT to pool resources and work together.", "The parents are at fault for not equipping their children to become functional, independent adults. \n\nMy ex was like this- he had a weirdly enmeshed relationship with his mother and siblings. None of them had ever left home- he was the first one (and only one in the decade we were together) and although the youngest, was almost 30 when he left home for the first time. The rest of them still lived in their childhood bedrooms, slept in their childhood beds, had the same wallpaper with racing cars on the walls... it was creepy, really Norman Bates kind of stuff. The mother often said how lovely she thought it was that her children wanted to live with her forever. The whole house reeked of repressed sexuality and chip fat.", "Sister might be TA in this particular moment, but the way OP describes her own reaction, it's very clear that she's 50% of the problem in the relationship. Both of them need to pack their crap and get some life experience.", "I agree, OP is part of the issue - but not the cause of it. They are not at fault.", "Freaking out because a person who has already destroyed your expensive possession is treating your replacement with similar contempt just for the shits and giggles. Someone who doesn't have the spare income to rent/buy one their own. But yeah such overreaction /s", "Alright, what is the financial status that someone young has in those areas?  Is their minimum wage a fraction of the cost of living?  Would they need to be working 100+ hours a week to afford a one bedroom apartment, let alone food and other necessities?  Because that is the norm through a large swath of the US and Canada.\n\nThis is why I said those variables need to be taken into consideration in areas with a high number of young adults living independently.", "I figure it is incredibly hard for any parent to see their baby as an adult. No matter the situation. My grandma is 90, my dad is 60. She still babies him because he's her baby. \n\nMost parents are just never going to see you as an adult as in their mind you are always their child. Not a fellow adult.", "There is no real evidence that the mother actually believed the sister, OP has only convinced herself of this because the mother didn't intervene in the conflict between OP and her sister. And it's most likely that the mother didn't intervene because OP and her sister are adults who should be handing their conflicts with each other on their own, not running and tattling to mommy and expecting her to punish the other one. They are 28 and 33 for god's sake!", "No, its unreasonable to continue to put yourself in situations where you know you will have meltdowns.  What is the saying \"a definition of insanity is doing the same stuff over and over again and expecting different results\"  its not that she is upset about being lied to or that her mother believed her sister's lies, its she continues to expose herself to these people and continues to get frustrated that they both act the same way and then she reacts the same way.  Of course nothing will change when that is the cycle.", "Being upset is one thing. Screaming and flipping out like a toddler is the opposite of an adult reaction.", ">a lifetime of not being believed by a caregiver \n\nA caregiver? He is 28. I mean clearly it does not bother him enough to move out.", "Again, we don't actually know that there was \"a lifetime of not being believed by a caregiver\", we only know there were two incidents of a mother choosing not to intervene in conflicts between her two adult children who are old enough to be resolving them themselves without running to mommy.", "It takes two to tango in a dynamic like this, and each person is responsible for their own behavior, so even if you aren't the instigator, you're still at fault. Besides, only have the OP's version of the story, and only regarding this issue over the laptop. We don't know that this episode over the computer isn't the latest in a vicious cycle of tit-for-tat pettiness, with the older sister seeing her pettiness over the computer as justified by a similar situation where the OP was just as petty and disrespectful of the older sister's belongings, and so one. Given the extremely childish behavior of these two so-called \"adults\", this would be on-brand for OP.", "[deleted]", "We can acknowledge the housing crisis and the high cost of living while also aknowledging that it's not unreasonable to say a *33-year-old* should be able to put some effort into finding a place to live other than their mother's house.", "The US has a housing crisis, but I doubt OP is in the US. She calls her mom \"mum\", and her and her sister still living at home at late 20s, early 30s, as people have pointed out, that's more common in other cultures, but I do get a foreign vibe. But of course the foreign cultural thing could be an alternative explanation for unmarried grown daughters not being able to move out.", "A lifetime doesn't start at 28...", "Absolutely not.", "Did you add 15 years to everyone’s age? ESH and you suck in particular for making me read this high school drama shit.", "ESH\n\nYou are both too old to be behaving like this.  Keep the receipt and if sister breaks it again, sue her. \n\nYou mom should throw you both out if this is typical behavior.", "> I am convinced my mother doesn’t believe me what happened that night and that is why she has never said anything to her about it.\n\nYou're both adults. Why would you expect your mother to say something to your sister about it?\n\nYou're clearly not happy living with your mother and sister. Move out. ESH - your mother for taking sides, your sister for being spiteful, and you for screaming.", "YTA. There is no evidence that your mother didn't believe you. You are an adult it isn't your mother's job to mediate petty arguments between 2 grown adults. Your mother stayed out of it and your bewilideringly childish response is that you will NEVER FORGIVE HER. That's hilariously childish. It's comical. But not befitting an adult and that's why over either of those two you are the asshole. \n\nYour sister is also an asshole but your response to your mother who didn't wreck your laptop or even say she believes your sister is why you are the primary asshole for this particular situation. For the ice cream wrapper you could ask your mother to help you out because you are having a difficult situation with your sister but having a tantrum instead isn't helpful.\n\nAlso tea, unless it has a bunch of stuff in it doesn't generally destroy a laptop if you shut it off and let it dry out. But anyways don't keep your laptop where your sister will ever touch it. Treat it as though your sister is a toddler (like she's acting) and don't expect your mother to deal with your issues anymore. If you can move out and cut off your sister that might be a path down the road. I'm not saying your family is innocent. Obviously it took time for you guys to end up the way you are as grown children rather than adults. So in general ESH but for this very specific situation I still feel like you're a bigger AH.", ">I bought a computer for study a few months ago. About 2 years ago my sister spilled tea all over it,\n\nWhat?", "You brought a computer a couple of months ago, and your sister managed to spill tea on it 2 years ago? Are you time travelers?!", "NTA,  you needed to express your frustration.", "I’m confused. You said you bought the computer a few months ago but then saw your sister spilled tea on it a few years ago.", "Jesus Christ you’re both pathetic", "In many cultures it is standard for adults to live with their parents. Stop viewing everything with your American imperialistic eyes", "These parents/children sound like they hate each other tho", "They aren’t 18.  One is 33 and the other is 28!!!", "I know, I love my parents so much- they are great. However, when I visit them at my childhood home for too long, I become a sulky, petulant 13-year-old again. It’s painful.", "Extended family living is really normal in this day and age and YOU need to stop shaming people and mind your business.", "You do know that not all cultures behave like Americans do, where you move out at 18, right? There are actually other places with different norms outside the boundaries of the US and Europe...", "...because of this...?", "Do you scream and cry over ice-cream wrappers? My nephews (30 and 27) live at home too but they are functional adults and act their age.  Sister loves having her kids around and they get to save cash for buying a house someday.   \n\n\nNothing wrong with living at home so long as it doesn't make you regress into completely childish behavior like OP and her sister.", "Um, I see one person throwing stuff and the other person being victimized. Someone needs to hold the older sister accountable. It sounds like she's the golden child. NTA. Your mom needed to hear it and you were defending your property from a bully.", "come on, does OP really need to spell out this is frustration building over 2 years & 2 decades ?  \n\nThe first destroyed computer is an easy point of reference, but the mother's non-intervention aka indifference has been going on so much longer.  \n\n&#x200B;\n\nLike, my parents split when I was 15 and my brother 12. He bought into my abusive father's teary promises of change, so he stayed with him. Ever since, my mother bent over backwards to please him and make sure he had a safe place and a reference for normality... she still does.  \n\nOne of the consequences : they both called me a bitch because I didn't want to do the washing-up on my own for the birthday dinner my mom threw for my 30th. Expecting him to help was too much to ask, even on my birthday.   \n\nIt took me till I was 30 before I stopped being angry over this pattern of treatment & till I was 35 before I could laugh about it & love both of them freely.   \n\n&#x200B;\n\nI wager OP is in the same situation.", "I think this is just a part of a toxic dynamic that has probably been going on since they were children.", "I went deepdive on OP's last month of posts, in a post they say they are autistic.. it would very much explain what might look like an adult overreaction.\n\nYou are right, there could be a vicious cycle of tit-for-tat, but there's something about it that sets off my injustice alarm. DARVO (Deny-attack-reverse-victim/offender) is a manipulative tactic and if you know their buttons (ie prized possessions), it could be very effective in setting off a meltdown in an autistic person."]}