{"id": 2427, "submission_id": "ywj0lk", "title": "AITA telling my SIL that she was being a bitch when she kept correcting my dad and reminding her she only speaks one language?", "selftext": "For some context, both of my parents are mexican and although they both speak English very well, my dad sounds a bit like Gloria from Modern Family, so when we're with him, my siblings (26M,22F and 15M) and I only speak Spanish. My elder brother got married to his wife (28F) two years ago, none of my siblings or I really like her because she believes she's the smartest girl in the whole world and is always, always correcting us on some shit. Mrs Smarty Pants only knows one language, so when she's dinning with us my parents speak English. \n\nYesterday my mom made a bomb ass dinner and invited my brother, his wife and my sister to come and eat with us, my brother and I were talking about Pangea and as soon as she came trough the door she ''corrected us'' on the pronunciation (even tho we said it in Spanish and not English) we just rolled our eyes and said nothing because we didn't want to spoil dinner, my parents said hi, she said some more bitchy comments and we all sat to eat. \n\nWe're not a quiet family, we can all talk together or we can do it in groups, since my SIL was there, we were all doing it in English and my younger brother and I were talking to my dad about a movie where the guy escaped on a boat and my dad was saying *boat* as ''*bought*'', my bro and I didn't care because it was pretty obvious given the context, but she said ''it's not *bought*, it's **boat**'', my innocent dad tried to say ''*boat*'' but again, he did it with the *bought* sound and she said ''No, **boat**, not *bought*, **boat**', my dad was obviously embarrassed, but he tried it again, she just sighed and said ''**BOAT**, it's-'' but I cut her off and said ''You're being a bitch. He can't say it, so what? he's not talking to you anyway'', both my brother and my mom looked at me, but my SIL said ''I was just helping'' but I said 'No, you're being rude, how many languages do you speak to be correcting someone?'', my dad took my hand and smiled, but things got awkward and they left, my brother is demanding I apologize because I was an Ah, my dad doesn't think I should do it and my mom is not sure, so idk AITA?", "created_utc": 1668570980, "permalink": "/r/AmItheAsshole/comments/ywj0lk/aita_telling_my_sil_that_she_was_being_a_bitch/", "score": 115, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the AH because I'll admit it was pretty rude and I made the last comment knowing it'll hurt her/her ego\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta, but if you ever do apologize, apologize in Spanish and if she ever tries to speak Spanish correct every single word she says wrong", "She owes your dad an apology. \nNTA", "NTA, although you may not have needed to call her a bitch straight off either  But i realize there may have been some build up to this too.\n\n You stuck up for your dad and pointed out someone elses poor behavior. When people interject to correct someone else's conversation, it's rude. Plain and simple imo. \n\nAlso, what good could possibly come of your SILs correction? She isn't part of the conversation, there were no comprehension issues, and it literally just points out someone's struggle. It serves no purpose other than making her feel superior. She owes your dad an apology.", "NTA she wasn’t just being rude as hell, she was being racist. Your mom is not sure because she doesn’t want a rift to occur in the family, but that’s not an excuse. The fact that your brother let (and continues to let) his wife treat your family that way and then continuously embarrass your father like that says so much about him as a person.\nDO NOT apologize & if I was your mother I’d be putting my foot down & refuse to let your brother & his shit wife over until they both apologized- her for her behaviour & him for allowing her to act like that towards his family", "Absolutely the fuck not! NTA. People like this drive me up a wall. Do you know how hard it is to learn and use one language let alone 2?! She is a pretentious asshole and your brother should be ashamed that he is allowing his wife to continue to disrespect his family like this. You do not owe her an apology and if they keep asking for it tell them to go fuck themselves in Spanish lol", "NTA.  She's correcting someone who didn't ask to be corrected and she only has one language? Please. If he'd asked for corrections (as I frequently do), that's one thing. But if he doesn't think you should apologize, that absolutely did not happen.  Screw her. Y tambien, cuando te disculpes, disculpate en Arabe. Diga esto:\n\n\"A-na ASS-i-fa, ya BINT sharMUta\" \n\n(It means \"I'm sorry, you daughter of a w#0$&.\")", "NTA \n\nWhy isn’t your SIL putting her energy into learning Spanish? The entire family speaks Spanish then it’s time for her to step up and start learning. Then she won’t have time to criticize others who have done nothing wrong.", "NTA or justified asshole. As someone who speaks english as second language I have a strong accent. Or at least that's what people tell me. I don't hear it myself and therefore don't quite know how I would have to modulate my inflection to get rid of it and the mispronunciations that happen because of it. Your SIL was rude and condescending.", "NTA, you are 100% right.", "You don't need to apologize for for anything sil was just being plain rude and disrespectful to your father in his own home.", "NTA - English is spoken in many places and there’s a lot of different accents. Even if you wanted to limit it to just the US - someone from Boston, Chicago, and Houston for example are probably all going to pronounce certain words differently.\n\nThere was no reason to correct him. There was enough other context clues to figure out what he meant.", "NTA. The one that needs to apologize is your SIL.\n\nEDIT: And you don't need to always speak English around her, especially if your conversation is a side one without her involvement (and she's talking to someone else).", "NTA \n\nI have multilingual friends who asked me to correct them so they can improve. Them I correct. \n\nAnyone else, if you understand what they are saying, STFU!!!\n\nIf you repeat the correction over and over again, you are always TA!!!", "NTA. What your SIL was doing was not 'helping'. Correcting someone doesn't mean you get a pass for being rude about it.", "Get her, Jade. NTA", "NTA. \n\nIf bro and her keep insisting, if anything throw them a \"I'm sorry I called you a bitch (cause it's not nice to dogs)\", but you do not need to apologize for calling our her behaviour and sticking up for your dad. I think you did an absolutely noble thing, and I'm sure even the bitch comment was justified based off just the story.", "NTA. Clear she wants to be the absolute smartest person to everyone she knows. She was probably a teacher's pet in school too.", "absolutely not.  she is the one who should apologize and your brother is a wuss for not backing you up and telling her she’s wrong.  especially since she was embarrassing your Dad\n\nnot only should you not apologize- since you’ve opened the door, you might as well step all the way in\n \ntell her (without being mean or judgmental) that she probably doesn’t even realize she’s doing it, but you’ve noticed that she corrects people often and it’s off putting.  if somebody asks for help - great.  but if not, unless it’s a matter of life and death, she should keep her corrections to herself", "NTA\n\nMy kids did this when they were young (under 5). I think because they're frequently being corrected as they learn the language they don't realise it's not the most important part of every social interaction. \n\nThis doesn't apply to your SIL though, she just likes being the importance that comes with being correct rather than having socially appropriate interactions.", "NTA your comment was perfect", "NTA. If she could understand him, then why should she care? You should never correct someone's speaking unless it's causing a communication error/breakdown and even then you should do it gently and with subtlety esp if you are correcting an elder family member.", "NTA. If she's so smart, why can't she learn Spanish? Do not, under any circumstances, apologize to her.", "NTA. She should apologized for not letting it go since clearly everyone knew what he meant, especially her since she was correcting him (therefore still understanding him)\n\nAnd for those saying she was an AH or rude for calling her a bitch, this has been a constant thing and this situation was probably the last straw. I probably see it this way because I would’ve done the same thing so hey, maybe I’m an ass too :)", "Truthfully, you were sorta the ass but you get upvoted to NTA for RIGHTEOUSNESS AND STYLE!", "NTA. As a monolingual person, I admire people who can speak two languages. Your dad's English could still be understood in the context and she was being patronising, to the point of making him embarrassed and feeling relieved when you defended him. I usually correct my parents' pronunciations (they are immigrants) because I know them well enough to but I wouldn't correct a stranger's. Even my husband doesn't correct my parents, he'll just ask me later if he didn't understand something.", "NTA. It was a little harsh but she could have quit while she was ahead, she pushed until she had to be told to stop. Hopefully she learns to be nice in the future", "NTA", " NTA! I would be proud of you as a sibling or a father! Way to go, for your family!", "NTA\n\nNot only did she correct your dad but she also corrected you and her brother. She has no business correcting anybody.", "NTA I read every line in Gloria’s voice", "NTA - the absolute best way to apologize would be gifting her a shirt with ‘asshole’ translated into a bunch of languages printed all over for Christmas. But I’ve been known to be the pretty petty.", "NTA, she needs to learn that her comments are inappropriate and rude AF!!", "Uh un. Nope. I was really trying to find a way to tell you to continue being gracious and supportive of your brother's wife. But heck no. She is a prime a hat. Rude *and* condescending to your dad in his home? Nooooooooo. Your brother should explain to his wife privately that no one enjoys her rudeness and no one besides him signed up tp tolerate it.\n\nYou were kinder than the situation called for, frankly.\n\nNTA.", "NTA. Jesus. She sounds incredibly rude.", "NTA!", " Seriously though NTA No le debes absolutamente nada excepto una rápida patada en el trasero.\n\nGood for you for standing up for your dad.", "NTA, what she did had nothing to do with helping but with feeling like the smartest person and embarrass him.", "NTA!", "NTA. Keep doing that. Compare their Spanish to here's OH WAIT.... It'll be for the best. She'll need to get it through her head to succeed in this family.", "NTA. As an English speaker who knows maybe ten Spanish words in total, I do not get offended by people speaking it around me. I understand I do not need to be in every conversation. Would it be rude if ALL of you were speaking only Spanish so she's excluded? Yes. For a sub-group to speak it to each other while she is in the room? No. At this point, I would say it needs to be done to make a point.", "NTA…You have nothing to apologize for. Someone had to put her in her place 🤭", "Gentle ESH\n\n> you're being rude\n\nThis \\^\\^ was the correct way to respond to your SIL's poor behavior.\n\n#Don't call women \"bitches\"\n\nIf someone's an asshole, call them an asshole. But **_gendered_ derogatory terms** suck.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nFor some context, both of my parents are mexican and although they both speak English very well, my dad sounds a bit like Gloria from Modern Family, so when we're with him, my siblings (26M,22F and 15M) and I only speak Spanish. My elder brother got married to his wife (28F) two years ago, none of my siblings or I really like her because she believes she's the smartest girl in the whole world and is always, always correcting us on some shit. Mrs Smarty Pants only knows one language, so when she's dinning with us my parents speak English. \n\nYesterday my mom made a bomb ass dinner and invited my brother, his wife and my sister to come and eat with us, my brother and I were talking about Pangea and as soon as she came trough the door she ''corrected us'' on the pronunciation (even tho we said it in Spanish and not English) we just rolled our eyes and said nothing because we didn't want to spoil dinner, my parents said hi, she said some more bitchy comments and we all sat to eat. \n\nWe're not a quiet family, we can all talk together or we can do it in groups, since my SIL was there, we were all doing it in English and my younger brother and I were talking to my dad about a movie where the guy escaped on a boat and my dad was saying *boat* as ''*bought*'', my bro and I didn't care because it was pretty obvious given the context, but she said ''it's not *bought*, it's **boat**'', my innocent dad tried to say ''*boat*'' but again, he did it with the *bought* sound and she said ''No, **boat**, not *bought*, **boat**', my dad was obviously embarrassed, but he tried it again, she just sighed and said ''**BOAT**, it's-'' but I cut her off and said ''You're being a bitch. He can't say it, so what? he's not talking to you anyway'', both my brother and my mom looked at me, but my SIL said ''I was just helping'' but I said 'No, you're being rude, how many languages do you speak to be correcting someone?'', my dad took my hand and smiled, but things got awkward and they left, my brother is demanding I apologize because I was an Ah, my dad doesn't think I should do it and my mom is not sure, so idk AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- keep defending your poor dad. I can’t help but take this personal cuz I’m Mexican with a lot of Spanish only family. Thinking of someone embarrassing them for trying to be accommodating makes my blood boil", "Nope, NTA and your bro should tell her to stay in her lane.", "NTA.  Your SIL sounds like a PITA and you were standing up to your dad who was clearly being bullied by her sanctimonious (and prejudiced) attitude.\n\nMy mom has an accent.  My husband has sometimes asked me to clarify what she said but  never so she could hear (she prides herself on having “no accent” lol) and always respectfully.\n\nMy husband’s father also has a heavy accent.  I could never imagine embarrassing him over it.\n\nSo I also blame your brother here for siding with his wife.", "NTA- she is an American girl who thinks everyone is inferior to her", "Unless she was a speech therapist and your Dad requested help, you are obviously NTA.\n\nIt is exceedingly rude to correct someone, in their own house, while eating their food! Your brother should point this out to his wife (while it is kind to support your spouse, it needs to be done with a view of all the folks involved).\n\nMy mother's Mom was from Europe, but when they came to the US in the 1920s, the family was all \"We're in America now, speak English!\" So my Mom and her Mother were shopping in NYC and grams had been in the country for about 25 years at this point. Grams asked the saleslady a question. Saleslady looks at my mother and asks, \"Aren't you going to translate what she said into English?\" Mom responded \"It was asked IN ENGLISH!\" \n\nSilence.\n\nThere are just those people out there.", "Mmm xenophobia for dinner. NTA", "NTA\nI hate when people correct others second language when the fact that they’re fluent is an absolute achievement and often the person correcting only speaks a single language.", "NTA. Do not apologize to this hag. She got what she deserved.", "ESH. Your SIL for pushing it when it was clear that it was a pronunciation issue and you for being rude to her in response.", "I think I love your mind. It’s very petty.", "This is the way, be petty as hell. But honestly don't apologize, you were completely right. Learning and speaking another language is not easy, I would feel like absolute shit if someone did this to me when I speak my second language.\nNTA", "Yes! If she’s going to be a full time part of this family, she needs to learn how to respect other family cultures, and appreciate her new family when you have been so welcoming towards her and having her over for dinner.", "Currently commiting this phrase to memory", "Wait until she understands how hard it is.", "EXACTLY. Why should they have to speak a language that's not their first in order to accommodate her?? She should be making the extra effort in Spanish, not in correcting her FIL's English.\n\nI'm going to assume his English is perfectly fine and understandable and SIL just can't understand his accent.", "Even just in Boston, there are several distinct accents, and then move sound and west of boston, no more than 60 miles, and there are still more distinct accents!", "Language is a manifestation of culture - always. Its how we communicate and what most relationships are based on initially. Consequently (as the profs say,) the goal is to be understood. If you are understood, your speech is appropriate in that context. Expand her knowledge base and teach her some basic sociology and then some dadgummed manners. 😂", "This is my new favorite comment lol", "Is there any other way to be", "I only needed to google two of those words so I'm feeling pretty good about myself.", "You’re reading too much into it.", "For how small the UK is, there a tons of accents. It's ridiculous.", "No, there isn't", "No, it's a horrible word, and if you don't speak out against it, you approve of it.", "You think it's horrible, don't use it. What gives you the right to police others on it.", "... you know this is a sub **_expressly about_ passing judgment** on people's behavior, right?"]}