{"id": 24330, "submission_id": "15neokr", "title": "AITA for escalating a dispute with a neighbor to the USPS and maybe getting them in a fucktonne of trouble?", "selftext": "I just moved to the United States from Canada for work. My dad was from the States so I have dual citizenship. However, other than vacations and family visits I have always lived in Canada.\n\nI am renting a house in a nice neighborhood. My dogs and I like it here. Except for my neighbor. He is odd. I guess he was friends with the previous tenant. And he keeps taking my mail. \n\nI have caught him on my security camera. He will come and grab all the mail and then come back later and put my mail back. I went over to ask him about it and he said that the previous tenant had asked him to please grab his mail for him. I said that was nice of him but that I would appreciate if he could please leave my mail alone. I wasn't rude or anything I don't think. He said that he was friends with the guy and that he made a promise. I had a solution. I said that I would bring in all my mail from the mailbox and then put his friend's mail in his after I sorted it. For some reason this wasn't acceptable. I was going to even offer to let him look through the mail on my step and take his friend's stuff and leave my mail in my box without taking it with him. Until he said he didn't want a stranger putting stuff in his mailbox. The lack of self awareness was sickening. I told him to stay off my property or I would be upset. Then I left. \n\nHe did it again. I went to the post office to see if I could get his friend's mail forwarded to his address or to see if the change of address form was not processed. I just didn't want this guy taking my mail. \n\nAnd that is when I found out that stealing mail is a serious crime down here. The USPS actually has their own cops. And that stealing mail is a serious crime. \n\nMy neighbor came over again yesterday to apologize and to promise that he would not take my mail again and to ask me to talk to his lawyer and explain that he never kept any of my mail. \n\nI said that I would. I was talking to my dad bout it all and he said I was kind of mean to get this guy in trouble for doing his friend s favour.  I said that I thought the guy was rude and I didn't know if he was giving me back everything he took. What if he took my credit cards or official records or medical stuff or something. \n\nMy mom is Canadian so she thinks I should have been nicer.  I thought I had been.", "created_utc": 1691679213, "permalink": "/r/AmItheAsshole/comments/15neokr/aita_for_escalating_a_dispute_with_a_neighbor_to/", "score": 25, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My neighbor kept taking my mail so he could get his friend's mail from it. I might be the asshole because I sort of told the cops and he is in trouble for trying to do his friend a favour.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou asked nicely, and even came up with alternatives, and the guy kept taking your mail which, as you found out, is a pretty serious offense.  You just don't do that!\n\nYou also went to the Post Office not realizing how serious what your neighbor was doing actually *was* and were only looking for a way to get the old tenant's mail forwarded to a different address.  You didn't actually go there to get the guy in trouble, so you were going out of your way to, again, try to be nice and have the issue corrected by having the mail forwarded from your box.\n\nI also like how your neighbor asked you to talk to his lawyer and explain he never kept your mail.  In actuality, how do you know that?  If he kept something and never gave it to you, how would you know?  That's why we don't allow people to come and grab another person's mail and take it into their homes.\n\nIt actually sounds like you were nice and continued to try and be nice about it.  Neighbor did not want to work with you on this at all and now is paying the price.", "NTA, you handled it perfectly.  Assuming everything was on the level, the guy didn't have nefarious intentions.  But I, you, most people, and most importanly your neighbor all agree that we don't want anyone going through our mail.  You asked nicely and gave alternative solutions that most of us wouldn't have bothered with.   And he kept going through your mail.  You used the resources at your disposal (usps investigators) to do the job they are literally there to do.  You did nothing wrong man.", "NTA.\n\nTaking someone else's mail is a federal crime, and the USPS does take it seriously.\n\nYou asked your neighbor nicely to stop taking your mail, and gave him two alternatives - either check the mail on your porch himself, or you would sort the mail and give any mail for the previous tenant to him.  He rejected both of those options.  You were perfectly nice.  Your neighbor was a jerk.\n\nYou were also nice to even speak to your neighbor's lawyer, and helped your neighbor avoid serious consequences for his actions.  I would not have agreed to say that your neighbor gave back all of your mail - you can't be 100% certain that he did.  \n\nYou were absolutely nice enough in this situation.", "NTA. The lack of self-awareness is astounding. He did commit a crime. You don’t have to do anything. Don’t talk to his lawyer. This guy dug himself into a hole by steamrolling you and forcing your hand.", "NTA. GO THROUGH WITH USPS COPS. He wants you to now speak to his lawyer and explain? Explain what? Don’t talk to anyone he sends.", "NTA. You were more than reasonable to start with and offered a solution, your neighbour ignored you. What else were you supposed to do ?", "NTA. He knew what he was doing was wrong and illegal. He thought he could bully you into letting him have his way. Let him deal with the consequences.", "American here.  The dude was 100% in the wrong.  It's your place, now, not his friend's.  Your solution of giving mail back to him from his buddy was sound, reasonable, and neighborly.  To continue to go through your box was criminal.  He's not likely to get into to much trouble for the one offense, though.  So don't worry too much about it.  He'll just have to pay through the nose in lawyer fees and probably a fine.\n\nAnd that's a result of his own stubbornness.  NTA, OP.", "There's no circumstance under which it would be remotely legal for this guy to take a single piece of your mail out of your mailbox, no matter if he brings it back or not.  The USPS doesn't fuck around with that.  And, yeah, he knew that, because everybody who lives in the US knows that.  It's a very popular piece of cultural lore.  Although I don't know how they can PROVE he did it, since you haven't mentioned providing them with the security camera footage.  It's possible that when the Postal Inspectors came to talk to him about it, he admitted it.  If so, he's boned, and no mistake.\n\nI'm not clear on why he wants you to go tell his lawyer he didn't keep any of your mail- you have no idea if he kept any of your mail.  For all you know, he kept a bunch of junk mail credit card offers that were sent to you.\n\nAnyway, NTA, he committed a federal crime, you told him not to do it again, he doubled down, it is good and proper and right that the Postal Inspectors address this.", "NTA. \n\nYou told him and gave him solution. He declined. The tenant who moved could have gone to the USPS themselves and had all mail coming to that address with their name come to the correct address. You don't even have obligation to give them their mails, as far as I know. There was many ways to fix this, they refused. \n\nAlso, you said you'll get things fixed. Why your parents even blaming you for? When the guy could have stolen something.", "My favorite line: “My mom is Canadian so she thinks I should have been nicer.”\n\n&#x200B;\n\nNTA", "NTA. Hey this is the first time I ever get to say it.  He fucked around and now he's finding out.", "NTA\n\nWelcome to America.  Keep being nice, but if you're nice and someone WON'T respect your legal rights, after asking nicely, its much better to report it then taking measures into your own hands.  Isn't it interesting when they have to deal with a consequence of being rude and invasive that having to get an attorney this person is \"nice\".  I hope he is and you will have civil relations, but you did the least intrusive thing, and then tried the next and finally got the results that were only correct and warranted.", "Welcome to America! Did you truly even move here without getting cops or lawyers involved? ;)", ">My neighbor came over again yesterday to apologize and to promise that he would not take my mail again and to ask me to talk to his lawyer and explain that he never kept any of my mail... I said that I would.\n\nHow do you know he didn't steal any of your mail? Why lie to his lawyer and say he didn't take anything of yours when you don't know? You gave your neighbor a chance to stop stealing your mail and he refused. Your neighbor chose to escalate things by ignoring your warning. NTA", "NTA\n\nYou tried to work with your neighbor and to accommodate him. He refused to do anything except exactly what he wanted.\n\nYou have rights in this situation and the USPS recognizes that. You only escalated to them when your neighbor refused to be reasonable in any way.\n\nHe shouldn’t have even been looking at your mail - much less bringing it into his house. \n\nAs far as the request to confirm that he didn’t keep anything - you shouldn’t comply. You don’t actually know if he took anything or if he opened your mail and resealed it. The most you should do is say that you aren’t aware of anything missing.\n\nYou may also want to consider locking down your credit. Your neighbor now likely knows what credit cards you have and your billing address. Other identifying info could be easy for him to obtain.", "NTA, he committed a crime by removing your mail from the mailbox, which iirc is considered propery of the USPS. How do you know he didn't keep any of your mail? You can't. \n\nDo not talk to his lawyer without representation yourself. You can not state he never kept any of your mail because it is absolutely *impossible* for you to know.\n\nThere are forwarding processes, so the previous person shouldn't have even asked this of the neighbor. And neighbor should have known better than to agree, much less actually do it. Don't do a thing except answer the questions in any investigation truthfully.\n\nMaybe it isn't, but I always thought it common knowledge that you do not remove anything from someone else's mailbox or open mail not addressed to you because it is *illegal*.", "NTA obviously but why is the previous tenant still getting mail delivered in the first place?\n\nHe can just set up a forwarding order.", "NTA\n\nMaking a promise to a previous tenant is not a pass to violate the law. And the solution here is actually for the previous tenant to set up mail forwarding.", "You calmly talked to this guy, proposed alternatives that could solve the issue for both of you, gave him a fair warning, went out of your way to prevent the problem from continuing, and now have offered to talk to his lawyers. You're living up to the Canadian stereotype of being very nice lol, NTA", "You actually don’t know if the stole some of your mail or wether this supposed agreement with the previous tenant exists. Don’t take your chance and let justice take its course. \nYou should make a copy of the security footage and give it to the USPS folks.", "NTA. Fellow Canadian here, I would have done the same!", "NTA.", "NTA. What did the guy think would happen after he refused to stop taking your mail? You reported him to someone who could MAKE him stop. Good for you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI just moved to the United States from Canada for work. My dad was from the States so I have dual citizenship. However, other than vacations and family visits I have always lived in Canada.\n\nI am renting a house in a nice neighborhood. My dogs and I like it here. Except for my neighbor. He is odd. I guess he was friends with the previous tenant. And he keeps taking my mail. \n\nI have caught him on my security camera. He will come and grab all the mail and then come back later and put my mail back. I went over to ask him about it and he said that the previous tenant had asked him to please grab his mail for him. I said that was nice of him but that I would appreciate if he could please leave my mail alone. I wasn't rude or anything I don't think. He said that he was friends with the guy and that he made a promise. I had a solution. I said that I would bring in all my mail from the mailbox and then put his friend's mail in his after I sorted it. For some reason this wasn't acceptable. I was going to even offer to let him look through the mail on my step and take his friend's stuff and leave my mail in my box without taking it with him. Until he said he didn't want a stranger putting stuff in his mailbox. The lack of self awareness was sickening. I told him to stay off my property or I would be upset. Then I left. \n\nHe did it again. I went to the post office to see if I could get his friend's mail forwarded to his address or to see if the change of address form was not processed. I just didn't want this guy taking my mail. \n\nAnd that is when I found out that stealing mail is a serious crime down here. The USPS actually has their own cops. And that stealing mail is a serious crime. \n\nMy neighbor came over again yesterday to apologize and to promise that he would not take my mail again and to ask me to talk to his lawyer and explain that he never kept any of my mail. \n\nI said that I would. I was talking to my dad bout it all and he said I was kind of mean to get this guy in trouble for doing his friend s favour.  I said that I thought the guy was rude and I didn't know if he was giving me back everything he took. What if he took my credit cards or official records or medical stuff or something. \n\nMy mom is Canadian so she thinks I should have been nicer.  I thought I had been.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\n\nYou asked him several times and he didn't comply.  He isn't that forgetful.  He is being nosy and who knows if he is keeping some of the mail.\n\nThe neighbor's mail should either be forwarded per a forwarding order or returned to sender.  Neighbor isn't really entitled to prior tenant's mail either.", "I still feel kind of shitty about it. Especially after my dad showed me the penalties he could face.", "I hope that is all.", "I like to live by Roadhouse rules. Be nice until it is time to not be nice.", "It costs like $1.50 for mail forwarding. No reason the previous owner shouldn't set it up.", "That’s a him problem though. He shouldn’t have committed a crime then", "What was your dad's solution? Continue to let the guy go through your mail, potentially keeping anything he finds interesting?", "That's because you're a decent person and wasn't looking to get your neighbor in trouble.  You did your best to be a reasonable person and your neighbor was too pig-headed to find a solution that worked for everyone.\n\nIf this case comes to court, you can go and speak on his behalf... more than likely, since this wasn't malicious, he's not going to get the book thrown at him.  Hopefully, with you in his corner, he'll just get a slap on the wrist.\n\nHowever, people need to be responsible for their own actions.  He was doing something illegal, and you asked on more than one occasion for him to stop and he refused to do so.  Don't beat yourself up over it!"]}