{"id": 24362, "submission_id": "15npdxq", "title": "AITA for not wanting to share my dinner with my wife?", "selftext": "I'm sitting here half annoyed half confused how to feel. Here is my situation:\n\nMy wife did not work today. Has been hanging with the kids all day. I got home from work at 530 and did a turn and burn to jujitsu class. Dinner was not discussed but since I was getting home at 830 from I assumed I was on my own for dinner.\n\nI get back at 830 absolutely Starving and exhausted. I Had been planning my dinner all day: poor man's sushi (it's just canned tuna, rice wrapped in seaweed). I write down everything I eat in a food log and had planned this dinner in advance. I had the exact amount of rice and only two sheets of seaweed. I get home and my wife and kids are in the bathroom taking a bath so I get to work on my sushi. I have the entire thing written down and I'm ready to feast.\n\nI'm giddy with excitement sitting down at the table. All the sudden my wife comes out and into the kitchen and says \"can I have half of that? Me and the kids went out for a late lunch and I haven't eaten\"\n\nI pause. Obviously not happy with this news. I don't want to share but I also acknowledge that hogging down all the food would be selfish.\n\nSo she notices the pause and goes \"fine I guess I'll just figure something out\" in a pissy tone. I go \"no no no we can split it.\" And give her half. I go on to explain my situation but I don't think she cared. She was annoyed that I even paused.\n\nNow I only had half my dinner and am still hungry. I can't imagine asking for half of someone's food as they are just sitting down to eat. But I also can't imagine not sharing it. I can't decide how to feel.\n\nThat's the story.", "created_utc": 1691703807, "permalink": "/r/AmItheAsshole/comments/15npdxq/aita_for_not_wanting_to_share_my_dinner_with_my/", "score": 1820, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I was briefly considering not sharing my dinner with my wife. She was hungry and had been taking care of the kids all day. I paused and thought about it for a little bit. I in fact did NOT want to share. And because of that I indeed might be the asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA.  Not for the food thing - ESH. Both people have a right to feel annoyed at that situation and I hope you work out shared responsibilities for food in the household if needed.  Also what the heck did the kids have for dinner...?!\n\nBut back to my point, YTA for talking about her day like spending it with the kids is just leisure time. It sounds like she was kept just as busy as you and only got a break in her day after giving the kids a bath. She sounded desperate and likely needed that food just as much as you did.  Hope you can try to see the situation from her perspective.", "YTA. \"Hanging with the kids\" as if she's on a fucking vacation.", "YTA. Imagine calling what she does \"hanging with the kids all day\" when they evidently kept her so busy that she hasn't had time to eat. At least you got 3 hours + prep time to yourself. \n\nEither you stayed hungry after your half of the dinner because neither of you could be bothered to as much as make a sandwich, or there's no other food in the house. Either way, you don't come out looking great.\n\nStart talking with your wife about your dinner plans and coordinate your days. This could all have been avoided if you'd just taken the time to think about and check in with her and the kids before heading into the kitchen.", "[removed]", "Info: are nights like these a normal occurrence?\n\nHonestly I think there’s probably more nuance to this situation than AITA can handle. If the jiu jitsu class is planned in advance, your wife has a similar amount of free time to indulge in her hobbies while you handle the domestic responsibilities, and she’s aware of your focus on nutrition, then you’re not an AH - she’s probably just exhausted and short on patience. \n\nIf you’re taking personal time every night at her expense, only considering your own needs, and dumping all of the planning on to her - then you’re clearly an AH and sharing dinner is the least you could do. \n\nThe real situation is probably somewhere in between and could probably just be solved by a little extra planning and consideration.", "YTA.  She was hungry because she was busy with the kids all day and didn’t get a chance to eat.  You both could have done better, but YTA for not recognizing how difficult and exhausting it is to be home all day with kids.", "YTA for this comment\n\n>Has been hanging with the kids all day\n\nFirst of all, it's not just hanging. It's wrangling them. That's a lot, and it's easy to miss eating and mom's often skip meals with the kids. \n\nAlso:\n\n>I can't imagine asking for half of someone's food as they are just sitting down to eat.\n\nYou're not just someone. You're her husband. It's not unusual to share meals with spouses.", "YTA. Thinking your wife spending all day with your children is just “hanging out” blows my mind. Why are y’all out having kids?!?", "YTA for making an assumption instead of taking 10 seconds to check in with her about dinner before you left. You also could have called on the way home to see if she needed anything. \n\nI get trying to get to class on time, but it would have taken a few moments to ask “Am I on my own for dinner tonight or do you want me to stop and get you something on my way home?”", "If you're still hungry... eat a sandwich for god sake instead of complaining on the internet 🙄", "Imo you could have asked her if she already ate when you came home, and this would have been avoided. So it feels normal that you shared, and if you knew it wouldn't be enough to satisfy both of you, you could have just said so and proposed to cook something more. I'd go with YTA in the way you handled the whole situation", "ESH \n\nYou are a family with kids and should be communicating about who is responsible for dinner so that this sort of thing doesn’t happen.", "Are you all like 3 years old? For fucks sake ...", "YTA I never make or order food for myself without offering to make or order food for my husband.\n\nWhen you have a family you’re supposed to consider their needs, not just yours.", "I’m confused what did the kids eat for dinner and why didn’t your wife eat the same?", "Would you say that you guys generally share the load pretty equally in both parenting roles and cooking roles?", "YTA- how do you have children with this women and not have learned to communicate or have a plan in place for days like this? I’m assuming this nearly 3 hour long class isn’t a spur of the minute thing. If it’s weekly or monthly or whatever how is there not an SOP between you and your wife for how dinner is handled those nights? You have a food journal where you write down every meal in advanced but you can’t make a plan with you wife? \n\nIn lieu of a plan how about even an ounce of communication. “Hey wife, since I have class till 830 should I assume I’m on my own for dinner or do I need to pick something up for for the family?” How about a text earlier in the day saying you’re looking forward to this solo meal? So you can say “Hey honey I just got home and making my sushi, did you have dinner or can I make you something too since your bathing our children?” Also, at no point do you mention speaking to your wife till she approached you in the kitchen. Dude. Talk. To. Your. Wife.", "SO it’s 8:30 and the kids didn’t eat dinner because of a late lunch but your wife hungry?  I’m more concerned with the kids than the wife being hungry", "you get breaks, solo car rides, three hours of jujitsu and your wife gets to deal with kids *all day,* a grunt and half of some seaweed with rice.. How do you think in your head your getting away with this? YTA", "Bro, it's a husband thing. You're getting food, wifey says she's not hungry, but you gotta make extra anyways or buy extra, it's just common husband skills man. You know damn well she's finna want some of what you're eating.", "YTA - Just for posting something as stupid as this. You and the wife seem to be infants. Get over it and eat a granola bar.", "YTA, maybe think beyond yourself once in a while", "E s h for the food thing, but YTA for the day.\n\nSo, she was alone with three children all day, you get home and immediately leave for THREE HOURS of your hobby without even discussing with your wife if she might need a break or help with dinner, and then don’t even check in with her to see if she ate after she got the kids settled alone?\n\nGrow up.", "Awww your tummy was rumbly? Poor thing. 🙄Good Lord dude, you’re a freaking adult, grow up. Maybe you should take a course in marital communication for 3 hours instead of playing Cobra Kai. \n\nYTA", "This story feels fake as hell!", "YTA. I can’t imagine having my wife take care of our daughter all day and then debate telling her she can’t have food just cuz I made it and am hungry", "NTA. I have 3 kids and take care of them all day about half as much as my spouse. Neither of us forget to eat, except for the odd meal here and there. However, the OP’s wife isn’t the AH either, both were starving clearly, I’m not going to lie to you all, sometimes I’m selfish when I’m starving too. Everybody has their moments and this guy isn’t a horrible father if we take it all into account. That said we don’t know this guy personally.", "NTA. You have legitimate reasons for not wanting to share this particular meal. Everyone is jumping on you being gone for 3 hours but I assume their are nights your wife gets to go out too.", "NAH.\n\nI can understand both of your perspectives. You both were busy the whole day and couldn't eat, and you two also didn't communicate. Your wife probably was nearing her wits end at that point to where everything that goes wrong is enough to make her flustered.\n\nI would just have a sit-down talk with your wife and then just be honest with her about your feelings and see if you two can come up with a compromise.", "This is honestly baffling\nI don't think you're an asshole, she could've just got herself something, like you did🤦", "[deleted]", "Yta who just makes themselves food without checking on their family?", "YTA  \nYou are wat too self centered, you work - your wife takes care of the kids, you come home and then leave for your workout - your wife is bathing and taking care of the kids - you come home, prep and start to eat food for you only - never asked if the wife wanted anything - you could have shopped on the way back from your workout.   \nYou are 100% about YOU.", "YTA. “She just hung out with the kids all day” you’re a garbage husband and father.", "YTA, grow up.", "Imagine being butthurt for someone asking for half of your janky canned tuna and rice. YTA", "YTA. So you just left your wife to take care of the kids all day, didn’t bother to see your kids or even contribute to the bed time routine, and then can’t even give your wife a snack? That’s wildly selfish.", "NTA. She's pulling the oh hey you have food, I want some card.", "YTA-- I don't need to tell you why the many people here already have much more eloquently than I have.\n\nYeah totally big time.", "YTA\n\nEat half and make more of something else-or ask her to.  Like “sure! But we’ll need another side do you have any ideas?”  \n\nLike good grief it’s your wife, hungry after taking care if the kids while you had your personal time.\n\nEdit:it’s about *tone* not the eventual begrudgingly doing it", "NTA I'm actually going to say that because I'm going to ignore the parenting situation to answer the base question. I would probably suggest asking yourself whether this scenario of not being able to stick to your plan caused you anxiety. If you're doing so much exercise and counting calories to (maybe) the point that some tuna and rice rolls are your strict plan then consider that your reaction to your wife's request to change that plan could have come from experiencing disordered eating.", "That sounds nasty. Not sure why she would even want to eat that.", "Lol everyone hears one night of your life and now you're a deadbeat dad. You even shared your food, you just had an emotional reaction which is entirely normal especially after jiu jitsu class, you didn't even act on it. \n\nThey're going to tear you apart for your verbiage but life goes on man. \n\nNo one TA", "I feel like there’s a lot of assuming going on in these replies. He said this is a weekly class and he usually preps his own dinner afterwards. That’s their routine. For all you know she goes to yoga once a week and the roles reverse. \n\nCalling it “hanging with the kids” may be tone deaf but maybe that’s what he says when either of them are with their kids.", "Haha I’m the cook in our house and I’m the husband. What a freaking baby you are. My wife and I always coordinate our meal plans. Been married 30 years this October. Also raised kids. \n\nYou sound like a person who still needs his mama because you were spoiled. You probably think cooking is just a woman’s job and don’t know how. \n\nI was raised to cook for myself and since I spent over ten years in the Marine Corps I don’t consider myself feminine. It is not feminine to know how to cook.", "YTA\n\nImagine if you were in your wife's shoes after spending all day looking after kids, no time for self, just time for serving others and you are hungry when you stumble upon your husband with one hand on the sushi wrap. \n\nI can understand your frustration but you could have just made more. Making more may have taken less time than getting angry and posting your unresolved feelings here. I hope you work it out with the wife.", "NTA. She can make her own food.", "NAH. You could have texted a quick \"are we on our own for dinner?\" On the other hand, it's usually a pretty safe bet that the family would have eaten by 8:30.", "YTA you obviously have no respect for your wife or what it takes to raise children. You sound like an Andrew Tate wannabe", "NAH/ESH you seem to have huge miscommunication going on. (especially considering you are having kids in your houshold)\n\nAlso YTA for not understanding her situation (the way you talked about her \"not work, hanging with the kids all day\" yeah, that sounds like you think she had an easy day. But all day with the kids probably was really stressful, I mean she didn't eat and was really hungry)  \nI hope you can talk about that with each other.", "NTA\n\nIf supper is not discussed with regards to eating together,  than it's usually assumed your on your own.\n\nIf she wanted in on your tuna rolls, the time to speak up is just as prep starts.\n\nI know the majority of redditors jumped on you for the whole 'hanging out with the kids thing. But, what did the kids have for supper? Why didn't she eat supper at the same time as the kids? If the kids didn't have supper yet, she could eat when they do.", "Nta. This comment section is basically saying men can’t have free time", "YTA, not for not wanting to split your dinner, but for dismissing the amount of work your wife has to put in by parenting *your* kids *all day* BY HERSELF so you can spend the entire day out of the house, three hours doing jujitsu and then come home at 8:30, not even speak to your wife and kids or plan with her at all about dinner, then making just enough food for yourself. I would say don't you understand how hard it can be to feed yourself when wrangling small children for hours and hours on your own, but it doesn't sound like you ever DO spend a significant amount of time doing solo child care.\n\nYou're carrying on like a single man without kids, but you are not. You need to work with your wife about these things, plan ahead with her about meals and when you're going to be out of the house. You don't get to just dump parental responsibility on her all day and then act pissy when she's not happy that you cooked for yourself without even asking if she's eaten yet. You're supposed to be a team, act like it.", "I don't feel like you're the butthole, although I do feel like it is on you to get so distracted by your exercise that you forgot about wife tax. I will buy a second bag of something because I'm familiar with husband tax. You can however be annoyed and nta. 😂😂", "YTA. \n\nI track macros and haaaaaaate when someone ruins my tracking for the day but. As a father, you should have checked if your family had eaten, and if not, sorted that out before assuming they had. \nCommunication is key my friend. Lesson learnt yeah?", "NAH. Bad communication skills of both parties though.", "You are a selfish asshole.  You are only concerned about yourself.  Work all day and head right to a workout and make plans concerning only your own dinner.  Meanwhile your wife is responsible for dinner for the kids and getting them ready for bed while you have me time.", "NTA. Does your wife know you log your food? Maybe she should. You two have a communication problem. I'd be annoyed too. I'm with you: I hate sharing my food especially when I am sitting down to eat, it's late, after a workout, after a long day. Was there really no other food available in your whole house? Like a can of soup? Frozen veggies? Almond butter and rice cakes? Anyway did she skip getting anything for herself at that late-lunch restaurant. Jeez, you could have said something about not picking up something for you. LOL.", "NAH\n\nBad communication", "YTA, if my husband asked to share anything I would always say yes.", "I think YTA for abandoned your wife all day and into bedtime hours. Why did you not ask her if she had eaten before you went out? And if she wanted you to pick up anything on your way back? I am curious, however, why she didn't eat with the kids. Could it be she wanted some time with her partner? Maybe a dinner conversation? After spending the day with small people.", "I knew this would go south.", "Whenever I'm fixing myself food, I always ask my husband if he wants anything. That would have solved this witjout drama. \n\nI do understand the frustration over food planning and logging. That's part of my process also. So it IS annoying when someone's asks me to share. So, ivelearned, my work around is, \"I'm fixing a snack. Do you want anything since I'm up?\"\n\nYour wifecwas probably tired from a hectic day, and hadn't had time to eat, saw you had something,  and then her feelings were hurt by her perceived \"I don't care about you\" attitude. \n\nTalk about it tomorrow when you are both rested.", ">My wife did not work today. Has been hanging with the kids all day.\n\nYTA, and it's not even for the reason you seem to think it is.", "You put all your food in a journal and eat canned tuna with rice and seaweed and that's it. I'd divorce you for that reason alone.", "The way these comments are he went to work then his hobby planned a meal was slightly perturbed he had to share! He is man arsehole! His wife at home with the kids went out had a late lunch was home food in the kitchen but was too busy to cook or order in or eat anything so when the kids had dinner she had nothing or she put the kids to bed with no dinner? Why because of this rampant divisiveness do so many people lack critical thinking skills?", "I feel like you can really tell which commenters have kids and don't have kids, as well as which commenters have kids they hate and which have kids they enjoy spending time with.", "YTA. Sharing food is a basic display of love and caring. \n\nShe probably needed more to eat after that snack, as did you, and probably the kids needed more food too since they hadn’t eaten dinner yet. \n\nSharing the snack and then making something else for everyone sounds like the way to go.", "I never wanna share when I'm starvin Marvin. \n\nI avoid your issue by asking, \"*Hey I'm making food. You want in*?\" \n\n🤷‍♂️\n\nNAH, everyone sounded hangry", "YTA- I clearly know more about your life than you do and based on your post have determined that you never spend time with your kids and that you not immediately sharing your food is a reflection of your poor parenting. No matter what you say in the comments, you'll be wrong. Your kids are a nightmare, this is why your wife was annoyed. Reddit had spoken.", "ESH: Your wife was probably just as hungry as you considering having had an early lunch and was taking care of kids. However, getting mad that you even paused is petty, coming from a woman who’s insanely petty. That’s her being dramatic because her feelings were hurt. Which is not the greatest way to handle that. Especially considering you did end up sharing your food.", "NTA. She's lazy, selfish, and doesn't care about you.", "Ehh, I’d have to go ESH \n\nJust poor communication all around. Unvoiced expectations end up with hurt feelings. She’s probably feeling a little put out that since you were making something for you and she was tired after a long day, it would have been nice to feel cared for. Your entire stance is valid as well, she had no way of knowing there was so little left, etc. Be more open to talking and rely less on assumptions!", "This is such a small issue, why does it matter? At most just communicate what you'd like to happen next time and move on.", "NTA", "Sheeeesh, lucky you don't keep guns in the house...", "ESH... but life is like that some times. You both may have had reason to be hangry. \n\"Hanging out with the kids all day\" may not be the real definition of the work she accomplished - any more then your 'fun class' after work day.", "NTA for not wanting to share because you did share anyway. But you are an ahole for some of the other things you said", "NTA, why would they wait so long to eat dinner? If you normally plan dinner when getting home late, she should be aware of that, especially if you log it. You don't have to share your meal, and it's not like that's the only thing available to eat.", "“Hanging out with the kids” lol you’re funny. I “hung out with my kids today” and wiped assess, made food, cleaned, did laundry, etc. I even managed to sneak in a snack for myself! \n\nI get you were excited about your meal and probably pretty hungry after your workout. The pause said it all though lol. You didn’t want to share and it was obvious. I’m gona say NTA even though I don’t really want to", "If there's one thing that has come handy in my marriage is to never make any assumptions when it comes to dinner. For future references \"I don't think there's enough for both of us honey, but let me see what else I can find\". \n\nNAH. I wouldn't be amused about sharing my dinner, but I also understand your wife being tired and not feeling like cooking after spending the day alone with the kids. It also sounds like you could use a bit more organization in terms of provisions in the house.", "NAH\n\nthis is the same issue as going to a restaurant and getting fries when she gets a salad and then getting mad when you wont give her some fries. \n\nsurprise her with a snack and say we both could be better about communication regarding dinner. call her on your way home and ask if shes eaten yet kinda thing", "So do you actually do anything at home or do you make her do it all???\n\n\nYTA, grow up. You're a father now. Act like it", "INFO: How old are your kids?", "NTA. Holy crap the amount of hate in the comments is astounding.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm sitting here half annoyed half confused how to feel. Here is my situation:\n\nMy wife did not work today. Has been hanging with the kids all day. I got home from work at 530 and did a turn and burn to jujitsu class. Dinner was not discussed but since I was getting home at 830 from I assumed I was on my own for dinner.\n\nI get back at 830 absolutely Starving and exhausted. I Had been planning my dinner all day: poor man's sushi (it's just canned tuna, rice wrapped in seaweed). I write down everything I eat in a food log and had planned this dinner in advance. I had the exact amount of rice and only two sheets of seaweed. I get home and my wife and kids are in the bathroom taking a bath so I get to work on my sushi. I have the entire thing written down and I'm ready to feast.\n\nI'm giddy with excitement sitting down at the table. All the sudden my wife comes out and into the kitchen and says \"can I have half of that? Me and the kids went out for a late lunch and I haven't eaten\"\n\nI pause. Obviously not happy with this news. I don't want to share but I also acknowledge that hogging down all the food would be selfish.\n\nSo she notices the pause and goes \"fine I guess I'll just figure something out\" in a pissy tone. I go \"no no no we can split it.\" And give her half. I go on to explain my situation but I don't think she cared. She was annoyed that I even paused.\n\nNow I only had half my dinner and am still hungry. I can't imagine asking for half of someone's food as they are just sitting down to eat. But I also can't imagine not sharing it. I can't decide how to feel.\n\nThat's the story.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She was \"hanging with the kids all day\"? Why, the audacity of that lazy thing. \n\nYTA.", "Info: Do y'all have literally no groceries or something that your wife couldn't eat anything else? Did she just starve the kids or something? Or did she feed them and just didn't feel like making herself something earlier? Because I'm not understanding why wife couldn't have just made herself a sandwich.", "YTA. You’ve already heard how you’ve minimized your wife’s childcare/mothering as “hanging around”. I call that keeping challenging maniacs alive while teaching them and nurturing them and feeding them and and and. You had time to go to your hobby while she did the hard work. Then you measured out your diet food. If you’re in a diet , just say so. Tell her, honey, I’m watching my calories, but I’ll make you something you’ll love so we can eat together. Try harder.", "YTA and I stopped reading at she just hung around the kids all day. Grow up and act like a partner to your poor wife.", "I don't understand family dynamics at all. Husband is planning his own dinner, logging things he eat and there is absolutely no coordination as to who has to prepare dinner and who all are hungry. Does a family work out like that. Then husband is unhappy about sharing his food with wife who has struggled with kids while day and wife wants to pounce on husband's meal when he is hungry. What you need is clear communication on who prepares and eats what.", "YTA for expecting your wife to wrangle your young kids for the entirety of her day off so you can go do your little workout for 3 hours. You should’ve given her a chance to rest, alone, for a few hours. She didn’t get a day off you weirdo. Yuck.", "*My wife did not work today. Has been hanging with the kids all day.*\n\nYTA. You can probably feel the steam rising from heads all around the world at that comment. Caring for children is work. If it were not, husbands would be begging to spend more time with their kids. Of course not all men shirk their duties, but I am referring to the ones who do to make a point. \n\nYour wife was probably too busy to sit down and eat until the kids were in bed. Yes, you should have shared. She was probably ready to drop and needed something to eat fast. You could make yourself a sandwich to supplement.", "I hope they fed the kids", "Oooh, I got home at 8:30...after playing on my own for 3 hours AFTER work....did I ask my wife if she'd eaten,  nope...did I ask if she needed support or help, nope. But gosh...I was so nice to make myself a snack. After my wife parented OUR children ON HER OWN ...ALL DAY...EVERY FUCKING DAY...while I go play, because, gosh, it's so tiring being me. Let me guess. You're white. Early 30's. Middle or youngest son. YTA x Infinity. Your wife will be much better off with her second husband. He will be a better man. Your kids will love him too.", "YTA\n\nYou had all that time to plan it and put it in your food journal, but not enough time to check your assumptions about your wife's dinner?", "You lost me at “hanging out with the kids.” You mean parenting??? While you got to go indulge in your hobby? YTA, dude. Maybe discuss dinner plans with your wife sometime. It’s not hard. You can do it over text.", "YTA for saying your wife ‘has been hanging with the kids’\n\nIf they’re young enough for bathtime then she was actively providing childcare all day. Three hour fucking jui jitsu class, Jesus Christ.", "Stopped caring at wife “just hung out with the kids all day” as if childcare isn’t a full time job that people get paid to do. \n\nGod forbid you share your tuna wraps after leaving your wife to wrangle kids all by herself for over 12hrs.", "[deleted]", "YTA! You got 3 hours to take care of your own mental and physical health while your wife was taking care of everyone else's. Then you came home to continue taking care of your own health instead of jumping in to take over bath time?!! Your wife should have divorced you before the pause!", "Olny way she getting half if there was nothing else in refrigerator and all to eat.", "Wow just wow. You are a piece of work OP and very selfish. Very much YTJ! You clearly don’t understand what us stay at home moms go through each day. It isn’t some stupid vacation dude. Man I am so grateful for my husband cause he is so thoughtful compared to how you are to your wife. My husband would already of thought to make me some before I could even ask for any. You think you were hungry? Try being a mom who doesn’t get any time to eat cause it is one thing after another with the kids especially if they are special needs or high maintenance. Imagine being lucky enough to grab a quick cookie or a chicken Dino nugget even to satisfy those horrible hunger pains and then trying to get the house in order before the husband gets home.  You’re a sorry excuse for a husband.", "NTA\n\nIt was incredibly callous of her to just swipe half your food, essentially. Especially when she's been home all day and could have eaten whenever.\n\nObviously, you should coordinate better on meals, and you should be able to get some more food from someplace or other. Order something in or go out and get fast food or something like that. Assuming you don't have any snacks or food in the house for whatever reason.\n\nBut yeah, it's incredibly, incredibly annoying to have your food taken and to get less of a meal than you expected. Especially right at the last moment like that. People should have their own damn plate of food.\n\nMaybe you should have made her something while you were making food?\n\nWith other people in the house, it can be dangerous to run on such a thin margin as to have only the exact amount of food that you expect to eat. One of the kids could have knocked into the counter and you'd have been entirely out of dinner.", "INFO\n\nHow old are your kids, anyway? This might make a big difference.", "Did the kids get dinner?", "YTA...you act like the kids are her friends and they were just drinking coffee and chatting all afternoon wtf. Have you actually even ever parented your kids?", "Sounds like everybody was hangry. Maybe on Sunday afternoon you two can prep some grilled chicken and veggies and make some brown rice so there's easy healthy stuff for you both to eat on busy days. \n\nI remember being home with the kids and being jealous that my husband got 20 minutes of alone time twice a day (driving to work). 😂", "Man, you are living the American dream with freedom and complaining about eating half of dinner? I know married men’s that are not even allowed to leave the house the moment they get home from work.", ">Also what the heck did the kids have for dinner...?!\n\nMom would have seen that the kids got to eat, but was so busy looking after them and tidying up after them that she didn't have time to eat herself. I have done that many a time.", "[deleted]", "Lol everyone is so triggered by that comment. I take care of the kids just as much as she does. Why are people pretending that being with your kids for the day is like a Vietnam deployment?", "That's the bit you get hung up on? This whole post his him being selfish, but you lose your mind over him not saying \"parenting\"?", "Not that arguing here makes any difference but I will anyway. they went out to eat at a restaurant for a late lunch/early dinner.", "I like the whole 'she just hung around with the kids all day' like they were her friends and not young children that need to be wrangled.  And if they still need mom to give them a bath they are young enough to exhaust you at the end of the day.", "He lost me with \"hanging out with the kids\".", "and I’m sure there were other things he could have eaten to supplement his “sushi”…seems a bit focused on his own needs and his dinner plan.", "Oh, and that exhausting and manly “turn and burn.”", "No she’s hanging out with them all day and chilling in a bath with them all night \n\nShe should be paying him really", "I'm laughing heartily as this post is from my closest friends. All the assumptions the internet makes are hilarious. He is tops family man, his kids are absolute angels, he stays home with them and takes care of them all the time, they both work so the whole stay at home mom thing ain't it. As for calling him selfish for taking care of his fitness after spending all day providing for his family...lol.\n\nThe internet is a wild place. The way you folks talk you'd think his wife spent the day rescuing his kids from a burning coal mine and he's never looked after them a minute of his life. \n\nHe shared his dinner, he was just slightly hesitant because as some people noted, the communication was poor. \n\nCarry on interwebz", "Oh my god she did not eat her lunch! Let’s blame the fucking guy who was working and taking care of his body because how can we blame her for not eating her late fucking lunch?", "Completely agree. And yes he's a weekly thing. It's somewhat assumed that I'm on my own when I come home from class. And yes she gets as much or more nights off to indulge her hobbies (which I have no issue with).", "She said \"we had a late lunch so haven't had dinner yet'. It's not like she went all day without eating.", "I don't know? I do it all the time.", "My last SO would always offer me half of what he was eating if I happened to come home, and he had just made something. I didn't even have to ask. But I did the same for him.", "How bad are your children? Honestly. Hanging out with my kids is the best part of the week.", "Fr if my partner found out I was hungry he would NOT let me stay that way.", "Yeah, still not parenting. Hanging out on his phone.", "If people didn't complain on the Internet about dumb things you would have nothing to entertain yourself with. Isn't that why you are on this sub?", "That’s what I think", "Is the wife? Apparently incapable of making herself food without getting pissy.", "Til", "Maybe she didn't want chicken nuggets? We don't know because he didn't ask.", "They ran out of bowls so she didn’t have anything to eat out of", "https://giphy.com/gifs/netflix-tim-robinson-itysl-timrobinson-w5C1cNv37LfAkFl12o", "Yeah I guess I should have mentioned that this is a weekly thing and it's assumed that I'm on my own for dinner on that day.", "Jfc the kids ate dinner. I guess My wife wasn't hungry when she made them dinner because they had a late lunch.", "You are a smart man and I imagine happily married", "You're clearly a very happily married man.", "Yeah that's true", "I did eat a granola bar", "I didn't tell her she couldn't have food...", "He said it took three minutes to prepare. I'm unimpressed with any reasons. In the time he took to complain about it he could have made lots more of his poor man sushi (which sounds intriguing).", "You knew what he meant geeze", "Sorry \"did not go into work today\"", "Can you read? He literally did what you recommended and just had a moments emotional hang up on it that he didn't act on lol", "It's actually pretty good", "This must be a bot response. Very cringe", "Unresolved feelings. Isn't that what this entire subreddit is about?", "Lol I'm getting labeled as Andrew Tate now?!", "I like how you somehow know how much I solo parent. Geez.", "I love how OP says their wife was “hanging out with the kids all day” like they just sit on the couch watching tv for 8 hours straight. Which I highly doubt.", "Lol. It went south hard and fast", "Yeah it's really strange. Couldn't imagine not enjoying being with my kids", "💯", "Lol", "It doesn't really matter. I thought it was a funny situation and decided to find out how people would react. Honestly my wife wouldn't even remember. Only reason I posted it was because me and the boys were laughing about it and someone told me to post it here so see what happened", "Yeah. It's pretty funny to me how everyone is over reacting to this post. It was one little thing that wasn't even a big deal. Reading the comments makes it seem like I was abusing my family and starving them. Obviously communication was the issue. Assumptions are bad. But generally when dinner time is missed because I do something at night I'm \"on my own\". Still amusing to see the comments roll in.", "Yeah the side of fries situation is a classic.", "8/6", "Oh we have plenty of food. And yes she made the kid dinner but didn't want to eat when she made it.", "I don't think they are a stay at home parent. I think they had a day off and then had to use that day off for full-time childcare. That's a very different dynamic.", "It can be difficult depending on how many kids, their ages, how many kids, and the kids temperament. These are obviously small kids since the wife was having to bathe them, at least two. Two toddlers can be an absolute handful sometimes.", "Because you're acting like it was a solo day off where she was free to do whatever she wanted.\n\nYou said it yourself. \"My wife did not work today. Has been hanging with the kids all day.\"\n\nYes, she did work. She took care of the kids. She met their needs. She did not have a day off.", "Quit doubling down in the comments and dismissing her feelings. YTA grow up", "Can you elaborate on that? Like what are both to your work hours? What is her version of your jujitsu time?", "Because depending on the kids and ages, it could make Vietnam look like a spa day? My fundie SIL had 6 kids in 7 years and when the oldest was 7 I would’ve preferred Vietnam over a day babysitting them.", "YTA. Why are you making such a big deal of sharing food with your partner? If you’re still hungry, go make something else.", "You had a night off from kids and you were looking forward to something.  Selfless giving will destroy anyone eventually.  Enjoy your small things brother", "yeah i have to say man, I used to parent my kids full time. Guess what? I fed them and ate pretty fucking well.", "Not that I know the hours either of you work, but that sounds mathematically impossible. Even if you typically work the same hours and take jiu jitsu once a week, that's still at least three more hours of mom taking care of kids. That \"poor man's sushi\" doesn't sound like it takes very long to eat. Couldn't you have eaten before your class or taken some food with you so you wouldn't be starving?", "So you think that simply just a single meal in the afternoon is enough food for a mother and her kids?", "Yes, you already mentioned that. And enough time had passed that she was hungry again but didn't have the time to make herself something to eat while you had your me time.", "I agree. Mom should have ordered something to go. Now dad can't have his full dinner. Mom could have made food after dad ate. Dad could go with the kids to give her some rest.", "Lol reminds me of when my husband thought I was \"relaxing\" all day on maternity leave with a 1 month old, 12 month old and 2 huskies. \n\nGave him 8 hours alone with them, got home asked how relaxed he was, tried to play it off but I could see in his eyes how strung out he was from thr screaming and crying and howling. Lol now I ask him all the time if he needs more \"relaxation\" with the babies", "Like it was phrased in a way not to give her credit for taking care of the tiny humans. All freaking day. Just hanging around the house. Not doing anything", "Right, how dare she have fun parenting while he has the hard task of jujitsu. YTA \n\nHow inconvenienced he is to change the entry in his journal.", "Like she was hanging at the club with her homies. Lolol", "Lol, you got on your alt to defend yourself?", "So when he stays home it’s “taking care of them” but when she stays home it’s “hanging out”", "We are making fun of you because you obviously either don't have children or you aren't grown.", "Who is the bottom in your relationship?", "Lol. Clearly a sock account. \n\nA “top family man” doesn’t work all day and then go to a class for 3 hours instead of going home and being with his family. \n\nAnd you, oh, I mean “OP” has shown what kind of person he is by the way he is arguing with everyone. Clearly being right is super important to you, I mean “him,” and “he’s” incapable of accepting feedback.", "[deleted]", "Yeah. He’s taking care of himself. Because he *gets* to take care of himself. She’s taking care of THEIR kids. ALONE.", "They were both working.", "3 fucking hours for jujitsu, my dude.", "So this is a predictable thing which she always plans around, she knows you do this for your health (which benefits the entire family in the longer term) and that you are very hungry after this.\n\nI believe your wife can be more appreciative and supportive of the fact that you have healthy hobbies and I think she should not have acted passive-agressively when you initially did not want to share the food which you had arranged for yourself. She dropped the ball in not feeding herself.\n\nDon’t listen to all these people who assume things about the distribution of work and who assume wife is overwhelmed while you are working and having hobbies on the side.\n\nNTA", "That's nice. What hobbies?", "So you got to spend 3 hours doing whatever you wanted while your wife was stuck with the kids, and you couldn't have even bothered to ask if she was hungry too? It would have taken no extra work to make some extra rice and open a second can of tuna. You should have cared enough to send a quick text to check and make sure that your wife and kids had eaten.", "How often does your wife get three hours away doing a hobby while you have the kids all to yourself. I assume you have it weekly if not bi weekly? Does she?", "Hell, my boyfriend Fed am entire party of people he didn't know just cause he was coming over to see me. Like, OP needs to step it up", "Regardless, you got to be an autonomous independent human being with only yourself to worry about all day (yes, I mean while you worked too). You never had to feed anyone a meal that except yourself. \n\nShe was \"on\" with the kids from sun up to sun down. She had limited autonomy and independence and had to prepare meals for them all day. \n\nDoesn't matter how \"well behaved\" your kids are that's exhausting.\n\nAlso I'd like to hear what your wife has to say about how easy \"hanging out\" with your kids are.  Sounds like maybe she's the one doing all of the mentally taxing  chores with them while you get to be the fun parent.", "That’s because you don’t do anything to take care of them. You clearly leave that to your wife.", "Then why did you not ask if they were hungry as well?", "it’s not “hanging out”, it’s called being a co-partner with your WIFE and letting her have a break aka PARENTING", "For the five minutes you see them between bath time and bed time?", "Not really, no... I'm just scrolling while I try to fall asleep", "NTA\n\nAhh you're just a glutton for punishment being on here. \n\nSeriously. You know, as a husband of many years, there's no such thing as \"your food.\"\n\nAccept your fate.", "although I believe you're in the wrong regarding the post, this is a fair assessment of like 70% of the sub lol", "So there was food in the house but she didn’t eat because there were no clean bowls? If you literally mean no bowls dirty or clean - why didn’t she wait until one of the kids got done eating - wash the bowl and then eat?", "Thank you for responding.  I’m glad the kids had dinner.  NTA", "Thought you said she didn’t eat because they ran out of bowls so she didn’t have anything to eat out of?…", "secret to happy wife: get her a snack everytime", "Brownie?", "That’s why I said “debate” meaning your point about pausing. I don’t know your jobs or household dynamic but for me and many of my friends I just can’t picture a scenario where I’d be right about not sharing food after her taking on the kids and me doing a round of golf or something.", "Yeah I know. 😂", "[deleted]", "Whatever", "No, this sub is for having strangers determine if you are an arsehole or not. Seems to me, you have your answer, but you are spending mental energy arguing your point with those strangers, rather than sitting down and having a civilised adult conversation with your wife. You both suck, but YTA.", "I mean it's pretty clear by the way you refer to solo parenting for at least 11 hours as \"hanging out with the kids\" and the fact that you A. Didn't mention interacting with them at all during the day and B. Didn't bother to check if your wife needed anything or was hungry after you've been gone all day and left her to do it all by yourself.", "I mean... They went to the pool, went to a restaurant, came home, watched a movie, got in the bath. For me that's \"hanging out with the kids\"", "Sort of set yourself up for that though. Lemme know when the bruises go away.", "It's cause you're a dude, posting about family life. Automatic rip to shreds", "I'm reading the same shit you are dude.", "There is defo a tendency about going nuclear and making a lot of assumptions over people's arrangements without even asking for info. There's also a plague of obviously fake posts from which I don't really get the amusement. \n\nDinner is a very serious topic at home so I get it. My husband often teases me because I wake up asking what we'll have for dinner. Cooking extra and freezing stuff is a good way of having prep meals that could be quickly heathen if you find yourself in this situation again. We also always make sure we have the type of basics that will help in these cases; like milk, eggs, butter, bread, cheese, ham, fruits, and etc that could turn into a quick snack.", "Oh, 100% NTA then. I’ve read your other comments and the hate you get is crazy. It looks to me that you contribute just as much as her to raising them. Crazy part is that nobody should even be talking about this, but because everyone is so fixated on “hanging out with the kids” I have to mention it.\n\nNow about the *actual* conflict here, you’re still not TA. You got off work at 5:30pm so you’ve been working since 9:00/30am? Then you have your jujitsu class and that has to be super tiring. And after all that you come home and your wife asks for a whopping HALF of your entire dinner, then has the audacity to be upset that you weren’t super enthusiastic to do so. And oh yeah, YOU STILL SHARED IT. I don’t know how anyone could call you TA here. Your wife could’ve easily made something for herself (since 8:30pm is a wild time to have dinner) or just eaten the dinner she made for the kids.", "Ok so then NTA. She could have literally made a sandwich to eat, it's not like she was going to starve. Your wife sounds like she's just stressed from a full day of watching the kids and was tired and snapped at you. Not great, but if it's not a habit I would honestly let it go.", "I didn't say she had the day off. I said she didn't go to work.", "No", "People really take this “motherhood is a job” thing waaaaaaay too far on this fucking sub.", "Oh.. Well I have two well behaved kids. So I guess it's a different situation.", "Lol", "Is that what happened? Or did she not prioritize making dinner?", "Yup. OP obviously does not spend a lot of time caring for his kids.", "He really went hard on the journal part 😂", "No. I honestly find the uproar hilarious. He was the one who told me to post it here because we were laughing about it the other day.", "🤣 if that's what you think you deserve an award for being unhinged. His kids call me uncle /u/familiar_gas_1487\n\nI was just trying to add some context as I laughed my ass off reading all these assumptions. I also refrained from voting. I've already heard this story in person and gave him an ESH for poor communication. It's just funny knowing these people and watching everyone tear into different aspects of someone's life they know nothing about, good reminder for me.\n\nBut hey you were right about 1 thing, this is my alt, as no one I know in real life gets to know my username, and he'll know who this is immediately", "Lololol", "We alternate, kinda like OP and his wife do with kid duties", "Lol. Good to know. At least it's entertaining", "On what fucking context? Damn it you women of reddit! He never implied that he doesn’t take care of his kids, neither did he imply enslaving his wife or stopping her from self care..", "So what’s the big deal with the +30 people trying to shut me up for saying that both of them did their responsibilities?", "That’s standard, and he probably does it 2 times a week.", "She wasn't just with them for 3 hours. She way with them for those 3 hours **AFTER BEING WITH THEM ALL DAY**.\n\nAnd even if being with kids isn't exhausting (it is), it's still not the same as being alone or being with adults. It's very isolating. \n\nOP is absolutely TA.", "He assumed they had already eaten as it was late. We don’t need make assumptions blur this guy being a dead beat", "She probably gets 2-3 days a week", "Lot of assumptions there", "Lol you're acting like he never takes care of his kids and gets to be the fun parent because he goes to work and then a class once a week?", "What she’s in really good shape though? Former D1 athlete or something?", "Man people here must have a horrible relationship with their kids", "Because they eat at 6:00 and they were about to get in bed", "That's a bad habit", "I know you", "A Kirkland signature protein bar to be exact", "How is the man supposed to interact with them during the day if he's at work?", "Could your wife could have let your children do these activities on their own? Can they bath independently. Can they go to restaurant alone ?\n\nShe was actively takening care of them and not hanging out with them.\n\nThere is a difference.  There is even a mental bandwidth of being responsible for their safety when you are the only adult with them.  \n\nOtherwise why didn't they go with you to jitsu and just hang with you while you did that?   Since it's all the same to you.  You love hanging out with them.", "It's like the related activity of 'herding cats'.   They always do exactly what you want - its really easy.", "People are really harping on you for that comment.", "Yeah I was just actually thinking to myself that there must be some bots in this thread. Having food around was not the issue. There was lost of food in the house. In fact the whole thing wasn't really an issue. I was mostly laughing at myself because I was being a hungry baby.", "Tomayto-tomahto", "Then don't come here to ask if you are TA! You obviously are, people have said so.\n\nYou need to learn to admit you are wrong. Here, your wife stayed with the kids all day, ALLOWING you to go to your class. How can you do jiujitsu if she wasn't there? You should've at least offered to make food, but didn't.", "And then you wonder if you're the TA? Seriously?", "Too late", "These people are unhinged lol I can't believe the comments I'm seeing", "How old are they?\n\nBecause anything under teenagers (and older ones at that) isn't a day off.", "The kids usually behave one way with the “fun” parent and another way with the “rules” one", "Your poor family", "Exactly, She prioritized taking care of the children over her own base needs.", "🤣", "yeah, it is of utmost importance he mentions TWICE that he wrote it down. lol.", "Sure, Jan.  Enjoy your \"hearty laughs.\"", "Lol your getting rekd dude", "Do you also get a turn with his wife?", "If a guy doesn’t get home until the kid is going to bed, no, he isn’t taking care of his kids.\n\n*maybe* he’s taking care of the finances.  But he isn’t caring for children.", "Lmao the dude got home at 830pm. He's not an asshole for not wanting to share his dinner but he's definitely an asshole for leaving 100% of the childcare to his wife.", "Im a gym rat too but I only do 1 hour daily sessions so I can get home at a halfway decent hour to feed myself and my hubby. Maybe broseph needs to look into meal prep so he’s not dreaming of fucking canned tuna all day long.", "No, no she just \"hangs\" with the kids all day 🙄", "OK, \"OP's Friend\".", "And you didn't deny any of them. Please keep proving you're the a-hole in the comments. It's entertaining", "I'm acting like I'd like to see if his wife agrees with just how easy it is", "Your comment(s) violate [rule 3](https://www.reddit.com/r/AmItheAsshole/wiki/index#wiki_3._accept_your_judgement). Please review this rule, and be aware that further violations will result in you no longer being able to participate in your thread.\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "What is your relationship with your kids? You get home after bath time. Seems like your wife, their mother who is actually there with them all day, will win their affections way before you do.", "Understandable. Why did you not ask your wife as well?", "All my habits are bad, so whats one more 🤷‍♂️", "Lmao I thought it was obvious that I meant after he got home from work? He comes home, doesn't mention interacting with them at all before fucking off for 3 hours and then comes home again, specifically mentions NOT interacting with them or his wife and makes his own food without checking in at all.", "They often come to class with me. And it's great.", "You can be both...", "Is feeding the children dinner not something kids need?", "'It's totally not me guys!!!' (proceeds to reply with moments of his 'friend,' type exactly the same way, and mention how much laughing he is doing, no, really, he is laughing SO, SO HAAAAAAAAARD.) \n\nDude is pathetic.", "I will\n\nHere's our [text](https://ibb.co/MhzZhBn) conversation of him directing me to this thread. Unless of course you think I have a burner phone to text things to myself to defend myself", "Bigly", "We're not that kinky, yet", "Unfortunately, that’s the average, we shouldn’t expect more than the average.", "Because she was in the bathroom with the kids and usually eats dinner with them. It took me 3 minutes to make the food. I'm always on my own for dinner after class so I did what I usually do and whipped something up.", "True", "Found the \"fun\" parent.", "I know when I hang out with my homies, our favorite thing is to laugh heartily at internet people who think we suck.  No seriously, guys!  We laugh So Hard.  Then when we're away, we text each other about it and laugh again.\n\nReally.", "He’d have more friends, except he never shares his food with them. 😂", "Please see above where I posted our text exchange. you guys are so absurd. You can weave any tale in your brain knowing absolutely no info.\n\nI posted about a dress that my mom wanted to wear to my sisters wedding a few weeks ago and many of the responses were \"how much does your mom hate your sister\" my mom loves my sister very much. This is just another example of internet extremism.", "🤣", "https://www.google.com/search?q=fake+text+message&oq=fak&gs_lcrp=EgZjaHJvbWUqBggAEEUYOzIGCAAQRRg7MgYIARBFGDkyCQgCEAAYQxiKBTIJCAMQABhDGIoFMhAIBBAuGMcBGLEDGNEDGIAEMg0IBRAuGIMBGLEDGIAEMgoIBhAuGLEDGIAEMgoIBxAAGLEDGIAEMg0ICBAAGIMBGLEDGIAEMgkICRAAGEMYigUyDAgKEAAYQxixAxiKBTIKCAsQABixAxiABDIHCAwQABiABDIJCA0QABhDGIoFMgcIDhAAGIAE0gEIMjIxOWowajeoAgCwAgA&client=ms-android-xiaomi-rvo3&sourceid=chrome-mobile&ie=UTF-8", "I think your wife may be resentful of your solo time having “hung out” with the kiddos all day and feeding/getting them ready for bed when you were coming home and getting your own supper ready. Perhaps this is her way of letting you know all is not okay with her. Sit down with her and talk to her about this when tensions are not as high. :)", "It took you 3 minutes to make and you were annoyed at sharing!?? Split it, then make more. YTA", "“Hey did you eat?” Not that fucking hard to talk to your wife", "Being a fun parent is bad?", "You mean you DON'T get on Reddit and defend each other's honour and then explain to The Internet that you are just laughing SO HARD? You don't log into Reddit to tell people about the various wheezes and grunts and totally non-sexual moans of mirth and delight you are making as you roll around gasping for air at every comment? Is everything these dudes taught me about how men do man things a lie???", "Ah yes. The lesser known definition of extremism, which is....expressing skepticism, I guess? LOL.  The fact he called you in to explain to everyone what a Great Family Man he is, is cringe af. At least we all get to have a nice chuckle, too. Everyone is happy!", "Lol k. Should we both provide our social security numbers and dob's? You wanna run a couple credit checks?", "She's getting the same 2-3 days a week. If that's the issue she's annoying.", "No, of course not. But the “fun” parent usually thinks they’re both when they really aren’t.", "Lol. I'm starting to like you.", "Did you stop enjoying yourself when you found out that we were also enjoying it?!", "He didn't call me into explain. I asked him to post it here and when he finally did he told me he was getting rekt. You'll notice no request on his behalf...jeez y'all are on one.\n\nMy words are mine, I thought people would find it useful to have context from someone who knows his wife and kids very well, but instead you either think I'm him or he directed me to say nice things about him. I only said the truth. Any internet stranger saying \"Grow up. You're a father. Act like one\" is flat out wrong. He can well be the asshole for other reasons noted, such as poor communication with his wife or not offering instantly to make her something, but not for being a bad father.", "I think splitting the two parents into one being \"fun\" and the other being \"serious\" is honestly sad.", "It's high key pretty weird that you think I am sitting around Reddit waiting breathlessly to interact with your boring self. If you want a woman to entertain you, I refer you to your wife.", "Every time you speak you make both of you look cringey AF, but it's entertaining so I hope you continue to fight for your damsel in distress ❤️", "NTA I’m home every day with the kids. Every day! My hunger my problem. But your wife is usually my kids wanting my food and it’s annoying AF. They’re kids tho who just ate dinner and all of a sudden moms food is gold.", "The only assholes here are the people making WILD assumptions and accusations in the replies with what very little information they have about this person's level of parental involvement.\n\nThis sub really shows it's ass sometimes.", "NTA. You even shared half, sounds pretty selfless to me! If anything, wife sounds like TA for waiting so late to eat and expecting to get part of the meal you made even though you’re just as exhausted if not more, than she is. They ate out for lunch, so she only made dinner for the kids, she should’ve set something aside for later or whipped something up for herself. Ppl always seem to want to side with the woman in these situations, but she sounds selfish imo. I’ve been a sahm and a working mom, so it’s not like I can’t empathize but she was in the wrong. I wouldn’t have shared, just said I’ve been looking forward to this meal and half is not going to be enough, sorry", "We all know that this comment sections reaction would be much different if the genders were flipped. Cmon now", "Nta. Promise you they wouldn’t call your wife the asshole if you switched the genders. This sub’s demographic is insane", "The way everyone is calling him the ah and his replies are just arguing and excuses is hilarious I wonder if he’s the same with his wife", "YTA. I can’t imagine a world where my husband would get home at 8:30 and just make himself dinner. He 100% would have popped in the bathroom (minimum) and asked if we were hungry.", "Have you never shared food with your wife before? Ever? This can’t be the first time.", "So during this “turn and burn” you couldn’t ask your wife about HER day? Could ask what she was thinking about for dinner? Maybe plan to pick something up you can both enjoy after you got 3hrs to spend by yourself at a jujitsu class? \n\nOh yeah, YTA.", "You seem to be extremely self-absorbed.", "YTA not for the pause. You are allowed to think for more than a second but for leaving your wife with the kids all day, logging your food and only making it for yourself and not spending any time with your family. If this is how you are every day you are lucky to be married at all. If not maybe it's just a bad day but I get the feeling you are very concerned with yourself and no one else.", "YTA.\nYou got home late. You got yourself 3 hours alone time with Jujitsu and are whining about having to share food?\nYour wife wasn't hanging around with the kids. She was parenting and keeping yp with kids and probably household chores.\nWhy not instead of whining, get in there and be a father? 3 hours of only you and what you want to do, come home late and get annoyed with the wife because she didn't have time to eat🙄\n\n👏🏻Husband and Father of the Year👏🏻", "So you got your unwind time and give your wife no help with the kids?  And then you try to \"explain your situation\" of how you dreamed of a nice, quiet meal all by yourself once you got home?  Seriously?  YTA.", "I don't know that I would call you an asshole, but inconsiderate seems to fit here. When it comes to your family, one of the core requirements is making sure they're fed. So, think of this as a lesson for the future: always ask if they've eaten. Always discuss dinner. In some cultures, \"have you eaten\" is basically the same as saying, \"I love you.\"\n\nHonestly, after a day of being the sole caretaker of your children while you got to work and do a hobby asking if she has had dinner, it should have been the first thing on your mind. You may want to sit with yourself and ponder on how much you actually appreciate her.", "YTA\n\nDad, it's time to grow up.\n\nThe least you can do to THANK her for taking the kids with no break while you got three full hours of time to yourself is ask if she got dinner, and OFFER to share.\n\nShe didn't eat because she was too busy.\nShe wasn't sitting around.\nShe likely hasn't had space to poop by herself, let alone three hours of time she could spend on just her own body and needs.\n\nShe definitely doesn't have time to plan what she's going to put in her mouth and JOURNAL ABOUT IT. (Even if she had been dreaming about something, I guarantee the kids would have waylaid that plan.)\n\nIf you had the time and forethought to plan all of this out, the very least you could do is make time to communicate that with your wife and see where her needs fit. It would have been just as easy for you to whip out two of those rolls.", "‘Giddy with excitement’ about eating canned tuna sushi… jheese dude take your wife out grab some food. Yta", "NTA. Based on the post and your additional comments, your class is a weekly occurrence. Heck, even without the additional comments, the assumption you're on your own for dinner can be established. You would think it's safe to assume that your wife has already eaten dinner, but alas, she had a late lunch with the kids which neither of you communicated about. She came into the kitchen, saw that you had already made your dinner, and asked for half. You were in a lose-lose situation no matter what. Say yes and lose half your dinner; say no and get an angry wife; and you somehow paused to think, got an angry wife, and lost half your dinner. She be hangry. \n\nIf anything, shoot a text to your wife in the future to confirm dinner plans or just make extra food. \n\nAs for the people jumping on you for the phrasing you used about your wife hanging out with your kids all day, ignore them. What would they prefer you say? My wife was parenting my kids? My wife was babysitting? My wife was watching the kids? Me wife be providing nourishment and entertainment for me offspring as they frolick about like lamb? Bollocks.\n\nYour class is an established weekly event and you've shared that your wife also has her own downtime/hobbies. People are just trying to get an, \"Aha! Caught you!\" moment because they think they are great detectives like Ace Ventura. Blasphemous.", "NTA if she's in a house with food all day it's not unreasonable that by nearly 9pm at night that she would have eaten.", "NTA/ESH- I think others aren’t wrapping their heads around families doing things differently and lapses of judgement. Your family has a different organization of meals than others might. You seem to have only been following your meal routine. And you were very hungry after work and your training. Others are subtly discounting your training, but honestly if it was framed as “this is a way I relieve stress after a long week of work/kids,” then I don’t think they would. \n\nAnyways, I think having a pause is understandable in this context. You were starving after a long day, and were initially reluctant to share your meal you were looking forward to. It was a momentary lapse of judgement. I do the same thing, where I struggle to change a plan I had in my head on the fly. Maybe it’s a neurodivergent thing of some kind.\n\nNow for the ESH. I think others aren’t wrong in that the kids are the issue. It seems like you should communicate with your wife about how she feels about taking care of the kids. You seems to see it as a grand time, but she may be struggling with the responsibility. That could have motivated her outburst. I think you should have a long discussion about your schedules and relationship as a whole. Based on my experience with my mom and dad, she could be feeling you’re inconsiderate of her. \n\nMy mom honestly will do the same thing with my dad. Hear him head towards something that triggers her, then immediately react angrily. Sometimes it understandable. Other times you’re scratching your head about it being that deep. Your wife may be mad about a deeper trend you’re not seeing, but not doing the best job of communicating it. She may see this as part of a larger pattern. I would say approach cautiously and with an open mind. She may have a serious concern you’re not seeing and this was just the straw that broke the camel’s back. Or she could be having her own anger issues.\n\nLong story short, talk about it with her and revise your planning and relationship as needed.", "damn dawg yta x2, but also for having a ridiculously shitty meal you wouldn't even split", "Okay. I didn't need to get further than this:\n\n>My wife did not work today. Has been hanging with the kids all day.\n\nIf this isn't rage farming you're 1000000000000000000000000% TA.", "BuT I hAd To WrItE iT aLl DoWn AgAiN", "You don’t HAVE to share your food just because she asked. I would have said no", "From the way she got you in a double bind, I'll say NTA. Screams red flags.", "This is just too fucking typical", "Her getting annoyed at the pause and then you sharing half and her presumably still being annoyed about it really sucks. It's the opposite of having your cake and eating it.\n\nHowever, considering that she's been home with the kids all day, and has done evening and bath duties solo while you're at an extracurricular activity... when she asks for half of your food you offer her the whole damn thing and you offer to figure something out, and then be grateful when she insists you share.\n\nAlso have to point out... \"My wife did not work today. Has been hanging with the kids all day.\" This is a false statement. Your wife worked today. If the kids are young enough for baths then she wasn't just \"hanging out\" with them.\n\nYTA with a minor ESH component.", "Huh? I hate what so much?", "YNTA but after reading so many comments saying you are I won't bother elaborate but NTA :P  \nThough in some response to all them comments.. yeah! Hanging out with the kids! \"Went out for a late lunch\" and she obviously wasn't tired from cooking dinner, but yeah.. Stop making it out like the poor woman was drained, also making a bunch of assumptions about the kids behaviours.. \"taking a bath with the kids\" on her ass, probably semi on the phone.. oh schnucks.. probably had an afternoon nap too then... oh man, I said I wouldn't elaborate", "8 and 6. Summer vacation. She has the week off.", "YTA. Also, why not just speak to your wife ash’s see if she was hungry. Who doesn’t think of their partner, easy enough to double the recipe.", "Did a \"turn and burn\" to jujitsu class\"? You mean you skipped out on parenting your kids for three hours after being away from home all day?", "Why didn't/don't you stop being so selfish and plan on doubling what you make so your wife can enjoy it with you? That would be a loving gesture.", "Wow. YTA for a buttload of things. Not wanting to share your dinner, not helping with the kids baths, assuming your wife was chilling \"hanging out with the kids\". Why is she with you again?", "YTA. You know how you use your mouth to eat, the same way you can use it to ask \"Hey what's the plan for dinner?\" instead of going rogue and being upset for no reason", "YTA. Figure out more food already.", "OP, I can relate to this a bit because I track everything I eat and I am really uptight about sharing my food, even with my SO. But that’s because I have a disordered relationship with food, and I need to be in control. Do you struggle with using food as a mechanism for exploring control? Are there deeper issues? When you find that food is getting in the way of your empathy, it might be time to take a look at where that’s coming from.", "NTA. \n\nYeah she had the kids all day, but in the time she was eyeballing OP's food, she could've gotten herself something too, or, idk, asked OP to pick something up? \nBeing tired doesn't entitle you to someone else's food.", "NTA\n\nYou chose a site with a bunch of losers who equate hanging out with kids to a real job so you won’t get a real judgement", "She's home all day. She has opportunity to make a meal and to take away from you is not right it's just her way of being lazy not to make herself something to eat.", "YTA obviously, she probably cooks for you all the time and you have the audacity to not share your stupid little tuna rolls. And when you said \"hanging out with the kids all day\" that gave me the ick, it's not just hanging out, it takes a lot of work, shes the one who stays home with kids all day and she probably didn't have time to cook for herself, you fucking prick. Don't expect her to cook for you anymore if you cant even share your food you selfish fuck.", "I passionately hate sharing my food, it’s a thing. So, what you as a partner should have done is to ask your family what they are having for dinner. If you could plan yours down to two slices of seewead, you did have time to ask if they are set.", "YTA. She asked. You didn’t have to say yes. You did and then got pissy about it. Also, you got home late because you spend three hours at a class while she’s raising your children alone. Get a fucking clue and act like a parent, maybe.", "Ffs just make more food. Better yet, have a nice time making a new meal with SO that you and wife can enjoy preparing and eating together", "[deleted]", "You should have asked her if she wanted anything on the way home. Communication, you set your self up. Murphys Law", "Your wife sounds like a single mother.   She was parenting while you go play for 3hrs.", "YTA.\n\nWhat kind of husband arrives late because of a hobby, doesn’t text to ask his wife if she needs something to eat before coming back, and expects to not share food.\n\nIt’s also very silly to be upset about sharing food. With your wife. \n\nNext you’re gonna be upset about sharing food with your kids.", "YTA\n\nOP your wife also had a busy day, and honestly I think she was trying to spend time alone with you here. She probably wanted some adult interaction after a day with the kids, and also, she probably married you because she really digs you. But you're not making any time or space for her in your life.\n\nWhy did you even bother going home from the office if you were just going to 'turn & burn' why not keep your jiu-jitsu gear at the office? Why do you have a family if you don't want to spend any time with them and see them as an annoyance?", "YTA she’s not “hanging out with the kids” ???? How nice to have the time to be able to go do your hobbies & not even have to give a second thought that your kids are home with your wife. The least you could have done is share your dinner or make something for her too", "Eh, hoping that your husband would make food for you too after you spent all day taking care of your children so he could have hours of alone time having fun and working out doesn't make the wife an AH at all imo.", ">  Also what the heck did the kids have for dinner...?!\n\nFood? Maybe she didn't feel like eating chicken nuggets at 4pm.", "Exactly.  “My wife did not work, she was hanging with the kids all day”????\n\nWtf man?  Maybe you need to “hang with the kids all day” and see if you feel like you’ve put in some work by 8:30 pm?\n\nAnd it’s a can of effing tuna!  You’re getting pissy over a can of tuna?\n\nYTA.  Get over yourself.", "If you have three hours for the gym, you have 3 minutes to call your wife and ask what she's thinking about for dinner.", "And he didn't even make anything that complicated. He could've made more easily. I do bodybuilding as a hobby so I do food tracking, and I'd just go into my app and update the log to reflect what I actually ate. I mean, it's not written in stone lol or just make more rice & crack open more tuna.", "Also, why would he just assume he’s on his own for dinner? Why wouldn’t he ask? Doesn’t he like talking to his wife?", "For real. Also, did he *have* to go to bed hungry? If there was literally no other food in the house, maybe he should have left jiu jitsu early and picked up some groceries on the way home, especially because that would mean his wife and kids went hungry while he was out having fun. More likely, there was plenty of other food to eat and he was just pissy about being asked to share.", "Wait. He needs to log his meals. Lol.🙄", "And why can’t he use his words.? He doesn’t even have to share to not be an Asshole. I hate how uninvolved he is. Doesn’t even say hallo to the kids and help with nighttime routine.\n\n5:30: hey honey, do we have plans for dinner? \n\n8:30:  No, I don’t want to share but while you take the kids to bed  I’ll make you a sandwich / cook some soup / eggs/ spaghetti/ warm up leftovers and we can eat together. What do you wanna drink?", "She's \"hanging with the kids all day\" aka parenting. Like *someone* should.", "It sounded more like she took a day off, not that she is a SAHM.", "Treating it like the wife can't say no to after work activities is pretty patronising to the wife.", "On many occasions I have been taking care of kids and had my spouse come home late at night. When that's going to happen, and clearly she knew this was going to happen, the idea that my spouse would come back at 8:30/9:00 at night and then somehow magically make a meal for me and the kids seems crazy.  That literally never happened. Sitting around waiting for that to happen,  expecting that to happen,  without having bothered to confirm that that's what's going to happen is bad planning on her part. Particularly if you have children that you're taking care of.\n\nHe did not go out to a restaurant and buy an expensive take out meal and then bring it home without talking to her first. He's essentially just throwing together some food that's sitting around the house.", "Relax... A parent is allowed to have a hobby.", "You made it much further than I did 🤣", "Loving how /u/Historical-Goal-3786 has no empathy for the father. Just shows how deeply ingrained misandry is in every society.  \n\n\nTL;DR NTA", "But he needs to find time to journal - he got no time to check in on his wife! Must journal!! Must eat poor man’s sushi! Fuck everyone else! \n\nOP, YTA. \n\nMy husband is a partner who would come check on me after being away from home all day, ask me if I need help or he could take over the kids, ask if I need anything, then feed himself when he knows what going on and if everyone is ok. I do the same for him. It’s called team work when you’re married. \n\nIt’s lovely living the single life WHEN YOU’RE SINGLE. You’re not.", "This, exactly.  I've been with my husband for nearly 20 years.  At the end of a long day, if I'm about to have a meal or even just a snack, no matter what he's up to I will ask if I can grab him food, too, while I'm at it.  He does exactly the same.  & yes, we're parents.   \n We both do the same for any adults in the house, in fact (ie if we have guests or family staying with us).  It's not only common courtesy, but sheesh.. extend a little empathy towards your wife.  \n\n\nOP shouldn't have hesitated, but sometimes you can't stop your immediate reaction.  He's 100% the AH for not apologizing immediately for a) not checking in to see if she needed food while he was making his own, and b) making her feel bad for asking him to share because she was exhausted.  \n\n\nYou're married, dude.  You have a priority greater than your food planner and tracking: your wife.  It's normal to feel disappointed that the satisfying period at the end of your sentence didn't go as planned, but you're missing the bigger picture and created an issue over nothing (nothing actually important, at least).  If you were really being honest here in asking whether you were the AH, then listen to some of the advice people are giving you and do better.", "I mean what If he's working down a coal mine all day and they live in a mansion from it where all the kids and wife have a world of entertainment.\n\n'wrangling' only wrangling if they're very young or raised badly.", "But what about his journal???? He already wrote it down????? OP is an absolute whiny baby. \n\nMy vote: YTA", "But….if the kids were in bed by that point, why couldn’t she get herself something quick to eat? Maybe asking for a bite is reasonable to take rye edge off but half his meal?", "I had the same thoughts but would go with NAH\n\nIt seems it was a miscommunication thing in which neither actually anticipated. \n\nI mean she has to know about his food log, he is used to being on his own for dinner at times. It's not like they are oblivious. \n\nShe usually would grab a bite herself when she got the chance, hence he is unprepared. \n\nI get just as pissy when I've planned a meal for me and someone asks after I'm ready to sit down. Like seriously you couldn't have said something before I am ready to eat? \n\nLittle stuff like this happens and being hangry is a real thing. Lol From here on out it can just simply be - hey have you eaten yet? From either one. The problem is solved.", "Exactly what was stopping her from sitting down with the kids and eating while they was eating", "It’s totally a smart partner thing imho and you seem very smart! my husband gets annoyed at me sometimes like ‘why’d you get/ make so much food, I told u I wasn’t hungry’ and I’m like ‘cuz I AM hungry and don’t feel like being a martyr or making a fuss when u start siphoning away bits of my food…’ Def easier to use the freezer than argue about dumb shit \n\nOP YTA. Bring home dinner for your wife next time she spends all day letting YOU relax while she takes care of the kids", "No that's stupid. People are capable of using ways to communicate.", "That’s what I was thinking, it doesn’t matter what else happened during the day……. I’m gonna want some", "Lol. No I'm just bored. They went on vacation and I stayed to work. Quiet house and not much to do. I find this thread... Interesting", "About HIS feelings? Are you high?", "Texting would take away from his precious food Journaling time.", "He literally prepared his own meal without complaint…", "Nah. Poor Man sushi is litty", "People can call parenting different things you know. Idk if OP calls it the same when he is with the kids and if it's just the term he and his wife use or if he says it suggests it is easy. OP made a comment somewhat implying the former, but it wasn't clear. \n\nAnyway, how about you read the rest of the post, learn that everyone doesn't think the same way as you, consider a term that seems demeaning isn't necessarily used with malicious intent, and make a judgement not solely based on one sentence.", "I had to erase it and write it down again *", "Do you not understand how different people may have different living arrangements?\n\nI used to take care of a 5 year old that wasn't even mine 2 days a week because her mom was in a band and practiced after she got out of work. \n\nWas she a shitty inattentive parent too like you are implying here?\n\nYou people are so weirdly judgemental it's insane.", "No, she doesn’t. She’s dealing with your kids.", "Yes!", "🤷", "Why did you come here and ask for judgment if you were just going to argue with everyone correctly telling you that YTA?\n\nGrow up", "The way you said it was dismissive and implying that “hanging around the kids all day” isn’t work.", "I think the commenter called mom an AH because they thought the kids didn’t eat, but from the phrasing it sounds like it was only mom who didn’t get to eat since she says “I haven’t eaten yet,” rather than “we haven’t eaten yet,” especially since the meal seemed pretty small (wouldn’t be able to share it with two adults plus kids)", "That doesn’t make any sense. She says she went out with the kids for a late lunch, but she didn’t get anything to eat? What sense does that make?", "Lmao leave it to this sub to downvote the truth that doesn’t fit their narrative lmao a lot of ppl in this sub have issues.", "This. This is where I stopped.", "Someone watches Top Gun a lot. And he definitely thinks he’s Maverick, not Goose.", "He had it all written down for god sake 😂", "Damn, you sound like a lazy ass, you never even wrote it down, you just typed it in.\n\n/S", "Not that u are wrong it’s just clear you did not read with comprehension. OP states there is none left to make more, which begs the question… why was OP working out for 3 hours when they knew there was not enough protein left at home to maximize the gains?? Cause they were not training MMA they was cheating on their spouse. A real MMA junkie would have had plenty of protein on hands at all times duh", "So? Staying home with the kids all day is a ton of work whether you do it every day or just once in a while.", "I'm glad I found this comment. Now I can move on with my life.. I don't even know the guy but this is exactly how I figured it could be, all the response are setups for a Bill Burr rant, I even wrote a lengthy response that I haven't posted yet but your comment confirms so no need for it now... Also I find it more annoying than hilarious, I wouldve prefereed being able to laugh heartilyabout it too but atleast now some of the irritation is lifted so thanks.. :P  \nThe only valid critism is that yeah, THEY (if not both then SHE) could have communicated better up to that point..  If it was me in this situation the thing that wouldve bothered me the most was the fact that SHE got annoyed because he hesitated for a pause. I'll share the burden of some of the downvotes with you.", ">Hanging out with my kids is the best part of the week.\n\nYou don't \"hang out\" with your own children, you parent them.  They are not your \"little buddies\" they are impressionable, tiny humans whom you are responsible for molding into decent people; this can include lessons about sharing with people you love and care about. \n\nAlso note how you said \"week\", not \"day\". Sounds like you work all day, take 2-3hrs afterwards for your own hobbies & get home in time for bed (maybe) - your kids see you on the weekends. You're a weekend dad. \n\nYou need to take a personal inventory.", "[deleted]", "Clearly, you assumed wrong..", "Because she was tired ? Like does he not like her or something. This could of been fixed by showing two seconds of concern communicating and asking her if he was on his own for dinner", "I'm sorry, -question- when she cooks at night, does she assume you already ate or does she cook for you too? Why did you not assume she would also want some of your food?", "She could’ve been feeding the kids. Especially young children are very messy and can’t eat on their own so their parents have to feed them. I’ve had to do this many times when I was caring for my little siblings. I would make food and sit us all down with a plate to eat, but i could never get to mine cause i was feeding them. Then I was cleaning up after them. Then I was washing their dishes. One thing leads to another and she probably never got the time to eat her meal.", "[removed]", "No he couldn’t…there wasn’t enough ingredients for more", "He said the kids ate dinner so what was stopping her from sitting down with the kids and eating too ?", "You seem to be taking this post pretty personally.", "Wrapped some tuna in seaweed. Absolute minimum effort.", "You know what's even more \"cringe\"? A grown man using the term cringe, a grown man who obsessively writes every little bite of food in his journal and make sure to put it in the post twice just to let everyone know how very important his food journal is 😂", "That’s quite onerous compared to hanging with the kids all day. (That’s sarcasm, in case you can’t tell.). YTA.", "She's dealing with our kids* (as do I)", "My kids are 8 and 6. I work full-time. My days at work are easier.", "Hopefully she leaves his ass and takes half!", "I make my own schedule. She works 20 hours a week. I often have the kids all day long when it's summer break.", "Probably not, some people get sick eating too close to an intense workout", "Even when i ask my GF and she says no I still make extra because i know she’s still going to want some.", "She's an adult, but he has to check on her for whether she has eaten?", ">1 month old, 12 month old and 2 huskies \n\nYour poor poor eardrums", "Omg, we have a 14 month old, plus a husky and beagle/husky mix and I just totally feel you 😅", "Umm, you are a hero. Not sure if you know that or not, but you are. Thank you.", "His job is jujitsu. \n\n_Just in case this is /s._", "And it made him “giddy with excitement”.   Sounded like a real gourmet meal to me.", "And planned it ALL day.", "I know this. I’m a mom of 3. It seems to me the mother should have eaten and fed the kids by the time he got home from what looks like a regularly scheduled activity. Let’s not assume that he doesn’t also care for the kids. Like he said, he figured he was on his own for dinner since he was getting home late. He didn’t expect her to cook for him. Why is he the AH? It’s okay to have moments of hesitation. He was looking forward to enjoying his food. \n\nWhat’s the saying? “Your poor planning is not my emergency.”", "🥹\n\nI'm happy to take them for telling the truth. The meta of trying to help people understand the situation from someone who knows everyone involved and being downvoted and told I'm OP was too good. Then the splitting of hairs between saying \"hung out with the kids\" and me saying \"takes care of the kids\" then the person who stated sometimes taking care of kids makes VIETNAM look like a spa day.\n\nMy favorite was one proctologist who was sarcastically quipping about how we laugh together about the situation and then we were apart we text and laugh at dumb people on the internet. We were sending various responses of this whole thread to each other just 🤣😂🤣😂 away. It was really fun", "3 hours between work finishing and getting home.\n\nThat could've only been an hour with an hour each way, people are just reaching for the narrative they want of this evil man waltzing home from his easy job to a wife in havoc lol.", "Crazy, woman hating club of men.", "She coaches a sports team (often will be home after bedtime 5/7 nights during the season) she teaches yoga and goes to other classes. Plays sports and hangs out with friends. Honestly I take care of the kids solo much more than she does (not that it's a competition) but these comments make me seem like a monster.", "I come here for the drama for sure 😂", "Bruh what even are you going on about?", "No. I assumed I wasn't coming home to dinner. That's why I had a plan.", "Yep", "You never have a moment where you're tired and something, reasonable or not, frustrates you? And you think having a moment of frustration and choosing not to act on it makes someone an asshole?", "I mean, you don't seem to, Jujitsu man.", "Yes your kids. As in both of yours. & you weren’t though, you were at karate while she “hung out”", "Must be an easy job.", "Motherhood is a job. And it’s a harder job than any of other jobs I have ever had, and I work in a notoriously grueling, stressful industry.", "Do you consider your time more valuable than hers?", "Yes. People in relationships or who cohabitate often share meals and communicate about them, especially when kids are involved.", "How old are the kids? If they aren’t going to daycare or school she doesn’t really have “me” time", "I can just imagine these guys setting each other off _and_ keeping each other going.  😭", "They're about to pack up and leave. They'll never be treated right again.", "IT WAS WRITTEN DOWN", "‘No, I…’. Is the best admission ever, lol.", "Pretty sure I never said anything about anyone being evil. This is all just silly. If he was that hangry then maybe he should’ve stopped somewhere in that 3 hours instead of waiting until 8:30 for rice and tuna. If she was that hangry she should’ve texted him to stop and grab her something on the way home. Problemo solved. ESH.", "What?", "Calm down lol", "Haha well to be honest your post made you seem like a monster.", "Hang out with your kids*", "NTA, reddit isnt the place for advice especially without full context. Lots of basement dwellers here with no hobbies. Good on you for keeping a hobby and allowing her time for her own. Nutrition is important but you asked people that eat fast food daily.", "So what do you say now, OP? Have you been taught?", "It’s not like he has a lunch break or phone-/s", "Depends on what you call easy. I’m a lawyer.", "I don't think the teenagers will need help with the bath...", "No... What a strange question", "If I was in that house I'd be the next thing to fall down into fits of screaming 🤣", "Hey hang on, let's be fair. Maybe he also considers this subreddit his journal! 🤣🤣🤣🤣🤣", "OP is exactly why men shouldn’t eat sushi", "You’re great. Time should be counted though, maybe his drive is longer and maybe the kids go on outside activities in those specific days so he invests in grappling to have more time in his other weekdays. We don’t know anything about anyone’s life, we’re just bitter monkeys who like throwing shit on each other while most of the times taking it easy was the better option.", "Yeah I can see that. I hammed it up a bit for extra spice", " 🤣  oh that's right", "Thought you guys didn't like that term. I don't care if you call it \"parenting\" or \"hanging out\" it's the same thing.", "Definitely not. I'm pretty slow", "So do that from now on and then you won't have this problem anymore and your wife can hang out by herself and relax. YTA", "They are downvoting anything you say now just because it flies in the face of their argument. Lol", "Yeah that sounds easy", "Yep. That's why she did that.", "OP has been quick to respond to me several times, but is ignoring this question.", "Not a strange question at all if you read your op.", "yeah, like that was the saddest meal I've heard of since I stopped being friends with people who have problems with disordered eating.", "Well in Reddit’s defense, providing that additional context is important when you’re actively asking internet randos to judge you. Like I just told some other guy, this is two people just being hangry. OP could’ve just stopped somewhere on the way to jujitsu or home, and she could’ve also texted him to stop somewhere on the way home. ESH.", "So you want to be seen as the asshole. Suuure. You just are, you can’t edit yourself worse than you already are, nice try tho.", "Definitely not the same thing.", "Do you also ‘babysit’ your kids?", "And it wasn't a usual day, it was an exception whereby your wife was hungry and asked for half of the food you prepared, so you say \"of course!\" (you're entitled to a pause and it does suck that she got annoyed by that)\n\nThen if you're still hungry you say \"I'm going to have a piece of toast, do you want some too?\"", "Wait, if it took 3 minutes to make, what’s the problem? You’re in the comments telling other people they’re overreacting, but that’s exactly what you’re doing if it took 3 minutes to make the food lmao.", "At least at the office I could go to the bathroom without a toddler banging on the door for me and putting her hands under the gap.", "Are you on a butt hurt ego comment spree", "It's pretty strange.", "No we hang", "there wasnt more to make since he used all that was left (which, to be fair, does sound like just one portion)\n\nETA: this isnt me commenting on whether or not OP is TA overall, just pointing out that there physically wasnt more ingredients so i cant judge him for pausing if he was really looking forward to eating that specific meal", "Yah", "They usually level up to \"divorced husband\" by the time the kids in high school", "Who parents when the kids are hanging?", "Yet you hate so much, why?", "I do a bit of both", "You show up at 8:30, while she is still \"hanging\" with your children..and this is what you've got to complain about? YTA.", "YTA for going to a jujitsu class instead of coming home and making dinner for your family.", "Did you even talk to your wife during the day? Or you went straight to jujitsu and then the fridge? \n\nYta", "YTA, imagining 2023 with the Advent of cell phones not calling your wife on the way home to see if she ate and if she would like something to eat because you're going to make your poor man's sushi. And would like to know how much you should buy if she wants some. Or not even just assume she's going to want some and buy extra. I mean it's tuna fish rice and seaweed what's the whole meal cost five bucks? Learn how to be a husband dude or you will lose your wife by making poor decisions. Yes I'm speaking from experience.", "YTA- what a poor lady for having a shit husband like this. I can’t even fathom people who call taking care of their kids, hanging with kids. I mean in that case your work is chilling in the office lol. This guy chills and kicks around in an office all day, go and does some hobby, and then comes home with 0 care for his kids/wife and gobbles down food by himself. How can someone be so selfish?", "NTA. If you’re not home until 8:30 it’s a fair assumption that she’s already eaten unless you guys regularly eat dinner that late.", "NTA, imo.  You've had a different kind of \"hard day\" to your wife, but it was still a hard day for you.  You deserved that sushi that you looked forward to all day.\n\nI find this habit some people have got of asking for someone else's food fucking disgusting, by the way.  Want food? get your own!", "NTA. You’ve said in comments that this is a weekly class and that typically when you get home you are on your own for dinner. Your wife didn’t communicate to you earlier that she and the kids are a late lunch therefore she would also be eating late for dinner. \n\nEveryone saying your an AH for describing your wife’s day as hanging with the kids are extremely rude and also not looking at this whole situation. I did not read that as you belittling what she did all day instead I took it as you feeling like she got to spend time with your kids while you couldn’t because you were at work. While I understand that parenting is work and not always sunshine and rainbows, that doesn’t mean that the parents don’t enjoy it and wish they could be the one spending the day with the kids. OP seems like the type of dad who would say he was “hanging with the kids” or “spending time with the kids” or something along those lines and not “babysitting” which is a positive", "I had no less than 12 kids at my house all day long, granted 6 of them would go home at the end of the day, but that still left me with 6, I still cleaned the house, did the shopping, cooked dinner, bathed and put kids to bed…I don’t understand how having kids around means you are unable to do the other half of your job, and no I’m not some kind of super mom, I just raised my kids to be well behaved.", "NTA - fine if she’s a stay at home wife, but making food is part of that package. You can’t just pick the parts you like", "The people voting Y T A because of the \"hanging with the kids\" comment shouldn't assume that OP's wife was exhausted from taking care of tantruming toddlers. OP didn't say how old his kids were - depending on how old they are, they may be independent enough that wife really could relax for the day.", "Yta because you don’t seem to realize you’re married", "NTA \n\nI'm funny about sharing food, let alone something I've been looking forward to!  I wouldn't have shared tbh so know you'd still be hungry and still shared, hats off to you.", "NTA\n\nBased on the fact that your martial arts class is one night a week, and she gets lots of time to spend on her hobbies, as you’ve mentioned in other comments.\n\nSince you say you quite often only fend for yourself on that night each week, then you’re sticking to the routine that has been set up for however long it’s been going on, and it’s only fair to think it would be the same this night.\n\nYou might want to edit your post. People are telling you off for no reason I can see. \n\nAlso “hanging with the kids” is better than saying “babysitting” to all those complaining. Reddit is great for jumping on people claiming to babysit their own kids.", "NTA. Your wife behaved with selfishness and entitlement. \n\n>I don't think she cared. She was annoyed that I even paused.\r  \n\r\n\nSo it's not enough for her to take half your food, she also wants it immediately? I'm mad at her on your behalf. \n\nNext time just tell her 'no' and, if you're feeling generous, suggest something else they can make.", "I love how you said your wife didn’t work and was hanging with the kids and dismiss that she had a significantly longer workday than you since you did 3 hours jujitsu class after work. YTA", "YTA..hanging out with the kids all day? You make it sound like they had a slumber party and been relaxing all day as opposed to the reality of what's probably happened, then you saunter in at 8.30 and assumed she'd eaten? One question, that's all it needed from you, just one question.honey have you eaten? Nope fine I'll sort you too. See how easy it would have been?", "YTA. You know your wife is busy taking care of the kids and didn’t even consider asking her if he’s eaten or not? Are you serious? She wasn’t hanging out with your kids, she was TAKING CARE OF THEM. She probably fed them dinner, gave them a bath and forgotten to eat.", "You poor babes, how do you do it? No free time during your extracurricular activities. \n\nYta", "Dude, she’s was asking you to share fking canned tuna and rice. You weren’t eating steak and lobsters. You literally can’t find something else more to eat? You’re an adult. YTA", "NTA. Some people have strange food issues and its obvious that OP tracks all his food intake. His wife probably knows this. It is odd the way he explained that his wife was just ‘hanging out with the kids all day’ and a bit stupid for him to say this but these are 2 separate issues. It would have been easier for OP’s wife to grab something quick knowing how her husband is about his food. Again, not saying that OP isn’t strange about his food but I have no doubt his wife knows this about him. OP, be better at communicating.", "Awww your comments are so sad lol I feel bad laughing because your poor wife has to deal with you. YTA. This is the easiest one of the day.", "YTA. Dude, just based on what YOU wrote, you sound like a complete asshole, a shitty husband, and an even worse dad. Congrats, but hey I'm glad you have your shitty sushi to look forward to", "YTA no doubt about that. For all the reasons the people are saying on here.", "You were gone 3 freaking hours after getting home from work leaving your wife to \" hang out\" with the kids on her day off and you couldn't even bring dinner home? Go live under a bridge with the rest of the trolls.  YTA and my ass you did jujitsu for 3 hours. More like played poker. Who tf does jujitsu for 3 hours? It's literally the dumbest thing I've read on Reddit in awhile.", "YTA. This sounds like a bachelor hard pressed to text back someone they went out on a date with 2 nights ago. My god, you have a wife and kids (multiple!), when does she get to do her thing for *three hours* and then completely ignore you after? Is this your expected roommate behavior to have quiet days where you don’t communicate? Nobody cares if you’ve written it down in your journal. You sound like a teenager.\n\n>My wife did not work today.\n\nYou get home and take over with household tasks until you both have them finished so you can both get equal rest, otherwise the next night you let her leave at 5:30 and ignore you for the rest of the night. Equal rest.", "YTA *hanging with the kids all day* \nSure. Because mums don’t work 24/7 and are on call when the kids sleep. \n\n8:30? You’re extremely selfish.", "YTA. \n\nYou don’t have *any* other food in the house that you could eat? Not even snacks??", "YTA. She’s raising your fucking children while you’re out playing Karate Kid, just give her the food.", "Lol YTA - next time go to subway and buy two footlong subs.  Give her 1 and a half and put the 6 inch sub you eat in your journal.", "YTA\n\nI suggest you let your wife have a day off so you can \"hang out with the kids all day\" and see what it's actually like. \nI will give you credit for actually planning your own meal though rather than expecting your wife to have had it ready.  I also kind of think, depending on the age of your children, your wife should be trying to make them meals that she can eat at the same time rather than stealing yours. \n\nBut if I had spent all day away from my parent and child and came home that late, the first thing I would do is check if the other parent needed help or eaten so I knew if I needed to get them something.", "How about you make enough for your poor wife and children you selfish person", "YTA. Before you even considered cooking you should have checked with her to make sure he wasn’t hungry. You left her alone with the kids all day while you had time for yourself at jujitsu.\n\nYou should have apologized for things being so crazy, and you neglecting your duties as a parent", "I bet these kids are all very young too and need constant supervision. Meanwhile he's gallivanting off to jujitsu classes. I wonder if his wife ever gets the chance to any fun classes.", "Where tf you pulling 3+ hours prep time from, they were taking a bath not making one... I swear... some people...", "That's what i did on my vacation!", "It's also not unusual to communicate with spouses by popping your head around the bathroom door to say hi to your family, tell your wife you're starving and about to make your sushi, and did she eat yet, and if not, what are her plans for dinner? \n\nYTA", "Exactly. It's even less unusual to say to your spouse \"hey, I'm home. Need a hand with bathtime or shall I make us dinner instead?\"", "At first the „hanging“ comment didn’t bother me at all because I assumed they were teenagers, it’s totally possible to hang out with your teens if you’re on good terms, but when I read she gave them a bath… well YTA. Teens don’t need mommy for a bath, toddlers do. Her day was likely more stressful than dad’s.", "It’s like herding cats…. I was a nanny for many years and good god those kids are gonna go where they go lol", "“Has been hanging with the kids all day”. \n\nYou sir have zero idea how difficult parenting is. Being a SAHP does not entail “hanging” with the kids. Maybe when they are mid to late teens, but from the bathing comment me thinks that the kiddos are still under 5. \n\nOP is exhibiting signs of entitlement and narcissism. \n\nYTA", "Shes an adult and this is not uncommon that on that weekday he goes to sports and comes back to sort his own dinner. I believe he didnt expect her to not have had dinner yet….", "I think y’all forget that this man was working most of the day acting like he was out all day having fun", "People acting like it’s sooooo hard to be home with the kids. I was a stay at home parent for 5 years. Easiest job I ever had. Nobody saying this crap has ever had a trades job, like carry shingles up a ladder all day and then tell me how hard it is to raise kids. \n\nIt’s not easy to raise kids. Don’t get me wrong. I’m just saying that it’s a lot easier than blue collar work.", "Oh my god I assumed he was taking one of the kids to their ju-jitsu class. What an a-hole.", "Well, he'd already written out his dinner in his journal, you see. So whatever wife decides to do while he's exercising after work is her problem. (totally sarcastic). OP sounds *really* into himself. Also, YTA.", "Or maybe his wife should make herself a sandwich instead of taking his food?", "It could also have been avoided if SHE had asked him. Why is everything his fault?\n\nShe didn't think to ask him if he wanted any dinner when she was making dinner for the kids.", "Agree. ESH. OP should have asked before preparing food if his wife needed something. Alternatively, she should have told him before if she expected half his meal. The time for communication is BEFORE cooking. A little communication and both could have eaten. As it is, two people will go to bed probably still hungry.", "This is what I don’t get, surely she could of easily prepared herself a meal whilst making the kids meal if she didn’t want the same lol god even a sandwich?!. Something so simple yet everyone made it seem like it was OPs fault. OP is NTA.", "Exactly.  \n“It’s OK, I’m not hungry, I’ll take a little bite of yours maybe.”  \nMe: makes or orders extra knowing it will be needed :)", "I’ve been wondering if this is as bad or worse as the time his wife put pistachios in the mixed nuts…\n\nhttps://reddit.com/r/mildlyinfuriating/s/tiYw7jd42i", "Must be on the young side if wife is involved in their bath time.", "But the wife didn't ask him if he wanted any dinner when she was making it for kids. So why is it Y T A? It should be ESH", "Discuss feelings? Why? They need to communicate and double check.\n\n“Hey how was your day? How are the kids?  I’ll have my poor man’s sushi now, I’m already giddy with excitement, can I get you anything?”\n\n15 seconds that would have avoided this whole situation.", "Weird reply. It’s an extremely good dish.", "What does this have to do with anything?", "Man uses the wrong word and gets caned lol", "The commentor is not talking about the bath.\n\n\n\nHis work ended at 5:30\n\n\nHe didn't go home but followed his hobby until 8:30. \n\n\nAnd then the bath happened.\n\n\n\nObviously we don't know his usual commute, but there are the 3 hours to himself", "Info please - \nwhen does your wife get to do a “turn and burn” and have a few hours to herself without having to worry about the hardest part of the day with 2 kids ie dinner/bath/bed?\n\nHow many days a week do you do jujitsu or other turn and burn activities that are just for you?\n\nDo you normally only sort yourself out for food as you log it?", "OP, you THINK you take care of the kids as much as she does. You're not an AH for the food thing, she should have made her own even if she was tired. But don't try to pass it off as her \"hanging with the kids\", come on man. Also, why didn't you decide to make anymore food afterwards? You'd prefer to complain that you're hungry? Why not just communicate and ask her if she is hungry, and make enough for 2? I'm not trying to dog you, I'm only trying to get you to see that maybe you didn't go about this in the best way possible.", "Exactly.", "See, i find that most of the time, male spouses use it to undermine the mothers of their children. When i saw it, i knew what was coming.", "I dunno. I have 3 kids, from teen to kids and that's never been a problem. I can't find a way that happens if you're on top of everything", "Exactly! He gets to work out (and enjoy the “Zen” vibe) and focus on himself. She gets to negotiate with t3rrorists all day (while ignoring her own hunger pangs). What a bargain. Not.", "I guess I’m lucky that my husband gets me food even if I don’t ask for it. The majority of our relationship I’ve been the career person and often forgot to eat, he always has made sure I have meals. Now I’m a SAHW (health stuff) I make sure we both get dinner but he’s in charge of breakfast.", ">  Eh, hoping that your husband would make food for you too after you spent all day taking care of your children so he could have hours of alone time having fun and working out doesn't make the wife an AH at all imo.\n\nSounds like they need to communicate better.  He can't know she hasn't ate if she doesn't tell him, and she can't expect him to make her food too if he doesn't tell her what he's making.  He assumed she ate.    \n\nIs OP's class one day a week?  If so, she should find some sort of class to sign up for to get some time away from the house", "I was thinking the same thing. For years I didn’t eat the same thing my kids ate bc I eat mostly plant based and they were staunchly anti vegetable (as most 4-7 year olds tend to be). Those kids ate nuggets and rice or pasta three times a week. They were healthy and happy children and I ended up not feeding myself until after they went to bed.", "Found the parent!", "Ohhh my friend, I feel the need to comment here. I had a hard as hell, 14-16 hour days, stressful af job... didn't know what a lunch break was and I had to be ON at all times. I'm now a SAHP. I wonder what your support was like as a SAHP because straight up this is the hardest thing I've ever done. It's rewarding, amazing and I'm grateful as hell, but there's something about 24 hour days, no breaks, no clocking off that just hits differently. Best and hardest role I've ever had.", "I think it really depends on your support system. I have 3 friends that are SAHP. \n\n- Friend 1 - Husband works 9-5. He’s really involved in the kids life and is active around the house/chores. Friend 1 also has family near by.\n\n- Friend 2 - wife works long hours. He’s with the kid from 6am to 7pm. When wife gets homes she’s understandably shattered and doesn’t help with chores/child. Friend 2 had no family near by and carries the full mental load of the home and child. He’s exhausted, but they have a good relationship and she takes the kids at weekends and comes home early one night a week so he can attend his hobby. \n\n- Friend 3- has no support at all. Her husband goes to work, views family money as his money, sees the kids and house as ‘her job’ and goes away every weekend with friends/family. She’s miserable and stuck.", "I bet the wife came home and did everything you didn't do, because there's no fucking way you'd say that otherwise. Taking care of kids on top of cooking, cleaning, laundry, and being there full time without a break? Making sure they don't get into anything while your back is turned doing all these things, and getting yelled at by your significant other if you forget to do something or god forbid... ask them for help?The mental toll it takes on you with no support is worse than having a 14/hr a day job. I know from experience.", "I think it's mentally really hard. I teach 31 young children in a primary school and it is easier than being at home with my 2 😂. The days can be really long and lonely. Kids today are so demanding & you're constantly made to feel guilty by social media to be the perfect parent. It can often be thankless too. I respect any mother or father who stays at home to look after young children.", "Maybe appropriate to say when they’re, like, 25… not when she’s still bathing them!", "Chilling in a bath with them omg I’m drying 🤣", "It's also super bizarre to me that people who have at least two children together and presumably have lived in the same house for years have never come upon the subject of sharing food before, or how either if them feels about it.  How is this the first time it's come up? It sounds like he's off living his own life  and barely speaks to his wife who is busy \"hanging out\" with their kids.", "And to top it off, instead of fixing it, OP came and wrote an AITA post about it instead!", "Kids behave badly with the adults they feel safe to have their big emotions with. \nMy kids are praised at school and extracurriculars for being so well behaved and polite, but pretty wild at home. \n\nIt’s a red flag that you only have “good times” when hanging with the kids. \nOr you are not the default parent so you don’t do the heavy mental load.", "Right?! Had to scroll way too far for this… \n\nI totally agree. It’s really on both of them. They’re adults with children. Where was the conversation about dinner plans and confirmation that he was on his own for dinner? \n\nAs a parent, I get the assumption. As a mom, I appreciate that he made the assumption AND TOOK CARE OF HIMSELF. I’d honestly be annoyed AF if my husband came home at 8:30pm and said “wow, I’m starving! What was for dinner?” and expected me to help him with that. Like, no. Tough shit, fool. You weren’t here. You planned not to be here. We already ate. \n\nAlso as a parent and a wife… wtf dude? Call each other, maybe? \n\n“Hey babe, checking in on dinner plans since you know I’ve got that thing late tonight. Y’all good? I’m on my own when I get home, yeah?” \n\nOr even…\n\n“Hey babe, on my way home from my thing we talked about that I’d be out late for. I’m starving so planning to eat as soon as I get home. Just wanted to check to see if you guys ate or if you’d like me to pick something up.”\n\nNot that hard… JFC.", "Man you are just bleeding karma sheesh", "So defensive", "Yes, he might have feelings?\n\nWe don't know how chores, tasks, and hobbies are assorted between OP and his wife. It seems like a regular thing for him to take his class after work, and it is assumed he is on his own for dinner. It's probably likely that she also knows she is on her own for dinner, as it seems like they have somewhat of a system worked out.\n\nWould it be kind of him to offer his food if she asked? Yes. Should he feel obligated to? If it was known that they were both on their own for dinner, no. These are very common situations that get worked out between parents when there are kids around. The mom isn't infallible just because she's been taking care of the kids.", "Dude you’re psycho. I see you on like every comment trashing this dude when you don’t have full context. Get a life", "I’m thinking OP might be calorie deprived and not thinking straight", "Bro what motherhood is not worse than Vietnam what crazy take is this", "Seriously!! The pro-woman attitudes in this sub are out of control. OP asked about meal sharing and almost every response is going in and on about his not taking care of his kids when zero information was given in respect to kids/home work distribution. I would have been annoyed like OP was too but probably also would have shared with my husband as well. \nOP - NTA.", "No he is TA stop covering for him", "She obviously meant that she hadn’t had dinner. They went to a late lunch but now it’s 8:30 and she’s hungry again.", "She meant she hadn’t had dinner, not lunch.", "She went out to a late lunch so she skipped dinner and therefore was really hungry by op's LATE dinner...", "What primary parent is on top of everything? To be clear, you’re telling me you’ve never had a super busy day, made sure the kids are fed/bathed/etc, then realized you haven’t peed - let alone made yourself dinner?", "Your comment is 100% Great Mom Actions. Your kids are lucky to have you because you don't act as if you can't or didn't take care of yourself because of them. I would be devastated if my mom had made it seem like I was the reason she had to have half of my dad's dinner. \n\nYou rocked it! Thank you for being a good mom as well as being able to maintain your needs at the same time.", "I'm infertile but thanks, I think?", "Yeah I was about to hop in and say something about that last comment. I've worked as a kitchen manager at a very busy Chili's, we would hit capacity every night and there was always a wait for a table. Weekends were worse, everyone at the tables plus massive to-go catering orders. I'd regularly work 14-16 hr shifts sometimes because people kept calling out or were sorry-asses who didn't want to work. Open to close, then open again the next day type shit.\n\n Being a SAHM and also being pregnant is so much worse. I do have Hyperemesis gravidarum which adds to the struggle, but even without it I'm stressed. I have an autistic/adhd 4 year old on top of feeling nauseous and vomiting every day even at 5 months pregnant. With my daughter, it lasted until I gave birth. I would rather have a clock in clock out job, but specialized childcare is fucking ridiculous and I'd barely be bringing in money. I already know how my daughter is... she wouldn't last long at a daycare before they called begging me to come get her. I do yearn for a break, but my bf works full time so I don't ask him to do much. 😭\n\nOP isn't the asshole though, that was his food and he worked plus worked out. The wife, no matter how tired, could have made herself something to eat but she chose to pressure Op into sharing. Yes, I've been exhausted before and just wanted something quick to eat. That's life. She should start buying quick meals for situations like that. I personally like the healthy frozen meals you can get at Walmart for like $3 each. But also he does need to understand that \"hanging out with the kids all day\" is a lot harder than it fucking looks. OP listen to Mr. Mom, it's a country song but I forget the singer who made it.", "Even like they were all just chilling taking a bath together, wtf? No, she was bathing the kids, a parenting task.", "Lmao the husky would be enough, those guys fucking YELL, I've never seen another breed do that", "He claims that she gets her own time off during the week. But yeah, it seems insane to me that he spends three hours on jiu-jitsu, and keeps a detailed food log, but can't be arsed to send his wife a text asking about her dinner plans.", "Have you never been \"on your own\" for dinner? It just means you don't rely on someone for the food. If someone happens to make something for you, that's great, but you don't plan for it.", "So at that exact moment where she wanted to eat part of her husbands dinner what was stopping her from making a sandwich", "Even if she genuinely doesn’t want the snack, the gesture will be appreciated. And hey, at least you’ll get leftovers later. 🤷‍♀️", "Right, i guess everyone missed the part about only having 2 seaweed wraps but no missed that his wife had the kids while he went to a class.", "What if they discussed beforehand \"hey, Thursdays is my jiu jitsu class that you're okay with me going to. Since I'll be running late, don't worry about making me anything for dinner, I'll fix something for myself. Can you fix something for you and the kids? I got Fridays when you go out for yoga.\"\n\nIf they both agreed to something like this, then he is certainly NTA and this is a very normal couple conversation.", "Good enough for the wife to want some. Also who gives a shit how much effort he puts into HIS meal? If he ate a bag of chips and called it dinner that's his choice to make.", "Imagine if someone mocks you for the way you like to organize things. Different strokes for different folks.", "If you’re going to split hairs, so can we. You didn’t say she didn’t go to work; you said she *didn’t work*. “Going to” implies doing a job outside the home. She worked, and as it sounds, much harder than you since you got to go to a hobby after work.", "Every nanny, caregiver, teacher, educational assistant, daycare worker, etc. would disagree. Looking after children is work.", "You're a dumb fuck my guy", "Enjoy your child support you wet mop", "Unlike the rest of the year when your wife does the looking after", "its not your fault, this sub is full of single or neglected mothers who project hard.", "I can say as an absolute fact that I never did. Unless she made her kids skip dinner, she could have made her own meal at the same time she made theirs. If she believed the late lunch she gave the kids was their dinner, why doesn't she think they might be hungry just like she is and make both herself and the kids good?\n\nSorry, but she failed her children on this one if we're supposed to believe SO needed to give up the sushi to her because she's sooooo hungry. She needs to get her act together before her kids get lost in the process. You get your kids food and yourself food at the same time if you're a good caretaker.", "The only way you could have been more accurate is if you’d added a Bluey reference. Well played.", "Guessing zero..", "It was all written down in case you didn’t catch that part 🙄", "Lol IKR like that part got me HARD. Only white people (assuming race here because only whites enjoy lack of spices and condiments) can get GIDDY with excitement over canned fish and white rice.", "\"OMG BUT MY PLANNNNNNS!!!\" Tell me you're not actually parenting young children without telling me you're not actually parenting young children. Your plans mean nothing. Buckle up and enjoy the ride.", "An infinity cycle of howling", "Surprised he didn't mention that he wrote it in ink.", "I read that like you're George Costanza", "Lets switch it around. Yall have horrible  children that are badly raised and you hate hanging out with and thats why you all assume his wife had a shitty time and wasnt even able to get food.  Its like a pubstomp on this guy for yall own shortcomings", "That's the spirit.", "That's an awful way to make him see your perspective, just saying", "Y’all just be downvoting anything he types😂", "I'm a single mom and I've kind of always called it \"hanging out with the kids,\" too, just because both my kids have always been really chill and conscientious. Perfectly content to sit with me and watch a movie or play games, build LEGO, or whatever we felt like doing. I love spending time with them. They didn't really give me much trouble, and honestly my cats give me more issues than my kids ever have. lol. It's still very tiring to take care of kids, but my point is I didn't really have to \"wrangle\" them like everyone keeps saying, even when they were really young (they're 18 and almost 12 now). Given the way you talk about your kids, I'm wondering if yours might be similar.  \n\nEither way, it just really sounds to me like you and your wife need to talk about what the plan is for dinner in the future just so that each of your expectations are clear, even just sending a text after class and asking if she's eaten yet or if she wants you to grab enough for her to have a portion, too.", "But he was giddy with excitement …. I briefly vomited inside my mouth there", "Cant you read? Op said it was the last of the ingredients of that meal", "So you can't even manage the bare minimum of being a father.", "So you don’t parent your kids. You have your wife do all that.", "bro you guys are so pathetic get off reddit and get a life yeah there is a lot to talk about regarding this post yet all I've seen is people get so wound up in the wording its insane. People use different words in different contexts and its clear he's not trying to demean her by saying she's hanging with the kids. Clearly when he says hang here he's mocking you and the rest of the idiots who think 'hanging with the kids' is a horrible way  to put it"]}