{"id": 24578, "submission_id": "15qbijy", "title": "AITA for refusing to be a free nanny for my SIL?", "selftext": "I became a stay at home mom during the pandemic out of necessity…not choice . About 1.5 years ago, my sister-in-law asked me to watch her newborn daughter all day for 2-3 days per week while she worked. At the time, I told her I was unable to because I had just finished homeschooling my 3 kids due to the pandemic….I needed a break from taking care of kids 24/7 as they were going back to in-person school. I also wanted to apply for jobs again. She hasn’t talked to me since. She also now makes it difficult for my husband to see his niece. This has obviously caused tension between me and the in-laws.  My husband “encouraged me” to apologize and I refused. In my opinion, if you can’t tell me to my face that you are mad at me, you don’t deserve any explanation or attention.  Also, if I didn’t want to babysit because I wanted to sit on my butt all day, that’s my choice. She found childcare immediately after I refused…for free from another family member. AITA for putting my needs before her and her child?", "created_utc": 1691963811, "permalink": "/r/AmItheAsshole/comments/15qbijy/aita_for_refusing_to_be_a_free_nanny_for_my_sil/", "score": 194, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I didn’t take time to consider her needs and I was quick to say no\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nOh, how sad! The entitled Princess didn't get what she wanted from you, her little servant! And everyone in her Royal Court, including your own husband, wants you to apologize and make nice?\n\nFuck that!", "NTA.\n\nYou were not obligated to take on babysitting duties of an \\*infant\\* because she expected it of you. It was within your rights to say no. And I'm sorry your husband thinks you need to apologize here and that he is encouraging her dysfunction.", "NTA\n\nCaring for children is hard, even when they're yours and you love them. Caring for other people's children is even harder, and caring for family member's children can cause even more problems due to expectations and differences in methods. \n\nYou didn't owe her an explanation but you gave her a reasonable one. \n\nShe's being childish and ridiculous. And your husband needs to understand that.", "NTA.\n\nShe was just trying to get a freebie from you and you said no, so she got all butt hurt because she thinks she is entitled.\n\nDo not apologize.", "This is absolutely absurd. Unless she had an eighteen-month-long pregnancy, she and her husband became pregnant *during* the pandemic and after most childcare had closed;  and therefore *knew* that they'd need to make arrangements. \"Pawning my kid off on my husband's sister\" isn't a plan. You aren't a nanny just because you're female and have kids. It is deeply unreasonable of your husband to prompt you to apologize for not caring for someone else's infant close to 40% of the time. What are you, her husband? NTA.", "NTA she's asking for what I'm currently paying $300 a week for. That's a huge ask.", "NTA, but it feels like you already knew that. There’s no context for why SIL thinks she’s in the right here. Is there anything you’re leaving out?", "NTA. I don't see why she is so mad she got her freebie from someone else, Don't apologize it will just open you up to her next request.", "Fuck your SIL. \n\nNta", "NTA. We're all entitled to a break for the sake our mental health. If it was too much for you to take on your SIL's newborn at that time , your decision should be respected by your SIL and IL's, so should it be by your Husband.\n\nThey are the ones who should be more understanding and owe you the apology.", "NTA and also correct, no need to acknowledge your SIL’s passive aggressive bs.  If she’s got a problem with you, she should be direct about it.  If your husband has a problem with her, he should address it with her.  (And if her problem is your unwillingness to be free daycare for her, she needs to reset her expectations.  You’re already raising three of your own.)", "NTA \n\nAppease the bullies because we're all afraid of them and just want some peace and quiet!\n\nNope. You're all good OP!", "NTA\n\nShe has **no** right to boss you around or force to to care for *her* kids. That's her problem. It wasn't like she was paying you either. Her refusing to talk to you and not letting your husband see his niece is just petty behavior, especially since she got her free child care in the end. Also, your husband shouldn't be encouraging you to apologize, so don't back down.", "“AITA for putting my needs before her and her child” why do people keep asking such obvious questions here", "SIL demanding free childcare from laid-off family member is just predatory and toxic. If I were you then I really wouldn't care if I don't see her. It also sounds like she's toxic to your brother by preventing him from seeing your kids. Your SIL is toxic AF and I'd be sure to point that out any chance I have.  \n\n\nMy wife and I had twins and daycare was more than our mortgage. I never once thought of taking advantage of a family member for free care. My children - my problem. The audacity of some people blows me away.", "NTA", "NTA. She is asking for your free labor and with holding her relationship with her brother. She’s definitely TA.", "NTA what exactly does your husband think you should apologise for? It's not your duty to provide your SiL with childcare. You never said you would. I don't see that you have done anything wrong.", "NTA, your SIL is not entitled to your time, and you don't owe her anything.", "NTA. Her children - her responsibility. Or you could give her the price for being a nanny. \nBut you have bigger problems with your husband. Apparently he sees nothing wrong with people trying to steal your time. Maybe counselling could help?", "NTA\n\nShe asked, you declined.  That should have been the end of the story.  You don't owe her childcare.  She found someone else to do her free babysitting. Not sure why she's butthurt but you surely don't owe her an apology.  Your husband needs to back off.  What exactly is the apology supposed to be for?  Living your own life without his sister's express approval? She can work but you can't?", "Have the kids duke it out 🤷🏽‍♂️😂", "Most certainly NTA, and what a relief to see someone on Reddit standing up for her rights.\n\nAs you say, you don't need an \"acceptable\" reason for saying no. You don't need a reason, period. SIL is enraged because she wanted to exploit you and get free childcare--the mad, demented dream of every cheapskate parent on this site--and you had no problem turning her down. She found another relative who lacked your spine, but she's still living in a state of rage.\n\nYour husband is totally wrong. You don't owe this b an apology. If your in-laws don't like having a free soul in the family, they can stew in their juices over a hot flame.", "NTA. \n\nNo.  It's both an acceptable answer and a full sentence.", "NTA.  It was okay for your SIL to ask, but not okay for her to act as she did at your refusal. And your husband should be on YOUR side. He wasn't the one who was expected to provide free daycare, was he? No. There's no reason for you to apologize. You did nothing wrong. SIL did and is still doing wrong.\n\n\nHave hubby look at the comments here.", "NTA.  Your SIL needs to grow up, accept you are fully entitled to say no, and move on.  You owe no apology but she does for her juvenile behaviour. She is responsible for her child’s needs and you are under no obligation to do anything for her.  Your husband should be backing you up on this.", "NTA she sure is.", "NTA", "NTA ....actually you win hero for the day award..tell dear husband to, well you know", "INFO\n\nAre you sure this is everything OP? If this is true and it's as simple as this then she is obviously in the wrong, but you know that. Was there an argument or more context we should know about?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI became a stay at home mom during the pandemic out of necessity…not choice . About 1.5 years ago, my sister-in-law asked me to watch her newborn daughter all day for 2-3 days per week while she worked. At the time, I told her I was unable to because I had just finished homeschooling my 3 kids due to the pandemic….I needed a break from taking care of kids 24/7 as they were going back to in-person school. I also wanted to apply for jobs again. She hasn’t talked to me since. She also now makes it difficult for my husband to see his niece. This has obviously caused tension between me and the in-laws.  My husband “encouraged me” to apologize and I refused. In my opinion, if you can’t tell me to my face that you are mad at me, you don’t deserve any explanation or attention.  Also, if I didn’t want to babysit because I wanted to sit on my butt all day, that’s my choice. She found childcare immediately after I refused…for free from another family member. AITA for putting my needs before her and her child?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA. And your husband needs to stop being such a pushover.", "NTA", "NTA, obviously.  I'm trying to figure out what your husband thinks you need to apologize about....?", "NTA. And no apologies necessary for not being a doormat.", "Hello. This is her first child, so there is no precedent in me caring for her children. I can’t think of any logical reasons why she would be upset for so long. We had a good relationship prior to this.", "Someone already has, hence the need for the babysitter", "I love this. Parent of the loser has to babysit both.", "No one is to talk about Children's Fight Club", "Our exchange was as brief as described. No yelling. She just said “ok” and hasn’t spoken to me since. I found out though my husband she was mad at me. Her harsh reaction made me doubt my decision to not watch her daughter.", "If that’s really the whole story, then she is just ridiculous. Maybe she has some postpartum stuff going on tho? Idk", "😂 you the asshole", "Facts cause tbh both of you acting like kids lmao 🤣", "I wonder if the reason has more to do with something your husband did or said? Otherwise, they would let him see his nibling.", "I didn’t think about postpartum at the time. Thanks for bringing it to my attention", "😂", "Maybe she felt less anxious with you watching her child then the other family member", "INFO: Have you asked your husband if SIL asked him before she talked to you?", "NTA. Childcare has become as much as a second mortgage in this country, especially for under 3 year olds. I have said it time and time again, if you can’t afford to have more kids, stop. Too many peoples entire plans revolve around assuming their relatives will raise their kids for free for YEARS. It’s deeply inappropriate.", "NTA\n\nShe can compensate you for your time, but only IF you are willing to babysit them", "NTA. She is not entitled to you watching her kid. She is the one with the problem - she couldn't graciously accept that you wanted to go back to work and has now turned this into her hill to die on.", "NTA", "Nta\n\nNot sure what your husband expects you to apologize for, you didn't do anything wrong. She asked you to do something, you declined (as was your right), then she threw a tantrum.", "NTA. Everything you said is 100%.", "NTA. At the end of the day, parents are responsible for ensuring they have childcare for their kids - not passing the responsibility over to their family/friends.", "She was being very entitled. Don’t apologize as it will open the door for more entitlement and demands for free babysitting.", "Nope. She sucks. Boohoo", "Your husband wanted you to apologize for what?  Sounds like he is definitely in the running to be the a**hole", "It’s been well established here that no one is entitled to free babysitting outside emergencies and any extra baggage the imposing party brings makes them further AHs. NTA", "NTA but you need to check your husband. He needs to find his spine and not try to appease his terrible family.", "NTA\n\n&#x200B;\n\n\"My husband “encouraged me” to apologize and I refused.\" .. your husband is an AH. REFUSE.", "NTA\n\nApologize for what??!!!", "nta", "No", "NTA it's not your job to take care of her pandemic baby. You have a life of your own and she's being childish about that fact", "Nta your husband needs to tell his sister and family to get over themselves. You not her free child care.\n\nHe needs to prioritize your needs over his sisters", "I think I am more disgusted that your husband didn't have your back than with the entitled SIL. SIL and husband are the A Holes 's here, OP is NTA.", "NTA. You’re not obligated to babysit and it’s not your responsibility to babysit. You have nothing to apologize for. Both your SIL and your husband are TAS.", "Louder ... FUCK THAT!!!", "LMAO!!!!", "You asshole bro I'm dead", "Yeah maybe this? Weird. NTA"]}