{"id": 2457, "submission_id": "ywt5rw", "title": "AITA for how I handled my wife’s birthday?", "selftext": "I (m42) I work a job where it’s possible, and usually happens a few times a week, that I could be at work until 7/8/9:00 at night, it depends on what job I’m assigned that day. A couple weeks ago after two weeks straight of 8/9:00 days my wife asked me if I was doing ok with this and said maybe I should talk to my boss about the frequency of the late nights, (we’re short people right now) I told her I was fine with the OT money and I’d rather keep working them knowing that if I need out on time any day I just have to tell them and it’s not a problem, they schedule me a lighter day. \n\nMy wife’s (39f) birthday was last week. I took her out for dinner on Saturday and our kids and I made her dinner Sunday. The morning of her birthday I told her I had a job that would probably mean a late night. She got upset that I hadn’t told my boss I needed to leave on time that day since it was her birthday, bringing up the specific conversation about how I said I could ask for that any time I needed. I said that taking her to dinner and making her dinner over the weekend was all I planned to do and I didn’t think I needed to leave on time that day. Usually the kids have activities at night and she’s not home anyway. It ended up that I got home at 6:30 but by then she had already left to take our 4 kids out for dinner. \n\nAdditional info before it’s asked- she also works full time and since she’s home she is the one who makes dinner and runs the kids to their activities, I help with that the days I’m home on time \n\nShe says I hurt her feelings by not doing a simple thing to prioritize her actual birthday I said she’s overreacting because I already did something days before. AITA?", "created_utc": 1668604902, "permalink": "/r/AmItheAsshole/comments/ywt5rw/aita_for_how_i_handled_my_wifes_birthday/", "score": 859, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Told my wife that I already did all I planned to do for her birthday and she’s upset I didn’t do anything on the actual day\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Soft YTA. Per your other comment, “she’s been telling me lately she feels unappreciated and overwhelmed”. And yet you prioritize working overtime, so that she continues to feel unappreciated and overwhelmed while you work long hours and she works and takes care of the kids and doesn’t get to spend time with her husband. Did you ask your wife how she wanted to spend her birthday, or did you assume you could celebrate on the weekend and that’s enough because “you have to work late” (when though you don’t—as you said, you can ask for a light day)? Your wife has communicated that you’re working too much; she may have not done it clearly, because she put the ball in your court to acknowledge you’re working too much rather than coming out and saying that she wants you to work less and be home more, but the message is there. You just have to listen.", "YTA, she telling you that she feels unappreciated and overwhelmed and you don't make her a priority for one single day and give her the day off.  You are not present in your marriage and it will fail if you don't change directions.", "YTA. With regard to her birthday, this sounds like miscommunication on both your parts. \n\nHowever: with regard to, I “help with that [all the evening child care & taking the kids to activities] the days I’m home on time”, you are definitely an AH. Saying that you “help” someone with something means it is their job, not yours. How did *all* of the kid running around & evening child care become your wife’s job & not your job, too? Sure, she is in the house but she also works full time. Raising the kids is your job, too, not just something you do in the margins when you have time. \n\nIf you put your job ahead of your family time many nights of the week, don’t be surprised when you don’t have any relationship with your kids & they think of you like a wallet because the only thing they know about you is that you make money instead of spending time with them.", "Kindly, YTA. Maybe YOU don't think her birthday was important because you \"already did something\", but clearly, SHE did think it was. \n\nAnd you prioritized your unnecessary overtime over spending time with her in a moment she needed you. So yeah, that was shitty of you.", "You're not TA for how you handled the birthday, but YTA for this entire situation. She also works full time, has been managing FOUR kids all on her own while you just work constantly? This situation just isn't sustainable. You need to start coming home earlier, or find another job. Be there for your partner.", "YTA. Do you really have to work so much? Take time with your family if possible. \nWorking too much and spending too little time with family is a common regret in the deathbed.", "YTA \n\nBut I think this is bigger than the birthday.\n\nYou worked late for two weeks straight, she also works full time, takes care of dinner and manages the children’s extracurricular activities.\n\nYou both need to reconnect and she’s hurt that you didn’t put her first on her actual birthday. I can understand why she feels that way.", "YTA because you need to set boundaries at work.  They will continue this behavior.  You employer being short of employees is not the burden of other employees and you all are just making this harder on yourselves and easier for your boss to not run things right.\n\nHow is it fair that your wife has to pick up your slack at home?", "YTA. You basically did something she‘d do either way although you both work, and you dismissed her wishes. I don‘t understand people who are married and yet don‘t make their partner and their well-being a priority.", "YTA - common sense, my dude. She shouldn’t need to tell you that her birthday is a day you should be home on time.", "YTA she asked if you could get off early for her birthday. You didn't. She told you what she wanted, you said no, she is allowed to be upset over something that is obviously bothering her. She might have wanted to spend the night with you instead of by herself taking care of children, alone, on her birthday. Dude, she literally told you. Don't be surprised that she is upset.", "YTA\n\nShe works full time, does all the childcare, and lives without your basic respect and affection. You don’t love this woman: you’re using her. One day of leaving work on time to be with her on her birthday is the least you could have done.", "Yeah YTA you said you could ask to be home at a reasonable hour any given day and you should have done it even if you already “celebrated” her birthday", "YTA\n\nHonestly ever think that maybe on her birthday she didn’t want to have to do all the parenting on her own?\n\nShe shouldn’t have to ask you to come home on time. She’s been picking up the slack for this over time and expressed she is feeling under appreciated.\n\nMany adults celebrate their birthdays on the weekend before and after but when your partner has expressed the need for more appreciation and to be a priority then this goes beyond not being there on her birthday.\n\nSounds like she’s come to terms with you not listening to her. The straw that broke the camels back and it often breaks on occasion like birthdays, anniversaries and holidays when a partner feels all that pent up frustration and another disappointment has just added to the load.", "Light YTA. It's fine to celebrate someone's birthday on another day if you have to, but you should've told her that was your intention first before just assuming she'd be cool with you using that as her time and then working late on her actual birthday.", "YTA\n\nYou can’t decide that you’re celebrating her birthday on the weekend before and not her actual birthday, without mentioning this to your wife until the morning of her birthday.. \n\nIt sounds like you are avoiding family life by going along with the overtime when you don’t actually have to", "YTA lightly. I would guess that this could be about more than her birthday. If you're working until 8/9 PM that often, she's stuck doing ALL the childcare those days with no help (including her birthday if you'd stayed even later), and then getting no time to spend with you. She probably asked you if you're okay with this in hopes you'd say no and you want to come home earlier more often. OT pay is great and all, but sometimes life requires you to participate more than the bare minimum. Maybe it's time to talk with your wife and see how she's really feeling about how much you work. Plus, your kids deserve a present father on more than just the weekends, and you may want to consider prioritizing your family over work if you're not struggling desperately to pay the bills. Your kids are only young for a short while, don't miss it just to work all the time.", "Yta your wife who has straight up told you she is feeling neglected and needs you to work less, is upset that you once again prioritized work over spending time with her. \n\nDoes that help clarify things?  Also, if you're doing all this over time you're leaving all the parenting and housework to her.  \n\nDo you know whose problem it is that you're shorthanded?  The managers. Not yours. Not your family's.  Keep putting your job ahead of your family and in 20 years you'll be on reddit bemoaning the fact that you have no common interests with your wife and your kids never visit you.", "YTA. 100%. How clueless are you? You're counting your OT dollars, while you're completely neglecting your marriage and your partner. \n\nOf COURSE she wanted to celebrate her birthday, on her ACTUAL BIRTHDAY. You completely devalued her as a person, and failed her as a lover, and even a friend. \n\nWhat's she done for YOUR birthdays? The KIDS birthdays? She probably is the one who remembers all your family's birthdays, the holidays,... wow. \n\nDude, get onto TikTok. Start learning about the disparity between the emotional labor women do, and that of men. Start seeing how neglecting your wife this way is ABUSE. This is how love dies. How marriages fail. \n\nHer birthday comes ONCE A YEAR and you know the fucking date... and you should gave taken time off work, taken the kids out to get presents for her at least a week beforehand, made her Wueen for a day to show you appreciate her as a person for all she is and all she does.\n\nYou put the barest little bit in, at your convenience, as barely an afterthought,  and only after missing her actual birthday. You have NO IDEA how brokenhearted she is. \n\nYTA, YTA, YTA.", "YTA", "YTA.\n\nYou need to realize that every time you work late, she works late. And she gets no say in that.\n\nShe works full time, and then has to feed the kids, shuttle them to activities, make sure homework gets done, plus handle anything else in your home that needs to be done before 8/9 pm.\n\n(Hit post too soon!)\n\nAnd what do you do when you get home from work? Do you spend a few hours parenting/cleaning/etc. or are you exhausted?\n\nIf you had 2 jobs, you wouldn’t be able to just not show up to your night shift because you wanted to work overtime at your day job. Well, you have two jobs. You need to show up for both.\n\nNot to mention the fact that you seem entirely unconcerned with how little time you’re spending with your family. Why even have a family if you barely see them?", "You “help” with the kids when you’re home. \n\nOP, what that means is that you’re fobbing off your duties as a father onto someone who is not your kids father. \n\nYTA- but the birthday is the least of the reasons why.", "It’s reasonable that she wants to see more of you on her birthday and can be upset that you’d have to work late. It also sounds like she may have a lot on her plate at the moment.\n\nEdit: changed to YTA as I missed the part where they’re living comfortably and didn’t need the extra OT money.", "Apparently your wife found it important to be with you as much as possible on her birthday. \nWhich isn’t a crazy expectation. Regardless of her running the kids or not it’s nice to have your partner there with you. \n\nFor all she knew you might not have gotten home until 8/9 so I see why she took the kiddos to dinner solo. \n\nI do see where you’re coming from as not having plans , however in your wife’s shoes she has been dealing with you essentially only being home to sleep this whole time. She just hopes her birthday would mean enough to keep you home on time this once.\n\nEdit:: I forgot my vote. NTA but there was def a misunderstanding there that should be addressed. She just misses you and thought she would have you home on time for her Bday", "NAH\n\nSounds like a clash of love languages so to speak. To you the important part was the scale of the celebration, to her it was the timing of it. \n\nI think you should have a talk about it without accussing each other of being assholes. Talk about your hurt feelings, I’m guessing you feel like she’s saying you didnt do enough since you are pointing out the two seperate celebrations and that is hurtful to hear of course. \n\nIf you have this talk now you can both adjust well ahead of time of 40th.", "Idk man, I'm going with NAH, she wanted to spend some time with you in her birthday but, I mean... you had to go to work, right? She getting upset doesn't make her AH and you going to work instead of spending more time with her in her birthday also doesn't make you an AH imo, because you got her to dinner and it's a simple gift as she wanted, no?", "Edit: YTA for presenting this as a case of an adult not having a celebration on the exact date of their birthday, when with your followup comments, it's clear that this is about your disrespect for your wife and her needs in all areas of the relationship. \n\n~~NTA. Adults needing to celebrate a non-milestone birthday on the actual date of the birthday, especially when they've had two celebrations already, are showing a lack of understanding of what's going on in other people's lives.~~", "[removed]", "NAH I think this is just a simple case of miscommunication. She assumed you’d give her a little extra attention on her actual birthday but never really said anything to you. You assumed your weekend celebration was enough for your wife to be satisfied. I don’t think anyone was really at fault here, it’s just a situation that in hindsight should have been talked about and expectations could have been set.\n\nMaybe your wife has been missing you lately and was hoping for an extra gesture. You should make some time for each other I think", "NTA,  You celebrated her birthday all weekend. How many days does she need to be celebrated? I see this too often how women don't appreciate the hard work and long hours their partners put in for their families. Do you think men enjoy working themselves to death with 60 plus hour work weeks? Trust me, we don't. It's not fair to chastise a man who works hard to provide a good life for his family.  I'm sure your wife has no issue with enjoying the lifestyle afforded by all the hard work and ot hours you put in. It's perfectly reasonable for you to assume that a full weekend of celebration for your wifes birthday would be enough to show her how much she is loved and cared for.", "NTA.  Sounds like she didn't properly communicate that she expected you home early for her birthday.  Given your current schedule and the fact that you had the weekend activities, I wouldn't have assumed you'd be home early either.", "NTA you did stuff for her birthday. You're working not going out with the guys. Why do grown adults think their birthday should be a national holiday", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (m42) I work a job where it’s possible, and usually happens a few times a week, that I could be at work until 7/8/9:00 at night, it depends on what job I’m assigned that day. A couple weeks ago after two weeks straight of 8/9:00 days my wife asked me if I was doing ok with this and said maybe I should talk to my boss about the frequency of the late nights, (we’re short people right now) I told her I was fine with the OT money and I’d rather keep working them knowing that if I need out on time any day I just have to tell them and it’s not a problem, they schedule me a lighter day. \n\nMy wife’s (39f) birthday was last week. I took her out for dinner on Saturday and our kids and I made her dinner Sunday. The morning of her birthday I told her I had a job that would probably mean a late night. She got upset that I hadn’t told my boss I needed to leave on time that day since it was her birthday, bringing up the specific conversation about how I said I could ask for that any time I needed. I said that taking her to dinner and making her dinner over the weekend was all I planned to do and I didn’t think I needed to leave on time that day. Usually the kids have activities at night and she’s not home anyway. It ended up that I got home at 6:30 but by then she had already left to take our 4 kids out for dinner. \n\nAdditional info before it’s asked- she also works full time and since she’s home she is the one who makes dinner and runs the kids to their activities, I help with that the days I’m home on time \n\nShe says I hurt her feeling by not doing a simple thing to prioritize her actual birthday I said she’s overreacting because I already did something days before. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA \n\n&#x200B;\n\nRegardless the importance of your job - so you couldn't make sure you came home early on THAT ONE day: Your partner's birthday.\n\n&#x200B;\n\n\"but by then she had already left to take our 4 kids out for dinner.\" .. So you failed to make plans? What did you expect. Sitting at home waiting for you to show up or not?", "my dude she was basically begging you to spend less time at work and more time with her and the kids by asking you these questions. It should have been clear she wanted you home on time on her damn birthday. Not only to celebrate her but also so that she didn’t have to shoulder the after school shuffle of your four children alone on her birthday. Are you really this obtuse? YTA.", "Soft YTA as you didn't like go out of your way to work extra over her birthday you just didn't realise she would want more time with you but yeah her birthday is obviously important for her", "YTA - being home on time when someone has a special occasion and you are able to is a pretty low bar. Is there a reason you don’t want your wife to feel loved and appreciated? She already communicated to you that she doesn’t and you still didn’t do what most would consider to be the bare minimum.", "YTA- what she asked for for her birthday was time with you, and you denied her this. how can you not see this?", "YTA. \"I help with that the days I’m home on time\" But by your own admission, your wife has been primary parent for over 2 weeks straight while also working full time. And the whole, \"she's not even home, they're at activities\" thing is not an excuse. YOU could take the kids to activities, YOU could cheer them on, YOU could get dinner ready while they're out. \n\nYou said your wife asked if this was going to continue and you said yes, unless you asked them not to schedule you for OT. So you didn't ask for a lighter schedule so your wife gets to keep doing all the hard family work. You also didn't call or text your wife letting her know you were heading home, so when you got home and she was gone with the kids, you did what? \n\nYou did not prioritize your wife on her birthday. You didn't even give her a heads up you were heading home much earlier than you had been (9 PM vs 6:30 PM). You knew she was upset that morning and you did NOTHING to let her know she was more important to you than your schedule.", "Assuming you love your wife, you need to be listening to what she is truly communicating.\n\nShe misses you. She wishes she could see you more. The busy-ness of work life and family life has made her feel disconnected from you. She wants you to show her that she is a priority and make her feel special.\n\nYOU may not feel like anything is missing, but she does. If you love her, the fact that she wants this should be enough that you should want it, too.\n\nVery soft YTA because yes, you made an effort and if the roles had been reversed you would’ve seen it as enough. But your response to her probably made her feel even less loved, just as her response to you made you feel unappreciated.\n\nYou two need to spend some quality time together. Maybe start by letting her know you love her, and see if you can plan some time away, even if it’s just for one night.", "Put yourself in her shoes, man!", "YTA.  You sound like you are treating your wife more like a roommate than a spouse.  Living with you must be like living with a ghost.  So what if you took her out for dinner in advance?  Spending time with her on **the day** of her birthday is what matters.  Making her feel valued and seen matters.\n\nYou don't respect what she's telling you she needs out of this marriage, you prioritize your work over her in general but especially on her birthday, you're not spending enough time at home.  See: Ghost.  Is it going to make you happy when your wife has had enough of your indifference and packs up the kids and leaves?", "YTA \n\nShe works FULL-time. Deals with FOUR kids. Seemingly does MOST of the domestic chores. You VOLUNTARILY work OT until 9pm some nights. \n\nI'm guessing based on her reaction that she isn't just mad in feeling you aren't making her a priority. I'm wondering if this is the general way you deal with your family. And she wasn't asking for the whole day.  She just wanted you to get off work at the normal time and not pick up OT for this ONE night.\n\nEDIT: OP has informed me that OT is NOT voluntary. My apologies. However, he DOES have the ability to request getting off work on time.", "She's the ahole but it's mostly misunderstanding how to love each other.. Personally the day doesn't matter to me but that's a personal thing i suppose... You took her out to dinner though and you guys are grown adults... It would be different if she was your kid or something in my opinion.. Not to mention you had work so it wasn't in your control really.. I feel birthday comes after work when you already took her out for it", "No judgment, but i really don't get this obsession with b-days some adults have. We usually check what weekday our b-days fall on and if we celebrate the weekend before or after. We both work full time, why should it make sense that you need to be home at a certain time on the actual b-day if the celebration happens on another day anyway? I mean she is 39, so not even a \"big-one\". Its also not a once in a lifetime event, it literally happens EVERY year, so in the end an average person has 75 bdays, its really not that special.", "NAH. This is just an unfortunate situation. She loves you and wants to spend an important day with you. You've got work and tried to compensate some other way. Just do something special together and remember next time maybe.", "We’ve had an ongoing issue that she says I don’t take her anywhere or plan any dates and it makes her feel like I don’t care so I planned a date, I took her out. I feel like that should have been enough.", "Yes. It needs to be said more accurately. \"I work late, so I skip out and pass all my parenting duties to my wife almost every evening.\"", "She’s been telling me lately she feels unappreciated and overwhelmed but I we celebrated twice so I thought that was enough. I feel like she’s never happy with me", "Yeah that’s what she said. She said that me not doing it makes her feel like she’s not a priority. She knows that asking to be out on time isn’t a big deal since I rarely do it", "This comment, makes him a BIG AH to me\n\n\"She’s been telling me lately she feels unappreciated and overwhelmed but I we celebrated twice so I thought that was enough. I feel like she’s never happy with me\"", "She actually told me she doesn’t need me to work less, she just wants to feel appreciated for all that she does do. But I used to do a lot of the child care before I switched jobs last year so I don’t feel like I should have to be over the top with my appreciation of all that she does since I used to do it", "Want to bet that when they went out, she did ALL the parenting of the kids while in the restaurant? She packed any diaper bags, brought sippy cups, made sure there was entertainment for them, ordered their meals, took them to the restroom, and supervised behavior too?  If he didn't take the kids, it begs the question...was the older one told to cancel plans and babysit, or did the wife have to locate and arrange the sitter?", "She just wanted him to come early so he can spend more time with her", "I think he is an AH not only because of this.\n\n1) he comes home late for 2 weeks leaving his wife, who also works full time, to take care of everything at home\n2) according to him \"She’s been telling me lately she feels unappreciated and overwhelmed but I we celebrated twice so I thought that was enough. I feel like she’s never happy with me\"\n3) she's asked him to come home earlier several times\n4) he said he can come home earlier if he asks\n\nShe is alone, overwhelmed, he takes her for granted and is surprised she wants him to be with her one day, which is supposed to be a special day for her.", "I didn’t have to be at work, which was her issue. I can easily tell them I need to leave on time, I just didn’t think I had to since I did celebrate her birthday already", "To be fair, maybe it's actually about the lack of help she gets with the kids during all these late nights he works. She has to be the only one getting them too and from all their activities, take care of dinner, baths, and bed by herself if he's not getting home until 9 or later. And she just didn't want to have to do that on her birthday. Doesn't seem fair to judge her too harshly without considering how often he's working late and therefore unable to help with childcare.", "This is clearly not about the birthday. It’s about a husband who chooses overtime he admittedly neither needs nor has to work over his family while only doing the bare minimum he feels he “has to” do not to lose them.", "I told her she should have told me and I would have asked out on time, she said that’s not something she would have ever thought she would have to tell me and “that things like this are why she feels like she’s not a priority to me” I should have known without being told", "My wife actually makes almost double what I do. Which I’m sure will cause more people to think I’m an asshole but I don’t want to misrepresent anything", "Ah, but the overtime at work was completely in his control, with no negative repercussions of being home on time.", "Yeah I don’t know. She loves her birthday though. And Mother’s Day. She says it’s two days a year for just her", "Yeah, I know what you mean. I changed the oil in my car three years ago, so really, that ought to be enough. I have no idea why it ~~filed for divorce~~ broke down on me.", "“I feel like it should have been enough.” More accurately: “I don’t enjoy celebrating you or making you feel loved. I just want to do the bare minimum so that I can go back to work and not be judged.”", "Do you really need the internet to tell you that a marriage is about more than just your feelings? The other person’s feelings matter too.\n\nYour communication with your wife appears to be poor since you clearly weren’t on the same page regarding her birthday. Talk to each other more and don’t make assumptions, otherwise you may not be married for much longer. These things tend to fester if ignored.", "Honestly, if you think that planning to go out for her birthday on the weekend suffices, when clearly your wife feels neglected and unappreciated, I don’t know what to tell you. What you think should be enough just isn’t—clearly, since this is an ongoing issue. You can do more or tell her that she can just live with it, but I don’t think you’ll like the results of the latter.\n\nETA: I’m not saying this to be harsh. There’s a compromise here to be found, if you talk about it. Maybe take a week off the OT, maybe take some PTO even, so that you’re home more. And talk about, if the OT is really helpful—to your standing in the company, your livelihood with the extra $—talk about what is reasonable so that she doesn’t feel unappreciated.", "Just jumping in to say I'm pretty sure in your wife's mind, taking her out for her birthday doesn't really count as making an effort to plan dates. It's a day she should've been celebrated anyway. She wants you to be more thoughtful of her in general and want to spend time with her doing fun things and enjoying each other's company.", "That mentality right there is why it’s not enough. \n\nNo one wants to remind or nag their SO into planning dates, only to have them complain that they thought once was enough when they did… starting the cycle all over again. Your wife wants to feel loved and prioritized and you’re over here saying “there, I planned a date, is that enough for you?”", "Your wife may have thought the date night was just you finally planning a date night. And not a birthday celebration.", "Obviously it wasn't. Your wife wanted to feel special and wanted on her birthday and you didn't make that happen. How do you feel about your wife? Is she the complete love of your life? You couldn't imagine life without her? You want her to feel loved and special always? Is she amazing? Does any other woman compare to her? \n\nIf the answer to any of the above is 'yes', do you really believe this is 'enough'? A date that she had to tell you to arrange? This is the bare minimum. If she is absolute love of your life, start treating her like she's exceptional. A date that she had to tell you to arrange and cooking dinner once isn't enough.", "I get the feeling that she probably didn’t expect you to plan a whole other date night, but would have appreciated you taking the kids to their activities for one night while she chills out. Or, you know, just being present with her on her birthday.", "It’s hard to be happy with someone that’s never there and doesn’t sacrifice the occasional overtime to spend that time with your family instead.\n\nIf the roles were reversed you’d feel unappreciated too.", "She’s not happy because she’s unappreciated and overwhelmed. \n\nA dinner out on your day off doesn’t make up for every other day of the week where she does it all at home AND works full time too. She told you exactly what she wants - you to be around more. \n\nYTA", "Well, maybe she is not happy. Do something about it.", "Then listen to her dude. She’s working full time and taking care of 4 kids and a house. You’re taking the “easy” way out by working late. Yes I’m sure the money is helpful, but I’m sure you being around and taking some of the burden off your wife would be more helpful for her", "yes, bc taking her out once & making her dinner once totally makes up for all the times you worked late and neglected your relationship with your wife. /s\n\nYTA", "You only want to do the bare minimum. You don’t love this person. You’re defeatist attitude of “she’ll never be happy” is just your excuse not to inconvenience yourself.", "Well yeah. You have kids and she works full time and has to take care of the kids without your help while you do voluntary overtime at your work. It reads a little like you care more about your job than your family. You're concerned about how being short staffed at work has an impact on how much work needs to be done, but in order to be there for work, you have left your family completely short handed and in the lurch. Now your wife has to do her work AND your work at home AND her work at her job, without the comfort of her partner who basically only comes home to sleep. Then it's her birthday and she still has to do ALL THREE jobs alone still. \n\n\nWouldn't you feel overwhelmed and undervalued? You spend more time and emotional effort on work than on your family.", "Politely, unless you start to make her feel appreciated your marriage could be over. Often people don’t realise when their partner is telling them it’s on the rocks til it’s too late. You can change the trajectory if you take on board what she’s saying and act.", "> I feel like she’s never happy with me\n\nPlease read this back to yourself.\n\nShe's been feeling unappreciated and overwhelmed in general. You've worked late 2 weeks straight. She has specifically asked you to cut back.\n\nYou decide to do a nice thing for her once, and then consider that done and dusted.\n\nCan you seriously not see her point of view here? Why doing a single nice thing wouldn't suddenly satiate her needs?", "I'm gonna guess that this has been building for a long time for her. Celebrating twice is just a drop in the ocean. \nWomen often tell their husbands what is wrong and what needs to be fixed in their marriages. Men often just do the bare minimum and think that will be enough but it's not. They then act shocked when presented with divorce, like the wife completely blindsided them. \nPut in a little more effort for your family. \n\nYTA", "Have you asked her what she wants? What would make her feel appreciated? She might just be asking for a nice night out together once a month or so. Maybe some flowers every now and then. If you want to prove that you appreciate her, then you need to better your communication.", "Just reading some of your comments, I think you and your wife should make a clean break. If you want a woman to feel like what you did was enough, you need to find on, if you want to keep your wife, she needs more.", "Well, she's right. She's not a priority. Are you guys so deep in debt that you have to do all this overtime and overwork your wife as well as yourself, and miss out on your kids' activities and family life?", "Friend, she shouldn’t have to ask. Thats what’s frustrating her.", "You only do what you “have to” do, then? You don’t care about her happiness: you’re a lazy husband trying to absolve himself of having to do more than the bare minimum on a technicality.", "INFO: \n\n1).Do you know what your wife means when she says she wants to feel appreciated? What does being appreciated look like to her?\n\n2). Before your new job, how did you split household/childcare duties? Is your wife now taking on the extra childcare duties that you are no longer doing?\n\n3). Do you feel appreciated?", "Our kids are older, we went out alone. No kid had to cancel any plans to babysit", ">I just didn’t think I had to\n\nDude. YTA", "Well you probably should have told them you had to leave on time, that was not an AH move, more like a \"dumb\" move, not trying to call you unintelligent, just can't find a good adjective cuz Im a dumb brazillian here", "You could be right about all of that! I was just judging based on the birthday itself, but there seem to be underlying issues and resentment over her lack of help around the house.", "Our kids are older so no bath / bed routine. But they have a lot of activities, at least two a night, one night they actually have 5 and my mom has to take one of them somewhere if I’m not home on time because my wife has to be somewhere else at the same time. She’s ok with me working the OT though, she said as long as I’m happy then that’s all that matters to her", "The question for judgment is about the birthday. I didn't address any of the other obvious issues in this marriage.", "Did you not read what I said? Yeah she should have told you but you also should have asked. Don't put all the blame on her.", "Well, it’s obvious that she’s not a priority.", "He took her out for dinner for her bday already... Seems to me some people never grow out of birthdays and some do", "because literally every other day of the year she’s taking care of everyone else. the literal least you could do is make her the number one priority on those days.", "This is an extremely accurate analogy. Relationships need to be properly maintained or they fall apart.", "People often don’t appreciate how complacent they’ve gotten in their relationship until it fades past the point of repair. Love needs to be cared for and maintained throughout the entirety of the relationship, not just in the beginning.", "No, we live comfortably.", "She said she would just like it to be acknowledged that she’s working full time and now doing 90% of the stuff around the house/ with the kids. It wouldn’t kill me to thank her sometimes and occasionally bring her flowers or something to show that I appreciate it \n\nBefore my new job I didn’t work as many hours, maybe 30/ week so I picked up a lot of the kids stuff but it was probably 60/40 me. I also did most of the cleaning, my wife hates to clean \n\nI didn’t feel appreciated when I was the one doing more stuff around the house", "So she cares about your happiness, but you can’t be minorly inconvenienced for hers…", "And who has to arrange for your mom to come? Do you at least do that for her?", "Maybe just make sure, because I know personally if I was getting very little help and barely see my partner during the week I would have some built-up frustration. Maybe she's changed her mind, or maybe that 1 day it was important to her that she has help. She's also working full time, so it's not totally outside the realm of possibility that this is a frustrating point for her. Overall, it just seems like more communication couldn't hurt. Having a conversation about something doesn't mean the circumstances never change, and feelings can be fluid. So checking back regularly is always a good idea! Discuss how often she's truly okay with you working late if she feels like she needs more help, or if she'sfeeling frustrated. It's great your mom helps out that 1 night, but there are 4 more nights, and if you worked OT for 2 weeks straight, she could be getting burnt out now.", "But it does influence the outcome - he’s constantly shown his wife that she’s not a priority, and even if he didn’t plan anything for her actual birthday because they went out on the weekend he’s continuing to show her she’s not a priority on a day when she should be.\n\nAgain, doesn’t have to plan anything other than dealing with the kids activities that might instead of her, spending time with her, etc.", "You can’t judge this situation accurately based simply on the birthday.", "Exactly. This guy is just phoning it in. She’ll leave him when the kids are a little older. The question is whether he’ll care or whether he’ll just be inconvenienced at having to miss a few hours of work for his court date.", "Then you're confirming her suspicion. She's not a priority to you. Your work is. That shes very low on your list of what's important.", "Man you got to think if this is what you want! She feels like an afterthought. If you don't love her or want to be with her anymore then tell her. If you do then from a woman who has been in this particular position, go get her favorite flowers, chocolate, and wine(if she drinks). Run a bath and pick out a dress for her to wear and take her to her favorite restaurant! We don't ask for much. Trust me buying her favorite flowers once a month and telling her she looks beautiful once/twice a week and spending time with her doing whatever will change a lot and you will see a huge difference. You would be surprised by how many issues can be fixed by making her feel loved! I wish you luck. Oh and you are YTA but a soft one.", "Would it kill you to send her flowers every once in a while? No.\n\nIf you need to feel more appreciated, you should communicate that to her, not childishly punish her by icing her out.\n\nI truly feel there is no love here, and I feel so very sorry for your wife and kids. You’ve constructively left them.", "I do", "“I thought it was enough” will be his statement in the divorce proceedings. Meanwhile she was telling him for years all he needed.", "Well, aren’t you father of the year.", "YTA. You should not work overtime on your wife's bday. That is just a given.\nAlso you said you live comfortably so why do you work OT at all???? You should go home on time and be part of the family. Like driving the kids to activities, spending time with your wife. You prioritize work and you will regret it. \nYou work to live, you shouldnt live to work. Find a job that gives you the freedom to be at home on time. To eat with your family daily and not just in weekends. Your wife is most of the week a single mum with you just being there on weekends. You will lose her if you do dont prioritize your family", "Info: why do you work so much overtime? \n\nYou previously said you don't need the money so why aren't you prioritising time with your family.", "YTA.  But not just for this one thing.  You mention working routinely at least twice a week as late at 7:00--9:00pm, but that over the last two weeks you worked eight days until 9:00pm.  Which is it?  I think if you are honest, it is a lot more than 2 days on average a week.\n\nYou definitely were an a-hole for not spending time with the family on your wife's actual birthday even though you did things for her over the weekend.  Why?  Because you did not set that expectation beforehand . . . likely because you knew what her response would be.  You preferred to ask for forgiveness, rather than permission.\n\nHowever, the worst issue here is not what you did on your wife's birthday.  It is that you are putting time and money ahead of spending time with your family on a routine basis.  You are trading whatever that money might buy you for something that you can never get back when your children grow up.  You will regret this decision.  I can guarantee it.  I am on the other side of it and know.", "YTA.\n\nHow is she working full time from home and taking care of 4 kids and take them to activites in the evening/night? Are you helping out with the kids at all or is it just too convenient to work till 9:00 at night and not be bothered at all?\n\nAnd then she has to take the kids alone out for dinner. What a birthday.", "Man, she loves you and wants to spend more time with you, because she loves you! You are working too much. Maybe you don't realize it, but for a partnership to work, there need to be time spent together. YTA unfortunately. You hurt your wife implying work is more important than her. I get you celebrated the weekend prior, but I'm sure just getting home on time and spending time together would have meant a lot for her.", "YTA.\n\"Oh we had dinner a few days prior so I'm just gonna do OT on her actual birthday while she's handling all 4 kids alone by herself\". It's ONE day and you couldn't ask to be home on time? Even to just spend time with her, take over the kids activities and dinner so she can relax, feel taken care of etc? Meanwhile you're like \"but but... But the dinner few days ago??\". How clueless are you.", "YTA. \n\nFrom a divorced woman to an oblivious stranger clearly not getting it…\n\n*listen to what she’s trying to tell you.*", ".... \n\n\nFor two weeks she did every dinner and works fulltime. \n\n\nYou making dinner one night on a weekend is a brithday treat? \n\n\nLike... do I read that correctly? \n\n\n\nYTA", "YTA low effort. You did a “good enough” birthday not a “ I want to make you feel special” birthday. That’s what she tried  to tell you before and after but alas you are still here asking. \n\nBirthdays are celebrated the day of in my family,  not the weekend before or after when it’s more convenient for everyone else except the birthday celebrant.", "YTA. Look up \"Walking Wife Syndrome,\" because you're on the precipice of it.\n\nAnd remember, no one wishes they had spent more time racking up overtime hours on their deathbed.", "So she’s only worth of dinner yippie! It sounds like you don’t even wanna be around her or even the kids. I think you should just let her go so she can find someone who cares about her because you obviously do not. It’ll hurt her but in the long run she’s still young enough to go find someone who loves her. Are you really working late or are you spending time with someone else that’s what I would think.", "Dude, I’m going to be blunt. YTA. Big time. Who tf cares about your overtime. You wife is essentially working two full time jobs (ie doing all the child minding at night while you stay at work for overtime that you comment you don’t need because you live comfortably). All she asked was that you prioritize her on her actual bday, which you say you could do by just letting your boss know, which you refuse to do. \n\nI’m going to assume that you actually like your wife and cherish your marriage, so listen to me when I say this: your wife is communicating EXACTLY what she wants from you, but you refuse to tell the simple things she is asking. You need to change how you do things, or don’t be surprise that the minute your children turn 18, she will serve you with divorce papers.", "Buddy, read this: https://matthewfray.com/2021/05/25/what-it-means-when-your-partners-says-you-always-make-everything-about-you/\n\nYTA", "YTA\n\nI'm surprised you even ask! It was her birthday! You knew she already asked you to consider family time more and oit of all days you chose her birthday to work late.\n\nAnd no,  it doesn't matter that you did a little bit for her on the weekend. You did NOTHING on her birthday.\n\nLearn to get your priorities straight. If you continue like this you will end up alone.", "YTA she was trying to tell you that she wanted to feel special on her birthday and to be acknowledged and made a priority. You hljust told her that her birthday isn't important abd you rather do OT", "YTA. Perhaps she deserved a bit of a break from the kids and other responsibilities on her special day. You admit you stay late at work frequently and that in your absense, she's the one handling everything having to do with the kids/home. But you \"help\" sometimes, supposedly. But not at all in the last two weeks since you say you stayed late at work every day. Nevermind the fact that both of your \"gifts\" to her also benefited you equally. \n\nShe spent her birthday carting the kids around to their activities which is definitely something you could've done instead, had you asked for the time off. And then she would've been free to do whatever she wanted for her actual birthday. Which I assume would be staying home to rest. Because in the two straight weeks that you worked late, she didn't get any kind of a break or time to herself. Again, YTA.", "I don’t understand why she’s still with you. YTA", "Hope the OT for the day was worth it.\n\nYTA", "Yta, and anyone who thinks this is just about a birthday may need to think long and hard about their own relationships.", "YTA because you should know your wife’s birthday is important. That doing the birthday tasks ahead of time doesn’t change the fact that her actual birthday should have been a priority to you. And she shouldn’t have to tell you.", "YTA what a disappointing husband you must be.", "YTA; at this point, you have 4 kids together and have been married for how many years? You should know how she expects to be shown love and how to make her feel special. It sounds like she wanted you to be home on time to go to dinner as a family- that isn’t a grand gesture. At the very least, you could have asked her.", "YTA but you'll be enjoying your single men's condo soon.", "YTA. \n\nFor the last two weeks straight, and far likely much longer, she has done every school pick up, dinner, after school activity, and bedtime by herself. She is the one who has dealt with over tired kids, school problems, dislikes of dinner, homework, etc. You haven't been appreciating her. And yet, on her birthday, the day that most people are celebrated, it was yet again up to her to do everything on her own.", "YTA. Did you at least get her a card? Wish her a happy birthday? Did you get her a gift?", "Yeah YTA. It really really sounds like you aren’t taking into account how your late nights may be affecting your wife.", "YTA it might have been nice for her to have the evening off and you taking the kids to their activities just once so she could have relaxed on her birthday", "Oh man, YTA.  My hubs did this to me and karma got him back good.  You'd better buy her a cake or something and apologize profusely.", "YTA for your wife working full time and also taking care of four children by herself. Also for not caring about what she wants for her birthday.", "YTA. My father prioritized OT at his job to the extent he missed my college graduation. Years later he expressed regret and said he wished he had attended my graduation and other family activities.", "100% YTA, my friend. Both for the fact that you did not come up with the idea yourself, that she actually might like you to BE THERE on her birthday, but also for the fact that she admits to you she feels neglected and you just shrug it off and say you like the extra money. That is just SO wrong. I'm not even going to discuss the fact that you both work full time and you're still letting her do everything around the house and with the kids.", "YTA\n\n>I’d rather keep working them knowing that if I need out on time any day I just have to tell them and it’s not a problem\n\nThen take the day off if it's no issue.\n\nINFO: \n>I took her out for dinner on Saturday and our kids and I made her dinner Sunday. \n\nWhat kind of dinner? \"I made her dinner Sunday\" implies that you don't do this often and this is a \"gift\" to her. \n\nYou said you could have easily taken the day off for her birthday, but you thought a dinner date was enough for a birthday gift. Maybe she wanted to spend some quality time with just her husband on her birthday. Maybe she wanted to lie in bed with you doing *nothing* while the kids were at school. Maybe she wanted to just be *with you* on her birthday.\n\nMaybe she just wanted a little more effort from her husband other than feeding her twice. Some effort to show you care to go above and beyond the BARE MINIMUM of a birthday.", "YTA for assuming & not communicating or asking.", "YTA...as I've said in the two replies I've done, if you want a woman who feels like what you did was enough, find one. If you want to keep this woman, step it up.", "YTA. Dude, you need to start showing her you care and you also need to start pulling your weight.", "YTA. I am going to be a little harsh on you bc I am in this situation like a decade later as the kid and I currently don’t really speak to my father aside from hellos/goodbyes since we live in the same house and then arguing in family therapy. He constantly chose work over my mom and I and made it very clear we were not a priority which is exactly what you are doing. Like cmon dude. It’s your wife’s birthday. If it’s not such a big deal to ask to go home early on a specific day you sure as hell do it on important dates like birthdays/anniversaries. My parents are on the verge of divorce and I am likely gonna go nc with my father bc he could not get his act together. You have a chance to get it together and start prioritizing your family. Please take it. Be there for your family, they want and need you. That should make you feel good.", "YTA… there is a huge communication issue. Since married I learned that I need to verbally explain events and priorities. If I need to work late, I let the SO know before actual event. \n\nFor your case, you should have informed her that you are scheduled to work late on her birthday. If she has an issue she should tell you not to do it. You assumed she can read between the lines that treating her out for dinner on weekend would cover for it. And didn’t tell her until last minute you were working late. So YTA here\n\nIn a situation where you told her the purpose of the dinner and then it may change to everyone sucks. But that isn’t the case here", "YTA\n\nShe's also working and picking up the slack at home for you. Asking you to leave earlier is a way of saying this is too much. You may feel the OT is worth it, but she doesn't.\n\nAnd using her bday for something she is already unhappy about is insult to injury. If you'd like to stay married, start making an effort here to respect her feelings.\n\nMaybe, just maybe, even if you didn't plan something special, she didn't want to be doing all the household chores herself again on her own birthday- hence the taking  the kids out. She didn't want to run around and cook.", "Sorry, but YTA. You could have had the day/evening off, but didn't think it was necessary.", "YTA-   \n\n\nThere is a Taylor Swift song that talks about the breakdown of a relationship (I know shocking right!) But its always stuck out to me as to me, one of her more meaningful lyrics.   \n\n\nIts better to listen to it it, but he says \"You never gave a warning sign\" and she says \"I gave so many signs\"\n\nThis is you OP. She's giving you warning signs you're still playing this game that when she says \"Read these papers, they are me leaving you\" you are going to act surprised.", "YTA. Even if both of you didn't want to go out again that day you could have at least be back on time to eat some birthday cake, order from a delivery service or something and all in all just have a nice day as a family. If your wife continously says you, that you're working too much you should start to listen to her and understand what she's saying you.", "Edited to change my vote after reading that OP knows that his wife loves her birthday. So YTA. Also it looks like there's some passive aggressiveness going on, OP not showing appreciation for what his wife does because he didn't feel appreciated when he did most of the housework.\nOP, I think your wife is sending you clear messages about the fact that you are prioritising work over family and that is were you are the asshole. You finish work late because you're short staffed so she naturally has to take care of the kids and all activities on her own after her own work day and it doesn't make you blink? You should really take a step back and look around, you may end up losing your family.", "Telling someone they're overreacting rarely goes over well.\n\nYTA", "This is a moment where you need to ask yourself, do I want to be right, or do I want to be happy?\n\nBecause however you are rationalizing your decisions and behavior, your wife, the person you pledged to love and support, is telling you she was hurt and unhappy. So you can either fight with her to invalidate her feelings with the \"logic\" behind your decision, or you can respect and empathize with her feelings, SEE her, and do better going forward. One path leads to likely divorce, and the other to a happier marriage.\n\nChoose wisely. \n\nYTA.", "Wow she also works FT and she has to do all the kid and housework ? Mmmm sorry bud YTA here", "YTA dude.", "YTA\n\nYour wife just wanted to be made important on her actual birthday. Made feel special. But you chose to work more OT instead.\n\nTaking her out to eat over the weekend was nice, and so was cooking one day. But does it really make her feel special? She does that every other day of the week while you work OT.\n\nThe real issue is you are putting work above your family. She basically is a single mom at this point with all the OT you are working. You might want to be careful of how you proceed from now on, because she might just decide she don't need a neglectful husband anymore, and seek out a divorce. I mean after all she is doing it all alone now.\n\nA job is not more important that your family. There are so many jobs out there, but you only have one family. And you are wasting your time with them over a job, and making the job more important. You are missing out on so much that you can never get back.", "YTA. I’m sure your divorce lawyer will appreciate you!", "YTA. However, there just needs to be better communication between the two of you. A woman wants to be pampered (and usually get lucky) three times a year: birthday, Valentine’s Day, and Christmas. Get your act together for those three days at least bro.", "YTA and also a terrible husband and father, prioritising your work (that you can ask for lighter hours, as you stated) instead of your WIFE on her BIRTHDAY it's ridiculous", "What's funny to me is that you've spent more time defending your stance than you've probably spent alone time with your spouse in the last month.", "Based on the post I was going to call soft Y T A. After seeing OP’s comments though, HUGE YTA.", "This is less are you an AH and more, can you maintain/save your marriage?\n\nYour wife is explicitly communicating her needs for your relationship and marriage. You’re super lucky, a lot of couples don’t communicate this. It’s like the warning light on the dashboard that it’s running low on fuel and topping it up once isn’t enough.\n\nYou need to be putting in regular effort if you don’t want to come home to a “surprise divorce”.\n\nEven if you have to schedule a regular date night that is “no overtime under any circumstances” eg every Thursday.\n\nWhat would you regret in 20 years? Losing your relationship or that you didn’t take more overtime?\n\nSo for that reason soft YTA.", "Would you be fine if your wife handled your birthday the way you handled hers? If you can answer that with an honest \"yes\" because you don't think that a birthday is that important than I'd give you a NAH. But if you aren't as relaxed about your birthday then YTA.", "dude, read the room. Your wife misses you and wants to have time together. This isn't about her birthday so much as it's about you never being home. NAH, but get out early one night this week and spend some time with your wife. Let her know you miss her too.", "NTA you did something, made an effort, she had an expectation of multiple special birthday experiences every year… this is not reality.", "NAH this was just poor communication. She should have communicated to you her expectations for her actual birthday. You should have communicated to her that you were going to be able to make it home earlier. Also by now you should have an idea of what your SO expects from birthdays and if the actual day itself is more important to her.", "NTA.  I honestly am dumbfounded people have said YTA.  Hopefully you wont take the YTA to heart, even if they are the majority.  Remember, the masses are not always correct.  The majority used to believe the earth was flat and would KILL people who disagreed.\n\nI agree with you 100%.  You remembered her birthday, you planned to celebrate her birthday early,  you did celebrate her birthday early. You acknowledged her ON her birthday.\n\nCannot comprehend why many adults still focus and prioritize their birthdays expecting &demanding attention & celebration as if it were a national holiday.  It seems very self-centered inflexible and entitled to me.  Many spouses dont remember their spouse's birthday, they plan  nothing and do nothing. Dont even acknowledge it.   But that is not what happened in your situation.\n\nAlso,.the fact that you are short handed at work, even if you had asked to not work late that date, things happen unexpectedly and sometimes people are called in to work when off, and sometimes people who are promised to leave early, cannot because something unexpectedly happens that cannot be planned in advance. God forbid how she would have reacted if that had happened.\n\nIt is better to celebrate it in advance to assure she is acknowledged and celebrated rather than promise & plan to celebrate on actual birthday and then have something arise, at work, beyond your control that causes you to not be able to celebrate on her BD.  \n\nI think she as an adult an should understand this, and model appropriate behavior for your kids,.rather than teaching them to be unappreciative , inflexible, and entitled.", "Ummmm tough one but because we’re all adults and she knows what your work schedule has been like AND you celebrated on the weekend, NTA.  You did not ignore her birthday.", "NTA. Your wife is an adult. Birthdays aren’t that important in the grand scheme of things. You took her out for dinner and cooked another day as well. She is overreacting. It’s not as though you ignored her birthday. She is acting a little spoilt tbh.", "NTA. I always find it amazing how grown adults can care so much about a birthday. Yes, it’s something to be celebrated…but you’re not 5. Get over it. You have a family, and people are busy. Your birthday was not forgotten, it was just celebrated on the weekend. It’s understandable that during the week, work happens. Just get over your birthday already. Geez.", "NTA.  You planned 2 different events, just not on the actual day.  It's to bad she wasn't happy with the thought that went into that", "Nta who wants to celebrate getting older. I for one don't, and it's not like you forgot completely.  I work my husband's birthday and he works mine. The only birthday that we both take off is our sons, we make the day about him.", "YTA.", "Yta", "YTA", "YTA - she's already expressed that how many late nights you work bothers her, and you continue to do so up to and including her birthday.\n\nIf you keep going this way, this is the beginning of the end. And I bet you won't even see it coming.", "You seem like one of those guys who thinks bringing in a check is how you provide and contribute to your family. It’s not. You have to be present and engaged. The only reason this mindset worked in previous generations is because women couldn’t have a checking account of their own or a credit card. Wives were trapped. \n\nIt’s 2022, your wife can open her own account at the bank and take out a credit card. Divorce is expensive, but happiness is worth it. \n\nThis is a wake up call. Answer it. \n\nYTA", "YTA, neither her nor the kids have seen you much for the last couple of weeks and you have left all the childcare and household responsibilities to her.  My dad quit his job because my little sister didn’t know who he was when he came home at a reasonable hour one day.", "Sorry, dude, but YTA. If you can tell your boss that you can't work until 9:30 for a specific day, you should've done this. Damn right your wife is gonna be upset.", "YTA. Sorry, it’s all well and good doing something over the weekend but you should have made the effort for the actual birthday. Work is secondary to relationship and even when you had the opportunity to be there, you decided not to so yeah… YTA.", "YTA and there’s no such thing as a company being short people “right now.” Being understaffed is never a temporary issue. They just expect you to keep working overtime. So if you’re working extra to do the company a favor or any other reason beyond the money, you’re not just an AH, you’re gullible and naive too.", "YTA. You have to make time for your partner, and it should be a regular thing. That you aren't even willing to come home on time on her birthday (her actual birthday, when she asked, even if you did stuff that weekend) must have hurt her a lot, because you're putting work before her. \n\nThis is a losing argument: \n\n>I said that taking her to dinner and making her dinner over the weekend was all I planned to do and I didn’t think I needed to leave on time that day.\n\nNo one wants to feel like a simple dinner and making dinner one night is \"all [you] planned to do\" for them. That's treating her like a time punch - well, you put in a bit of time. Relationship maintenance isn't a one-and-done deal. It's continual. And you've been dropping the ball for a while, so getting that little bit of extra time right now probably meant a lot to her. \n\nWhen she asks for time on her birthday, give her that time. Give her your attention. Don't take for granted that she wants you until she no longer wants you.", "OK listen, doing the bare minimum is not enough. It is like you do it just so you can say you yourself you did something.\n\nYou should listen more and make the people you love feel wanted and appreciated. YTA here, even if you had good intentions", "Info: how does your wife feel about her birthday every year?", "Soft YTA - Seems like your wife might be trying to tell you she misses you without making you feel guilty about it.", "ETA.  She could have communicated that she'd like something done on her birthday or asked.  She is also an adult with a birthday during the week day.   Even as a kid, I knew my birthday would be celebrated on the weekend when my parents had time for activities.  Day of maybe some balloons or card.  \n\nHe knows how she is on her birthday.  He could have requested an earlier day and just planned to take the kids to their activities instead of her or done a small gesture.   Does the family need all the OT money? Or is he planning on using the extra money for a family vacation?", "Nta. You have kids and a job. If your family needs the money that comes first. You celebrated her birthday it’s not like you forgot", "INFO:\n\nWhat does your wife do for you on your birthday?", "So your wife works full time and does all the work to raise your 4 kids? Unless you might be around to help out some? But only when you feel like asking for the time? Yta. Be a partner to your wife and step it up", "NTA it is literally just another day", "YTA. You chose overtime over your wife's birthday and you don't even have the excuse that you're struggling financially. You just showed her you are willing to do the bare minimum and that's it. You couldn't even let her be off kid duty on her damn birthday.", "\nIF for previous birthdays, you've been away as well, and she never even complained once, you're fine. Expectations were set, and she should've said something. \n\nOtherwise...... YTA\n\nLook, personally, I don't mind one bit to celebrate on another day. BUT if my partner only mentioned **on the morning of my birthday** that they'd be working late?  Yeah, it would feel weird, and tell me I'm *very* unimportant to them.\n\nIn this case, where you already celebrated, it really IS the thought that counts. **You did not think.**  You agreed on a lot of OT, and you either did not *realise* it was her birthday,  (bad) or you didn't *care* it was on her birthday. (worse) \n\nYou also thought her asking about the OT was in general. It was not. She was asking about her birthday without mentioning it, so you could seem attentive and considerate. You failed. \n\n>if I need out on time any day I just have to tell them and it’s not a problem\n\nShe thought you understood, but wanted to surprise her. She got her hopes up, and that hurts even more", "YTA when are you raising your kids? Why does the parenting only fall on her?", "Full YTA \nYou chose money over your wife's bday. Sure you celebrated early, but she obviously felt the day of was important too. I've been in this situation. You made her feel like her birthday wasn't importantby not spending time with her on her actual birthday", "Everyone Sucks -  LACK of Communication is the almost always the problem. Both of you should have explained your expectations prior to the day.", "You already celebrated her birthday twice so I think you did show thoughtfulness.  She could have told you where she was so you could meet them there. If this were your child's birthday it would be more important to be there because they are young and may not understamd.", "Your wife is 39, not 12. Birthdays aren't something that you should be making a big deal about at that age except maybe a big milestone birthday. You did what you could for her on the weekend because life is busy during the week and you can't put things on hold every time she makes another trip around the sun. NTA.", "INFO: what part of childcare do you take on? Because it sounds like you both work full time but your wife is the only one who handles all of the care work when your kids get home from school. What do you do when your kids have a game after school? Do you show up for school events like assemblies and plays? How often do you actually show up on time to make dinner? At this point, she probably would have more free time and would have to do less childcare/home care/cooking after her work day if you guys divorced. Then at the very least she would get a day or two off during the week.", "YTA. I hope this is a wake up call for you. You need to prioritize your wife, before she becomes your ex wife.", "YTA - it’s not just about her bday - you are neglecting your family", "YTA\n\nI hope your wife see's this realises she can do better and leaves your sorry ass.\nYou not only hold a grudge because you felt unappreciated and didn't tell her but when she tell you you become spiteful and don't care.\nWhat's the point if being married if you're basically living separate lives what do you bring to the relationship? Nothing as she does everything and earns twice as much as you so what exactly are you there for? As you don't do anything nice for her, you seem to rather avoid her then spend time with her so what's the point seems like your already divorced already with how your acting. \n\nYour not single grow up and fix your relationship before she leaves you because the way things are going she will.", "YTA\n\nHer birthday is obviously important to her and the fact that you didn't prioritize it is sad. \n\nMy boyfriend hates his birthday but we both still take the day off so we can sleep in and spend time together.", "YTA. You're OK working ot, but she's the one that has to do everything while you are. Plus, sounds like you're missing out on a lot of time with your kids. If OT is needed to make your budget work, maybe you should look at your budget. \n\nOn your wife's birthday you expected her to be the taxi, childcare, and meal planner. That sucks. \n\nYour wife plans and provides for your family 21 meals a week, and you think providing 2 is a gift?\n\nYou need to send her on a trip and see what is like to work full time while dealing with 4 kids. That might help you appreciate her", "YTA Everytime you choose to work overtime? You FORCE her to work overtime.  That is *if* you actually parent your kids or do your share of the chores (I am bettimg you don't).  Your \"birthday present\" was you slacking off less than normal. Think about that. Your gift to her was you being less of an AH than normal. Wow.", "YTA. For the simple reason you assumed and didn’t actually ask. It would have costed you nothing to check with her and take time off. You essentially acted like OT you could always turn down according to you was more important than her for no reason.", "It’s a YTA from me, sorry. I think if you want to celebrate someone’s birthday early, you need to let them in on the plan and make sure you have their consent. You can’t just declare your wife’s bday celebration was days before her bday (although it’s great that you made dinner). It sounds like that wasn’t your plan either and that the OT just presented a better opportunity than being with your wife. I’d have hurt feelings too", "YTA. She's right. In the future make sure you are home early on her birthday and the kids birthdays.", "YTA biggly\nYour \"gift\" was what normal people consider a normal chore that one should as a household member. You are shirking your responsibility as a parent and partner when you stay out late. The fact that even on your wife's birthday you can't be expected to do more than the bare minimum shows how much you take her for granted.", "YTA\nYou like doing the OT , you want to avoid family life", "YTA. Family is more important than work.", "I'm going to say soft YTA. \n\nWhen your wife checked in with you about your OT, did you ever ask her how SHE was doing? Maybe she is tired of always taking the kids places and she would like a break? \"Usually the kids have activities at night and she’s not home anyway.\" So she has never really had a night off or a night to relax. \n\nIf you are going to continue working OT all the time, you need to be checking in with her and making sure she is doing OK. Maybe you two reach an agreement that you can take OT 2 nights a week but not more. Maybe there are times that you work OT for 2 weeks straight, then you take some evenings off to be with your family.  \n\nI mean, she is working full time and raising 4 kids. She must be exhausted.", "Yeah, YTA - On her actual birthday, no matter what you did for her in the days leading up to it, I'm sure she still wanted to spend her actual birthday with her husband.  That's not an unreasonable request, is it?\n\nYou couldn't work one regular day to be with her?  You're showing her she doesn't matter to you, that you'll only be there for her when it's convenient for you, if you have absolutely nothing else you can do.\n\nYou actively chose to work longer when you didn't have to.  That sends a pretty loud message to her.", "YTA", "I guess I just have shitty expectations because if my birthday was celebrated two days before and my husband had to work overtime on the actual day, I’m just grateful we celebrated before.", "YTA this isn’t so much about her birthday but about spending time with the family. She gave you a hint asking if you were ok with the OT \nBesides you made her feel like her birthday is not a special occasion basically chose work over her", "I'm going with ESH, it sounds like more communication should have been done on both sides. I don't care about celebrating my birthday on the day or even at all, so dinner would be more than enough, even if it wasn't the day of. \nYou should have planned and asked her about her birthday expectations. She should have also verbalized any expectations she might have for her birthday.", "YTA", "Big YTA for this and everything in the comments- you couldn’t be more blind if you lost your eyes.", "NTA. We never celebrate a birthday on a workday in our family. The weekend before or after whichever is closer. \n\nI think you did plenty.", "YTA!\n\nYou know your wife likes to celebrate her birthday and you thought doing the bare minimum over the weekend should be good enough for her….. my husband works a ton of OT too (I also work full time) and every single weekend he does much more than what you did on her birthday weekend and I clearly don’t have a weekly birthday. \n\nI actually feel sorry for your wife if this is your way of going above and beyond.", "YTA\n\nYou clearly didn't care about how she felt or listen to what she said. You met your bare minimum quota that your set for yourself for your wife's birthday. \n\nListen to her and be a better husband.", "YTA. You are leaving too much on your wife. She does everything! EVERYTHING! She works, cooks, cleans, takes kids to activities. What do you do? Just work? “Help” around the house every now and then? You don’t see caring for your house or your children as part of your job so you push it off on your wife, but it is your job. I hope the overtime is worth your family.", "Yta. You might not want time off but what about your wife? She's not getting any time off between taking care of the kids in her own job. Because you want to be at work more.", "YTA ots her birthday, but honestly stop working like that. You are gonna miss everything, you will look up one day and your kids will be grown and you will have missed it. Slow down and enjoy your family!", "NTA!  Your wife is 39, not 4.   Most people over 21 don’t care enough about their birthdays to feel the need to celebrate on the exact day.  You took her out on the weekend.   I would have thought this was enough.\n\nOkay, I understand that some people feel differently. I once had a coworker (we were both in our 60s) who whined about not being able to take her birthday off. It was the first time she’d ever had to work on her birthday.  I was a bit shocked.  I think I worked on my 18th and who cares?   \n\nI’m not saying that OPs wife is wrong for wanting him to prioritize her birthday, but I think she’s in the minority and she needed to be more specific.   There’s a difference between \"I want you to start spending more time at home,\" and \"I want special attention on the day of my birthday.\"", "NTA  She's 39 not 3", "NAH. Communication on wife's part,and understanding on OPs part", "What in the heck is wrong with all these grown ass people and their obsession with their birthday?", "NTA. You did something special for her albeit not on her birthday.", "Not TA here, doesn't sound like anybody. \nSounds like you both need a vacation. \nSorry your woman isn't happy, I hope you figure out how to make her feel appreciated again. Celebrating her birthday in advance, and working on her actual birthday doesn't sound like an inconsiderate move at all. I've just seen a lot of people on here being a bit cold to you, and I think that you deserve to feel appreciated as well.", "Nope. NTA \n\nMost adults, and certainly most parents, realize the actual day of a holiday/event don’t always fit life routines. \n\nPoor communication regarding the need to be on time, after a great weekend, is shared equally.", "YTA but small one\n\nYou did some nice things for her birthday on the weekend but you made the one huge mistake all us dudes make. You assumed you knew what she was thinking!\n\nThis could have all been avoided by just asking what she wanted to do on her actual bday. You said she works and runs the kids around but you didn't know that's what she was doing on her bday. You should have just asked \"Hey need me to leave early so we can get dinner with the kids\" or anything even close to that would have shown her you cared. Yes the grand gesture of making her a birthday weekend was nice but you're married to her, you know her better than anyone else so you know what she would have wanted more than us people of reddit on her actual bday.\n\nApologize and ask to make it up to her, you were in the wrong.", "NTA. Apparently taking her out to dinner and making her dinner don’t make it.  She is a tough one. Earning money is also a good idea.", "NAH\n\nReading through all of your posts, it seems clear that both you and your spouse shoulder the majority of the household and child care responsibilities based on the current job situation. But you both say the same things. I would like to be appreciated when I am shouldering extra responsibility. I would like to be acknowledged when it's my special day. I think this is an issue of communication.\nSit down together and talk about feelings., not an even division of labor, not a logical rationale regarding how to celebrate someone's birthday. How each of you feel and what it takes to make each of you feel appreciated.\nAnd no one says no to a belated birthday celebration. Take her out to her favorite restaurant just the two of you. Have a birthday card and a nice gift ready for her. When you show your wife appreciation, it pays huge dividends", "I see both sides being fair. But being a mom I feel as though she was wanting you to possible take the kids and what not to their activities on her birthday. So she can actually enjoy her time. Even though you did do all them things days before. Which are really nice and thoughtful. She was probably ok with that because she knew you probably couldnt get the whole day to do stuff. But the activitities with the kids could of been taken care of by you. So she can have a moment either alone or to just do what she wanted for a few hours. I don't think you completely a asshole. You had good intentions. Us women just like feeling special on our actual birthday aswell. Even if you did stuff in advanced.", "I’m going to be the odd one and say, NTA. You had a very nice time over the weekend and that should be enough. Goodness, she’s not 12.  As far as the appreciation, I don’t get when someone needs constant reinsurance that they’re doing a “good” job, particularly since you said role’s recently switched.  Did she constantly tell you how much she appreciated all you did?  I doubt.", "NAH this is a miscommunication issue. You should have made it clear to her that you weren't planning to celebrate on her actual birthday, she could have made it clear that she wanted that. I'd just apologize and talk about expectations for next time (preferably at different times)", "You had already celebrated her bday. I’ve never understood people that think they get a month or week for their bday. It’s just another day. You have bills to pay and family to raise. Nta", "NTA You were already doing something for her birthday. If she wanted more, she should have told you, not expected you to read her mind. It's not hard to use words.", "ESH. You should have at the very least bought her flowers for her birthday. Your wife on the other hand should have told you that she expected you to do something for her on her actual birthday not the weekend before. Next year buy one of those huge signs for the front yard saying happy 40th.😉", "NTA\n\nYou took her out to dinner for her birthday AND the next day you made her a nice dinner at home.", "Nta, you can’t read minds", "ESH. It sounds like miscommunication. She had expectations she placed on you without your knowledge, and you didn't clarify how she would like to spend her birthday. Apologize and communicate better in the future. Best wishes!", "YTA. Have you considered how much extra burden you’re putting on your wife by leaving her alone to take care of the kids herself on these late nights? When she brought it up, you don’t seem to have asked her if she was ok, just said you’re fine with it. The birthday is just a bigger symptom of how you are letting work overtake your family life.", "I have to work OT, I cannot tell my job I’m just not working it at all. But I can tell them some specific days I can’t. Obviously I’m understanding now I should have done that for my wife’s birthday", "I think OP is a full YTA. The wife takes the kids to activities and cooks dinner after a full work day. When OP chooses to work OT, 100% of the childcare and commuting falls on her. OP didn't even consider to give her a break on her bday. \n\nEdit: The reality is, he treated her to a dinner that benefitted the entite family on Saturday. On Sunday, he took care of one night's cooking. OP's gift, in reality, was just taking care of a chore for two nights.", "Not to mention he’s an absentee father. When do those kids see their dad? Just weekends? Growing up like that let me say, thats no fun. My dad got 1 day off a week and worked 14+ hours a day the other 6. We barely have a relationship.\n\nNot to mention his marital relationship? His wife is basically a single mom with a husband on weekends.", "Do we know if the OT is unnecessary? He doesn’t specify in the OP- the OT could be the difference between breathing room in the budget to do dinners out and having to stay home for special occasions. Not a bad thing, but she can’t have her cake and eat it too.", "They celebrated her birthday over a two day period.  Sometimes your birthday falls on a day where it's not practical to celebrate.  Mine fell on a Wednesday this year.  We celebrated it on the Saturday afterward where we were not rushed and had no distractions.", "she is an adult. Birthdays don't much matter to adults. He did his bit, the extra money helps the WHOLE FAMILY. \n\n&#x200B;\n\nhe is NTA, she needs to grow up and consider the whole family and not just herself.", "He took her out and made her dinner for her birthday, just because it wasn't on the actual day doesn't mean he doesn't care.  He obviously put some thought into it.", "That's more of a NAH since it was simply a communication breakdown. \n\nIt's a case where OP thought he was celebrating her on a different day and her not saying that's enough for her", "Nah. NTA. Most people over 21 that I talk to dont even celebrate their birthdays unless they enter a new decade. Like 30 40 50. Birthdays aren't that important to most people. It seems OP is of that same mind.", "I have to work some Ot for my job, it’s been a lot lately because we lost some people. I don’t mind working it, the extra money is nice. My wife says she doesn’t mind me working it in general, and I’m choosing to believe her because she has no problem telling me when she has an issue- like in this case. \n\nI spend all weekend with my kids and any nights I am home I drive them to their activities. I’m not making excuses here, just filling in some details. I don’t think I’m a bad dad,  maybe just not the best husband right now", "\"If you put your job ahead of your family time many nights of the week, don’t be surprised when you don’t have any relationship with your kids & they think of you like a wallet because the only thing they know about you is that you make money instead of spending time with them.\"\n\nOh damn. Quite the freakin mic drop. I really hopes he sees this and it hits him in the chest.", "This is basically what I came here to say. It's not uncommon for adults with obligations to celebrate events on a weekend instead of on the actual day.\n\nBUT, it has to be agreed upon beforehand especially with things like birthdays.\n\nDouble especially when it's not YOUR birthday, you don't get to make that decision for someone else's birthday without discussing it with them.", "Just to be clear, I don’t voluntarily work OT, I do have to work it, I couldn’t say I’m not working late ever. I just CAN say I need to be out on time on this day. And it’s only a couple nights a week usually, the two weeks straight was not usual", ".... making dinner one time a week on a sunday for his family while she did the other 12 dinners for the family is not \"celebrating her birthday\".", "What a wild and way over the top response. Shes a grown ass woman not a 5 year old child.  He doesnt need to GO ON TIKTOCK (lol wtf). She doesnt need to be a queen for a day. And if she does than this post should be about her, not him. Unbelievably needy and entitled answer.", "There was a two week stretch where I worked late every night because we lost some people. That was not usual. It’s usually 1-2 nights a week.", "Not even early, she asked if he could leave work ON TIME! YTA OP and I hope you realise and change your habits and ways of thinking before it’s too late and she leaves you, because she will if you don’t make her feel loved, appreciated and prioritised", "He has said that they live comfortably. It just sounds like he is avoiding his family with all the extra time at work.", "He's said they live comfortably so I don't think that's an issue. Regardless, he's not much of a father or husband if all he does is work.", "Dude, you way misread this scenario. His wife not only makes significantly more money than him, but she also does the vast majority of the childcare and housework. If anything, SHE is providing the good life for her family and her husband can't be bothered to show her the appreciate she deserves and, by his own admission, has been literally begging for. He didn't work overtime because he needed to support his family, he did it because he would rather be at work than at home spending time with his family or helping his wife around the house.\n\nNotice how the birthday celebration over the weekend benefitted both of them, but when she expects him to be home on time on her bday so she isn't saddled with  all of the housework and childcare responsibilities, he didn't even think to help her for one day?", "I’m a woman and I generally agree with what you’ve written, but the problem here seems to be less about the birthday and more about bigger issues in the relationship. \nPlus, you shouldn’t always assume that women’s lifestyles are always due to their husband’s job.  This is a good example.  He said his wife makes almost double, and isn’t asking him to cut back at work overall because she knows how happy it makes him, despite it leaving her to do almost all of the house, dinner, and kid work after her long day of work.", "Not everyone thinks the same way, some people to have their birthday acknowledge and celebrated. If you don’t, then that’s cool too, but there’s no reason to judge someone who feels differently. \n\nHe has always known that her birthday and Mother’s Day are two days she enjoys celebrating, because she feel those are only two days of the year and he disappointed her. He thought doing the bare minimum on the weekend will make her happy, obviously didn’t.", "Absolutely 100%agree w you.  Cannot comprehend ADULTS who fixate on their BD and expect fanfare and celebration as if it were a national holiday.  Imo, his wife is modeling terrible behavior to their kids.  She is teaching them to inflexible, demanding, unappreciative and self-centered.", "She literally told him that she felt unaprecciated and overwhelmed, and he couldn't take one day for her", "It feels like talking to you (and writing you) is like talking to a wall. You don't have any intentions in understanding where she comes from and you get defensive and kinda gaslight her. \n\nShe feels unappreciated because you prioritize your work and extra hours (that you don't actually need) over your wife and family, and that goes beyond the birthday matter.\n\nYTA", "Do you even care about your wife?", "You should take some time to really imagine what your life would look like without her. What does she do on the daily that you don't even have to think about? How would you get the kids to activities without her?\n\nIt's hard to be happy with someone who doesn't actually give a shit about you. You are taking her for granted and she will be done with it one day.", "x - Above and beyond\n\nx - Decent effort\n\nx - Bare minimum\n\n✓ - What *I* think the bare minimum should be, which is comfortable for me but will not keep the marriage afloat", "It’s not just missing spending time with her on her bday, it’s the adding up of not giving her the time together she really wants with you. She wants to feel prioritized and it’s a must unless you want this relationship to end. Just because you’re married, doesn’t mean you should stop actively pursuing her.\n\nAlso I feel like you should figure out each others love languages. You said that you didn’t feel appreciated when it was you taking care of things around the house or with the kids, but maybe she showed you appreciation without you realizing it. Seems like at least one of hers is quality time, but also shows it differently when giving affection vs receiving. You guys gotta communicate but you also gotta stop with this “oh I took her out once, she should be happy” kind of stuff cuz it’s definitely feeling like you’re not putting enough effort into time with her regularly and it’s adding up. \n\nEdited to add more thoughts in.", "The way you talk about spending time with her sounds like it’s just another task to check off the list and then move on. Like a chore. \nIt doesn’t sound like you actually want to spend time with her, and she can sense that.", "She’s never happy with you because when she voices her feelings, you think a couple of activities will do the trick", "IT'S NOT ABOUT THE BIRTHDAY!!!\n\nShe is literally telling you what she feels. She is overwhelmed with work and kids and having to do all the rest", "Man, not having to cook dinner two nights out of two weeks does not make a celebration. That is not a present that isn’t even a real break. She works too, she’s making dinner and taking care of the kids more then her 50% all you did was take a very small portion of your home responsibility off her shoulders for 2 nights.", "She telling you that she's not ok with you working late every night. So, sit down and ask her if that's what's bothering her and negotiate a solution. I'm sure there's something in between no over time and every night that you can do that will make her feel better. I don't think you're an asshole I think you're trying and didn't take the hint.", "What time do you start work? Coming home at 7/8/9 is that an everyday thing?", "This is probably about more than just her birthday. She probably wants you to help with the kids at home more than she also works full-time.", "YTA. I bet you guys make it one more year at most.", "How is dinner a celebration when you eat it every night? Please explain that to me how it’s supposed to make her feel special", "Dude, it's not about being taken out or \"celebrated twice\" necessarily, she wants quality time. She wants engagement, she wants to feel like she has a partner. I'm fairly sure if you just spent the day having a slightly longer breakfast, sitting in the couch and watching a movie together she would've felt loved and cared for. She's \"never happy with you\" because you're ticking a bare minimum box and getting on with it and one day your box ticking will stop because she'll detach from you completely and you'll still be clueless when this could've been fixed ages ago.\n\nWho do you think will be around when the over time stops and work slows down and comes to a complete halt one day?", "because you're not actually doing anything to lighten her load or help her", "Did you make specific plans for the day of her birthday? (I'm assuming not if you agreed to work late) So if there wasn't something specific planned, maybe she just wanted to spend time with her husband on her birthday. She wanted you to prioritize her and show her that you cared and spend time with her. You were going to voluntarily leave her alone on her birthday? YTA. She's not asking for much here.", "It's not about celebrating x amount of times. She's overwhelmed. Do some fucking parenting instead of all this unnecessary overtime", "Oh my god. \"I did the bare minimum but it wasn't enough\" do you even HEAR yourself?!", ">we celebrated twice\n\nYOU FED HER TWICE. THAT'S IT. From all the information you gave us, you took her out to eat and you made her dinner. Big fucking whoop. That is the bare minimum of celebrating a birthday. \n\nWhy don't you go above and beyond the minimum and show your appreciation towards your wife, because right now, obviously you care more about OT than taking one day off for her.\n\nYour wife is right.", "You should be making dinner a few times a week. That isn't a celebration, it's you getting off your arse for once", "Because you’re only doing enough to not make her sad", "You think: I did something once! That should be enough! \n\nShe thinks: he never does anything! He just did something that one time!\n\nYou have to be consistent. Taking her out once is not sufficient. What are you spending all that OT on if you aren’t taking her on dates?\n\nAlso is making dinner for her celebrating because you never make dinner the rest of the time? That’s not much of a “celebration”", "Google “walkaway wife syndrome” and see where you are with the checklist.  YTA but these things can be fixed with effort and intention.  It sounds like you would both benefit from therapy right now as well.", "Careful, OP. She's telling you that she's unhappy in the marriage. You aren't listening, nor are you working to fix it. She's going to start thinking that maybe she'll be happier without a man who constantly works late and puts his job above his family.", "She’s telling you it’s not enough. Maybe you should listen to her instead of asking a bunch of strangers if she’s wrong. She’s not wrong btw. She’s asking you to come home on time one day to show her that she’s a priority. You decided she isn’t a priority after all. \nShe’s telling you that she’s overwhelmed and under appreciated. \nMaybe you should come home on time a couple of days now and then and take over child care duties and after school activities so she can have a break to do something else. \nYou are choosing to stay at work rather than help with those other duties, leaving her without a choice to do anything else.", "There's a saying that most women will tell you is 100% accurate:\n\nDo what you did to get her and you will not lose her. \n\nYou're going to lose her. She's already given you fair warning. When she STOPS telling you she's overwhelmed and underappreciated is when it's truly over. You'll just think she's ok at that point, and thankful she \"finally shut up about it\".", ">  it makes her feel like I don’t care\n\nI mean... You almost literally said \"I got it over with\". Who is she not to feel that you don't care?", "Do you even like your wife?", "Oof, dude, big yikes. This is how you treat the mother of your children and chosen life partner? I took her out for a dinner to celebrate her birthday, she should shut up now. One dinner to celebrate her birthday isn’t an ongoing show of appreciation for your partner, it’s one date on a special event that is about her individually once a year. Maybe you’re burnt out, maybe you also don’t feel appreciated, but either way this attitude and mindset does not bode well.", "Oooof. \n> I feel like that should have been enough. \n\nYeah she’s going to keep feeling sad and unappreciated until y’all divorce or you change your attitude. YTA.", "So you took action based on what you thought was sufficient? Why not ask your wife what she needs and then work on providing that? Also, going out once doesn’t fix the problem. \n\nI was originally gonna say N A H since neither of you communicated clearly and life happens. Your dismissive attitude about your marriage and disregarding conversation your wife is trying to have with you to fix things is what makes YTA.", "Wow you really don’t like your wife. Just let her go find someone who loves her because the way you talk you don’t even care about her", "Dude are you serious? You took her out on ONE date and that should have been enough?? Try making time for her weekly instead of once.", "Do you like to spend time with your wife? It sounds like you see it a chore.  I think she can feel that from you.", "Did you also give her presents and have a birthday cake too? Cause I would also expected that too \nAlso look up invisible/emotional labor- your wife is most likely burned out from doing it all", "Jesus Christ, you have an ongoing issue *in general* about not giving her enough of your time and effort and you thought doing the bare minimum for her birthday would fix that? My dude, you're about to be served papers if you don't start trying.", "My dude, it sounds like you really need to take some time to focus on making sure to show your wife that she's a priority in your life. It's easy to let things stagnate in a relationship with work, kids, activities, and everything else. But showing your partner she matters to you and that you're glad you're with her takes extra effort in those times.\n\nTaking her out for her birthday is kinda the bare minimum here  - it's just what you do with a partner. She wants to go out with you for things that aren't \"just what you do.\" Acknowledge that she felt that your plan wasn't enough. Whether or not you thought it was is irrelevant, she's told you how she feels - you need to recognize your own role in what made her feel that way and atone for it. \n\nPlan another date with her this month. If money/childcare is a factor, the date doesn't have to be a big production - make time to do something she enjoys together. Make a big deal about it (not a big deal that you're doing it to show her you care, but the event itself). Show her you love her. And then do it again soon. A bonus about planning a date for your partner is that you'll enjoy it too, so it's really worth the effort. \n\nIt's a soft YTA, because it doesn't seem like you were trying to be cruel. It just seems like you didn't fully recognize the problem.", "1 time after years of feeling unappreciated is NOT ENOUGH. \n\nThat 1 time for her birthday is the bare minimum. You have to make her feel appreciated a lot more then that to repair the Damage and hurt feelings.\n\nAnd think about it - if she cooks 99% of the time and you do it 1 time - that’s hardly a birthday gift. That’s just being nice for her. You barely celebrated. Then worked late on purpose.", "You understand that taking the whole family to dinner is NOT a date… right? Like do you get that the parent who you’ve been leaving to be a single parent when she didn’t sign up for that *does not want* to bring her kids on her only fucking date. \n\nWhere did you “plan” this fabulous family dinner… I mean “birthday date” - A nice fancy restaurant your wife would love to try out loves? Or to a family place? \n\nIt’s actually unbelievable that you KNOW she’s complained about this and this is still what you did. It didn’t matter much if we think you are YTA (which you are) you are definitely in the process of losing your wife and you seem fine with that, or completely oblivious, or some amount of both.", "Just because you took her out doesn’t mean you fulfilled what she’s been probably asking for a while. You take her out to a place where it was special to you both. A gift that’s actually meaningful where she can actually feel that you spent the time to think and got her something special. It doesn’t even have it be so extravagant or expensive. Just something that tells her you actually care about her. Honestly I was gonna say you are putting the absolute minimal effort but it sounds like it’s a “chore” for you to go out and celebrate her birthday (it happens ONCE a year.)\n\nEdit: YTA", "Do you really need someone to spell out to you that marriage takes alot of work? Sounds to me like she's expressed how little effort you're making and you're too full of yourself to actually give a shit.", "Just think about your language. Your life partner, the one you asked to be with you forever, the one you fell in love with and to have and raise children with, has told you that she wants to spend more time with you. She loves and cares about you enough to check in with you to make sure you are feeling okay with all this extra work. \nAnd she tells you that she misses you, wants more time with you, doesn’t feel like you prioritize time with her or the family. \nAnd your response is, “I took her out. I feel like that should have been enough”.\n\nReddit loves to talk about red flags, well look at your marriage and really look. Really listen. She, your wife, life partner, mother of your children is telling you want she wants. What she needs. And you feel like a dinner out should have been enough. \n\nI am not trying to bash you at all I just don’t want you to miss is moment because it could be crucial. She will get tired of being rejected. Being pushed aside for work. Of having to handle all kid matters so you can please your bosses and she could decide that she has had enough. I don’t want that and I don’t think you do either. Please try to listen to her and let her know you value her", "Ok well it’s not, she’s telling you it’s not. Now what? Just die on this hill?\n\nIf your boss says the work isn’t complete,  do you look at them and tell them “you feel like I it’s enough ” or do you work until it’s complete? \n\nYou’re feelings don’t matter in this case cuz you aren’t the one hurting. You’re the one causing hurt.", "So, if I may, your comment 'that should have been enough' seems to imply you were basically only doing it to directly satisfy the feedback you'd gotten, whereas from her perspective it's maybe more 'I want OP to WANT to do these things, rather than do them to appease me.' \n\nWhich, having been on both sides of that very conflict with my wife at times, I get it. It's easy to be so underwater with job, kids, life, etc that it's like 'ok if you need me to do something spell it out and I'll do it' and it's added to the list. And then you perform said task more or less like you're checking an item off the to-do list. \n\nIf that's the case here, just...find a way to take some time to decompress some, get your head above water, and have the opportunity to be able to say 'man it'd be really nice to spend time with my wife, AND I AM ABLE TO'", "The family went to a restaurant once and you paid. If you think that's a date, I think you're beyond help.", "😂😂😂 Bless your heart OP. \n\nHopefully the comments under this post will help you see what your wife has been trying to communicate. If not, you'll probably be a divorced, single, co-parent before long. Everything that your wife does, while working a full time job, including cooking and kid drops-offs/pick-ups will suddenly be on you.....", "That is the bare minimum", "Are you listening to her and hearing her? That's the question", "Then do something for her now. Pick a day this week or next, plan a date that requires more thought than a dinner reservation, buy her flowers and a birthday present, and spend an evening engaged with her.", "Actually, those are really really great points. I'm glad you delved into them. Sure, he treated the entire family to two different meals. But those activities aren't unusual from normal daily necessities even though he at least thought to do it. \nBut, on her actual birthday he didn't take any time to consider that she may like a deserved break from the normal and hectic/tiring routine of caring for the household. Maybe she could enjoyed a bath or a book or shit even laying down scrolling social mindlessly. As a mother we sometimes have a lot of guilt for taking the deserved self care. But, a birthday is a day you wouldn't have to. \nHe also seems to not have prioritized any actual quality time with her. If he came home early she possibly could have had time to herself AND quality time with him. Again,doesn't seem their daily life allows for much of. He basically told her in words and actions that she wasn't worth his time. That he'd still rather save his asks for better things. YTA", "Remember when I took you out to dinner two days ago?  That was for your birthday.", "All of this. OP you need to realize that every night you work late and do overtime, you dumped all of your half of the home and child care responsibilities on her. She probably feels like she works full time and raises kids full time almost 100% alone. Or at least 5/7 of the time. That’s 260 days a year your wife has to do EVERYTHING all alone. And you couldn’t come home at a decent time for her birthday. YTA\n\n\nI got exhausted reading this just for your wife", "You deserve an award for this, but all I have is the stupid advertise button.   \n\n\n100% agree that he just took care of a chore for 2 nights which isn't a reward or a present, just the bare minimum one could expect of a parent/ partner", "You don't know if he got her a gift or not. He never said. \n\nI do agree with YTA though. He totally should have not worked late that day", "Oh boo hoo. He's not a TA for working overtime. That's money for their family. So what if childcare falls on her during those times. They are both doing what's best for their family in that moment.  It's odd that you think that OT pay isn't worth getting. Time and half in this economy?", "Oh my god..would you stop? Absentee father? Jesus Christ the comment sections really turn into cesspools when it's a male OP.", "But it’s just one day. He also says he’s “fine” with the OT money, not that he needs it. I doubt allowing out on one day of OT would be that hard on the budget.", "He said it only happens a few times a week normally. So I don't think missing one day of OT to just spend time with her and the family is asking too much. YTA OP.", "The OT is not necessary. Op said so [here](https://www.reddit.com/r/AmItheAsshole/comments/ywt5rw/comment/iwlc6e8/?utm_source=reddit&utm_medium=web2x&context=3).", "It's money that can be used for emergencies, college fund and retirement. There's not such thing as UNNECESSARY money.", "They didn't celebrate over 2 days. He took her out with the kids once. Then he made dinner, a.k.a a normal chore OP's wife does all week long while he does overtime.\n\nShe wasn't asking for a celebration. She just asked her husband to work his normal working hour and be home so he could pick up some slack and fulfill his father/husband duties for once. It seems like it's not too much to ask.............", "I guess I celebrate my birthday every single day, seeing as I eat dinner every day and that's literally all they did for her birthday. She's so lucky.", "“Birthdays don’t much matter to adults”? Did you read the post? His wife said that it matters to her. Clearly she isn’t one of the adults who doesn’t care about her birthday.", "Just because they don’t matter to you doesn’t mean that they don’t matter to other people. When you have children and you’re stressed and you have someone who’s hardly ever home it would’ve been nice if you at least bought her some flowers and a card and set up one of his days off to just spend it with her. Everybody needs that.\n\nHe didn’t even care It seem more like a bother to him –think I’ll just take the complainer out to dinner and that should be enough! He didn’t even care  so for his birthday I hope she does nothing  He could’ve had the kids even make some handmade cards and presented them all together but now doesn’t sound like he likes her too much. He is TA.", "How is asking her husband for *one* early night not considering her family? And birthdays might not matter as much to anadupt, but they still mean something. Being overlooked on your birthday is not a good feeling.", "He is able to do that because she is watching their four kids on her own after her own full time job. Regardless of how much she cares about her birthday, it seems pretty reasonable to ask him to come home in a timely manner and help with the childcare and household one day a year.", ">Birthdays don't much matter to adults.\n\nBirthdays don't matter to a lot of adults. Clearly her birthday matters to her. You don't get the determine what she cares about.", "OP mentionned himself that they are financially welll and that the overtime money is NOT needed, and that it's not enforced by the employer.\n\nSure, birthday don't matter as much when you are an adults, fine. It's not as important, sure.\n\nBut on any given day... imagine asking your SO to be there because it's important to you and that your answer is \"No sorry, I want to do some overtime that is not mandatorily requested by my employer and which money won't impact our finances\".\n\nIt's not about celebrating a birthday. It's about the fact OP choose to be at work again and again (when he don't have to!) while the wife has to handle the 4 kids on her own, and he couldn't even make an exception when she asked.", "Birthdays on the grand scheme of things done matter. But it’s normal to want to spend time with your spouse on your birthday. All she asked was that he come home. That is possibly the most reasonable and easy request you can do for your spouse. Don’t work OT on their bday. \n\nThe wife works to so it doesn’t seem like that one day would make or break their finances.", "\"she is an adult. Birthdays don't much matter to adults.\"\n\nNot true I'm 37. Birthdays are the one day of the year dedicated to a person. Christmas is for the kids/family. Birthdays are an individual celebration. My husband isn't bothered about birthdays, but I am (not in a 'I want the biggest present way',  but in a 'please spend time with me' way). He didn't think much about it at first, but now, he knows it matters to me, so he always has something planned. \nAnd because it matters to me, I make sure to do something nice on his birthday (after years of having Xmas and birthday gifts joined together) so he knows that HE MATTERS to me.", "What an AH thing to say. I'm not fond of my own birthday either but I don't begrudge people who love to celebrate theirs. You don't get to determine what's important to other people.", "It's less about birthday but more about respect, understanding and care which OP seem to possess none of them.", "Not sure that the extra money is buying him what he really thinks it is.  Is it buying him a better relationship with his kids and wife?\n\nHis wife works full-time too, and then comes home to parent full-time, which is a much harder job than 99% of any jobs out there.  If he's getting home that late, he is spending very little \"actual\" time acting as a father, and he admitted that in a 2-week period just before her birthday, he worked 8 days until 9:00pm.\n\nI'm not sure why so many want to trade time with their family to make more money.He does not say that he \"needs\" the OT money.\n\nThe extra money, in the long run, will mean so much less than all the missed opportunities to get to know his kids and emotionally support his wife.", "My birthday matters to me. I take it off every year no matter how tight money is for me!", "Sure, he treated the entire family to two different meals. But those activities aren't unusual from normal daily necessities even though he at least thought to do it. \nBut, on her actual birthday he didn't take any time to consider that she may like a deserved break from the normal and hectic/tiring routine of caring for the household. Maybe she could enjoyed a bath or a book or shit even laying down scrolling social mindlessly. As a mother we sometimes have a lot of guilt for taking the deserved self care. But, a birthday is a day you wouldn't have to. \nHe also seems to not have prioritized any actual quality time with her. If he came home early she possibly could have had time to herself AND quality time with him. Again,doesn't seem their daily life allows for much of. He basically told her in words and actions that she wasn't worth his time. That he'd still rather save his asks for better things.", "Speak for yourself?", "It depends on the family, I stopped celebrating my birthday at like 12 because my family's finances became tight and unpredictable (my dad had had his own business and he had to file bankruptcy) but my SO's family celebrate and gather once a month to celebrate that months birthdays and they also have smaller individual parties to celebrate with friends.\n\n Just because birthdays don't matter to some people does not mean that everyone feels that way.", "But after two weeks of 8 days working until 9:00pm, and then he doesn't even set expectations that he will be working on her birthday.  He consciously chose to ask for forgiveness, rather than permission, in ditching her on her birthday, after she already works full-time too, and is the default parent.  On her birthday.  Schmuck.", "She does that 260 days a year for the kids/family. That's not special. It's the basic necessity for living and providing for a family. She's communicated exactly what she wants (date nights, flowers) and yet OP has done none of that.", "He did one household chore 1 day. That's the bare minimum of being an adult and a parent.", "Shit down voting for being logical... You do understand that your birthday in nothing more then the day your parents had sex and conceived you, so in reality your celebrating that your parents had sex.. Shit, maybe the gifts should go to them..", ">Birthdays aren't that important to most people\n\nIt was clearly to OP's wife and she clearly expressed it.\n\n> It seems OP is of that same mind.\n\nDoesn't matter. It wasn't OP's birthday. It was his wife's birthday and she asked for some help at home on the day on her birthday because it was **important to her**. The fact that OP would rather do unnecessary overtime over taking care of his relationship very much makes him the asshole.", "OP's mindset isn't what matters here. Just because something is unimportant to one person doesn't mean it isn't to another or that they are wrong/stupid of thinking it is important. OP's wife communicated multiple time how she's feeling (undervalued and under-appreciated) and even what she expects (him planning dates, buying her flowers).   \n\n\nOP is an AH cause he's ignoring what she has communicated and said she wants because he doesn't think it's important. That's an AH thing to do and a relationship killer.", "Well it sounds like OPs wife is not of the same mind and she communicated that to him. It doesnt take much to make a person feel extra special for one specific day.", "But wife (and many other people) DOES care about her birthday and has been feeling unappreciated. It doesn’t matter if OP doesn’t care about birthdays (which is your assumption), the fact is his wife does care. When you’re in a relationship, you sometimes need to prioritize your partner’s wants and needs even if they differ from your own. The wife has also been left to deal with childcare and household duties on her own after working a fulltime job (and by OPs admission, OT is not needed). I think a break on her actual birthday is warranted.", "Dude, if she's not a priority, just end it already. Your comments are so tone deaf it's not funny. She's doing everything herself anyway, why does she actually need you around? What exactly is she getting out of this relationship? You don't seem to care about her feelings. You seem to constantly be working late, so she's had to figure out how to handle all the household duties and children's activities without you. And since you aren't around, she gets zero recreational enjoyment or emotional  support from being with you.\n\nIf something needs to break, understand how it is going to come down on her end- if she is overwhelmed, she needs to work. She can't get rid of the kids. What's the other thing on her hierarchy of things bothering her she can change?  If you are unwilling to change anything because you are comfortable, I wouldn't stay too comfortable here and figure out how you plan to live the single life. Relationships take maintenance and care- one partner isn't going to drag around a dead weight forever, though.", "She needs to feel appreciated, which means saying no to OT on her friggen b day!  I honestly can't tell if you are just this ignorant or being purposfully obtuse. \n\nGod bless your wife either way.", "dude. it's not a tit for tat or a competition. You are supposed to be a partner in a team. You are not doing that.", "At this point, I think your wife should just leave you. She only asks the abre minimum and what do you do.... surprise Pikachu face... smh", "So you do the bare minimum and expect to coast on that for the rest of your life? Yeah, start getting ready for a divorce, your wife is fed up and while she wants you around, she clearly doesn't *need* you around. YTA.", "When you did 60% of the childcare you said you were working 30 hours a week. Now she’s doing 90% of the child care and working full time. So she’s working harder now than you were the. So it’s not the same", ">wife says she doesn’t mind me working it in general, and I’m choosing to believe her\n\nThere is hearing her words, and then actually listening. You're not listening. She's told you she's feeling undervalued and unappreciated and you're brushing it off since in your mind you've \"done enough\". News flash- you wife doesn't agree with that, and she's told you and you're blatantly ignoring her, dismissing her words to go with your opinion.\n\nTry asking her what it is that would help make her feel more appreciated. Cause right now you're a major AH. (especially for telling her she's over reacting- way to invalidate what she's feeling and communicating to you, ,you just reinforced everything she's thinking and feeling)", "Sounds like you are a bad dad and a horrible husband. It also sounds like you work overtime even though you live comfortably because you want your wife to handle all the childcare and related activities. I'm pretty sure she'll leave you if you keep this up, she's already giving you warnings that she's feeling neglected. Something tells me you would prefer the single life though, because that's how your living right now, trying to pretend everyone doesn't see through your bullshit.", "If you can acknowledge that you're not the best husband right now, that should be your clue to start prioritizing your marriage more. \n\nYour wife has been open with you about being overwhelmed and disappointed. Take the hint!", "Look, you need to have a frank, but calm discussion with your wife about what you both want out of the relationship. \n\nNo accusations, no excuses: just a discussion acknowledging that there’s clearly a communication problem and what you need from the other to fix it. \n\nIt sounds like all your wife is looking for is some attention and appreciate from you, but you don’t know how to do that. Maybe she can give you more concrete examples of what she needs from you and you can make a real plan. Getting it out in the open rather than leaving it unsaid can help you find a solution.\n\nEdit: word", "That’s exactly how i felt about all these “tech bros” I knew coming up who would gloat about working 80hrs. They’re such a hard and diligent employee, but not a spouse.\n\nAnd then when they spoke to other people about it they got a pass because they’re “bringing money home and providing” \n\n“Well I’m making $$$ to support our family you can’t be mad at that!” \n\nHe even says in comments its not really about him working OT it’s that he prioritizes that over other things, like spending quality time with his wife and kids. This has been an ongoing issue.. He can do both, he just doesn’t want to. \n\nLap dog to his boss, wants to be a big strong man with his wife.", "You CAN say that you need to be out on time on a specific day, but you WON’T do that because a few extra OT hours that you’ve admitted you don’t need mean more to you than your family does,", "I made a correction in my post. Sorry for misunderstanding the OT. \n\nBUT you still had the option to ask to get off work at the normal time. You've worked OT 2 weeks in a row. It would have been the considerate thing to not work OT on this one night. Especially, seeing as how your wife works full-time, takes care of 4 kids, does all kids extracurriculars, as well as I assume house duties.", "I bet she's been doing the emotional labor for the family unit for years. Holy shit 4 kids all still school age? Planning the vacations, the major milestones in the kids lives, connecting with extended family, bringing the casserole or the crockpot to gatherings, teachers meetings, car pool. \n\nI bet she's already got Christmas all night and half wrapped, took stock of what she needs for baking and Thanksgiving dishes, already coordinated where they're going for Christmas,  what they need to wear and bring, picked out the family photo for the Christmas cards and ordered it, updated the addresses on the mailing list.\n\nBut he \"helps out\".", "Thanks for clarifying this.  I would still caution you on continuing this pattern if you are financially stable and don't need to.  \n\nTaking care of children is very difficult and emotionally draining and if your wife carries that burden a lot more than you do, it will breed resentment, whether consciously or not.  If your children are young, have any special needs, even if that is something high-functioning like ADD, responding to children's needs minute by minute is exhausting.  \n\nIf you worked one or two nights late, but were very invested time-wise in your family otherwise, then that is probably not going to impact negatively.  But if you are the type of guy who needs a lot of \"me-time\" on the weekends . . . golfing, hunting, whatever your hobby is for a lot of the weekend, leaving your wife alone often, then you will wake up one day and really regret it.", "I just saw that comment, and now I change it to total YTA. He replied to me in another comment saying his wife said she is fine with the OT as long as he's happy. Clearly, that's not the case if she's communicated to him that she's not appreciated and overwhelmed! Why do some people not get that being a partner and part of a family requires more than just money?? Work life balance is a must, and he prioritizes work while expecting his working wife to also pick up all his slack in the life category.", "The problem is your language (which reflects your true feelings).  You didn’t think you “had” to be home on time for her birthday. Your wife just wants you to WANT to spend time with her- not see it as a chore.", "You and I have very different ideas about being a husband and father. I commend him for his work ethic", "She shouldn't have to tell you. That's the EMOTIONAL LABOR part.  The fact she's actually feeding you the right answers, she's still reaching out more 5hab half way and directly, clearly communicating to you what you need to change to make her happy, to give her what she NEEDS in this relationship...and you're still flunking the test. Seriously,  go onto TikTok. Search the term \"weaponized incompetence\".  \n\nAnd then search why women are happier unmarried. Because alone, we don't get disappointed by someone. \n\nThe fact she's still extending herself to you means she still has hope. Now would exactly be the time to make some marriage counseling a genuine priority in your life, because you still have a chance to fix this. \n\nOnce she goes silent, she's done.", "You should have WANTED to.", "Google the article “she divorced me because I left dishes by the sink.” You refuse to do any of the emotional labor of thinking about what she might need without her explicitly spelling it out for you. That’s not a healthy relationship, you should both be putting in effort.", "I hope you’ve read his comment below where wife is actually the main breadwinner….", "This may be off topic, but maybe you need to sit down and have a cost benefit analysis of the overtime you are doing. If she's the main breadwinner and doing 90% work at home, you might need to balance that out more. Maybe she'd prefer you to cut back on overtime and contribute more at home to give her a break?\n\nThis is the sort of issue that can erode a relationship over time...\n\nYTA I'm afraid, think you aren't supporting your partner and you being somewhat thoughtless.", "She makes double what you do and she’s also doing all the chores at home? And you can’t get it together to prioritize the person who is literally holding your whole world together??? YTA. HARD YTA. Another toxic dude that wants money for toys and wants a woman to do everything in a relationship. Why?!? How are you so ungrateful and blind? This is why women are trimming the fat. At this point, she’s a single mom.", "Now that you have read people's replies, do YOU feel like you were an asshole? \n\nDo you understand why everyone else thinks you were an asshole?", "So she is handling the bulk of the finances, the bulk of the housework, and the bulk of childcare. What do you actually do because from where I am sitting, it doesn’t sound like much.", "Ah, yes, God forbid she have one day or 2 out of 365 where she wants to be put first for once. How fucking *dare* she.\n\nYou know man, I wanted to give you the benefit of the doubt, really. I really wanted to believe you were like my granddad: genuinely a good guy who just didn’t know how to communicate well with his loved ones. But based on your comments I’m starting to suspect you’re just an unrepentant AH and everything is your wife’s fault for expecting more. \n\nPrepare for life Alone, because that’s where you’re heading.", "Cannot comprehend ADULTS who fixate on their BD and expect fanfare and celebration as if it were a national holiday. Imo, your wife is modeling terrible behavior to your kids. She is teaching them to inflexible, demanding, unappreciative and self-centered. You did remember, plan,. celebrate her BD beforehand and you acknowledged her the day of her BD.  She is making a mountain of out of a molehill.  It is better to celebrate in advance than to have something unexpectedly come up at work,.or in life(you couldve been trapped on an interstate for hrs, anything can happen) on her birthday that would have prevented you from celebrating it.", "According to Op's other comments- the roles **were** reversed for a while and he felt undervalued and underappreciated. So he knows exactly how she's feeling.  \nIt doesn't sound like he ever communicated that to his wife and now that  his wife feels that way and **is** communicating it, he's brushing it off and thinks it should be enough (ignoring her blatantly telling him it's not).   \n\n\nShe's communicating, he doesn't respect her enough or care enough to listen to what she's actually saying.", "YTA. You seem to be doing the bare minimum. She has told you how she feels, but you aren't listening. She works full time, takes the kids to their activities, cleans, cooks....You work overtime. I would not feel appreciated in her shoes You do so little and expect her to just be happy. Do better and listen.", "I have seen SO many posts on various relationship subreddits that start with “my wife divorced me out of nowhere” and then they proceed to write paragraph after paragraph of all the issues in their marriage and what their wife’s specific complaints are and how he can change. So no, she didn’t divorce you out of nowhere. You know where it came from, you just didn’t think she’d leave so assumed you could continue ignoring your partners needs.", "Very true.  My 25 yr marriage ended this way.  He chose work over a family funeral.  At the end, he valued a promotion he never got, and undervalued the family who ended up leaving.  Leaving  him with essentially nothing.", "He is a narcissist so that won’t change. Only he’s the one that matters. I wonder if he’s cheating", "It worked out that ours kids didn’t have any activities that night (we’re in the sweet spot between fall sports ending and winter starting) she said she just didn’t assume she’d be cooking herself and the kids dinner on her birthday and she didn’t expect me to make a harder meal like I’d made over the weekend but that I could have done something simple or just take out", "Yeah, I mean she should know I love her…I married her, didn’t I? Same dumbass logic", "Not to mention - he didn’t take her out on her birthday.", "It doesn’t sound like he cares. He’ll be hit with divorce papers and be shocked", "Definitely marriage counseling if nothing else, but it sounds like he doesn’t wanna be around his family.", "If i was married to a stay at home dad and i made the money, half of the responsibilities would be steep. I already don't make people clean up after me. My bf and i have a great system where when we're done with something we clean up right away and don't leave messes for others. But if there is dishes in the sink when i get home from my job I'm not putting on the little maid outfit from the bedroom to clean. Yeah dad needs to be more involved and he's the AH here but i just don't like what you said. Wife shouldn't do everything alone but we don't know that that is the situation and while she shouldn't do everything it's fair for her to be expected to do more than the husband when he's working to provide. There's a give and take with everything. He gives more to work to provide a lifestyle she gives more to the household to maintain it", "I bet she ended up having to clean the kitchen too", "If he didn't say he got a gift, my assumption is there was no gift.", "*One day* of working a regular shift to celebrate his wife's birthday is all that's being debated. I think you're being a bit over the top and speculative, considering OP said himself that he can ask for shorter days anytime he wants.", "You don’t even know if they need the money so badly. I’d rather have a budget and a partner than a little extra money and all of the parenting and household chores falling on me.", "OP said it himself that he don't need the overtime money, and that he can ask to not do overtime whenever he pleases.", "He’s not doing what’s best for his family if he loses his family because of it.", "It doesn’t matter to me what the gender of the OP is. If you have kids and a spouse and are spending more than 12 hours a day at work, you’re not really part of the family. You come home, you sleep, you leave, You’re there on weekends and then you disappear for another 5 days. \n\nMother. Father. Parent. Guardian. Doesn’t matter gender or sex of the person. Either you’re around or you’re not. It’s that simple.", "Money is great but having a dad/husband who actually comes home would be cool too", "I agree, but disagree.\n\nSure, emergency fund are nice.\n\nBut you know what is nice too ? Not being alone. Once the kids are all moved out, that the wife finally decides that she wants someone that cares for her and gets a divorce, and the kids don't call anymore because they never created a bond with their absentee father, yeah... all that money won't buy back OP all the years away from his family.", "Why are you so obsessed with money over being present with your family? Nowhere is it indicated that they are in financial crisis, and money isn’t the only thing that matters in life.", "Not even fulfill his duties. Maybe she just wanted to see her husband on her birthday.", "Exactly", "just yesterday reddit reached the opposite conclusion regarding adult birthdays.", "*You don't get to determine what's important to other people.*\n\nlol- what is the point of this sub then?", ">*The extra money, in the long run, will mean so much less than all the missed opportunities to get to know his kids and emotionally support his wife.*\n\ndemanding THREE celebrations is quite a fair bit beyond 'emotionally supporting his wife'. That veers into entitled territory. \n\nWho needs three celebrations for one birthday?", ">*Sure, he treated the entire family to two different meals.*\n\nif a child demanded three birthday parties we would rightfully consider them spoiled.", "but the b-day WAS celebrated. It just wasn't celebrated three times.\n\nAnd, as you said, the celebration doesn't have to be the exact day. Here's how you put it... \n\n*gather once a month to celebrate that months birthdays*\n\nAnd here is OP....\n\n *I took her out for dinner on Saturday and our kids and I made her dinner Sunday.* \n\nHow much celebrating does this grown woman need?", "You hit the nail on the head.", "If they're older, good lord OP have you been saddling her with FOUR teenagers while you hide out at work for absolutely no reason? And then you went and did it again on her birthday.", "Completely agree!! He seems to not really care for his wife and take her for granted!", "Oof I read some of his comments, and it's definitely about his lack of help around the house and with the kids. She told him she doesn't feel appreciated and she's overwhelmed, and his only take away is it seems like he can never make her happy. This is bigger than just her birthday, and it seems like he kind of misrepresented things.", "Don’t you think it would have been nice for her to be off kids activities duty for one night on her birthday? She works during the day and then has to work even more for your family in the evenings and you don’t help even though you could. That’s shitty behaviour every day and especially on her birthday.", "Lololololllll she’s clearly not happy, my guy", "You replied to the wrong person.", "Yeah, they always seem to think that there was no lead up to the divorce. No, you just didn't care till it was too late and now any effort you make will be in vain because your wife is already checked out. Men ( not all of them but a good chunk) need to stop taking their partners for granted.", "Been there. My ex is an incel who spends all his time on social media threatening people with different political beliefs now. Hope it was worth it.", "If I had an award I would give it to you. In the most simple and profound last 2 sentences you freaking nailed the classic disappointment and end of so, so many marriages. I felt this hit straight to my chest, man. All I saw was my dad and my childhood. Priorities.", "And after her telling you clearly what it was she needed, and why she felt how she did, you are still questioning whether or not you're an asshole?\n\nHow frequently do you make dinner for yourself and your family on your birthday?", "You prioritized voluntary work over dinner with your whole family on your wife's birthday, and you actually have to ask if you're an asshole?", "Her expectations were more than reasonable.", "I can’t imagine having such a deadbeat co-parent that the only thing I want from my birthday is for my partner to make dinner for the family…which isn’t a gift. At all. It’s something you should already be doing because those are your kids and your responsibility too. You’re not the breadwinner, your wife works full time and parents your children everyday. You can’t make dinner twice in a year? Ffs how lazy can you be?", "So you just don’t like spending time with your family. She’s right. Maybe you should work on that.", "You're missing the point. You might live comfortably but there's more to comfort than just physical needs. You are neglecting your wife's emotional needs and in case it didn't sink in:\n\nYOU ARE NEGLECTING YOUR WIFE'S EMOTIONAL NEEDS.\n\nThat is not comfortable for her. She is NOT living in comfort. \n\nYou have no work life balance and until you address this, you are the AH.", "Aside from money, what exactly do you contribute?\n\nWhat do you do to raise your children?\n\nWhat do you do to maintain the household?\n\nWhat are you doing to actively love your wife?\n\nYou're disengaged from your family, and it sounds like your wife is wising up.", "Sincerely, do you like your wife?", "Now that I’ve seen this, YTA. you don’t have to be away working overtime, you just seem not to want the responsibility of a family partnership.\n\nI mean, you gave  your wife FOUR KIDS and a household to run by herself, does she really need more than dinner on a random day that’s not her birthday??? /s", "She works full time outside the home too.", "She works full time too", "She's not a stay at home mom. He says in the OP that she works full time. She just works remote from home. So she's effectively doing two jobs all day.", "wife works full time, it just seems like she's working from home. not a SAHM.", "OP said his wife also works full time. It's not clear that they need the extra money since OP said the OT money is nice ( it's also not clear that he invests said money on family needs and not his personal needs).\n\nTo me it looks like OP YTA and doing overtime is a way to not do family chores. He's paid to do overtime but wife is not paid to do house chores in addition to working full time. Has OP asked wife is she's fine with the arrangement?", "I agree with your sentiment and that the stay at home parent should be responsible for a larger portion of the household chores, and that is totally fair. However, you are mistaken. OP said his wife works full time. She is just taking over the majority of the house and childcare on top of a full-time job because of his overtime schedule.", "Under the *same* circumstances? Where?", "Wanting your partner home to help with dinner/chores/bedtime for one night is a bit different than a kid’s birthday party.", "I was only commenting on your generalized comment of birthdays nor meaning much to adults, not OPs situation.", "So the solution is to be petty and not make her feel appreciated because you didn’t? \n\nHow about… communicating? 😱", "Thanks for the info.\n\nSo, she's now doing significantly more than before, including significantly more than you were previously, while still working full time. \n\nFollow up Q's\n\n1). Do you appreciate your wife? \n\n2). Do you care about how she feels?\n\n3). Would you like to feel appreciated?", "Did you TELL her you didn’t feel appreciated? Or did you bottle it up and not communicate with her and expect her to magically know. She IS trying to communicate with you.", "So you’re comparing her doing 90 % (Which honestly sounds like closer to at least 95%) to your 60%? \n\nAnd how many hours does she work now? If she does 90% now, she better only be working very few hours per week to even compare the two. If she works around 30 hours, then she should, by your logic, also only do around 60 % of everything else. \n\nShe’s literally doing almost everything AND working. You’re doing nothing but work. You cannot even compare when you did more to what she’s doing now.", "“I had to do 60% while working less than full time for awhile so now she has to do 90% while working full time forever because fuck her, that’s why”\n\nYTA, here and in general", "More INFO: \n\nIf you had said to your wife “I don’t feel appreciated and would like if you did XYZ to make me feel loved and appreciated”, do you think she would have done so? \n\nYou’re saying you didn’t feel appreciated. Fair. You also never expressed that to your wife. Your wife is currently expressing her needs to you, don’t ignore them just because she didn’t read your mind when you didn’t feel appreciated but said nothing.", "She's telling you what she wants and needs. Are you telling her what you want and need to feel loved/appreciated? Sounds like you were working less when you were doing more around the house. Now the division of labor for parenting and household chores has had a massive shift, and it sounds like you're basically checking out of your marriage and family life. Are the relationships with your kids suffering too? \n\nGoing with YTA here.", "When you did most of the cleaning, was she still doing most of the cooking? Or you consider cleaning the only household chore?", "So you worked 30 hrs a week while doing 60% of household chores and you did not feel appreciated and she is now working full time (40 hrs?) and doing 90% of the household chores and you're surprised why she doesn't feel appreciated? Am I missing something?", "There is a big difference between a 60/40 split and a 90/10 split. I'd be pissed As hell if you were my husband. YTA.\n\nETA, you were also working part time when you had the higher split of tasks at home. Your wife is working full time and taking on 90% of the chores.", "Did you tell her that?", "So instead of communicating that to her, you’ve decided to get her back for it now? That’s a great way to handle marriage.", "It sounds to me like you’re allowing this new job to interfere with your personal life and if you think for one second that the company cares about that or that they’re not intentionally overworking you, you’re incredibly naive and gullible.", "So... you worked 10 hours less as she did and did more child care and chores. \n\n\nBut now she still works 10 hours more than you at that time, does 30% more chores as you did with 10 hours more time and think the situation now is some kind of werid justice? \n\nDon't you agree that you can get a lot done in 10 hours?", "She’s doing 90%? She was still doing 40% when she was the one working more? Why wasn’t it a 90/10 split when you were working less hours? You felt unappreciated at a 60/40 split, but she’s being unreasonable for feeling unappreciated when she’s doing 90/10 and working full time? YTA big time.", "the difference is that i’m assuming you didn’t tell her, did you? she’s voiced her concerns.", "You were picking up an extra 10% of the household work before while working less than full time. She's picking up an extra 40% with full time hours. Do you really think feeling underappreciated in those two scenarios are the same?", "There’s a big difference between a 60/40 split and a 90/10 split. Imagine if a work colleague suddenly dumped 50% more work on you, and you didn’t get paid OT, or even got acknowledgement that you’re now doing 50% more work than before, and they’re only doing 10% of the job, but still getting ‘paid’ the same. You’d be pissed. You’d say it’s unfair. You’d want to get remuneration for it.\n\nBut you don’t give your wife even any acknowledgment for it, because she didn’t used to praise you for doing 20% more. That’s petty. \n\nAlso, does she now also do most of the cleaning, which she hates, because you’re not around to do it? \n\nYou do realize that when a woman feels unappreciated and is complaining that you need to step up and sort yourself out. Because when she stops complaining… your marriage is likely over.\n\nOh, and in case it’s not clear, YTA", "Okay, then have a talk about that. Tell her you didn't feel appreciated when you had your old job and did most of the cleaning.\n\nAir it out. But also admit to yourself, that you maybe harbor a grudge about that time and wanted to pay it back in kind, meaning not appreciate her as much.\n\nIt's time to stop that cycle. It is not helping your relationship. Talk about it and then start saying thank you and bringing her flowers and come home earlier 1-2 days in the week.", "So this is payback, then? Because that’s what it sounds like. \n\n\n“I didn’t feel appreciated when I did 90% of the housework and childcare because I was between jobs, so why should YOU get to feel appreciated for now doing 90% of the housework and childcare while ALSO being the breadwinner?”\n\nDude. Step up and do better.", "So... ARE you thanking her? ARE you getting her flowers/small gifts?", "two days in a row I've seen someone seriously misrepresent the situation to their benefit. Under normal circumstances, I'm not a big birthday-must-be-on-the-exact-date person, but clearly this dude withheld all the info needed to make a proper judgment here.", "Ragin, hope the guy above sees it.\n\n\nThanks for letting me know", "This is literally exactly what he’s doing! Being petty", "And one day she will stop, and he will very mistakenly think that everything is fine now because she not complaining anymore.\n\nThen cut to him being all surprise Pikachu face when she serves him divorce papers as a birthday present."]}