{"id": 24596, "submission_id": "15qix8a", "title": "AITA for telling a gay man if he touched me again, there would be problems?", "selftext": "I (24M) went out with my girlfriend (22F), her mother (50F), and her mothers friend (40M) for a night of bowling and drinking. \n\nFor past context, I’ve known my girlfriend, Kay, for around 6 months and have met her mother, Sara, multiple times. Sara has a friend, Gary, who is gay and makes it a point he’s into me when he’s around. Gary is very out there with the things he says, once he told my girlfriend as I was next to her, “I bet his dick is huge” and another night complimented my ass well over 10 times, and “jokingly” said I could stay at his place. Every time in the past I’ve just brushed it off because my girlfriend and her mom have told me that’s just how he is. \n\nNow to bowling and drinking. Gary drives all four of us to the bowling alley.  We bowl a few games, have a few drinks, everything is good for well over 2 hours. After we bowl we all went to a bar to continue drinking and enjoy the night. Another hour goes by and we’re all pretty drunk. Gary plays a very sexual song on the jukebox and begins singing/rapping it to me, okay. 10-15 minutes later, Gary tells my girlfriend, again as I’m standing next to her and can hear him, “I’m going to be the one to suck his dick at his bachelor party.” I gave Kay the thats too much for me look and Gary saw, Gary moved away elsewhere. 5-10 minutes after that, Gary is standing next to a random bar dweller (40M) behind me and Kay. Kay is sitting on a chair, I’m leaned over it behind her, and Gary grabs my ass but deep enough to touch my balls a little bit. I don’t know how to explain the gesture but basically rubbed his hand from my balls up to my ass, squeezed my ass and let go. When that happened I turned around and said “If you do that again there will be a problem. I promise.” with a pretty angry look on my face. Gary said nothing in response. I then told my girlfriend I was ready to leave and call it a night. I was uncomfortable and kind of upset Kay or Sara didn’t say anything in response to Gary touching me. Sara, her mother, did not want us to leave but I got an Uber for Kay and I and shortly after we left.\n\nA couple hours later, Gary had texted Kay telling her I was homophobic for what I said. Gary and Sara were still at the bar. There was absolutely no reason to text her that. Kay did not respond to him, but now there’s tension between all of us. Sara took Gary’s side. I’m upset nobody else stood up for me, and Kay is basically ignoring the entire thing, saying that’s how he is and she doesn’t want to drag on further. I’m left wondering if I’m in the wrong for snapping at Gary. \n\nAITA?", "created_utc": 1691983473, "permalink": "/r/AmItheAsshole/comments/15qix8a/aita_for_telling_a_gay_man_if_he_touched_me_again/", "score": 424, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > For telling Gary, “There will be a problem if you do that again.” And because it brought tension to my relationship with my girlfriend and her mother\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA- as a gay man it beyond pisses me off that someone will sexually assault someone and then claim “homophobia” when they rightfully get told off.\n\nConsent applies to all people. You did not give it and you were definitely violated. And your gf is also TA for not having your back.", "NTA. Gary is a predator. If he was a straight man saying that to a straight woman and grabbing her cooch and squeezing, it would be sexual assault. Which it was with you. Gary stepped way over the line and I know a few gay men who like to hide behind 'you're homophobic if you call me out on my shit'. Fuck no. Tell Kay \"Honey, your mom's friend sexually assaulted me. If a guy did that to you, you'd be livid. I'd be livid. Why is it any different when he does it to me? Because YOU know I'm not attracted to him? I also know you're not attracted to some jackass at a bar groping you, but it's not right, especially if you don't like it. If a woman had come up and done the same thing to me, would you be mad then? I don't want him sexually touching me, sexually making comments, and then blaming me for not being a perfect victim. No means no, Kay. For every fucking situation. Especially this one.\"\n\nDude, it's sexual assault, and if Kay can't get that through her head and Sarah's taking his side, maybe it's time to ditch them all. \"Fine, call me a homophobe. I'll homophobically choose not to get raped or assaulted by your gay friend who can't take no for an answer and won't keep his fucking gropey hands to himself. Guess not wanting to be raped makes me a homophobe.\" Really grind that home.", "NTA. \n  \nGary's a creep.  \n  \nYour girlfriend doesn't care about you.  \n  \nHer mother is excusing sexual assault. \n  \nIs this a family you want to be a part of?  \n  \nRed flags everywhere.  \n  \nBail.", "NTA\n\nGay or straight, that was sexual assault!\n\nIf you did that to a woman, you'd expect the cops to be called, right? It's no different if a guy does it to you. \n\nIt's not anything-phobic.", "Nta. You were sexually assaulted. This goes further than harassment. If your GF doesn't understand that she is ad big an AH as Gary. You made it clear you are not interested. Gary doesn't care and will continue to force himself on others. He's no different than men that grope women under the guise of passing them. Disgusting behavior. You should have broke his nose.", "NTA - Gary sexually assaulted you. Kay ignoring this is not okay. This is not okay. \n\nOut of curiosity what was the song he put on? I want to know just how cringey it was.\n\nEdit - this was assault, updated", "NTA \n\nThat's sexual assault. That's how he is? So he's a predator. It's not ok when a guy assaults a woman like this. It's not okay when a woman assaults  a man like this. It's not okay when a man assaults a man like this. Nobody, no matter the gender of the victim or the predator, makes assault ok.", "NTA\n\nYou were sexually assaulted. Seems to me that you went easy on the guy.", "NTA \n\nI’m gay and find that behavior repulsive. Dudes do that to me too.", "NTA. Him being gay is not a license to touch anyone against their will and wave around homophobic when challenged on it. It’s appalling behaviour and completely unacceptable.", "NTA that’s sexual harassment and sexual assault. I’m sure you would’ve reacted the same way if some older straight woman has been acting exactly the same way and had groped you. Ask Kay if she’d be saying ‘that’s just how she is’ if Gary has been a straight woman. Or ask Kay how she’d feel if one of your guy friends did that to her and if you just ‘that’s just how he is’. If she doesn’t stand up for you, I’d consider breaking up with her\n\nEdit: Gary sexually harassed and assaulted OP so I changed that", "You were assaulted.\n\nMight be time to stop going out with the  gf's mother and her friends.\n\nAlso block Gary from both of your phone. And set clear boundaries, with clear consequences for him and his too SA condoning pals ie  gf's mom and friend.\n\nYour gf should be considering the role her mother is going to play in her life, if she condones ppl harassing and assaulting her bf and then sending her messages. Time for her to see if the mother has to be cut off as well.", "Nta. You were sexually harassed and sexually assaulted, repeatedly. Has nothing to do with his sexuality.", "NTA\n\nThis guy sexually assaulted you and your girlfriend said nothing and your girl's mother is on his side.", "NTA - \n\nFirst off, I'm a gay man and for him to touch you in a way that made you uncomfortable and be unapologetic about it is unacceptable.  \n\nThat may be \"how he is\" but that doesn't excuse inappropriate behavior. Touching you in private areas is way too far, imagine if it was an older straight man doing that to a female? \n\nYou are right to feel violated and his behavior shouldn't be justified.", "NTA, you were assaulted. He touched you sexually without your consent. I’m so sorry that happened to you, & I’m sorry no one around you is taking this seriously. If Kay had been assaulted by a straight male family friend in a similar manner, I bet Sara would be singing a different tune. “That’s how he is” isn’t an excuse for sexual assault.", "NTA\n\nIt wouldn't matter if Gary were gay, straight, male, female or non-binary. Your personal boundary was crossed long before he physically/sexually assaulted you.", "NTA, you got assaulted. Doesn't matter what someone's sexual orientation is, you don't fucking touch someone without consent.", "NTA. He assaulted you. It has nothing to do with his sexual orientation. If a woman grabbed your ass and junk it would be no different. The behavior you described is repulsive, regardless of who was invoked. \n\nThe whole situation sounds really creepy to me. I’ll even go a step further and say that your gf  and her mom are gross for not drawing a hard line when he was harassing you… which obviously allowed him to escalate to assaulting you. \n\nI really hope your gf rethinks her priorities because of the roles we’re reversed she’d be looking for emotional support from you…. Fuck who does that kind of think to someone?!?", "NTA\n\nThis is sexual assault, and I’m glad you spoke up because so few men feel they can’t as to “not appear weak”\n\nI’m a gay man, and I would NEVER in a million years lay my hands on someone without consent… especially a straight man, as I feel behaviour like that pushes back equality for our community.\n\nYour GF needs to realize that she’s perpetuating a crime by not supporting you.", "NTA.  You made that comment because he was harassing you, not because he is gay.  Being gay isn’t a free pass to sexual harass someone.", "NTA\n\nThis is sexual assault... nothing less... \nIf this was done with a woman, and I say this as a woman myself, the house would have been too small. \nYou gave on several times that you do not apprexiate the comments. \nThe touching is too far.\nSorry but thats the equivalent of grabbing a woman between her legs and I know for a fact I would turn around and slap a handprint tattoo on the guys face. \nIt is NOT homephobic to be against being touched in such a way. Because 100% sure you wouldnt have appreciated a 40 year old woman doing that. \nThey keep saying that is how he is? \nI would sit your gf down and talk with her. She should be on your side. She is your partner. \nWhen my bf feels uncomfortable I will not force him further but stop whatever makes him uncomfortable. You need to sit her down and ask why she can not understand your point of view and ask how it would be if a man double her age cups her.\nSorry but if I am in your place I would have filed a policereport against Gary. \nAnd your gf and her mom should see that. \n\nAbsolutely NTA and stay faarr away from that monster.", "NTA I don't care what gender you are or what your sexual orientation is, that is absolutely sexual assault. I'm queer and it really infuriates me when people try to claim others are phobic in response to any perceived slight. Truly disgusting and I'd be wary of your girlfriend as well. She is not taking this seriously enough. She should be pissed too. She should have your back.", "NTA \n\nWe only needed to read the 2nd paragraph. This is sexual harassment.\n\nJust read the rest out of curiosity. This is actual sexual assault. It would have been a fight if it was me. A violent one.\n\nWho knows who else he hurt. It sounds like he gets away with a lot based on the fact that people are actually defending him.\n\nA police report would not be an overreaction.", "Ummmmm....you were sexually assaulted and your gf is \"ignoring\" it? Wow.\n\nNTA", "File a police report", "NTA. That's sexual harassment and total a-holery. You are totally in the right here.", "NTA you were sexually harassed. I know gay people exactly like this and they all touchy with me, however with our relationship I’m cool with it.", "NTA that is sexual assault and you should inform him of such and stop socializing with him", "Yeaaaah, as a queer man (38M), this is totally not acceptable. Calling out the homophobic card on the person theatre was sexually assaulted - numerous times after clearly being told you are not interested - is predatory and disgusting.\n\nNTA, and I suggest telling you girlfriend that if she doesn't have a word to her mother about her friend, you are more than willing to take out a restraining order. You have no idea what he is willing to do to \"convert\" a straight man. Will he roofy you? Will he physically force you? He already attacked you once in a public place.\n\nAt the very least, go to the police and get a restraining order. That will wake your girlfriend and her mother up - if this happened to a woman, he would be in cuffs so fast his head would spin. The fact your a male should make no difference.", "NTA- telling someone to stop sexually assaulting you, groping you, or any unwanted gestures is not homophobic. Your friends taking the Sex Offenders side it also alarming. It doesn’t matter if you are gay, straight, bi, black , white , blue, male or female, this was sexual assault/harassment. Do not apologize to anyone, if they want want to continue to hang out with someone who gropes others inappropriately, that is them. Sexual Assault *is* NOT a joke. Being touched unwillingly, and inappropriately is not a joke. You are not wrong for stopping someone sexually assaulting you. How would they feel if a lesbian came from behind and put their hand between their legs and grab their breast inappropriately without consent ? They wouldn’t like that I’m sure after they’ve been harassed the whole time then the last straw was being sexually assaulted.", "The guy is sexually harassing you near your gf and her mom ffs 🤣 at that point of the night it could’ve been way worse than a few light word nta", "NTA\nThat is not a “that’s how he is” thing. It’s repulsive and seriously worrying that your girlfriend is just ignoring it to not make waves. Friend of her moms or not, it’s not acceptable what he did.", "WHAT GARY DID IS SEXUAL HARASSMENT \\*AND\\* ASSAULT. HE GROPED YOU.\n\nCall the motherfucker out. Just because he's gay doesn't mean he's exempt from grabbing and molesting people. From being an outright CREEP.\n\n&#x200B;\n\nNTA and I'm so sorry that happened to you.", "Gary is an F-ing sexual predator.  You are NTA here.", "NTA. I was convinced you would be a women when I clicked on the post, lol. I have had a lot of gay male friends in my life and they really REALLY like to be too handsy with me and other women. I have had to tell several friends to keep their hands off me. I dont care if you dont want me in that way I still do not want you grabbing my breasts or ass because you think that you are allowed to. he was 100% sexually harassing you and you had every right to speak up about it.", "He sexually assaulted you…", "NTA.\n\nThat's sexual harassment and assault.You are the victim and you have every right to defend yourself.", "NTA \nThis guy sexually assaulted you. I‘m pretty sure if a guy would grab your girlfriends ass she would be angry too and not try to brush it off as „this is just how he is“", "\"I had a man after me.  It was very clear I was not interested.  He knew I was not interested.  He then sexually assaulted me,  and I used my words to tell him to get bent.  Nobody defended me. Am I the asshole?\"\n\n&#x200B;\n\n... like. brah.  I'd of fuckin decked him.  you're a better person than me.", "NTA. you're being sexually assaulted & your girlfriend is enabling it. ditch them both & press charges on him.", "NTA, and I'm sorry that happened to you man.\n\nIt's messed up that you're the only one that's defending you in this criminal scenario :(", "U were sexually assaulted, and they are taking his side.", "Absolutely NTA!!\n\nI'm a gay man for what it's worth (and tbh I've interestingly been inappropriately groped by my straight/bi male friends much more whereas I've never groped by someone) \n\nYour response was absolutely not homophobic at all and was absolutely warranted.  This is highly inappropriate behaviour and you've been sexually harassed. \n\nYou should definitely make this your hill to die on and refuse to ever be in the same place as Gary until he apologises and changes his predatory ways. The fact that your gf is also excusing his behaviour is very disappointing and you should talk to her about how you feel.", "F Gary, he’s just trying to make you the bad guy.  He doesn’t get to sexually assault people because he’s gay, simply refuse to do any event with him present and he’s not allowed at anything you and girlfriend host", "NTA. This man has been sexually harassing you and neither your girlfriend nor her mother have told him to stop. Ask her how she'd feel if it was your dad's male friend grabbing her ass without consent while you did nothing.", "asking someone to not sexually assault you is not homophobic. this person sounds like the predatory gay falsehoods portrayed in modern media, almost a caricature. hiding SA behind allegations of homophobia is doing a great disservice to everyone involved (and tbh those uninvolved as well.)", "NTA. You wouldn't be the AH if you smacked the dog shit out of him. He assaulted you. No warning required.", "Nta. Gary fucking sexually assaulted you. I'm a woman, and if a guy or a lesbian did that to me you bet I would be way less nice about it than you were. I'd be throwing hands, or drinks, or at the very least insults. Just because you are both men it doesn't make it any less bad. Kay's mom is an enabler and the fact that she is friends with such a predatory man tells me enough about her character. Kay probably is not doing anything because going against Gary would equal going against her mom and she probably doesn't want that but this is one of those situations where she should take a stand regardless of how it might damage her relationship with her mom. *That man is unsafe and they should not keep validating and enabling him*. If I were her I would be extremely upset at someone coming onto my boyfriend like that all the time, regardless of their gender.", "NTA. That is sexual assault. No one has any right to touch you like that without your consent. Everyone around you is wrong in that situation. Gfs mom is horrible for being on his side, and the GF is just as wrong for not saying anything.", "Gary is the worst. \n\nJust like “I’m just blunt!” Or “I tell it like it is” is not an excuse to be an asshole. Saying “that’s just how I am” while you proceed to harass and then sexually assault someone is not okay. \n\nYou are NTA but I would refuse to do anything with Gary. He sexually assaulted you. And it also pisses me off because if a straight guy did that to a girl there would be big big problems. Just because you’re both male and he’s gay doesn’t make it magically ok. What a fucking pervert and if anyone should be saying anything.. it should be her mom. I’d never let my friend harass my daughters boyfriend who’s almost half their age..", "NTA you were sexually harassed.", "NTA,  you were assaulted", "NTA.\nThat's harassment. That's sexual assault. If you were to call the police and file a complaint he could very well be charged and probably would be.\n\nHe doesn''t get to be the attacker and the victim.", "NTA. Worrying your girlfriend said, this is something he does. They are all aware he gropes and sexually assaults people, and are justifying his behaviour.", "NTA, this remind me of a Key and Peele skit about an office gay guy.", "NTA, your girlfriend is TAH since she sided to that Gary. My friend is gay and he despises people using LGBT+ flag to get away with their antics. \n\nLet's say you are a girl and you are together with your bf and the aunt and the another male uncle and yhe uncle tried to grab your butt. Was that even ok? Nooo they are being double standard and an AH for saying you're homophobic.\n\nPeople should know boundaries.", "NTA. What you faced is sexual assualt. Being gay doesn't mean anyone can get away with sexual harassment. Neither protesting against sexual harassment by a gay man makes you homophobic. That man does give gay men a bad reputation thanks to his antics.\n\nAs for your GF and her mother, it does feel that they care less about you. They neither told off Gary nor got annoyed with him. Not someone I would want in a life partner.\n\nEDIT: a word", "NTA anyone who says otherwise need to do gender swapping in the situation and see if it’s still okay.\n\nIf a man behaved that way to a woman we’d be out with pitch forks. He sexually harassed and sexually assaulted you and when you call him I on it you get called homophobic!? It’s bullshit. \n\nRegardless of sexuality or gender there still need to be considerations about where and what the line of appropriate is. Gary shot well past that line.\n\nSomethings may be taken as a joke but that’s for the person on the receiving end (OP) to decide. So if anything made you uncomfortable then Gary is in wrong. \n\nOP just tell Kay and Sara if it was a man doing it to woman how would they feel.", "NTA- he's sexually assaulting you and it's unacceptable. My personal belief is if someone sexually assaults you, you may use whatever you have to defend yourself. I'm disgusted your girlfriend thinks this behavior is okay and isn't telling him off. Maybe tell her from now on you want nothing to do with Gary and if he's present or shows up, you will leave, with her or without her. Then stick to that boundary. You may end up losing the relationship but i don't think that would be a bad thing considering her disrespect towards you.", "NTA\nThat's sexual assault and you would be entitled to report him to the police and maybe you should, as he is clearly a sexual predator. The fact that he is gay is neither here nor there. \nI would also recommend disassociating with your GF and her mother, who are creepy AF for not seeing this as problem behaviour.", "NTA. I'd dump her ass if I were you.", "NTA. His being gay has nothing to do with it. The issue is that he's preying on a younger guy, who's not only straight, but also in a relationship. I'm gay (same age as you, actually) and in a relationship, and if a 40 year old guy tried this shit with me, I would have the same reaction as you. You're not homophobic and you're not out of line. You have a right to be upset that nobody is standing up for you. The fact that he's made sexual comments and aggressively groped you and all Kay and Sara have to say is \"that's just how he is\"?? I'm so sorry this happened to you.", "NTA - 27 Gay M here and I agree, it all sounds too far. It’s okay to be attracted to someone without crossing boundaries or making them uncomfortable. Even though this shouldn’t happen, and people should be able to take the hint, in the future I recommend having an upfront conversation with the person before it escalates to this point to establish boundaries (if you didn’t)", "NTA- idk how you think YTA in this situation. Being gay doesn’t give you an excuse to touch people, especially when it’s your a$$ and b@lls. That’s sexual harassment. I’m tired of seeing people not take responsibility of their actions and instead say “your homophobic” if they get called out for something like this.", "NTA, that's sexual assault at worst and battery at best. The dude could have been put in jail for that. If it was a man and a woman, they'd have seen it much differently.", "NTA \n\nIf the rolls were reversed (your wife in your place) would they be so cool with the behavior? Nope.\n\nYou have also have a GF problem", "NTA \nI feel like this happens to men a lot more than people think", "NTA. Calling out sexually assault and harassment. Gary sounds like a creepy predator who gets off on making people he knows aren’t into him uncomfortable.", "Imagine you were a woman and dating Sara's son. Gary wouldn't get away with that shit. So no, NTA and furthermore you could've slapped Gary and still not been TA.", "Nope. DEFINITELY NTA! That's sexual harassment and assault!  I'm so sorry this happened to you! I wish I could say something to make this go away other than you need to either report him or step away because people like this escalate.", "OP, you gotta break up with your gf because she doesn't see a problem, and Gary thinks sexual harassment is homophobic. Wonder Gary would feel if several girls started touching him in a sexually suggestive way. Would he think it's sexual harassment or accept that's how some girls are and believe some girls want his body.", "NTA. Point out to everyone involved that if a straight man was persistent like that with a woman from the friendship group, and then touched her in a sexual way, you would hope they would be equally condemned.", "Nta AT ALL. That wasn't in good fun, that wasn't a \"hey we're friends that are super comfortable with each other I'm gonna grab your butt in a playful manner\" I would go as far as to say that is sexual assault. If a guy did that to a girl, and she said that to him, everyone would be cheering her on and the guy would probably have some trouble to deal with for putting a woman in that situation. He's taking advantage of the fact that these people trust him and making it about something the situation has nothing to do with so that he doesn't look like a bad guy. The fact that no one sees that that is not okay is bullshit, and the fact that your girlfriend isn't standing up for you and is just saying \"that's how he is\" is DISGUSTING. It's like saying \"boys will be boys\" as an excuse when a guy commits sexual assault/harassment or rape. You were not in the wrong at all here, if anything you handled it much better than most people would have", "You are a better man than me because I would have thrown hands after I got groped like that by another man. NTA. He sexually assaulted you, but others are letting him get away with it because of hi sexuality.", "NTA Gary is the AH. Being an AH is not a protected class. He’s out of line and knows it. Mom is an AH for not holding him accountable for his offensive behavior.", "Obviously NTA. You didn't do anything but speak up for yourself, though much later than you should have. He's the one who sexually assaulted you.  Him being gay doesn't even matter except to set up context as to why he did what he did. It isn't a pass to be vile", "OP having dealt with it in work places where many straight women did it to me trying to get me to \"change over\" numerous times as a gay man was tiring because management kept saying it's no big deal when sexual harassment against men wasn't taken seriously compared to these days because it was decades ago.  Today you're in a social situation here, so you just cut off Gary from your outings - period.  If you keep hanging out with him, you're encouraging it to happen.  It's a challenge because because he's thinking he can do the same thing as these women thought they could do to me.  You eliminate the opportunity, you take away his power.  You physically harm him, it could not only lead to physical assault but also a potential hate crime charges which is worse.  Just avoid him because otherwise he won't stop because it's his challenge and eventually he'll move onto someone else.", "NTA but your gf and GFS mum are for letting gary do and say whatever he wants. It's disgusting and he's disgusting", "NTA, and it sounds like your girlfriend and her mom are enablers of his predatory behavior.", "Anyone who backs him should be cut from your life. Dude doesn't get to assault you, blame you, and get defended. Screw that noise. NTA - sorry bro", "Sounds like you need a new gf. I would never be ok with my bf being sexually assaulted and saying \"that's just how he is\". That's so heartless and insensitive to say!!!!!", "NTA this is sexual harassment and it's disgusting. He doesn't get a pass just because he is gay.", "That sexual assault. Your girlfriend is an asshole for not defending you and for not taking into consideration beforehand that you were uncomfortable with this man. Doesn’t matter if “that’s the way he is,” you let her know he made you uncomfortable and she ignored your feelings and still had you around him. I would honestly reconsider a relationship with her. I would avoid that entire group if I was you. You an always see if the bowling/bar area has cameras of him harassing you and press charges.", "I'd have fucked Gary up, and not in a homo-acceptable kinda way. NTA!", "NTA. I'm unapologetically flaming and I'd have belted him. He's a creep who assaulted you and I'm extremely upset others didn't have your back on this.", "Gary a weirdo", "If Gary was straight and made this kind of unwanted move on Kay, all hell would break lose. Absolutely, totally wrong. Sexual assault doesn’t just happen to women. I’m sorry you experienced this. NTA.", "So if your friend went over to your girlfriend and did the same thing she and her mom would be ok with you saying, oh dont make a thing of it my mate touches all woman on their genitals its completely normal and ok. Some how i think not!", "Ok. If you aren’t sure about this, let’s reverse the sexes of everybody involved. Let’s say that you, OP, are a young lady and you are going out with your BF and his dad and his lesbian buddy.\n\nThe lesbian buddy says she is going to give you oral sex at your Bachelorette party. She grabs your ass and fondles you in public, knowing you won’t like it.\n\nThis is not right. This should not be tolerated. The friend of your partners parent may “just be that way”… but *you* don’t fucking *like* being treated like a piece of meat, and *you* are “just that way”. \n\nFrankly I would refuse to be in the same room as that person and they can claim you are homophobic or a cold fish or whatever they want. But I wouldn’t stand for it, and if your partner won’t back you up, they are a shit partner. NTA", "He’s lucky you didn’t call the police. He could be a registered sex offender and arrested. Many people have gotten that result from what he did to you.", "NTA You were assaulted. I personally would contact authorities and let them handle it, and yes, I'm pressing charges.", "NTA. I'm saying this as a gay man. You were sexually assaulted and for anyone to think otherwise is disgusting.", "NTA, you where sexualy assaulted, FACT. Personally, gary would have been dropped, hard. There is an easy test: ask your GF would she allow another girl to act like Gary around you… she will say no, and then try to justify that ‘its not the same thing’… but it fucking is! So, context, hypo, ur GF gets sexually assaulted by ur lesbian friend… how would she feel?\nGary committed a crime, but YOU let him off, and now hes making up the narative, and the mum and GF are on his side. I get that hindsight is 20/20, bt you should have ‘restrainted’ him and left. Clearly gf is not worth the trouble.", "NTA. I’m so sorry. You were sexually assaulted. If you were a woman and he were straight, the police would have been called. File a police report", "NTA\n\nGary is a major dick. The flirting and being playful is one thing and you seem to be a good sport in general. That as grab into the taint zone is not consensual and instantly ickifying. That's sexual assault. You should have \nPut a stop too it and it speaks highly of you that you didn't get physical at that point. (that's what it feels to be a cocktail waitress by the way). No reaction you've had is colored by homophobia -- he wouldn't take no for an answer. He had no right. He had no leg to stand on. He should apologize. \n\nI'm sorry that happened to you.", "NTA He literally sexually assaulted you idgaf what his sexiality is, that's not ok.", "NTA. This dude is a predator.", "That is sexual assault/harassment I would of knock that fucker out", "NTA. You were being sexually harassed and you set a boundary. Gary needs to check himself. Demanding not to be assaulted is in no way homophobic.", "NTA.\n\nYou were sexually assaulted.", "NTA. At all. This is assault and not intolerance. People do not just get a pass to assault because of their orientation. Nope. Kay is an AH for dismissing this, it’s extremely disappointing to read. I would be burning bridges for life.", "The fact he kept it going even after it clearly bothered you and then assaulted you and nobody cared? You handled it better than I would have and I would have made a point right then and there him or me and if they choose him fuck that whole family get a new girlfriend", "NTA. That is a good example of sexual assault that men should but don't report.", "NTA - you got sexually assaulted and harassed.", "Nta\n\nFirst of all, Gary sexually assaulted\n\nSecondly, the only homophobic person in this scenario is the gay man doing what he did and thinking it's okay", "NTA. I’m so sorry. You were sexually assaulted. If you were a woman and he were straight, the police would have been called. File a police report", "Nta. That is 100000% sexual assault", "NTA. This is a pass nobody, regardless of sexuality should get.  Next time you feel uncomfortable with a gay man's advances, nip it right then and there. I don't care whose uncomfortable with it, none of what Gary has said or done is okay in the slightest. I have gay friends and have defintely seen some cross boundaries. If I see them being inappropriate towards straight man, I end the friendship. Why? Because you dont disrespect peoples boundaries. You should be reevaluating your girlfriend and her choice of friends. That's just the way he is, is a sick fucking excuse.", "It's not homophobic to not want to be sexually assaulted wtf. \n\nThe fact they're encouraging and enabling this grown ass man to go around groping people is disgusting. NTA. He should be locked up as an offender", "It's not homophobic not wanting to be harrassed physically and/or verbally. Just because he is gay, it doesn't mean he can't SA someone, just like how society thought women can't SA men. You are NTA, and it's better if you don't go around him anymore. Kay and Sara should not be so chill about it.", "I have a lot of gay friends (I’m straight), and I can confidently say NTA.  That’s line crossing and unacceptable.  Sexuality isn’t an excuse to be abusive.", "NTA, as a woman myself it’s literally clear cut that’s SA? What the fuck are Sarah and Kay on about?", "He sexually assaulted you. If that's \"just how he is\" I simply would stop being around him and anyone who supports him. NTA \n\nIf you were female and someone gropped your breasts, there would be uproar", "NTA, that's obviously SA, and getting angry at him for touching you definitely doesn't make you homophobic. You just stood up for yourself.", "Nta that’s literally sexual assault. If you were a woman everyone would be telling him to cool it, but now you’re homophobic bc you don’t want to be assaulted? Fuck that noise if Kay doesn’t tell her mom off and Gary and tries to EVER make you go around him again break up with her. If my boyfriend ever let a man touch my body like that and then try to make me see him again I’d dump him in a heart beat and beat the guys ass. I’m a woman but Idgaf this is not okay and you shouldn’t have to act like it is. Edit: I didn’t read the last line bc I was so upset over this bs but yeah no break up with Kay. She’s a **terrible** girl friend. How would she feel if a straight man did this to her? This is not acceptable in any way. Gay or straight, no one should touch anyone’s body without **consent** and he never had it. Even the comments are just so disgusting and the fact that everyone tells you “that’s just how he is” yeah Yk that’s only acceptable when “the way he is” is like making jokes all the time that aren’t funny, not crossing your personal fucking boundaries. Kay is an awful person and it only makes sense that Sara is her mother 🙄. Sexual assault is sexual assault it doesn’t matter who the perpetrator is or the victim.", "He's overstepping boundaries and using being gay as an excuse to touch you that's sexual-harassment and they're enabling it. I wouldn't go around him anymore because people like that you don't trust.", "NTA. That is sexual assault. \n\nI'm very sorry that happened to you. I've been groped like that, and it sucks.", "You were sexually assaulted. It was wrong and you should have been supported by those that care about you. \n\nNTA", "That's assault, brother! \nSeriously though. It is.  How would people be reacting to this is your gf's mom's friend was straight and you were a young woman instead of a young man? The reaction should be the same.", "NTA, Gary assaulted you and he’s lucky all you did was warn him before leaving. He could be missing a couple teeth or have to explain his behavior to LE…", "NTA - Should've lamped him. Sexual predatorr, sexually assaulted you.", "NTA. Gary sexually assaulted you. No one enabling him deserves to be in your life.", "NTA\n\nYou were constantly harassed and subsequently assaulted by Gary. Assuming that's all you said to him, there's nothing homophobic about it. You are well within your rights to set boundaries when you're clearly uncomfortable, but I do feel like you should've spoken up earlier to him about how his actions made you feel, and not just your gf and her mother. It really seems like no one ever tells him \"No\" and, in that sense, unfortunately you contributed to that as well and enabled his behaviour.\n\nAgain, assuming you didn't skip any important details, gf and mil should be on your side and if they can't understand why what he did was wrong, then maybe you should move on and seek better company.", "NTA. Not even a little bit. You were more tolerant of his harassment prior to the incident than you ever had to be, and everyone here saying this was sexual assault is right. Fuck everyone taking his side over this. It isn't homophobic to assert a boundary after someone grabs you like that. He's shirking responsibility and pulling the oppression card, and it's not okay on his part. He's a creep, and had I been there (had anyone with sense been there, for that matter) there would have been problems without it needing to happen again. I'm sorry you're being put through this. Sorry to be blunt, too, but you deserve a partner who will stick up for you. She needs a wake up call, and to be on your side here.", "NTA. Lol what an idiot. As a straight man if I groped a woman's ass would I be straight phobic? No. I would be jailed. If it was me in your place, Gary would be going home with a broken nose. That's straight up sexual assault and harrasment. If your girlfriend is siding with him, or refusing to take sides in this matter citing that he's an old friend or some other shit, break up with her.", "NTA. It’s not homophobic to not want to be assaulted", "Nta. Gary is a predator. You were sexually assaulted and harassed, anger is a perfectly reasonable response to that. If your girlfriend doesn’t see that you need to have several very serious conversations about it because this is NOT okay.\n\nGary is using his sexuality as a means to gaslight you into believing you were the one in the wrong when he was the one instigating. Please consider filing a police report. There should be footage available to submit as evidence most likely. At the very least this puts it on his record that he has a history of groping people in public.", "NTA, I don't give 2 fucks what another person is in to. That doesn't give them the right to sexually assault someone and then cry about it like they're some kind of victim, just because their predator ass got called out. If anyone touches me in that manner without my permission, they're getting a 3\" platform boot to their crotch. Not one fuck given. Your gf and her mom suck. They're enabling a predator. Gross.", "He sexually assaulted you and he’s a total creep. Your girlfriends mom sucks too. I doubt Sara would have taken the creeps side if her daughter was the one assaulted.", "Oh, so Gary regularly sexually assaults other men and they look the other way? \n\nIt's not homophobic to not appreciate this kind of behaviour. Not only are you straight, but you have a girlfriend. And you never consented to him touching you in any way. \n\nThis is likely a reason Kay was single when you met. This is absolute bullshit and if she won't back you up, break up with her.", "You've been routinely harassed, assaulted and been expected to put up with it and \"take it as a compliment\". You've done nothing wrong\n\nIf you gf allows her friend to routinely harass and assault you, I'd be ending the relationship. She and her mother are using the exact same excuses as the friends of guys who go around harassing women at bars and ought to be held to the same standard. The fact they brush it off too raises a bunch of red flags.", "NTA\n \nGary is out of control. Press charges if you  can! (I don’t know how.)I am very sorry this happened to you. In addition to violating you he’s frying to ruin your reputation!  There already are problems .  :(", "NTA I’m glad you stood up for yourself", "NTA! That’s sexual harassment at the very least, but I think it’s sexual assault. Would they feel the same way if a man did that to a woman? There’s significant amount of gay men who always think they have a pass to do and say whatever they want. These are the same ones who think being racist is ok because they’re a minority too. I feel like this is the old guard of gays, don’t think the younger ones are like that as much.", "NTA that’s blatant sexual harassment and he can’t get away with it just because he’s gay", "what if you are the prize. like that movie when they find someone and take them home to be sacrificed to the family. maybe this is how they find boyfriends for Gary. \n\ni would question your girl why she is ok with people touch up on you, man (or woman).  if she ok with dude doing it, will she be ok with her mom or a woman doing it", "What if you had a friend who treated your girl like this because “that’s just how he is”? She would be fucking hysterically ready to leave you for not having her back.", "NTA. It is not ok to touch other people without their consent, ever. His constant sexual comments would make most people very uncomfortable. It sounds like you've put up with it for a long time, longer than you should have had to.  At this point it would probably be a good idea to have a chat with Gary and explain to him that he's being inappropriate and it needs to stop. If he's a decent person he'll respect that.", "NTA. Don't you dare even wonder if you are at fault. Nope.\n\nOMG no dude not at all. He basically sexually assaulted you. Honestly if your girlfriend is acting like this after a man she knows did this to you and not even standing up for you then you are better off without her. Period.\n\nIf someone did that to my guy, no matter who it is they are gonna be in huge trouble. \n\nI am surprised that they are taking this so casually, calling you a homophobic and stuff. Wow. Gary, Kay and Sara are definitely some people you need to stay away from.", "You're a very patient man. I probably would have knocked him tf out, you were sexually assaulted.", "NTA. He sexually assaulted you. Might be worth reporting him if you feel confident enough to do so. The venue might have cctv footage of the incident.", "NTA You were sexually assaulted - not wanting to be groped doesn't make you homophobic, and it's fucked up that Kay isn't defending you. Time to pull out the \"if this was within the norm of I was a woman instead of a man how would you react\". You deserve to be in a safe environment; Gary pulling out the \"homophobe\" card is a classic predator tactic \\[\"whoa, you're overreacting, I didn't mean anything by it, you're too sensitive\" etc\\].", "Gary played the gay get out of jail free card.\nFact is if Gary did that to a woman he would and SHOULD be charged. I wonder if the bar would have footage?\nIf your girlfriend can't see this is wrong and doesn't support you I'd be leaving that relationship.\nThat shit is not OK\nYou are NTA but Gary wants your AH!!", "NTA, but why not just file a police report so Gary and Sarah knows the seriousness of this... because they honestly don't. \"How he is\" will land him in jail... If it wasn't you, it'll be someone else.", "Nta. That's sexual assault. Unwanted sexual advances and touches. I think you need to leave as they've shown you they're perfectly okay enabling a man to assault you.", "YTA for not breaking his face that last time.\n\n\nEveryone else are AHs too for enabling such sh*tty behaviour.\n\n\nI usually avoid suggesting break ups but if your Girlfriend does not change her attitude and side with you, you better find someone else. She's not worth it then. \n\n\nOther than that, of course you are NTA.", "NTA. As for the women defending him, ask how they would like you to respond if a straight man was sexually harassing, then assaulting, them. Because that's what this is.", "NTA ur gay ass friend personality is based off being gay and gay only. No disrespect to gay people but bro is harassing you u have the right to be mad", "Lezzie here - definitely NTA. Sadly, sexual harassment and assault is very common in the lgbtq scene and gets normalized in the name of sexual freedom and pride. I’ve had lots of guys assault me at gay clubs, much more than straight guys at normie bars.", "i dont even have to read it to know youre NTA", "NTA", "NTA and you should’ve given him the good old left right good night.", "NTA", "I honestly didn't read anything but your title.. you are not an asshole for expecting someone to listen to your boundaries. No matter the details.. You have boundaries that need to be respected.\n\nEdited for typo..\n\n Edited again after reading the whole thing.. Definitely NTA I'm sorry you were violated like that and that the people around you make excuses for horrid behavior.", "Nta", "Excuse me, isn’t this sexual assault?!", "Horrible that they all stood by and did nothing as their creepy older friend sexually harassed and eventually sexually assaulted you. I’m sorry that Happened to you OP. You didn’t deserve that and you don’t ever need to tolerate that treatment from anyone. Stay strong", "That's terrible and I'm sorry it happened to you.  It has nothing to do with being gay and everything to do with being willing to repeatedly harass and assault someone.  Obviously it wouldn't be okay if a man did this to a woman.  It wouldn't be okay if a woman did it to a woman.  It wouldn't be okay if a woman did it to a man.  If your GF doesn't get how violating this was and stand up for you, she's not a good person to have by your side as you go through life.", "Nobody, male or female, has the right to touch you", "Gary is TA and Sara is an enabler! You were sexually assaulted, no if and or buts about it.", "It's not homophobic, it's someone completely disregarding your boundaries and claiming homophobia as a defense for his sexual harassment. It's disgusting. It's harmful to those in that community! \n\nKay didn't defend you and say that shit was WAY over the line? Instead wanted to STAY?! She completely disregarded you... this is so sad. \n\nNTA", "NTA, he was harassing you!! I'm sorry this happened and that noone stood up for you.", "He sexually assaulted you. NTA.", "HARD NTA. That’s literally sexual assault!!!!!!!! You can even denounce him for that shit! Wtf is wrong with that dude. I’m so sorry that happened to you. As a gay guy, that behavior is not only intolerable to me but straight up beyond disgusting. If him (AND Sara) doesn’t apologize for it I would tell them to go fuck themselves hard. And even if they do, you still have the right to tell them to fuck off and don’t talk to them again\n\nHonestly, in my opinion, you should 100% break up with your girlfriend if she doesn’t take your side on this. It would mean she’s an hypocrite who condemns sexual assault.", "NTA that's assault \n\nWhat's up with gay guys touching people sexually? I've personally been through it before.", "NTA! He sexually assaulted and the FEMALES think it's ok? What is a straight male did this to them??\n\nI'm bisexual and am not ok with this. He's consistently made you feel uncomfortable time and time again and your girlfriend should have stuck up for you and told Gary that what he did is not ok.\n\nDoes he force himself on other gay men and think it's ok? If you were female, I bet you they would have stood up for you.\n\nWe need to do better as a society and recognize this predatory behavior.", "You were sexually assaulted, and your gf thinks there's two sides to this? NTA, and your gf needs to think about how she'd feel if some guy who wouldn't take no for an answer grabbed her by the 😺. And yes, A H gf, this is the same thing. It's not ok just because the perpetrator is gay.", "NTA - I had a chick drag me to her gay friend's birthday party. I didn't expect it to be a full gay club event, but I was with my girl. We met her friend, and I respectfully let her introduce me, shook his hand, and wished him a happy birthday. This guy turns to her and says, \"oh he's handsome, you sure he doesn't play for both teams?\" My girl immediately quashed that shit and said \"WE\" don't play like that, and the rest of the night we were cordial. I didn't have to say a word.\n\nYour girl has an obligation here. The same way you'll protect her from a friend (or anyone tbh) saying some sexual shit to her is the way she should step in.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (24M) went out with my girlfriend (22F), her mother (50F), and her mothers friend (40M) for a night of bowling and drinking. \n\nFor past context, I’ve known my girlfriend, Kay, for around 6 months and have met her mother, Sara, multiple times. Sara has a friend, Gary, who is gay and makes it a point he’s into me when he’s around. Gary is very out there with the things he says, once he told my girlfriend as I was next to her, “I bet his dick is huge” and another night complimented my ass well over 10 times, and “jokingly” said I could stay at his place. Every time in the past I’ve just brushed it off because my girlfriend and her mom have told me that’s just how he is. \n\nNow to bowling and drinking. Gary drives all four of us to the bowling alley.  We bowl a few games, have a few drinks, everything is good for well over 2 hours. After we bowl we all went to a bar to continue drinking and enjoy the night. Another hour goes by and we’re all pretty drunk. Gary plays a very sexual song on the jukebox and begins singing/rapping it to me, okay. 10-15 minutes later, Gary tells my girlfriend, again as I’m standing next to her and can hear him, “I’m going to be the one to suck his dick at his bachelor party.” I gave Kay the thats too much for me look and Gary saw, Gary moved away elsewhere. 5-10 minutes after that, Gary is standing next to a random bar dweller (40M) behind me and Kay. Kay is sitting on a chair, I’m leaned over it behind her, and Gary grabs my ass but deep enough to touch my balls a little bit. I don’t know how to explain the gesture but basically rubbed his hand from my balls up to my ass, squeezed my ass and let go. When that happened I turned around and said “If you do that again there will be a problem. I promise.” with a pretty angry look on my face. Gary said nothing in response. I then told my girlfriend I was ready to leave and call it a night. I was uncomfortable and kind of upset Kay or Sara didn’t say anything in response to Gary touching me. Sara, her mother, did not want us to leave but I got an Uber for Kay and I and shortly after we left.\n\nA couple hours later, Gary had texted Kay telling her I was homophobic for what I said. Gary and Sara were still at the bar. There was absolutely no reason to text her that. Kay did not respond to him, but now there’s tension between all of us. Sara took Gary’s side. I’m upset nobody else stood up for me, and Kay is basically ignoring the entire thing, saying that’s how he is and she doesn’t want to drag on further. I’m left wondering if I’m in the wrong for snapping at Gary. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Gary is an a hole. Do not be in his presence at all.", "I have alot of gay friends and they would never do that without consent let alone in public", "NTA. If the genders were different, what would this be called?\nYou are being harassed, that's it. Irrespective of the gender and orientation, this is harassment.", "NTA you weren't being homophobic, you were sexually assaulted. Gary's behaviour towards you has been completely inappropriate and \"that's just how he is\" explanation is bullshit.", "NTA. Get out of their lives quick. They gay is harassing you, the mother tolerates it, your fiancé enables it.", "NTA. Gary is Kevin Spacey", "Absolutely NTA!  How is Garry's actions any different than say if you were to harass some girl with sexual comments, and then go and grope her.  I'm sure the police would be right on you like shit on a stick!  This asshole is doing the same thing to you!  The ones who are the assholes here, are the ones who are condoning this kind of behaviour, and brushing it off as \"Oh, he is just like that.\". This guy is mentally ill.  Rejecting a pass from a gay person does not make you homophobic.", "NTA. Being gay does not excuse creepy behaviour. He made you feel uncomfortable repeatedly, and assaulted you. He is disgusting, and you were absolutely right to call him out. I am surprised Kay and Sara aren't saying anything.", "Nta. Sexual assault in any orientation.", "Nope. NTA. Anyone has the right to have personal boundaries respected. Sexual orientation is beside the point.", "NTA\n\nHe sexually assaulted you and your gf and her mum not only allowed it to happen but actually ignored the fact it did happen just to make you the bad guy. \n\nAsk your GF if some random bloke had done that to her and you sat silently, would she be okay with it? Because if the answer is yes, you need to evaluate your relationship.\nIf the answer is no, she’s a hypocrite. \n\nAlso as an aside, you’re not homophobic for not wanting someone to grope you. You’re just a normal person who doesn’t want to be sexually assaulted. Gary is an asshole who likely is only trying this because he believes he’s in a superior position and you wouldn’t fight back. When he realised he was wrong he pulled out the classic discrimination card that people like him will always play when called out. Shit I like dudes and I’d never dream or grabbing a random guys ass.", "Sounds like sexual assault to me. NTA", "NTA. This is the kind of behavior that gets gays beaten up. He had no right to touch you, no right to say that garbage to you since he was aware you were in a committed relationship and not gay. Honestly, he sexually assaulted you. You should call the cops.\n\n He's TA.", "NTA Imagine a woman in your situation being grabbed by  a man and being blamed for reaction which wasn't much imo", "Absolutely NTA.", "Nta and call the police. Not everyone has the courage to say stop.", "NTA - I think the bigger question is what kind of partner could Kay possibly be if she doesn't even care that you were sexually assaulted?  Being sexually assaulted is bad enough, but Kay already knew you were uncomfortable with the way Gary was treating you and didn't think you deserved enough respect for her to even suggest he not mess with you like that.  Between the three of you, you are obviously at the bottom of the totem pole.  Do yourself a favor and get out of the relationship.  If you decide to get married, you'll have a wife who thinks sexual assault isn't that big of a deal so she'll ignore any indications if your child has to deal with sexual assault in their lifetime.  \n\nMy only other thought is you've said some homophobic things in the past and now Kay and Gary are just messing with you for entertainment purposes.  Same advice; get out of the relationship.  It would be interesting to know if you're paying for her food and shelter or if she has her own place.  People who actually care about one another don't usually let something as serious as sexual assault go unanswered.", "NTA you’re not homophobic you were sexually assaulted", "My dude.\n\nYou got sexually assaulted.  That's not okay.  You're not the asshole.", "As this talks about perception i watched a social experiment about sexual harassment.\n\nA woman was in a shopping centre and her bf is trying to touch her sexually, trying to kiss her. She is walking away shouting, no, no, leave me alone, i dont want you to do that. Many ppl came to her rescue, asking if she ok, did she need help, stopping the man getting to her.\n\nNext the roles were reversed in the same shopping centre and the guy was saying, no, no stop touching me, leave me alone, please stop touching me. Do you know no one came to his aid other than other men to say, shes hot man why would you not want her to touch you, whats wrong with you shes all over you, whats wrong with you why are you saying no.\n\nThat really shocked me, same senerio but a man being sexually harassed wasnt even considered and actually he was laughed at.", "NTA That's very aggressive behavior. There is no  excuse for groping someone nonconsensually. I will never understand the appeal of obnoxious catty gay dudes to straight women.", "Sexual assault is sexual assault regardless of who it is. NOBODY gets a pass. Nobody.\n\nNTA", "NTA. He has sexually harassed and sexually assaulted you. How can he do this to you, and then when you get mad, pull the \"Your homophobic\" line.", "NTA. Should have just knocked his teeth in. That’s not okay. If a man were to do that to a female, he’d be in cuffs. But because it’s a “guy” you are supposed to be okay with it. And if not you’re a gay bashing homophobe. This is what our world has turned into.", "NTA-You need to break up with ur gf since she didn’t have ur back with Gary being a creep and pretty much assaulted you", "Pretty sad that when gays assault you it's just \"Accept them!\". Many people take advantage of the fact that right now many people support the LGBTQ community.", "INFO\n\n> we’re all pretty drunk.\n\nBut Gary was driving?", "I would have knocked him out", "It's homophobic that you didn't make a problem for him then and there. Shouldn't be treated different. NTA", "Wtf. It’s homophobic to not want to be sexually harassed? I didn’t know as a woman that I could gripe any woman I want to or they me - funny that", "YTA because in today's world rejecting a gay or trans person's sexual advances means you're homophobic not that the person is way out of line/ s. NTA, it's a wonder you put up with this creep Gary for so long.", "Being into men doesn't mean he is allowed to make you uncomfortable and then be butt-hurt over your response.\n\nClearly this is an unacceptable behavior. My guess is they are afraid to get him upset and calling them phobic too but encouraging him to harass you should be a huge deal breaker. \n\nNTA", "Big time NTA. He violated your boundaries, full stop. How would your gf's mom feel if Gary was straight and had done a similar thing to a woman? Being gay does not give anybody an excuse to touch another human without consent. Your gf needs to get out of denial and have your back against her mom and Gary if there's going to be any chance of this turning out ok.", "I’m really sorry your not getting recognised. Your definitely not in the wrong, I know some homosexual people have a thing with turning straight people gay, sounds like your his target.", "NTA. That sounds like sexual harassment to me, and you responded the way I would if some man grabbed me. I’m gay/nb and I would be the first one to tell you if you were being homophobic.", "HOLY CRUD SOOOO NOT THE AH!!!!!!!!\nI had something similar, \n\nWent for a stroll with a group of mates, and in this group were people I hadn't met but they were close with others in the group. One guy was gay and very open about it which I didn't mind, but then not long after giving me a few glances ,he started laying into me by saying things like, \"i bet you'd be amazing to bed\" or \"I wanna **** if you're free\" and it got uncomfortable for me so I politely told him to leave me alone. He blew it way out of proportion, calling me a homophobe in front of everyone and making me the bad guy pretty much. Everyone stepped in and was calming him down when one of the fellas in our group suggested bro'ing it out with a quick embrace and hand shake. I responded with a confused \"sure,\" and when me and this fella got close enough, he licked me from my neck to about my cheek before I could pull away. And you can bet the moment I had the space, I put my fist through his face and left him sleeping on the concrete pavement. Everyone in the group essentially told me I was an AH and didn't want me around, that was the last time I seen any of them socially.", "NTA. Gary is a predator who sexually assaulted you and has been openly trying to groom you. Yes, a predator can groom an adult and you're probably not the only person he's acted this way towards. If Sara is going to take the side of someone who has openly creeped on you for as long as you've known her, she's not worth your time.", "You wouldn't be TA if you split this dudes wig open 10 ways from Sunday. NTA. Also ditch the girl. She doesn't have your back.", "NTA - I'm so sorry you experienced that. This is sexual assault and Kay shouldn't just not be avoiding the issue but actively calling it out. I try to avoid the cliche \"break up\" Reddit comment but truly this is not okay and I strongly encourage dumping her ass immediately.", "What the hell. That grown ass man sexually assaulted you... What an absolute creep. There are three perfectly good reasons for him to back off:\n1) You have a girlfriend\n2) You are not interested in him\n3) He is close to DOUBLE your age. \n\nBeing upset at an unwanted sexual advance is not homophobia, it's common sense, and he doesn't have any. I don't think your gf's mom got the whole story. NTA.", "Nta, my friend it really isn’t unreasonable to not want to be sexually assaulted and the gf really isn’t great for at least comforting you. \nI’d be absolutely livid if someone SAd my bf, especially doing a disservice and saying you’re homophobic for not enjoying it. \n\nI wish you well op", "flip the genders, and what does it sound like....? Exactly what it is: sexual misconduct, 100%. Not cool. NTA", "You are absolutely NOT the AH!!!!  That guy is a disgusting human being!!!!!  He had legally no right to touch you and that is literally sexual assault!  He's lucky you didn't go straight to the cops!  If you haven't told your girlfriend all of this right away, please do so!  I don't know what your sexual orientation is, but regardless, it's obviously you have zero interest in this sicko and he needs to get his brain in check because what he is doing is NOT normal or right.  It's disgusting and would be immediate cause to get the police involved if he does anything like that again.  Please don't do anything more than call the cops because it'll only get you in trouble, but man!  That guy is beyond disgusting.  If her mother is taking Gary's side and Kay isn't wanting to do anything to defend you, then maybe you would be safer to call things off altogether.\n\nI'm not homophobic.  I AM against anything like this in general.  I meant to add that I'm terribly sorry this happened to you!", "NTA you were clearly sexually assaulted. I don't know man your girl should have stood up to you. Your girl and her mum are enablers. I'd re-think about the relationship tbh.", "God, there are few things I hate more then the “That’s how ___ is!” Excuse. It just means “it’s less effort for us to tell you to get over it then to tell them to change” and it’s ridiculous. NTA", "You and hopefully Kay will agree to GO PERMANENTLY NO CONTACT WITH THE BOTH OF THEM also PRESS CHARGES for sexual harassment!", "NTA! I’m sure he’s done this before. Also, if genders were reversed…situation may have ended differently.  Still wondering how this relationship is going.", "NTA they are all bad people, Gary is a sexual predator and all the rest are his enablers.", "NTA! Gary is a pathetic loser, my goodness. I do hope your girlfriend wakes up and defends you. How often will you have to see Gary if you remain in this relationship? Because your girlfriend and her mother have made it clear they respect Gary’s wanting to sexually harass you, over your BASIC NEED to be comfortable! Truly, what a loser of a man this Gary is. Sexually harassing someone half his age and then blaming it on homophobia when he assaults you. All at the grown age of 40! Your girlfriend’s mother is also a loser after being okay with such behaviour. I hope you’re okay, and sorry you’re going through this. Do not let those pair of losers gaslight you. I’d consider your relationship, personally. If my boyfriend (or anyone I cared about) was being sexually assaulted by my mother’s friend, I’d tell both my mother and her loser friend to fuck off, because I’m a NORMAL human being! Kay needs to take her head out of her ass. Unless she’s scared of upsetting mummy, in which case this is your future - you being uncomfortable with mother dearest and your girlfriend pretending everything is okay, ignoring your feelings. I hope you’re alright. Everyone sucks in this situation except for you.", "I would have floored him , nobody touches my poopbut", "NTA at all but you need to have a conversation with your girlfriend about this. My GF works in an industry where she has a lot of gay friends and co-workers, and I've encountered the overly forward gay friend many times before when going out with her. She knows to quash that immediately, and because she sets that boundary, they're generally very respectful of it.\n\nIf she's going to continue to just ignore it, she's also a big part of the problem.", "NTA. It had nothing to do with homophobia.", "NTA, that was sexual assault, you were sexually assaulted.", "NTA, what he did to you is a second degree misdemeanor where i live. being gay doesnt mean you can assault other men as you see fit.", "Definitely not the asshole. This man grabbed your whole ass. If it was a woman saying this happened to her, everyone would agree that it was assault. You’re valid in your feelings and you’re not the asshole and quite frankly you’ve been very lenient and nice for not saying anything sooner about the sexual remarks.", "NTA, that's sexual harassment and or assault, if your girlfriend doesn't realize that and nor does her mother it's time to reevaluate your relationship with Kay", "I’m gay and I’d be annoyed and frustrated with that kind of behavior towards me from a total stranger. NTA", "NTA. This isnt about being homophobic. It's about him crossing your boundaries knowing full well you're uncomfortable with it. And your gf isnt even acknowleding this? Does she even love you lolol", "NTA. What he did was sexual harassment.  Document it so that if he does it again, you would have proof to report him to the authorities.", "NTA \n\nI'm so sorry you were sexually assaulted by this person.. I recommend staying away from all of them. If a woman was treated like this by a man they would call the police and press charges.  This is assault. There is absolutely no excuse.  This person's gender is irrelevant.  He made you uncomfortable, you said no multiple times and he persisted. He is a preditor and from the sounds of it has all intentions on raping you. (Says he will suck your dick) Go no contact immediately. \n\nI would ditch the girlfriend too because she is legitimately allowing this to continue and trying to shame you into letting it happen.  There is absolutely no way in this universe this is ok.", "Might want to rethink the whole bunch of them if they all think this is fine. I guarantee if this happened to a woman people would be outraged. I'm outraged for you. And if your gf doesn't seem to get it, show her these comments. Or just dump the whole lot of them. It is NOT ok. Nta", "Totally NTA. What he did to you would be classified as ***sexual battery*** in many jurisdictions - no different from a straight guy groping a girl at the club. The fact that both your GF and her mother are taking his side (Mom openly, GF by \"ignoring\" the issue) is disgusting, and IMHO you should cut both of them out of your life.", "NTA. \n\nIn the future do not brush it off. You don't have to be a dick about it the first time, just tell whoever is making comments or whatever that it makes you uncomfortable and to please not do that. Increase in firmness with repeated offences to the point where you just cut off all contact with the person. \n\nI find it hard to believe this guy didn't know you were uncomfortable but if you never said it, specifically in front of others, he can argue that he read it wrong and thought you were into it. Having receipts of repeatedly stating your boundary helps your case and often is enough to stop this shit. Either because they are misreading or because they see you're not a pushover. Sometimes it makes things worse but then you get to expedite removing that person from your life so win-win. \n\nThis sounds like a cut off all contact situation. If he is there, you are not. If they try to be sneaky you will get up and leave. Etc. But you may lose your girlfriend in the process and if not it almost certainly will strain the relationship with her mother. But, personally, I would not continue contact with this person. They aren't safe to be around.", "NTA. Ask your gf how she would feel if a male friend of you mom did the same thing to her. Don’t be rude about it, but she needs to understand that you were just sexually assaulted and just because the assaulter was gay doesn’t make it okay. Sorry you have to deal with this mate, I would have done far worse in the same situation so good on you for keeping your cool.", "NTA. So harassing and sexually assaulting men is \"just how he is\"? The fact that no one stood up to you is heartbreaking. The fact that they are letting him get away with it is maddening. I'd dump everyone, Kay, Mom, and Gary.", "If you had reacted this way to his first couple comments maybe I could see it coming off some kinda way, but this is assault. Being gay isn't carte blanche to be a creep. I'm bi and would have responded the same way. It's not homophobic to stand for yourself. He's an asshole and your girl and her mom would be appalled if your friend acted anything like that towards them.", "NTA. That's sexual harrassment. If you sue him with video evidence you'd win. Your \"response\" wasn't a threat. Anything beyond this is debate team business.", "NTA \n\nPress charges.", "NTA, if this had happened to a female, this would've been automatically labeled SA, and people would be losing their mind. \n\nThis is straight up, SA, btw. Gary, just tryna hide behind the I'm the victim bs", "Something is wrong with your gf", "it hurts my heart as a member of the community that some people in the community use their gayness as a \"pass\" to touch any person that they want with no regard to how the recipient might feel. (I've been there, too.) not once did you ever consent to being touched, let alone grabbed inappropriately by a man twice your age. \n\nNTA. good on you for standing up for yourself. I hope your gf comes around to standing up for you, too. \n\nbest of luck to you going forward", "NTA nope not in the wrong I am an ally and will not put up with any homophobia but just as I would consider it assault if a guy did that to a woman I see it the same in this situation, many think they can be as handsy as they want and claim people have an issue with their gayness if it is unwanted but its not unreasonable to expect other people to keep their fucking hands to themselves and sadly as an ally I have had to come to the realization that that is a big reason many people hate gays I have seen it tons and how the fuck do you try to tell someone that was just assaulted to let it go to not be hateful that one had me the bad guy a few times for defending someone that was 100% in the wrong", "NTA\n\nYou were harassed and assaulted and nobody cared or cares and to boot, they're putting the onus on you. All that being said, it's time to make her an ex-girlfriend. You will never mean more to her than her sex offender friend does", "How would you or the mother.feel if it were a 40 year old male doing the same to her 22 year old daughter?\n\nYou can bet your ass (joke intended) that her opinion would be completely different.\n\nHe harassed and assaulted you and she’s enabling that behaviour.. You called him out. \n\nIf you have a non-emergency police number where you live, call it and report it with any luck the bar may have cctv which might have caught it.", "NTA. You were sexually harassed and sexually assaulted many times by this guy. He is a fucking creep and should be in jail.", "NTA. Being gay doesn’t give anyone a pass to be a creep lol", "NTA. Sexual assault IS sexual assault. You experienced that and no one can tell you otherwise. I’m sorry that happened and you’re in a rough spot. I hope you protect yourself and keep as far away as you can from Gary. If that means saying goodbye to gf and gf’s mom… so be it. You need to keep safe. Give them a chance to listen and for them to hear you again… if not… RUN\n\nTrust me I would never ever let that slide with something like that to my own partner. The whole point is trust. If Sarah isn’t there for you now then when will she be? Is that something you’re willing to test out?", "You literally got sexually harassed and assaulted and your girlfriend and her mother did nothing. NTA and you'd be wise to reconsider your relationship if your partner doesn't even want to stand up for you.", " NTA. You are allowed to defend yourself when someone sexually assaults you. And your girlfriend sucks!", "NTA, that’s sexual assault and I’m very sorry that happened and you were put in that situation 🚩🚩", "This is one of those ideas, it’s not on my side so it’s bad. \n\nNTA", "Ew, he’s sexually assaulting you! How dare he do that, and how dare no one say anything?!\n\nPlease refuse to hang out with him again. NTA", "NTA. Being gay does not mean you can sexually harass people without consequence. “No” still means “no”. (I mean, realistically, how cool would you be with a random woman behaving like that, especially when you’re in a relationship? Most people do not particularly want to be randomly groped and fondled except for in very specific environments, which normal bars are not.)", "I am so sorry, you are not the asshole, he is, he sexually assaulted you, and your girlfriend and her mother did nothing about it. He had already crossed the line making those sexual comments about you.", "NTA. It doesn't matter if Gary is straight or gay! He's a creepy perv who sexually assaulted you. I don't know a single person who would not have reacted the way you did. Your fiance and her mother just stood by and didn't stick up for you. I find this more disturbing to be honest. This is a window into what your future looks like if you marry into this family, OP. Have long hard think on whether you want to marry this girl.", "NTA \"that's just how he is\" so he just goes around sexually harassing/assaulting people ? And they just let it happen ? I'm so sorry that's terrible. \n\nI'd dump her tbh, that's so fucked up & unacceptable.", "Leave the partner, get out.\n\nIf they're okay with being around someone who is trying to grope, touch, or sa you. You don't deserve that.\n\nI'm trans, pan. I've had my fair share of all henders of people try touch me. I know the feeling.\n\nI'm sorry you went through that, that's not fair. \n\nBut honestly. I'd leave.  The partner and mother are red flags.", "NTA. Gary overstepped wayyyy too much. Personally I would’ve put an end to it the second he made the dick comment.\n\n>Gary had texted Kay telling her I was homophobic for what I said.\n\nAnd the cherry on top, the “homophobic” card. When people throw around words like that they not only ruin the reputation of the lgbt, but they also water down the word AND insult victims of ACTUAL homophobia. It’s so silly. Like imagine if Gary was a woman who did the exact same thing and when rejected said “you’re heterophobic”. He’d be laughed at for saying something utterly ridiculous, which is what SHOULD be happening to the real Gary right now.", "I’m gay, and Gary is an asshole. Just because Gary has probably been subject to abuse for most of his adult life, does not entitle him to do as he pleases with others. Nor does it allow him to throw a tantrum crying homophobe when he gets a very blunt but very justified response. \n\nYou’ve already expressed your discomfort, several times, and non verbal counts as well. He backed off when you made a face earlier in the night. \n\nWould it be any different if a straight friend of yours groped your GF’s ass? No. \n\nGary is a predator, and you are NTA.", "NTA. Tell him if he does anything else to annoy you then you'll press charges cause what he did is illegal.", "NTA. That's sexual assault. Giving a stern warning after an someone assaults you is not \"snapping\", it's stating a boundary that should've already been respected without needing to be expressed. Gary's a sick f\\*\\*k.", "NTA. We've all known a gary, it's the type of gay man that goes around grabbing women's breasts, and if you don't approve his behaviour, you're weird \"cus he's gay, so it doesn't count!\"", "File a police report - you were sexually assaulted end of story. Please do not let this slide. \n\nAlso seriously question your relationship with your girlfriend that is ignoring you being sexually assaulted, imagine what else you’re going to have to let slide in the future because it isn’t a “big deal” to her. Plus you’re going to have to keep dealing with her mother for the foreseeable future who took the side of the person who sexually assaulted you. \n\nThis is not okay, seriously I wish you the best but you need to report this and press charges as well as consider your future relationships with these people\n\nAlso NTA like at all", "Nope, it doesn't matter who you are, what your gender/sexuality is someone touching you without permission particularly around your private areas is unacceptable!", "Not the asshole", "No that’s too much. \n\nAnd you should talk to your girlfriend seriously about this. Maybe she doesn’t see it from your perspective. It is not good that she is desensitized like that. I get upset when partners dismiss each other’s concerns so easily.", "Nta you felt violated and still kept composure even after he kept baiting you for a response.", "I'm a trans woman. It is not homophobic to not want to be sexually assaulted by someone, ANYONE, that isn't your partner(s). You did nothing wrong. Hell, I'd have stood up and punched him in his face if he grabbed me like that. Not that he would because I'm a woman, but still.  Just saying, I'm on your side. Nta. Your girlfriend should not be silent when you got sexually assaulted. I guarantee if it was her that got unwanted groping there'd have been cops called. The double standards bother the hell out of me.", "You got sexually assaulted, my guy.  Frankly, the fact he isn't in jail means you were 100x more generous than I would have been.  Protecting yourself is NOT homophobia.\n\nNTA.", "  NTA 🗣️🗣️\n\ngary harassed you bro????\nthat does not make you homophobic at all??", "Time to end things, he assaulted you and they think it's okay. If this happened to the gf or gfs mom they'd be pissed off. I'd cut my losses and move on", "NTA,\n\nGary is a predator, \n\nI'm bisexual and I would never touch or hit on a man or women if they're uncomfortable.\n\nI hate when people commit SA and then use the homophobia card whenever they get asked to stop.\n\nShow this post to these people and let them know how shitty they've been, if you were a woman and Gary straight he would be in jail right about now.\n\n\"That's just how he is\" is not an excuse for his actions, there isn't one.\n\nThere's red flags all over this family, your girlfriend and her mother both excused his actions, have a talk with them and if they don't get it, leave.", "NTA - Sexual assault is SA regardless of sexual orientation. I’m sorry that this happened to you, and that you don’t feel supported. I hope that you and Kay can have a solid chat when things settle a bit, I’m sorry that you had to go through that.", "NTA you experienced sexual harassment and assault. You have a right to file a police report to at least establish a history of this predator's behavior. If he was straight and you were a woman, it would be the exact same issue. Heck, this approaches the level of assualt Brendan Fraser faced. \n\nIf your GF doesn't support you for getting offended when someone touches your \"swimsuit area\" then you should get a new girlfriend. You should explain it to her, and let her explain it to her mom and never be around that predator again.", "NTA. That's blatant sexual assault, and his comments are incredibly disrespectful.", "Nta. I'm mad for you. If your girlfriend doesn't have your back, she shouldn't be your girlfriend. Gary's a predator. Not wanting to be sexually assaulted doesn't make you homophobic.", "NTA. You were assaulted. Period. There is absolutely nothing phobic about your reaction. In fact your gf’s friend is very lucky you didn’t call the cops or escalate the situation. Regardless of sexual orientation, it’s not ok to just grab another person because you find them attractive.", "NTA.\n\nThat’s sexual harassment on so many levels.\n\nHe doesn’t get a pass because he’s gay.", "NTA. Just another reason the lgbt community should be extinguished.", "NTA. Run from these psychos and press charges against Gary for sexual assault", "Ok change genders. You did that to a random girl, you'd be in prison quick. Probably with a busted face. But it's okay because he's gay? F that! NTA, you weren't interested and that's it. Homophobia is hating because they're gay. Not hating because they're being assholes. Gay people can be assholes just as much as straight people can. Gay rights are EQUAL, not greater than anyone else's rights.", "NTA, he sexually assaulted you. It's frustrating that people excuse this kind of treatment on anyone.", "NTA. He sexually assaulted you. What he did to you was assault. Your GF needs to understand that just like she would be angry if someone did that to her, you get to be angry that Gary did that to you. The genders/sexualities of the people involved don’t even matter—he groped you without consent. You never have to tolerate that.", "To be honest I wouldn’t even think you were an asshole if you shoved him or made a scene. It’s essentially assault and he’s 110% in the wrong and you’re 110% not homophobic for your reaction.", "NTA- I am so sorry dude. You were legitimately sexually assaulted and then gaslighted. All of them are TA except for you in that situation. It is well within your right to express to him there’d be a problem/ there already was a fucking problem with how he was being and with what he did. It’s disgusting he tried to use homophobia as his claim vs owning up the fact he assaulted you. Your gf is TA for wanting to ignore your feelings and brush past this. Your feelings matter and it’s not something that should be taken lightly. Cut your losses while you’re ahead, fuck that", "NTA. It's not homophobic to not want to be sexually assaulted. Which is what he did. Honestly I would have hit him then and there.", "NTA, everyone else in the post is awful. \n\nDump the girlfriend, a person who will stand by while you are repeatedly sexually harassed and then assaulted is not a good partner. Even worse, it sounds like as long as you are with her then you will be expected to continue spending time with Gary the creepy asshole.", "Nta. That is sexual assault. I'm so sorry. This is not ok.", "My guy NTA- I have literally threatened men with my pocket knife for less and more. Sexual assault is not okay no matter what gender it comes from or what gender it is directed at. It's not okay. \n\nBut hey remember this, hopefully you are already a guy that would defend any woman or man that is put in that position but it happens to us woman on a daily basis. If you see it, you say something, just like you wished Kay and Sara had stood up for you do it for others. If Kay cannot see how fucked up this was I think you should leave the relationship, no one that turns a blind eye to sexual assault is worth your time.", "Screw them all and press charges.", "NTA - I've never experienced it but I've also never murdered anyone to know that it's wrong.", "NTA Turn the tables. If one of your friends had done such a thing to your girlfriend or her mother, would they be ok with, “That’s just how he is.”? NO because it is sexual assault and all that talk, if you are uncomfortable with it, is sexual harassment.  Just because he is gay and flamboyant doesn’t give him the right to ignore your rights and boundaries. I have 2 gay kids, 2 gay step-kids and a gay cousin. One of them did something like this to his sister’s ex. The ex vows to never come to a family event he will be at again and I can’t blame him. It is inexcusable! Please feel free to print this out and share it with all involved parties. 🙃", "NTA.\n\nI see more red flags in this post than a professional bull fight.", "NTA - and let's think about your mom/dad having a good friend, let's call that man \"Steve\".  Steve starts making comments towards Kay. Then grabs her ass. I wonder if Kay would be fine with that \"because\" that's just the way Steve is\". \n\nAnd no, you're not homophobic for not wanting to be touched by a gay man. Sexual harassment / assault is sexual harassment/assultt. If my partner didn't stand up for me, I'd take a close look at our relationship and rethink it.", "NTA. You were sexually assaulted, and that should be taken seriously. Really disappointed in your gf’s and her mom’s reactions to this. They’re both giving it a pass because he’s gay, but gay men aren’t like that. He’s literally just a predator.", "NTA Gary sexually assaulted you. Nothing homophobic about you telling him off. But I'd leave the relationship. Your gf and her mother are excusing sexual assault in the same way as when people say \"boys will be boys\".", "NTA. Thats sexual assault if I'm not mistaken.", "NTA. People can be engage in a-hole behavior and sexual assault no matter what their sexual preference. I'm gay and if he pulled something like that with me I'd do the same thing.", "NTA\n\nYour gf needs to reply back to Gary that what he did is sexual assault.  How can people say nothing. (Female here) You are not in the wrong and why would you think that you remotely are?  Gary is a coward, to be honest you should file a report on him sexually assaulting you.", "NTA\n\nYour gf needs to reply back to Gary that what he did is sexual assault.  How can people say nothing. (Female here) You are not in the wrong and why would you think that you remotely are?  Gary is a coward, to be honest you should file a report on him sexually assaulting you.", "NTA, that's assault.an unwelcome touch is an unwelcome touch and for him to use 'your homophobic' is the same as people pulling the race card when they don't get what they want. \n\nHis advances are unwelcome, so he needs to back the fuck off.", "Definitely NTA but did you tell them what he did or was all the context you saying not to do that again. Whether gay or straight, sexually harassing someone like that is not okay.", "NTA. Gary has been sexually harassing you consistently, and he escalated to sexual assault. The fact that nobody called him out - including your girlfriend - means that they are completely fine with you being sexually assaulted when the perpetrator is someone they like.\n\nIn other words, Gary's feelings are more important to all three of them than yours are.\n\nIf I were you, this would be a last straw moment, and I'd break with Kay and block all three of them in every possible way. These are not people you can trust.", "NTA, you got sexually assaulted.  That's what happened to Brendan Fraser.  This is like if a man grabbed a woman's chest or crotch without consent. \n\nYou've been rejecting his advances all the time.  There is no excuse for his behaviour.", "NTA\n\ndude you got sexually assaulted, you were only called homophobic because he didnt want to seem like he did anything wrong.", "NTA\n\nHomosexuals can be assholes too.", "NTA I hate this so much. A similar but much milder version of this happened to my bf and no one gives half the fs they would if it was a straight man to a woman.", "bro sexually harrassed you and had the gall to call you homophobic\n\n&#x200B;\n\nthat ain't right fam", "NTA. He violated your boundaries, your rights,and he committed a crime. He sexually harrased you multiple times and has not sexuallt assaulted you. \n\nIf your gf won't defend you,  dump her ass. You deserve better.  Even if she does defend you but her mother doesn't,  I'd think twice about investing more time into this relationship.  \n\nNo love or relationship is worth enduring this level of violation and disrespect.", "NTA and if Kay will not back you up it’s time to end the relationship.", "NTA, it's not homophobic to not want to be sexually assaulted. I promise you there are lots of respectful and kind gay people who would NEVER act like that! Gary isn't to blame for being gay, he's to blame because he's a sexual predator! \n\nIt wouldn't be OK for a straight man to do that to a woman either! That's sexual assault!", "Because you said he's out there, and always \"jokingly.\" It sounds like you're in the wrong. Unless you were positive they were serious. If your boundaries are being crossed, say that. Saying there's \"problems\" is gheto af.", "NTA. If a man had treated a woman like that, there would have been a police report.\n\nGary needs to learn how to take a hint, and stop when it is not apreciated.", "NTA. You have the right to tell anyone, regardless of gender, that you do not want to be touched. Gary is an idiot. \n\nYour girlfriend is clueless. Dump her. If anyone touched my boyfriend like that and made those type of comments, no matter their gender, I would be beyond upset and stick up for my boyfriend.", "I'm part of the lgbtqia+ community, and feel free to tell him from a lezzy that I find him fucking disgusting. Sexual harassment is still sexual harassment no matter who the fuck it comes from. \n\nTalking to your girlfriend that way is also disrespectful as hell of him. NTA", "NTA. Gary is the asshole, his behaviour is deplorable. It doesn't matter if u were attracted to men or not it isn't ok", "Hell no. I would have punched him", "NTA\n\nYou mean your ex-girlfriend, right? I don’t understand nobody standing up for you, especially not someone that was supposed to be your partner. Why would you act indifferent to your partner getting sexually assaulted? Or anyone getting sexually assaulted? I don’t understand these people, I wouldn’t stick around to find out what’s wrong with them, you don’t want them around you long-term. They apparently don’t understand or value respect. It’s nothing you can fix or should try to fix. You deserve better than this.", "Take this to police in your area and file a sexual assult complaint. Make a clear cut boundary that you wont be going or coming to anyplace where this gay person will be. If he tries to do shit again, beat shit out of him like a man. If your girl has problems with your principal, leave the bit*h. Being homophobic is not crime its a choice! You are allowed to hate bad people.", "I'm hoping this is rage bait because I have this spark of optimism in me. It tells me that everyone should now be able to discern what is sexual harrassment and sexual assault. If you seriously don't know that your feelings are valid here, I feel bad about the family, friends and society that have failed you.\n\nNTA, OP. You seem to be doing pretty well, but this was serious and could traumatize some people. Take care of yourself.", "NTA, when I was in HS there was this weirdo that would do similar stuff (not sure if he was actually gay or he was just an asshole to make people uncomfortable), a friend that I worked with delt with similar (no touching however, and less overtly explicit) comments from a coworker. \n\nHis sexuality is no excuse to assault someone. Ask Sara how she would feel if one of your friends groped her vagina and ass.", "NTA he pushed boundaries well over and thats just sexual assault.", "NTA. The guy’s a sex pest", "NTA  \n\n\nyou are allowed to tell a gay man to not fucking touch you. For ANY reason. Especially when he's sexually harassing you... and in this case sexually assaulting you.  \n\n\nSo, absolutely not sure why you're asking us here if you are an asshole. As of right now, the fact she's allowing his behavior to continue means she is not the one. She needs to stay a gayhag and not date guys who don't also want to fuck Gary.", "Honestly if that’s how your girlfriend is then you should dump her. Because if she’s okay with him being that way to you when you clearly said it makes you uncomfortable that’s like a huge red flag", "I’m sorry you were assaulted and now made to look evil. Distance yourself from\nAnyone who thinks so low of you. And Kay should be standing up for\nYou. If it happened to her she would be upset, too.", "NTA NTA NTA\n\nHomophobia is targeted against homosexuals. You were angry at a person (gender or sexuality isn’t really important here) who grabbed your ass and touched your balls without your consent after making many comments that made you very uncomfortable. The mental gymnastics behind him calling you a homophobe must keep him fit for weeks.", "NTA Sara and Kay have seen him do that to other men and probably other friends all their lives, they pretty much don’t care as they are used to it and don’t want to be called homophobic, I would suggest to get out of this young relationship before building something too serious. If he can grope you in public without them saying anything, next time will be worse, he does not respect you or Kay, unless you want to always have to watch your drinks or food, just stay away from him and if Kay keeps saying “that’s just how he is” well she is just normalising sexual assault done to you, so one advice RUN", "NTA had a roommate like this. I hate it when people hide behind their sexuality to excuse bad behavior.", "NTA. Gary sexually harassed you. He made unsolicited inappropriate comments to you, continued this after you expressed disapproval, and touched you in a sexual manner without your consent. His problem isn't being gay, it's failing to respect another person's right to say \"no\". \n\n>Sara took Gary’s side.\n\nThis relationship won't last. She doesn't have your back, and that should be a deal-breaker for you.", "NTA he sexually assaulted you and that's not ok. Ask your girlfriend why she feels it's ok for someone to sexually assault you and say those things about you when you would never allow someone to speak about her like that let alone touch her like that. If she still doesn't see the issue break up with her because she's not the girl for you because if a person did that to my man you can bet I'd be facing charges.", "Dude is lucky that’s all that happened. NTA", "NTA. From what I was reading, I was repulsed at Gary's actions. He's a disgusting creep. What he did was definitely sexual assault. How can yr gf and her mother possibly think differently!", "People don't change mate, you really want that hassle in your life forever?", "NTA and I reckon you should show her this comment.\n\nWhat if you were all out with your friends / mother etc, and you had a friend that was harassing her, flirting, making disgusting lewd comments about her, fondled her.\nYou made it worse by saying she’s (or even HE) into her… and then when she first says something you just say “that’s how he / she is” brushing her discomfort off?\nThen when your friend goes too far, and she defends herself because no one will, you brush it off and do nothing… false labels etc.\n\nShe won’t like it. And she should have told her friend off from the start", "NTA He fucking assaulted you sexually. Ask them how they’d feel if a man grabbed and twisted their boob or their crotch. It doesn’t matter what gender or sexual orientation. It’s assault.", "He is sexually harassing you and sexually assaulted you. NTA.", "I was molested by a gay man. He thought that because he was gay, it would have been acceptable. He's lucky I didn't bring a knife and cut his dick off.", "NTA, your girlfriend and the rest of them are. Imagine what people would say if it were your girlfriend and a guy 16 years older than her touches her inappropriately!!?!? Hell no.", "What if you were to go back through your story and remove any mention of gender or sexuality? One person touched another person in a sexual way, without permission. This is sexual assault and you're most certainly NTA.\n\nEdit: clarity", "NTA - as a lesbian I find what he did to be uncomfortable at best. At worst sexual harassment. Don’t Soddy you’re not homophobic, some of the community gives us a bad name.", "Sexual ąssault is not homophobia. He's upset you're not gay and he wants to lash out.", "NTA. you got sexually harassed and assaulted by him. i'm sorry that this happened to you. i hope that you'll be able to get out of this whole situation because everyone involved except you have blaring red flags. this shouldn't have happened and should never happen again", "NTA. What he did to you is harassment. It's crazy how male harassment gets ignored a lot. And the fact that he hid behind his sexuality and used it as a shield? As a bi woman, that is sick and disgusting.\n\nAlso, maybe rethink your relationship with your GF.", "NTA. Next time, hit him.", "NTA  \nI have plenty of friends who are LGBT, and joking around with sexual comments and innuendo is one thing (though ofc not appropriate if it makes someone uncomfortable).   \nGroping someone like that is a whole other thing. It's sexual assault, plain and simple.   \nDoesn't matter if it's a gay guy doing it, or a lesbian, or a straight guy, or even someone who's asexual, or who they're doing it to. If they don't have consent, they've crossed the line by miles.   \nYour gf may not want to get involved because she avoids conflict, or doesn't want to argue with her mom, or whatever, but she should be well aware of why it wasn't acceptable (at all!) and vocally support you. If she doesn't and won't, well... That's not someone I'd want to commit to.", "NTA nor are you homophopic. What you are is the victim of both sexual harassment and sexual assault. If your gf doesn't see anything wrong with the predators actions, you may need to rethink some things. No one, man or woman, should be subjected to that kind of behaviour.", "NTA.  You ain't homophobic , you are the victim of unwanted secual harassment and an secuail assault.         He's a predator and a cocky one at that.       I'd be reporting him if he touched me.  No one has the right to do what he did.", "NTA... you were sexually harrassed and assaulted.  I'm sorry. I'd suggest filing a police report.", "NTA - consent is consent and being gay doesn’t mean you can grope anyone. Fuck that guy.", "NTA. Even before the touch, his comments towards you are horrendous sexual harassment. To put this in perspective, if a 40M did this to a 20-something F, everybody would lose their mind. Stand your ground. Gary is a creep.", "NTA- I bet they would have noticed an issue if Gary was straight and you were a woman.", "NTA\n\nGary is a \"missing stair.\" Basically, his friends got used to ignoring his antics. So they expect newbies to the group to ignore it too. He sexually assaulted you. If you were a woman and Gary was straight, you would get the same response in a group like this. It is a weird phenomenon. It is how creepy people get away with multiple assults and even rape. Folks near the person know they are unsafe but do shit all about it.\n\nI know it hurts that your gf doesn't have your back. But you at least need to consider staying away from this friend group. If they ask, don't be shy.\n\n \"Being gay does not give Gary the right to sexually assault me.\" \n\n\" I do not care if he was joking. Consent is not a joke to me.\"\n\n\"Gary can grab your ass then. I do not consent to Gary grabbing mine.\"\n\n\" Being an ally does not mean that I have to be okay with sexual assult.\"\n\nLet them fucking squirm! One day, Gary is gonna mess with the wrong dude and get popped in the mouth.", "NTA, and ask your GF how she would feel if Gary were to slide his hands between her legs, rub her hoohaw and then go up her butt and then squeeze it. My guess is she would not be ok with that… then tell her to imagine watching him do that to her mom…also not likely a thing she would be ok with. It seems that they’re thinking since it’s man on man it’s not sexual harassment but they are very very wrong. Honestly I think some hard boundaries need to be set regarding Gary being around you and if your GF and her mom won’t respect those, it’s time to think about who is the priority in their lives.", "NTA -- There's nothing \"homophobic\" about it.  He's sexually harassing you.  And showing great disrespect to your relationship AND your girlfriend by hitting on her boyfriend.  If one of her girlfriends did that, I'm betting she wouldn't STAY her friend for long.  Time to put your foot down..... if he's there, you won't be.  Not because he's gay, but because he won't leave you the hell alone.  \"That's how he is\" is bullshit.....  he's a sexual harasser.... it is no better than if he were straight and doing that to a girl.  He's grossly out of bounds.", "As a gay man, I've seen other gay men do this and it fucking infuriates me. Cause whether I like it or not, in that moment he's a spokesperson for the community. OP, the overwhelming majority of us are not like that. Gary reminds me of the men that frequent this bar in Weho called Trunks. I stopped going there because of said men and their fucking hands. \n\nYou are quite sincerely NTA.", "NTA.If it was another girl would your gf or mom said something? That's so disrespectful and I would have said it too. It has nothing to do with being gay it's about not being touched when you made it clear that you aren't interested", "This wasn't homophobia THIS WAS SEXUAL ASSAULT.\nPoint. Blank. Period. \nYour girlfriends mom sided with the predator.\nYour girlfriend just chose to ignore it... which is basically taking this creep's side too.\nRun. And don't look back.", "NTA. You’re sexually assaulted, and they tell you that’s just how he is?! This has got nothing to do with him being gay. You are sexually harassed and sexually assaulted! Nothing to do with homophobia! And then those around you dismiss your feelings.\n\nSit your girlfriend down and ask how she would feel if someone did that to her, what if someone grabbed her like that, said similar sexual things to her. And then ask her if she thinks you dismissing her feelings and saying ”that’s just how he is” would feel nice.", "Nta you were sexually assaulted report him for it", "Paint this a different color. I’m a lesbian, if a straight man were doing that to me, would it be ok? Would it be ok to grab my boob or worse? Am I being straight-phobic to set a boundary and say “that’s not ok?” Obviously not. This is sexual harassment and abuse and it’s hugely sexist to think men can’t be victims of that. That’s actually why people like Jeffrey Dammer and John Wayne Gacy got away with things for so long, the justice system thought their victims must have wanted it because they’re men. NTA", "NTA. That's sexual assault. Gary sounds like a predator who hides behind the LGBT flag and makes life harder for LGBT people who just want to be left alone and live their lives.", "Ask Sarah and Kay how would they react if someone they didn't want to touch them touched them in the same way.\n\nReverse the roles and see how quickly they change their tune.", "Exactly!! It's so gross", "Bingo! Consent applies to everybody! No touchy is no touchy!", "Not only that, but it’s also harassment. If it happens again OP, I say press charges. NTA", "That's full on sexual assault. I'm feeling so violated reading that and having flashbacks to my own experiences. That guy, gay or not, is exactly the type of man that has groped women because they think they have a right to their bodies. Sexual preferences are not relevant, SA is SA. \n\nOP please break up with your gf and make sure she knows why. And do warn other people about 'Gary'.", "The age gap makes the \"flirting\" extra vile imo.", "I love this comment. It's so on point and well said 👏", "Excellent comment. If she still doesn’t get it at that point, maybe it’s time to give that whole relationship a good, long look.", "Best answer and I wish I could award it.", "If he was grabbing women, he would be running for president again.", " No, a strange man grabbing a woman’s cooch is Donald Trump. Women just love that, right?", "Seriously. I'm appalled that the mother is on Gary's side and the partner isn't taking the situation as seriously as she should be. OP deserves to be with someone who actually cares", "Nothing I can add to this so take the up vote.", "I’m a woman but if I was a guy I’d feel extremely violated, because I don’t believe that physical boundaries are gendered", "I honestly would press charges, but that's me", "It's flat out assault. Everything up to that point was sexual harassment, but as soon as he put his hands on his genitals, it was sexual assault. Just like any gropey asshole doing the same thing in the same place for a girl. The only reason they're glossing over this is because of that disgusting double standard stigma of men not being believed as being assaulted and because Kay doesn't see Gary as an actual threat because he's gay and OP isn't. If a girl had come up and done that, she'd be livid.", "[deleted]", "It’s not harassment. It’s 100% sexual assault.", "I'm bi, but that behavior makes me ridiculously angry because I have been sexually assaulted many times but because I'm a guy no one cares... rant over", "NTA, I think it’s sexual assault at the point where contact is made.", "Exactly this", "Plus even if there are some environments where that kind of stuff is considered acceptable, like some clubs, people know that when they opt to go to that venue! Behavior that is acceptable in a certain club because everyone knows what to expect going in is not acceptable just anywhere.", "yup spin that one around on her, one of his friends rubs her from clit to ass finishing with a squeeze in the ass. then his buddy's think that's ok because he is \"straight\" and you ignores the whole thing.... yea honestly you are only 6 months in, consider a police report and taking your loss with this woman.\nand honestly respect for not putting a dent in his nose.", "Some people are really really convinced (incorrectly) that men can’t be victims of sexual harassment, assault, abuse, or rape. They are usually also certain that women cannot commit any of those crimes.\n\nThese people are usually not worth your time to try to convince otherwise.", "OP absolutely should - he has been sexually harassed multiple times and now it has escalated to sexual assault.", "It's actually sexual assault in most jurisdictions due to the physical contact", "He already plans, and has made them known, on sucking his dick at the Batchelor party. Regardless of how many times op has said he isn't ok with the attention.  The man plans on raping him. This is a massive issue and I can't believe the gf and her mother are on with this", "prefacing this with not saying your experience is invalid, the opposite in fact.  \n\n\nI'm gay, but for some fucked up reason a lot of my...former, female friends... that was something about them, wanting me to touch their tits, shoving their bared tits in my face and getting offended I wanted them to stop and didn't want them doing it to me. \"Even gay guys like tits\" No. No I don't. I also don't like the feeling of vitamin D and 2% smacking me in the face when I'm doing something else.", "Same man I hate when people touch me other then the person I am dating", "I'm gay and I've hit people for doing exactly that.  \n\n\n...but more commonly it was for weirdos coming to sit on my lap. like wtf is that shit. gtfo.", "Actually, that was sexual assault! Harassment is non-physical", "This, tell her to imagine some guy she did not like did this to her. How would she feel, how would she expect you to feel. Her mom would not be defending the guy at all either. Classic double standard", "Kay and Sara are enabling Gary by making excuses for him “that’s how he is”. It might be how he is but his actions are inappropriate and he needs to be called out on it", "You don't touch people like that, that's common decency. There doesn't need to be a hint, there doesn't need to be a conversation. I get having a conversation if he wasn't comfortable with a shoulder touch or something, but ass grabbing someone needs consent or close to it", "I don’t think anyone would have assumed this man was going to escalate his behavior to this degree. Grabbing someone’s intimate parts without consent is never justified.", "Honestly same. OP is NTA here, and a better man than I am for his reaction to being sexually assaulted.", "I’d pay good money to see this dude try to tell someone like you they were being homophobic by calling him out.", "Exactly. They're delusional", "OP should press charges, but would Kay and Sarah back him, or Garry?", "NTA. Exactly. This is literally SA. And if your friend did that to her that wouldn’t be o well attitude\n \nThis would make me seriously reconsider this relationship.", "This isn't what our world has turned into, sexual assault is wrong regardless of genders this is truly fucked up. OP, you handled this as well as anyone I'm so sorry this happened to you :(\n\nNTA\n\nEdit: also I'm not seeing great advice in this thread for people going through a sexual assault. I honestly recommend you consider seeking resources somewhere, even if just reading some articles. You should definitely get out with your gf if she doesn't support you through this because it's serious. \n\nShe may be in shock as well right now. \n\nI wish you luck", "idk why people are disagreeing with you because you are objectively right about this. There is no counter-argument to be made. Legally, you do have the right to bash someone's teeth in if they grab you inappropriately and why tf would you not?\n\nIf you're gonna let someone get away with assault because they're gay, doesn't that make you a bigot by definition? If someone slapped my black friend and called him a slur, there would be at least 3 strangers on the street ready to step in for a fight, so how is that different feom what happened here?\n\nshit pisses me off man, nobody makes sense anymore", "Wait a minute now. It's not fair to take one anecdote and extrapolate from there that everyone is ok with gay people being sexually predatory. OPs girlfriend and her mom are excusing this bad behavior, but that doesn't mean *everyone* does. There are also people who downplay the harm of predatory sexual behavior of other straight people, but that doesn't mean everyone is ok. What this guy did to OP was inappropriate and indefensible and it's a problem that anyone would excuse this behavior, regardless of the sexuality of the offender.", "You are right about gay people being more accepted into getting away with assault. However, life lesson bro. not all gay people are the same. or even lgbtq. It's like saying every European is the same, it doesn't make sense when you apply logic to real life.\n\nunless you're just religious or something and hate gay people just because they exist. then you're on your own", "Just to the bowling alley. Bar next door and we walked there. Everyone ubered home and Gary got his car the next morning", "I was thinking the same thing.", "I bet their answer would be \"ho it's just a joke omg\" ... Classic justification.", "Exactly what I was thinking. Sexual assault, it's just the way he roles.  WTF!", "Yes! This!! \n\nNTA in any way!", "👏👏👏 I hope OP reads this comment.", "Youre right. Ill update", "Youre right,  I read the first paragraph when I wrote that. Edited it after reading the whole thing", "harassment was the uncomfortable repeated comments of a sexual nature about OP. Assault was the physical touch.", "Gary did both technically", "Even the person you’re dating should respect whatever boundaries you have for where or in what situations such stuff is okay.", "Thank you for the correction. Will edit it out.", "100% agree, I was referring to the “jokes” from the start. It’s clear that this was making OP uncomfortable for some time and neither his girlfriend or girlfriends mom were willing to address it. I don’t agree with Gary’s actions or “jokes” at all, and I’m saying in these situations it’s important to draw the line early on and address boundaries because some people just don’t get the hint and don’t act right.", "Agreed", "Hes a freaking grown up an adult, you cant just be oh yeah im gay so its ok to moleste my friends bf. But then if your friends why would you ever touch sexually your friends partner? Im guessing gf and mom are ok cause he never did it to them, pretty sure if he started putting his hands on them where not invited he soon be pulled up on it not oh well thats just the way he is!!!", "Doesn't matter who backs who. He was told to stop, then proceeded to assault. If friends are lost, then were they ever really a friend?", "If someone touched my husband like this I would be calling the cops and making a report. I cannot imagine someone touching me in public like this and not calling the cops. I feel so bad for OP sitting here potentially thinking he’s homophobic for not “taking it” and letting himself be fondled.", "Even worse, they will simply say \"that´s different\".", "They must definitely do all the ones I had we both respected our boundaries", "You're right about that, but unless it gets captured on a security camera, it's basically his word against theirs", "And worth losing friends over. If they believe the predator over the victim, then oh well. As I said, let the authorities do their job, and the investigation is part of it.", "Oh definitely lose them as friends.  I hate to sound pesemestic, but sometimes the law just flips you the finger!", "I'm don't disagree about that at all. Though the state I live in has no \"stand your ground\" laws, we also don't have the stupid \"duty to retreat\" and can use any force needed to prevent a \"forcible felony\" which sexaul assault is. He will be leaving on a gurney, whether he is cuffed to it or not, is up to the police."]}