{"id": 24642, "submission_id": "15r0vmk", "title": "AITA for posting a photo of me, my fiancee and my two sons?", "selftext": "I (26M) have twin 7 year old sons. They were born when both my ex (26F) and I were in college. She's Italian and after graduating med school this year, went to Canada to pursue her surgical residency as that is where she matched. It was either go back to Italy to qualify as a surgeon or go to Canada, which is much closer to the East Coast where our boys and I live. We worked out which holidays she would have them and who would travel to where etc. There have been a lot of tearful FaceTime phone calls between them since she left last month, but that is their primary means of communication. My fiancee (30F) and I are getting married next month. We went to my family's beach day and the four of us (me, my fiancee and my sons took a photo together on the sand) and she posted it with the caption \"Me and my favorite guys\". I reshared it and wrote, \"If I asked for any more, it'd make me a selfish man.\" My ex saw it and responded to me privately, \"Wow, way to rub salt in the wound. Those are *our* boys, not hers. Please be clear about that.\"\n\nMy fiancee has been around since they were 4. She's a pretty significant part of their lives and seeing that their conscious only goes back but so far, she's a pretty big figure to them. When we get married, she will be their stepmother and they are also her boys. I don't think it's inaccurate to say these kids have 3 parents. The boys understand that their mother has had to leave the USA to become a doctor and help people and that if she had another option to stay, she would've went with that. I've been intent on explaining this to them because I want them to understand mom didn't just up and move to Canada for nothing.", "created_utc": 1692033602, "permalink": "/r/AmItheAsshole/comments/15r0vmk/aita_for_posting_a_photo_of_me_my_fiancee_and_my/", "score": 295, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My fiancee thinks so because she referred to me as having rubbed salt in the wounds by resharing the photo.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Mom is definitely going through lots of emotions right now with moving, med school, and worst of all being apart from her boys. It’s natural she would feel some jealousy and possessiveness. Offer her a little grace, but gently remind her that you meant no harm and that your fiancée loves your boys and has their best interests at heart.", "NAH - You and your fiancee' did nothing wrong. Bio mom is away and scared of losing her place in her sons lives.\n\nShe just needs to know no one is taking her place, and that the relationship your fiancee' has with the boys is their own separate entity.\n\nI might also nudge the point that \"fiancee' caring about our sons is a good thing as it means she will take extra care to love and protect them as a good stepmother\" (so much of things is how we phrase them).", "NTA. You did nothing wrong. She is likely frustrated at her situation being away, but that shouldn’t limit your life with your children.", "NAH I don’t even think mom is being directly cross at your fiancée. As another comment said, she is likely frustrated with her situation and sometimes that kind of pain can lash out in the wrong ways. \n\nI would try to establish more contact all around, kids and parents. Mom is probably hurting that she is stuck being so hands off. There is a way to grow a harmonious environment here but it starts with communication.", "NAH.\n\nI get mom's feelings and I get she'd rather be with the boys, but choices sometimes come with consequences. However, it's human that she feels the way she feels. She likely goes through phases of depression, loneliness and missing her sons.\n\nHowever, I don't think your fiancée did anything wrong. As far as I am concerned, a kid can't be surrounded by too much love. I'd be over the moon if the stepparent loved them as much as I did. You should want your kids to feel loved, cared for and at ease with the stepparent.", "NTA. There's nothing wrong with your fiance writing, 'My favorite guys' under a photo of you & your boys.\n\nIt's not as if your fiancé is claiming to be the mother of your children. I'm sure your circle of friends & family know this fact.\n\nThis is my gut feeling. Your ex is having a hard time being away from her children, and surgical residency is incredibly demanding. She's exhausted. I can't imagine what's she's going through right now. I think that's the wound. She saw that post, and it hit her differently. She sees you, the boys, and your fiancé in a nice little picture. She feels replaced  & forgotten. \n\n\"Those are our boys, not hers. Please be clear about that.\"\n\nIt's that statement that makes me think my gut was correct. Your fiancé said nothing about being the boy's mother, but your ex seems to think she implied it.", "NTA. You and your fiancee did nothing wrong, and nothing you have described here sounds like anyone is trying to replace the boys' mother.\n\nI want to give your ex some grace here, as doing a medical residency, in an unfamiliar place, away from her kids must be difficult, but it doesn't mean that everyone else stops living their lives.", "NTA.", "NAH. I get that your fiancée has been in the kids' lives for a long time, but she isn't the parent and probably should be careful re sharing images of the kids on social media. I don't think your ex is unreasonable to have been upset by that post or try to set a clear boundary.", "NTA\n\nYou have a good life and you should be free to share it. The ex needs to move on. It's not like they call your fiancée \"mom\".\n\nEdit because I can't spell", "NAH, there is no issue here. You can say whatever you want and your fiancee can think whatever she wants but those are not her boys.", "NTA\n\nShe wrote “and my favorite guys” she didn’t write “my STB husband and I and our kids”\n\nBig difference\n\nI’m also assuming that everyone you know that matters is well aware they’re not her biological kids. Your ex is the one that chose to pursue her career the way she did and has been aware of your fiancé in their lives for at least 3 years.", "Info: my gut feeling here is NTA, but I’m curious, why was Canada the closest option? Was it that no one close by would have her or did she prioritise a certain specialty, reputation, etc. over being close to where the kids are? Surgical residencies are 5 years… that’s a long time to choose to be away from your young children. It might sound harsh but if this was a *choice* where location just didn’t feature as *highest priority*… I would have very little compassion for her snapping.", "NTA - The mother is being a bit unfair here, but I can understand why she'd at least want to establish who she is and the role she has to the fiancee.  She also (and you probably should as well) be mindful of posting photos of your kids on facebook though.  Lots of bad actors out there who may use it for purposes that you never would have intended/wanted.", "NTA. She made her choices in life, and that didn't involve living near her kids. She needs to realize that life goes on when she is away from them.", "INFO: What was the tone of your divorce? Has your ex-wife previously expressed anger at your fiancee'? \n\nWhether posting something like this is an AH move has a LOT to do with the history of the relationship. It sounds like Mom is feeling a lot of frustration over the separation, and if this post came out of nowhere at a sensitive time, then maybe it was inappropriate and it would be considerate of her feelings to tone down the \"happy family\" vibes from your side of the aisle. \n\nOr, Mom has always been combative about stuff like this, and this is par for the course, and there's no point mollycoddling her about it anymore. Without some history, it's hard to say.", "> When we get married, she will be their stepmother and they are also her boys. \n\n When you get married, she will be their stepmother, so they are NOT her boys. She is not their parent. \n\n> I don't think it's inaccurate to say these kids have 3 parents\n\nIt is. \n\nConsidering she is not their parent, she should gain permission from both of the parents before posting any photos. YTA for being weird about this.", "Your boys already HAVE a mother.\n\nIt's great they get along so well, but your future wife will be their STEPMOTHER, not their PARENT!!\n\nYTA for your last paragraph.\n\nEdited to add:\n\nN T A for the pictures, **as long as BOTH parents agree** for your children's images to be posted on social media.", "NTA, she’s just hurt and upset that she chose her job over having more contact with her children. Sounds like she’s in pain and lashing out. Which sadly does make her a soft AH. I imagine it was a very hard decision for her, and that it’s one she regrets from time to time, but she still made her decision to be in an entirely different country than her boys. \n\nThere’s probably a way to schedule more FaceTime/ contact between the ex and her boys. Same time every week would be preferable if she can do it. That way the kids will know they have dedicated time with their mom every week.", "YTA as a stepmom, I have never ever posted any pictures firstly bc as anon custodial adult I have no right whatsoever to do so. And believe me I have been tempted at times bc I do consider him my son, it is just I never was and never will be\nShe is not mom or mother she is an additional adult that is overstepping, trust me your fiancee should be careful trying to insert herself as their mom she simply isn't, if you guys ever break up she has no rights to them. She could have posted my future hb and his wonderful sons", "Question does your ex get to see the boys while in Canada? What is your plan after she does her residency? Do they keep in touch?\n\nAre you purposely trying to Force their mother into the background? It doesn’t sound like you’re trying to keep the communication with their mother and them open.\n\nIt would be hurtful she’s trying to succeed in a very difficult program. When she is done she will have some more time and I hope the kids will be able to spend some time with her. You need to assure her that they love her and want to spend time with her\n\nIf I read it right it’s only been a month. What are your long-term plans so the boys can spend more time with her. Are you trying to keep them from her? She is hurting. she’s going through so much right now missing her kids is in a competitive program moving to another country etc. I would hope that you would be a little more sensitive to her feelings.  I’m sure she’s feeling guilty and I’m sure she’s feeling like her kids will forget about her and want to stay with dad and his wife.", "Nta she is basically a bonus mum to them considering they see the ex through FaceTime she probably has to do things that mothers would normally do since the ex can’t", "No this was wrong. The boys have two parents . This was heartless and tone deaf", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (26M) have twin 7 year old sons. They were born when both my ex (26F) and I were in college. She's Italian and after graduating med school this year, went to Canada to pursue her surgical residency as that is where she matched. It was either go back to Italy to qualify as a surgeon or go to Canada, which is much closer to the East Coast where our boys and I live. We worked out which holidays she would have them and who would travel to where etc. There have been a lot of tearful FaceTime phone calls between them since she left last month, but that is their primary means of communication. My fiancee (30F) and I are getting married next month. We went to my family's beach day and the four of us (me, my fiancee and my sons took a photo together on the sand) and she posted it with the caption \"Me and my favorite guys\". I reshared it and wrote, \"If I asked for any more, it'd make me a selfish man.\" My ex saw it and responded to me privately, \"Wow, way to rub salt in the wound. Those are *our* boys, not hers. Please be clear about that.\"\n\nMy fiancee has been around since they were 4. She's a pretty significant part of their lives and seeing that their conscious only goes back but so far, she's a pretty big figure to them. When we get married, she will be their stepmother and they are also her boys. I don't think it's inaccurate to say these kids have 3 parents. The boys understand that their mother has had to leave the USA to become a doctor and help people and that if she had another option to stay, she would've went with that. I've been intent on explaining this to them because I want them to understand mom didn't just up and move to Canada for nothing.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta, she's shouldn't be posting any pictures of your son's unless BOTH parents are ok with it, she's not their mum so she has no right to post anything if their mum isn't ok with it.", ">sometimes that kind of pain can lash out in the wrong ways.\n\nWhich would make her an asshole, imo...\n\nYou can by sympathetic to her situation all you want, but someone lashing out at someone who doesn't deserve it is an asshole.", "Well that’s true however I would hope that he and his fiancée would be a little more sensitive to the exes feelings and situation.\n\nTrue or not she may be feeling that you’re trying to take the kids away from her and you and your fiancé are trying to start your family and keep her from being their mother. I’m not saying that’s what your intentions are but remember she’s in a very sensitive situation right now", ">and nothing you have described here sounds like anyone is trying to replace the boys' mother.\n\nI wouldn't say trying, but at this point in time through circumstance for at least the moment she *has* replaced her - Kids pay attention to who is there", ">She wrote “and my favorite guys” she didn’t write “my STB husband and I and our kids”\n\nI don't really see any difference between the two. Nor would I think either makes anyone but the ex an asshole.", "She really didn’t have a choice. Medical school graduates don’t get to choose where they do their residency. If Canada is where she matched, that’s where she had to go. Otherwise her MD would be useless. What she’s doing will benefit her boys in the long run.", "She went there for her residency it wasn’t that she got up and left to go see the world. Hopefully she’ll be back after that is over she didn’t have a choice. You don’t go through all those years of med school only to just stop.\n\nThis is temporary and it sounds like girlfriend is trying to replace their mother. And I’m sure the mother is hurting. So if you think she should’ve just left med school and got a retail job to be home with her kids.", "Stepparents are parents. It's weird that you don't think that they are.", "Stepparents are parents. It's literally in the name.", "She will get certain holidays. I'll bring them to her for her time in the summer and pick them up. She'll come here all the other times.\n\nNo, I am not purposely trying to force their mother into the background. She's an excellent mother as far as the distance and time permits. What a ridiculous accusation. She talks to them every night before bed so she can say goodnight.\n\nHopefully she knows that these boys love her endlessly.\n\nIt's more about her long-term plans. Is she going to stay in Canada or try to come back to the USA? The boys will be staying here in the USA regardless.", "Kids can have more than two parents.", "She always had a choice. She could have dropped her career and do it differently. \n\n(Honestly, I find it very weird that she did med school in the USA, then had no choice but to go in Canada? Like, another country ? How can that happen?)\n\nI am not saying that she made a bad decision by making her career her priority : just that she can't have it all. She either have her career, or she is with her kids. She choose her career. That's her decision. But she cannot complain after that when her kids are living their life away from her.", "I never said she should have left med school.\n\nJust that she doesn't have the right to be mad that her kids are living their best life while she is away and taking it out on OP. OP is doing everything he can to provide them with a good life. This life includes a fiancée. Of course the kids are going to see her as a mother figure : she is literally with them more than their mom. \n\nOP's ex can feel sad, the situation must be hard. But taking it out on OP ? Totally unfair.", "They can if the kids say so . Not one of the parents foisting his gf on his kids as a mother when they already have a mother.", "If she dropped her career, how would she have supported herself and her kids?", "Good point everyone knows you are either a doctor or homeless there is nothing else someone can do to pay bills", "With another career ? Plenty of people are not doctors.\n\nLike I said, I never said it was a good idea to drop her medical career.\n\nBut I am sick of people playing the victim when the only person to blame is them. Op didn't choose this. The kids didn't chose this. Only OP's ex chose to be a doctor and to continue her studies to be a doctor.  That was probably the best decision for her. But she can't have her cake and eat it too.", "Stop being ridiculous. Most well paying jobs require you to have some sort of degree, certification or license and you know it. Her degree is in medicine. Without post graduate training, the jobs she would be qualified for probably wouldn’t pay enough to meet her needs.", "So after spending 4 years and over 250k to become a doctor, you want her to pursue another career path? That’s ridiculous. She’s not doing this just for herself. She’s doing this for her kids. She’s still their mom and it sounds like she’s still part of their lives even from so far away.  It everyone has the privilege to do what’s necessary to support their family while also living 30 minutes away from them.", "I also find it funny that you think someone can't support a family without a degree when I'm able to support my family of 3 with nothing more than my graduates equivalency degree", "And nobody has ever changed careers? Is that something that is impossible to do? Simple fact is she had a choice. To be present for her children now and show them how much she loves them or to continue with a career that will take her away from her children but make a lot of money. She chose to pursue her career instead of being with her children and now she has to deal with the consequences of that choice. I grew up in a poor family we struggled everyday of my childhood but I wouldn't change a thing if it meant 1 or both of my parents were no longer around even if that trade meant i would be filthy rich now i would ALWAYS choose the option that let me be with both parents and their love. She chose career over kids it is as simple as that and she will have no one to blame when the kids stop calling her mom and start calling stepmom mom since she CHOSE not to be there for her kids.", "... didn't I said enough that pursuing her career was probably the best option for her ?! I feel like you are not reading what I wrote.\n\nSo it's the last time I repeat myself. She choose to be a doctor. Her career forces her to make sacrifices. She is not a bad person for it and shouldn't change her path for it. \n\nWhat makes her a bad person is that she gets MAD when she sees her kids living their best life, just because she feels jealous she is not there and that another woman is \"filling her role\". She is allowed to feel sad, sure, but taking it out on OP is not fair to him.  \n\nThat's all I am saying.", "I never said that. What I said was most well paying jobs require you to have some sort of degree, certification or license. That’s just the reality of the job market.", "Are you going to pay her share of support for her kids? Of course not, so stop judging her for doing what’s necessary to support herself and her kids. She’s still a part of her kids’ lives. Sometimes parents have to move away from their kids in order to support them. It doesn’t make them bad parents.", "Yeah we’ll choosing your job over your kids when you have other options makes you a shitty parent. And yes, with a medical degree she had options", "So she COULD support herself and her kids without being a doctor? That means your entire argument of her doing what she HAS to to support her family is completely BS since you do NOT need to be a doctor or have a degree to support a family.", "It means she values her career over her children so yes it does make them bad parents. She was NOT forced to follow this career that is a choice she made. Being a doctor is not the only way she could support her kids it's just the way she WANTS to and she obviously wants that more than she wants to be with her kids otherwise she would have changed careers when she realized it would take her away from her kids and found another way to support them. Sometimes in life we can't have it all and we need to decide what's more important to us. In this case she chose her career over her kids it really is that simple. If she REALLY wanted to be with her kids there is literally 1000s  of ways she could support herself and the children without leaving them behind while she goes to another country entirely. And I  will say it again for good measure. She chose her career over her kids there is no 2 ways about it", "What options are those? Sometimes you have to move away from your kids to support them. It doesn’t make you a bad parent.", "Her career is going to benefit her kids. What she’s doing is just as much for them as it is for her. Why is that not getting through your head? She’s not a bad parent. Cool it with the parent shaming. Unless you’re going to pay to support these kids, you don’t get to judge anyone for how they support their kids.", "The only ones that get to have a say in what your fiancé is or isn’t, are your boys. They may or may not be mature enough yet to articulate it yet, but no one else gets to define that relationship but them. I understand your ex is jealous but that is not a way to foster a healthy co patenting relationship and like it or not that’s what she is in for now. NTA for giving your sons an adult in their life that loves them and wants the best for them.", "NAH but your fiancée is not their parent.", "You and GF are YTA.  This was done deliberately to make mom feel like shit.", "NTA. Your ex is wrong. They ARE her boys as she is their stepmom. And frankly, your ex should be happy about that, if she loves her kids.\n\nAlso, she didn't even call them her boys, she called them her favorite guys, along with you. \n\nJust be polite but ignore your ex and post whatever you want.", "NTA - \"you're welcome to stop following my social media if you don't like what you're seeing.\"", "NTA: your fiancé is a more consistent presence in your kids lives than their mother. She left them to pursue a career in another city, she won’t be their full time parent probably ever again for med school, interning, residency. She made her choice, she wanted to be a doctor more than a mother. I’m glad your kids will get a  real mom in their life, I’m sorry your kids will grow up thinking “mommy helping others” is more important than being their for her kids", "Right. I think it's apples and oranges, which is why I've tried to drive home the point so hard that mom is away because she has to work not because she wants to be away from them.\n\nShe's great with them tbh and the comments insinuating that stepPARENTS are not parents is beyond me. She's been phenomenal and has gone above and beyond for them when she really didn't have to.", "Stepparents ARE parents when they actively have that role in the kids lives. And a stepparent doesn’t have any obligation to consult both bio parents about things like posting pictures of the kids when they have one of the parents permission. The OP can post pictures oh HIS kids if he wants to and he can give his SO permission to as well.", "Agreed, definitely NAH. The boys mom is feeling insecure and reacted accordingly. But you and your fiancé did nothing wrong, your fiancé didn’t say anything to imply they were her children only that the 3 of you are her favorite guys, which is very cute and shows she loves you all. I’d reassure your ex that no one is trying to take her place and that it’s good that you found a partner who cares about your kids.", "Your ex needs to make sure she swallows that bitterness around the kids or risk alienating them, which wouldn't be good for anyone.", "Do you have custody a majority of the time? Cause I think the person you responded to made a really great point about her being scared. Also, do you mind sharing why your ex/their mom had to move to either Canada or Italy? I’m assuming you’re in the US and that she went to school here. Was she denied a visa to stay and work after she finished med school?\n\nIt sounds like it’s an emotionally hard situation, she lives far from them and it seems like she doesn’t get to see them as much as she or they want. She’s living in a new country far from the connections she made while in school and far from her family (I’m guessing she’s Italian and that’s why Italy was an option) who may live in Italy. Are there options for her to pursue a visa eventually that would help her move back and pursue her green card? Her children live here, I would hope that would be something that would be considered when it comes to pursuing a visa.\n\nDefinitely NAH, she is going through a hard time and misses her children. It sounds like she is under a lot of stress from several things that on their own would be emotionally hard enough, but all of them are major stressors piling on at the same time. I can see why she could potentially feel scared of being “replaced” in a sense. She might feel like she has abandoned her children, but reality isn’t quite that simple and it’s the stress and fear likely creating these anxious, intrusive thoughts. Plus, the immigration system here is so messed up, she may not feel like there is an end in sight to the distance.\n\nTalk to her and just show her that you and your fiancée are empathetic. That all of you are on the same team and love your children. Find ways to help her feel more present, or at least so the boys can feel like she’s there for them even with the physical distance. I love the fact that you and your fiancée make sure to tell them that she wants to be closer and that outside factors are making it hard, that is a really great way to start and as they get older it can be explained more in age appropriate ways.\n\nI hope things work out, this is a tough situation and it must be really hard to navigate.", "the fiancee didn't refer to them was her sons or herself as a bonus mom (or any sort of mom), she said my favorite guys so she was being incredibly respectful of their mother", "Unfortunately step parents are not the same as biological parents, if their mom has been in their lives since birth and their step parent hasn't she should get more of a say. At the end of the day you had kids with your kids mother not your fiance, if it comes between your fiance and your child's mother feeling differently about HER children, you should respect her decision. After all which women spent 9 months destroying her body and mind to grow and nurture those children ? At the end of the day your fiance will never do as much for those kids as their mother did, DO NOT try to act like they deserve the exact same respect. One takes slight care of them the other literally created and gave them life, you should respect your baby mother more honestly.", "They are exes kids too. Exes trying to keep the mother away and move on with the new family. She does have every right.", "Unfortunately, this is inaccurate. My fiancee took on a large share of parenting duties when my ex couldn't because of her medical school obligations. Everything you'd expect of a biological mother, she did that. It is totally classless for me to say she takes \"slight\" care of them when she has stayed up all night with sick kids, taken them to practice, helped them with homework, comforted them when they were beyond sad and everything else that comes with the mantle of parenting when my ex HAD to be absent because that was what medical school demanded of her. Slight care, my foot. She deserves similar if not the same respect. You sound clueless.", "How is OP trying to keep the kid away exactly ?!  She had to go away for her career. OP is not responsible for that.\n\nHe has every right to move on with his new family. Do you expect OP to be stuck in the past and never date again ?!", "You fiancé sounds amazing and I’m glad your kids have a mother in their life who will be present not absent for 3-7 years. Imagine choosing a career over being there to comfort your kids when they are sick, or going to their school plays, your ex is selfish and she has no right to be jealous. She’s not a mother", "The ex isn't selfish for having a career! She takes care of her kids when she isn't working or away for work. She leaves them in the custody of their father while she works.\n\nWhy don't you blame the father for being at work while his fiancée took care of the kids? \n\nParents need to work and that means daycare, babysitters, or family stepping up to care for them. \n\nThese kids are lucky to have people who love them.\n\nEx is being sad and jealous, but hopefully it is a one off.", "Lol don’t have kids then if your job requires you to leave your child for 3-7 years and then get mad when the fiancé whose more present than you are posts a photo of them doing stuff I’m sure they wish they could do with their mom. And she’s going to work in another country. Can you imagine making the decision to have a career that means you don’t get to see your kids except over FaceTime, those kids will grow up with serious hatred of that woman", "She’s already a doctor. She can’t get a job without the proper training. What don’t you get? It’s ridiculous that you think she should start all over again. There’s no point to doing that. By the time she gets to the point where she’s making good money in another career path, she could have finished her residency.", "I'm sure your fiancée is wonderful, but boundaries are important. Perhaps you three should have a sit down on what is acceptable and not. And then that way everyone will feel heard and it can avoid any unnecessary confusion or tension between you when you're trying to co-parent. \n\nOne day your fiancée might have a baby, and even though she loves your kids, her feelings towards her own baby will be of similar feeling as your ex. Step parents are parents too but your kids have two parents and a bonus parent. The roles are different even if it doesn't seem that way. So the best thing to do is to have a conversation about boundaries, and what is acceptable amongst all parties.", "She's your ex. Time to stop caring about her feelings.", "NAH - it’s honestly great that your fiancé loves your sons however I will say the caption you used along with your re-post is frankly so twee it made me cringe a little. I can easily see why the posts may have rubbed your ex the wrong way but you do have the right to post.", "NTA Most would be happy their kid has good stepparents. I think your ex just misses them. I wouldn't make a fight out of this yet.", "Found the bitter baby mama", "OOOOOO actually I have an idea OP. I’m posting a new comment since the other I posted to this reply was already long and I don’t want this getting lost in it.\n\nAnyway, my idea is maybe writing a story and making it into a book that can be saved. It can be a story about how their mom moved to a whole new country for her education and while she was there she was blessed with two baby boys, but she wasn’t allowed to stay. It can be about how her love for them is stronger than the distance. If she is looking to get a new visa to move back then that could be included. Maybe y’all could even do a few over time that include adventures. It doesn’t have to be so obvious, like it can use different themes to allude to the situation without outright saying it. The two of you could write it together or maybe someone would be willing to help write it for you, but use things you both say to personalize it. I wouldn’t be surprised if there are creative writing subs where someone would be interested in helping. Hell, I’m not the best with creative writing, but I’d be happy to help and write it/draw pictures for it. You could also include pictures of her and the kids/you and the kids from over the years.\n\nIdk, it seems like a cute idea to me, but I know it would barely be a bandaid considering how rough this is for everyone.", "You are perceptive and empathetic", "I was away from my child for 3 weeks and I was a wreck. I missed him so much. And that was because I was ill in possible. I knew I would see him soon and take care of him again. \n\nYou are handling this with Grace and saying all the right things. \n\nThe one thing I would suggest is at next contact is to ask your fiancée and your ex to take a family picture together for the boys benefit and have that picture placed in your home. Nobody needs to feel pushed out and the boys know everybody loves them. Make a conscious effort of taking pictures of the boys with their mother.\n\nThings you can do to make the transition easier for mom. \n\nRecord them going through the school gates. With love you mom etc. if time difference is going to be a problem with school, record a video of them telling her how their first day went. \n\nSend a message on a Saturday with pictures and highlights of the week. \n\nOnce a month send mom a care package with pictures the boys have drawn at school and chosen specifically to Send to mom. \n\nGet mom to buy a teddy for each of the boys. And the boys buy one for mom. Mom and the boys swap teddies at visits. Boys will know mom is coming to swap teddy’s and have a piece of her at all times. In between visits boys can take pictures of “Teddy’s” adventures and mom can do the same, they can then send them to mom. \n\nIf mom doesn’t have time to talk get her to record videos that the boys can watch. \n\nInclude her in things like birthdays. Suggest she buys and sends their Halloween costumes etc. \n\nBe creative. \n\nThings will die down and you won’t need to make so much effort because mom won’t need to be reassured so much because she will know and feel they still love her but right now all she’s seeing his family pictures and tearful face time calls. \n\nYour boys will thank you for the kind of father you are later", "NAH", "No you’re not.", "NAH... I'm sure it is painful.  Continue being gentle with each other. Of course your pictures will include their extended family.", "Info could she really not get into any amerocan hospitals?", "\"she's a pretty big figure to them.\"\n\nOr maybe they'll be here in 10 years saying she means nothing to them and she was always trying to post \"family photos\" on social, even though she's not family. There's a lot of that here. Who knows?", "NTAH, your fiancé seems like a good person and your boys are lucky to have her in their lives.", "Maybe by emphasizing that there are 3 parents now", "I agree - I think the way it was stated as her favorite guys was very respectful to your ex, not trying to code it as being their mom. It’s important for kids to feel included in their families, and I would try to emphasize this to your ex. I’m sure she’s under crazy stress too, it is very hard to be away from your kids. NAH", "I have sole physical custody. She has visitation. She didn’t match anywhere in the USA, but matched in Canada for her surgical residency. Thank you a lot for this.", "NTA. She should be grateful.", "I agree. It's what the kids think matters most. If the kids are happy, so should she be. \n\nI don't personally like my kids' stepmom, but I can't deny she's a good stepmom and that my kids really like and trust her.", "I guess when you’ve dedicated your life to becoming a medical DOCTOR, she’s probably counting on being to be able to provide better for her boys in the future, ya know, with the salary of a DOCTOR. Doctors make a lot more money on average than college drop outs."]}