{"id": 24671, "submission_id": "15rgjk8", "title": "AITA for not reading my parents' friends' messages?", "selftext": "This all started from before I could remember. I(18m) grew up with my parents' friends' daughter 'Jenny', also 18. Jenny asked me out when we were 16 and we had two wonderful years before she started sleeping with other guys. She begged me to stay and said I should give the whole open relationship thing a try, but I told her no.\n\nHer parents have been begging me to take her back, saying she was inconsolable. She had begged her parents to beg me on her behalf. I didn't want to block them outright since this couple was very kind to me over the years. I've had more dinners at their house than I can remember. So yesterday i told them 'I need some space. Please, please don't contact me today.'\n\nThen I switched off my phone and went to the cinema. Watched the new Mission Impossible three times. At the end of the day, I saw several messages from them saying that Jenny broke down into tears again. Am I the asshole for not reading any of their messages all day long?", "created_utc": 1692069441, "permalink": "/r/AmItheAsshole/comments/15rgjk8/aita_for_not_reading_my_parents_friends_messages/", "score": 104, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I chose to not read any of their messages which made them upset.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. The fact that they’re covering up their daughter’s behavior is not ok. They expect you to forgive and move on just because they have known you and your family for so long. I wouldn’t reply at all tbh.", "Nta - regardless of how nice her parents are she cheated on you and have to bear the consequences of those actions.\n\nUnless you want her back you need to tell them in no uncertain terms to stop contacting you.", "NTA - They clearly violated your boundary of telling them you needed a day with no contact.  It sounds like their daughter learned that other people's feelings aren't important from her parents.  For your own mental and emotional health you should block all three of them from your social media accounts for at least a month.  Then you can consider talking with them again _if you want to_ and not at all if you don't.  Just let your parents know what is going on so they hear about it from you first and not from the other parents.", "NTA.  You are smart for moving on.  Tell her parents you are not in cheating and open relationships", "NTA.  Imagine harassing a teenager because he broke up with the person who cheated on him.", "NTA. Jenny and her parents are overstepping all boundaries here.  You have politely declined to take back their cheating daughter and asked them not to contact you.\n\nIt may be time to be less polite.  Jenny can cry all she wants, the answer is no. They should have taught Jenny about consequences, they didn't. It is harassment at this point. Block all 3 of them on everything. If necessary tell your parents.", "NTA. You're not their employee. It's perfectly normal to only read and respond to messages when it's a good time for you (which may be never). You're not a doctor being paged to attend to an emergency patient.", "NTA.\n\nSee, it’s only an open relationship if you have both agreed to it before sleeping with someone else. Otherwise it’s called cheating. She wants your permission in retrospect as well as in advance, because then her sleeping with the other guys will not have been cheating.\n\nBut you know this and her parents know this. They also know that you don’t want an open relationship, and for them to push you on this is appalling behaviour.  They ignored your very reasonable request for one day away from this, with this onslaught of emotional blackmail. \n\nFrankly,  all the dinners in the world can’t make up for this disrespect and bullying. In your shoes, I would tell them that since their daughter could not respect you enough to not cheat on you, and the parents could not respect your wishes for ONE damn day, you can’t imagine that any one of them will ever have respect for you, so you have to block them. And do that.\n\nEd. for clarity.", "NTA .\n\nthe parents and that jenny is the assholes for trying pressure u into something u dont want. that's literally harassment.", "NTA\n\nJenny is not your responsibility", "NTA I would warn them that if they don't stop contacting you on her behalf then you're blocking them. If they don't stop, you gave them warning and reason, you have every right to block them", "NTA, what they are doing is harassment. Do the parents actually know what has happened for you to break up, or has Jenny just spun a story and you're the reason why things ended?", "NTA. Her emotional state is not your responsibility and you should tell them that. She needs a therapist.", "These parents are upset you won’t be the boyfriend of their daughter while she sleeps with other men? They are ridiculous people who need not be taken into consideration. NTA.", "NTA\n\nAnd do they know what their daughter has really been up to? \n\nIf not, they really should.", "NTA. You needed some space away from her and part of that is by ignoring her messages", "Info: Are you sure it is her parents sending these messages? \n\nAlso, talk to your parents (or family or w/e but not only to the internet)", "It's quite possible that the ex-gfs' parents have been misled about the situation. It sounds like they might have been told that you broke up with her, but not why. You may want to talk to your parents about the reasons so they can tell their friends what really happened.", "NTA, she made a choice to want to have an open relationship, you had the right to say \"NO\" Now the real question you need to be asking yourself is  Why does she want you back?  I am hoping that you two used protection but I think that you should stay away.  Why do I say that?  I think she might be pregnant.", "You are 100% not the ass hole here as her parents have been clearly told by you multiple times that you don't want to get back in the relationship, and that you need space.\nSo sorry this has all happened to you bro and I hope it all gets cleared up soon <3 stay strong out there", "Tell them what she did. That this is a huge boundary for you. They are not to contact you about this again. \nGood luck.", "NTA. Their daughter is a cheater and they want to saddle you with her. Her teRs aren't your issue. Block them.", "Why did you watch Mission Impossible 3 times? NTA", "Personally I'd message them and say so you find it acceptable that your daughter cheated on me and slept with numerous guys.\n\nI guess if either one of you cheated then I guess you would be ok with it.\n\nI have asked you to please respect my decision that I don't want  a cheating girlfriend who thinks it's acceptable to sleep with god knows how many people.\n\nPlease leave me alone.\n\nIt's my decision not to be with an unfaithful woman.\n\nThen block all three of them.\n\n\nNTa", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis all started from before I could remember. I(18m) grew up with my parents' friends' daughter 'Jenny', also 18. Jenny asked me out when we were 16 and we had two wonderful years before she started sleeping with other guys. She begged me to stay and said I should give the whole open relationship thing a try, but I told her no.  \n\n\nHer parents have been begging me to take her back, saying she was inconsolable. I didn't want to block them outright since this couple was very kind to me over the years. I've had more dinners at their house than I can imagine. So yesterday i told them 'I need some space. Please, please don't contact me today.'  \n\n\nThen I switched off my phone and went to the cinema. Watched the new Mission Impossible three times. At the end of the day, I saw several messages from them saying that Jenny broke down into tears again. Am I the asshole for not reading any of their messages all day long?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. But you need to tell them \"You need to stop contacting me. Your daughter treated me badly and cheated on me. I need you to stop defending her actions. You would not encourage her to stay with someone who did that to her.\" If she wants to play victim to her parents, then she has lost her chance for you to keep quiet", "NTA\n\nThese people are abusive and do not care for you - your right not to want to be someone who sleeps with other people, your right to be left in peace. They don't care about right and wrong at all. No wonder Jenny has grown up believing she can have what she wants, not give an eff about how she hurts you or others or what you want - but still expect you to make her happy.\n\nGo no contact will all of them. I hope your parents are supportive of you. If they are not, then tell them you will be tuning them out if they bring up the subject of her or try to ambush you in any way.\n\nI'm so sorry that you are being betrayed by so many people you have loved and cared for.", "Block them , they are not your friends they are your parents friends. You have no reason to be in direct contact with a pair of 50 year olds who's daughter you used to date.", "NTA at all. \n\nI hate when people don't respect that you've asked for space. You were polite about it, and they just ignored what you said. \n\nJenny treated you awfully. \\*Before\\* you start sleeping with other people is when you need to have the discussion about opening a relationship! Hope you're doing okay.", "Nta\nBut you need to explain to them( the parents) why you do not want to date their daughter. And do so without her there. Be honest and be ready for them not to believe you. But it should help stop them from bothering you.", "NTA \n\nAt this point , this pair of adults is just harassing and emotionally manipulating a teenager and it's gross. \n\nBlock them, OP. Yes, they were nice to you in the past but now they are not respecting your wishes. Time to cut the cord.", "Text them “You are being inappropriate.” \nThen block for a while. That should shock them in to compliance. NTA", "NTA, she can just go fuck off, right?\n\nTell her parents that she fucked other people, I bet they don't know that. \n\nShe needs help and therapy for something, not a boyfriend.", "> I should give the whole open relationship thing \n\nThat's something you suggest before you sleep with other guys. Otherwise it's called cheating and people have a real issue with one. NTA", "NTA\nBut contrary to what Redditors are saying, there’s no need to be aggressive. Just say you need time and space to think, so you won’t be replying for a while.\nGive yourself a few days to start sorting your head out. Then talk to them. (As in, an actual conversation, not texting.) tell them that you love and value them and always will. Tell them you and Jenny were a good first relationship for each other. Be clear that while you will always care about Jenny, the relationship is over and you do not want to rekindle it.\nDon’t go into any specifics or reasons.", "[deleted]", "I paid to see it three times.", "NTA- tell them if either one of your husband and wife went behind your back and sleep with someone....what would both of you do?", "NTA\n\n&#x200B;\n\nJust block that cheating AH's number, and be done with her.\n\n&#x200B;\n\n\"Her parents have been begging me to take her back, \" ... Refuse to discuss this further with her AH parents. Just block their numbers, too.\n\n&#x200B;\n\nTheir behavior is ridiculous. Tell them, to F\\* off, you are not interested. \n\n&#x200B;\n\n\" Please, please don't contact me today.'\" .. They don  \n't care about you, or they would respect that. So just stop having any contact with them at all - not for a day, buit until they stop. Or forever.", "Run, Forrest! Run!\n\nNTA", "NTA too, but maybe they don’t know she cheated. She could have conveniently left that part out. If that’s the case, you should tell them. That should get them off your back.", "NTA\n\nFAFO- She did so and realized she was the A-hole", "OP could play them the song \"When You Were Cheating\" by Sara Evans.", "Oh, please. She didn't cheat. She just unilaterally decided that her and OP were in an open relationship and failed to let OP know in time. /s", "If telling them \"I will not be taking her back do to her cheating\" don't work. \nHonestly, I would tell them, \"I will not respond to any further messages. This is becoming harassment and emotional blackmail. She cheated, and her sadness is not something I should fix. \" \nAnd then block them if they do not get the messege.", "Or it’s OP‘s fault due to his failure to read her mind. /s", "INFO\n\nHow was Dead Reckoning? Haven't been able to go see it yet.", "Can you talk to your parents about the situation and have them talk to their friends?  It's really not fair for them to be pressuring you directly. \n\nNTA i hope it gets settled, please ask your parents for advice at least.", "NTA, play stupid games win stupid prizes", "NTA \n\nEven if she hadn't cheated on you and had only ever been perfect it's okay to break up with someone simply because you don't want to be with them any more. \n\nHer parents need to butt out and let her handle her own friendships and relationships.\n\nThis is really not helpful behaviour from the parents, they're not letting her grow up.", "NTA These people have to right to be harassing just because they daughter can't handle the consequences of her own actions.", "NTA, \"Oh I want to sleep with other guys but I still want you there as my emotional support and safety for when I can't get laid\" is how that sounds to me.\nBet she'd be extremely annoyed if you tried the same behaviour.....", "I get it that you're 18, but it's still a sexual and romantic relationship between two young adults. Mommy and daddy have no place in it! Of course there are times and situations when a family member won't be wrong to interfere (like when there is abuse), but this is not one of them. Break-ups and failed relationships is a natural part of life no one can be shielded from. The parents interfering would be as wrong even without their daughter cheating. So, someone's 2 year old relationship didn't work out. At 18. Big surprise (it is not)!\n\nOP, you need to understand that Jenny's parents are WAY out of line here, and them being your parents' friends don't change it. Tell them something along the lines that you are very sorry Jenny is so sad, but that your relationship is between two of you, and you politely refuse to discuss it with them and won't respond to any messages regarding it. If you feel comfortable, discuss it with your parents (or they might get this story in a very distorted form). \n\nBut overall only a person you're (or was) in relationship with is entitled to any explanation, or discussion, or anything else. It might sound a bit crude, but people who are/were not in bed with you do not get to have an opinion on whom you want/don't want here.\n\nOh, and NTA, of course. Jenny's parents are. What they expect to happen when they foist their daughter on an unwilling partner?", "NTA. But I'm sorry you watched the film three times? In a row?? Are you well?", "This is honestly the only update I need from this"]}