{"id": 24702, "submission_id": "15rvqwf", "title": "AITA for telling my sister she's more annoying than my kids collectively could ever be no matter how hard they tried?", "selftext": "My parents wanted to take a family vacation over the summer and offered to subsidize everyone's tickets, paying half for everyone. My sister was a pill about the trip from the very beginning, but we were still really excited to go. Once there, we all tried to have a great time, but my sister was demanding and entitled the entire time. She was constantly asking me to go to adults only activities with her when I either already had plans or didn't think they sounded fun. Every time I turned her down she acted like I'd committed a grievous slight against her.\n\nMy sister wanted my husband and I, or just me, to go to a bar with her every night. That didn't sound fun to us, but we did agree we would go with her one night. The night we went to the bar we got there a little after seven. Just before nine we both agreed we were tired and wanted to head back upstairs.\n\nMy sister was upset and said we promised to hang out with her. We said we did, but now we are tired. She said that was bullshit. She then griped that she didn't even know why she came on the trip. Out of annoyance I said I didn't either, because she seemed determined not to have fun. She said we were abandoning her to go check on our annoying kids. I snapped at her and said my kids collectively could never be as annoying as her no matter how hard they tried. She said I was the world's worst sister and stormed off.\n\nShe refused to do a family excursion the next day that was already paid for and spent the rest of the trip moping. My mom wants me to apologize, and even my husband says I went from zero to sixty. My dad says she will get over it if I just ignore her. I don't know if I owe her an apology or not.", "created_utc": 1692113052, "permalink": "/r/AmItheAsshole/comments/15rvqwf/aita_for_telling_my_sister_shes_more_annoying/", "score": 156, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my sister she was annoying in response to her calling my kids annoying. I might be the asshole because I really snapped at her and she's still upset. I used a harsh tone and raised my voice.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA . \n\nu were not wrong about ur sis . she sounds a bit obnoxious . she should know better than to call ur kids annoying and not expecting rebuttal . also kids were a part of the trip it's silly on her part her to expect u to abandon ur kids and hang out with her", "NTA\n\nA grown woman insulted her own nieces and/or nephews and wants an apology? Honestly fuck her. Yeah maybe you could have taken the high road but this woman sounds intolerable. \n\nThe fact that she went on a FAMILY vacation with her presumably fairly old parents and her nieces/nephews and thought the trip could revolve around adult activities that really only she enjoys is beyond me. If she had something more interesting than just going to a bar in mind and was more fun herself then yeah maybe get the grandparents to watch the kids 1 or 2 nights do something adult. But if you go on a family vacation with older people and children you should expect the majority of activities to revolve around things everyone can participate in.", "NTA\n\nShe's a grown woman whining that you won't play with her? If she can't entertain herself, that's her problem. Give her a colouring book next time.", "Only apologise if you think she will also apologise so you can calm things down and salvage the rest of the holiday. \n\nSeems like sister had unrealistic expectations regarding this holiday. As soon as kids are involved, either the childless adults chose to find something to do when the parents are.. parenting, or they join in the family fun. \n\nYour sister assumed you would drop the kids and be HER playmates for this holiday. That’s not how it works and she should’ve realised this.\n\nNTA", "I’m going to go against the grain and say NTA. Your sister sounds like a childish pain in the ass.\n\nLook, I’m child free and don’t enjoy hanging out with kids, but that’s why I would think ahead and either decide I wasn’t going to enjoy the vacation and not go, or go with the expectation that it would be kid/young family oriented and understand that the adults would be compromising a lot.\n\nIf she wants to go out at night, she’s welcome to take a book or her phone to the bar and sip a glass of wine or cocktail. She doesn’t need to be dependent on you to get out. If she’s such an adult, she can be resourceful and figure out how to entertain herself. Sulking around for days and the. insulting your kids is really unnecessary and I think she got what was coming to her.", "Info - how old is everyone?  Including your children?", "As someone who understands the zero to 60 metaphor, I am leaning toward NTA. \n\nI'm with your dad. \n\nShe sounds like a lonely and bitter person.", "NAH\n\nOriginally I was going to say Nta but honestly I kind of feel a little bit of pity for your sister. From her perspective and maybe I'm assuming to much, shes been invited on a holiday with the family. It sounds to me like she is the one left out on the trip. Is there anyone else around her age also in your family who doesn't have a SO or kids. \n\nI don't think you owe her an apology but perhaps you can be the bigger person and recognise that this trip just isn't tailored for her and just do it anyway.\n\nYour sister does have a point as well. 2 hours at a bar isn't exactly a lot of adult time.", "I could definitely be angry with my sister if she call my children annoying because we didn't want to party. we wanted to be adults and spend time with Family in a family vacation . This is not a trip to Las Vegas. Your sister was the AH in this situation.", "NTA, and don't apologize. Your mother is full of it. Mothers in these stories always side with the aggressor.\n\nAnd your sister is impossible. Why do you spend time with her? Just because you're related?", "NTA - your mom wasn't there, so she's being fed information from both sides and making a judgement call to \"keep the peace\" (which is IMO, the wrong one...) but your husband WAS there where she called your kids, his own kids, \"annoying\"?? And he says you snapped?  Hell no.  Does he not have a spine or any respect for his own kids?  Your sis sounds insufferable... disrespecting your kids to your face...", "Definitely NTA. First when I was reading I thought she was a teenager, then drinking came up and I switched to YA, 21 and really immature maybe - not that it would be a valid excuse. but being 36 and calling your sister's children names to her face? That's way beyound any normal polite behaviour. She acted like she has no respect for you, your family and your wishes, i,e, like an asshole and owns you an apology.", "I just see a sister who is bitter and shouldn’t be catered to at all when being inappropriate. If you went from zero to 60 it was just to catch up with your sister and pass by her for the win. NTA.", "NTA, you can apologize for snapping (if you really want to, I don't think its a big deal), but its ultimately her fault for expecting two parents with young kids to be able to do soley adult things. She might just miss her sister and not know what its like to always take care of kids. Since your parents have each other and you have your husband and the kids, Im sure shes feeling left out.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy parents wanted to take a family vacation over the summer and offered to subsidize everyone's tickets, paying half for everyone. My sister was a pill about the trip from the very beginning, but we were still really excited to go. Once there, we all tried to have a great time, but my sister was demanding and entitled the entire time. She was constantly asking me to go to adults only activities with her when I either already had plans or didn't think they sounded fun. Every time I turned her down she acted like I'd committed a grievous slight against her.\n\nMy sister wanted my husband and I, or just me, to go to a bar with her every night. That didn't sound fun to us, but we did agree we would go with her one night. The night we went to the bar we got there a little after seven. Just before nine we both agreed we were tired and wanted to head back upstairs.\n\nMy sister was upset and said we promised to hang out with her. We said we did, but now we are tired. She said that was bullshit. She then griped that she didn't even know why she came on the trip. Out of annoyance I said I didn't either, because she seemed determined not to have fun. She said we were abandoning her to go check on our annoying kids. I snapped at her and said my kids collectively could never be as annoying as her no matter how hard they tried. She said I was the world's worst sister and stormed off.\n\nShe refused to do a family excursion the next day that was already paid for and spent the rest of the trip moping. My mom wants me to apologize, and even my husband says I went from zero to sixty. My dad says she will get over it if I just ignore her. I don't know if I owe her an apology or not.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don't know. You both got heated. If you want to keep the peace, you could say something along the lines of things got heated the other night and escalated, I am sorry for my part. Or you could ask her to talk about it to clear the air.", "Ignore her. NTA", "ESH but mostly you.\n\nYour sister wanted to spend time with you and you said that she was just being annoying, when she was trying to find an activity that you both would enjoy. You said this was needy, when it sounds like what people do on vacation. And then you blew up at her and made a huge deal out of nothing.   \n\n\nHer for calling your kids annoying.", "NTA - but would it have taken much effort to spend one on one time with her? She may have wanted some company with you.", "ESH but mainly you. Your sister was a pill? You turned down almost every invite from her and only went to the bar once for 2 hours. I bet she’s gone to countless boring kid events over the years to help you with your kids too.", "ESH. You spent only an hour at the bar? Thats pretty shitty. I get why she lost it with you.", "ESH\n\nYour sister for calling your kids annoying.\n\nYou for being a party pooper yourself.  It’s a cruise, your spouse is there and your oldest is 16. It’s not unreasonable for your sister to have anticipated doing some activities on the boat with you.  But you saw things as waste of money or not your style, preferring to hang around the pool and buffet, and acting like you did a great favour by going to bar one night at 7.  And, of course, for your reply to her.  Your interests seem incompatible and that really doesn’t have much to do with your kids at all.", "This is what gets me. She should be perfectly capable of looking at the plans and ages of the kids and discerning that it’s likely going to be child- and/or family-centric. That vacation to the parents of multiple kids might entail relaxing and sleeping.\n\nI would not go on that family vacation, because I would not have fun. And rather than set us all up to fail when I was, in fact, predictably unhappy about not having fun, I’d just say have a great time, show me pictures when you get back. I’d truly rather have the backlash of saying no (if any; maybe the OP’s family would’ve been totally cool with Sis bowing out) and saving my time and money, than say yes to using my vacation for something that would make me unhappy and bored.", "Hahaha, that's amazing. Maybe I should have.", "I'm 40 and she's 36. My kids are in the 3-16 range. My husband is 42. Our parents are in their sixties.", "Why did it have to be a bar? A movie or a shopping trip, something that you could all enjoy? Not everyone enjoys bars.", "How much time do you need to sit around a bar anyway? Two hours seems like plenty for a hotel Bar, they said they just went upstairs.", "And also because I love her.", "If she didn't want to be called annoying, she shouldn't have insulted OP's children first. She's 36 years old, too old to be throwing tantrums. At that age you should be fine with doing your own thing on holiday if your siblings are busy. \n\nIf the sister calling OP's children annoying is 'nothing', why is throwing the same word back at her 'blowing up' and 'making a huge deal'?", "Well yeah nothing is going to go your way when you’re 36 and act like you’re 12. Don’t be dense.", "What does that have to do with anything? People get tired. Judging by the way end l the sister was acting, I would be tied too.", "How old is she? She sounds very young.", "Other than going to a bar, what sorts of \"adult-only\" activities was she trying to arrange?\n\nAnd how was she approaching the invites? There would be a difference between \"I'd like to spend a little time with just you on our vacation, is there something you'd like to do?\" and just suggesting a bunch of stuff that would constantly exclude your kids (and probably your spouse and/or parents). My suspicion leans towards the latter, but clarification would be nice.", "Oh, wow. I for sure thought you were going to say late teen or early 20s for your sister! She needs to grow up.\n\nMore info: Is she single and child-free?\n\nIf so, I can get if she was a little peeved that you couldn't hang out more but since your kids were there, I'm not sure what she expected. She def could have just did things herself. There are plenty of groups and singles on cruises you can chat up.", "Right? My (childfree) spouse and I would probably at MOST hang out for a couple of hours, long enough to have a beer or two and then be done. If the sister wanted to tie one on, she might be out of luck.", "People get tired, but adults usually don't get so tired before before 9 P.M. that they bail on the one activity their sister requested.", "Wine tastings, bingo, bar trivia, that sort of thing. Wine tastings are such a waste of money, and I only like white wine anyway. Bingo is also a waste of money, and I don't understand the entertainment value. I went to one trivia with her, but I just really enjoyed the pool and buffet a lot more. That one trivia was fun, but I didn't want to do it every day. Plus she wanted to drink during trivia, and I don't like drinking during the day. Makes me tired and ruins the rest of my day.", "She is single. She broke up with her boyfriend of eight years four years ago and is still heartbroken about it. I try to be understanding, but it's been four years and he's gotten married since then, so I think it's time to move on. She doesn't have kids or want them.", "Was this a cruise? Because I’d actually be even LESS understanding of the sister if it is. Don’t cruises have a fair number of structured entertainment options? The sister could have just picked an adult-centric activity that sounded like fun and gone ahead on her own.", "I’m OP’s husband’s age, and last I checked, I’m an adult. And yeah, I get tired. I don’t have kids, but I’m ready to be in PJs and winding down by 9 PM. If I’m on vacation? Bring on the self-indulgent early pajamas!", "So two definitely adults only activities and a third that you could technically take kids to depending on the venue, but it probably wouldn't be a wise idea.\n\nPlus two of the three activities mentioned aren't even ones you'd enjoy. And the third, that you did enjoy, is one that can be fun in small doses, but who wants to do it repeatedly, especially when you're on vacation.\n\nI'm also going to assume from your answer that my suspicion about how she's inviting you is on the right track.\n\nI think you're NTA, but I'll probably add a separate top level comment with my reasoning why.", "Yep, you're right. Time to move on. Plus she missed opportunities to meet other singles. And just have fun.", "It was a cruise, yes.", "Yeah, she needed to be an adult and find something she wanted to do and just do it. If the point was to spend time with just you, she could’ve asked to do something you’d actually enjoy.", "Your dad is right", "NTA. It sounds like your sister was acting terribly, so I get why you got angry. That said, it does sound like your sister is in pain and maybe feeling like she needs some time with you. Maybe explore that?", "INFO - how old is your sister?", ">I don't know if I owe her an apology or not.\n\nYou don't owe her an apology, but I bet your mom just wants to fix everything, and placate sister. You didn't go zero to sixty, that was like zero to 15 or maybe 25.", "ESH-  your sister was a brat but you sound insufferable too.  \n\nSit down and talk to your sister.  She wants to spend some time with you as an adult but you made everything about your kids.  \n\nShe made everything about being an adult and forgot you have kids.  \n\nYou were both a little wrong.  \n\nEven your husband said you went from 0-60 really fast.  \n\nTry communicating expectations next time and have some things that everyone can enjoy.", "NTA - she metaphorically attacked your kids  - what did she expect that mama-bear wasn’t available during vacation time or something. Everyone knows you don’t use a persons kids against them and expect them to remain civil.", "Yeah, this is what I’m thinking. I’m also kind of wondering about the lead up to this. If OP is the person that had kids and then her friends and loved ones haven’t seen her without the kids since, I really get the sisters perspective. It sounds like she thought she might get to have some actual time with her sister on this trip without the kids, and she’s been shown differently. I have a lot of siblings and nearly all of them have children now, but I can’t express how much I would not be okay with the kids at every single outting. Thankfully, my siblings aren’t like that at all. Sometimes I’m out with just the kids, sometimes all of us, and sometimes just me and my sisters/brother. If OP isn’t maintaining that balance and her sister is trying really hard to get some of their relationship back rather than just “kid time”, I can sympathize with her dwindling patience.", "Yeah, this is what I’m thinking. I’m also kind of wondering about the lead up to this. If OP is the person that had kids and then her friends and loved ones haven’t seen her without the kids since, I really get the sisters perspective. It sounds like she thought she might get to have some actual time with her sister on this trip without the kids, and she’s been shown differently. I have a lot of siblings and nearly all of them have children now, but I can’t express how much I would not be okay with the kids at every single outting. Thankfully, my siblings aren’t like that at all. Sometimes I’m out with just the kids, sometimes all of us, and sometimes just me and my sisters/brother. If OP isn’t maintaining that balance and her sister is trying really hard to get some of their relationship back rather than just “kid time”, I can sympathize with her dwindling patience.", "Just because I think a lot of people here missed this tidbit: SISTER IS A 36 YEAR OLD GROWN ASS WOMAN. Jesus Christ, I don't get how OP is in any way the AH?", "This is where I'm at, especially because the activities OP does not like include wine tastings and bingo; trivia is fine but only once 🙄 These are all popular and common activities and it sounds like unless kids are able to be involved OP isn't interested in doing any activities.", "I definitely understand the sister being upset. Imagine begging your sister to spend time with you, and then you get 2 hours of what I imagine were mild disinterest because of how OP says they don't even like bars.", "I think the bar choice was on purpose so no kids could be involved at all but idk", "Not everyone enjoys those other options, either.\n\nLike, I get the \"why did it have to be a bar?\" part but the idea that there's stuff that all people will definitely enjoy doesn't really hold.", ">It sounds like she thought she might get to have some actual time with her sister on this trip without the kids, and she’s been shown differently.\n\nThe problem with this is, if the sister knew beforehand that OP was bringing her kids on the trip (which I would think would be likely, since usually ppl discuss things like that), then it's kind of common sense that she would be with her children most of the time. It would be one thing if this trip was planned for adults only, but that clearly wasn't the case here.", "Lol do you? Because that’s not obvious based on your post or your comments", "36", "It’s a cruise. They often have childcare available and child activities. I wouldn’t assume that at all. If my sisters and I went on that kind of trip it would be very much assumed we’d be getting a couple of nights of adult hangout. I don’t think it’s weird to assume a balanced trip that includes a variety of activities with and without kids. Especially when you pay for packages that include many of those things, like cruises do.", "Holy shit, she is a lost cause.", "Holy shit, buried the lede a bit there! You're NTA, your sister needs to check herself. And insulting your kids? She's very lucky that you're more restrained than I am.", "NTA.\n\nHonestly, your sister sounds a lot like my sister. I've just learned to tune her out.", "Is there ANYTHING the two of you enjoy doing together? Cause it sounds like you are poo-pooing anything she suggests as an activity. I would be annoyed, too, if my sibling was negative about suggestions I made regarding activities. I don't have any trouble doing things alone but if I'm on a trip/cruise with family I would expect to hang out with them at some point. NAH or ESH"]}