{"id": 24708, "submission_id": "15rrn74", "title": "AITA for not letting my husbands Grandma hold our baby", "selftext": "I (25F) and my husband (25M) have a 4 month old baby girl. I don’t think I’m the asshole but I see a lot of these videos on social media so I thought I would ask and get some non biased perspective.\n\n(For some context i am white and Australian born whilst my husband is Chinese and born and raised in mainland China. His parents had him rather young, around 17-18, so his grandma is also young, she’s 62F. His parents immigrated to Australia less than 10 years ago but his grandma stayed in China.)\n\nSo me and my husband having been staying at my in-laws house because I’ve been struggling with PPD (Postpartum depression). My mother-in-law (42F) has been a huge help to me and my baby, I can’t be more thankful. However recently my MIL’s mother aka my husbands grandma has come over from China to meet my baby girl and help look after her. I was so happy because every time I had met her she was so kind and caring to me despite our obvious language differences. However my problem is she is a heavy chain smoker. \n\nMe and my husband are very against smoking and do not do it ourselves, however, normally I do not care if others do. But recently I had noticed she would go outside for a smoking break and then come back inside and pick up and cuddle my daughter. I had told my husband that this made me uncomfortable only because our daughter is still really young and I didn’t want to expose her to second hand smoking. That I would prefer if she tried to quit smoking for the time being, but since I know how difficult addiction can be I said that if she wanted to smoke could she please have a shower and brush her teeth before helping with the baby.\n\nMy husband said he would talk to his grandma and parents about this but 2 days ago my MIL spoke to me about how rude and disrespectful I was for telling her mum she couldn’t hold my daughter. His whole family have been super cold to me lately, and I told my husband I didn’t mean to offend anyone just scared for my daughter’s safety.\n\nSo AITA?", "created_utc": 1692103349, "permalink": "/r/AmItheAsshole/comments/15rrn74/aita_for_not_letting_my_husbands_grandma_hold_our/", "score": 99, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > It might make me the asshole because she has been super helpful with the baby. But I’m just worried about my daughters health.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but it might be time to go home. You are very vulnerable right now and people acting cold and confronting you isn't healthy. Just because you are accepting help, doesn't mean your boundaries have to be sacrificed in the process.\n\nEdit: it is your husband's responsibility to confront his family, not yours.", "Rule 1: protect your children irrespective of who is offended. You followed protocol and got your husband to respectfully raise your request concerning smoking etiquette with his family. If they don't like it - tough - your child comes first. NTA", "NTA. However the request should not have come from you. Husband should have taken the blame and said it was his idea for grandma to shower before holding baby.", "NTA. Even if someone doesn’t have one on their lip all of the nasty chemicals are in their hair, clothes and pores. Not only does it smell vile your little ones lungs are still developing. \nI’m ashamed to say I was a smoker when my son was born but gave it up when i was ready to, if I have one regret it’s that I didn’t do it sooner. \nBut you’re up against the Chinese culture of honouring their elders no matter what. I hope you can find a way to make it work without mortally offending his family", "NTA. It is proven that second hand smoke poses a risk to babies. You want the best for your child and that’s exactly how it should be. \nYour partner should’ve taken the “blame” for this towards his family.", "Ok so I was a smoker. I was able to quit while pregnant but as soon as the baby was born, I was going outside of the hospital to smoke (I've now quit). \n\nI'm not an expert by any means and can't claim to know anything beyond what my daughter's pediatrician told me so I am just going to tell you what he told me.\n\nHe said that smoke from a cigarette is actually ash that settles on everything like a fine dust. So that smell you smell on a smoker is ash on the clothes, skin, and in the hair. I know some people here are saying you are overreacting but he told me that it's not good for the baby to be around someone who has just smoked. He gave me some pretty simple rules to follow. \n\nThe rules were:\n\n1) always smoke outside away from open windows and doors\n\n2) pull back or cover your hair while smoking\n\n3) cover clothing that the baby will actually come into contact with (I would just wear a designated \"smoking\" coat or hoodie)\n\n4) wash your hands after smoking \n\n5) never ever EVER smoke in a car\n\nSome people may still think this is too much but as a smoker I did it with my baby and I didn't think it was a big deal. My family members that smoked never complained about doing it, either.\n\nEta: I decided to double check and googled it. It's called 3rd hand smoke and it is toxic for babies. So my daughter's pediatrician appears to have been completely right.", "NTA - perhaps ask if they can change their shirt and wash their hands after smoking before holding baby as a compromise", "Actualy i was wrong, i checked some sources and its considered as third hand smoking and still dangerous to small babies. So i think you are totaly right to ask for that because harmfull chemicals from smoking will still stay on cloths and skin and its especially harmfull to babies.\n\nSource: https://raisingchildren.net.au/babies/health-daily-care/health-concerns/second-hand-smoke", "In the UK we recommend that smokers do not cuddle babies for at least 20 mins after a cigarette. The smoker continues to exhale chemicals after the cigarette is finished. If parents smoke - even if they never smoke in the bedroom, they are strongly advised not to co sleep. You are absolutely right to be concerned OP, NTA.", "NTA. You are totally in the right and they are totally in the wrong.\n\nSmoking is BAD for everyone.\n\nAnd grandma can live without grabbing the baby. \n\nBut you won't get anywhere unless your husband stands with you in intense alliance against these cigarette fanatics. \n\nAnd he won't.", "NTA - Third hand smoke is also highly toxic and harmful to animals and people.", "NTA. I am Chinese myself, and this is a huge problem where I used to live. My grandfather can't go anywhere without smoking a lot and drinking a glass of 白酒 (aka vodka) every night.\n\nEvery time I go to his house I get really bad allergies, so bad that we've even had to cut our trip short once. I strongly support you for being protective of your 4mo and you should talk to your husband about this too.\n\nEdit. After reading the other comments, I finally realize why I was going through hell at grandpa's house, thirdhand smoke. Thanks for telling me about that", "NTA. She needs to wash her hands before handling the baby. I’m not sure if second hand smoke would be a problem if she’s outside, but third hand smoke is rarely known about by older people and ABSOLUTELY an issue. The residue from the smoke remains on her clothes, fingers, face, etc. That residue is not healthy for the baby. If the baby touches these and then puts their hand in their mouth, the baby is being exposed to third hand smoke.\n\nHonestly, I would try to indicate to her that you hold respect and gratitude for her but cigarettes are simply dangerous to babies. She probably does not (and possibly will not) understand the issue but you can emphasize “I respect you, please wash those hands for the baby.” I’d also keep in mind that a Chinese woman who grew up during the Cultural Revolution most likely has wildly different views on home safety than a young Australian woman. Doesn’t mean you’re wrong. Just a BIG difference down to the basics.\n\nYou could also try getting her oral nicotine pouches. Don’t know if they have them in Australia but they’re potent and no risk to others.", "NTA, the health of your baby is the most important thing. His grandma and family are selfish as f.", "NTA. It’s actually third hand smoke - which also poses a risk to the baby. \n\nhttps://www.bannerhealth.com/healthcareblog/teach-me/the-dangers-of-thirdhand-smoke-to-you-and-your-children", "NTA, but there is a solution.\n\nI had the same issue with my smoking father-in-law holding the baby. The baby's clothing would pick up the smoke, and my baby would smell of smoke when I took him back. I didn't want the smoke residue permeating the baby's skin and clothing.\n\nWhat I did was offer a thick double-sided blanket, folded in half, to my FIL to drape on his chest and shoulder before handing him the baby. \"In case the baby spits up,\" I said. This solved the problem.  \n\n\nHave your husband, not you, tell mom and grandma that the baby smells of smoke when held by a smoker, and therefore the rule will be drape a blanket first to protect the baby from the toxins.", "NTA at all what you are asking is very reasonable as a mother and you should consider how your husband might have brought it up to his grandma", "NTA, you are trying to protect your child from third hand smoke.", "Absolutely NTA. Protect your baby, there’s a lot of clinical evidence around the dangers of exposing young children (let alone newborns!) to second hand smoke, this is perfectly reasonable. I think the family is taking it more personally than it has to be.\n\nTo add: it’s known that carcinogenics from smoke stay on clothes and fabrics  after you finish smoking. It’s not enough for her to smoke outside then come in to cuddle the baby.", "NTA! You have every right to feel the way you feel. At the same time, she was never going to agree to do all of that. If she smokes heavily, she is smoking at least 10 times per day. She was never going to take 10 showers to hold the baby.  \nYou might think about downgrading the request to 30 minutes after a cigarette, washing her hands, brushing her teeth, and putting on an apron-style robe or special shirt.", "YTA, second hand smoke is bad but she's going outside away from the baby. An air out before you touch the baby rule would be reasonable but a blanket ban on touching the baby until she quits seems excessive.", "ESH\n\nu dont sound reasonable with ur demands and she shouldn't hold a baby just after smoking \n\nmaybe make some compromise and ask her to freshen up after smoking and then hold ur kid", "Not saying you are TA but  you over reacted, i dont think your daughter get second hand smoking if grand a is not smoking in her presence. But she should be washing her hands.\n\nEdit: i found out i was wrong, read my new comment please, its harmfull even from touch of skin or cloths.", "I am not a smoker, but if she smokes outside and comes in and doesn't mouth to mouth your kid, how should your kid get second hand smoke? It smells terrible and your daughter probably won't like the smell, but grandma doesn't really give smoke to her or am I wrong? The sh't is already in her lungs, or not?", "YTA\n\nI get it second hand smoke is bad but being exposed to it for a week or two is not going to harm your child. Unless your kid has some breathing problems or other health issues there is no reason to worry. But maybe that is my late gen z upbringing where we just lived in the second hand smoke of our parents and their friends and somehow turned out fine.", "That's not really a good reason if you ask me. Second hand smoking is when you breathe the actual fumes/smoke. When she went outside and comes back in, no harm will be done. I totally understand you want to be careful, but there is no need to forbid her to hold the baby", "YTA - Smelling of smoke after a smoke is not second hand smoke and she hasn't exposed your baby to anything, nor will she ever by simply smelling strongly of cigarettes.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (25F) and my husband (25M) have a 4 month old baby girl. I don’t think I’m the asshole but I see a lot of these videos on social media so I thought I would ask and get some non biased perspective.\n\n(For some context i am white and Australian born whilst my husband is Chinese and born and raised in mainland China. His parents had him rather young, around 17-18, so his grandma is also young, she’s 62F. His parents immigrated to Australia less than 10 years ago but his grandma stayed in China.)\n\nSo me and my husband having been staying at my in-laws house because I’ve been struggling with PPD (Postpartum depression). My mother-in-law (42F) has been a huge help to me and my baby, I can’t be more thankful. However recently my MIL’s mother aka my husbands grandma has come over from China to meet my baby girl and help look after her. I was so happy because every time I had met her she was so kind and caring to me despite our obvious language differences. However my problem is she is a heavy chain smoker. \n\nMe and my husband are very against smoking and do not do it ourselves, however, normally I do not care if others do. But recently I had noticed she would go outside for a smoking break and then come back inside and pick up and cuddle my daughter. I had told my husband that this made me uncomfortable only because our daughter is still really young and I didn’t want to expose her to second hand smoking. That I would prefer if she tried to quit smoking for the time being, but since I know how difficult addiction can be I said that if she wanted to smoke could she please have a shower and brush her teeth before helping with the baby.\n\nMy husband said he would talk to his grandma and parents about this but 2 days ago my MIL spoke to me about how rude and disrespectful I was for telling her mum she couldn’t hold my daughter. His whole family have been super cold to me lately, and I told my husband I didn’t mean to offend anyone just scared for my daughter’s safety.\n\nSo AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I think you are NTA for wanting to protect your daughter. Smokers stink. I know, I used to be one. You don't realize how much your breath, clothes, hands stink after smoking. You don't want your baby's clothing picking up the smells. Asking g'ma to shower before holding the baby is probably unrealistic. Asking her to gargle with mouthwash and wash her hands is reasonable. Maybe even wear a smock or apron to cover her clothing. Everyone should be washing their hands if they have been handling toxic chemicals, and cigarette are just that.\n\n**Motor\\_Ad\\_2780** posted a link about third-hand smoke. This should be taken into consideration.\n\nSource: [https://raisingchildren.net.au/babies/health-daily-care/health-concerns/second-hand-smoke](https://raisingchildren.net.au/babies/health-daily-care/health-concerns/second-hand-smoke)\n\n*Third-hand smoke or vapour: what is it?*  \n*Third-hand smoke or vapour is what’s left behind when someone has been smoking or vaping. Third-hand smoke or vapour lands and stays on nearly every surface in the area where someone has been smoking or vaping, including on* ***skin, hair, clothing****, furniture, flooring and car seats.*  \n*This means children are exposed to harmful chemicals even after adults have finished smoking or vaping.*\n\nIn the end, this is also a Dad issue. It is his family. Dad needs to put his foot down and let the family know you are united in this front. If MIL has a comment, ask her to wait while you get your husband so he can also weigh in on this. If he is not there, make sure to initiate a discussion later with he and MIL in the room so she can back up what she said. Eventually she will learn that you are united.\n\nGood luck with your mental health. This is, I'm sure, contributing to more stress.", "NTA this is very reasonable boundary. If your in-laws feel is right to punish you for voicing it, maybe it is time to leave. Besides you never told grandma she can't hold the baby only she can't do it after smoking, they are also blowing this out of proportion", "NTA, but you do realize that for many generations infants and children where around smokers and most of us grew up to be very healthy. It's not as if grandma smokes in front of the child, she smokes outside, then comes in for a cuddle. I seriously doubt if the smell of smoke on her clothing or breath, while distasteful, would be harmful.", "NTA. I wouldn't even allow her in my home. I understand that culture concerning respecting elders is much different for the Chinese than it is for Westerners, but this is about the life and health of your baby. Let them explain what a harmful thing the grandma is insisting on doing. Your responsibility is your child. According to Wikipedia about 60% of male doctors in China are smokers - just to give you an idea of differing feelings about the dangers of smoking.", "[deleted]", "[deleted]", "3rd hand smoke is also toxic to animals. It was what finally pushed me to quit. I had a cat die from nasal cancer. I never smoked around my pets but I’ll always feel responsible for my cat having nasal cancer. I can’t do it to any other pet I have.", "Agreed. It's not enough to wash your hands or clean your teeth after smoking; there are potentially harmful chemicals lingering on a smoker, long after the cigarette has been smoked.\n\nWhile this may be no worse than taking baby down a city street in a pram, if OP feels strongly about not having smokers handling their baby, that's their decision, and so-called loved ones should respect that.", "I was a smoker for a long time. 3rd hand smoke and the dangers of it on pets is what made me finally quit.", "She's not smoking around the baby, though.", "Third hand smoke settles and build up on surfaces over long periods of time.", "That’s not how that works", "The residue lingers on skin, clothing, hair, etc. She could at least wash up and/or change her shirt before holding a 4 month old baby. It's not a matter of \"it likely won't hurt the baby,\" it's a matter of \"it could hurt my baby, so I don't want them around it.\" Either way, she's the mother, and it's not up to the grandparents. Most parents keep their newborns away from everyone until 6 mo-1 y/o for this reason.", "... that's exactly what OP \\*did\\* ask, though.   \n\n\n**\"That I would prefer if she tried to quit smoking for the time being, but since I know how difficult addiction can be I said that if she wanted to smoke could she please have a shower and brush her teeth before helping with the baby.\"**", "This crap from cigarettes will be in grandma's clothes.", "“Turned out fine” ….but then has that opinion, showing you didn’t actually turn out fine lol.", "No, it’s not, but you still are exhaling dangerous toxins for several minutes after smoking so you shouldn’t be holding a baby, you also have those toxins imbedded into your clothing so you at the very least should change before holding a baby.", "You’re right. It’s not second hand smoke.    It’s third hand smoke.    \n\nhttps://www.bannerhealth.com/healthcareblog/teach-me/the-dangers-of-thirdhand-smoke-to-you-and-your-children", "Tell me you are smoker without telling me you are a smoker! You have responded to everyone mentioning the major health risks that smoking puts my child in. I do not feel as though me being concerned for the health and safety of my child is less important than smokers feelings.", "But it stays on clothes and her breath. That is why she mentioned second hand smoke.", "How, exactly, do you think it works?", "That's not second hand smoke. How could lingering residue harm the child?", "the residue, yes, but not the smoke, right?\n\nI ain't saying it's healthy, but both my parents smoked (not in front of me) and I never had any problems. I forced my mom to stop smoking when I was 8 because I couldn't stand the smell and she is smoke free since, my dad stopped when I was born. They surely didn't changed clothes every time they hold me after smoking.", "I meant as far as my health", "[deleted]", "That's not second hand smoke, not even third hand smoke. Second hand is inhaling smoke someone else blows in the air or smoke coming off the cig itself. Third hand is smoke that settles on surfaces over a period of time. As long as granny is relatively clean she wont be covered in dangerous tar.\n\nSmoking is bad, so I'll take my downvotes, but there's no danger in someone who smells like smoke holding a baby.", "20 years ago it was understood to only be second hand if you were in the same room. Now we understand it better, it seeps through skin, mucosa, clothing, surfaces, etc", "It's still harmful for someone with developing lungs, I know the NHS advice is to keep baby away from clothing that has been worn while smoking, which wasn't the case when I had my daughter 20 years ago. If you can smell something then you are inhaling particles of it.", "So because supposedly it’s the same as the air we breathe I’m just supposed to sit there and accept my child being exposed frequently to harmful chemicals at 4 months of age? Or can I actively ensure I do my best to help keep my child healthy and safe?", "Ha, good to know, thankfully I never smoked (lost two teachers to lung cancer when I was younger) and don't have kids. If it's really that harmful, op has to talk to grandma, that she can hold the baby all she wants, if she changes clothes before.", "Could this not be an argument to wash her hands, change her t-shirt (or take a smokey jumper off) and maybe swig some mouth wash? \nI imagine showering and brushing your teeth as many times a day as I have a cigarette would mean that you'd never get dry. But surely there's a compromise. Baby comes first. I say nta.", "[deleted]", "I never said she couldn’t… I just asked that she refrained from smoking or have a shower after… god forbid I want the best for my child’s health and safety 😒", "NTA the chemicals from cigs are harmful to babies. She shouldnt be holding her right after smoking but this is not something everyone really knows. \n\nI think its time you went home. She's not going to quit smoking and you shouldnt expose your baby to this. This isnt really a healthy environment and Im not sure this is an argument you can win and the stress isnt going to help with PPD,and theres also the cultural difference there.", "NTA. You were absolutly right. Never let a smoker touch your baby with out a shower and a change of clothes. \n\nWhile medical experts continue to learn more everyday about its long-term effects, research has shown that thirdhand smoke causes damage to people’s DNA, increasing their risk of developing certain cancers, such as lung cancer, and other chronic diseases like asthma.", "NTA this is actually quite dangerous for the baby and your husband needs to step up.", "That's not how second-hand smoke works. The harm comes from breathing the smoke someone else exhales. You don't get lung cancer from just standing near (or being held by) a person who recently smoked. No judgement here, just a note.", "YTA\nthe sun is literally gonna explode. The world is on fire. AI is gonna take over and air is unbreathable. And you had a baby. Let the girl hold the baby. People can change", "NTA. Great job, mama! It is your job to protect your baby and that's what you're doing.", "My nan died from 2nd and 3rd hand smoking. It eventually gave her cancer. She died in her early 60's", "My mom smoked for 50 years. My sister telling her that under no circumstances would she be holding her baby while covered in cigarette chemicals was the only thing that finally worked to break the habit.", "2nd hand is still smoke you breath, regardless of location. 3rd hand is what you're talking about and is defined as smoke that settles on surfaces over time. Let granny wash her hands and hold the baby.", "Hands, arms, chest, neck, anywhere the baby touches. \n\nThis is absolutely not debatable in terms of risk to infants. Ask any pediatrician.\n\n\nAlso I didn’t say the rest was second hand. Just that twenty years ago, that was what the research said. Now we know it goes way beyond second hand. Washing hands is absolutely not enough", "Fair enough. Dumb hill for me to die on. Smoking is bad.", "Yes, especially for an infant with brand new skin and brand new lungs (that do not completely fully develop until 3-4 years old)", "So that's not really how second-hand smoke works. However still your baby your rules! NTA", "NTA in the uk midwifes always tell you that if someone smokes before holding the baby, they need to wash their hands and change their clothes it's just common sense not to hold a baby after smoking", "NTA\n\nYou're the mom, and in regards to baby's safety, you call the shots.\n\nI hate the idea of extended family being \"entitled\" to time with a baby.  It always gives me an icky feeling.  Not only that, 4m is reallly really young and sensitive to stuff.  It's not weird to be uncomfortable.    But regardless, again, you're the mom.  You call the shots.  If your instincts tell you to speak up, speak up.  \n\nMight be worth looking up some documentation or getting a doctor's note explaining why it's bad for baby.  Put emphasis on \"I'm not saying you can't hold her, just not right after smoking.  Change your clothes first and take some mouthwash.\" Or whatever.", "\"Thirdhand smoke refers to smoke and toxic chemicals left on clothes and other surfaces in the area of a smoker. When you or someone else smokes outside and then holds the baby, smoke and toxic chemicals can be transferred to the baby. Wear clean clothes when you hold the baby.\""]}