{"id": 24777, "submission_id": "15sptmy", "title": "AITA for giving my wife an ultimatum about baby names?", "selftext": "Before my wife and I got married, we made an agreement that she would get to name our first boy, and I would get to name our first girl. We recently discovered that she was pregnant with twins, and after talking about it, we decided to stick to our original plan.\n\nI thought everything would be fine, but ever since I heard the name she chose, we've been having problems.\n\nThe name is bad. It sounds really stupid, and it's absolutely the kind of name that will get our son bullied. I immediately vetoed it, but my wife said I can't because that wasn't our agreement.\n\nI asked why she insisted on this particular name. Apparently it comes from a character she identified with in one of her favorite books when she was growing up. But emotional attachment doesn't make the name itself any better.\n\nI said fine, then I may as well name our daughter Hortensia Beerbong the Third. It sounds just as dumb. She told me I couldn't do that, and I just said why not? It's my choice. That was the agreement.\n\nWe've been at an impasse ever since.\n\nNow, obviously, I'm not actually going to name my daughter that, and I'm pretty sure my wife knows that too. I was just trying to help her see the mistake she was making, but she's not listening to reason.\n\nRecently, she's started hinting she might just take off around her due date and give birth somewhere without me and my naming input. I think that's uncalled for, but I've got a week long business trip that I can't get out of about a month before she's due, and I'm worried she'll take the opportunity to disappear until after the twins are here.\n\nI've told my brother to keep an eye on her while I'm gone, but it's not like he can watch her 24/7.\n\nI think her name choice is dumb and will cause problems for our son, and she thinks I'm being controlling and overdramatic. Neither of us are willing to back down, but with her hints about skipping town for the birth I've been wondering if things have gone too far.\n\nAITA?", "created_utc": 1692192197, "permalink": "/r/AmItheAsshole/comments/15sptmy/aita_for_giving_my_wife_an_ultimatum_about_baby/", "score": 5554, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because, instead of trying to communicate more effectively, I gave my wife an ultimatum to try to get my way and weaponized my daughters name in the process.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I think you and your wife have more issues than just naming the children.\n\nFor her to threaten to take off and have the birth without you, and name the children to spite you,  and then you escalating by asking your brother to watch her, is NOT a good indicator for the health of your marriage.  \n\nFor many couples, naming their children is a two yeses is a win, a single no cancels that choice.  You both should agree on the names.", ">Before my wife and I got married, we made an agreement that she would get to name our first boy, and I would get to name our first girl\n\nESH. This is always a dumb mistake.  One no 2 two yes is the only way to name a child", "ESH\n\nHow old are you both? 11 and 12? Because that's the vibe I'm getting\n\nWho makes a deal like this?\n\nI hope Megatron Jacob Edward and Hortensia Beerbong the Third have a good support network outside of the both of you that can actually handle the responsibility of raising a child", "ESH.  This was a dumb agreement to come to as it is virtually guaranteed to lead to some sort of disagreement.  Now there are threats and ultimatums and I question where this relationship is headed if she's willing to take off and have the twins by herself and name both.", "ESH\n\nNeville isn't a bad name, even though it is heavily assosiated with the Harry Potter franchise.\n\nBut where you both fucked up is with this agreement who get's to pick a name, as it led to where you are now.", "ESH - You can’t respect her choice in names? She might take off over a name dispute? Your poor children they’re gonna have little kids for parents!", "ESH. Who agrees to have zero input into the name of their child? Do what everyone else in the world does when picking names. Put a list together of names you love, she does the same, and figure it out together.", "OK, knowing the name choice is \"Neville\", I think you're worse here, though this is still firmly an ESH situation.\n\n\"Neville\" is a pretty bad name from a character named and characterized as a bit of a joke. But it's nowhere near \"Hortensia beerbong the 3rd\", or even near the realm of \"you obviously named your kid after a fictional character\". In any sane relationship, you'd be able to say \"hey I don't like that name at all\" and be done with it, but you made a stupid pact and now both of you are acting very stupid about following through with it instead of like a team. You're worse here, because you're escalating it more, but neither of you are responding *well* here.", "INFO\n\nWhat was the name? \nAlso, what do you plan on naming your daughter?", "ESH\n\nYou're agreement was silly as hell.  No one should have a baby-name  blank check.  I have a \"friend\" that named his kid Tain (or Tane).  \"Dude, he's going to get called Taint once he hits middle/high school.\"  Guess who became a bulliled, High School dropout that doesn't speak to his parents.\n\nAnyway, good luck with the twins!", "ESH Sounds like she had that name picked the whole time and got you to agree to a deal to prevent you from stopping her.", "INFO: we're gonna need to know these names before we can judge. because most of the time, you should stick to a deal you've made, but some names are just so bad that you deserve a veto and should stage an intervention.", "Did i miss you sharing the name? How can we judge if we dont know the name\n\nFor all we know the name is Harry and you are ridiculous\n\n\nYta for telling your brother to keep an eye on her lol sid you kidnap her?  \n\nGood luck to her escape 🙏", "There’s a tie in assholery here.\n\nIf her threat of running away was genuine, what kind of partner are you that she’d rather raise the twins without you? I’m sure her idea of leaving doesn’t begin and end with the name issue. That means you suck. If she’s bluffing to manipulate you, and you’re actually a loving and supportive partner, she also sucks.\n\nESH\n\nNB: Neville as a boy’s name is acceptable, by the way. I’ve seen people atrociously name their kids Hunter, Topper, Vlademeer (yeah, spelled that way). Count yourself lucky instead. Your wife could have done worse.", "The name being?.. Surely you’d remember to post the name? \n\nTake the opportunity to disappear until after the twins are born?… what?\n\nNot sure I quite this post. Sorry if I’m being harsh not believing it but it seems too heated and gaps everywhere.", "ESH. I am a father of 2 and I know how the naming process is important. In my opinion, this deal makes no sense. Both of you should just abandon this deal. You are both adults, this deal is not a contract, this is not a thing you should abide to if it doesn't bring anything positive.\nThe way we did it me and my wife is simple: \"Let's chose a name that we both like\". We both suggested names, we both rejected some, until we found a name we both likes.\nThere are thousand of names, you both just have to be reasonable and find something that will fit you both.", "Don't believe this post.", "INFO: what's the name? \n\nAnyways, you two made a stupid agreement. It's time to sit down and say \"hey, this was something I thought I would be okay with when we were only thinking of hypothetical children, but now that theres actual kids in the mix I want us both to agree on a name for all of our children and give up both of our exclusive naming rights.\" Stop calling her name stupid. People don't listen well when they feel they're being attacked.\n\nEdit: YTA, it's not like she's calling the kid Albus Severus, Neville is a real name thats just a bit classic (ie, old). It's not going to get the kid bullied anymore than any other name.", "ESH\n\nFirst of all, it was a stupid agreement to begin with. No one should have unilateral control over naming a child without veto power from the other partner. \n\nSecondly, if your relationship is so bad that your wife is threatening to take off and cut you out of your children's birth, naming issues are the last thing you should worry about. You two need counseling. Like immediately.\n\nAlso, it's a total AH move on your part to take a trip a month before your wife is due with twins. Twins almost never go full term. For as much as you worry about missing the birth, you're the one making it likely that will happen.\n\nIt's also an AH move to name a child something that will get them bullied. \n\nCounseling. Immediately. Frequently. Hopefully you can untangle this mess before you bring kids into it.", "ESH. Using your kids to fulfill whatever fantasies y’all have and using them as weapons is stupid and cruel enough.", "I'm torn between ESH and YTA, but I'm going with YTA. Honestly, I think agreements like that are flawed to begin with. Each parent should get a say in what their children will be named to, at the very least, avoid situations like this. What put me over the edge to YTA is you having your brother keep an eye on her while you're away. That's just creepy.", "Jesus why do people put themselves in situations like these ? She is going to give birth on her own ? You plan a business trip right around the time your wife is about to give birth ? Your brother has to \"watch\" your wife ?\nESH. Well done 10/10 enjoy life bro !", "The name Neville is increasing in popularity and Rose has been used for years. What is your problem with these names?", "Jesus Christ I feel sorry for the children, ESH please grow up both of you.", "Sorry. You’re worried you wife will leave and take your unborn children with her. And you’re worried about their freaking *names*?!???!?\n\nYou’ve much bigger problems.", "ESH. You both need to work on compromise and how to employ good sense.", "So you guys aren’t even mature enough to deal with naming babies but you think you’re ready to have them? ESH", "Neville? The kids name will be Neville? \n\nYTA. I thought it was going to be something super outrageous like fartknocker or something, but Neville??? \n\nCome on dude, grow up! Neville is fine to name a kid\n At least she's not chosen Draco or Cormac.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBefore my wife and I got married, we made an agreement that she would get to name our first boy, and I would get to name our first girl. We recently discovered that she was pregnant with twins, and after talking about it, we decided to stick to our original plan.\n\nI thought everything would be fine, but ever since I heard the name she chose, we've been having problems.\n\nThe name is bad. It sounds really stupid, and it's absolutely the kind of name that will get our son bullied. I immediately vetoed it, but my wife said I can't because that wasn't our agreement.\n\nI asked why she insisted on this particular name. Apparently it comes from a character she identified with in one of her favorite books when she was growing up. But emotional attachment doesn't make the name itself any better.\n\nI said fine, then I may as well name our daughter Hortensia Beerbong the Third. It sounds just as dumb. She told me I couldn't do that, and I just said why not? It's my choice. That was the agreement.\n\nWe've been at an impasse ever since.\n\nNow, obviously, I'm not actually going to name my daughter that, and I'm pretty sure my wife knows that too. I was just trying to help her see the mistake she was making, but she's not listening to reason.\n\nRecently, she's started hinting she might just take off around her due date and give birth somewhere without me and my naming input. I think that's uncalled for, but I've got a week long business trip that I can't get out of about a month before she's due, and I'm worried she'll take the opportunity to disappear until after the twins are here.\n\nI've told my brother to keep an eye on her while I'm gone, but it's not like he can watch her 24/7.\n\nI think her name choice is dumb and will cause problems for our son, and she thinks I'm being controlling and overdramatic. Neither of us are willing to back down, but with her hints about skipping town for the birth I've been wondering if things have gone too far.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH. Y’all are too immature to be parents. Get some therapy.", "YTA. If my spouse recruited family members to \"watch\" me while he was out of town, I'd disappear too. And not come back.", "YTA. The name she’s picked is not ridiculous at all, and if you’re stooping low enough to get your brother to watch her I can see why she wants to get away from you", "YTA. Have you seen Neville’s glow up?", "So hard to judge without the name. Since you didn’t include it I’ll have to assume it isn’t something obviously atrocious like Dipsheet, and go with YTA. \n\nIf you were smart you would have included veto rights, or something of the like. But you didn’t. Your kid may or may not be bullied, and name is just one of many possible reasons. \n\nYou could mention it to a couple of your wife’s family members and if they think it’s as ridiculous as you do they can try to influence her.", "She is going to 'disappear' because you dont agree on the name? WHAT!\n\nThe vibe is off with this one.\n\nAlso this post reminds me of that one episode from 'friends' where phoebe and mike change their names to something ridiculous.", "ESH. Please fight elsewhere than drawing unborn children in already?\n\nAnd is there any trust and love to be found?", "ESH.\n\nI agree that naming someone so blatantly after a book character isn’t a good idea. There was a post here a while ago from a girl with an even more obscure and obvious HP name who ended up changing it.\n\nHowever, even if I agree with you I will call people an A every time they make this type of arrangement for children’s names. I don’t know who started the idea that fathers should have carte blanche naming one child and mothers should have carte blanche naming another but I find it extremely problematic on multiple levels. It never ends well.\n\nParents need to both agree on names. Period.\n\nI’d suggest using Neville’s middle name but that’s Samwise and opens a whole bigger can of worms. \n\nHis grandmother’s name is Augusta and she was awesome. Perhaps suggest August as a compromise?", "ESH, you are both unreasonable. It’s not about you, but about your kids. And your wife is crazy if she really plans to “skip town” to give birth without you.", "YTA. Neville is not remotely comparable to 'Hortensia Beerbong the Third'. I cannot believe how you made this sound...I was expecting the name to be like Hulk or Tin Captain or something. Neville is just so normal.", "[deleted]", "YTA\n\nThere is nothing wrong with the name Neville.\n\nMy parents had almost the same arrangement, except they only knew the sex of one baby (a girl). My mum had a girls name she loved and the first girl born (or only girl if I'd been a boy) would get that name. My dad picked my name, but wanted my mum's input. So he asked her for a list of names and as a joke she listed Pandora with all the other names. My dad picked Pandora, which I'm forever grateful for, because I'm not a Penelope (my mums pick). As long as the name sounds like an actual name your kid will be fine. \n\nThe name you picked is just as likely to result in bullying as the name your wife picked. \nOf the top of my head:\nRose piggy nose.\nRose likes a big hose.\n\nAnd that's just two, I'm sure kids will be able to think of many more phrases that rhyme with rose. Basically no name is safe against bullying.", "ESH. I feel so bad for your poor kids.", "Jfc,  you guys are completely dysfunctional,  ESH I guess", "No wonder we have so many fucked up kids out there.", "And here I was, thinking she chose Gaylord.\n\nESH and you have also even bigger problems than names.", "ESH. They’re kids you’re naming, not hamsters. Arbitrarily deciding only 1 of you gets to pick, based on the gender, was an odd route to go down in the first place for what is a really important decision. OP’s reaction being to come out with something completely ridiculous just to undermine her and make he sound stupid to make a point is pretty immature, as is her threatening to just go and give birth without him just so she can name them by herself.", "Neville is a terrible name. Sorry it just is. \nThis child will never have individuality because he’s named after such a famous character. \n\nLow key abuse. Everywhere he’ll go , this late bloomer turned hero will follow him. \n\nIt’s like naming your daughter Beyoncé. She’s never going anywhere without someone thinking of or likening her to the star.  \n\nI don’t think it’s fair to the kid . \nNeville in pre k \nNeville in high school \nNeville when he’s in his 40s working in a supervisory role ? \n\nI just don’t think it makes any sense.", "YTA. You are allowed to dislike the name Neville, but there's nothing inherently wrong with it. Do you think everyone is going to associate it with Harry Potter forever? It was a legit name before HP (Neville Chamberlain, anyone?) and it still will be after.  Also, are any names associated with movies considered off-limits? No more Doms or Brians because of Fast and Furious? Jacobs from Twilight? Ethans from Mission Impossible? Petes from Top Gun?\n\nIt doesn't make the name dumb because you don't like it, but maybe use your words to say that.", "It's just Neville? If I'm assuming it's a Harry Potter reference then don't forget that although Neville started off as the butt of jokes,he was the hero of the Battle of Hogworts, stood up to Voldemort,killed Nagini and became a successfull Herbology teacher. Neville can teach people a lot about growing as a person and finding strength and resilience when you really need it. I don't think it's a bad name tbh,but going for ESH\n\nSorry adding an edit. I can guarantee that no Harry Potter fan sees Neville as a source of ridicule. He was the only one that stood up to Harry,Ron and Hermione despite also knowing that Voldemort was a risk. He was the only one that challenged him head on at the battle of Hogworts despite Harry being dead (in theory) and he was worthy enough to use Godrics sword. He's a truly respected character.", "YTA\n\nNeville is a normal name that people have had for centuries. She’s acting wild by saying she might leave and have the baby somewhere else, but also, you’re the one saying you’re gonna name your daughter Hortencia Beerbong—I’m inclined to believe she’s joking about running off. You caused all this by insisting her name choice would get your son bullied just because you don’t like the name.\n\nYou made an agreement, and if the name she chose was, say, Asshat Jones or Reefer McSmokey, I’d say you were well within your right to object. But its a normal name! I have a cousin called Neville! I know a handful! And a couple of them get/got bullied and others didn’t, but the ones who did, it wasn’t because of their name.\n\nShe escalated because you keep escalating. Either chill out and accept her name because there’s nothing wrong with it, or offer to change the terms—if she gets rid of the name, she can have veto power on the girl’s name, or she can choose the middle name herself, or something.", "Bro Neville? Really you are throwing a hissy fit about the name Neville?? The character itself aside if it is the one I'm thinking off that is a full on normal name! Both of you are being extremely childish about this and there is definitely more wrong going on if your wife hints or insists to give birth without you knowing even where she'll be. I highly doubt it's just about to get you away for the naming of the child. Both of you are about to be parents to *twins* so for goodness sake grow up and act like adults. Like come on you'd have an actual point had it been Sonic, Krator, Ganondorf! ESH", "ESH because of the escalation (having your brother stalk your wife, her threat to leave town to give birth). Her name choice of \"Neville\" is not stupid. FWIW my partner got me to agree to a particular name when I was super tired and wanted him to leave me alone so I could nap while pregnant. I thought the name was weird/dumb but it wasn't atrocious, the reasoning was sound, and it was fine. There were not any sincerely negative associations with the name either (ex partners, bullies we knew, or mass murderers). \n\nEvery time we have a new doctor or teacher, we get a \"That's a great name.\" And I have said thanks and gave my partner his due credit for picking it. It has grown on me. \n\nThe name is fine. It may grow on you. She may change her mind. Ya'll need to come to an agreement and find a better way to sort your issues.", "YTA. What's wrong with the name Neville? As a Manchester United fan, Gary Neville is the name of a legend who played for us.", "YTA because the name Neville is totally normal. ESH for the way this argument has played out with her \"hinting at?\" leaving and giving birth in secret (though how reliable you are as a narrator idk) and you for putting her under your brother's surveillance. Like, extremely weird.", "NTA. Your marriage is over. Call a lawyer.", "If it can come to that you have more serious problems than the names of the children.\n\nAbout the naming itself, this type of rules are always stupid. A name should be a 2 yes 1 no situation. You are entitled to changing your mind and vetoing the name. And she's not entitled to choose the name she wants without your input.\n\nBest of luck\n\nNTA", "If she goes with her choice I'd definitely say you should go with Hortensia Beerbong The Third. I spat my cup of tea out :-)", "Only rich celebrities can safely give their kids stupid names. NTA", "ESH. One no, two yeses, and what the fuck is \"Hortensia Beerbong III\" in response to \"Neville\"?", "ESH - first off, kids shouldn’t be a sign of your fandom, but Neville is a pretty normal name, HP aside. And older names are on the rise again so it’s not the worst thing ever. However, you don’t like it so your wife should be willing to compromise - but that wasn’t written into your original agreement (which is stupid btw). Her hinting that she’s going to take off is immature. Maybe you shouldn’t be having kids at all.", "This is beyond aita...this is already time to file divorce papers, get a DNA test, set up a parenting plan.", "ESH. \n\nBoth of you are very immature. And no where near ready to have children or be married. \n\nBut, I think you are more in the wrong because Neville is not a stupid name. It might not be the most popular name in the US, but many people are named Neville. And it’s not a weird or stupid name. I understand why your wife says that you’re being ridiculous and overdramatic.", "There's Facebook groups dedicated to awful awful names \"creative\" parents gave to their kids and a lot of stories about how those names affected or even ruined the children's life. Tragedeighs.\nDo you think you can organize an intervention with all the people caring for her and asking her not to ruins the kid's life over a fandom?\n\nEDIT: Changed the score after reading more comments. THE NAME IS NEVILLE!?!?!? THAT'S A REAL AND KINDA NORMAL NAME. Shame she probably still supports the awful author, but other than that, it's an ok name. You're an ass, but in this situations ESH.", "Neville is a normal name and your intense overreaction is unnecessary. Hortensia Beerbong is not at all comparable to Neville, which is an actual name. \n\nShe does suck for threatening to leave to have the babies but it makes me wonder if there are other instances where you’re this dramatic and controlling (having your brother monitor her, really?). Like her feeling she needs to escape your control is kind of concerning. \n\nESH but you more.", "Neville Longbottom was a hero.", "My mum's old boss was called Neville, he was like a second father to her. Even though I never met him, she speaks of him with such fondness that I'm actually rather partial to the name.\n\nIf OP hadn't mentioned that his wife took it from a book, my first instinct would NOT have been 'oh, Neville Longbottom?'\n\nNow, if she was naming the kid albus Percival wulfric Brian, it'd be different...", "ESH, but I think you're more in the wrong. The \"I choose the name\" rule is stupid and will only ever lead to situations like these.\n\nYou ARE being controlling and overdramatic. Neville is totally normal, unlike your joke suggestion, and while it may have some literary connections, there's tons of other wizardy-inspired names floating around now. Nobody is going to care. \n\nHer comments about jumping ship before the twins are born is also problematic and dramatic, but I'm wondering if there's been more issues than just the naming that have been occurring that would make her want to choose this option.\n\nYou're gonna be parents. To twins. The next few months are going to be challenging enough. Both of you need to get your shit together and act like a team.", "ESH.\n\nNeville is a perfectly normal name and y’all behave like children", "So which one of the babies are you growing?    Which one are you tearing your body in half and risking your life to deliver?  Lmfao.     I laughed when I read the title. Like ugly laughed.   Yta and don’t seem to get how this works.", "ESH\n\nNeville is a normal name. Nothing wrong with it \n\nHer threatening to take off and give birth and name them without you is not ok and not normal behaviour \n\nYour original agreement is dumb shouldn’t have done that but you did and can’t change it- you took away each other veto powers and did you never think about the possibility that you may not like that name \n\nGet couples counselling and maybe individual therapy-especially for your wife", "Neville is a fine name. Was expecting worse.", "First off, ESH and yall seemingly have more issues than names.\n\n1. If this was the agreement - frankly, you dont get a say. If youre being allowed to name the girl, doesnt seem fair that she cant name the boy? \n2. Neville is fine as a name. \n3. Maybe you could COMPROMISE (i know, big word!) and use your choices as names as middle names instead? And then actually COMPROMISE and come up with first names you can both agree on", "The name Neville is a great name. It’s nowhere close to the name you countered for your potential future daughter. I think you are out of bounds here", "YTA. The name she picked is a perfectly normal name — it’s just not to your taste. If you were going to veto a perfectly normal name that you simply don’t like, then you should never have made the naming agreement to begin with. And really, *you should never have made the naming agreement to begin with*. \n\nThe best way to move forward is to give your children the two names you’ve each picked as middle names and then move forward picking first names you *both* like and agree to for *both* children.", "Neville?  Was she expecting \"peace in our time\" with a old fogey name like that?  Don't appease her on this one. She'll just invade Czechoslovakia next.", "NTA and jfc I’m so sick of people not even *trying* to hide the fact that they’re procreating for themselves because babies are cute fun puppy like creatures and not fucking **human beings** who will live entire lives independent of their parents. \n\nYour wife probly needs a reality check that you’re about to birth humans and she should have gotten a pet if she wanted to name it stupid shit and tote it around for funsies.\n\n\nEdit: the name is “Neville” ?? \nThat’s an actual name not the character scenario OP painted \nMy comment is for the parents naming their kids weird stupid shit you’d name a pet for fun. \n\n\nThis isn’t that. He just doesn’t like the name that’s a different argument.", "NTA,\n  But only for the point on the name. Poor name choices are cruelty and can effect the child and future adult for the rest of his life. \n\n That all being said. There are a lot of issues that need worked out.", "NTA.  I'm alarmed that your wife is hinting she will give birth elsewhere, so she names the children instead without your input.  What kind of marriage is this?  That's really messed up.", "Nta. And get a paternity test.", "NTA.\n\nSome names are so bad that folks need to be told to pull their head out while they still have the opportunity.", "[removed]", "You can always just call your kid something else and when he gets older he can decide if he wants to change his name", "You two sound like children yourself. And what a stupid rule to let one parent name a child with no input of the other parent. ESH.", "ESH\n\nShe wants to run off and give birth? What else is going on in your marriage that you two can't talk through this?\n\nsounds like this marriage is in shambles. Please get your act together before you bring new life in the world. Your kids need better parenting that threats to run off to hide from each other.", "Everyone who makes these his and hers naming decision is an AH, imo.  Just have normal conversations like a team and come up with a name you both love.", "ESH -although my first thought of Neville was the villain in Icarley", "ESH\n\nwhy are you married? And how does the rest of your marriage work? And are you sure the two of you are actually capable of raising children without enormous conflict? and.. and.. and.. seriously, you both need to figure out what you want your family life to look like, how you will handle the inevitable differences in child rearing etc… these kids seem doomed, just from this post..", "ESH. Baby names are another two yes, one no situation. If it helps at all. Kids these days find names we would have found weird,normal and will find  something else to pick on each other about.", "It’s dumb to divide the naming that way: One should come up with 10 acceptable names and the other chooses from them. For the other twin do the same but the roles reversed. Probably neither of you know 10 truly absurd names so your kids should be fine.", "First of all, you never should have made that agreement. Naming the children is something that should be done together. \nSecondly, she’s going to skip town and give birth? To twins? What is going on in this marriage", "ESH you both (and the child) will have to live with their  name. You both should have input on both the names, and thinking it’s simpler to take turns naming only sounds better on paper.", "ESH\n\n\nChildren shouldn't be having children. Grow up.", "Is she unhinged?  Who threatens to run away to give birth?\n\nNTA", "this is why you don't make a decision to give one parent sole power over a baby name. this was absolutely going to blow up in your faces from the very beginning and you only have yourselves to blame. both of you need to grow up. neither one of you sounds ready to be a parent. ESH", "ESH. Baby names should be a “2 yes, 1 no” decision in a marriage. Your original agreement was a bad idea and now you are experiencing the consequences.", "YTA\n\nAnd you might want to consider marriage counseling before you (and your brother) do something you will regret.", "Maybe you each come up with a list of three. Then the other partner gets to select amongst the provided choices.\n\nIMO, too many people consider babies to be similar to houses or art. Something you accessorize and mold to be your vision. As a mother of five, I started out with this delusion. On about day 3 after the birth of our first, I came to see that I was nothing more than a safe haven for an already existing person to unfold.\n\nOur children are not us in miniature to burden them with a name that is about YOU (not you OP but the collective you) is short sighted. \n\n&#x200B;\n\nPS: this idea of running away to get her way does not bode well for the collective parenting idea. That would scare me were I in your place.", "ESH, and I wish I had your problems in life.", "ESH…man oh man, so many AITA posts that just prove there are WAY too many people having children who just shouldn’t at all.", "ESH.  The deal you made is absolutely ridiculous.  Did it not occur to either of you that you may not like the name the other chose for a child you share?  You didn't think to decide on names....together???  She's picking out stupid names and you don't like them. Didn't you think that was a possibility?  Could have been the other way around too?  And she's threatening to leave over a name?  You both sound too incredibly immature to be raising children.  Your children's names is the least of your problems. You need professional help as a couple. Do this before your children arrive and are at the mercy of two dysfunctional parents.", "ESH: She’s saying she’ll leave during that time and you are saying that you’ll have someone essentially guarding her. None of that seems like a healthy way to start parenting.", "This is mental. You need to see a councillor before the kids get here because my god this is both extremely petty and very serious.", "You're both AHs. Why are you starting this poor child's life with an argument? Start saving for therapy because the kids will need it.", "Why do people make these dumb agreements? Why not just go through baby names and pick one you both like? That’s literally what probably the rest of the world does.", "ESH, and if this is how you guys handle disagreements, I don't predict a long future for your marriage.  Get couples counseling Stat.", "ESH - it’s a shame you two are reproducing because you’ve got bigger issues than choosing names", "Your marriage is in serious trouble. Your wife sounds too immature to even be married, much less be a mother. Yes, things have gone too far. Dude, you need some serous help, as in a lawyer.", "ESH. You both seem to childish & petty to be bringing children into your relationship.", "ESH. You both sound immature as hell.", "ESH why don’t you and your wife be actual adults and have a sit down conversation about this instead of giving back and fourth like petty teens", "Damn, you're in for a tough 18 years. NTA", "“Honey, we can still each pick a name but it means a lot to me that we ultimately agree on names that means something to both of us.\n\nObviously I’m not going to name our other child <Stupid Name>.  I was being pedantic, that that was immature and must have only fueled your frustration.  I am sorry.\n\nHowever it is not ok to threaten to leave and birth our children on your own.  I hope that wasn’t a serious threat.\n\n*Give chance for her to take ownership and apologize*”\n\nYou both need to be on board with your child’s name.\n\nIf she was serious about leaving and isn’t willing to compromise you need to realize this as a huge red flag of things to come.", "These agreements are so dumb. Unless you have a list of a few agreed upon names.\n\nHer saying she will disappear is absolutely unacceptable. That’s not a funny joke or laughable thing, and is an absurd betrayal or trust coupled with being wildly dangerous for you to not know where she is, or how she and the babies are. Joke or not.\n\nI’m going N A H, because this whole thing with naming is ridiculous and should be a better discussed topic so a communication issue on each side. However, the threat of running and you thinking she’d seriously do it make me think you NTA, as her behavior here is unreasonable in more ways than one..", "Neville?\n\n[You might be over-reacting.](https://www.youtube.com/watch?v=goPerp_BWvs)", "Wrote this post before seeing the name was Neville.  Not quite as bad as I imagined.\n\nShe may insist on the stupid name and it may even make it to his birth certificate doesn’t mean YOU have to call him that.    Give him a nickname.    If the name is so bad I’m sure your son after the first few times being bullied for his name will want to go by something else.   \n\nWhat do others think of this name?", "ESH.  This whole situation is incredibly stupid.", "ESH. Straight up self sabotage from the beginning!", "You two have bigger problems than naming your kids. Her threat to take off should be taken quite seriously, OP. \n\nESH", "NTA but if she's going to play silly games, put some silly consequences in. Let her know that if she leaves, she won't be welcome back, and that you'll fight tooth and nail against any claims she makes. The only right response to threats is an escalation.", "ESH. \n\nFirst, from your comments, the name is not that bad. At least in the US, there are way worse names going around, and even without that, this isn't a likely name to get bullied. You never know why your kid could get bullied, but I don't think the name is any more or less likely than most common names. Basically- kids can find ways to make almost any name an issue to be bullied over if they really want to, and Neville isn't any better or worse. \n\nSecond, threatening to name your daughter a truly awful name is not a way to have an adult conversation. \n\nThird, the reason you but are AH's is because her threatening to run away and you truly thinking she will means you two have some deep seated issues to work through.", "INFO. WHAT IS THE NAME? \nWHERE ARE YOU LOCATED?", "Yta, she could have named him Smeagol", "YTA Neville and Rose are normal names.", "e s h\n\nYou are grown ups that will be responsible for 2 lifes. You both should get your shit together and better work in your communication.  \n\n\nEdit: Found the name, have to change it to YTA  \nWhat is wrong with you?", "All this over the name Neville? Seriously?\n\nESH because you two can't behave like adults and actually communicate properly. I sincerely hope you are able to schedule a few couples counselling sessions before your babies arrive.", "YTA for making a stupid agreement. I am very, very against breaking bargains. However you have a bigger responsibility to your son. You can’t let her name him something that is going to cause him trouble in life. Your kid has to live with his name. So many people treat naming their kids like their own personal egobath but it’s actually really important to their life and a huge responsibility. \n\nAlso you’re not very bright. Did you not consider that maybe your wife might pick something stupid?\n\nYou need to go back on your word. I hate saying that, but it’s true. Also if your wife is really going to disappear for a month to give birth without you, I think you made an even bigger mistake by marring the wrong person. \n\nYou’re so fucked.", "I’d be clear with her if she pulls that stunt and takes off with those kids to name them whatever she wants this will for sure 1000% end your marriage and you will be very clear with a judge the level of pettiness and spite she has shown. I get that your trying to protect your son from a stupid name that will get him bullied parents who think the name defines them don’t get that it has nothing to do with them but the kid that has to live with it. Be clear with your wife that these names should be agreed on by you both and that if she does this it’s over. How could you ever trust her again if she did this. NTA.", "ESH. You are correct in saying this has gone too far.\n\nMy mother absolutely hated the name my sister picked for her last child. Yet, here we are years later and it's fine - everything is fine. It didn't matter at all, everyone loves the kid no matter what and his name suits him perfectly. Neville is a fine name, as is Rose.\n\nSeek marriage counselling before the children come because you two are clearly not communicating well and it won't get easier with two children in the mix.", "ESH.  Wow you are both so out of line and dramatic.  Seriously?   You hate the name so she skips town,  are you both 12?    You both have bigger problems in life if you can't compromise on a name.", "You guys are fucked up. Seriously consider marriage counselling.", "Info: what makes Neville so bad?", "Buddy, the names are not the problem", "YTA - you agreed", "It doesn't matter whether reddit thinks the name \"Neville\" is OK or not; the issue here is what to do now about the impasse. \n\nIt reminds me of the *Friends* episode where Phoebe changes her name to Princess Consuela Bananahammock. Mike counters that he's going to go by Crap Bag. When Phoebe learns that a banana hammock is a Speedo, she changes her mind. If only real life issues were as easily resolved as situation comedies' issues are. \n\nOP, what's the plan for Neville's middle name? If it's more acceptable to you, then there's your answer. If the boy gets teased a lot about his names--and I doubt he will--he can always go by John or Matthew or whatever his middle name is. \n\nI guarantee that the negative associations you have about the name Neville will disappear once you associate it with your beloved son. Don't let this squabbling become how you remember this pregnancy.", "ESH\n\nYour unborn son is absolutely going to get roasted if he's called Neville.\n\nBut calling your daughter a dumb name in retaliation is also asshole like.", "YTA.\n\nAnd you know it, that's why you left the name she picked out of the story, but you were honestly the AH before then.\n\n\n>I said fine, then I may as well name our daughter Hortensia Beerbong the Third. It sounds just as dumb. She told me I couldn't do that, and I just said why not? It's my choice. That was the agreement.\n\nThe  name she chose was Neville, that'san actual name. You're being dramatic and completely unreasonable.\n\n>Recently, she's started hinting she might just take off around her due date and give birth somewhere without me and my naming input.\n\nThat is her right, and who wouldn't want to get away from your stressful a$$. \n\n>I think that's uncalled for,\n\nYou're uncalled for. \n\n>I've told my brother to keep an eye on her while I'm gone, but it's not like he can watch her 24/7.\n\nThis and everything else proves how over baring you are.", "Uhhh...this entire situation is concerning...and it has absolutely *nothing* to do with a name...\n\nYou really think she's going to take off? You really want your brother to keep tabs on her? Holy crap this is toxic. \n\nPlease get couple's therapy. Please please please", "Give them 2 names, and you each get to have a pick?", "YTA. I hope that your kids don't inherent any of your assholeness. You need to grow up. Neville is not that bad of a name....gee I wonder why you didn't share it at first. You know you fucked up.", "ESH\n\nYou both need to agree on both names.", "Twins normally come a month or so before the due date. You’re very likely to miss the birth anyway if you go on that business trip. \n\n\n\n\n\n\n\nShe is awful for threatening to secret away and have/name them without you. You are awful for pushing her to that threat over a very normal choice in name. ESH", "ESH\n\nYou two have way bigger issues than the name - her planning to skip town, you asking your brother to spy.\n\nGROW THE HELL UP both of you, you're about to have children.", "Neville??? You compared it to being as bad as Hortensia Beerbong the third? Interesting logic…", "I don’t know OP, I’m going towards YTA because “I was just trying to help her see the mistake she was making, but she’s not listening to reason.” You sound like you’re trying to parent your wife. You both are going about this wrong but then asking your brother to watch her like she’s some child? You both need to have a sit down and talk this out like adults, together. Do not try and make her feel stupid or silly about a name. She actually gave a good reason as to why she wanted to name the kid. “I think her name choice is dumb and will cause problems for our son.” OP, it’s not dumb to name a child after a memorable character.", "I pity the kid being born into this relationship. ESH.", "ESH - you need some counselling, and a new approach to naming your children. I mean, what happens if she does take off and names the children what she wants to name them? Is divorce next? Do you take her to court to force her to change their names on their birth certificates? Like, what’s the endgame here? And you one upping her by saying you will just have your brother watch her? What?! Sounds like neither of you are very mature and again, try some counselling.", "Ummm we need to know the name my dude. \n\nHow can we possibly make a judgement¿?\n\nBut y’all have way more problems then naming children anyways.", "Have the baby without you around ? I think she’s  bluffing but what a child to even say this.  This whole thing is childish.  Don’t have more kids - this sounds like a lifetime of misery \n\nIdk who is the ahole here ,, possibly both.  And not for the name issue alone.", "I highly recommend the app Kinder. You guys can swipe on names you like or don’t like (like a dating app), add names you like, and then you’ll get a list of matches in the app. I would also suggest not making fun of any name in the app as you don’t know if your partner could’ve suggested it. You guys need to work together. \n\nInsulting each others choices is just going to lead to more hurt feelings. No judgment.", "NTA. When naming a kid I think it’s important to consider what’s in the best interest of the kid. You may have an emotional attachment to a name but if a kid could get made fun of for it then it’s not a good name. Kids are not extensions of us and our egos. They are individuals and need to be treated as such.", "Yta. There's nothing wrong with the name..stop being disrespectful and apologize. It sounds like you two have a lot of other issues.", "ESH - BOTH of you need to grow the fuck up before those babies come.", "ESH should’ve come up with the names together instead of giving one person full control", "NTA. Can you get a neutral third party to talk to her about how the name will likely affect your child's life?", "I think both of you are assholes. If she explained that the name has a sentimental meaning to her from her childhood and your reaction is to tell her it's a stupid name and your son is going to be bullied for it, I can understand why she is hurt. \n\nBut her giving birth without your knowledge means that whatever is going on in your marriage is larger than a name choice", "Hate to break it to you, but even if you're at the birth, it's her signature that's required for the name. She has to right it down. You have no real aay, regardless of any agreement.", "Chief your marriage is in shambles", "NTA. I have seen kids lives seriously affected by a mom who named a pet rather than a child. This shows a lack of respect for the child as a person. Stop it with the stupid names, names with an apostrophe, a dash, grossly misspelled thinking you're unique, etc. Just stop it! Your kids will have a rough childhood and find it hard to get jobs as hiring managers skip over the embarrassing names.", "Are you seriously comparing Neville to “Hortensia Beerbong the third”? ESH.", "The name is Neville, it’s not as ridiculous as you’re making out, however, it should be an agreed upon thing, both of you should be choosing, I think Nev is kinda cool personally.", ">I've told my brother to keep an eye on her while I'm gone, but it's not like he can watch her 24/7.\n\nyou understand he can't do anything even if he's there right?", "Neville? Fucking Neville is what your mad at? Not Barthelemy or some shit? Grow up dude or you're the one that's gonna get bullied", "It’s Atticus isn’t it?", "INFO: what's the name?\n\nYou both don't come off well in this story, but, who the real asshole is will genuinely turn on whether the name is \"Gaylord\" or \"Edward Cullen Jones\" or something, versus a name you don't like.\n\nEdit: Neville isn't worth this, YTA.", "Dumb names will indeed get him bullied. Your wife is not thinking right here but you made the decision to let her do this so ESH. She sounds extremely self-centered and rather immature. Get her a male dog and use her awful name on the dog! Just kidding🤭", "You have way bigger issues than a stupid name. Your wife is threatening to disappear until after the birth? Not raising any red flags about her mental health?\n\nNTA about not wanting a stupid name but ya'll need a serious intervention STAT.", "Wow what? Nta names are important but wtf you have some major issues if your wife is hinting at disappearing.. while pregnant.. with your babies.. just so she can what? Win the name game? \n\nDude. That's messed up", "ESH\n\nYou both need to sit and talk like adults\n\nIt sucks that she’s claiming she’ll take off for the birth, ultimate manipulation move there, total control move.\n\nBut Neville is not that bad a name. It’s old fashioned, and you can always be further old fashioned and call your son by his second name.\n\nMy father in law was Neville John. Everybody called him John. And most of his family were called by their middle name.\n\nI’ve heard way worse names. I don’t think the argument between you both is needed.", "I think you both need to agree on names", "I'm a HS teacher. For the love of God, do not let her name your kid something \"unique\" to show how quirky SHE is. They tend to hate their names, hate roll call day and almost always ask for a more common name for a nickname.\n\nThere's nothing \"fun\" about people mispronouncing your name or raising an eyebrow to it your entire life.", "ESH You are both immature and have more issues than a baby name if the threat is “I will leave when I give birth so I can name the kids.”\n\nLikely the name is dumb and you are being overly dramatic. Both of you grow up and agree on names for the kids together.", "Names should be a two yes, one no deal. Your first mistake was swapping off naming responsibilities. But you and your wife have major issues if she’s talking about disappearing.", "You'll rue the day you named him Neville", "I'm guessing Neville from HP?\n\nThe name is just fine. It's not like she wants to name him Dudley\n\nNta", "NTA. I’m sick of these stupid modern names that people just pull out of their butts because they sound cool. Start with what the name means, a human life deserves to be referred to by something that is meaningful. Your son deserves you to fight for a good name.", "you two both sound super insufferable ESH", "YTA there are way more problems than just naming your children here. \n\nMy partner and I also had this agreement about who names who if we had children- when we 18! We have since realised that is a fucking ridiculous deal to make and have gone on to have two sons who we named together.", "I know people who have named their sons Simon and Nigel, and I’m in the USA. So Neville doesn’t strike me as any more British, or wimpy, or odd etc…than those names, and as far as I know neither kid has been relentlessly targeted by bullies.", "Good luck op, I hope\nYou both get a name you like. If my name was Neville I’d jump in an eel tank", "YTA\n\nYou had an agreement, and she's sticking to the agreement. Trying to hold your daughter's name hostage is petty and childish. She gets to name the kid whatever she wants, and worrying about them getting bullied is perhaps overblown. Who knows what the world of 2033 is going to look like?\n\nYou agreed twice that she gets to pick the name, so she gets to pick the name. You shouldn't try to retaliate against your own child out of some misguided sense of spite.\n\nIf she honestly wanted to just name all the children she bears on her own, that would probably be fair too, but she's sticking to the agreement that you made together stop being an asshole and just let her follow the original plan you two made together.", "So she is threatening to abandon you for good? Or just to give birth? You 2 have some major issues besides name if either of those 2 are the case. See a therapist, or get a divorce. ESH.", "NTA\n\nBoth of you should get veto power over the names.", "The name Neville is a perfectly normal name and you agreed to the deal. Veto power was never a part of it. And the fact she feels like she has to give birth in secret to avoid you doing something against her will (and if only a name) is worrying. Yta", "ESH. You need to act as a team. Decide together. But wtf OP, Neville is a fine name lmao. Grow up.", "The names NEVILLE 😭", "YTA. Neville is a perfectly normal, though dated, name. It will absolutely not get your son bullied. Rose is also a dated name so you aren’t any better with your choice. You made it seem like it would be outlandish. Neville is a common name, not a made up one. No one will think twice about the name, aside from it being a formal name. Same with Rose, people will just think you like boring names and that’s okay.", "YTA - It could be lot worse. Read the Harry Potter series and you’ll realize that you can call yourself lucky.", "Heaven help the pair of you when the twins arrive if this is how you handle a disagreement in your relationship. I highly recommend you learn conflict resolution skills and work on improving communication.\n\nRegardless of the name, you made an agreement and now want to go back on your word... This will not help your partner feel safe in the relationship if she can't trust you to honour agreements and keep your word. \n\nUltimatums are not healthy .\nYour wife is growing twins and is under an enormous amount of pressure.\n\nSit down and have an adult conversation, communicate and compromise whilst you still have a relationship", "Your issues are way bigger than names.\n\nIf you are legitimately concerned that your wife will flee for a month + just to keep you from being at the birth because either you or her will sabotage the others naming is actually insane.\n\nYour naming rule is stupid to begin with. You guys should name your children together, which names you agree on together. If you can’t do that, again, you have bigger issues.\n\nESH", "ESH Neville is nowhere nearly as bad as the name you made up. It’s a real name. I have a friend who named her son Severus and the kid doesn’t get made fun of for his name. \n\nYour wife shouldn’t threaten to make you miss the kids birth over this and you really shouldn’t threaten to have your brother basically stalk her.", "Neville is a silly name but not THAT outrageous.\n\nESH. You guys need therapy.", "ESH\n\nThere’s gotta be something else going on if your wife is willing to take off and give birth without telling you. That’s a major escalation, and it’s making me wonder if there are other problems in the marriage. \n\nYou’re both being childish. It should be two yes and one no for baby names, not either of you unilaterally deciding on a name based on the gender of your children.", "This was a stupid agreement in the first place. You are stuck. People these days name their kids all sorts of things. I think you should apologize, be supportive, be a man of your word, and enjoy the birth of your children. Let it be the name she chose and your son can always go by a nickname if he wants.", "LONG LIVE Hortensia Beerbong, FIRST OF HER NAME", "Dude. Your marriage has way bigger issues than your son possibly getting bullied.\n\nYour wife is threatening to DISAPPEAR close to her due date?? That's psychotic. \n\nYou want your FAMILY TO WATCH YOUR WIFE to prevent her from DISAPPEARING?! That's psycho with some psycho drizzled on top.\n\nYour relationship sounds horribly toxic, dunno if couples therapy will work. Name the kids together, not separately. Agree on names for your babies together, the way it really should be done.\n\nTbh if I was you in this situation I'd be searching for divorce lawyers that specialize in child custody issues cause it certainly looks like that's where you two are heading.\n\nThis is waaaaay above reddit's pay grade. ESH", "You mean Neville? Like the unsung hero of Harry Potter? That grew up to be hotter than any other major male character?\nFFS, let it go.", "You both sound ridiculous. What a dumb agreement. ESH", "ESH. You have way more problems than naming your kids. Get into couples therapy now so your kids don't end up pulled between a divorced couple that hates each other.  \nThis is going to end badly when you are having your brother spy on your wife. What is he supposed to do? Catch her leaving town and kidnap her and keep her in his basement while she gives birth?\n\nLearn to compromise, you hate the first name she has chosen? Fine, make an agreement that one parent chooses the first name the other the middle. Call him by both names or the middle name or hell a nickname.", "There were 618 Neville’s recorded as first names over here in the UK in the past 12 months. The first rise in over 10 yrs. It’s not exactly the weirdest name out there! Trust me if your son is gonna get bullied the name is not relevant! Yes it can be an added bonus for bullies but not always the cause. Bullies will twist the most boring name into a bully! Don’t ask me how I know 🙄 I know a couple of Nevilles, never once thought anything weird about the name! \n\nThe name actually means New Village - little fact for pub quizzes for ya to not give a crap about! It originated in France & came over to England during the Norman conquest so no exactly a new name!\n\nHowever you don’t like it fair enough! Why can’t he have it as a second name? Or even as a third? If your wife is so set on it & you’re so against it it may be a compromise 🤷🏻‍♀️\n\nSeriously though if it’s got the stage where your wife is threatening to leave & you’ve got your brother to spy on her there’s more than naming a baby wrong with your marriage!", "YTA. Dude, Neville is a common English language name. I work with two, one in his 20's and one in his 40's. It is in no way remotely comparable to your made up name, \n\nThe whole \"she's hinting she'll disappear for the birth\" and \"told my brother to keep an eye on her\" thing sounds like you both have much bigger issues to deal with than baby names.", "ESH you’re both acting like children. Names should be two yeses or one no.", "Dying laughing at parents who do this. They think they are getting the better deal, until the other one gets to pick. \n\nMy father was CERTAIN I was a boy and agreed he could pick out the boys name and my mom could pick the girls names. He never even told her how much he despised the girl names she chose...until I was born and was not a boy. \n\nI ended up getting named after the little boy next to me in the hospital nursery (think something like Justin = Justina) bc my father realized he was wrong in making that agreement to begin with. They both chose my name together, in the hospital.\n\nBaby names should follow the 2 Yes/1 No policy. YTA.", "YTA You agreed to let her pick the name with no mention of vetoes. Drop it.", "The only thing wrong with Neville in Harry Potter was his last name “Longbottom” which was a bit unfortunate.  He grew up to be brave and stand up against the villain (HWMNBN) when all appeared lost.  All in all, not the worst hero to be named after.\n\nDo marriage better. ESH.", "YTA. A lot of people saying everyone sucks here but I disagree and I’ll explain why \n\nYou are not the asshole for disliking a name. Totally your right. But your attitude and behavior is causing your wife to want to DISAPPEAR?? And your response to that is to have your brother stalk her 24/7?? Wtf did I just read? The fact you would have her stalked when you’re out of town is probably why she wants to disappear, she knows you’re controlling and possibly abusive (???). Please get some therapy.", "When you put a stupid name on a kid, you have to remember that one day makennaleigh or whatever is going to have to fill out job applications\n\nincidentally is the name Renesmee? there's already a million of those and you're signing a kid up for bullying. I will always side with the parent advocating for traditional or at least correctly spelled names.", "I am currently pregnant and it will definitely have to be a yes both from me and my husband with our child’s name. I’ve liked a few names and he didn’t so we didn’t pick it and same goes for him he liked a few I was against it so now we are going to continue searching till we both love a name. He always tells me since I am the one giving birth I have more rights and if I really insist he ll be okay with any name but I want both of us to love it. I’d say change your dumb agreements to both of you saying yes.", "Poor kids divorced parents at 3 is rough.", "Hopefully her threatening to go MIA is just hormonal borderline temporary insanity that some women go through near the end of their pregnancies and with twins it’s probably even more pronounced. If you actually believe she’ll do it,then you and she have some very serious issues (and perhaps therapy is in order for her before and post-partum) you need to work out before the babies arrive because shit is going to get much more complicated once they’re here and you and she are being super toxic to eachother. Leave the name thing alone for now;she may change her mind completely once she meets the baby if the name doesn’t seem to fit.", "The name is Neville? You are throwing ultimatums because of that. ESH... you both have terrible communication skills and are being petty. Those poor kids. Y'all going to be a coparenting nightmare", "ESH - The whole plan of we each get to name one is stupid. Then you're a bit over dramatic about how bad the name is (I'd be more concerned about the transphobe angle personally). But your wife acting like she'll take off to hide her birth is wild. \n\nI feel bad for the kids that'll be rolling out into this shitshow soon.", "I just want to point out if Harry Potter names are off the table then Rose is also a no go because of Ron and Hermione's kid Rose Weasley. YTA.", "> Apparently it comes from a character she identified with in one of her favorite books when she was growing up.\n\nNTA.  Kids aren't toys or pets.  I'll repeat nice and loud for her: KIDS ARE NOT TOYS OR PETS.  You do not use the naming conventions you use for toys and pets.  This means no silly names from kids' books.", "If she wants to disappear like that good luck raising twins alone and finding someone that wants to “step up” to help her. \nShe needs to understand that those threats are crazy and an absolute deal breaker. \nThat’s a way bigger issue than the names. \n\n\nDid your wife have a childhood bully? Pick that name. Better than Hortencia.", "Don't make promises you can't keep. You both should've thought that before you made this promises, you both knew the other one could've picked a name you hate. \n\nI feel so bad for these kids, their parents have major issues they should've fixed before getting pregnant. \n\nYou guys need to have a serious sit down and talk, stop going against each other and work together, or the shitty marriage you guys have will affect them way worse than any names you can give them.", "What the actual fuck is wrong with y'all?  Y'all need to have a come to jesus, perhaps with a counselor.  Naming agreements like that are awful.  Communication is good.  And trying to skip town to name a child is just, marriage ending.  Jesus I feel badly for your twins.    \n\n\nI have twins.  My husband and I discussed names.  We each had some ideas about this that and the other.  We looked up names.  We discussed them.  We came to agreement.  And we also allowed for the children, when born, to change our mind based on personalities.  We didn't need to change, but we were open to it.  A name is a gift.  But don't get too attached to it as you give it away.  It's not about you or your wife or even any ancestors.  It's about the new life created.  See if y'all can remember that and remember what marriage is while you're at it.", "YTA.\n\nYou made a stupid deal with your wife so that you would have total control of naming the son you want. Now, because she has chosen a name you don't like, you want to go back on the agreement. You've taken this to the level of threatening to name a kid something stupid out of spite, and having your brother \"keep an eye\" on a grown ass adult. This has spiraled to your wife threatening to disappear. OVER A BABY NAME.\n\nGet couples counseling. Y'all need it.", "Your kids can always just change their own names to something they like when they get older.", "The name is Neville. It's a classic, normal name. OP is making up reasons to be mad about it.", "so ESH is your verdict?", "I thought this was a totally normal married couple argument until he SO casually brought up her potentially disappearing and GIVING BIRTH ALONE out of spite? And his response is to have his brother basically try and stalk her to make sure she doesn’t? This couple has some serious issues, and it sounds like this kind of behavior is very normalized. To the point where OP didn’t even think that part of the story was a big deal. \n\n\nPLEASE get into couples therapy or some kind of marriage counseling, and quickly before your two children come and things get even more intense and it’s too late and hectic to change this behavior. It might seem normal to you, but the behavior you two have is not normal at all and will undoubtedly traumatize your children in the future. I know from personal experience. I’m not trying to condemn you or your wife, but you both need to change this dynamic ASAP, or your kids will have way bigger problems then a silly name.", "Yep, she’s choosing to go nuclear to me and I’d be contacting a divorce lawyer just in case.  You don’t get to threaten this without consequences.", "Agreed with all this, especially the last paragraph. This naming agreement was a terrible idea in the first place.", "Yeah. We had a similar arrangement as OP, but with some additional steps. The one not choosing the first name picked the middle name and we both had to agree to the names. Knowing that we may not agree on first picks, we each came up with lists and paired up names until we got a set we loved.", "[deleted]", "Not gonna lie it would bother me to learn only one parent named me. Like the other one didn't even care to have input? Was I not wanted by one? It would open up some issues of feeling loved by both parents.", "Yah, who the hell makes this type of an agreement!? So dumb!", "\\+1 vote for Megatron", "Except if they were in that fandom the name would be Megjacward.", "Really worried about the children's quality of life if their parents are fighting like this pre-birth :/", "It's just Neville? That's anti climatic", "People have been named neville for centuries\n\nShould tom be banned now too?", "I think that's what I'm getting from the post too. They aren't acting like a team.\n\nAnd trust me, the team and partner aspect needs to be **strong** when having twins (or one kid for that matter). They're being really childish.", "Neville was characterised as a joke by the bad guys. He was kind, and courageous, and he stood against the bad guys even though he knew what they'd done to his parents and was terrified, he was brilliant at herbology, he defied Voldy to his face, and he killed a horcrux.", "Neville? That's a perfectly appropriate name. In that case YTA.", "\n\n>Neville\" is a pretty bad name from a character named and characterized as a bit of a joke.\n\nNeville is absolutely not named or characterized as a joke.", "Maybe she was gonna use Longbottom as a middle name. Lol.", "Has no one watched icarly? \n\nYes Nevel is different spelling pronounced the same. Probably one of the most punchable characters in TV history. And before someone says, that show died out with the last generation, IT GOT REBOOTED 💀", "Also, Hortencia is a normal name.", "Neville and Rose.", "my husband and i have a similar agreement. i had my girl names picked out before we even met... but told him that the boy names would be up to him. \n\nwhen i told him the girl names he liked them (however we did tweak one of the names because he didn't like how it sounded). now i'm pregnant with twin boys. we are working together to name our boys. i know one first name that he will not budge on because it is important to him. it's not my favorite name but it means a lot to him.\n\nthat's the difference though. my husband and i are working together to figure out names for both our boys that both of us would be happy with. whereas these two are deadset that they don't even need to discuss it.", "A kid from my grade was literally named “leaf” and we had another kid whose name was “bush” and they were friends. They were the only people I could call Leafy Bush and get a serious reply from.", "First thing I thought is \"pleeaaaase don't be named after the sequence Tayne in that Paul Rudd Celery Man skit.\"", "It's Neville apparently.", "The name is Neville. So, close!", "You don’t need to know the name. The bottom line is, he doesn’t want it. He should never have agreed to it. This is the kind agreement I’m totally OK with someone reneging on. She did not have the kid based on this agreement.", ">Vlademeer (yeah, spelled that way).\n\nHey russian war criminal!", "Listen to your father Albus Severus and Ebony Dark'ness Dementia Raven Way.", "The Name is Neville", "> If you were smart you would have included veto rights, or something of the like. But you didn’t. Your kid may or may not be bullied, and name is just one of many possible reasons.\n\nWhen you write something like this, you should step back and consider that \"the deal is sacred above all else, even the kid getting bullied\" means it's not the best moral framework.", "Neville, apparently.", "By the way, congratulations on the twins! This is one of many disagreements over parenting you’ll have but it is also amazing and life affirming to have children.", "Agreeing to the deal in the first place was dumb on both of their parts and how both of them are following up on it is pretty terrible, but I don't actually think \"this decision is so bad it violates the spirit of the deal and I'd like to veto it\" is wrong in itself. If they  had just made a deal and he realized it was a bad idea and attempted to veto, I don't think he'd be an asshole for realizing *why* naming is a 2 yes 1 no situation.", "I think him comparing Hotensia Beerbong to Neville is HILARIOUS! Like, sir. Calm down cuz it's not even close, lol.", "The names are Neville and Rose. Totally normal names.", "Your comment has been removed because it does not address the OP in good faith.\n\nIf you suspect a post breaks one of our rules, please report it instead of commenting. **Do not feed trolls**\n\nContinuing to post comments like this will lead to a ban.\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Digging in will absolutely ruin this once in a lifetime experience for both of you. Snap out of this and gain some perspective on what’s really important here.", "While I agree in general that Neville is a fine normal name, the 2 yes or it's a no rule still applies.\n\nFrankly agreeing to the you name girls/boys was stupid AF.\n\n There are so many names, if you can't agree on a short list of names before you get to that point you should maybe rethink having kids in the first place.", "Wait? THATS the name he's worried about?\n\nFuck me I'm assuming after neville longbottom.\n\nThere's probably thousands of nevilles named yearly after him.\n\nOps majorly YTA", "Yeah but quite a few kids will probably link it to Harry Potter and make fun of him for it, it isn't a name you hear often nowadays so it will definitely stick out for the wrong reasons.", "In fairness I went to highschool with a Neville in Canada and his name was made fun of", "Neville Beerbongtom, surely?", "The inclusion of the \"beerbong\" in the facetious girl name makes me wonder if she wants to make his middle name Longbottom. Like, I'm sorry, but if even one teacher reads that out on the first day of school that child will never hear the end of it.", "It's absolutely not a classic or normal name. It's a deeply old fashioned name in most English speaking countries, and heavily associated with the hapless character in Harry Potter specifically because it's so old fashioned and rare otherwise. \n\nEven when that was written 30+ years ago, it felt silly to see a child named Neville, that's why he's called Neville. It's a joke name. Like naming a hapless, frumpy girl Ermentrude.", "Will 100% be called Navel.", "Neville in the Harry Potter books is a badass!! He stood up to his friends to do the right thing. He over came lifelong trauma (of seeing his tortured parents loose their minds), and pulled the sword of Gryffindor from the sorting hat in the battle for Hogwarts to slay Nagini (the last horcrux) and help Harry beat Voldemort. He was a true friend to Harry and by the end of the series had grown to be a man his parents and grandmother would be proud of. You can also use Val as a nickname.", "Ah, well that answers all the questions doesn’t it. I kinda like the name but let’s be real for a moment. The two examples people the boy encounters will have to go off of:\n\n1. Longbottom—lovely character absolutely. But mostly known for being bullied. Not entirely fair, but that’s the reality.\n\n2. Chamberlain—the PM who is (unfairly) tarred with permitting Hitler’s rise to power. \n\nI’m not saying it should be a hard no but…she is likely setting the kid up for some pitfalls.", "Yes but think of what it rhymes with \"Neville the Devil\" Likely will be a hit in the schoolyard", "That is such an ugly name.", "Where I’m from Neville would stand out in a bad way.  He will spend his entire life being nick named Neville longbottom…", "Neville is more a last name than a first name. Like smith", "Nothing wrong with Neville, other than it makes me think Neville Chamberlain :/ Or Phil and Gary Neville. But anyway name fashions change like the wind, kids have classic names and bizarre made up names these days, I wouldn't worry about potential bullying.", "where do you live? I've never heard that name in my life except for the HP character.", "i like the Name Neville. hes being unrealistic here.", "Lol no, that's an antiquated nerd name. OP is accurately predicting the effect it'll have on his son.", "Okay so it's basically a name from the Harry Potter books. The generation that grew up with HP is mine, we are all in our 30s and those popping out kids WILL be naming their kids Harry, Hermione, Neville, etc. \nAt least she's not naming the kid Severus or Dumbledore.", "He's both making a big fuss over a perfectly normal name, and he's going back on his word, after having agreed to this naming process twice, and he's trying to hold his daughter's name hostage and escalate things against his wife and ways that are patently unhealthy.\n\nOP is 100% the asshole here.\n\nThe name is just Neville? I was assuming it was something like light yagami or Voldemort or something.\n\nGood Lord op is the asshole\n\nYTA I say to him", "Named after the guy in Harry Potter whose whole bit is he’s considered an inept loser for most of the books. It’s great the wife liked the character but post Harry Potter kids would bully him in a perpetual hell.", "Seems more a 'The iranian yogurt is not the problem' verdict haha!", "For sure! If it's seriously on the table that your wife might *skip town to give birth* then yes it has absolutely fucking gone too far.", ">Couldn’t imagine either of us absolutely hating something and not budging to find something we both agree on.\n\nSounds like you have your own one no two yeses policy then.", "I think having one parent taking the lead when it comes to naming is very different from giving one parent sole and final say.", "We did it a little differently. I wanted our first to have the family middle name. So, he chose the first name. With our second, I chose the first name, he chose the middle name. With our last, he pretty much chose the whole name, but his brother had recently passed away and we gave the last one his brother’s name as a middle name. He chose the first name. If we had a 4th, I’d choose the whole name, but husband got fixed so we are done. With all the kids, we could veto a name.", "This is dramatic. My parents took turn naming my siblings and I and I literally never had those questions in my life.", "I love Meg", "I know someone who has a cat called Megatron Joan.", "And Neville was a character with very good qualities.", "Just Neville? It’s a common if dated British name. Famously there are footballers here (soccer players) called Phil and Gary Neville. They and their sister Tracey have all played and coached football and netball at international level.\n\nTheir dad is a former professional cricketer called Neville Neville. \n\nSo in the UK that’s more what the name is associated with and why we would say ‘oh just Neville? Not the double?’\n\nNo one has made this much fuss about the name Neville since the British Prime Minister appeased Hitler in 1938.", "IKR. I was thinking Ponyboy.", "I thought it was gonna be Hitler or something", "Neville Chamberlain, prime minister of the UK. He’s arguably more famous than the HP character. At least among middle aged and older folks.", "Neville Longbottom", "Yes, you're correct... for the later books. In the early books, he was characterized as a pretty archetypal loser, being forgetful, cowardly, incompetent, and easily pushed around, and that characterization is what informed how he was named, the same way *everybody's* characterization informs how they're named in those books.", "Nah, Neville is trash tbh.", "Agree to disagree, but he was the butt of the joke for like the first 4-5 books and his naming was based on that initial characterization. \"Longbottom\" was absolutely a name to make sure he was taken non-seriously.", "If she’s having twin boys and doesn’t name them Fred and George I’m disappointed lol! I’m assuming she’s naming him for the HP Neville because she said it was after a book character.. twin boys? Fred and George? James and Sirius? It’s not like she picked Albus and Aberforth.. lol", "Hello fellow potterhead", "Rose is also a Harry Potter name by the way.", "wait the name was Neville? I thought it was going to be outlandish. That's an actual name...", "Neville is not a bad name. It's a real and classic name, it's not like she's naming the kid fucking Albus Severus or Roonil Wazlib something. Ask if you can pick each other's kids' middle names or somethihg. YTA.", "Ok, now that we know the name, ESH. Your wife is correct. You are being *completely* overdramatic. The name in your post you used as a comparison is dumb and absurd. \n\nNeville is actually really cool.\n\nP.S. In the future, your agreements shouldn't be so broad. Basically you said you can name a boy but never said what would happen if you hated the name. More like, you pick your top 3 and I have to agree to one of them. Something like that. But hinting she'll leave to give birth is not okay either.", "Wait, so Neville is a problem name? Since when?", "Brah. I thought it was going to be like Rhidiyer Asghijlyn or something", "That’s it? That’s the name? I was friends with a kid named Neville in high school. Totally cool dude, too. Everybody loved the kid and he got along well with everyone. Yea, it brings to mind Harry Potter, but so what? You say Rose and I’m thinking a little old lady from Golden Girls (great show btw) or the girlfriend from Titanic. Kind of an old timey name. I say it’s best to bite the bullet on this one and let your wife have her name. Give him a nickname and call him by that if you really don’t like it, but don’t be the AH and have your brother keep an eye on her. That’s controlling behavior and completely uncalled for.", "You’re overreacting.", "Thank you. Based on your reply, I'm going with YTA.\n\nIn my opinion, I really like both of those. Neville is a lovely name for a boy and I wouldn't have thought it would lead to bullying. \n\nThere are MUCH worse names out there and I feel like Neville is on the more normal side of baby names. I mean, you never know, once they're born they might not look like a Neville or a Rose and a name more fitting might crop up.\n\nMy advice would be to keep an open mind about this, and in future (if you decide on having more children) don't make these deals.\n\nHonestly, best of luck to the both of you and HUGE congratulations.", "I actually really like that pairing, and I’m not a HP fan. They sound really classy together—traditional, but a little unusual, but not pretentious. It’s a nice pair of names.\n\nNow, “Jack and Rose” would be embarrassing.\n\nThe few people who know anything about names would think the kid might be named for a British grandpa or something.\n\nYou two sound ridiculous though. All this nonsense about her running off and you trying to have her watched is alarming. The two of you seem hellbent on manufacturing a crisis.", "You sound like a Muggle.", "[Neville Staple is cool as hell!](https://en.m.wikipedia.org/wiki/Neville_Staple)", "Wait, so you want to name your kid Rose - a name that will also have kids mock the piss out of her for being an “old lady name” but you take issue with Neville? \n\nLmao, you sound controlling as hell. Neville is a normal name even if she’s doing it because of a fandom. No wonder why she wants to take off and have the babies without you. Which by the way, she can do regardless of whether or not you have someone “watching” her (huge red fucking flag for an abusive controlling partner to have someone “watch” her while you’re away). All she has to do is tell hospital staff she doesn’t want you in the room and you’re removed, contributing 2 minutes to creating the child does not entitle you to being in the room during delivery. \n\nHonestly she’s not great for not hearing out your feelings, but your controlling behavior to the point of having people watch your wife to prevent her from going anywhere without you makes YTA big time and I worry for her safety.", "There is nothing wrong with Neville”. Or at least, nothing that couldn’t also be applied to “Rose”.", "Neville is a lovely name. You are willing to endanger your marriage over Neville. I was thinking it was something horrible like Oak or Harbor", "If you have such an issue, why don’t you try to compromise for a middle name?", "Idk if you’re entirely wrong here, but someone named Neville definitely will have more issues with their name than someone with a conventional name. Especially if people know it’s a HP reference it might be weird, but overall Neville isn’t too weird.", "Neville is a perfectly normal name, how would that get your kid bullied? \n\nYou’re being the bigger AH here and it sounds like your wife only went for a ridiculously over dramatic escalation because you started a trend of being ridiculously over dramatic in the first place (justified annoyance coupled with pregnancy hormones is a powerful force!) \n\nOverall, I’d say ESH with the caveat that you’re carrying most of the blame.", "My brother is called Neville, a perfectly normal and respectable name. He's never been bullied because of it and he's been around a pretty long time. You're an asshole.", "Because the people who use this sub are extremely online, they're going to side with your wife because its a Harry Potter reference. Not one of those people would agree to change their own name to Neville. They see your kid's identity as a funny opportunity to pay tribute to a TERF's YA fantasy.", "YTA … that’s a perfectly normal name and Rose is from Harry Potter as well so get over yourself", "Wait okay so you're throwing a fit about her naming the kid Neville because of the Harry Potter association and you're naming your daughter after Hermione's kid?\n\nIs this some sort of weird Harry Potter foreplay for you?", "And Rose was the main character in Titanic and a famous Character in doctor who so why exactly is your choice not stupid?", "The way you were talking about it, i expected it to be Schmipplepants or something, not Neville", "Those names are really nice together!", ">my husband and i are working together \n\nExactly right.  Like partners and parents should.  OP and partner need to work this out  before it's too late.  You don't want a Colossal Khaleesi mistake.", "Leif is actually a very old Scandinavian name, I went to high school with one!", ">Paul Rudd Celery Man skit\n\nI just googled and that came out in 2010.  The kid would have been 9 or 10 by then.  Your spelling is probably right, though.", "I know, crazy i just throw out harry potter because its a book but still a normal name", "How do you pronounce that? Nah vill? Knee vill? Navel?", "Wtf reneging on an agreement cause you dont like their choice?\n\nHusband chooses girls name.  Wife chooses boys name.  Agreement set\n\nOh your choice is not approved by me so its not allowed\n\nIs she allowed to veto his choices for the daughter or is he the only allowed decision maker", "I snort laughed at this! 😂", "I dunno if we can take OP at his word the kid will get bullied for the name. Kids will always make something of a name when they want to bully, even if it's just so-and-so the alliterative insult (\"oh look it's Adam the asshole hahahhaha\" doesn't make Adam a problem name. \"Oh its Ass-am. Geddit? Ass and Adam combined. Lol!\"). And kids both today aren't going to he in classrooms full of Jessicas and Aarons like their parents were, but Jesycas and Aryxns and Danyryses. Bad examples but you get my point. They're going to be one modern name amongst many.\n\nEdit: OP says the name is Neville, he needs to chill.", "I’m assuming that since he didn’t include it, it’s not that bad of a name. Something like Darcy (Pride & Prejudice) or Rhett (Gone with the Wind). Certainly not an advocate of bullying or putting your child in a situation likely to cause it.\n\nI know a lot of kids - classmates and teammates of my kids - with unusual names from many origins and cultures, and my point is that an unusual name doesn’t prompt bullying unless it’s over the top. The people who name their kids Chlamydia and the like are horrible.", "He could go with the nickname “Nev”\n\nSounds like a cool-kid name. Nev.", "‘Old man/woman’ names are making a huge comeback right now. Neville will be in school with kids named Arthur, Bernard, Vincent, etc. It won’t stick out at all.", "The first Harry Potter book was published almost 30 years ago. Apparently it's not so famous nowadays and a lot of kids don't know the character. Flabbergasting, right?", "thats a stupid reason to not name a kid though. if the kid is going to be made fun of, he's going to be made fun of. Neville is a perfectly normal name, and just because its in Harry Potter doesnt mean she shouldnt name her kid a perfectly normal name. \n\nYou could name him William and kids will make fun of him and call him willy . \n\nYou can't name him Harry or Ronald either? Can't name him Cedric. Can't Name him Dean (both Harry potter and a Supernatural Reference).", "There's one bit of a stand up routine I didn't laugh at and can't remember the comedian, but I think of often. He says how kids are so creative and mean they can make up rhymes and teases about any name. He then takes audience members names to give examples and says things like, \"Your shoes are ugly\" or, \"I can see you breathing.\"\n\nIf kids are going to bully it doesn't matter what your child's name is. If they're just playing around, ffs your kid should have the mental health to learn their name was once used by an author for a character in a book!\n\nETA: Harry Potter isn't the phenomenon with today's youth it was 20 years ago. The books OR the movies.", ">think her name choice is dumb and will cause problems for our son, and she thinks I'm being controlling and overdramatic. Neither of us are willing to back down, but with her hints about skipping town for the birth I've been wondering if things have gone too far.\n\nHonestly my name is Victoria and growing up kids manage to find dozens of ways to make fun of it. Is not even a weird name in my country/city. If kids dislike you for some reason, they'll find millions of way to mock you.", "But how many kids are going to be thinking all that much about Harry Potter in 5-10 years? It's not like being named Neville in 1998. My siblings were born in 1998 and 2000 and half their friends never read them or saw the movies, or maybe did once, and interest in them has really only decreased. It's not like naming a kid Severus. And older names are coming back into fashion. Neville is fine. If kids want to make fun of someone's name, they'll find a way to do it even if it's, like, Katie Elizabeth Smith.", "Lol... I'm so old I just thought of Neville Chamberlain", "that can be done with any name though.", "Upvote for the iranier yoghurt reference, it's been a while since I've seen it", "That reference is familiar", "Well it hasn’t come to that. So no not really.", "My family made a big deal about how my name was something that my parents and my brothers all sat down and decided one night. If my Dad had been like \"Ya'll got this, Imma watch some TV\", then yeah It would have hurt to find out.", "The hero at the end of the fight.  There were 2 boys that the prophesy could apply to. Neville was the other one. And look how he grew up!", "That last sentence alone deserves a thousand upvotes.", "Oh good call, I figured Holden.", "A guy who kowtowed to H*****", "Oof, not for good reasons...", "But shes not naming the kid neville longbottom (last name)\n\nJust neville (last name)", "Unless longbottom is the middle name, the first name might be stuffy and associated with fandom in the US, but it’s a common British name.", "Longbottom is a normal English last name.\n\nThe character is a joke. The names are normal. at least for most of the white characters.", "Longbottom is a very common, very old Yorkshire name. I was at school with several Longbottoms, a couple of Rowbothams and a Shorthose. The name Neville Longbottom is slightly old-fashioned but it's a good solid Northern name.", "username checking in here :)", "That was my first thought! Lol Ron and Hermione named their daughter Rose. \n\nI like Neville and Rose together.", "I vote wife changes it to Hagrid", "Isn't Rose the selfish girl on Titanic throwing away diamonds and letting Jack freeze to death?\n\nWhile Neville is the mighty wizard that slay the evil snake, making the dark lord perish?", "Rose won't be bullied, it's becoming more and more popular now. Rose is classic and timeless.\n\nNeville on the other hand, I dislike.", "Rose is also what Hermione's kid is named.\n\nLiterally OP is throwing a fit and doing the same thing.", "I’m never interacted with the HP books/movies…to me, I know a few (3) Nevilles, it’s a pretty regular name to me. It’s not always about whatever internet bullshit is happening. JK Rowling didn’t invent the name.", "Pretend the kid is named after Gary Neville, issue solved. There is like 200 people on the list of people named Neville on Wikipedia.", "Naah. Neville is just a name.  It's not my idea of the best name ever, but it's a regular ass name nothing crazy. \n\nOP is TAH because he's flipping his shit over an uncommon but not outlandish name. If she wanted to call the kid Albus Severus that's pure HP and strange enough to object strongly to. But Neville? Naah.", "No, his name was Leaf. Maybe the spelling is interchangeable but the way he spelled it was Leaf.", "When you make poor choices IRL do you always double down on them?", "That is correct. Because it was a stupid agreement in the first place. Both parents need to agree on the names.", "I used to know a Nev.", "Sounds like a theatre kid name", "I’m a teacher and none of my middle schoolers last year knew Harry Potter. 🤷🏼‍♀️\n\nFor those of you who don’t believe me (not sure what motivation would drive someone to lie about this): I teach in a high-poverty area that is mostly POC (my district is less than 4% white). It’s just not popular among my students, they’re not familiar with the stories or characters, they haven’t seen the movies, and haven’t read the books 🤷🏼‍♀️", "Have kids and Harry Potter is huge in their school.", "Harry Potter is very much still a popular topic. It just recently got a game that everyone I know was either talking about or actually playing. There are a lot of people who go to Universal solely for Diagon Alley. So to say its not famous anymore is a massive overstatement.", "Neville is not even CLOSELY used as Harry or William is, so the comparison doesn't apply. I've never met a person called Neville in my life. Plenty of Harry and William's though.", "Woah. He will deff get bullied for that bad name", "That's about the only other famous Neville I could name, and probably shows exactly when it was most popular! He was born 1869.", "this is the second mention of it in as many days that ive seen!", "if you're not gotten a no from him then its basically two yeses isn't it?", "Like. Forget the first couple of books you should 100% name your kid something that indicates he will eventually be an army leading, special sword wielding, glow up hottie who judges people based on who they are and wins the house cup for doing the right thing.", "Or a guy who didn't make a fuss to turn eyes to us then went home and started preparing for war. Public coward private hero.", "In a History test in high school one of the questions was \"which country was at fault for WW2?\" I said Britain, and expanded that it was Neville Chamberlains policy of appeasement that allowed Shitler to gain power and momentum. \n\nI was marked incorrect., I argued so hard and so long that eventually the teacher just said..\"Fine, you're right, but don't use it as an exam answer\"", "Yes I know", "No, it really isnt in the last century.", "The names are normal... but serve to characterize them. Harry Potter is a common everyday kid. The Weasleys are lower class. Hermione Granger, the most bookish character, has the most bookish name. Draco Malfoy is a villain. Crabbe and Goyle are dumb muscle. Neville Longbottom was absolutely named in part to signal that he's a loser.", "It being common doesn't make it less goofy.", "> The name Neville Longbottom is slightly old-fashioned but it's a good solid Northern name.\n\nIt being an old-fashioned name even for a kid in the late 90s is *why* it's used to characterize him as a bit of a loser in the early books, though. Literally everything in the books, from the spells to the houses to the characters, use their names to signal their purpose; I did not think it would be so contentious to suggest the character written to be a loser (in the first few books) would follow that pattern.", "Two things can be true. It being a common name doesn't remove the intention behind picking it.", "Tbf thats a last name. His first name was Rubeus", "Those are the characters, yup", "Rose is also Hermione's daughter's name.\n\nHe's mad that his wife is naming a kid after a Harry Potter character while he's naming a kid after a Harry Potter character.\n\nEspecially since \"Neville\" and \"Rose\" together makes the association much stronger.", "Rose will most definitely be bullied for her name if a bully wants to bully her. Hell, I was named Crystal when it was in the top 10 baby names list and had 4 other Crystals in my class and I was still bullied for my name.\n\nPersonally I wouldn’t do Neville either, but it doesn’t make it any less of a real and legitimate name. His reaction is still absolute insanity considering he’s set his brother on her like a captor guarding his prey while he’s away because she may leave him.", "Are you in the US? There's no one named Neville here. The only point of reference kids will have is a milquetoast character from Harry Potter. Weird to ignore when we're trying to avoid a kid getting bullied.", "I hope your parents weren't this nonchalant with your name.", "Like... I sort of find that hard to believe? It's still a major media sensation, there are still movies, AAA video games, mobile games, theme parks, etc. It's still a common Halloween costume I see every year. \n\nIt's like not knowing who Mickey Mouse is, at this point. Hell, I see Harry Potter more than I see Mickey Mouse, I think.", "How many of your kids read books that are not assigned?", "I mean my kid's 2nd grade class last year voted to have their Halloween theme to be Harry Potter and almost all of her friends have read or at the very least seen the movies.", "I’ve met a dog named Neville. It’s a great dog name.\n\nWouldn’t name a child Neville.", "it doesnt matter? Neville is still a very normal name. sure its an old fashion name, but it's not like... the most outrageous name in the world. You never met a person named harry means actually nothing. It's a normal name. JK Rowling might have a terrible time naming POC characters, but her muggleborn British characters all have pretty standard 80s era British Names. \n\nIn the world of 2023, if you name your child Harry (also an old fashion name) most people are going to think of Harry Potter instead of Prince Harry. \n\nthe point is, the name is a normal, albeit outdated, name. it's not going to make the child more or less susceptible to bullying. and if the kid is going to get bullied, the bully will use whatever name the kid has to bully him.", "My husband didn’t like my choice, but still wrote it down on the birth certificate. My point is if it was as severe as OPs scenario we would’ve made amends before letting it get to a point of threatening to not allow them in the room for the birth of our child.", ">private hero.\n\nNo, no he wasn't. His very minimal attempts at rearmament were a joke.", "Neville wouldn't have mattered if Hitler wasn't running around invading everything to begin with.", "I feel like you're speaking from a cultural ignorance.", "I am. I have a little cousin named Neville, I work with an older (British) man named Neville, and I grew up with a Neville around my age. I knew it was a Harry Potter reference for the younger two, but nobody has made fun of either of them for their names to my knowledge.\n\nAnd that’s kinda what I’m saying—I’m not ignoring the connection, but at the end of the day, it’s just a name. It existed before the books, it will exist long after people stop reading them. For some who read the books it’ll be a “reference”, but for most people, it’s just a name.\n\nSomeone asked my cousin at Thanksgiving last year something to the effect of “do you find yourself in conversations about Harry Potter all the time”, and he said, “Nobody my age has read Harry Potter, that’s a mom thing.” 🤷🏻", "Yes, but a lot of adults have shifted their feelings about the HP books given the author is a TERF.\n\nIf grownups aren't buying the books or recommending them to kids, the kids aren't as likely to pick them up on their own. Most of the kids I know who love HP nowadays got into it through the movies and not the books. It's definitely not the craze it once was.", "\"Your kids must be stupid and not read\" is not a good comeback to the idea that younger generations aren't into Millennial obsession Harry Potter.", "Being outdated means it's not normal. The word you're looking for is traditional.", "True, but if they didn't let Shitler expand how would they have ever recouped the financial losses from WW1.?  Since at that point Germany was still paying reparations.", "Neville is a cute name. An actual, long existing name. YTA", "ESH and sounds like this marriage is doomed.", "Whatever name you pick for your child no one will call them by that name for the most part. So it's best to look at the short form or nickname for whatever you want to choose. In this case Nev Nevi or whatever your kid decides he wants to be known as. In any case the 2 of you are silly.", "Tell us the name please\n\nESH a that was a stupid arrangement", "Sounds like ypu both need therapy", "ESH. You both have issues. First of all, that was a stupid bargain to make. You both should’ve had input on your child’s name. Secondly, neither of you are compromising, and that is going to be a death knell in your marriage. Both of you need to grow up and work together. I wish you had gotten a dog first before procreating. A lot of these issues would’ve come up before bringing a child in the mix.", "ESH.  You both sound too immature to be having kids. Both of you GROW THE FUCK UP!", "ESH for bringing children into this toxic mess of a relationship.", "YTA you are over controlling and a bully. Children all over the world have unique names and don't get bullied, there are lots of Johns. Joe's, Kim's and Carries that get bullied.", "Neville is a solid name. Sure it's a bit more popular because of Harry Potter, but it's still a decent name.", "Good lord. ESH. Fix your communication and marriage. Things are going to get so much more stressful when the babies are born. Wtf are you two even doing?", "So you came to an agreement and now your breaking the agreement. YTA", "THIS!!  Holy crap this post turn a sharp downhill turn.  Baby names are really the least of your problems.  As a mom of twins myself, I can tell you that things are about to get insane.  If you don't have a solid foundation to start, I can't even imagine how that is going to work.  My husband and I had quite a few tense moments those first few months.   You and your wife are acting like children squabbling over a toy.  You need to work on your communication/marriage now before you through twin TNT dynamite sticks into the mix.", "Yeah, this is red flag city on both ends.", "Oh lord that’s what I was thinking too. This goes way beyond the name. If she’s thinking about taking off to birth the children is she planning on coming back? This whole thing screams unhealthy. \n\nI want to know the name so bad lol", "I disagree that the escalation was him asking his brother to watch her.  The escalation was her threatening him.  Many women think the children belong to them and not the husband.  Children are EQUALLY the father's and mother's.  She has no right to leave and name both babies on her own.  Funny thing is, she would be right there to demand child support in the case of divorce.", "ESH\n\n> Recently, she's started hinting she might just take off around her due date and give birth somewhere without me and my naming input.\n\nAt that point, I'd tell her to just bring divorce papers with her when she comes back, too.  \n\nNaming children should be a single no removes the choice from the table.", "There surely must be a compromise! Like Neville as a middle name? \n\nESH and they need marriage counseling ASAP. How are they going to navigate the real issues that parenting brings about?", "lmao i had a friend who named their cat megatron", "It would be Neville and Hortensia Beerbong, the wife wants the boy’s name to be Neville", "Megatron, that’s hilarious! 🤣 This pact reminds me of people without children saying “My kid will never do that!” Then years later your child is also licking a French fry off the floor because they are all freakishly fast for tiny people.", "Sadly it’s going to be Neville and Hortensia Beerbong\n\nMegaton Jacob Edward would be a good name and OP wouldn’t complaint about it", "I threatened to name my son Optimus Prime if the ex and I could not agree upon a name.", "Can’t upvote this enough.", "Yeah, even when that type of agreement works it never works *better* than two yes one no.", "My ex and I agreed that if we had a girl when I was pregnant then I'd pick the first name and he'd pick the middle, and vice versa if it was a boy. That worked really well for us. Everything else was the worst lol but at least we named our kid without a hitch", "Agreed, it is a partnership. Both should partake in the naming process.", "I wonder if she wanted that agreement because she knew he'd have a problem with the name and didn't want him to be able to veto it.", "I don't even know if it's that closely associated. I was a huge harry potter nerd growing up but I wouldn't immediately think harry potter when I hear \"Neville\". It's a perfectly normal name", "Neville is a bad name", "Whaaaat the name is Neville?? What's wrong with that name OP? You made it out like she's naming the kid Princess Consuella Banana Hammock! It's a perfectly normal boys name.", "Neville was the ugly duckling hero, eventually killing Voldemort.", "Neville\n\nHenrietta Fugazinuts", "Mulva", "Hunter is a pretty normal name though", "I think she’s threatening running away only for the period of time it takes to fill out the birth certificate forms. Crazy all around", "It doesn't matter if you think it's an acceptable name or not. The child's father doesn't like it and these are his kids, too.", "My girlfriends sister is called rose. Knew a lad in school called Neville. \n\nRose/rosemary are pretty common here in Ireland at any rate. \n\nNeville not so much but it’s not exactly rare either.", "Neville is dated. There is much worse though.", "Neville and Rose. Both totally normal names. OP is a child and so is his wife.", "Neville is a terrible name imo.", "Depends on where you are. I live in New Orleans, home of the incredible funk band the Neville Brothers. It would be considered a very cool name here.", "Neville is a somewhat normal (dated) British name. Like Ethel for a girl. Sure it is associated with a minor character in a somewhat famous franchise. But it’s really not as bad as you’re saying. I doubt it would overshadow the child’s personality or limit his life achievements.\n\nEven if a name is recognizably inspired by fiction, which I would argue Neville is not, I don’t think it’s a huge deal. I taught at a science camp one summer where two of the students were named Arwen. Sure it pinged in my brain when I first took attendance that the name was from LOTR. Then you spend five minutes with the actual student and the association dissolves.", "I love reddit", "Well said!", "I just vetoed this name last night because he will be mockingly called \"Longbottom\". I'm a teacher and kids ABSOLUTELY make fun of names like that. My husband likes all these unique names but I keep reminding him that our kid will be bullied for them. I don't think OP is wrong to say no.", "Ooof.  Neville Chamberlain is forever known by history as the Hitler appeaser.   Not saying an innocent baby should be tarred by that brush but I can understand the hesitation.   Neville to me will always sound like snivel...  coward.", "Neville is fine.  I’m really hoping this isn’t real because they both sound ridiculous", "I don’t know any Nevilles but they definitely get bullied", "Neville is in the same vein as Gertrude…it’s not a bad name but also….would you wanna be named Gertrude with a nickname of Gerty?", "No, it's not.  Not in the US and since this is a US-dominant site it's not even remotely classic or normal.", "OP is a Malfoy, confirmed.\n\nLike out of all the Harry Potter names, Neville is top tier normal to give a kid.  Dobby, or Winky would be the literal opposite - horrible names for a kid (but good for a cat)", "Neville is a perfectly normal and usual name. What is ops problem.", "Neville is awful lmaooo", "ngl I'd bully a boy named Neville, I'm sorry but the name sounds so stupid", "If you gave me the choice I'd name my first born starscream.", "My parents did something similar. They do not have a healthy marriage lol", "That’s exactly what my parents did. I always say it’s a miracle my first and middle name go together. Then with the second kid they swapped and my mom picked the middle name and started calling my sister by her middle name. My dad suddenly didn’t like this game any more and the next siblings they chose names like normal lol", "Was expecting Naruto son Goku or something", "Right?  I was expecting a full on tragedeigh.", "Bruh I thought it was gonna be little bear or some shit", "Honestly, I was thinking it would be something like Aslan or Severus. Neville is an outdated but normal, traditional name.", "And like....if you really have an issue, call the kid by his middle name or a nickname. Or try to strike a compromise and agree to let Neville be his middle name. This is 100% a solvable problem if OP and his wife back off from being so emotional about it.", "And yet he was characterized as a joke, which is enough reason to not name your kid after him lest you want him to suffer the same fate.", "Fewer and fewer every year", "I want you to with a straight face tell me Tom is as common as fucking Neville especially if we assume OP is from the US", "Yeah Neville, just as ubiquitous of a name as Tom. Lol, get outta here", "I would never let my partner name my kid Neville it's ridiculous", "You also liked animanga_overlord", "YOU WILL RUE THIS DAY, CARLY SHAY! Rue it, I tell you!!", "iCarly is immediately what I thought of. YOU’LL RUE THIS DAY!!", "Ehh he's an asshole for comparing him not wanting his kid to be named Neville (perfectly normal name that he just doesn't like) to his wife not wanting her daughter called Hortensea Beerbong the Third.\n\nHe and his wife agreed that one of them would get full naming decision over one child. Do i think it's a good agreement? No. Bit he does need to chill the fuck down about how bad the name is and stop comparing it to actually ridiculous names if he wants to approach the conversation about the agreement being bad actually in good faith.", "Then they shouldn’t have gone with this naming rule", ">Ebony Dark'ness Dementia Raven Way\n\nI've seen this reference before thinking it was just made up on the spot so I just looked it up and...\n\n... I already knew this, but Harry Potter fanfic is goddamn wild. I remember when I was like 14 and a friend showed me some of her HP fanfic about werewolf sex, and I thought it was weird as fuck, but it's *all like that*.", "Eh it’s cringey but it’s not the worst thing in the world", "Ok, but you don't have to like it to know it's not likely that the kid will be bullied because of the name.", "Ah interesting. I only know one Neville. He was a former coworker, great guy. Didn’t give his name a second thought really. I know a Neven as well, similar impression.", "Checked with my kids. As I suspected they aren’t familiar with the name. Younger one said the name would be fine. Older one said it rhymes with devil and kids in kindergarten could bring that up.", ">Frankly agreeing to the you name girls/boys was stupid AF.\n\nRight!  I couldn't agree more.  This child is both of yours, you should both agree on something as fundamental as their name.  \n\nI swear for our last child much husband and I each went through about 100 names before we finally agreed.  And once we found that name, it was absolutely perfect.", "I agree, people have gotta stop with giving each other carte blanche to name their kids, whether it's gender or order of birth or whatever. Personally, I don't even understand why a parent *wouldn't* want to be a part of that decision. OP and his wife need to just nix the dumb agreement and go back to the drawing board.", "For real. If my parents did this one sided, my name would be Jane Danger [last name]. Danger as my middle name would have been cool af but my mother would have been forever pissed for it. Like that’s just asking to put resentment on your child.", "> maybe rethink having kids in the first place\n\nbit late for that", "But OP agreed to a one yes rule with baby names. An interesting model is the Fist To Five model: [https://www.lucidmeetings.com/glossary/fist-five](https://www.lucidmeetings.com/glossary/fist-five), frequently used in organizations when consensus is not needed. Which, most things don't need consensus. I would say they agreed to a Fist To Five model where the reason for giving a Fist would be you are concerned about the child being bullied. Neville is not going to get him bullied. Very few people in the baby's peer group would have read Harry Potter and the character Neville in the end killed Voldemort. It's a less common name but a fist is an overreaction. He should have thought about this possibility before agreeing.\n\nSomeone will probably bully him using the name, but it likely would be the same as the amount of bullying everyone does.\n\nHaving said that, bigger problems, ESH.", "My husband and I have a similar agreement, but 1) I’m not currently pregnant and 2) We have already discussed what names we like and we are both okay with the names.\n\nYou can have this kind of agreement, but dear god people *talk about the names before you are actually having a child*.", "People shouldn't name a kid something that both parents don't like.\n\nLike communication has clearly broken down here.\n\nI don't think naming a kid to spite your spouse is okay but at the same time the wife just fucking off to have the kids and go against the deal isn't okay either.\n\nBoth of these children shouldn't be having kids...", "This happened to me. I was 8 months pregnant, and my kid's dad was dragging his feet on names. I spent the afternoon writing up names I liked, then I brought him the list and said, \"Pick one!\" \n\nFrom my list, he picked a first name and a middle name. They match our kiddo perfectly!", "> the 2 yes or it's a no rule still applies\n\nNo, they agreed on a different rule. She gets to name the boy, he gets to name the girl. Now he's going back on that.", "Neville Pappermen. \n\nI see where OP might get worried", "I could not agree more with all of the above.", "Somehow I knew it was gonna be Harry Potter related.\n\nI also hate Neville as a name, that being said he could go by Nev which sounds pretty cool imo.", "“So many names.”\n\nYup.  Like dozens and dozens and many many more. And if you throw in other cultures, lots and lots.", "When I was pregnant we didnt find out the sex.  So we had to come up with 2 names.  The first girl name he vetoed because it was the name of his parents cat.  Fair.  I came up with others and my then husband agreed.  I gave birth to a beautiful baby girl.  And my then husband said, Oh good, I hated that boy name.  One of the many reasons he is now my ex.  Both need to agree on any name.  \n\nIm going with ESH.  You both need to admit the pact was a bad idea and get therapy.  The fact she's threatening to have the babies in secret?  Your communication has completely broken and the nuclear option is going to blow everything up.", ">\nFrankly agreeing to the you name girls/boys was stupid AF.\n\nI agree. A kid's name is super important. It's going to be used my both parents for the rest of their lives. Having only one parent get a say in it is stupid.", "Agreed, my parents both had names they liked and the other hated. After both vetoed each others choices, they eventually came to a name they both liked, which is my name.\n\nA good way to ensure your child's name is something you can both live with.", "Though there are too many plot holes for this to be an entirely true story-- the fact is that they agreed that each would have specific naming rights to the 2 yes 1 no for naming rule wouldn't apply here.", "idk my husband didn’t like the name i picked for our daughter but couldn’t come up with anything better and now he loves her name…", "Not if they have an agreement she she gets to name the first boy.", "schlongbottom (from a very potter musical)", "It is linked to Harry Potter. That's the \"childhood book\" (20 year old series) it came from. And Neville is a perfectly respectable character in the series. It should be fine.", "Harry Potter wasn't bothered by whether people would bully HIS kids for being named after people who influenced his life.... why should we? It's almost offensive that none of his kids bear Neville's name, seeing how much Neville saved his skin.", "Well, it's not on the same level as Beerbong the Third for sure.\n\nIf the wife insisted on the ... full name (Longbottom included), I'd probably just try to compromise and keep only Neville.", "Probably not\n\nhttps://www.everything-birthday.com/name/f/neville", "Why on earth would you think there's thousands of people naming their kid Neville?\n\nAre you a time traveler?", "I thought it would be like Azrael or some shit lol", "Except, apparently old names are making a comeback.  ¯\\_(ツ)_/¯ He will probably not be the only one with an old man name", "Look at the top 100 baby names right now, they are all old fashioned. It will fit right in. \n\nIt will, however be associated with Harry potter", "Or to go back to never never land or the never ever Neville.", "You should name pets after interests, not kids.  They’re a person, not an accessory.\n\nFor all you know that kid fucking hates Harry Potter when he’s 13 and is stuck being named after it because his parents are assholes.\n\nPop culture references in names are always a mistake.", "second time in the last 24 hours I've seen this reference. Can you point to me where it is from?", "Shut up, Meg", "Literally what I was thinking!", "Saw the movie and read the book when I was in elementary school and became obsessed, wanted to name future kids Ponyboy and Sodapop. Thank god I wasn't a young parent lol", "But what about the 16th Earl of Warwick, the turncoat Richard Neville? \n\nEdit - wrong number, his grandson Edward Plantagenet was the 17th Earl of Warwick.", "Cool if they're UK and 60 years old.  If they're anywhere else in the world you get to be Longbottom or the Hitler Guy", "Neville is a very British name, Hortensia Beerbong the 3rd sounds like a Hobbits name.", "I'm also in the UK and would say the name is much more strongly associated with Harry Potter than with the cricketer.", "Yes, because kids are that rational and do-gooders, they would never focus on the \"haha longbottom\" and \"totally a loser for a good chunk of the story\" part", "What? He was a total dick to iCarly /s", "He had a lot of growth throughout the books, but he was known for being weak and forgetful in the first few. It’d be like naming your kid Milhouse.", ">cowardly\n\n\"There are all kinds of courage,\" said Dumbledore, smiling. \"It takes a great deal of bravery to stand up to our enemies, but just as much to stand up to our friends. I therefore award ten points to Mr. Neville Longbottom.\"\n\nBook one. Neville had guts from the get go.", "Albus Severus Potter Surname, you were named after the dumbest agreement I ever made with my wife.", "HP ff can be wild but this specific one is notorious. Before 50 Shades I would say it was the most well known piece of fan fiction ever.", "I disagree he would have been bullied at my school for such an old man name. People would have called him grandpa neville 😂", "Parents in my childhood neighborhood had an agreement that the mom would be responsible for disciplining the daughters (2) and the dad, the boys (5).  Mom was very strict, dad nonchalant until they did something _really_ bad.  Those boys were holy terrors, the neighborhood bullies.\n\nI don’t understand splitting up naming / disciplining, etc., by gender.  It creates family imbalances.", "ESH you both sound unhinged \n\nMy husband and I share a Google keep check list where we add names we like and we cross off names that we don't like.\n\nThere are times we've gone back and forth taking off and putting back on a name as we talk to each other.  We usually narrow it down to 5 names we both like and one we feel is right.\n\nSometimes finding the right name is fast sometimes slow. One time we didn't find the right name until 2 weeks before the baby was born!", "Same. We spent months looking through random lists on the internet, family trees, etc for names that we liked. We ended up with a shortlist and said we'd figure it out when the kid was born. We surprised ourselves by going with a name that was at the bottom of our list! But it just suited our kid.", "> And once we found that name, it was absolutely perfect.\n\nSpend time picking a unique, dignified, and uncommon name for your child.   And then they show up for kindergarten and there's 2 more with the same name in the class.", ">Right! I couldn't agree more. This child is both of yours\n\nI agree and disagree. The child is their own. The name is for a future adult. I named both my children for the person they will become.\n\nSo many people name a child and not an eventual adult", "Fwiw, my husband and I had a deal where he would name our son and I would name our daughter. We each got veto power though. And, as it happened, we each liked the other's name. It can work.", "God made human pregnancies last 9 months to give parents time to agree on name", "Our agreement was dad chose daughter’s first name, mom chose the middle and vice versa for a son. That way the names would need to flow and be something we agreed on. It’s a system that can work, if you’re able to communicate and agree on standards.", "An old friend had twin boys, and they decided she and her husband would each name one of them. She hated the name her husband picked but stuck with the agreement. I saw her at a reunion when the kids were 3 or 4 and she of course loved her son Fletcher but was still mad about it. She made sure to tell everyone who asked about her kids that she had twins, \"... and *Fletcher*\\-- I didn't pick it!\"", "Agreed. I mean, I could see an agreement where they switch off who gets final say between multiple options they both agree are acceptable or something like that (e.g., they come up with a list of 5 boys names they both like and then wife gets final pick from that list, and vica versa), but no veto power at all is wild to me.", "I have an acquaintance who has triplets, one of the two girls has the middle name Mayhem", ">Someone will probably bully him using the name, but it likely would be the same as the amount of bullying everyone does\n\nEveryone can be bullied about their name. Some names are worse than others, but I think in an English-speaking country, Neville is perfectly fine.", "The idea of not using a fine name bc of potential bullying to me is absurd. That’s like blaming someone for being assaulted bc of their outfit (if that makes sense, it does in my mind). I’m not going to veto a good name bc it might rhyme with something else, that’s other peoples problems and every single name out there has potential to be bullied or made fun of. It’s a pet peeve of mine. Same with mispronunciation. My name has been mispronounced my entire life, but I absolutely fit my name and wouldn’t want another. It’s not that big of a deal imo.", "Neville Killed Voldemort? How can we trust your judgement if you get something like that so fundamentally wrong? That’s like saying Chewbacca was Luke’s father.", "Yea the level of insecurity on display by OP is a terrible disappointment coming from a future father, and is legitimately pathetic. Could be called Nev for short. But the mother just not caring that he hates the name is an enormous disappointment, as well. The general idiocy involved in \"hurp dur I get to name a girl u get to name a boi\" without any consideration given to veto power... ugh. What an exhausting, pointless couple. If you can't communicate and work through this what actual hope do you suspect you have at effective coparenting? Spoiler alert: it's none. No hope.\n\nESH, hard.", "Neville's not killed by Voldemort, he goes on to be the new Herbology professor.", "isn't JKR's bigotry well known post-2023?  \n\nI'm not saying any of the character names are on the level of Adolf, but I'd give any parents \\*still\\* clinging to Harry Potter a serious side eye.", "I mean why would either of them agree to something so incredibly, objectively stupid? Are they 10?", "I'm also a Victoria.I swear my kids and their cousins became my biggest bullies after hearing the \"Icky Vicky\" song from Fairly Odd Parents.", "I'm a Victoria too, though I go by Vicky. Unless I've done something naughty then it's Victoria by my Mum. \nMy name was the least of my worries at school, hair colour, hair style, glasses and freckles to name a few.", "My older sister and her friends called a girl named Mallory, Mail-ho-ry.", "This is the name of a popular show host, Catfish", "I think Neville by itself is great. The Neville Brothers are bada$$. I’d assume the kid was named after them.", "This. \"Cottagecore\" names are really, really in.\n\nI know several Arthurs, a Beatrix, Ruby, Lucille, Scarlett...", "I know people with each of those three names. Never considered them to be overly weird, don't know that any of them got bullied for it.", "This, and also none of us *really* knows what names will be seen as dorky in the 2030s and beyond.", "I completely agree! I've said this so many times, kids are gonna make fun of a name. I had one of the top names of my birth year, along the lines of Jessica, Jennifer, Amber and still got made fun of for my name.", "Lol this is from Harry Potter? I thought of Neville Papperman from icarly", "If she tried to name him Neville Longbottom I would be speechless", "I'm not going to say Neville is a popular name, but that data is obviously garbage. 0 in 70 years?", "That's because you searched for girls named Neville.\n\nHere's the link for boys: https://www.everything-birthday.com/name/m/neville\n\nIt's still not a ton, but it's not like it's completely unknown.", "Same here.  Thought OP was worried that worldly schoolchildren would mock his son with jeers of \"Peace in our time!\"", "Ngl I thought Neville Chamberlain was also the name of the kid from Harry Potter", "There's also Neville Southall (former Everton goalie) and Neville Neville (late father of Phil and Gary Neville).", "Sadly that's also who I think of when I hear the name Neville. Not the best figure to be associated with in hindsight, but the name itself isn't the worst IMO.", "The amount of grown adults pushing very recognizable names from their favorite fandoms onto their unborn kids still baffles me to this day. \"I identified with them as a kid myself\" is enough reason to name a pet, not a child. Harry Potter fans are next level when it comes to naming their kids hugely recognizable names and then burying their heads in the sand when they're told they're instantly recognizable and bully-able and not as \"cute little nod to my childhood\" as they think they are.", "Except Neville was a name long before Harry Potter.  It’s not like Khaleesi.  \nI’ve met 2 Neville’s in my lifetime, both of whom are over 50.   The one Nev I know is in his 70s and could definitely kick my ass if he wanted/needed to.", "My ex-boyfriend’s neighbor named their golden retriever my name. It was comical anytime I heard her yelling at the dog. I don’t think there are any hard and fast rules to naming anything.", "Last name? Cox.", "We do not speak of him. \n\nBut we should because turns out he’s the most interesting thing I’ve learned about Barnet and he died in about 1428. You can tell I live in south London right? :)", "That man had a really cool castle. I lived in England for a few years as a kid, and that was definitely my favourite. Second is probably Caernarfon, although Harlech was good too (we had a holiday in Wales).", "It’s also still fairly popular in the English speaking Caribbean. Bunny Wailer’s given name is Neville O’Reilly Livingstone. \n\nI have no idea why I know so many facts about the name Neville since I’m not from the UK or over 60. \n\nIn fact I had zero idea it had a Harry Potter link until today. I just assumed all the kids I’ve encountered with the name in the last 20 years were big Man United supporters :)", "Aside from being written by a known TERF, Schlongbottom was a fantastic character with excellent development over the series who had a next level glow up when puberty hit. \n\nGary Neville is only in his late 40s and aside from having managed a top Spanish football team in the last decade is also a well known sports pundit. His twin brother Phil is an AC to the Canadian national team after being head coach to the Lionesses up to the 2019 Women’s WC and being an assistant to his twin during Gary’s stint as manager. Both played for Man U and England, and Man U is (although I hate to admit it as a Liverpool gal) an internationally renowned squad. Phil went on to play for Everton and neither of them retired from playing until the early 2010s. \n\nActing like the Neville twins are only known in the UK and only if you’re only 60+ is a bit ridiculous. I don’t even *like* football.", ">Unless longbottom is the middle name, the first name might be stuffy and associated with fandom in the US, but it’s a common British name.\n\nIt's actually not.\n\nIn 2021, it was ranked 21,126th out of all the names given to boys in England and Wales. This means that only about 9 babies per million were given the name Neville.\n\nIt's actually more common in other countries than it is in the UK... In Canada, it is ranked 1,128th, in Australia it is ranked 1,379, and in South Africa it is ranked 1,536.", "Cox and Butts are also very common. I'm acquainted with a woman named Sandy Beach. I know of a man named Chip Pringle.\n\nReal people are living their lives with very silly names.", "Sounds like maybe you would have been the bully then.", "That is so awful.  And those poor daughters, that kind of mentality just reinforces gender inequality.  Boys will be boys, but girls must behave....", "I’ve heard of the naming thing, which is a bit weird but ultimately (usually) harmless. Never heard of what you said, that seems on its face sexist.", "Oh HELL no. \n\nThen mom is just background noise to the boys. Fuck that. Sets them up to ignore girlfriends and wives, too. What's that? A female voice? Pay it no heed! \n\nHad a neighbor whose form of discipline was yelling at the kids. And that's it. \"Stop it, Timmy. Timmy, stop it. Stop right now. Timmy, stop that. Timmy! What did I just say??\" Jesus Christ, lady, get out of your lawn chair and do something about it. Kids clearly learned to never take anything she said seriously. \n\nWe were never hardasses, but if we said there were consequences, then there were consequences. Kids knew it.", "For our first kiddo my husband suggested a name and I loved it, and that was it.\n\nSecond kiddo I just couldn't come up with anything I *loved*, but we ended up with a short list of 3 names, eliminated the one I liked least, and then the day the baby was born I told my husband to pick one of those two because I wasn't going to be able to decide...  he's 5, it's fine...  the name we didn't go with was Elihu.  Probably a good choice...", "This sounds like you are having kids often enough to need a workflow process.", "I wish my husband had been like this with me. He didn't help at all figuring out a name, I came up with several and he shot them all down. A week before the birth, he came up with one, I hated it and said no. After he was born, he said he still liked that name. I was so doped up I agreed to it. My son is 6 now and I still hate that name.", "My parents were going to name me the name they ended up giving my sister, then decided her name didn’t fit me and used a completely different name the day I was born.", "This is a great idea.  And I 100% agree that you sometimes need to sit with a name for a little awhile to see if it grows on you.", "This is hilarious and spot on. We spent months looking for names that were uncommon but not weird, that we liked. Since having our kid and going with that name we've met so many people who are like \"oh also that's my kid's name!\" 😂", "The problem with picking a unique name is that everybody thinks the same names are unique that's why we have a world Aiden's and Kayla's", "Not sure I understand you comment?  In our case, we weren't going for uncommon names, that is neither of our things.  We just wanted a name we both like.", "Two?  Pffft.  We moved across the country when my middle child was a baby and the place we moved to had SIX others in their first grade class.  Sigh.", "YEP!!  both kids, 13 years apart.  How does that happen?!?!", "We got lucky, the mame we picked for our son has gotten more common, but still not too common and the handful of boys we've met with the same name have all been younger.", "Oh yikes... poor Fletcher, not because of his name but because of the possibility that his mom will treat him differently because of it. \n\nI'm a twin, we're both girls. My parents decided that my dad would pick our first names because, in my moms words, \"I'm carrying the babies so its only fair that he gets to name them\". But even then it was still a decision made with both their inputs. My mom loved both of the names my dad picked out so the arrangement worked well for them.", "My mom's maiden name is Fletcher... she wanted to name my brother Fletcher, coz he could be called Fletch for short- just like her and her brothers were all called in high school... in the 70s.  She ended up giving him Fletcher as a middle name.  I told him the story once, and he was VERY grateful he wasn't Fletch.  haha.", "My mom didn’t like my name, which my dad picked, but she loves it now!", "The name Fletcher is like nails on a chalkboard to me 😵‍💫 it sounds so harsh and unpleasant (and vaguely reminiscent of expectoration). I agree with the mom 😂 But obviously would have vetoed it before the kids were born.", "Yeah my name is pretty common in my country and I was bullied for it. Unless it’s an obvious pun to something gross or sexual, kids really wouldn’t do much if they weren’t gonna bully the kid anyway", "Yup that's the point I was trying to make. Everyone gets bullied over something. Neville is not so extraordinarily bad that you change your decisions for it.", "Yeah that's what I was arguing. Nothing is immune from bullying. Pepsi Marijuana will get you bullied.", "Ahh, so Neville destroyed the last Horcrux but Voldemort was still left. The killing blow on Voldemort was an own goal with the help of Harry Potter.", "He didn't say that.  He said Neville killed voldemrt.", "Didn't Neville kill Nagini?", "Neville killed the last Horcrux, the snake Nagini, and made it possible for Harry to kill Voldemort.", "He went on to be a detective inspector on St. Marie Island.", "read it one more time", "Roald Dahl’s antisemitism is well known. Do you also give the side eye to anyone still attached to his books?\n\nDeath of the author is a thing. Some people can separate the work from the artist. Just because someone loves a book written by a bad person, doesn’t make the reader bad.", "I mean that's all the more reason why it is unlikely that nobody would have read HP and the kid won't get bullied.", "Yeah I know the HP series meant a lot to a lot of millenials but I gotta side eye anyone naming their kids after a JKR character in this year of our Lord 2023 when her TERF bs is well known, amongst her other issues.", "Jesus I can’t with the jk Rowling is evil bad woman shit.", "Where do you teach, Sub-Saharan Africa? Hogwarts Legacy just came out and was talked about **a lot** by everyone with a mouth.", "Very weird. My daughter was upset last year, 3rd grade, because everyone else was reading the HP books and we hadn't let her start yet. (She scares easily). My son was invited to a HP bday party in 2nd grade, and they all knew the characters.", "And I’ve met several, some long before Harry Potter was ever published. Your point?\n\nIt’s a perfectly ordinary name. My best friend in kindergarten was Neville. I called him Nev and he once climbed a tree to get my kitten down and got stuck, the kitten then hopped down and I had to stand under Nev’s feet so he could scoot down the tree and wiggle down. \n\nWe ended up in a heap and I think the cat was laughing at us. \n\nIt’s a nice name, for nice little boys who help their scared friends get their stubborn cats to safety, lol. (No the kitten story doesn’t have anything to do with the name, but it’s a fond memory and I like to tell that story.)\n\nBonus Nev Story, because I think it’s also a cute story: There’s also the time Nev and I went to play after a multi day rain storm and discovered a puddle rapidly drying in the Texas sun… with live tadpoles in it. I was a total weenie of a little girl so I started crying at the idea they would dry up and die and we knew we weren’t allowed to go near the creek to take them there. \n\nSo I found a plastic bottle in the alley we were playing in (not like a dangerous alley, it separated my street’s backyards from his street’s and was easily visible to both of our houses) and we used a plastic toy teacup to transfer water and tadpoles into the bottle until we had caught every. last. tadpole. We even waited for mud to settled and poked around gently with a stick to be sure none were hiding. \n\nThen we dumped them into a big tub on my front porch after my dad dechlorinated some hose water for us. (We had a fish tank and dad kept toads, he might have done more to the water to make it safe, but we were five or six so I don’t remember)\n\nBetween the two of us (and Dad’s help I ***guess***.) we raised a herd of little amphibians, who were taken down to the creek in groups since they were raised outside to be sure they did not get exposed to anything they wouldn’t be “in the wild”. (Aka things Dads toads might’ve had, dad cared about that, we were five so not so much.)\n\nAnyway, I think it’s a cute story.", "My grandad was a Neville. Mostly called Nev. Perfectly fine and common name, if a little outdated. Better than naming your son Draco at least", "I feel weird now. My dad's name is Neville. It's an old school name in general, so not common for younger peeps to have it, but it's not a tragedy if they do.", "They also listed a bunch of other names. I'll give you some more. \n\nHarry, Ronald, Molly, Arthur, Fred, George, Percy, Charlie, William, Luna, Fleur, Helga, Daphne, Astoria, Blaise, Lily, James, Petunia, Peter, Tom, on and on, all names that exist in real life to varying popularity and distinctiveness that were used in HP\n\nNaming someone Neville is not the same as naming someone Hortensia Beerbong, not even close\n\nAnd for the record, I fucking hate jkerf\n\nEta: apparently Ronan is trending up now and it's the name of a freaking centaur so there's that", "I have one of the most common, generic names ever and not one that's easy to make fun of...\n\nKids still found a way no matter how far they had to stretch to get there...", "Hmm maybe not in America, or (where are you from? ), but I know several Nevilles . Granted they are all 60+ years old, but still…", "people are like \"dont give kids ammo for bullying\"  but this is ridiculous. Kids will literally use ANY name to make fun of another kid. and it would be one thing if we were trying to name the kid something like \"Asteroid\" or something,..", "its not a bad name. its and fashioned name. and he will probably get teased. But kids get teased for all kinds of names. Im asian. I have an asian name. I was teasd for that. Kids find new and innovative ways to be shitty to each other. The name isn't the reason kids get bullied. Its just a tool for bullies. and even if you give them a \"normal\" name, a bully will find a way to turn that into an insult. I just saw a post where a girl named Beth was bullied by being called \"Bethlehem\" which..... \n\nAnyone named Dennis will be called \"Dennis the menace\"\n\nAnyone who's name can be shortened into a euphamism for a penis, or penis related joke (Richard, Rick, William, Jack) or rhymes with a euphamisn for a penis (\"Nick the Dick\"). even Harry, outside of Harry Potter will still get some form of \"hairy\" joke about their name", "I think Neville by itself is great. The Neville Brothers are bada$$. I’d assume the kid was named after them.", "When those kids start studying the root causes of WWII that kid is in for a world of pain 😭", "Especially with franchises that are short lived, like any kids named after GoT characters, I feel bad for them.", "Like sure “Harold” is fine if you want to call them Harry.  It’s cringe as hell you got it from Harry Potter, but it’s not an instant target on your kid’s back.\n\nFucking Neville is a crime unless you’ve got a better reason than “I liked this book written by a bigot when I was 15, so now as an adult, I’m going to force this interest onto my unborn child with no regard for how it affects them”", "> both of whom are over 50\n\nIt's almost like the name fell out of popular use and this person would've named the kid that whether it was an old name or not.\n\nThe vast majority of people who are going to come in contact with this kid over his lifetime are going to assume it's a Harry Potter reference to a character with the last name \"longbottom\"  This is just as bad as naming your kid a tragedeigh.\n\nIs it that hard to not name your child after a pop culture phase for your teens?", "Naming a child after your interest assumes they’ll like the same things as you.  That’s not how things work.\n\nIf my parents had named me something uncommon after some niche interest they had, there’s an almost guarantee I’d hold some sort resentment against it and have changed it after I turned 18…let alone a wildly uncommon name from a crazy pop culture phase with the last name “longbottom”. \n\nForcing your interests on an unborn child with no regard for how it’s going to affect them is being an asshole.", "Three more and you'll get a bingo!", "Caulfield! I don’t know of any children’s books with a character named Holden Cox. It would be a great one for sex ed.", "Yeah I actually saw in another comment I was wrong, Neville is *less* popular in England than some imperial satellites like Canada, Aus, and SA.", "> Bunny Wailer’s given name is Neville O’Reilly Livingstone.\n\nI just want to point out that you're example of the name still being popular is a dead man born in 1947 who was not even known to the general populous by that name", "But like…*don’t* forget the first couple books. He never did anything more embarrassing than any of the hero trio did in those books. He was kind, he was quite skillful, he was incredibly loyal, compassionate, etc. \n\nHe was mostly bullied because his parents were driven insane by evil people — bullied by the children and friends of those evil people, no less — and because he lived with his gran, who was a bit of a hovering/doting presence. Y’know, as you’d imagine a gran *would* be, considering the circumstances. People who know who the character *even is* are *supposed* to get that he doesn’t deserve the bullying.\n\nLike, I know exactly how stupid and cruel kids can be, and still I genuinely cannot imagine a kid who knows the stories and thinks Neville *deserved* the bullying. \n\nMan, I would *delight* in training my kid in the ways you could put a bully in their place for shitting on an incredibly good character whose only sin was having parents who were tortured until they needed to be in a hospital for the rest of their lives. And who was *the goddamn hero* in the end!", ">you should 100% name your kid something that indicates he will eventually be an army leading, special sword wielding, glow up hottie\n\nBRB naming my kid Aragorn", "That's a dumb history question in the first place. Like, I would certainly answer Germany because otherwise there would have been nothing to appease, but wtf kind of history are you teaching where there's a simple one-shot answer to \"whose fault\"?\n\nThere are probably numerous things that could have been done to derail the primary aggressor in various historical conflicts, but we don't have those counterfactuals to examine so we can't really know. What has a specific correct answer are facts like who launched the first invasion.", "I mean at that point, I’d argue it was France’s fault for not doing anything about the remilitarisation of the Rhineland.", "What a shitty teacher. Who even puts a question like that on a test and is only prepared to accept one answer as correct? And isn't the point of history as a subject to understand that it's rarely as easy as \"this thing that happened was this person's fault\" anyway?", "Still can't believe the editors let Cho Chang make it to the press.", "Honestly, probably worse for the boys in the long run. I can't imagine they grew up to be happy functioning adults. At least with structure, the girls have a better shot at a good adulthood.", "Yeah. Splitting anything by sex is a horrible plan. I know it sounds dramatic, but these divisions help keep male supremacy in effect.", "2 girls, 5 boys? Apart from anything else- and the obvious madness of this plan-  that seems like an unrealistic division of responsibility.", "And how is little Ryfle doing?", "Yes! We went for old fashioned and not common. I swear I hadn't met anyone with that name in my life. But there have been multiples in various classes and church groups! Still no one more than a couple years older than mine, so it really wasn't common for a while. \n\nChecking [here](https://www.ssa.gov/oact/babynames/decades/names2010s.html), it wasn't on the list for a few decades, then was over 150, then made it in the 50-100 range by the 1990s. \n\nWe were in a shop a while back and a mom kept yelling at her kid with the same name. My kid did not appreciate it.", "Most if not almost all of the world doesn't really care about this kind of subject. \n\nAll of our gen grew up with Harry Potter and aren't that much concerned about the TERF/Trans-activist wars and bullshits. So anyone giving a side eye about someone in the millenial age loving HP is quite stupid.", "Well... she is. Lmao\n\nDon't expect someone who thinks sugar and screentime are the absolute devil and likes stuff like the Kardashians and Teen Moms to quite get the nuance.  🤦🏻‍♀️", "Given the writer is a trash human, I am actually glad they don't know the work", "Mine read all the time. My son is in the gifted program and is in 3rd grade. He can demolish chapter books.", "I wouldn’t name a child Neville either, but I’ve heard a LOT of other names that are MUCH worse.  The bigger issue here is that they made a stupid agreement, and are both being completely intractable. 😬", "My half sister’s bio dad had a best friend named Neville. That’s the only one I knew. He was probably born around 1958-1960", "Some names should just stay pet names", "It's a way more common name in the UK than in the US.  Much like Basil.", "Your story made me feel all fuzzy inside. I love little kids who are kind to animals.", "You thought correctly. Those are cute stories. Neville feels like it would be the name of the nice kid you know in childhood who was always kind to animals. Thanks for sharing!", "No. That's definitely not the case.\n\nHarry is an incredibly common name and there are a number of tiwhr incredibly famous people with the name Harry. Hell in the England team you've got Kane and maguire.\n\nNeville you've either got Longbottom or Chamberlain.\n\nNever give your child an easy out to be bullied with if you can help it.", "My legal name is asian, and I go by an english nickname.  I've been teased for both my asian name *and* my very normal english nickname.  It really doesn't matter what the name is, kids will find a way to bully/tease you regardless.\n\nWhenever I come across these kinds of stories, I try to push the idea that instead of policing other people's names, how about we teach our kids to not be bullies.", "Also, if you think about the story of Neville in Harry Potter then it just makes the name better. Neville never gave up and then went on to play a role in helping to defeat Voldemort. You may start out awkward but then you grow into yourself. It’s a good message for a kid. \n\nAnd Harry Potter is not even a fad like Twilight was.", "No matter what name you choose, picking your child’s name out is forcing something you like on your child. Whether it’s a beloved literary character, or in honor of a relative, or some tragedeigh because you want their name to be “unique.”", "I’ve just realised that that’s why it seems so ‘normal’ to me. I’m originally from one of those countries and now live in an area of London with lots of people from those countries! Ahem…", "This is also fair. I recall that portion of my statement and wish it stricken from the record of consideration.", "Funniest thing is the History teacher was a staunch Republican (I was in Ireland) so the chance to blame Britain for something should have been right up her street!!!  But in fairness, it was a multiple choice question for children (14-16 yo) not a debate question.", "Is it really that odd that 10-12 year olds american kids would find the name silly? Most people started reading the harry potter series around that age, and first impressions will stick.\n\nI'm sure that there's 10-12 year old british kids that find certain american names silly", "Do we know what culture OP is from? The name Neville is not common in the US at all, and the only one most of us think if is going to let us know where it came from.", ">but a lot of adults have shifted their feelings about the HP books given the author is a TERF.\n\nI think we have very differing ideas on what \"a lot\" consists of.\n\nPeople who don't have at least one favorite author that's gone full whackadoodle after becoming famous need to read more.\n\nI can list 5 off the top of my head.", "Exactly, that's why the harry potter video game barely sold!", "> Yes, but a lot of adults have shifted their feelings about the HP books given the author is a TERF.\n\nEhn. H.P. Lovecraft was a well-known xenophobe and racist, but his works are still very popular. I think most people are either intentionally or unintentionally pretty good at decoupling an author's personal beliefs with enjoying their work. \n\n>If grownups aren't buying the books or recommending them to kids, the kids aren't as likely to pick them up on their own. Most of the kids I know who love HP nowadays got into it through the movies and not the books. It's definitely not the craze it once was.\n\nBy middle school, unless you're talking home schooled kids or something, most kids are well past the age where you can really be sheltered by your parents opinions. I still see displays of Harry Potter merch in Barnes and Noble. I still see Harry Potter toys on the shelves at Walmart. They still play Harry Potter movies on cable TV. They're still on major streaming services. \n\nIt would be very difficult to grow up in a western country and not be aware of Harry Potter.", "No. No they really haven’t. Per usual, there’s a vocal minority and everyone else is scared to be a dissenting voice.\n\nImagine being able to seperate two things like artist and the work they produce, when one is not always dependent on the other. You know what I learned about TERFs and their viewpoints from Harry Potter? Fucking nothing. Every book is a product of its time, before you start yelling about representation.", "not really. a lot of adults IRL (not the internet) actually don’t care and still push the HP mania on their kids…", ">Yes, but a lot of adults have shifted their feelings about the HP books given the author is a TERF.\n\nI can guarantee you that's not the case. A minority might have done that. Most adults don't care, doesn't have time to understand the stupid TERF/Trans activist onslaught. The older they get, the more they don't give a fuck.", "Honestly, how many books came out since Harry Potter? Some people realize there's a lot more options", "I’m from Texas and went to mostly Fort Worth schools. \n\nAnd I had at least five classmates named Neville, all of whom were too old to have been named after Harry Potter since it was published well after we were all born. \n\nOddly, I went to high school with a Basil too! Named after the Sherlock Holmes actor because his grandmother had known him. His mother was British though, as far as I know all of the Nevilles had just regular American folks like mine.\n\nConsidering how many older Nevilles I met working in nursing homes, I kinda wonder if a lot of my classmates were named for grandfathers or older uncles or something. Because I haven’t met a lot of boomer (not making a boomer joke, referring to the age range) Nevilles, but have met Silent Generation Nevilles, as well as millennial and maybe young Gen X ones.  \n\nBut from what I can tell, Neville was mildly popular as a boy’s name in small town north Texas around the depression or a little before. Because the older Nevilles all seemed to be ww2 vets or the right age to be. (Another oddly, to me anyway, common name from that era was Miles. My own great grandfather’s name and at the nursing home I took care of several at a time, but I’ve never met one under the age of sixty or so. I really like the name Miles personally, that one needs a resurgence.)", "wait... Basil is a person's name in the UK???  Its a spice.", "oh my god who cares? its a name. a normal name that is not super common. Neither is the name Eugene (Flynn Rider anyone?), but thats more popular than the name Neville.", "its a normal name. just because you only know 2 popular nevilles doesnt mean you shouldnt name your kid that name. its stupid. kids are going to find whatever way they can to tease a kid. Even with a normal name like \"Rick\" will just be \"Rick the Dick\" or some stupid shit. When i was a teenager, a girl named Julia was called \"Julia gulia\" from some random movies from the 90s.", "I think Neville by itself is great. The Neville Brothers are bada$$. I’d assume the kid was named after them.", "I had a really common name, there were a dozen girls all with the same name with variations on spelling and I *still* got teased for it. You're so right that the name has nothing to do with it", "There's a massive difference between:\n\nNeville after fucking Harry Potter\n\nBreighdon because you're an idiot \n\n\\- and -\n\nJeremy because it's a nice name.", "Exactly. I actually thought getting name inspiration from literature was quite a common thing…!", "They were paying reparations for a lose for a war that was not their fault and they werent at the wrong for.  Ww1\n\nIn a way the imposition of the crippling unfair situation after ww1 led to his rise in power", "Chad. Chet. Chester. Bobby Jo, Billy Sue, Jiminy Billybob.", "For those who don't follow video games, this is maximum sarcasm.", "Yeah. \n\nYou know, that little known game. That was one of the biggest releases of the year on *every platform* (Save for the Switch, which still has to wait a couple more months). On the cover of like every gaming magazine still printed on paper, on the front page of every gaming website for months, played by many major game streamers...\n\nYeah, I can't imagine kids would have heard of *any* of that.\n\n/sarcasm\n\nHell, the people screaming about how evil the game was for existing *alone* means anyone even remotely in the gaming sphere can't help but be aware of it even if they've never played it or even seen a screenshot of it.\n\nBut we all know kids don't play games.\n\nWait, sorry, I was supposed to have stopped being sarcastic.", "He also died in the 1930s. JK is very much alive and still profits from Harry Potter.", "I’m 31 and the vast majority of people in my social circles have no idea who Lovecraft is, and even the ones that are familiar with him haven’t read any of his stuff. If anything, stuff derivative of his works is more popular than his actual writing at this point.", "Lovecraft is dead, so he doesn't benefit from any sales or adaptations.  \n\nJKR's bigotry spills into her work, visible in Harry Potter and explicitly in her post-Potter work. \n\nShe uses her fortune to influence politics, policies and activists. She's also repeatedly stated that she considers anyone buying any part of her franchise (books, movies, theatre piece, new game, upcoming tv-series, ...) as an explicit supporter of her points of view.  \n\nIt's just not as simple as \"decouple the author and the work in your mind\" IMO.", "My daughter is 21, and while she knows Harry Potter exists, that's pretty much the extent of it. She's never read the books, even though I had the full set. She played on her phone while one of the movies was on TV. I don't think she could name five characters from the series or even an inkling of the plot.", "I wonder if you had a Neville that came over and had a lot of kids, and a lot of kids later got named after grandpa/Great grandpa.  And once there are a few it's considered a common name in the area.  I don't think I've ever met a Neville in the US, but if it's a small town, it could become a common family name.", "You'll be glad to know I have two (college) students named Miles in my classes this semester. =)", "Wait- the main character from The Great Mouse Detective was named after a Sherlock Holmes actor? That's amazing! (The Great Mouse Detective is basically Sherlock Holmes for children. This Sherlock is a mouse called Basil of Baker Street and he lives in Sherlock's house and solves mouse/small animal society crimes)", "Wait till I tell you it's also the name of a great mouse detective!", "Yes.  Though usually with a short a instead of a long one.  So it rhymes with razzle.", "Absolutely.", "And Lovecraft very rarely tweets.", "Orson Scott Card is still publishing books that sell well.\n\nBefore she died, Anne Mcaffery was still publishing books that sold well.\n\nRoman Polanski still makes movies tons of people see.\n\nMel Gibson still directs, produces, and acts.\n\nI could keep going for quite a while.\n\nA lot of very famous, very successful creative types hold some very despicable views. People are quite good at separating the opinions (and sometimes actions!) of them from their ability to enjoy their works.", "One of my favorite book duos is based off lovecraftian horror so I know it that way, but I also heard “lovecraftian horror” as a sub genre pretty often in college.", "He’s the embodiment of good ideas, shit writing.", ">Lovecraft is dead, so he doesn't benefit from any sales or adaptations.\n\nHence why I gave many other examples, too, of either living people or at least ones who were still alive when their problematic viewpoints were known and it didn't keep them from being successful.  \n\n>She uses her fortune to influence politics, policies and activists. She's also repeatedly stated that she considers anyone buying any part of her franchise (books, movies, theatre piece, new game, upcoming tv-series, ...) as an explicit supporter of her points of view.\n\nShe can call herself Queen of London if she wants to, it would be just as much nonsense.", "She is free to \"consider\" whatever she wants, but that doesn't make her correct. I mean it's just a fact that not everyone that buys her stuff supports her views.", "... I didn't say they had to *personally* be a fan of it. Even at the absolute height of the Harry Potter craze there were plenty of people who weren't and had never read the books. But they were aware of it. And by your own admission she's aware of it, and could certainly name the main character, given that his name is the title of the books. That's a sufficient level of awareness for me.", "ESH. But I’m leaning more toward YTA. You are both acting like 12 year olds fighting over a video game. The name isn’t even bad in the slightest either. You made an agreement, honor it. Choose the middle name of it means that much to you. You can give the child a nickname even. But this petty fighting between you and your spouse does not bode well for your children. There will be many tougher choices to be made once they are actually alive. And you all can’t discuss anything appropriately.", "After finding out the name is \"Neville\", YTA. It's not like naming your kid \"Hortensia Beerbong the Third\" and you're a prick for saying that.\n\n&#x200B;\n\nI do, however, agree that you guys sound like you have some real issues to work out if your wife's response is to LEAVE YOU OUT OF THE BIRTH OF YOUR CHILD. That's some wild stuff and I think you really need to a.) take stock of your relationship with your wife and how you BOTH handle stress and disagreements, and b.) what your house looks like that you're going to raise little Neville in.\n\n&#x200B;\n\nAlso, what the hell: if your son is getting bullied for being named Neville then just let him choose to go by his middle name. Unless his middle name will be Longbottom in which case I'd reassess *that* choice.", "Yikes, and I thought my husband and I were having a hard time coming to an agreement on our second son's name. \n\nThis relationship seems troubling because your wife wants to go away and give birth away from you so she can name your kids without her. And then you want your brother to watch her while you're away. Creepy and weird on both sides.  \n\nI really wish I knew the name so I could make a real ruling.", "ESH\n\nYou both sound completely insane.", "Maybe you guys should just each make a list with 3 names for each kid, and decide TOGETHER. Your original agreement is stupid af, it was bound to end this way.", "If the name is actually Neville then i think you're overthinking it. Names don't dictate a childs life. If he's a cool kid and everyone likes him they aren't gonna care his name is neville. Its not worth what you're putting yourself and your wife through.", "You agreement is dumb and you are childish.", "Yes, you are an asshole and so is your wife.  Stop this silly, childish behavior and act like adults.  You're about to be parents, you need to set a good example for your children and teach them how to resolve their conflicts sensibly.  You aren't off to a good start, and they aren't even born yet!\n\nYou should both agree on the names of your children. She can use her special character name for a pet or maybe as a middle name for your son if it's not too outrageous and you can live with it.  \n\nYou married this person and are starting a family with her.  You should both have more respect for each other.  There shouldn't be \"sides\" and threats of shenanigans in naming your children, that's just ridiculous.", "Ya'll obviously have much bigger issues here.  You might want to consider couples counseling.", "Bruh just give your son a nickname and piss off using his legal name. She gets her way you get to raise your son with a name you respect. Boom everyone happy. But I think both of yall need therapy...", ">For many couples, naming their children is a two yeses is a win, a single no cancels that choice.  You both should agree on the names.\n\nThis is the ONLY way. Bravo.", "THIIIIIIIIIIIIISSSSSSSSS.\n\nEven as a joke that’s psychotic.\n\nAlso, OP, you agreed to this blindly, that was your bad.", "Yeah I agree with this. Both my partner and I gave up some names we individually loved, because the other one didn’t feel them. Finally settled on one we both loved. Bonus is that our daughter (now 18) loves it too.\nI still sometimes look back on the vetoed names and think how good they were, but only with a slight sense of wistfulness. The absolute truth of the matter is that whatever you choose, your child soon inhabits the name and a) you can’t imagine having called them anything else; b) the child - not any other mental links - immediately becomes your primary association to that name.", "Yeah, and this is crazy escalation. They sound like characters on the Sopranos. OP, please settle down. This might be baby nerves turning you both into caricatures of yourselves, but this is not the way to approach this.", "They sound like me and my sister fighting about naming our dog... when I was 10 and she was 7.", "Right? These two are fucked and are about to fuck up 2 children and it has nothing to do with their names.", "Correct on all counts. They made a dumb deal to start. And the escalation is wild.", "This is exactly what I came to say! 👍👍", "Yeah, that last bit was far more concerning than the bad names.", "> two yeses is a win, a single no cancels that choice. \n\nThat's how we did it.  Spent weeks researching names, each came up with maybe 40 or more, I forget.  If we didn't both have the name on our list it was eliminated unless the other liked it but hadn't considered it before.  In the end we had maybe four or five names to discuss and are both very happy with what we chose.", "yeah... Glad this is top comment. I'd put ESH I think (regardless of the name) because the way this is going is how you end up single parents super quick. The two yes, one no method is the only way to get through this unless one is being overly obstinate and honestly they both are here based on the description.", "This is what we did.\n\nWhat they could do is write 10 names in their order of preference separately and see if one matches. If it doesn't, do this again", "Pregnant with twins here. I threaten it all the time. 20+ years married.\n\nAlthough mine is the opposite issue. I want my spouse to assist in naming the girls. I told him if he leaves it to me, one will be called Mary, and the other Jane - especially if he's not there for the birth. (I ofcourse won't do this). I am just pissed at his lack of participation. \n\nPregnancy, is not most woman's sanest period in life.", "> For many couples, naming their children is a two yeses is a win, a single no cancels that choice. You both should agree on the names.\n\nfor many couples, sure. but this couple made a specific agreement - she names the first son, he names the first daughter. that was the deal.\n\nshe's not picking a weird name, he's just wanting more control than he agreed to. he's threatened to weaponize his naming rights of his daughter. i would want to get away from this person when i delivered, too", "When I had a child with my ex-, we decided to make a list of names we liked and we had two rules for the list:\n\n1. No judgement. You can put any name you like on the list, and the other can't veto, approve, judge, or anything. Just let the list be.\n2. We'd wait until we met the person before we decided on the name. We've probably all met people with names that didn't seem to fit them, so why not spend a few hours getting to know this little person before tagging them for life? \n\nIt was one of the smarter things I've managed to do because once we met our girl, it was clear that she wasn't a few of the \"favorite\" names we had on the list. In the end, she was maybe the third or fourth favorite name on the list, and her middle name was up there, too.", "Agreed. OP even considering that his actions may lead to his wife taking off when he's away and feeling the need to have his brother spy on her is absolutely terrifying. I'm literally afraid for this woman. \n\nThe name issue is just window dressing. If either kid ends up hating their name, they can always change it or have people call them something else. Not even a name is set in stone.", "With baby names you both MUST agree on names.", "I like Megatron. It’s ~gender neutral~", "I got that reference! \n\nBasically, a guy was named Megatron and wanted to use his official name when they got married. The bride didn't want that, and a fight ensued. I wonder what happened to the couple.\n\nEdit: The guy's name was Optimus Prime, not Megatron", "Brb changing my daughter's name to Big Boss.", "Megatron, that's my people.", "Oh she won't take off, don't worry, he's got his brother keeping an eye on her ina totally normal and not at all controlling way.\n\nAbort or give up to adopt, neither of you should be raising kids", "And what he worries most is about the name, and not about not being there for her and the twins when she’s in labor. They’re so immature. Little do they know, naming is the least of their concerns.", "Yeah, I was thinking the name was Aragorn or something obviously from a book like that. I don't love Neville as a name, but it's not horrible.\n\nAnd yes, Neville is presented as hapless, but he also ends up being a hero. (30 y.o. spoiler alert!) That OP is this upset over this simple name says a lot. \n\nSo ESH but OP is the bigger A.", "I feel bad for any one named \"Neville\" in this thread.", "How in all that is good is it just \"Neville\"?? That's a normal ass name. Lile, the joke about the character (assuming HP) isn't that he's called Neville, it's that his last name is LONGBOTTOM, which, i assume, isn't their last name.", "Neville is a fine name, and a damn heroic character.", "No kidding. Neville is about equal to Luna. Theres actually nothing wrong with that name at all.", "YTA. Nothing wrong with Neville.", "In 11 years the book will be 40 years old.", "See, I thought of \"I Am Legend\", even though it's his surname.", "Kids will get teased for their name regardless of what it is.\n\nMy deadname was in the top 5 of the year I was born. People still found ways to mock it.", "Neville is not the typical name that would get someone bullied. At least not anymore. It got popular again since Harry Potter.", "Can’t believe I had to scroll this far to see someone point out that he’s likely going to miss the birth anyways since twins very often come early.  So, if he can’t get out of this work trip, then he’s running a REAL big risk of missing the birth.  I won’t call him the A H for that though because, if he’s in the US, paternity leave is still terrible, and he may not be in the position financially to say no to work if they require him to go on this trip (But I’m currently pregnant now with just one baby and asked my husband to be firm with work about no work trips for my entire last month of pregnancy just in case).", "If she’s threatening to take off, that tells me OP is likely very controlling. Especially since he asked his brother to try to stop her from escaping. \n\nAs for the business trip, depending on what he does for a living, he might not be able to simply not go, especially considering how expensive twins are.", "This right here. IDK why anyone would let a spouse just blindly choose a name of their child by themselves. I say you change the process to be more reasonable. Both out some ground rules, come up with lists, and talk about it like most other couples.", "The name the woman chose is Neville... A big tragedeigh... 🙄 Not.", "Err, the Vlademeer vs Vladimir is a debate about anglicizing the name. The former spelling is perfectly correct, albeit on the slightly rarer side.", "Hunter is a pretty damn common and normal name.", "Rose is also an older, \"classic\" name, so i think they pair well.\n\nfor all we know he's naming his daughter after a steven universe character. his attempt to renege on the name agreement is almost as dumb as the underlying name agreement was in the first place.", "Right?? I’m concerned that they’re going to be parents!", "Yeah that was fucking creepy", "Yeah. I think there's more to this story than OP is telling us.", "Right?! I would get him being mad if the name was Voldemort, Littlefinger or something like that, but he's just being a AH and breaking their agreement over nothing", " `Basically no name is safe against bullying.`\n\nThis.", ">It was a legit name before HP (Neville Chamberlain, anyone?)\n\nI don't know if you know who Neville Chamberlain was, but that's the **worst possible** association for a baby name to evoke. Much, much worse than an association with a Harry Potter character, which I do think is kind of cringy.", "I’m still stuck on the brother apparently agreeing to stalk his pregnant sister in law to make sure she doesn’t sneak off to give birth to baby Neville in privacy.  WTF even is this family where this is considered normal?", "Oh *fuck* no. Yeah, it’s a real name, but I’ve never met a single person actually named Neville. And it’s not like it’s from some obscure book, it’s from a franchise so popular the author can’t even kill it, despite her best attempts!\n\nIf OP doesn’t want his kid to get *mercilessly* bullied the second he reaches the grade Harry Potter is the same reading level as his classmates (grade 4-5?) he needs to put his foot down now.", "It's absolutely not normal. Especially if this is the US. I have literally never met anyone with that name and it just sounds bad.", "This is not a normal name. I agree with OP 100%. The name should not be what I loved growing up, but what is best for my kid. This is not best for the kid.", "It’s not a classic or normal name. It’s the name for the weird kid in every piece of media it’s been in", "Man I knew it was gonna be some Harry Potter shit.\n\nOP is still the asshole and Neville is a totally fine name, but why's it always gotta be Harry Potter.", "But what if the baby name is Longbottom instead? Like as a first name? There. No more issue.", "My stupid family for one. BIL and sis named their kids after 1 a dream he had and 2 the name of a random bird in another language. Those poor kids.", "My fiance and I did-- AFTER hearing what the chosen names were and agreeing on them. Making this kind of agreement without knowing the names first is just plain stupid.", "Turning it into a mexican standoff is ESH", "Only people I have know to do it wanted a junior, so they said mom names girls, dad names the boy.", "Megatron is technically a biblical name. You could be like these are our children: Mary, Mark, Simon, and Megatron.\n\nEDIT: Oops, it's Metatron! I was 1 letter off!", "Every name's gender neutral if you're brave enough 🤣", "Neville's better than what most celebrities and other idiots been naming their kids honestly... An old coworker of mine named their son 'Lennon', as in John Lennon, but the last name... In a non-English speaking country. :|\nNeville beats Lennon", "Right? Neville seems so mild to me, I was named Larry (pretransition) and that’s way worse than Neville lol. Even with a name like that, the worst I got were annoying “living like Larry” quips or being called Larry Bird/cable guy/the lobster. Even with how mean some kids can be, I was never actually bullied for my name.", "It's honestly a pretty cool name. Use the nickname Nev and that feels like a unique name that won't be the butt of any jokes.", "Neville absolutely is a joke name, at least in the U.S. I would never think of naming my child that after hearing all of the jokes in Elementary & Middle School.", "Nevel is a good “love to hate him” character. I always felt like he fit well as villain in the wacky world of iCarly. \n\n(Also I love that his actor, Reed Alexander, is a reporter at Insider and an adjunct professor of journalism. Something about former child actors that choose to go into other fields is so fascinating to me.)", "Henrietta Fugazinuts is punk af.", "Probably depends where you're from, I personally don't know anyone or know of anyone named Neville other than the one in Harry Potter.", "And we are still talking about them, there are still kids aged 11 in the book shops getting them. \n\nThe Lord of the Rings has been older than that when I first read it and years later someone turned Elijah Wood into Frodo Beggins :)", "I was teased because my name 'Jens' sounded close to a character 'Jenö' that was in a book we read at school. That character was a boy that secretly stole from his friends. Guess who got a rumor started about him secretly stealing stuff. My parents didn't know that book and even if they knew it was never a popular one.", "i got mocked for my surname so yeah kids win attack you for anything if they want to bully you.", "Leif is a common Scandinavian name and I wouldn’t think twice about it. Spelling the same as a tree leaf would be strange tho.", "if it's the scandinavian Leif, it wouldn't be pronounced leaf, but Lay-fh. It would be pronounced like [this](https://forvo.com/word/leif_silbersky/#sv) in swedish. But maybe they just liked shrubbery a lot and it really was Leaf", "Source? I've been scanning through the entire thread, and I can't find OP revealing the name anywhere. How does everyone here know it's Neville?\n\nEdit: Ah, [found it](https://www.reddit.com/r/AmItheAsshole/comments/15sptmy/comment/jwfi4fc/?context=1), buried under an avalanche of downvotes. Odd that was enough to make Q&A sort completely skip showing it.", "Hi Doctor Nick!", "Yeah, it does not bode well", "Voldemort littlefinger is a really good band name though.", "Yeah, Neville would not stand out in any of my kids' classrooms. Longbottom absolutely would.", "I would have relentlessly teased someone for being named Neville as a child. Unending.", "Kids will literally make fun of any name. Should my family change our last name because it rhymes with brat? Hell, theyll make fun of something even if its a stretch or their jokes don't make sense. Ever heard a kid tell a joke with no real punchline? They think they are hilarious.", "It doesn't matter. He hates the name. If he agreed to let her name him and yet still insisted on vetoing Neville anyway then he obviously feels very strongly about it. You shouldn't name your kid a name that the other parent hates that much. \n\nNTA", "Or Snivel", "I was thinking something from a high fantasy novel that just isn't a name irl.", "Neville Chamberlain comes immediately to mind, and I am not even British. Not that he is kindly remembered by history books, but if a man with that name can be a successful politician, then it can't be such a bad name.\n\n(Also, It's explained that Neville in that story turned insecure and clumsy because he was raised by a strict grandmother who never fully accepted the loss of her child's bright future and projected all the lost hopes on the boy. If the bad guy had made a different decision, he would have been the hero. So those who would bully the kid can be put back in their place easily..)\n\n(edited for a small clarification)", "When was he cowardly? At the end of the first book, Neville got the Griffendors over the top \"It's takes courage to stand up to our enemies, but even more to stand up to our friends.\" (I'm paraphrasing, but that's pretty close)\n\nHe was characterized as **looking like a loser to mean gross people** while actually being a quality guy.", "We were somewhat friends and I think his parents are just weird. Don’t think they’re Scandinavian, but who knows. Absolutely did see the spelling that way on everything, including our yearbook.\n\nBush’s family was first gen American so idk if the name meant something in their language and the translation just sucks.", "It was leaf, he pronounced it and spelled it that way, it’s just a bizarre name but he didn’t even get bullied. I only called them leafy bush bc Bush tutored like half of our class and so we were school friends.", "We did the two yes one no thing too with our three kids, with the exception that my first daughter was going to have Elizabeth as a middle name regardless (it has been passed down the maternal line for several generations now).  I did not want a junior and my husband really did, we compromised and named our son such that he has the same initials as my husband.\n\nOur third was the hardest to name and we also went through a ton of names before we agreed on one (though I realized after giving birth he kind of tricked me into naming him after his mother, but I'm not sure any other name would fit him).", "Neville killed Voldemort's snake; Harry killed Voldemort himself.", ">Very few people in the baby's peer group would have read Harry Potter and the character Neville in the end killed Voldemort.\n\nHard disagree. 1) They're going to do an HBO remake. HBO tends to do a good job on its shows, so I imagine this'll be pretty good. Which means plenty of people will watch. 2) Many teachers like using the Harry Potter series as a read aloud and many of my 4th & 5th grade students were reading the series these last two years.", "That's the female graph. Try the male graph: https://www.everything-birthday.com/name/m/neville", "You have that many babies you need a check list?", "LOL - so true.  I thought I was choosing a somewhat unusual yet not outlandish name for my son.  He went through his entire school years always with at least one if not two other boys with the same name.", "Totally agree with you. The amount of people who forget that they aren’t naming a cute little newborn, but an eventual adult blows my mind. We found a name for our little girl which will grown with her. It’s sounds sweet for a baby but will also be a respectable name when she is older. \n\nOn to the subject of OP your NTA. You should both agree to both a boys name and a girls name or come to a compromise. I have a boys name I love however my partner knew someone with that name who’s not the sort of person you want your child to share a name with, which total put him off. Therefore we compromise and found a similar name which we can use legally or as a nickname to the original. (Eg Oliver/Ollie)", ">The amount of grown adults pushing very recognizable names from their favorite fandoms onto their unborn kids still baffles me to this day.\n\nDude my dad wanted to name me Elvis, and my little sister Leia", "Middle name?  Dem", "Also, a lot of times Neville in the movies is called Longbottom (his surname). He is not a huge main character until the last bit and all the other kids are real shitty to him until the end.", "You were marked incorrect because you absolutely were incorrect, the idea that Chamberlain was to blame for the rise of Hitler is absurd and blatantly ignores the societal and political climates of the 1930s in the UK and France.\n\nThere isn't a village, town or city in the UK that didn't lose a portion of their young men in WW1, my own village which had a population of only a couple thousand before WW1 has a memorial to the 130 men who got sent to the fields of France and Belgium and died there.\n\nWhen I say there was no political or societal will in the UK or France to have another war with Germany I don't mean that it would have cost the respective governments a few percentage points in approval ratings... I mean they would have been strung up from the nearest lamppost for suggesting going to war preemptively to enforce a greater peace.\n\nAlmost everybody expected another long drawn out meatgrinder of a conflict in which millions more young men would be sent to die before one side gave up.\n\nThe British empire was losing its power as more colonies started demanding greater freedoms and it was still paying the economic cost of winning WW1. France wasn't much different.\n\nNot forgetting that the British armed forces were not equipped to take the fight to Germany.\n\nThere was 0 prospect of the UK and France attacking Germany.\n\nAnd keep in mind that 96% of the US public wanted nothing to do with another war in Europe before the war actually happened and then Japan attacked the USA. So there wasn't any belief that there was going to be international support for either the UK or France if they sought war.\n\nWhat Chamberlain was responsible for was getting the war time production kick started. He was not a moron that thought his wee slip of paper from Hitler was an iron clad guarantee of peace. He knew war was coming and he ordered the increase in weapon production that turned out to be crucial when the war did kick off because Britain had far more equipment than it would have done if he had have just sat back and figured peace had won out.\n\nSo when Churchill took over the UK was already pouring out thousands of tanks, fighters, bombers, ships, rifles, ammunition, shells etc.\n\nThe appetite to fight and do whatever it took to win was not a thing among the allied nations until after the war had already started.\n\nBlaming Chamberlain for Hitler is like blaming any current world leader for not invading China to stop the genocide of the Uighurs or not invading Russia to stop it attacking Ukraine.\n\nThere is simply no scenario in which Biden, Sunak, Scholz, Macron etc. Could possibly get public support for either action and doing so would topple their governments.", "I know people who split the name up by birth order. Mostly because the father wanted a junior, so first son was named by him. First daughter named by the mom. They had two kids (boy and a girl) and both were juniors in a sense. Both kids had the reverse of the parents name. The dad was Robert Peter so the kid was Peter Robert. Daughter was Grace Lynn while the mom was Lynn Grace. (Not real names, just examples.)", "I was thinking \"This is what happens when two process engineers get married and start a family.\"", "Is she Leslie Knope??", "My parents had my name ready, and then I was born on Christmas. So my mom said “what about Holly Noelle instead?” I Dad said “no, honey, that’s the drugs talking.”\n\n(I do like the names individually but both, together, on a Christmas baby? Just call the therapist now.)", "We’ve been pretty lucky. He loves his name, everyone who learns his name loves it , and he hasn’t met anyone with the same name. Now with our second on the way, we are hoping for a girl because we’ve had a name picked out for 7 years and we know it’ll be unique but normal sounding. We have a couple boy names picked that will be unique but i’m worried about being too unique and outlandish.", "It's Hattie, isn't it? Lol. That seems to be the name du jour that everyone thought wouldn't be common and no one would've considered 5 years ago. Suddenly it's adorable. Sometimes it's the kid that makes the name cute and changes its association forever.", "I think they were generally commenting on the irony of it when that does happen, not taking the mick out of you for your situation. It’s well worth the time and effort of finding the mutually agreed and perfect name, I bet it’s lovely!", "a friend's dad choose her name since she was his first daughter she ended up with his ex-girlfriend's name 💀", "\"stop trying to make Fletch happen!\"", "Thankfully enough people told her to stop making Fletch happen.", "I feel fucking terrible for the generation of girls that are going to grow up named Sansa, Daenarys, or Khaleesi.\n\nedit: \n\nafter looking at it [arya](https://www.everything-birthday.com/name/f/arya) is probably also fucked for the foreseeable future", "You mean little River Ocean Storm?", "Rifadan? Careful he also causes the following side effects:", "Bored.", "Unless you know a bunch of kids, it's hard to know what's popular for babies now (or unless you peruse r/namenerds lol)! Names that would be super uncommon to your generation might be the next big trend for babies.\n\nOld fashioned, classic names like Eleanor, Henry, Theodore are crazy popular for babies now!", "I fell in love with the name Ivy when I was 20 and moved to a city where ivy covers a lot of buildings, including my first apartment. Birds sat in it and sang outside my window. I thought I was so original. It's in the top fifty baby names! So much for that.", "You mean Mackaighleigh, Myckehnziye, and Mahdysyinn?", "Took me a second 🤣", "Baby names are so zeitgeisty anyway, even if you’re not following trends it’s hard not to unconsciously pick something that fits the time you’re living in.", "Such a pretty name though!!", "Also Lovecraft only became well-known after he died (in poverty because his writing didn't sell much) and that was mostly because his friends borrowed ideas from him and wrote them better...\n\nHe was a terrible writer with intriguing ideas he didn't have the skill to execute. Also, massively racist, classist, etc etc.\n\nSource: reading the complete collection of Lovecraft's stories and OOH Boy, do I want to rant about how bad it is every chance I get.\n\n\nAlso, Neville is a uncommon but normal name but ESH due to 2 yes, 1 no rule.", "I think it might be more that Neville fell *out* of popularity around WWII due to association with Neville Chamberlain, the British PM best-known for his policy of appeasing Hitler.", "You mean Na-A (Nadasha)", "This is why you don't marry Harry Potter people", "Don’t forget Renesme", "I agree, dumb mistake, but then for whatever reason OP agreed to this dumb rule and then tried to change.  I lean slightly more towards YTA for this - honor the agreements you made with your spouse.  Talk about it before acting like a baby then forcing her to retaliate in kind.  More probably going on here, but breaking the agreement by OP is the cause of this tangent in the bigger issue.", "… it’s just Neville? What the fuck OP? Your name comparison is so bad I’m concerned you have a damn brain tumor or something.", "Is Cormac considered an outrageous name? I’ve heard it a few times in the wild in Ireland and Scotland.\n\nHe’s a shit character though.", "Cormac is a much better name than Neville.", "It's always twins", "They could name him Neville and call him Nev, which I think is actually a pretty cool name.", "M'jacward \\*tips hat\\*", ">While I agree in general that Neville is a fine normal name, the 2 yes or it's a no rule still applies.\n\nTrue, but OP made it look like it was the most stupidest name out there. Which isn't the case at all.\n\nHowever, you are correct: their agreement is mind-blowingly stupid. It should always be 2 yesses and 1 no when naming your child", "This, first name Neville is fine, but longbottom would be a horrible middle name. Maybe op and wife can agree on an initial for the middle name like Ulysses S. Grant being S for both his grandpas.", "Yeah if OP is in the US everyone is going to think Harry Potter. UK not so much.", "You could’ve told me before I read this thread that Neville was name made up by Rowling and I would’ve believed you. Why would anyone who vaguely knows Neville Longbottom want to name their kid after him? He’s literally the butt of every joke. Poor guy will be only called longbottom and god help him if he’s clumsy", "I think before you make an agreement like that you need to know what the name is", "ngl, I did consider either \"Trouble\" or \"Danger\" as a middle name. But my partner vetoed both.", "Austin Danger Powers.", "There has to be reasonable limitations on any agreement though. If your partner says hey I know I agreed to this rule but I really, really, really hate that name, then why would you insist on it? Why would you want your child's father to hate your child's name?", "If I had kids, I wanted to name a girl Marcella, after one of my aunts. Love that name. Or Leslie— boy or girl for that one! Inadvertent cottagecore lol", ">The first Harry Potter book was published almost 30 years ago.\n\nWait-what?\n\n\\*checks colophon\\*\n\nThe hell you say!\n\n\\*drops monocle\\*\n\n\\*checks into nearest crypt\\*", "Sorry", "His poor daughters. Tragic fates the both of them.", "I don't understand wanting unique names.  When we named our child it was about finding the right one.  A name we thought sounded nice, and represented us as a family and our cultural backgrounds (Jewish and Haitian).  \n\nI don't think there is anyone out there with our child's specific full name (First Middle Last - though all three on their own aren't particularly uncommon in our respective communities) but if there were a thousand others with it I wouldn't care because it's still perfect (IMO) for them.  \n\nAnd as someone myself with a particularly uncommon name for an American (I have a Hebrew name with sounds not found in the English language) I haven't found it to be a positive or negative either way.", "I had a coworker who spent months picking out a name for their child, because dad was Steve and mom had an equally common name, with a common surname, and they didn't want that for their kid. Their final choice was Ariel. \n\nThe Little Mermaid came out a month after she was born.", "I can't imagine how hurtful it is to be introduced that way. 4 is plenty old enough to feel that dig every single time. Some one needs to pull mom aside and tell her it's time to let that go.", ">Neville is perfectly fine.\n\nUntil you get that one kid who is still really mad about British appeasement.", "Reminds me of something I read years and years ago about one particular couple who tried really hard to find baby names that their children couldn't be teased over. When their daughter was born, they decided to name her Amber, thinking that they had it covered. Upon introducing her to their young son however, the first thing out of his mouth was \"Hello, Amberger!\"\n\nWhere there's a child, there's a will and a way.", "Neville Neville, father of Gary and Phil Neville, premiership footballers.", "And Isabel's children as well. One locked up until forced into insanity, then executed on some pretext by the usurper Henry Tudor. the other executed for her son's actions in what some might call the final act of the Wars of the Roses. A horrible, painful, and botched execution at that.", "I knew a guy named Harry Head. He named his daughter Anita. I'm dead serious.", "Just be grateful they aren't doing it in Jira.", "When we were picking a name for oldest, husband suggested a name that is typically a nickname for the first name. I said we should probably go with the full version of the name and just call him by the nickname . Husband agreed to that  and to the name I suggested for the middle name.\n With second son I suggested two options for the first name. Husband did not like one of the options because he had known someone he hated that had that name so we went with the other one. Middle name was after my paternal grandfather and favorite uncle( both had passed). Husband was fine with that because it meant a lot to me.\n Our daughter was a bit different. On the way to the hospital we had a boy name ready but were still undecided on the three options we had narrowed it down to if the baby was a girl( we didn't know it was a girl at the time). So I said if it's  a girl and is born with blonde hair we choose A, dark hair B, and C if the hair is red. I didn't want B for blonde because a former neighbor's child with that name was a spoiled little brat. Husband agreed. \nOur baby girl was born with dark hair so B was the name. BUUUT the joke was on us because by the time she was a month or so old her hair was turning  blonde. Luckily she was not a brat. \n We knew our youngest was going to be a boy. I had had various combinations of 3 specific names in mind since daughter was born. We were discussing them when husband said he  didn't really like any of them anymore. The 3 older kids (16, 11, and 8 at the time)also didn't like them. While they didn't have a say in it we did rake their opinions into consideration.Husband suggested a name and the siblings all liked it and I only had to come up with a middle name that we all liked( or at least didn't hate). So, 5 people had input into naming the youngest.", "I called my youngest son a pretty traditional but not that common Scottish name in gaelic spelling. I knew one other person ever with that name and national register shows 6 other people with that name spelling since 1980… and now there will be another in his class 🤣 I actually thinking’s great. We‘re slowly bring the name back 👌🏼", "I had the same thing happen! For reference, my son's name is Luca. We used a name app where you swipe right or left on names because we had considered hundreds of names and couldn't agree.", "My son has a friend who has a first name Michael and last of ……. Hunt.  Like no one will ever abbreviate that one.", "For me it evokes the act of felching. (NSFW in case you have to Google it)\n\nBut that is only in the context of a reddit post about terrible baby names. Not really sure id go there if I came across the name in the wild. It evokes archery more than horrible sex acts for me. Which makes sense because it means arrowmaker.", "I know. I’m just enjoying how absolutely livid people are **about the name Neville** because it’s absolutely hilarious to me this is what has got Reddit’s knickers in a twist.\n\nGiving me hours of entertainment that Neville is more enraging than Portabella on AITA.", "The boys grew up to be the useless boyfriends/husbands you read about on ~~relationshipadvice~~  r/relationships", "How many kids do you need to have before you automate the process?", "Same here! I expected her to share her name with a few people's grandparents are great grandparents, but it has been really popular lately and so many people tell me that's their child or grandchild's name 🥲 Solidarity!", "I have a store I named after my grandfather…. It was supposed to be my middle name but things happened and it isn’t, so I used it for my store… right around that time, after never meeting a single person named Emerson (including my grandfather cuz he died when I was 3mo old) I have run into SO MANY of them, all under ten… Emerson, Emmerson, Emersyn… so many of my customers have grandkids with the same name as my store it’s kinda crazy… and of course, everyone thinks that’s my name too but frankly if they’d named me that in 1979 I’d have been bullied even more than I already was…", "We (UK) had a girl who’s surname was Ramsbottom and she was made fun of everyday by kids. It’s all well and good to say ‘but Longbottom is a normal historic name’ and great but we’re talking about 10 year olds here. They’re not gonna stop and think about the nuances and history of the name, they’re just gonna say ‘haha bottom funny’", "It's still never made it to the top 50, so I don't understand how there were 3 of them in a group of 30 kids. And half of those had the other gender's names, so I'm still...annoyed and amused, I guess.", "Even more hilarious - Elanor was my name pick for a girl, and my kid is a boy so he's named Theo 😂", "You probably wouldn't see a terrible lot of Boomers being named \"Neville\" because Neville Chamberlain was the British PM who advocated the doctrine of \"Appeasement\" towards Nazi Germany in the years leading up to WWII. \n\nSeeing how that turned out, not many people would have wanted to name their post-war baby boom children after the guy who caved to Hitler, unless they had a very compelling family reason to do so.", "Yeah naming is literally the first roadblock in creating a unified parenting front.  If you can’t even get past the first, almost easiest, obstacle then that does not bode well for when the actual parenting starts.\n\nFirm ESH.  Grow up and be partners.", "It should be *their* choice in name to begin with. OP is being an asshole in how he's responding to the situation. She's being an asshole by not trying to come up with a name that her partner won't hate. Even if she wanted the name \"Bobby\" and he hated it for whatever reason or OP wanted the name \"Alice\" and she hated it for whatever reason they shouldn't just go with those names just because of their dumb agreement. A child's name is too big of a decision to make without your partner's support", "Plus, as long as the middle name isn't Longbottom, Neville is nowhere near as bad as Hortencia whatever the third!", "Scrolled way too far to see this trip mentioned. Most twins are delivered about a month early. Even if he's adjusting for this fact when discussing the due date, he still shouldn't be taking any \"week long business trips\" in the third trimester with a high-risk pregnancy.\n\nThis will almost certainly be the most traumatic day of your wife's life. There's a non-zero chance she will *die* that day. There's an elevated risk your newborns will have complications. Attendance is non-negotiable. No business trip is more important than witnessing the birth of your child, and there is no business trip that you \"can't get out of.\"\n\nThe bigger issue here is that you two are not on the same team. If you can't figure out something as trivial and fun and easy as names without turning into petulant children, then good luck handling the daily grind of newborn twins as first-time parents. Your world and your relationship are about to be rocked to the core.", "What's wrong with Hunter?", "Wait your actual name is pandora? That’s so cool!!", "I know someone who named their kid Renesme 🫣", "I was expecting something like \"Sebastian Squire Senator\" or \"Marijuana Pepsi\".", "Right? I was expecting it  to be Reneesme or some sh*t. Hahaha. Neville is fine. Especially when all the people naming babies right now are millennials.", "i think of icarly personally", "Albus Severus as a name pisses me off to this day. Like could it be any worse? James Severus and Sirius Albus would have been immensely better.", "I've only ever read the name, maybe twice, but I grew up mostly in bland England, so have never met anyone named it. \n\nProperly shit character that one.", "I know the kid who was bullied using name Anna. You don't have to remind your husband that the kid will be bullied for the name , because he will or won't regardless", "Or Longbottom", "Oh good, my partner and I were the same and I was feeling a bit alone reading the comments! For me, the conversation was part of the wedding planning because no way did I want to wait until I was pregnant to find out I married a fool that would consider \"Horton Beerbong\" a contender for the children's name!", "Well it can’t be son Goku, he said it was lame", "I’m currently living in England right now haha. If a baby name doesn’t end in ‘ie’, it’s not a baby name!", "I think people do shit like this already have the minds made up, want to get their way, and hate compromise. So let’s make this frivolous, lovey-dovey agreement and then years from now one can stomp their feet because “but we AGREED!!” as if preferences and circumstances aren’t constantly changing (for most people. \n\nLike OPs wife. Dollars to donuts, she’s had this name in her mind *since childhood* and is absolutely, 100 percent, not giving it up. \n\nBest shot OP has is to start pitching nicknames out early and see what sticks.", "But Jane Danger is AWESOME!", "https://www.reddit.com/r/AmItheAsshole/comments/bjd41e/aita_for_throwing_away_my_boyfriends_potentially/?rdt=57215", "r/unexpectedfamilyguy", "Bro got cursed by Hermione and left on the common room floor presumably all night. \n\nDumbledore was wilding to get Gryffindor to win. That 10 points was a pity throw. Slytherin should've rioted over the steal.", "To someone outside of the UK, it sounds like you just walked through the setup to some Monty Python sketch.", "\"Appeased anyone today, *Neville?*\" \"How's that 'peace in our time' working out, *Neville?*\"\n\n\"Cruella Ne-Ville\"\n\nThat's all I got.", "Neville as surname is quite common though. Fun fact British footballer Gary Neville's father was called Neville Neville", "The only proper use for a question like that is to just make sure the kids are able to form an articulated position and defend it.  Whether or not it is “correct” should not be the focus, especially when it’s such a loaded question. \n\nGermany is obviously the intended “right” answer, but you could say any of the countries that forced the Treaty of Versailles have responsibility.\n\nIs Japan “at fault” because they started aggression in Manchuria earlier than Germany started their aggression in the west?\n\nWhat does “at fault” mean?  It’s a bad exercise if the teacher is punishing students for answers like yours, as long as they aren’t just intended to be contrarian.", "\nI know someone close to my age (born between 1987-1990, don't remember exactly) whose mother picked a name from an Australian movie she watched, where a character had a lovely name she'd never heard before, but was easily spelled and pronounced. Wonderful, her daughter would have such a unique name, right?\n\nThe name is Megan.", "I don’t understand why people care if another kid is named the same as their kid. No kid when I was growing up wanted a weird name nobody had ever heard of.", "I'm so worried for all the Khaleesi once they hit school. LOL", "I couldn't have written this reply! 🤣 I'm trying to not let it get to me, but I am worried my daughter is going to end up sharing her name with a few others when she starts going to school 🙃 I'd never met anyone with her name until after I had her, so I thought it was really unique 🥲", "My SIL had the same thing with all her kids. Her kid’s names aren’t weird, they were just uncommon until the years they were born lol. Her sons have other kids in their class with the same names, her daughter has 2 kids in her class with the same name, and she lost a friend because she “stole” their baby name when she didn’t even know they were considering it.", "So true! When we had our son, we had a boy and a girl name picked out. We hadn't ever heard our sons name in the wild but when he started school, he was not the only one with that name and it became more popular in the next few years. Same with the girl name. 6 yrs after our son, we had our daughter and we couldn't find another name we liked, so we used the name we had picked for our son if he had been a girl. When she started kindergarten, there were quite a few kids named the same. 😄", "I ended up vetoing a name my mom wanted for my little sister, when I was four. Not-Laramie thanked me, when I told her what she could have been called.", "We called him, \"Nick the prick\", not \"Nick the dick\".  He was a supervisor & we damn near called him that to his face because he looked down our shirts & basically was an ugly prick.", "In middle school, someone came up with a nasty rhyme for my middle name \"Lu\".  50 years later, I've never repeated it and the rhyme comes easily to my mind.  I wasn't particularly bullied, but kids will do what they do.   Best to teach kids not to give the bully what they want, which is generally to get hurt and upset.", "I want to agree with everything you said, but a couple small points (please note that I don’t think either of these are justification for Neville deserving to be bullied):\n\n1- “quite skillful” is a stretch, especially if you’re focusing on the early books before we see much Herbology. Neville was notoriously bad at every subject, forgot things all the time (hence the “remembrall” incident), couldn’t do the simplest spells like expelliarmus until 5th year, etc. People made fun of him for being almost a squib\n\n2- I’m pretty sure his gran was a stern, slightly terrifying person who also was tough on him for the squibness? It’s been a long time since I read the books, but I don’t recall any doting grandmother affection… 😬", "I was 15, 6 foot 5 250 pounds and sleeping in the bunkbed my parents bought when I was four. When my parents got a new bed, my 5 foot tall sister got their queen bed. Their reasoning was that they did not want my normal sized for a 12 year-old brother to be upset that I had a bigger bed than him.\n\n\n\n\nTrick is on them though... I still haven't forgiven them for it in over 30 years.", "I feel more sorry for the women around those men when they grow up 😔", "Nah they probably are all royally fucked. Too much discipline, especially given unevenly like that, is horrendous for your identity development", "We went for a name that was uncommon, but pretty. Easy to pronounce. It was the name of a writer I admire, and from one of the languages I studied in college. Then we had her and realized it was also the name of a Disney character. (Facepalm!)  Still a lovely name, but it's gotten much more popular in the last 15 years, from in the 400s on the Social Security list to the top 50, currently.", "Just wanted to share something I’ve read about Neville’s skill. He used his father’s wand until it was broken in the fight at the ministry of magic, and then once he got a new one that actually chose him he was able to much stronger magic.", "Thank god my little mesothelioma won't have problems like that", "About twenty years ago I had a friend who wouldn't tell anyone the name they had picked, and then when the baby was born they were so proud of the incredibly unusual name they picked: Chloe. I was like, *uh....*  And then realized they'd figure it out soon enough.", "It actually was the name of my great grandparent and my husband's grandparent!", "Lovecraft is super famous and credited with helping create modern American horror now, but really only got famous after his death. Also, disgust at his views is relatively recent as during his lifetime and for decades afterwards racism was supported by the law.", "I was quite pleased with myself!"]}