{"id": 248, "submission_id": "yivoo5", "title": "AITA for arguing with my cousin over a milk bottle?", "selftext": "Just a little background info i will provide:\n\nMy cousin has been living with us for a year or 2, she shares a room with me and my younger brother who is still a baby, i do the babysitting, chores even the cooking and cleaning.\n\nI don't give her any task due to an issue i encountered with her mom a year ago, apparently she wants her daughter well, not to do much housework and all and got angry at me for giving my cousin a few light tasks for the day.\n\nSo i stopped bothering my cousin about the house work and stuff, even with her not helping much, shes a bit messy and often leave her stuffs lying around which results to my brother accidentally eating some of it like the one time she left her cleanser at the table where my brother can reach it and spilled the whole bottle, which my brother had ingested some of it, he later had allergies and was taken to the hospital, she was not scolded and she gotten away fairly easy which goes like \"oh just don't do it again just a small mistake\".\n\nThis happened a couple times in the past but when it does happen to me i get harshly scolded by my parents and creating a big argument. I noticed the favoritism that my mom and aunt has for my cousin, they often blame me for mistakes, even the ones that my cousin did. This caused a strain in my relationship with them, im always careful being around them and all just to prevent a big argument.\n\n\nFast forward to the present problem now, i woke up to my aunt, mom and cousin arguing in the room, turns out my cousin refuses to make my brother some milk, my mom starts talking sarcastically at me so i just made the milk myself and removed the camera they were using to watch us in the room because it's making me irritated and felt zero privacy.\n\nAfter using our bathroom downstairs i questioned my cousin as to why she didn't make the milk because she was already awake and was refusing to do it herself, she gave me a few short responses which was she already made my brother milk and started ignoring me, when i checked the bottle the it was already empty that's why my aunt and mom was insisting my cousin on giving my brother another milk.\n\nThis angered as i was tired from yesterday because i do most of the housework and had to stay up late at night to help my dad with his report so i really needed the sleep, she called my mom and aunt after that and i do not know what other things she said which made my mom mad, after my mom came home she pointed how it was my fault and how i was being an irresponsible sister for not waking up early. \n\nI said to her that the bottles were prepared and already had water in them she just need to put the formula and shake it and just give it to my brother because i was resting and had a tiring night, this didn't budge her and walked out on me not before scolding me for the last time.\n\nSorry for any wrong grammar english is not my first language, AITA for reacting that way? I do know that it isn't her responsibility but i expected a little consideration from her..", "created_utc": 1667267978, "permalink": "/r/AmItheAsshole/comments/yivoo5/aita_for_arguing_with_my_cousin_over_a_milk_bottle/", "score": 3, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I do know that it isn't her responsibility but i expected a little consideration from her, maybe that itself will make me an asshole\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA AT ALL! You are working so hard, and your cousin is not pulling her weight. I cant offer much advice, so Ill just make sure to engage with this so more experienced people can give you a hand. You are working way too hard for an emotionally abusive family, you should not be the one waking up earlier to prepare a simple shake bottle, if the adults were already awake they should be doing it, heck even your cousin.", "NTA. Your family is taking advantage of you. You are being forced to be a parent, sibling, cousin and yourself at the same time. By the way your family is acting, I honestly don’t know if you would be able to reason with them. I would honestly work hard, get to college like you mentioned in your comment, and do what you can to separate yourself from that toxic environment. You are not responsible for other people’s choices and deserve to live your own life.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nJust a little background info i will provide: My cousin has been living with us for a year or 2, she shares a room with me and my younger brother who is still a baby, i do the housework mostly even the cooking and cleaning. I don't give her any task due to an issue i encountered with her mom a year ago, apparently she wants her daughter well, not to do much housework and all and got angry at me for giving my cousin a few light tasks for the day. So i stopped bothering my cousin about the house work and stuff, even with her not helping much, shes a bit messy and often leave her stuffs lying around which results to my brother accidentally eating some of it like the one time she left her cleanser at the table where my brother can reach it and spilled the whole bottle, which my brother had ingested some of it, he later had allergies and was taken to the hospital, she was not scolded and she gotten away fairly easy which goes like \"oh just don't do it again just a small mistake\". This happened a couple times in the past but when it does happen to me i get harshly scolded by my parents and creating a big argument. I noticed the favoritism that my mom and aunt has for my cousin, they often blame me for mistakes, even the ones that my cousin did. This caused a strain in my relationship with them, im always careful being around them and all just to prevent a big argument.\n\nFast forward to the present problem now, i woke up to my aunt, mom and cousin arguing in the room, turns out my cousin refuses to make my brother some milk, my mom starts talking sarcastically at me so i just made the milk myself and removed the camera they were using to watch us in the room because it's making me irritated and felt zero privacy, after using our bathroom downstairs i questioned my cousin as to why she didn't make the milk because she was already awake and was refusing to do it herself, she gave me a few short responses which was she already made my brother milk and started ignoring me, when i checked the bottle the it was already empty that's why my aunt and mom was insisting my cousin on giving my brother another milk, this angered as i was tired from yesterday because i do most of the housework and had to stay up late at night to help my dad with his report so i really needed the sleep, she called my mom and aunt after that and i do not know what other things she said which made my mom mad, after my mom came home she pointed how it was my fault and how i was being an irresponsible sister for not waking up early. I said to her that the bottles were prepared and already had water in them she just need to put the formula and shake it and just give it to my brother because i was resting and had a tiring night, this didn't budge her and walked out on me not before scolding me for the last time. Sorry for any wrong grammar english is not my first language, AITA for reacting that way?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH, you are mad at your cousin for not doing something your parents should be doing.", "Tysm man i really needed this,  people around me keeps blaming me and it makes me wonder if im really a bad person or is it because they don't want to take responsibility from their actions? Im almost near from having my own life as i am already on my last senior year, just another few months left soon ill be in college. Really appreciate your positive post man have a good day :D", "Yeah man but even if i graduate and have a job they said that i would have to pay their mortgage, which wouldn't be mine but would go to my brother instead. So i would be paying for a property that doesn't even belong to me. I can't really reason with them because they don't really listen to my side of the story so i always end up being the scapegoat for their mistakes, honestly I've been considering just being off radar and having my own life instead and not having to burden myself with other peoples responsibilities. Thank you so much for responding man, really means alot to me and helps me through the day :D", "The reason why my cousin lives with us is because her mother can't take care of her, the reason why i take care of my brother is because both of my parents have full time jobs. The reason why mad at her is because since we are the only ones left in the house, we both should work together doing chores and other stuffs. The problem is she doesn't do any of those and refuses to do so, so i end up taking all of the responsibilities at home such as cooking, babysitting and doing chores because if i do give her own set of tasks she'll report me to her mom because she doesn't want too and ill end up being scolded because of her daughter's laziness. So what i am asking to her is to give me some time to rest. I've already prepared the milk bottles, she just have to put the formula in, shake and it's done. I've already got my hands full, multitasking between being a senior high student, a parent to my younger brother, and also a caretaker to my cousin. Is it wrong to ask for a small favor just to get some rest?", "They can’t force you to pay the mortgage. And don’t ever let them make you think that. They can guilt you all day long, but legally you are not required to pay. Honestly, try your best to separate yourself and live your own life. You deserve that.", "I still wanna help my family even though my mom treats me like shit, my dad is alright but i still need to think about my future plans. I wanna live my life too and do what makes me happy. Thanks for the advice man, as of now my mind is a bit blurry and I can't think too clearly. Maybe I'll respond again when i finally calmed down. Thanks again man :D", "Why are you the babysitter and the maid?! \nYou should be living on your own if you can afford to, let your cousin be the babysitter.  It’s not your Job to take care of the entire family, you are not the Mom!"]}