{"id": 24979, "submission_id": "15v1v10", "title": "AITA for implying my girlfriend lied about a wedding invite?", "selftext": "My (25m) girlfriend Melody (32f) of four years was invited to a destination wedding for one of her coworkers. With the flying in/out and the actual wedding festivites it'll be about a 3 day event. \n\n\nA few months back while booking her flight, she told me as her coworkers had never met me, I wasn't invited. I was a little bummed as I would've loved a vacation with Melody but I understood. \n\n\nCut to two months ago, Melody and I were cuddled up on the couch watching a movie when she got a call from an unknown number and left the room. I couldn't make out exactly what she was saying but she was definitely talking about the wedding. She was very quiet and cold to me for the remainder of the night. \n\n\nNow, she's about to leave for the wedding. Things have been tense these past few weeks, so I decided to do her laundry for her so she wouldn't have to do it when she got back. In one of her drawers there was a pile of papers and folders. I know I shouldn't have but I leafed through it and found the wedding invite addressed to Melody plus guest. \n\n\nI brought it up as soon as she got home, asking why she lied to me about the wedding. She snapped at me and asked me why I would snoop through her drawers and if I'm seriously trying to accuse her of being unfaithful. She called me insecure and annoying and told me she simply wanted to go to the wedding alone. She then told me to leave her be and we haven't spoken since. \n\n\nNow I don't mean to sound anxious but ever since the wedding plans she's been distant and very cagey about her phone. I let my imagination get the best of me and I'm worried I permanently fucked up the level of trust in our relationship. \n\n\nAITA?", "created_utc": 1692406533, "permalink": "/r/AmItheAsshole/comments/15v1v10/aita_for_implying_my_girlfriend_lied_about_a/", "score": 847, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be TA because I went through my girlfriends stuff and indirectly accused her of infidelity even though I had no reason to.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - Bro, you asked about lying about the wedding and she jumped to you accusing her of cheating? That's not a good sign.", "NTA. Regardless of whether or not she’s cheating, you two need to part ways. You’ve been together for 4 years, and she didn’t feel the need to include you in a friend’s wedding AND a vacation! Dude, she doesn’t want to be with you, move on.", "NTA- It's funny how the first thing she says when you ask why she lied and she says you are accusing her of being unfaithful.  She just told on her self. She is cheating on you.", "NTA \n\nOP this is the type of relationship not worth exploring further if your girlfriend went to many lengths to lie to you. Your suspicions are valid since it appears she has checked out of the relationship months ago.", "NTA, but she’s cheating on you bro", "NTA\n\nIt doesn't really matter her motive. She told you that you weren't invited, and technically you weren't, but she made you think that she couldn't bring you, and that it was because they didn't know you. In my opinion, that's a lie. In fact, she did it because either she's embarrassed to be dating someone so much younger than her (still a thing for older women/younger men sadly) or she actually is cheating on you. I'd lean towards the former, but she's not making it easy by going on the defensive instead of apologizing for lying to you.", "My man, why are you staying in this relationship? She clearly is not into it or is up to no good. Get your affairs in order, find somewhere else to live, and move out. \n\nNTA.", "NTA\n\nThis is cheating behavior", "INFO: did you imply she was cheating on you when you asked about the wedding, or did you simply ask why she lied about having a plus one?", "NTA\n\nShe wanted to cheat probably. But even if not she is a liar.\n\nDon’t ever share your life with a liar .", "NTA.\n\nSo you called her out on lying to you about the invite, and then she brought up cheating *on her own*?\n\nI'm sorry dude...", "NTAH  and she’s most likely cheating. Just move on and stop wasting your time", "Either way, she’s a liar. That’s kind of a deal breaker…", "NTA but 25 and 32? And you’ve been together for four years? That’s a little iffy. You guys are at very different places in your life and have been for your whole relationship.", "NTA. She may not be cheating but your relationship is done when she's acting this way.", "You didn't ruin the level of trust in the relationship- she did. If she wanted to go alone, she could have easily said that. She instead lied about that. She lied to you. When you know someone has been lying to you, trust the fact that they can't be fully trusted. Know that they don't value you enough to tell you the truth.\n\nNTA", "She lied.  \n\nAssuming the best, she wanted to go to the wedding alone.  Fine, but why would she lie about the invite? Why couldn't she communicate with you about it?\n\nAssuming the middle ground, she maybe went a with another friend or something, but again, why lie about it?\n\nAssuming the worst, she went with another romantic partner. \n\nNo matter how you look at it, she lied or at least was unable to communicate openly with you.\n\nThese are the death signs of a relationship.\n\nNTA", "She's cheating. Sorry. \nNTA but she's wrong for what she's doing to you.", "OP, does she invite you with her if she goes out with friends or coworkers?  How’s the bills split?", "NTA. Cheating or not, no bueno. You should probably prepare for this relationship to end", "NTA\n\nShe is projecting.   She has plans for the wedding and they do not include you.\n\nStart figuring out your exit plan.", "She wouldn't be guarding her phone if she wasn't hiding anything.\n\nJust break up with her. Don't let her do you like this.\n\nNTA", "Oh, Aggressive Error. It doesn't matter if she's cheating.", "NTA  She may not be cheating on you yet but she's planning on it at the wedding. Can you hire a private detective to go to same resort as wedding?", "No. U are smart and intuitive", "My guess is that she is not the only coworker who was invited, I’m guessing it’s a single guy. I’m sorry, she is cheating on you.", "NTA she is cheating on you.", "NTA- she’s cheating", "Dude she’s cheating on you for sure, prob with someone at her work. Leave her and don’t look back.", "NTA time for you to bail. Find someone who actually wants to be with you because she doesn't seem to.", "NTA. She went straight to cheating, so odds are she was most definitely cheating on you. \n\n And even if she wasn’t cheating she was straight up lying.\n\nNot dating material in that one. Id be getting a full std panel done if I were you just in case, and be packing either her or my own luggage.", "Probably has a coworker she wants", "NTA\n\nShe said you were accusing her of cheating (despite you not doing that) because she's cheating on you boss.\n\nBest figure out what shes doing on her phone, then end it.", "NTA. I think she did take a +1, but it wasn't you.", "Cheating or not, after a 4-year relationship she should be able to say, “I really want to go to this by myself”. Honest communication is key, and outright lying is unacceptable.", "NTA. You didn't fuck up the level of trust in your relationship -- she did, by hiding the fact that the wedding invitation included a +1.", "She is going with someone else as her guest.  Not you.", "NTA\n\n**She is taking a guest and it is NOT you!**  I don't know your living situation (i.e. renting, apartment or house; mortgage; who is paying the rent, who is on the lease, etc)...when she is gone, pack your things and move out or pack her things and put them in a storage unit with 1 month paid...change the locks...", "NAH but I’m gonna say she’s probably cheating on you. Her actions are not normal -if I was in a happy relationship I would not want to leave my partner for 3 days when he could totally come", "Change the locks", "NAH you haven’t ruined anything and if she does break up with you over this then she’s not worth it", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (25m) girlfriend Melody (32f) of four years was invited to a destination wedding for one of her coworkers. With the flying in/out and the actual wedding festivites it'll be about a 3 day event. \n\n\nA few months back while booking her flight, she told me as her coworkers had never met me, I wasn't invited. I was a little bummed as I would've loved a vacation with Melody but I understood. \n\n\nCut to two months ago, Melody and I were cuddled up on the couch watching a movie when she got a call from an unknown number and left the room. I couldn't make out exactly what she was saying but she was definitely talking about the wedding. She was very quiet and cold to me for the remainder of the night. \n\n\nNow, she's about to leave for the wedding. Things have been tense these past few weeks, so I decided to do her laundry for her so she wouldn't have to do it when she got back. In one of her drawers there was a pile of papers and folders. I know I shouldn't have but I leafed through it and found the wedding invite addressed to Melody plus guest. \n\n\nI brought it up as soon as she got home, asking why she lied to me about the wedding. She snapped at me and asked me why I would snoop through her drawers and if I'm seriously trying to accuse her of being unfaithful. She called me insecure and annoying and told me she simply wanted to go to the wedding alone. She then told me to leave her be and we haven't spoken since. \n\n\nNow I don't mean to sound anxious but ever since the wedding plans she's been distant and very cagey about her phone. I let my imagination get the best of me and I'm worried I permanently fucked up the level of trust in our relationship. \n\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "How so?", "Maybe you should just casually “show up” to this weekend. Under the guise for romance. I’m almost certain you will discover the truth. Whatever that may be. NTA", "[removed]", "Hold that red Flag as you are going into Battle..NTA", "NTA.\n\nShe wants to take her lover to the wedding. That’s why she didn’t tell you she could bring a plus one.", "NTA. This is really suspicious behaviour.  I'm sorry but I would be using the 3 days away to pack my things and leave.  I think there is somebody else in the mix.", "Dude, you did not fuck up the level of trust. She did. She's acting a lot like a person who cheats, or is about to, acts. Projecting it back onto you, saying you're insecure because you are picking up on obvious clues is classic cheater bullshit. \n\n*Perhaps* she isn't cheating, but she isn't being honest, and that is something that needs investigation and a serious conversation.\n\nNTA", "NTA. a guilty conscience always wins. she literally confessed to cheating without you even asking her.", "Run 🏃‍♂️", "INFO: She asked if you’re seriously trying to accuse her of being unfaithful. Did you accuse her of being unfaithful? Or say anything that could have been construed that way even remotely?", "Try dating someone your own age next time my guy. You are still so young and there are plenty of other people out there.", "She cheated.  She immediately went to cheating.   She probably is hooking up with a co worker at the destination", "NTA your brain is trying to tell you something is up. Maybe she is planning on leaving you or maybe she is cheating. Figure it out", "NTA! Run away bro. You're not even in your prime yet, don't waste anymore of your 20s with this woman. Move on and have fun.", "NTA. You didn't mess up your relationship, she did. I'm sorry, but the situation does not look good.\n\nIf she really just wanted to go by herself, she would have told you upfront. Unless the conversation went: \"Hey, why did you lie about the invitation to the wedding? Are you cheating on me?\" then, her immediately jumping to you're accusing her of cheating, is a sign of...her cheating.\n\nMy recommendation is to make sure all your stuff is gone, and the landlord knows she's now responsible for the full rent. Or, if it's your house, contact an attorney for advice on the tenancy/ownership issue.", "NTA. She’s cheating. Cut her loose.", "You're single, buddy. I hope you figure it out sooner rather than later.", "Why are you dating a woman in her.mid 30s?", "You’re not the A H about the issue, but you are about snooping", "NTA, there’s a huge chance that there’s somebody she wanted to get with at the wedding.", "NTA - If she’s not cheating, she doesn’t want to spend time with you. This is not the relationship for you.", "NTA. Trust your gut.", "Dude. You ain’t her plus one anymore.", "She’s 32 and still can’t openly communicate she just wants to vacation alone? She is definitely meeting someone there by the way. So she lied about the invite and didn’t want to bring you to the wedding or on a vacation & can’t communicate with you & then jumps to you making a big deal and she won’t cheat, which is gaslighting you. The writing is there, you need to leave with your head held high and don’t let her manipulate you even more. She is cheating on you, just dump her and move on. You got this and deserve better.", "You’re definitely NTA bro you obviously have an uneasy feeling about your relationship and it’s her duty as your partner to explain things to you and give you reassurance. Definitely something strange going on with her and I think you should take the time while she’s away to spend some time with yourself and think about possibly ending the relationship because it doesn’t sound too healthy. Much love and good luck bro hope it all works out for you", "NTA", "Leave her and move on. She does not value you or respect you, and she is a liar. Maybe not a cheater, but definitely a liar.", "You're not the arsehole.\n\nYou are however probably single, just that you've not yet been told.", "NTA,  I guess, but it doesn't sound like you actually implied she cheated? You are accepting an enormous amount of guilt in a situation where your gravest sin seems to be letting your anxiety get the best of you, but you screwing up doesn't absolve her of anything. \nI think you really need to consider that even if she has been faithful to you, she has handled every step of this wrong. She lied to you, she hid things from you, then she snapped at and insulted you. If I were you I'd take the three days and consider if it's worth it. There is certainly no shame in saying you don't deserve to be treated this way by your partner.", "Ha, I found receipts when doing my ex husband's laundry. I asked why he had spent so much money at a pizza place. He got mad at me for snooping.\n\nHe was cheating on me. And had taken his side chick out for *pizza* of all things.\n\nAll you did was laundry. NTA.", "Nta. She lied. Wonder what else she's lying about. I'd become a detective. Sorry. That's shady", "NTA\n\nBruh, she's definitely cheating.  She has another man that is her side piece that she is taking with her.  That man is soon to be the main piece.", "Every accusation is a confession.", "GF might be projecting... maybe she's not going alone, but with someone else.", "OP, you need to have a serious conversation with her before she goes and get on the same page. Is she cheating on you? Is she done with the relationship? What's going on? You deserve to know. If she doesn't care enough to talk to you about it, maybe you should be moved out and living elsewhere when she gets back.\n\nSeriously though, she lied to you about a trip, is acting cagey over her phone, is acting distant, and wanted to go on the trip alone. All logic says either a) she has someone she's planning to cheat on you with, b) she's done with the relationship but doesn't want you to know until she's back from the trip.\n\nI can't think of another option.", "I didn’t even think about that part. Four years and she didn’t want to include him as a plus one. That’s not a good sign. Lol.", "“Did you go out to lunch today? I stopped by because I needed the spare house key.”\n“I’m not cheating on you! Why would you stop by my office?”", "It definitely looks like cheating but I have to wonder if there's a possibility it's about money? Would she have had to pay for the entire trip for them both? Either way she definitely is checked out for one reason or another. \n\nNTA.", "I didn’t think cheating right off but could be.  I think she’s embarrassed of him for some reason.", "I have no idea why you lean towards the former. When OP found out the truth, her immediate response was, “I am not cheating.” Not sure why she would do that if it is simply a matter of being embarrassed due to age difference.", "\nI’m guessing here from watching my very beautiful, attractive, previous friends, and how they treated their boyfriends. My friends were a 9/10.  They always picked unattractive boyfriends because they could use them. They weren’t controlling this was back in the 90s when we were teenagers. They’d pay for everything. They would drive them around and never invite them anywhere .to edit I’m not saying you’re unattractive OP at her age she should be choosing partners by their personality not looks.\nAlso some women never learn how to not be mean girls and mature.", "I'm not going to lie, cheating has been on my mind because of how checked out she's been recently, but I definitely didn't mean to convey that to her at all. I want to believe she isn't cheating and I didn't ask her if she was", "Do you mean NTA? Because N A H means no aholes", "Why?", "Nothing wrong with having time apart that’s not an issue. However I feel the fact she jumped to the cheating conclusion is very telling.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yep. She’s definitely not going alone.", "If I were the boyfriend in that situation I would have offered to pay my way, but of course she never gave him the chance.", "OP admitted in another comment that he does suspect her of cheating and that accusation might e leaked out *unintentionally* when he confronted her. So it doesn’t really sound like her defensiveness came out of no where. \n\nEither way, cheating or not, she still lied tho.", "I lean towards the former because he sounded like he thought she was cheating on him from the very beginning and it's quite possible that he's possessive of her which explains not trusting her and going through her things. I doubt it's the first time he's done that.", "NTA. Why would she just go saying you were implying she was cheating? Only a cheater would do that. A innocent personwould say they just wanted to go by themselves. She did lie. She told you you weren’t invited. Since you have been dating for 4 years her coworkers have to know that you are together and you were supposed to be the plus 1. While she is gone you should decide if you want to waste anymore time on someone who lies.", "Pretty certain she’s cheating dude. Sorry", "She probably is. \n\nThis isn't a normal reaction.", "She’s mad because her friend got married and you haven’t thought of proposing.", "Then guilty conscious on her part it sounds like.", "Because she lied. She doesn’t even want to be with you. Why would you be with her?", "You can't talk to her. You aren't open about things that couples should be open about.\n\n She's taking strange calls and not talking to you about it afterwards? Why *wouldn't* that be something you talk about?\n\nYou've been together 4 years, your relationship should be strong enough that you can talk about things that make you uncomfortable. \"Hey, you've been acting really strange about your phone, what's going on?\"\n\nWhy are you accepting this as what you deserve? Why are you letting yourself stoop to snooping rather than talking to her? If you don't feel safe talking to her about things, why are you in a relationship?\n\nA good therapist can help you through this next chapter. You deserve better than what she's been giving you. She lied, she had a plus 1. Who did she use it on?", "EXTREMELY telling. And being so secretive about the whole thing.", "Same, but I'm also thinking of an ex of my own who was slightly younger than me and expected me to pay for everything. I did actually take a vacation without him at one point, nothing shady, he couldn't afford it even though it was a low budget backpacking trip so I went alone and had a wonderful time. The money thing just added up over time making me see that the relationship just wasn't going to work out. So totally going on my own experience here but it was just a thought.", "Mad? Dude wtf. That does not warrant being cold and checked out in a relationship. While also being in a hush hush call and vacationing without even bringing him", "Four years. I really thought this too.", "Yeah he is only 25. She is 32. So 4 years to a 25 year old is not that long these days. The average age of marriage for guys is 29. Meanwhile the average age for women is 27..", "Still doesnt warrant or justify the behaviour", "No argument here. If she wants to get married, say something. That she is willing lie about OP being invited shows immaturity and childish short sightedness. She takes him to the work Christmas party, or they bump into a coworker at Walmart “sucks, you missed the wedding dude!”\nThey really need to end this.", "NTA. If she isn't already cheating on you, she was definitely going to at the wedding.", "Frankly, I find it odd not to go with a partner to a destination wedding. Whom to share a room with? Is the wedding fully paid by the coworker?", "NTA - What the hell? Who does that? You need a sit down to get to the bottom of what is going on with her. She honestly expects you to put up with this kind of treatment? I can assure you, if it was happening to her, she wouldn’t. Turn it back on her!", "Nta. She lied to you and you’re worried about breaking the trust.  Things like this show you that she’s not the one. Better to know now", "NTA- you need to get yourself prepared for her to say that this relationship has run its course and it’s time to move on.", "NTA", "If you aren't convinced to already leave this relationship you should surprise her by flying to the destination.  It's almost certain she's going with someone, but on the odd chance she's not, you could just say you wanted to surprise her.\n\nBut between the sketchy behavior, lying, etc don't for a second think that you are the problem here.", "OP, I would swing by her work once she’s left. Leave her flowers there or something sweet, but something that will be very telling to all her coworkers that she had a BF at home while she also had a date to the wedding, because she’s straight up cheating on you bro. NTA", "NTA\n\nShe wouldn't have been an AH if she had said months ago \"hey its going to be all work people, I really just feel like it'd be easier to do this solo, it's going to be draining for me. Fun I'm sure, but also I'm going to need to be 'on' because it's colleagues.\" \n\nBut she didn't. She lied. And suddenly she's cagey about it?\n\nWhatever is going on, she's not behavioring fairly or kindly to you.", "It sounds like this relationship has run it's course, my dude.\n\nStart planning your exit strategy.\n\nSorry, OP.\n\nBTW... NTA.", "I’m sorry honey, she’s cheating. Her caginess about her phone and not taking you to the wedding is a huge red flag.", "NTA it doesn’t sound good. She’s is lashing out to make you the bad guy when she is the one that lied. Sounds like she is gonna fuck around", "She’s cheating, Nta she brought someone else which is why that’s the first place her mind went to. If you didn’t even bring cheating into it and your partner says I’d never be unfaithful it’s a clear sign they were in fact unfaithful", "UpdateMe", "Definitely want ro know how this turns out.", "She doesn’t want you there. I would suggest a conversation around why.\n\nObviously NTA", "She’s got a plan to hook up. If you really love someone you want them by your side. She didn’t want you by her side at a wedding. Thats a red flag.", "NTA. I’d peace out over this tbh.", "NTA best case situation is she just lied to your for Facebook worse case she’s cheating on you ask yourself if you have time for that shit either way", "calling men insecure is a way of manipulating for woman they call u insecure just so u could shut up. an example of this is if i tell my girl she shouldnt wear booty shorts and she calls me insecure tell me whos really insecure, a guy whos too scared to tell her what to wear because she might break up with him, or a guy who tells her without caring sbout the consequences. BREAK UP WITH HER", "lol. whats that word for the bad person doing the blaming first? \n\nid pack and leave the moment she leaves for the wedding\n\nshe sounds dangerous \n\nNTA", "NTA\n\nShe seems sketchy.", "You asked why she lied. She jumped to don't accuse her of cheating. Sounds like she has a guilty conscience. Not to mention all the other flags in play. She's suddenly cold, protective of her phone, and now lying to you. And has been for weeks. Something is up. NTA. I'd leave her. You deserve way better.", "She’s already cheating —you know where the wedding is, just book your own trip there — if money isn’t an issue", "My guess is she wants to hook up with one of her coworkers on the trip, but she’s stringing OP along because either it’s just meant to be a fling, or she doesn’t want to give up what she has until she sees if the new relationship goes anywhere.  Either way OP is her backup plan, and nobody deserves to be treated as such.  And the fact that she’s been planning it for months just makes it worse.", "OP you didn’t fuck up anything, she’s projecting and feeling guilty. i don’t know if she’s already cheating, is planning to cheat or it’s something else completely but she’s definitely the one that’s made the mess. \n\nNTA and good luck.", "NTA\n\nBut you’ve got the wedding details on the invite for the couple - I would contact the bride, say you’re the plus one and you’re surprising your gf by going. See what chaos happens", "It would be very strange for someone to invite an adult to a wedding without a plus one, especially if that person is in a relationship and espcially if it's a destination wedding. Since I've been an adult, I have always been allowed a plus one at weddings. \n\nThis is Fishy op. NTA", "The 4 year age gap in this relationship seems surprisingly obvious. Gf seems to be the one in control, easily keeping the younger partner on his back foot with self-doubt. Sounds like manipulation is a common occurrence, which is so sad. OP doesn’t want to lose what he feels may be the best thing to happen to him, when it’s really him being unaware that gf is always thinking three steps ahead of him. Don’t settle for disrespect just because she makes being in a relationship with her a no-brainer for you. You can have those things with someone who also respects you.", "Not to say that she is cheating but lied about the invite. You need to know why and should know. You came across this by accident. When you're caught in a lie its normal to try to deflect.", "You’re her boytoy.\n\nShe’s ashamed, and won’t want people to say she’s robbing the cradle.\n\n—", "Nta. Your imagination hasn't run anywhere. You're making observations and noticing an obvious correlation.", "NTA\n\nLet her go and change the locks before she gets back. It's pretty clear she already has a +1.", "Bro, she's getting her puss crushed by some dude, or is about to.", "When she got the invite she should have showed it to you and explained she wanted to go by herself.", "If you think she’s going alone I have a bridge to sell you", "NTA. Sorry man.", "INFO \n\nDID you mention the possibility of unfaithfulness when you confronted her?", "NTA. She's acting sus, she did lie and she immediately jumped to thinking you were accusing her of cheating when you were accusing her of lying about the invitation.\n\nShow up at the airport and see who she's flying out with. Well, or do the boring adult thing and sit her down and say you need to talk, that she's taking secret calls, acting cold, plainly lied about being invited for the wedding and that if she can't tell the truth the relationship is over, if she tells the truth it might not be.\n\nBut like, who doesn't like the caught cheating partner in the act moments in stories.", "NTA..  when she gets back have her bags packed .. it's over..   may as well be on your terms..", ">I let my imagination get the best of me and I'm worried I permanently fucked up the level of trust in our relationship.\n\nI let my imagination get the best of me and I'm worried **Melody** permanently fucked up the level of trust in our relationship.\n\nFTFY\n\nNTA,", "NTA. The phone call was the guy she wants to go with her. Literally no reason for her to lie about the invitation and if there was she would have explained when you found it. She is cheating.", "NTA.\n\nThis needs to be talked about and she needs to honest and give valid reasons as why she choose to do that. \n\nAlso do you know anyone else at the wedding...like to know if she took another plus 1", "I don't think it's great that you went snooping but that being said, you felt the need to do so in this instance so trusted your gut and hey...she's found wanting!\n\nShe did lie and she's also tried shifting focus so to me the logical conclusion is...\nYour lady is/has been playing away. It may be a friends with benefits from before she sees occasionally but I think it would be someone she knows from before regardless. Who is irrelevant. NTA", "NTA. She did lie. She’s also exhibiting textbook cheater behavior. It might be an emotional affair that’s about to become physical at the wedding or it might already be physical. It’s time for her to do some serious explaining (before she leaves) and for you to make a decision whether you want to be there when she gets back.", "NTA. I suggest you get away from this woman.", "I say this with kindness - I can't think of any innocent explanation for her overall behaviour. If my spouse got a call on his phone from a strange number and LEFT THE ROOM to take it, you can bet he would explain him self on his return. So would I if it happened to me. That's what people who're not lying and sneaking around do. You're NTA and her aggressive denials of something you didn't actually accuse her of unfortunately speak volumes. You could try and talk to her calmly before she goes and demand an explanation, but if I were you I'd be planning to be finding another living situation very soon.", "She is cheating.", "NTA, she is fuckin her boss", "NTA. Stop lying to yourself, you've been intentionally lied to and emotionally beaten. She's cheating. Your relationship is over.", "Soft ESH you two aren’t going to last long", "Definitely NOT the asshole. As soon as she accused you of snooping, she admitted she had something to hide. Honestly, it's up to you, but that's a trust breaker for me. I'd probably leave her.", " Yeah, she fuckin’", "NTA, and your first instinct is right. She is taking a +1 to the wedding but it’s not you. Whispered conversations and then acting cold toward you really tells you all you need to know. I have never been so sorry for telling someone they’re right.", "Dude, move her stuff out while she's gone.   Coz she already is.   Sorry.  🙄", "NTA - she ruined the trust in the marriage. She lied and you deserve to know why before making a decision on whether to forgive.  Let her go on the trip and move out while she’s gone or pack her shit , drop it off with a parent or something and lock her out.", "Dude she’s obviously taking another guy to the wedding, get out of this relationship", "She’s taking a +1 - it’s just not you.", "She's gonna bone someone there", "Yeaaaah, like not at all :| how's 'cheating' is first thing on her mind when it's about damn wedding, is very telling. It's not like she told him 'you accuse me of lying' or something, no. It's not like 'as I said my coworkers don't know you, so I said you're not invited altogether, to avoid hurting you' or something to that extent. No, her immediate response was 'cheating'. Dude, RUN.", "OP listen to this☝️. If she was telling the truth there would be an explanation, not an attack", "And when the response to “why did you tell me I wasn’t invited to the wedding when I was,” is “why are you accusing me of cheating,” well, let’s just say the “are you cheating on me” question has been answered and leave it at that.", "[removed]", "Fr, NTA.\n\nHer response and past and current actions are very telling. OP, you gotta run!", "Exactly. If my wife was invited to a destination wedding and I wasn't, I'd still travel with her. We'd go a day or two early and leave a day later to have a vacation outside of the one day she's attending the wedding.", "But the issue about her being embarrassed by the age gap is, when you introduce your partner (or anyone for that matter), you don't say 'here's my partner Connor, he's 25', you'd say 'that's Connor, my partner' and that's it. And people don't usually question age, where you're from, etc.", "You act like it’s that easy to leave someone and get a place all on your own with the crazy prices of housing.", "Do you get how much money it actually cost to “change the locks”… it’s not cheap.", "Waste of money. Spend it on a rental bond when he moves out", "That’s the dumbest thing I’ve ever heard", "Unfortunately, this is really the only logical conclusion.   \n\n\nThere is no reason for her to get defensive when you confront her with genuine evidence that she lied straight to your face, and to understandably ask why.  \n\n\nShe then immediatly went to \"are you accusing me of cheating, you're the bad guy here, why don't you trust me!?\"  \n\n\n...because you just found evidence that shows you shouldn't have trusted her. Because she lied.  \n\n\nIm sorry man, but if i was you, i'd be finding a place to stay so that you're gone the day she returns.", "I agree. Probably bang on.", "How about c) she’s embarrassed by the age gap and doesn’t want to introduce her much younger boyfriend to her coworkers. Especially since they’ve been together for 4 years.", "The other option is she’s already cheating with a coworker", " She's acting sues, she did lie and she immediately jumped to thinking he were accusing her of cheating when you were accusing her of lying about the invitation.", "I wasn’t thinking money.  I think she’s embarrassed about having a much younger boyfriend and it was just easier to go on her own instead of trying to stick up for OP or rationalise their relationship to others.", "7 year age gap?", "Age gap — he’s significantly younger and they’ve already been together for 4 years.", "All he did was bring up evidence that she was lying, she’s the one that mentioned cheating (right off the bat, btw) in an effort to turn the conversation back on him and make OP feel bad. She’s absolutely cheating.", "I think you got your answer anyway.\n\nShe's made a choice, and it isn't you.", "After being together 4 years it's a little strange to me that you haven't met her coworkers, especially if she is close enough to any of them to be invited to the wedding. \n\n\nThe behaviour is definitely suspicious, you need to try and talk to her calmly, see if you can get to the truth.\n\n\nAlso I think it's worth having a look at her social media for photos of the wedding, including any that she's tagged in, you might see something that gives you a clue. Is she in alot of comfy pics with one person in particular", "INFO: We know you didn’t directly ask her if she was cheating, but u/jnf919’s question was if you implied that she was cheating, so you didn’t really answer the question. \n\nSo…\n\n> Did you imply she was cheating on you when you asked about the wedding, or did you simply ask why she lied about having a plus one?\n\nCould you also describe your tone of voice, volume, and demeanor?\n\nWe get that it’s on your mind, so I explore whether you may be projecting first which could mean she’s not cheating and you’re in your head.", "I think they meant Natasha!!!!! Not sure who this Natasha is, though.", "I'm cheap/ broke .and this isn't a lot of money, $50 . \n\nI'm not very handy and I did this. \n\n \n\nhttps://www.lowes.com/pd/Kwikset-Tylo-Satin-Chrome-Single-Cylinder-Deadbolt-Keyed-Entry-Door-Knob-Project-Pack-2-Knobs-and-2-Deadbolts/4728835?cm_mmc=shp-_-c-_-prd-_-hdw-_-ggl-_-LIA_HDW_197_Security-_-4728835-_-local-_-0-_-0&gclid", "I think she's going to the wedding with the intention of hooking up with someone she knows will be there.", "but she would have to one day she cant keep hum hidden for ever. Also they have been together for 4 year so this  insecurity should be long gone", "The math isnt ever going to change though", " When we read about age gaps on this sub, it’s usually an older male and a younger female.  All the commenters see red flags.  I think the same issue applies here. I have rarely seen it with the genders reversed.  Not that it matters. I don’t think couples with age gaps are suspicious.  I knew people with age gaps.  The wife was 13 years older than her husband.  It was my friends mom and dad, so I didn’t think anything of it. Don’t know what to make of it.  Edit \nSpelling and grammar", "That’s not significantly younger. Only 7 years.", "It depends.im 42 (m) I don't go out with people from work anymore. Though my only real coworker is my boss .", "That's very presumptuous of you. We have talked about marriage in the previously and if that is what's bothering her she knows she is more than welcome to speak to me about it", "Bang on", "They’re already hooking up", "It's also probably a groomsmen that the friend group is also working on them to hook up.\n\nOP is being strung along\n\nNTA", "Another coworker probably", "The four years thing is part of what she could be embarrassed over.  Women aren't treated the same when they date younger guys, but if as a guy was 28 or 29 dating a 21 year old - that would be questioned by pretty much everyone.  Some here on reddit would say that would be wrong and that it says something about my sexual preferences.", "lol what? theres no issue with age gap. so i dont know what you are fantasizing about here. stop making an issue out of nothing", "> I don’t think couples with age gaps are suspicious. I knew people with age gaps. \n\nYou sound like you're projecting.", "Only 7 years, but having been together for 4 years. \n\nIf a 32 year old starts dating a 25 year old, that may surprise some people but they may be in the same place in life so it isn't that crazy. But this was a 28 year old that started dating a 21 year old - it maaaaay still be fine, and maybe OP was out of school so they had more in common, but it would definitely raise some eyebrows imo", "Exactly. The relationship is already over.", "It's probably someone she doesn't live near and only sees at events she travels to.", "I don’t have issues with age gaps.  I was responding to another comment.  Seven years is not that big a deal.  I was making a point about the sub, and if you reversed the genders, everyone freaks outs.", "42 and 33 checking in. \n\nWe were 33 and 24.", "Well damn, another thing I’m below average for 😂 28 and no marriage in sight.", "YTCuck", "You're lying about doing her laundry.", "NTA she lied to you . Then made you out to be the bad guy. Red flag time for you to move on.", "NTA she is a cheater and just got found out…", "NTA.  Trust your gut.  There is a reason she wanted to go alone.  If she is acting funny, there is a reason she is acting funny.", "NTA if things played out as you portray them.  ESH but if there is AH it's her.  I do think you should trust your gut.  Why would you want to be with somebody who doesn't just say \"I want to go alone\"  then blows up because you called her on lying about it? Were you assuming she was cheating?  Were you just confused why your gf got so defensive? Do you have any reason to think you two can develop better communication skills because you both seem to have some issues with that.\n\nSnooping is not good. Yes you fucked up the level of trust.  Also, you two didn't have trust anyway (see above) so I feel like you mostly shone a light on that issue.  I don't know I'd assume she was planning on being unfaithful. Could be a billion things that were happening, I could make up that maybe the age difference would make her feel like a creepy cougar, or maybe you not having the same level of maturity or professional advancement embarrassed her etc etc being a thing. I see you've been together long term, which makes it more problematic she didn't just say she'd like to go alone.)\n\nNone of that matters though. Life is short, if you're not on a team together, there's not much to be gained from trying to force things to work out generally if both parties aren't invested in it.", "NTA. I’m so sorry bro, this relationship is over.", "NTA - She’s gaslighting you by leaping straight to telling you you’re accusing her of cheating and going straight to insults when you asked her why she lied about you not being invited. After four years together she doesn’t see you as someone she’d want to take to a friend’s wedding. Whether or not she’s cheating/intending to cheat, she wants to feel and behave like she doesn’t have a partner on that trip. \n\nIf you’re still there when she gets back, expect awkwardness followed by a sob story about how she’s not the kind of girl that would ever cheat, but that how you were before she left (putting all blame on you) left her feeling vulnerable and questioning whether she can be with someone so controlling and insecure (again trying to shift all blame onto you). So she drank too much and fucked someone else and she wants to end things to be with whoever this other person is.", "Your imagination didn't get the best of you. Trust your gut. She is distant and lying to you for a reason.", "Next, she is going to break up with accusing you of being insecure and controlling. \n\nThe truth is, she lied to you, the truth is she is being cold and secretive with you, the truth is she is being untrustworthy, do you want  to marry or being in a relation with someone like her ?\n\nOnly thing for this relation be salvageable, is for both of you have a really good talk about all this, and she have a reasonable answer for all this behaviour she has been treating you.", "I'm sorry, but she's already cheating. Her immediate defensive position to being asked about the invitation was to escalate and be indignant about being accused of cheating? Guilty conscious, right there.", "She's either cheating or wanted to cheat and the other person has dropped out of the wedding/is taking someone.\n\nIf you've not met her colleagues do they even know about you!\n\nAlso you asked about her lying, you didn't ask if she was cheating, she jumped to that.\n\nETA NTA", "I believe this might be the definition of gaslighting.", "NTA\nYou didn't eff up anything. Sounds like your partner is having an affair.  She's gaslighting you.  You should use the tine she's gone to asseaa and reconsider your relationship with her.", "Take it from someone who in his younger immature years got asked why I was late back from work and told on myself by being defensive “why would you ask me that? Like I was out with some other girl” \n\n- unfortunately my stupid ass was out with some other girl and left the receipt lying around. \n\nA lot of these defensive outbursts ends up being a confession. \n\nYou are NTA", "Oftentimes we should trust our guts. NTA", "Well, you didn’t imply it. You had proof that what she told you was incorrect, asked her about it, and she admitted to lying. So let’s be clear there. \n\nShe has been weird about this trip, and distant with you. I don’t know if you tried to talk to her about it or not, but I suspect she would have continued lying to you about it. \n\nYou tried to do a nice thing, and spotted an opportunity to get some proof to bring this up with her again, I suspect, if you’re being honest with yourself. What you should have done was shut the drawer and brought it up with her and just asked to see the invitation because you felt her behaviour was weird about the whole thing, instead of snooping. \n\nSo now you both have done something inappropriate. You went through private paperwork, she lied to you about whether you were invited to an event because she didn’t want to go with you. I can’t see the two of you trusting each other again, whether or not she’s cheating, so I’d say this is over. \n\nIf she wants the whole conversation to be about your snooping, and won’t discuss what you found, then this conversation won’t ever go anywhere or get resolved. This is why I always advise use against snooping unless it’s a matter of immediate safety - it gives someone the opportunity to focus on what you did wrong instead of having no escape from discussing their behaviour. \n\nIn these kind of situations I actually advise eventual ultimatums, like start gently, like “hey babe, I’ve noticed you’ve been a bit distant lately and any time there’s a reference to this wedding trip you get weird with me, and any call related to it you take somewhere I can’t hear you. I’m not accusing you of anything, and I’m sorry to ask this, but could you just show me the invite, and sit down and talk to me about what’s happening here?”\n\nThat seems pretty straightforward. If she refuses, she’s hiding something. So then I go to “if everything you’ve told me is true, why won’t you just being the invite out and talk to me? It’s not that I don’t trust you, but I think there’s something you’re not telling me and I want to talk about it together.”\n\nIf she says she doesn’t have it, or can’t find it, then it’s “really? You’re normally so good with papers I find that hard to believe. I know you keep your papers in that drawer on your desk, let’s go have a look together.”\n\n“Okay, so there it is. Just show me.”\n\n“No, this is insane now. Show me the invite and talk to me about what’s going on or I have to acknowledge our relationship is over if we can’t even discuss a concern this simple.”\n\nI was tempted to go E S H because of the snooping which is not the way to handle this but Schrödinger’s cat was dead in this case and she is the one lying and hiding and being dishonest so this was never going to be openly resolved without something happening, so given the greater wrong I’m going NTA.", "What's this \"implying she lied\"? She literally told you you weren't invited or allowed to go since you hadn't met her friend. She did lie, no two ways about it. And she went straight to saying you were accusing her of cheating? Damn that's suspicious.", "Once I trusted a girl with this name, I will never do that again.\n\nJoke aside, NTA.", "Op, if you guys live together you need to just move while she is gone and block her number. She’s been cheating trust me.", "If I were you,  I would apologise for snooping and tell her you trust her completely. I'd then ask if she had any objection to you booking the same trip to the same hotel for a mini holiday for yourself,  and when she has any free time,  you could both meet up for drinks or dinner/breakfast etc. That should be enough for her to give you the answer you need about your relationship. I honestly believe she would flip at you and say no, probably because she's already cheating on you with her plus one.", "After four years you should be her plus one by default and if she’s close enough friends with her coworkers that they’d invite her to a vacation/destination wedding then you should know them.\n\nAlso the phone call thing is very weird, NTA", "NTA.  She fr cheating on you or planning to cheat though.", "NTA. She probably has a plus one already going with her. Probably that unknown number is who was invited. Thank goodness it's just a girlfriend and not your wife.", "Nta,she doesn't appear to think much of you,it must have been hurtful to see the invitation, I'd bounce,the next person would be excited for you both to go to the wedding.", "Offer to take her to the airport and if she says no just go at least you will see for yourself", "I'd pack up and shift out while she away. She hangn with someone else.", "She’s going with someone else as her +1. I don’t know if you’re TA or not, since this story is only half told. You should offer to drive her to the airport and hang with her till her flight’s called, to see how she reacts.", "Dude. She lied. She is gaslighting you.  And trying ti manipulate you. And seems to be working.   As soon as I found out she lied about the wedding. The relationship would be over. I do not need details. The fact she lied to me. I wouldn’t even said anything to her. When she returned from her little wedding trip. She would have found I no longer lived there. (Assumed you live together from the laundry statement). But never put up with that disrespect.\n\n\nEdit:  she is more than likely cheating you with a co worker and they are going together.", "ESH. \n\nFirst off this relationship is over. You don’t trust her and once trust is gone it isn’t coming back. Just curious the laundry you were doing for her? Does she keep her dirty clothes in her draws that just so happen to have all her paperwork in? \n\nLet’s not pretend this was you being nice, you searched for what you were looking for. \n\nShe might be cheating, she may just want to get away from you. But now the accusations have been made this relationship is only going one way.", "You’ve never met her co-workers and she’s not bringing you as her plus one. If she wanted to go alone she could have said that. Bud.. are you the other man?", "NTA- she is for the streets. She literally doesn’t want your company and when you asked about the “plus guest” invite she immediately returned with “im not cheating” well… guess what… she is likely cheating or she cheated and don’t want you there with her co-workers because you may find out.\n\nTime to leave her alone permanently bro.", "NTA. You'll find fewer red flags at an amusement park vs. what you're going through. The lying, calls, distancing, and trying to reverse guilt during conversations are major flags. If you both are unable to communicate about this situation as adults, then the relationship is not going to make it.", "Shes going to fuck the shit out of one of her coworkers the full weekend", "NTA - she’s embarrassed of the age difference.  When it’s just you and her everything is fine but as soon as she had an opportunity to show you off/introduce you to friends etc she doesn’t want to be seen with you.", "NTA. She could have been upfront with wanting to go alone but she instead hid that which tells me that there's something suspicious behind it.", "She kinda confessed there. You never mentioned cheating, she did. Mate, she is ducking someone else and is cagey because she got caught.\n\nNTA and check out of that relationship like yesterday.", "NTA, \n\n>She called me insecure and annoying and told me she simply wanted to go to the wedding alone.\n\n🚩She would have told that to you instead of lying and hiding it. Then calling you insecure when you confronted about it.\n\n\n>to accuse her of being unfaithful.\n\n🚩You never accused her she accused herself of being unfaithful.\n\n>very cagey about her phone\n\n🚩this further proves her cheating accusation she is probably cheating, because why would you hide what is inside your phone from your paetner that you are about to get married.\n\n>She snapped at me and asked me why I would snoop through her drawers\n🚩why is she getting mad at you when she is the one who is in the wrong for lying and hiding.\n\nWhat is up with your title she did LIE about her wedding invite. And you should probably leave", "Nta she fucked The relationship up. Break up with her.", "Snoop some more and leave knowing the facts", "NTA. The fact that she cheat or not is not even the main IMO. After 4 years she does not want you in this special event. She does not want you to meet her crew. She does not want to share this trip opportunity with you. You need to accept that it will be over soon.", "NTA anyone else notice they got together when he was 21 and she was 28?", "Yeah she’s hooking up at the wedding", "I'm very sorry for you my friend but she is certainly cheating on you or at the very least planning to do so on this trip. End things and save your dignity and work on better yourself is the best way you can proceed from here.   \nYou are still young with plenty of opportunities on the horizon unlike her.", "NTA there was no level of trust in your relationship don't worry\nOh and snooping around is a bad thing unless you find something. If you find something, it was justified. And you found something.", "You need to talk to her, and leave. Whether she might be cheating or not, she IS lying to you about something. Confront her that you know she has been lying to you about something and she needs to come clean. And that either way, no matter what it is, tell her you both need some time apart to think about what it is you truly want. She may want something else now. But you for sure, judging by your post, don't want someone who lies to you and hides things. It's not healthy. Sometimes, for better or worse, people from apart and part ways. It could be after a few months, it could be after 15 years. Sometimes partners find out they start wanting different things in life somewhere along the way. It sucks but then another partner comes along the path later that does want the same things, and hopefully that lasts a long time.", "Lol.  You didn’t fuck up your relationship.  Your GF did that by lying to you.  And most likely cheating on you.   NTA.", "NTA. You didn't ruin the trust in the relationship, she did. I hate to be the bearer of bad news but she's literally showing every red flag that she's cheating.", "Esh. Her for lying. Without a doubt. But why are you snooping in her draws and going through her paperwork.", "NTA. She did lie. You never said she was being unfaithful, she brought that up all on her own. It's kind of shady that she immediately went there. Even if she is just going alone, I think it's concerning that she wasn't just honest with you. Why couldn't she just say that she wanted to have time alone with her friends there", "dam sorry bro, if it were me id hust leave while shes away haha", "NTA.. That phone call she took and then came back and was sudden acting cold towards you, that’s her plus 1. I’m sorry but by the way she’s been acting sounds a lot likes she’s cheating.", "YTA  -  YOU weren't invited. You assumed gf + guest included you, but your gf gets to decide if/who her guest is. She told you that you weren't invited. That is not a lie, she chose not to invite you along. Then you went snooping, which just proves that there isn't any trust in your relationship. \n\nThere's issues on both sides of the relationship that frankly sounds like it has run it's course, but on the topic again you're in the wrong.", "🚩 🚩 🚩\n\n>>She snapped at me and asked me why I would snoop through her drawers and if I'm seriously trying to accuse her of being unfaithful.\n\nYou did **not**  \"accuse her of being unfaithful.\" You accused her of **lying**. For some reason she has cheating on her mind. I wonder why… 🤔 It's a real puzzler. \n\n🚩 🚩 🚩", "NTA - 🚩🚩🚩🚩🚩 Your girlfriend is definitely two timing you. First, the way she acted with the phone call, and how she jumped to denying cheating when you caught her out on her lie.\n\nDump her.", "NTA\nYou wanted to confrontnger about lying, but she mentioned cheating. She slipped there, OP, and yeah I also would be worried.", "She just fuckin ratted herself out. NTA but you got bigger problems.", "I also find it the ages they were when they first began dating as concerning. \n\nA 28 year old dating a 21 year old?  Speaks of an imbalanced dynamic, clearly manifesting as hee gaslighting him. \n\nI was in my late twenties when a 20 year old hit on me. I was flattered but couldn’t imagine dating someone that much younger than me. \n\nNTA OP and please do yourself a favor by breaking up with her.", "At the time they met they certainly were. At 32 I felt the same as I did at 25 though - if they’d met at those ages it wouldn’t raise flags really for me. But definitely a 21 and 28 year old getting together is very different places. Sounds like the girlfriend has moved on - maybe because OP is older now? Pure speculation but the unknown number and whispered phone call are big red flags that she’s going to this wedding with someone else (younger - because that seems to be what she’s into)", "I know financial stable 21 years who worked for a few years and make good money and I know 28 years old still studying with almost no income. Isn’t the place in life different from person to person rather than age?", "yes thank you omg", "How is her shouting at him and accusing him of thinking she’s cheating a NAH move?", "\\*Every accusation of an accusation is a confession.", "It definitely looks like cheating but I have to wonder if there's a possibility it's about money.", "Can’t rent a car at that age 😭", "\"Hey how was work?\"\n\n\"I certainly didn't let two coworkers Eiffel Tower me in an empty conference room. Why would you even say that?\"", "As others have suggested, I’d argue that whether she’s cheating or not isn’t the critical issue here. \n\nThe core issue is who and what you are to her. \n\nAre you her valued and cherished partner, someone who makes her happier to have around and with whom she wants to share amazing experiences? Are you someone she loves and trusts enough to say that she’d rather attend this cool event alone so she can party with her coworkers, rather than entertain you when you don’t know anyone? Are you the person she’s eager to introduce to her coworkers because you’re important to her? Are you a central part of her life, enough that she’s interested in making a deal where she gets to do this solo and you’ll either get to do something amazing with your friends or take a cool trip with her later? \n\nAll of those are possible good/acceptable answers, they might not work for everyone, but they’re reasonable compromises/outcomes that two people in a caring and committed relationship could arrive at. \n\nWhat’s worrisome to me is how much not a part of her life, plan, priorities you appear to be. If you’re not in a mutual, respectful, caring relationship with someone who treats you and your well being as a priority, then who she’s sleeping with (or not) is the least of your problems. \n\n(Just to be clear, I’m not excusing potential cheating, and I’d agree it sounds like a solid possibility here. I’m just saying that OP almost certainly doesn’t need to figure out the specifics to reach a conclusion about where he stands with her.)", "Okay what are the possibilities here.\n\n- She just doesn’t want to bring her BF of 4 years to a wedding with her, clearly you guys are in different places in your relationship if this is the case\n\n- She went with someone else. Might as well be cheating.\n\n- She went alone to find a hookup or something of the sorts.\n\nThe fact she got defensive instead of just telling you the truth is a pretty obvious sign she’s up to no good. I’d tell her “hey either tell me the truth, or I’m gone”. And if the truth is anything like the sorts up above, just leave.  If she accuses you of some weird shit because of an ultimatum, just leave.", "This sounds like the sort of thing a 30 year old would use to have sex with an 18 year old. \"Bro, you don't understand. She's really mature for her age.\"", "That's actually the first thing that popped into my mind.\n\nIt's a little odd to me that over four years, OP has *never* met Melody's coworkers...like, *none* of them? There was never a holiday party or a retirement or anything that included significant others? There wasn't any particularly close colleague that ever came over, or asked the two of them to go out for dinner with them and their partner?", "And whether she’s cheating or not, her reaction of attacking him when he asked about it is unacceptable. Even if she’s not cheating, it’s insecure and immature to try to “whataboutism” him.", "First of 21 is not 18, secondly its not about sex.\n\nAt 21 you can have a job, your own place, pay your taxes. You can place your vote for a government and the future of the country. You can drink and in some places even buy guns. The law doesn‘t treat you as a minor anymore, you are fully responsible for all your decisions and have to bear the consequences.\nThe decision to enlist yourself to war you could have already made three years ago, by now you already could have been in an active war zone or seen combat. But yeah let‘s take their own agency when it comes to decide for a relationship.", "That’s nonsense, my cousin and her husband were 29 and 23 when they met, she was 29. She never hid him from anyone. It’s been 15 years or maybe more, they are still together. OP’s age difference is smaller.", "Thats what gets me. I wouldn't be surprised if she has been messing around with someone from work and has been keeping OP hidden. I mean this is reddit so she could be the mistress of a work colleague and has her own little toy to play with in OP.", "I read that in Morgan Freeman’s voice", "Ok but then tell him atleast after he found out that she lied to him. No reason to bring cheating here. Mostlike she is cheating", "People don't even notice with such a small gap. My husband and I were 25/17 when we started dating, and I don't recall ever feeling self-concious about it. I joked about it a bit, but no one ever mentioned it in any kind of negative way. We're a few decades older now and still mortgage-bound together. lol.", "And hiding her partner is worse. You get that right? Because it indicates that there is something she is ashamed off here. \n\nHonestly her whole behaviour here could supply a North Korean military parade with red flags.", "I have no experience with age gaps other than knowing a few people where it’s been successful.  It could be because the younger partner was over 30. I don’t know.  I just feel like she has a different agenda.   I’m throwing out scenarios. They’re not confirmed or true.", "*he’s right, you know*", "shouldnt have an issue either gender", "NTA. She blatantly lied and you have the right to call it out. \n\nBut dude\n\n>  I decided to do her laundry for her so she wouldn't have to do it when she got back. In one of her drawers there was a pile of papers and folders.\n\nStop it. Lmao. Doing laundry does not involve going through drawers. Dirty clothes are not in the drawers. You were snooping. Don’t tell silly lies in a post where you call your girlfriend out for lying lol.", "First of all, NTA in my opinion. Second of all this reminds me very strongly of the end of my marriage when I was nearly positive my now ex wife (who was also an older woman, even more so than OP and “Melody”) was cheating on me. Which I honestly didn’t even care at that point, the relationship was so freaking lousy.\n\nHere’s my point, OP. Do NOT under any circumstances marry this woman, and if you have co-mingled finances do your best to separate them as soon as possible. I’m very sorry, and I view this thru the lens of my own experience, but I see this getting nothing but worse the longer it persists. I would advise you make an exit strategy.", "Sorry your ex-GF lied about taking another man to wedding. \n\nHope you find someone else soon.", "She's 7 years older and gaslighting you, big red flag. NTA, run.", "NTA and cheating or not, she's your gf of 4 years and she lied about the invite and excluded you from a potential vacation. even if she really needed alone time or wanted to visit this friend alone, she could have talked to you about that. you deserve more courtesy than being ditched.\n\nbut honestly that's just if we're buying her story. which i'm not.", "Sorry your ex-GF lied about taking another man to wedding. \n\nHope you find someone else soon.", "Hey mods, this is not relationship advice?", "I’m sorry OP, it doesn’t sound good. Her lying is a red flag. Her reaction at being confronted is another. NTA", "NTA\n\nAlternative to the cheating hypothesis:\n\nYou aren't enough of a trophy. Has she avoided letting you meet the coworkers?", "NTA, you are 25. Let that lying, probably cheating 32 year old woman go my guy.", "NTA. \n\nYou’re not implying that she lied to you. She did lie to you. Cut your losses and get out of the relationship.", "NTA. She’s already lied to you about the trip and flipped it back on you. Sorry to say it man but this his a huge cheating red flag.", "NTA and exit that soon please. For your sake.", "Ohhhh yikes! Watson! We are not needed here!", "Nta. If she wanted to go alone that's fine, she should've been honest about that, you might've been upset but that would have been a starting point for a conversation.\nWhether she's chatting or not isn't your problem, the dishonesty you know about is. No point in discussing the potential of cheating as you can't prove it, she argue and call you the asshole. You can clearly see she's been dishonest and you can leave her for this or anything else that makes you unhappy.", "It sounds like she already has another +1 organised and it's not you. NTA", "1.  You shouldn't have gone through her folder.\n2.  You did.  Now you know she lied about not being able to include you.\n3.  You confront her about it and she immediately jumps to the conclusion that you are accusing her of cheating. (Red Flag)\n\nYTA for going through per personal folder.", "She has another boyfriend at work and they are going together. No surprises here.", "You only get defensive when you have something to hide. She went from 0 to are you accusing me of being unfaithful....she gave herself. away.\n\nAnd there is no other way t find out if someone is cheating or lying but by snooping, there would be no need if the person wasn't lying and acting off. You had to do what you needed to do.\n\nDon't waste more time on someone who will easily lie to you. She could have easily said she needed a few days alone time, or if she is embarrassed to show you to her colleagues after 4 years then she isn't worth it either. Or she is cheating with a colleague or wants to or is taking someone else to cheat with and say he is her plus one.", "Dude, she's cheating on you. NTA", "NTA,\n\nI would do some online digging for photo's from that wedding. Possibly you could find out who her 'plus one' is.   \nShe sounds very suspicious and from the looks of it, it's cheating.  \n\n\nBe careful how to proceed and find any paper trail, I don't know what your living situation is and if there is property involved when sh\\*t goes down.", "Sewerslide is always an option.", "She's gone, boy, she's gone", "It's not You who's fucked up trust in the relationship, it's HER! She lied, and quite probably she wanted to attend with a different plus one. Then something went wrong, and she's now shifting the blame.", "NTA. It’s over. Leave while she’s at the wedding. Don’t waste your life on someone who lies to you. If she was happy to be with you she’d be taking you.", "The way she is acting all of a sudden is very suspicious.\n\nPaired along with the fact that the first thing she spoke/ exclaimed about; you thinking about her cheating (quite specific might I add, unless that is the case and the guilt is getting to her?).\n\n\nBefore she goes, let her know that you need to speak to each other about this situation. For her to give you a clear answer in regards to the relationship and to be on the same page before she leaves.", "NTA.\n\nYou’ve been together for 4 years and she wouldn’t take you as her plus one to a wedding (plus a vacation). That’s all you need to know.", "NTA. And no one gives up a plus one to a destination wedding. She definition invited someone.", "Mate, jumping straight to 'you're accusing me of cheating' like that is a pretty good indicator that she is, sorry.\nYou are NTA here based on your description, best of luck.", "NTA. You didn’t mess anything up. Melody has already checked out of the relationship.\n\nFrom here you can choose two things:\n\n1. Move out during her trip, so she comes back to an empty place.\n2. Move her stuff out and change all the locks.", "Theres a coworker that she fancies. Or someone else will be there at the wedding she has her eyes on (or is currently involved in). Either than or someone has some serious beef with you and doesnt want you there.", "NTA\n\nIf you don't have Tourette's or any specific and specific reason so that you'd always be a handful to manage in settings where she wants put her best foot forward in front of her bosses, she's out of pocket.\n\nShe broke the trust first. She lied to you about the wedding invite. She's been acting shady. She didn't own up to it, and instead blamed you.\n\nSorry for the crappy situation.", "Move on bro, she broke your trust.\n\nAlso don’t snoop in future.\n\nAnd check that age difference, your lady is not mature and you’d be better with someone you can trust and grow with.", ">I'm worried I permanently fucked up the level of trust in our relationship.\n\nThis is exactly backwards.  She was acting sketchy, and you found out that she lied to you.  What she's doing now is trying to make you feel guilty for not letting her deceive you with impunity.\n\nYMMV, but I'd kick her to the curb.  NTA.\n\nEdit: move out while she's at the wedding.  Best chance for least drama.", "NTA. \n\nThere's a ton of red flags here!\n\nShe lied to you about not being invited and not bringing a plus one because the person she's bringing is probably the person she's cheating on you with.", "YTA for snooping.\nBut get out of this dumpster fire of relationship right away.", "Put your mind at rest and check her texts, she has a side piece, I'd put money on it...\n\nMy GF and I use each others' phones all the time, whichever is the closest grab.\n\n Nothing to see here.", " You are being played. Box her stuff up while she is away and send it and have her parents pick it up. Change your locks.", "Divorce", "If she hasn’t left yet just tell her to have a good time but that you won’t be there when she gets back. Tell her, her lying to you was the reason. She probably is cheating on the trip but the lying is more than enough reason to end things. At the very least it will make a mess of her trip.", "NTA - I’m so sorry but what she’s blaming you for sounds more like a confession to me.", "She’s going on a lovely fun trip and doesn’t want you to come. Your answer is right there.", "Please update us when you confirm she’s planning a hook up with an ex at this wedding.", "NTA I know it's hard but it's time to move on", "There is nobtrusty get the hell out", "DARVO mode engaged", "OP. She’s not your girlfriend anymore. She’s either someone else’s girlfriend now and just hasn’t told you, or she’s planning to break up for some other reason. That’s it, it’s over. NTA.", "Exactly. Maybe she wanted to let her hair down with her 'gals' from work. But sheezh. Why not communicate? At best, she seems avoidant and immature.", ">Her actions are not normal\n\nVery normal. \n\nFOR A CHEATER!", "Did she order the double pepperoni?", "Every confession is an indictment", "You goddam millionaire, wish It was that easy, but youre absoluteley right. The momento she brought It Up proved what she was doing", "Confession through projection.", "As well as the age gap. He was just turned legal age while she headed straight up to her 30s. Nothing bad in general, but he’s literally a decade younger than woman that age use to date, she doesn’t sees him as a plus one after 4 years, she’s not even able to tell him before that she just wants some time without him (if this is the reason), the strange behavior right before the wedding and than going attacking mode by a simple question…\n\nShe doesn’t seems to be trustworthy at all. Switch genders and people would tell OP he’s obviously dating a predator.", "Stolen from u/Alibeee64.", "Counter point, unless it's she owns the place, her name only on the lease, or he can't afford rent himself.  Her shit should be in trash bags and on the curb when she gets back.\n\nWhy should OP go through the hassle of starting over, she  fucked around so she find our.", "God, do I wanna know what \"Eiffel Tower\" means in this context?", "Ei...EIFFEL TOWER?!?", "In fact what are the coworkers gonna think if she rocks up alone to the wedding? Or if she rocks up with anyone else?\n\nOr rather, worst case scenario, DO her coworkers know she is planning on cheating at the wedding anyway?\n\nEither way like you said, they are expecting OP to be the plus one if anything. Unless the GF plans to lie about his absence?", "Stop infantising adults ffs", "Or she just wants to go on her own so she can bang randoms she meets there.", "i’m going to assume yes and tell you anyway! it’s when one guy is doin the back, and the other is doin the face, and they high five each other 😁\n\nit’s more wholesome than most sex acts honestly haha", "Thank you, the amount of judging age gap in the comments is unreal. There's 10 years between us - he is mid twenties and I am mid thirties, we met years ago and are super happy. I know plenty of other couples who are in a similar situation. It can work if you're compatible!", "So because your cousin’s not ashamed of having a younger partner, no one else can possibly be ashamed of having a younger partner?"]}