{"id": 25038, "submission_id": "15vnxpb", "title": "AITAH for not forgiving my birth mother after she abandoned me and my sister?", "selftext": "I (21F) and sisters (16F) left us I was five and she was pretty much a newborn, we lived with my grandparents so they got legal custody of both of us. Our mother leaving us broke me to where I needed a counselor and hated seeing other girls with there mother's, my sister wasn't to affected by her leaving cause she never knew her. As I got older I slowly learned to accept that she wasn't coming back.\n\nAbout a year ago my sister and I got a text from a number claiming to be our mother and wanted to meet, I was sceptical of going but my grandma and sister wanted to know if it was a sick joke, he went ended up going and it was indeed her. My sister and I were both shocked, we sat down and started to talk, she apologized and said she wasn't ready to be a mom and felt we were better off without her, but now she was ready to be a mother and my sister was thrilled at the idea of having her in our lives but i wasn't. \n\nI told her one sorry wasn't gonna make up for the 16 years she was gone and I said if my sister wanted a relationship with her that's her choice but I don't. I left and spent the rest of the time in a store nearby. When I got back my sister yelled at me for making our mother feel bad and cry, i told her if she didn't think about how leaving us would make us feel why should i worry about what i said made her feel. Even my grandmother said I was being harsh on her and i need to let it go, but i just can't bring myself to trust her again, so AITAH?", "created_utc": 1692470407, "permalink": "/r/AmItheAsshole/comments/15vnxpb/aitah_for_not_forgiving_my_birth_mother_after_she/", "score": 749, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Not forgiving our birth mom for leaving me and my sister, my word choice upset my mother and made her feel like a bad person\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcement\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n ### [Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nShe wasn't ready for you then and you are not ready for her now. And why didn't your grandma object about her own daughter being harsh and leaving her kids to live her own life. But now she thinks you are harsh. HELL NO! And honestly if something happens now and she has a change of heart again then she might ditch your sister too again. I feel sorry for you guys.\n\nAll kids deserve parents but ot all parents deserve kids.", "NTA, you cant just show up in your child's life after 16 years and think they will just accept you like nothing happened that bs.  \nBesides you dont know what kind of baggage she brings with her, she might be a wonderful impact on your life or be a horrible burden that will drag you down - be careful and good luck!", "NTA.  Just because she is ready to have a relationship with you doesn’t mean you want a relationship.  She should have been ready for your rejection.", "Nta at all. Nobody is owed forgiveness. Everyone making a big deal about it is wrong. Hugs to you and act as you feel and  not how others bully you into acting", "NTA your feelings are valid.", "NTA. It's normal that you'd have these emotions. A person can't just jump straight back into your life and say she wants to be a mother and expect you to accept that. You're an adult now and you've obviously been through a difficult childhood with your mother leaving/abandoning you in your early years.", "NTA - abandonment is a hard emotion to deal with.   You were old enough to remember her.  Your sister wasn't.    People who are not ready to be mothers have a myriad of things to deal with , especially if they want to reconnect later.   You are under no obligation to have a relationship with her.", "NTA. It’s your life and your choice, just as your mother made her choice.", "NTA.  You were abandoned by your birth mother at a time when you had become attached to her and when you needed her.  You are under no obligation to \"forgive and forget,\" \n\nAs for as your sister knew, your mother didn't exist. Your sister never got attached to your mother; your Nan played that role.  More importantly, your sister never felt abandoned by your mother.  If she wishes to establish her own relationship with your mother, that's her luck and privilege to do so. She has a lot less baggage to deal with than you do.\n\nThank your Nan for raising you. She did you a solid.  ==  But as regards her daughter, Nan needs to understand that both -- you and your sister -- experienced your mother abandoning the two of you very differently.", "NTA. She can't just walk back in and become mom.  She's doing this for herself, not you and your sister.  You have every right not to deal with her.  Be ready however to comfort your sister when she disappears again.", "NTA. HOWEVER, as someone who has a lot of experience with family reunification: You absolutely don't have to forgive her, at all, in any way. But understanding why she did it may help you feel better, or at least achieve closure with it. Especially if your sister is going to be having a relationship with her, this unfortunately will not be the last time this comes up.", "NTA You don’t have to let it go and you don’t have to forgive her . If you ever do forgive her then let it be for you ! And your piece of mind . Not  for her . Don’t be guilted into anything . You can’t put kids on a shelf until you are ready to parent . Kids become adults and actions have consequences.", "NTA you don’t have to forgive worse than deadbeats", "NTA because you are young, and I get were you're coming from. However, everyone deserves forgiveness and I'm sure you'll reconsider in the future.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (21F) and sisters (16F) left us I was five and she was pretty much a newborn, we lived with my grandparents so they got legal custody of both of us. Our mother leaving us broke me to where I needed a counselor and hated seeing other girls with there mother's, my sister wasn't to affected by her leaving cause she never knew her. As I got older I slowly learned to accept that she wasn't coming back.\n\nAbout a year ago my sister and I got a text from a number claiming to be our mother and wanted to meet, I was sceptical of going but my grandma and sister wanted to know if it was a sick joke, he went ended up going and it was indeed her. My sister and I were both shocked, we sat down and started to talk, she apologized and said she wasn't ready to be a mom and felt we were better off without her, but now she was ready to be a mother and my sister was thrilled at the idea of having her in our lives but i wasn't. \n\nI told her one sorry wasn't gonna make up for the 16 years she was gone and I said if my sister wanted a relationship with her that's her choice but I don't. I left and spent the rest of the time in a store nearby. When I got back my sister yelled at me for making our mother feel bad and cry, i told her if she didn't think about how leaving us would make us feel why should i worry about what i said made her feel. Even my grandmother said I was being harsh on her and i need to let it go, but i just can't bring myself to trust her again, so AITAH?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Tell all of them  you need 16 years to decide if you want her back.", "NTA. No one can tell you who to let into your life and who to keep away. Only you get to make that decision.", "NTA. I find it ironic how she said she wasn't ready to be a mom but now that y'all are raised she wants to be.", "NTA. She's a deadbeat mother who doesn't deserve forgiveness. If you're still angry, then that's your perogative. No one has the right to tell you when you should forgive someone. A mother abandoning her children is a crime against nature in my book.", "NTA.  You don't let go of that trauma :(", "NTA\n\nYou are not obligated to have a relationship with a complete stranger", "NTA", "NTA\n\n&#x200B;\n\nYOu are fine not to want a relaartonship with your deadbeat biomom who abandoned you.\n\n&#x200B;\n\nThere is NO reason for you to let it go, let HER go instead, and refuse to see her ever again.", "NTA. Your reaction is 100% justified. She abandoned you for 16 years!\n\nHowever, you could consider trying to be the bigger person here. Even if you can never forgive your mother, your sister wants to reconnect. You might not ever have a loving relationship, but perhaps you could both at least be amicable? Assuming your mother is actually telling the truth. If that's not possible and you want to just completely cut her off, that's fine.", "NTA.\n\nFor your grandmother it may have been a different type of memory, and for your sister it may be none, but for you, it is, for now, even if for the briefest moments, that which brings you back to being that five year old girl who didn't understand why her mommy did not want her. Eventually, perhaps, you will let her into your life. Perhaps never. If your mother doesn't understand that, then she was never truthful about being ready to be your mother again.", "Trust is earned after such a betrayal", "NTA. Not even a bit.\n\nI'm 42; when I was 18 months old my \"mother\" had her grandfather take me to my father, who was doing yard work for his oldest brother. My late father said she got me out and said \"You wanted her, I didn't. \" She left. She had me when she was 16. Times were different but still. \n\nHer leaving caused so many issues, including abandonment fears that I went to therepy for at 8 years old. As a child I didn't know why she left and seeing other kids have their moms was hard. Yet growing older I heard stories and...I come to realize not having her in my life was best. She made three attempts to reach out to me and the last time I made it known she was nothing to me. I even told her son that when he reached out. Friends even told him that.\n\nYou are allowed to feel the way you do. Don't let anyone tell you different. SHE missed out, not you. Don't let anyone guilt you or say you are being harsh or guilt you for making her feel bad. Don't be afraid to go LC/NC with them. Also if you feel the need, don't be afraid to talk to a therapist.", "NTA, but your sister and your grandmother are both A holes. So your supposed be considerate of your mothers feeling after she abandoned you at five years old? Your supposed to ‘get over it’? You are totally, within your right to tell that birthing person to F off. And if she doesn’t like it, just remind her what she did to you when you were five. If she feels like playing mommy, when it’s more convenient for her, she can use your sister.", "Absolutely fucking NTA, people are too easily swayed by a sob story. Don’t let them gaslight you into going along with it.", "NTA\n\nYou assessed the situation correctly.\n\n> i told her if she didn't think about how leaving us would make us feel why should i worry about what i said made her feel\n\nYour sister and grandmother have the mistaken notion that when someone asks for forgiveness that it must be given.\n\nIt doesn't.\n\nAlso, it's telling that your mother doesn't want to earn a place back. She just expects to waltz back in and everything is wiped away and she can play happy family.\n\n> she wasn't ready to be a mom and felt we were better off without her,\n\nThat's bullcrap. She didn't do this for you. She did this for her. So she hasn't even done the self-examination to see her real, selfish reasons for doing this.\n\nAlso, I notice she expressed zero concern or interest what her absence did to you. It's all about her.\n\nYour mom hasn't changed. It has been and still is about what she wants. Back then she didn't want to be a mom. Now she wants to be a mom.\n\n\nGo over to the /r/raisedbynarcissists sub. If your mom sticks around expect to see a lot of that from her.", "NTA but missing some context.   If your mom was say a junkie or exceptionally young, I could see her having a solid point about being better off.  If you mom was just…I want to party all the time immature, well screw that.\n\nI am not saying forgive her, but at least get to the root of it?  Then judge.  However, if as you say it was just not ready, need my freedom…then yeah.  That’s pretty low.\n\nStill, as I said, NTA at all. You have questions only she can answer, and until then, do what’s right by you.", "NTA. I'm in the same position, man. And you wanna know what? After I attempted to establish a relationship with her, she became extremely verbally abusive and almost physically a few times. I took it for two years, and when I stood up, she finally kicked me out. These kinds of people rsrely deserve a relationship with people like us. They dont want to acknowledge the hurt they have caused you for years and years.", "NTA your sisters can make their choices and you can make yours you owe nobody anything.", "NTA.  I would also caution your sister and grandmother, and do a background check on your birth mom.  Why now? And what does she expect this mother/daughter relationship to look like?  Does your mom abuse substances, is that a factor in why she was gone for so long?  Also, what does your grandfather think about this?  And what about your aunts and uncles, what was their version of events when she left?  Make sure that you and your sister are in therapy to learn some coping techniques as it relates to your mom.  I strongly believe that she will abandon your sister, again, but this time she will remember it.  And you have every right to put up your defenses and have boundaries when it relates to your mom.", "NTA and your sister doesn't know what she's talking about. \n\nCan't just do that to you she's gotta be willing to LIVE THE APOLOGY and do the goddamn work to make it right.\n\nI'm sorry you're going through this. I wouldn't entirely reject your mother 100%, depending on whether she's willing to invest in really making it right or she just wants to feel better about herself. \n\nIt's possible she has changed. Please do what you need to do to find out before you write her off 100%.", "I mean its astounding but also so naive of your sister and grandmother to so easily forgive your mother like that. Idk if I have it in me to do the same. NTA.", "NTA. Trust like respect is something that is earned. You choose who has the privilege of being in your life - no one else. It’s good that you were honest about your feelings.", "NTA but slightly disagree. It's not that she isn't ready for her mom. She just doesn't want her in OP's life and that's OK. The woman hurt her so why should she invite back into her life a person that crushed her emotionally as a child?", "You can if you're a narcissist.", "And even more than her feelings being valid, her actions are justified. Feelings are almost always valid - we can't change how we feel. We can only change how we act. And anyone who isn't blinded by \"FAMILY FIRST\" thinking will understand her actions. NTA.", "She said that and I should have mentioned when I was a baby my grandmother and grandfather took care of me while she was out on the road with my dad who is as much of a deadbeat.", "I'm sorry you went though all that I hope your doing better ^^", "My mom doesn't but my dad used to chew cause of his teeth, i don't know how he is now but I will take the advice and pretty much none of my moms sisters or brother want anything to do with her, my uncle can't stand her for the exact reason, thanks for giving some good advice, we for my grandfather he unfortunately passed away almost 5 years ago from lung cancer but hr was also disappointed in her", "My mom doesn't but my dad used to chew cause of his teeth, i don't know how he is now but I will take the advice and pretty much none of my moms sisters or brother want anything to do with her, my uncle can't stand her for the exact reason, thanks for giving some good advice, we for my grandfather he unfortunately passed away almost 5 years ago from lung cancer but hr was also disappointed in her.", "I've considered at least being civil with her for my sister's sake, i will not be afraid to tell her off if she hurts my sister though", ">everyone deserves forgiveness\n\nThat's just so patently untrue.\n\nAnd it frames \"forgiveness\" as something you do for someone else, instead of something you do to free yourself.", "it is possible OP's bio mom has genuinely changed but if so she needs to recognize OP's justified emotional position and be willing to work through it, she's a young lady now she's not a five year old child  :(\n\nher mom just missed the most important parts of her life when she needed her the most", "Ahh so just…..didn’t want the burden.   Yeah.  Fuck her.  No offence, but 100% NTA", "No offense taken", "Why now? She's had 16 years to get \"ready to be a mom\" to you. Now you're an adult and your sister is pretty much on the cusp of adulthood, she wants to be the mother in your lives?\n\nIt's doesn't work that way.\n\nWhat is she really after?\n\n&#x200B;\n\nNTA, proceed with caution.", "Why does she think she gets the privilege of being your mom again? NTA", "NTA \n\nIt’s totally fair for you and your sister to have different opinions and feelings about this. Your experiences were totally different. I suspect you both need to hear that.", "NTA but it seems you could use more consulting not to forgive your mother she deserves your anger, but really just to stop being angry because it’s not going to help you in life. I say this as someone who used anger as a crotch and is trying to quite.", "NTA. You do not owe her a relationship. You’re your own person and you get to decide who you want in your life.", "NTA.  Tell your sister and grandmother that you are done letting your mother set the terms of your relationship.  She made the unilateral decision to leave you 16 years ago.  She doesn’t get to unilaterally decide she’s going to be back in your life now, especially not as a mother, since she missed your entire childhood.  You’ll get over it when YOU decide you’re ready.  None of them get to make the decision for you.", "NTA \n\nYou weren't harsh. You told her the truth. She doesn't get to play the victim now. Sucks for her, but you do what's best for you.", "NTA", "Nta now she comes back when all the hard work of rasing yall is done .smh  she has some nerve  i would of told her to kick rocks", "NTA , you dont get to pick and choose when or what parts of parenting you want part of , its a whole other human being with thoughts ,feelings ,emotions, and at all stages of life need you , as soon as parent chooses to prioritize something other than their child thats on them i speak personally from experience i cut out completely the parent who offered no security and would have no issues abandoning me .to that fucker it was a normal Tuesday to me its a burning pain in my inner child and memory ,a big fuck you to child that’s physically a part of you . \n\nOoooo you have more than all the right to say no to that relationship and you didn’t interfere with wether your sister or grandmother wants a relationship thats their choice . The three of them need to understand there was no effort of trying to be there or have any relationship of any kind FOR 16 FUCKING YEARS. YOU CAN SAY  NO ,AT THAT POINT YOU COULD EVEN SAY FUCK YOU TO HER FIR THE AUDACITY TO OPEN THAT WOUND AGAIN .", "NTA.", "NTA. My oldest sister left her kids at the babysitter's when the older one was 5 1/2 and the younger one was not quite 3; our folks raised them. She then spent the next 20+ years telling anyone who would listen that our mom \"stole\" her kids and wouldn't let her see them. You seem to have come through your childhood fairly well. Don't let this woman ruin it more than she already has. Like you said, your sister can have a relationship with your birth mother if she wants, but you are under no obligation to do so.", "NTA you do not have to welcome her with open arms. Go at whatever pace you feel comfortable with; even if that is no contact with her at all!", "NTA you made your mother cry once, as a consequence of having to face what SHE did. How many times did you cry over her? She doesn’t get to decide to be your mom now. You decide if you want a relationship, and no amount of guilting from anyone should change that.", "Absolutely NOT TA.  She made a choice and is now suffering the consequences of that choice. I will never understand how a parent can do that and then show up 15 yrs later and think saying \"sorry\" is going to make up for 15 years of NOTHING.  Stick to your guns and keep her out of your life.  She hasn't been a part of it for 15 years. it shouldn't be a problem to continue that dynamic.", "NTA. You shouldn't trust her. That doesn't mean your sister shouldn't have some kind of relationship with the egg donor if she chooses. Just keep your thoughts to yourself right now and be there when your sister will most likely be hurt to comfort her without judgement.", "NO NO NO NO! You were not harsh. You are entitled to feel how you feel and you were correct. Please go see a therapist because you need someone who can help you get through this, with *this* being the pressure you're going to be under to accept your mother. NTA", "16 YEARS!!!\n\nSome things can NOT be forgiven, or forgotten.\n\nNTA OP.", "How old was your mother when you were born?", "NTA", "Nope NTA, You are not the AH, don't forgive until you are ready...If ever....People think I am sorry replaces all kinds of horrible behavior. It doesn't. Let her earn it if you want...You remember her, the damage was done to you, your sister doesn't", "Im not sure exactly but I think she was in her earlier 30s", "Nah definitely  not .not everyone deserves forgiveness", "* you THINK you can if you’re a narcissist cause you’re obviously the best thing since sliced bread. (Extreme /s)", "Ya, be cautious. I have addicts in my family, and I have seen this kind of behavior from various relatives, disappearing and reappearing and their kids and the parents or grandparents get taken for a ride.  Something happens, they hit rock bottom, then come crawling back with some demand for forgiveness and woe is them story and there is always some enabler in the family who then comes down on anyone who doesn’t believe it.  First it is, “I am changing my life, and forgive me.” .  Then shortly after it is a need for resources (housing, co-signer, money, car, fill in the blank).  Then the enablers dive in, and then a few months later, it’s “ I am moving for a job opportunity…”. because ultimately they cannot keep up the act and they know they will be seen drinking, doing drugs, etc.  then they are off to the races, and maybe they steal from you, pocketed a credit card or something while staying with you, some blank checks from grandma, jewelry, and then grandma needs money to pay for the credit card bill.  And then they call to tell you the job is not what they expected, and they need money to move to another city for a job, and eventually, they are gone for months or years without a word.  \n\nBe careful, trust your adult instincts, get therapy, this shit does a number on you, especially when they pop back into your life, whether if is addiction, mental health or narcissistic personality disorders, they can really ever give you need from them.  And her story is not enough. Where did she go, why did she leave, why didn’t she reach out to anyone all this time, what does she want, etc.  you have every right to ask as many questions as you want.  And you should ask these questions with your grandmother and sister present, and a trusted aunt or uncle familiar with the situation. And you give the aunts/uncles that they say nothing during this conversation, they are their as record keepers.  So that she can’t lie, or back out of whatever commitments she is saying that she will make.  Really instruct the aunt and uncle not to engage.  Take a few breaks and step outside and have private conversations with them, then come back in with new questions based on what aunts/uncles tell you.  I worry for your sister.", "it would be wise to keep an eye on her (friends close, enemies closer!) for your sister's sake even if it is only to determine what are her true motives\n\nI suspect a couple motives, it would be my mission to figure out which are accurate:\n\n* she has genuinely grown & changed, experiencing some fundamental shift and wants to reconnect for good reasons\n* she is dating someone who has made her feel guilty for her prior actions so she needs to make it look like she cares (image issues)\n* she realized she's infertile and will never have other kids and somehow it suddenly matters (?)\n* she needs a place to live\n* incurable disease, needs children to care for her before she dies (early planning!)\n* she needs money for something and somehow thinks she can get it through you guys (doesn't make sense, you're too young)\n\nI'd just be cautious to figure out if she is motivated by altruism (people rarely are) or if she needs something. I don't like the self-centered motivations. I'd be skeptical and keep an eye out for your sister.", "Even if the mom has truly changed, OP has zero obligation to let her mom be in any part of her life. Or to feel any guilt over it either.\n\nI’ve found making someone wholly irrelevant in your life is often more powerful than forgiveness.", "I am considering being civil with her for my sister's sake, she is still married to my deadbeat father, and she had her tubs done after she had my sister the day before she left, but thanks for the advice i will keep a good eye out just for mh sisters sake.", "> OP has zero obligation to let her mom be in any part of her life. \n\nI don't disagree but it is a deep pain in the soul to be abandoned by your mother and I'm sure we both may understand how any child (deep inside) could truly fantasize their mother will come back and want to love them. \n\nSo my suggestion is for OP's peace of mind if this is an issue.\n\nFor example, if her mother has self-seeking motivations and this is a hollow effort, better to know this and reject it and be confident in this rejection. \n\nIf her mother has genuine intentions (but not good enough for OP) then at least she can know this and perhaps observe how this goes for her sister and see what she thinks. \n\nBoth being optional, some people don't care about the truth, others do.", "Sure, I can understand how “some” children may have that fantasy rather like “some” adoptees seek out their birth parents. But many do not and just don’t want them in their lives. \n\nSame with OP and her mom has zero say if OP rejects any relationship with her. (That said, I can see how small visits could be quite therapeutic for OP, but that’s only if that’s what OP wants).", "NTA\n\nYou owe this woman nothing. You didn't ask to be born and she hurt you by leaving you in a way it didn't really hurt your sister. That's on her. She felt bad and cried? Good, she should, she was a shitty person and a bad mom. Feeling bad is the *correct* response to fucking up.\n\nHer feelings are pretty much irrelevant. You're the injured party, you get to set the pace of this and your own boundaries. If you never want to see her again, that's reasonable and don't let anyone try and force you to. If you're willing to be around her but not to hold your tongue, let her and the other people in your life know so that they can plan appropriately. If you're willing to be gracious enough to be cordial with her, that's very kind and understanding of you, but even then she has no right to call herself/act like your mother and needs to respect what boundaries you set.\n\nYour sister is excited and doesn't really feel the same hurt you do about the abandonment, she wants this to go well so she'ss angry at you for messing it up which is understandable of her because teenagers are morons sometimes. Remind her that she's welcome to do what she wishes, but you remember that woman hurting you even if she can't and have no desire to interact with her. Your Grandmother is probably having some complex emotions about this but likely both wants her daughter back and wants you to be okay. It might be worth telling her that \"letting it go\" in this case requires moving past it, which means never having to see that woman again. \n\nResponding to someone who seriously hurt you with hate and revulsion is never the wrong response. Not everyone does, and some people do change and get forgiven for it, but you should never be required to forgive or forget someone hurting you. And you deserve to have your boundaries respected, even if those boundaries are inconvenient/hurtful to others", "NTA. You know what’s harsh? LEAVING A 5 Y/O AND A NEWBORN AND NOT CONTACTING THEM FOR 16 YEARS. She can shove it.", "NTA on the title alone you poor child. My deepest sympathies to you and yours. If you are ever around the SF Bay area I can't promise you (but will do my best) a place to stay but you will definitely have a kind ear. Please be kind to yourself, you don't know just how much that small difference makes.", "NTA you are respecting your sisters decisions and she should respect yours", "NTA - She abandoned you, you were just her back in kind.", "It's easier for your sister, she does not have memories of mom. You, however, quite clearly remember being abandoned. There is absolutely no rush to allow mom back into your life. Tell your sis and grandma that trust has to be earned. And in this case you are not ready for a relationship. And that if they continue to force this, it will cause a rift between you. If they want to see mom it's their choice. Please respect your choice.\n\nNTA", "NTA, and no one gets to decide how you feel. Your grandmother telling you to \"let it go\" is extremely dismissive, especially when she's aware of the damage it has caused you and the help you've had to seek because of her absence.\n\nYou are an adult now. You are not obligated to let her back into your life. Family isn't about blood. It's about who we choose, and who chooses us.", "Here's the thing about forgiveness:  it's not something you do for the forgiven. It's something you do for yourself. It's choosing to lay down a burden you've been carrying. There's an old saying: Hating someone is like drinking poison, and hoping THEY die from it. This is related. You hurt yourself by maintaining your rage, and achieve nothing. It keeps your old, past pain front and center of your feelings, and for what?  You can't unfeel it, you can't undo it, you can't fix it. It's over and done with, except that you are ongoingly injuring yourself. \n\nIt's not about your mother and it's not about your sister. It's about you. \n\nI'm not calling you the asshole, but that's what forgiveness is for.", "Of corse she’s ready now ur all grown the hard work is done", "NTA.  She doesn't get to just waltz back into your life with a 'whoops, sorry, wasn't ready then, am ready now!'  (now that you're all grown up and the  work and responsibility is over with)", "NTA.\n\nShe abandoned you, you have zero obligation to her in any way, including forgiving her.  You're and adult and you've made your stance clear, everyone else needs to accept that.", "NTA but also, you never know what life will bring. You may not be ready for her now, you may never be ready for her, and that is definitely okay, but one day you might regret what could have been having not developed even just a corjal relationship with her. Life is quite short, sometimes shorter for some than others. I'd just say, think about it in the future when the hatred subsides and you can think more clearly.  You may find that forgiveness is an easier wall to climb in the future. I know I did with my father.", "NTA and while your sister can do whatever she wants, you have no obligation to waste one minute on your egg donor. I can't believe your grandmother would defend her. SMH", "NTA..  all mum rights went years ago, you owe her nothing, she gave you nothing. moving forward whatever relationship you have with her, if any, is purely your call..  by the sound of it she may be going to try and stick round which will potentially drive a wedge between you, your sister and grandparents..", "NTA\n\nSo, she wants to be a parent now that all of the all of the heavy work of parenting is over?  Fuck that.\n\nYou don't owe it to anyone to have a relationship with your birth mother.", "NTA. Maybe you made your mother cry once. But how many times did 5-years old you cried back then ? \n\nHer betraying you was a core memory. You spent the 3/4th of your life trying to heal from it.", "NTA", "NTA, I’m honestly I’m damn proud of how you answered.", "NTA. When a parent does this it’s an extreme Hurt. My father basically abandoned my brothers and I when we were Very young. He came around Some if he didn’t have anything else to do. He’d take us to his parents which I’m Truly grateful for. My grandparents were our saving grace. Even with all of their love and care what my father did so long ago still hurts. It always will so I understand OP. NTA.", "NTA \n\nIf she really wanted you to accept her back she could of kept in contact as simple as a small letter every year or so your mother gave a expression that she didn’t want you guys so now you dont want her", "NTA  \nFrom personal experience I had to let go of my father leaving when I was a kid (pre-2 years old) in order to meet him years later.  \nI had to come to terms with it and let it go so I could heal from it, him healing wasn't a thought for me.  \n  \nIn the end he moved to where I lived and we agreed that we couldn't have a father son relationship, that option was long gone. However we could work on just being friends and thats what we did.", "NTA\n\nYou have no obligation to your birth giver.  She's not your mother and certainly didn't behave like one between your age of 5 and now.  She just birthed you and that's it.\n\nYou have/had a lot of trauma over your mother actions.  You can learn to forgive and grieve the mother you didn't have but it doesn't mean that you have to forget.  You don't have to have a relationship with her and you are allowed to protect yourself so that you aren't hurt by her again even if you do let that hate for her go.\n\nYour sister doesn't have the right to tell you what to do.  She can do what she likes and if she does want to be in your birth givers life that's her choice but she can't expect you to do the same.\n\nShe may or may not have changed.  She may have realised what an arse she was to you and realises it was a mistake and she did the wrong thing and wants to make up for it.  You are not the 5 year old she traumatised when she left and thinks she can just waltz back into your life like nothing ever happened.\n\nYour sister doesn't have that same trauma as you for many reasons and not just that she never knew her as her mother so isn't putting herself in your shoes and understanding where you are coming from.\n\nYour sister may be in for a lot of disappointment in the future if your mother really hasn't changed.\n\nIt's okay to perhaps get to know her over time and you may be more open to a closer relationship but no one gets to demand you be in a relationship with her.", "> everyone deserves forgiveness\n\nThen they can get it from whatever deity they believe in. Those wronged in such a horrible way as this do not OWE anyone forgiveness.", "You're just so wrong....", "It doesn't just require the mother to change, it requires OP to be in a spot to actually want her around now and she may never which is fine for OP", "It's normal that you'd have these emotions. A person can't just jump straight back into your life and say she wants to be a mother and expect you to accept that.NAT", "NTA. She wasn’t there when you needed her the most.", "NTA.  You don't owe yourself to anyone.  You don't owe her a daughter or a relationship.  You possibly need to forgive her for yourself, to help heal from the pain she caused you, but that doesn't mean you have to have a relationship with her.\n\nThis woman left you when you were 5 years old.  You remember her, you knew her, you felt the sting of being abandoned by someone who is supposed to always be there for you.  Maybe she's right that you were better off without her, but that doesn't remove the impact her abandonment had on you.\n\nIt's okay for your sister to want a relationship with her, but not to get angry at you for making her cry.  Your grandparents probably want her back in your lives, but that doesn't mean they should tell you you need to \"let it go\".", "Why in the world would anyone want to be near a parent who abandoned them?  NTAH.", "NTA. Just a thought: Will your bio-mom playing house now undo the damage done to you? If that's not the case shouldn't you decide whether to reconnect on your terms than someone else? So you are not AH.", "***nta -  they say, whoever they is, that forgiveness is divine.***   \n\n ***It's okay if your birth mother cried.   I certainly wouldn't have cared.***   \n\nWhat's sad is your birthmother causing pain between your sister and grandmother.  \n\n**Your birth mother will more than likely walk out again.**", "No, you aren't that asshole. You're justified in protecting yourself from being hurt again. That being said, holding onto major resentment isn't doing yourself any favors. It can harden you to good relationships with others and cause you grief down the road. It might be a good time to consider counseling to work through any lingering damage from being abandoned.\n\nPlease don't think I'm taking a sneaky route to suggesting you let your mom back into your life. I'm not. This is completely about you making sure you can be happy and healthy and able to trust other people you get to know as friends.\n\nAt some point, you may change your mind about giving your mom another chance. In the meantime, it's fine to give a firm no to both your mom and grandmother. Your sister is free to do what she wants and your mom just needs to learn to accept that it's not time and may never be for you to be willing to be friends with her.", "NTA You are 100% correct that one sorry will not fix things. After 16 years of abandonment, your \"mom\" should have expected that you would learn to live without her.", "NTA.", "N T A\n\nI wouldn't trust that woman at all.  She is your birthgiver - she isn't your mother.", "NTA. Kind of suspicious how your mum chose to find you as soon as you are an adult. Wouldn't be surprised if she decided to look for you now since you are old enough to look after yourself and wants you to look after her instead.", "\"said she wasn't ready to be a mom and felt we were better off without her, but now she was ready to be a mother \"  \n\nWell it took you 16 yrs to get ready to be a mother. Well I'd like the same courtesy. I'll let you know in 16 yrs if I feel like having. a  mother.", "NTA. She can't just stroll back into your life without dealing with the hurt and pain she caused. Mom wants the Instafamily\n\nYour sister has no idea the hurt she caused you and Grandma shocks me. She seems like those \"But we're Faaaaamily\" people\n\nShe hurt you to the core. Nta", "op-=nta\n\nJust how does she intend to be a Mother now that she's ready to be one????\n\nwill she diaper your sister?  Teach you about your first period?  \n\nBasically, she's shown up when there is no work/effort left in parenting you and your sister.", "Obviously NTA. She made you cry so many times - it has it's toll", "His sister may be in for a lot of disappointment in the future if his mother really hasn't changed.", "⬆️⬆️⬆️ \n\nOP, NTA, for sure.", "THIS RIGHT HERE \\^\\^\\^\\^\\^ \n\n&#x200B;\n\nTotally NTA OP! \n\nShe only wants back in because you're already grown and she won't have to raise you now.", "You are entitled to your feelings an be your Mother needs to respect that as do your Grandmother and sister. If and when your feelings change and you decide differently then and only then make contact with your Mother.", "Yo, first off <3All that shit is so heartbreaking.\n\nNTA\n\nAll big feelings shared by each party in your story is all true.Including yours.\n\nIt sounds like you can empathize with the other people in this situation just fine but you are choosing to keep your trajectory: You came to accept the rejection and loss of a mother, you put in all the agonizing leg work to get yourself to a place to be at peace with it.You will do what you need to protect that peace from someone who already did so much to destroy it when you the most helpless.\n\nIt is possible that she also agonized over their choice and also had to put in a lot of painful work to bring herself to a place where she could face you and ask for forgiveness. And there might be some appreciation for that but there's zero obligation.This much is her journey, not yours.It isn't your responsibility to make she her journey is a pleasant one.", "You're 21, sure is easier to be a \"mother\" to adults than children now, isn't it? It's convenient that she feels ready now that the window has closed up and it's too late to have any significant impact on your life... in fact, it might as well be a complete stranger offerring to be your mother here (and of course anyone would turn down a stranger).\n\nNTA OP and I'm sorry you're having to deal with this. Your sister can feel how she wants to about her relationship with this person, and you can feel how you want to about yours. Neither of you girls are As even if bio mom was.", "Nta the mom completely forgot what she did to you she never thought about how this was going hurt you but for your sister just to accept her is crazy she only there for something and you sister is gonna find out the hard way and cut off your sister till she realize who was really there for her", "NTA. She doesn't get to waltz back into your life just because she's \"finally ready\". You're 100% entitled to your feelings and to not want her in your life. \n\nI totally relate the your comment about hating seeing other people with their mothers. I was raised by an abusive mother and even to this day, 15 years after cutting contact with her, it still pisses me off when I see good mothers.", "NTA.  OP is 100% correct.  Egg donor didn’t give a crap about her kids for 15 YEARS.  Probably needs a kidney transplant.", "NTA but we don't blame the sister at all, Mum is the one that caused all these extreme feelings, and we hope you both don't let her come between you now.", "[removed]", "How’s grandma’s health?  Or grandma wants it all healed and there is some monetary gain in this through that situation.", "OP’s mom already showed she wasn’t genuine by crying at one kid that the other didn’t forgive her. She has not become a worthy person. OP was right.", "NTA- \"Let it go\"? Wow, grandma's desperate not to take the rap for raising the woman who abandoned you, hey? Sorry, grandma, the only thing OP knows about this person is she places her wants above the needs of the people she's responsible for, you can't expect her to want to know that person.", "NTA - Your feelings are completely valid. \n\nThat being said your sister’s feelings are completely valid. And maybe she is worried that your behavior towards your mother is going to make her go away again. \n\nBut if that’s the case then she isn’t ready to be a mother yet. If she can’t handle the consequences of her actions, and the emotional repercussions of her leaving. She can’t expect there to be no reaction to her coming back. \n\nJust let your mother know that you have no interest in a relationship but that should have no impact on her relationship between her and your sister. That should solve thd drama between you and your sister.", "NTA- Let her die alone.", "Unless your name is Elsa and you can shoot ice out of your hands you don't have to let anything go.\n\nNTA", "Need to let it go that your mom left for 16 years and just pops up ready to be a mom now???? You don’t need to accept her back at all, your sister can do what she wants but you need to talk to her and explain if you aren’t mad at her for forgiving 16 years of abandonment then she can’t be mad you for not forgiving.NTA but your mom is", "\"She wasn't ready to be a mother. I'm not ready to see the deadbeat who abandoned me.\"\n\nNTA", "NTA - everyone already explained why so I’ll just say props to your grandma who had to be somewhere in her 60s and took care of you guys", "NTA you have a right to be upset your mom abandoned you and your sister and spent your childhood without her and had issues and had to get counseling. Your mom said she wasn’t ready to be a mother that’s her reason and if she wants to try to be in y’all lives ok but a simple sorry like you said isn’t gonna make up the years of damage and pain, the feeling of not being wanted. Which I’m sure your mom loves you and your sister but she can’t just come back to play mom, I’m surprised your grandmother doesn’t feel some type of way especially since your grandparents raised you and your sister. And your sister is a teenager and probably wants the relationship wants to have a mom, maybe she doesn’t see how this could go bad or that maybe your mom will hurt her again. You shouldn’t have to feel bad for telling your mom how you feel and your mom getting upset.", "Bro mom was around 35 when she left she like 50-60 now another 16 years and she might be dead … great idea", "Bro the mom left at 35 because she thought they were better off without her and then at like mid 50s - 60 she came back after they already got over her because SHE wanted to be a mom and apparently thinks they are better with her. No trust should be given to this woman as she is a deadbeat narcissist", "… bro you sound stupid trying to sound smart… bro where does op’s say they hate them… frankly op is a lot more civil for someone in that situation. She got a counselor, got help, and was recovering. Then comes back dead beat bitch who is reminding her of the ugliness of what her problem was. She don’t need to forgive shit op was doing fine learning to forget and appreciate what she had. If op truly despised her mom she would not of met the mom, she would have taken the sister away even though the ignorant girl was about to accept a deadbeat back into her life, and she would have been a lot more harsh. That deadbeat bitch was already cruel for abandoning two children and is even more cruel for trying to re-enter the peoples lives who were already forgetting about her. This woman isn’t trying to be a mom now for them she is doing it for herself as those two seem to have done better without her. You don’t get to leave because you think they will be better off without you and then suddenly come back because you changed your mind. You don’t get to “mom” after you left and then feel sad and cry when one of them who understood what you did says “no.” Forgiveness has nothing to do with this op accepted her situation she accepted reality and she adapted she already forgot forgiveness is something the selfish seek out to stop their own guilt not something that should be forced on the victims doesn’t hurt them none. Your little quotes and sayings don’t apply here so just stop.", "Please just delete your comment it’s so fucking stupid", "Could not have said it better myself she is lucky there even giving her the time of day", "Hush, child, the grown-ups are speaking.", "All big feelings shared by each party in his story is all true. Including yours.\n> \n>", "… one adults response is never hush child that’s what low nose brats say when they try to pretend to be grown up. You wouldn’t know but when someone makes a counterpoint to your bullshit you don’t just tell them to hush get your fingers out your ears ya damn brat. What a normal adult does is explain their point even if they wrote it just to look smart when in reality having no fucking idea what they are talking about as they have had a golden spoon thrusted up their ass. Hush child is the most childish and immature thing a person can say when their shit take that was birthed through ignorance and the golden probe is argued against. Look kid if you want to act like a grown up that’s fine but if ya gonna do it put your big boy pants on an argue your point instead of just plugging your ears and going lalala like a five year old.", "Bro the mom left at 35 because she thought they were better off without her and then at like mid 50s - 60 she came back after they already got over her because SHE wanted to be a mom and apparently thinks they are better with her. You see in the non-privileged club we call this a narcissist", "No, you don't need to let it go. \n\nThat is sixteen years of trauma, all your major milestones, all the important talks, all the periods of distress and confusion that come with growing up even without considering doing so without a mother, and every last bit of it missed was by a woman who wasn't ready to be a mother until her daughters had pretty much raised themselves.\n\nYour mother does not get to just walk into your life give an apology and expect immediate forgiveness, and fuck both your sister and grandmother for trying to insist otherwise. Your sister and grandmother do not get to police your feelings, and I wouldn't fault you if you screamed and spat at them for it. How disgustingly selfish do you have to be to expect someone who suffered to roll over and take what was done on the cheek just so they can have their happy reunion. Like, it's honestly pretty horrific how little of a fuck they seem to care about what you experienced, and you're not even trying to withold your bio-mom from them. They wanna meet her that's fine, but you don't have to.\n\nNTA", "NTA", "NTA obviously.\n\nBut also I.N.F.O? This reads a lot like your grandmother knows more about whatever your mother did over the years. Have they stayed in contact?", "NTA. You didn’t make your mother cry. Your mother would be grandma. The … person, who you made cry was nothing but your egg doner.", "NTA.   Would it help to explain to sister that she has no memory of this woman, but you do and remember being abandoned and (respectfully) sis cannot even comprehend how you felt then much less now?     \n\n\nYou're an adult and have the right to stay NC with your mother for as long as you like.  Some bridges get burned permanently.", "NTA\n\nYou have the right to feel how your feel. Your sister can feel how she feels about your mom. You do not need to accept her back in your life, nor even care how she feels. She left your for 16 years. Now, when all the child raising is done, she wants to be a mom again. What does that even mean? She wants someone to love her and make her feel special? When she left you two on your own, not knowing why she left? \n\nNah, she can stay gone.", "NTAH when you needed her she left no went mute 16 years is a lot too many years. Your sister doesn’t get because she never really knew her . If they say your harsh they are the AH’s one sorry can’t fix all the 16 years of trauma. You ended up hating seeing other girls with their motets it wasn’t their fault and you understood and went for help that’s alot", "Op you are NTA. Nor are you harsh. You are perfectly entitled to keep toxic/harmful people away from your life.  Curiosity has me wondering if your Birth giver now has other kids? Perhaps looking for built in babysitters?  No, you fought hard to come to terms with her abandonment, no reason for you to allow her back in to hurt you again.", "harsh?...HARSH!!! OH HELL NO!!\n\nOpie tell her these words to all of them-\n\n\"Dear sister and grandparents, i believe you remember the struggles i had to go through these past years of my life at the actions of that woman who claims to be my \"mum\". I will not accept her in to my life, if she was not ready to be a mother then I have ALL THE RIGHT IN THE WORLD, to not forgive or let her in to MY LIFE, but please do so as you please, PERIOD!!\"\n\nNTA", "r/iam14andthisisdeep", "Did you not read or choose to ignore the part where she said she didn’t want the BM in the picture at all. From what I read her soul feels fine without her mother around, and she doesn’t fantasize about having her in her life.", "NTA I was the eldest too with an estranged father since I was ten. My siblings resented me at some point for not having a relationship with my father, but as pointed out I had more of a history with him during to being older. Therefore I remembered more of what he was like ( an abusive alcoholic) and shielded them from it to a degree.\n\nSecondly as adults they rekindled a full relationship and it wasn’t long before he showed his true colours again. They are all now estranged from him and have acknowledged I was right in not being involved with him.\n\nMy point is for you that your sister has probably idealised the mum role in her head and is excited to have this person fit into that role. Whereas you remember this person, your mum, for who she actually is. You have a more real perception of what happened and how it affected you. So it is up to you whether you start to repair a relationship or not, it is no one’s place to attempt to guilt you into it or not. Especially as they cannot guarantee (like with my siblings) that it will end well and that there will not be further repercussions you will ultimately have to deal with.", "NTA. Never let ANYONE  tell you how to feel.", "NTA. The thing is that she may be ready to be a mom fifteen years later, but...you aren't five any more. You grew up in her absence. You're an adult and her absence hurt you immensely - and her coming back now doesn't erase the effects her absence had.", "Nta.  Honestly you're better off without knowing her, now.  It wasn't always thus but is now", "Support your sisters choice but explain that you will not have contact and its your right to do so. Dont fight with anyone. Be firm and they will accept it. Stay close to your sis. She may need you when your mother abandon her again", "NTA your grandma is an asshole and your sister is immature.", "NTA\n\nYour response was totally justified.\nI'm side-eyeing your grandmother and aunt a bit here. They didn't know if it was a lunatic posing for your mother, yet still took you to meet her? Nuh-uh.\n\nI somewhat understand where your sister's coming from. At her age, I had fantasies of my real parents coming back in my life.\nIf it had happened, I would have been overjoyed and blind to any other consideration.\nIt's unfortunate, but she probably can't help idealizing her mother.\nShe \"finally\" came back. She \"finally\" is ready to love her !\n\nShe'll have to learn by herself, as she grows up (and sadly as her mother shows her uncaring side) that that woman is not \"mom\". \"Mom\" would never have abandoned you two to begin with. \"Mom\" would have made a lot more efforts than simply waltzing into you life as if nothing had happened.\n\nIt's going to be painful, and twice for you.\n\nSurround yourself with people who understand, or at least support you. Be there for your sister if you wish to, but take care of yourself first.\n\nI wish you the best.", "NTA\n\nYour mother left you and made you cry for over a decade So totally valid if you also need your time to be ready for contact. \n\nYou do not abandon your children and just sit there and ask for forgiveness. That's not how it works.", "NTA. Your mother, sister and grandmother really can't expect you to just forgive and forget.", "How disgustingly selfish do you have to be to expect someone who suffered to roll over and take what was done on the cheek just so they can have their happy reunion.", "Why the hell would OP do that for a coward who abandoned their child for over a decade?", "No the hell they don’t, OP’s “mother” abandoned then for over a decade, don’t preach forgiveness when what they did was unforgivable."]}