{"id": 25059, "submission_id": "15vql9d", "title": "AITA for Refusing to Help with My Ex-Wife’s Medical Bills?", "selftext": "Almost three years ago, my ex and I finalized our divorce after 1 and half decades of marriage. Our marriage did have its goods and bads, but the biggest stress was our communication. There were misunderstandings, times when we didn’t see eye to eye, and moments when it felt like we were on different wavelengths. However, we shared two wonderful kids together, Jason (13) and Mia (10), and post-divorce, we agreed on joint custody to ensure they received love and care from both of us.\n\nLast month, I was informed by Angela’s sister that Angela had been diagnosed with a significant medical condition. The treatment was extensive and, even with insurance, was going to be a financial burden. Given the circumstances, Angela reached out to me, asking if I could help contribute to her medical bills “for the kids’ sake.”\n\nI’m in a fairly decent financial state, but I’ve always had to be careful with my spending to make sure of a secure future for my son and daughter. Just thinking of paying Angela’s hospital expenses made me think on our past and how our marriage had been. While I want the best for the kids, I also felt that taking on her medical bills might not be a responsibility I should bear. \n\nI told Angela that I would continue to support Jason and Mia in all the ways I’ve committed to, but I couldn’t help with her medical expenses. She was understandably upset, expressing that I was neglecting the mother of my children in a time of need.\n\nNow, as I think over the conversation, I’m on the fence. While I believe I have the kids’ best interests at heart, I wonder if my decision might come across as insensitive or neglectful to them.\n\nSo, AITA for refusing to help with my ex-wife’s medical bills?", "created_utc": 1692476646, "permalink": "/r/AmItheAsshole/comments/15vql9d/aita_for_refusing_to_help_with_my_exwifes_medical/", "score": 57, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am refusing to pay for my kids moms medical bills while she is drowning in debt. This could result in her losing everything.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. As has been suggested, maybe take on the bulk of your kids’ expenses while she’s going through this situation so that she doesn’t have to stress about it and will have more money to pay for her medical expenses.", "NTA. \n\nYou don't have any obligation towards her. It's the children you have one towards, but her? You're not her husband anymore, why would you?  \n\n\nINFO: did this happen in your marriage? Her trying to get you to put in more money for something?  \nAlso, maybe you could tell her you can take on the children's expenses instead of going 50/50 as I assume you should be going. That way all her money can go into her treatment. And by expenses I mean schooling and the supplies, clothes, food for the kids, outings, etc.", "Nta\n\nYou are divorced, so none of *her* medical expenses are your responsibility. Your kids are. So if she won't be able to properly care for your children, tell her that the assistance you can render is taking custody of the children.", "NTA. It is hard to not be there for someone you were there for such a long time. She will always have the right to care, and she will need to carry this burden with all of the consequences to her illness. Now, you will need to be there for your children no matter what. This will be a hard time for them, and it may be even crucial to support them in seeing their mother and giving them extra love through this difficult time.", "NTA", "NTA.  It is inappropriate for your ex-wife to ask for additional financial support for her treatment.  You can support her by taking full custody of your kids while she’s in treatment but please do not give money to your EX-WIFE.  Inform her that you’re saving for your kid’s college education.  So inappropriate!  Your EX-WIFE is an adult and apparently has family.  Let her family support her or she may take out loans.  It’s rough on everyone financially.  I feel bad for her but still inappropriate.", "NTA", "NTA You guys are no longer together, and it feels a bit manipulative for her to try and illicit money from you by saying \"for the kids' sake\". She should have asked just for herself. You would still have been well within your right to say no. That's like trying to say buy me a new car or house \"for the kids' sake\" to me. I, of course, would have hoped you expressed your boundary in a respectful way. I'm going to assume so by the way you expressed your side of the situation. You can be empathetic about her situation and still draw your boundary. She should have respected your \"no\".", "NTA", "NTA. While I agree that it's a bad thing that your ex is having financial and medical difficulties, that is no longer your issue. You can offer to have the kids live with you. You can contribute to a fund (if you wish), but there's no reason for you to do more than that.", "NTA, but maybe you should say to her that you will take full financial responsibility for the children, but still allow 50/50 custody", "NTA. Your obligation is toward the children. Paying her medical expenses doesn't make sense to me. You can take on maybe more of the responsibility for the kids given the circumstances, but I don't see why you would pay for her treatment. It'd be extra nice if you did, but it doesn't make you an asshole for not doing it.", "NTA. You sir are divorced, as in not married to this person. This was agreed by a mutual decision according to you. Provide for your kids, make sure they are safe as that is a responsibility you have. Make sure they have what the need. After all she asked “for the kids,” so that is what you provide. Cover the kids extra expenses, make sure they have knowledge for both trade schools and Uni schemes. If you are able make sure they have the option to pursue what they want in life.\n\nMaybe go over things with her, get the school clothes and other things if she usually does like shoes and equipment, as that is a kids expense. But she is an adult, and made her choices in life. I am in the UK though, so my knowledge of the US healthcare system is shoddy, as well as the education system.\n\nIn the end all that is required is that the kids are safe and healthy. If what she has is contagious or something that could cause risk to the kids I would suggest going to court. Make sure any agreement is legal and binding, with a contract. Maybe when doing this seek legal council. \n\nFrom the sounds of it this health issue will eventually or already has affected the care and safety of the kids. She said the kids are priority, so work on that game plan. Make sure they are legally the priority. She may be a good mother now, but as the child of a disabled parent, they may need to do more under her care than is fair to ask if there is not guidelines protecting them. That is something I say from experience", "NTA", "NTA.\n\nYou're divorced, you aren't responsible or expected to cover her bills.  Maintain everything with the kids, and if you can offer to take them the bulk of the time while she's in treatment/recovering as a way to be good to them, but stand firm on not paying her bills.  Also, you may want to insist on paying anything for the kids directly (like after-school programs or sports) so she can't appropriate the money.\n\nGood luck.", "NTA. Not your problem anymore.", "NTA. She's your ex. You'll be mote supportive to your kids but her medical expenses aren't for you to pay.", "As an incredibly disabled man, with the only prospect being extensive and expensive medical treatment myself, NTA", "NTA. Your ex-wife’s sister was overstepping to ask this of you. Seems fine to tell you about the medical issue, but it’s not her business to expect to discuss finances with you. And , as usual, people making requests like this are seldom willing to make the sacrifice themselves, but always ready to pass judgment on you.", "Your ex need to apply through the hospital for assistance and a payment plan. You are not her personal atm and it is not your responsibility", "Did she specify a timeframe for how long ex spouse is responsible for another's medical bills after divorce? 1 years, 5 years, till death? No, you two became separate entities after the divorce, she had plenty of time to amass wealth for a potential emergency. The problem will one day probably be your kids because they look at it from different perspective, for them you are still one entity called \"parents\". To them it makes sense that parents help each other. They might think that until they're in their 30s and divorcing.   \nNTA in any way.", "NTA... no matter what you end up deciding. Not helping should probably be the default answer anyways. \n\nInfo though: just for future thought. Think very long and hard and ask yourself 2 things. Would she do it for you? How will your kids look back on this decision? \n\n\nMy parents were never together. My dad did however for years pay support knowing all or most of that money kept my mom afloat even when I wasn't there 50% of the time. Hell, for a while, I was never there. My brother and sister (different dad) needed a home. This made it possible. To this day, I have respect and love for that man that I can't describe. If you decide to help, it's not because it's the \"right\" thing to do. Do it because you truly want to be that damn good of a man. You want them to look back on this and strive to be that good of people when they grow up.  Then help with what you can without significant loss to your life.", "NTA but your reasoning is not sound. Unless she has remarried, any assets she has will go to your kids. Losing them will not help your kids, be honest about your reasons.", "INFO - Or rather a whole lot of info.\n\nWhat is the extent of the \"help with\" that you are uncomfortable with? How many dollars are you being asked to help with?\n\nWhat are the current financial arrangements about the kids? Would you taking a greater amount of financial responsibility for the kids help your ex and would that meet your long term financial plan?", "INFO: Did the treatment completely correct the medical condition or is there a chance your children could still lose their mother?", "The answer would change completely depending on medical condition and cost involved.\n\nGenerally speaking if this is something that will effect her a lot, then it will effect your kids a lot as well  so by denying her help and leaving her sicker and unable to afford treatment you're also denying your kids a happier healthy parent which will definitely have an impact on them.\n\nIf it has an impact on them and they know you could have afforded to help and were asked but denied her, then it will also have a major impact on your relationship with them.", "ESH It depends will she die without this medical help, how will that affect your children and they're future if they're mom is dead or in such debt she can't take care of them.", "Wow at some of the responses here. \n\n\nI'm going to get absolutely downvoted here, but ABSOLUTELY YTA\n\nShe is the Mother of your Children! \n\nThe Mother of the children you claim to love. What kind of example are you setting for your children here? She's not asking for money for a holiday, or money for a cosmetic procedure. She hasn't even been irresponsible by not having insurance. She's not even asking you \"again\".\n\nWorse yet, you're not being asked to re-mortgage or take out huge loans.\n\nThis is like a one time thing. And this IS that one time.\n\nYour children will suffer because of this, and your relationship with them in the future will suffer. You're within your rights not to help, but actions have consequences. \n\nYou're not an ahole, yet... But you will be if you don't step up.\n\n>we agreed on joint custody to ensure they received love and care from both of us.\n\nOh, the irony.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAlmost three years ago, my ex and I finalized our divorce after 1 and half decades of marriage. Our marriage did have its goods and bads, but the biggest stress was our communication. There were misunderstandings, times when we didn’t see eye to eye, and moments when it felt like we were on different wavelengths. However, we shared two wonderful kids together, Jason (13) and Mia (10), and post-divorce, we agreed on joint custody to ensure they received love and care from both of us.\n\nLast month, I was informed by Angela’s sister that Angela had been diagnosed with a significant medical condition. The treatment was extensive and, even with insurance, was going to be a financial burden. Given the circumstances, Angela reached out to me, asking if I could help contribute to her medical bills “for the kids’ sake.”\n\nI’m in a fairly decent financial state, but I’ve always had to be careful with my spending to make sure of a secure future for my son and daughter. Just thinking of paying Angela’s hospital expenses made me think on our past and how our marriage had been. While I want the best for the kids, I also felt that taking on her medical bills might not be a responsibility I should bear. \n\nI told Angela that I would continue to support Jason and Mia in all the ways I’ve committed to, but I couldn’t help with her medical expenses. She was understandably upset, expressing that I was neglecting the mother of my children in a time of need.\n\nNow, as I think over the conversation, I’m on the fence. While I believe I have the kids’ best interests at heart, I wonder if my decision might come across as insensitive or neglectful to them.\n\nSo, AITA for refusing to help with my ex-wife’s medical bills?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: Would more money give her access to better treatment options that might improve her prognosis? Or would she probably have the same outcome either way?\n\nIf your help would significantly extend her life or improve the quality, I feel like your kids would benefit from that more than having a few extra dollars in the future. You’re not obligated either way, but it’s something to consider.", "NTA assuming that your money isn’t required to save her life.  Saving your children’s mother’s life would be the greatest thing you could do for your kids.", "This is a nice way of helping, without paying her expenses directly. If her treatment is unsuccessful you would end up paying 100% for the kids anyway.", "This is the way, also NTA.", "The only reasonable way he could help is taking on the kids' expenses so she can pay for her treatment. Holding someone hostage because \"it will get thrown in your face\" is cruel. He has no obligation towards her, but he can help with the kids more than rn and that will alleviate the financial burden on her. And he should explain it to the kids so mum has no way of trying to twist this.", "Exactly. \n\nThere's more than one way of helping, I've learned that this year after my fiancée almost died from a hemorrhage. We were helped by so many people in so many different ways that didn't meant directly paying the treatment and subsequent surgery. But this particular woman sounds... more interested in the monetary side, otherwise her first thought would've been \"Who's gonna provide for our kids?!\", but that's just my opinion...", "[deleted]", "Or opens you up to a life of manipulation because \"think of the kids\".", "NTA. But it baffles me why when when you live in a country with out a National Health Service that is free at point of use why so many of you don't have adequate health insurance."]}