{"id": 2507, "submission_id": "yx948r", "title": "AITA for giving my daughter's phone away to my son as punishment for something terrible she did to him?", "selftext": "Burner for obvious reasons, but my daughter (15) did a really crappy thing and posted a picture of my son (12) and writing “Roast Me” under it. It was in a private group message but apparently it was screenshotted and ultimately got back to him and his friends in the middle school due to a friend’s sibling. It earned him a shitty new nickname and some very avoidable teasing.\n\nHe doesn’t have a phone because we have a “No phone until you’re 13 rule.” He turns 13 in a little less than two months. We took away my daughter’s phone until after the New Year. This lines up with the fact that my son will be getting a new iPhone for his birthday.\n\nIn my anger, I said that I was giving my son the phone that my daughter was no longer allowed to use. By the time she gets it back, he will have his own. He’s only allowed to use it in the house.  I know it was petty, but I was so damn upset that I just kind of blurted it out. My wife said that I went too far and that it will only lead to resentment between the two.\n\nAITA?", "created_utc": 1668639556, "permalink": "/r/AmItheAsshole/comments/yx948r/aita_for_giving_my_daughters_phone_away_to_my_son/", "score": 124, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I took away my daughter's phone because of something terrible she did to my son and gave it to him because he's phoneless. 2) It might cause further division between the two of them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "This could blow up in a couple of ways. \n\n1. As everyone else has mentioned, it will definitely cause more discord between the siblings. \n\n2. Your daughter is going to resent you. Phones are personal, and you have given hers to your son to use before the age 13 rule. She may very well interpret it as favoritism and shut you out...parents don't often realize that what seems minor or inconsequential to them can be a huge deal for a teenager. What she did was wrong, but giving her phone to her brother was wrong, too. I am afraid it will backfire and she will start seeing everything you do negatively.", "N T A for taking the phone away, that's well deserved. YTA ish for then giving it to your son. Your spouse is correct, this will not teach her the right lesson (which can be accomplished with just taking the phone away) and will instead further pit her against brother.", "YTA this will only cause a greater divide between your two children. You have the right to confiscate your daughter's phone since she has clearly demonstrated she isn't mature enough to use one but to then give it to your son to use until his birthday is only adding salt to the wound. You want him to have access to a phone earlier than originally specified then that's fine but give the kid his new IPhone & keep your daughter's under lock & key until her punishment is over.", "YTA I think most people here are forgetting how much info phones hold. If it’s a smartphone it will have access to any social media, emails, school stuff etc as well as the normal friends numbers and messages. If you are giving this to your son without doing a factory reset then that is a huge violation of your daughters privacy and sets your son up to be able to do much worse in retaliation. \n\nEven if you do reset it you are going to get a lot of resentment from your daughter to your son. Its a daft idea all round, if your rule is 13 stick to it.", "YTA. You’re definitely gonna cause bad blood between them. This is from a mom of three, and I don’t think you handled that well at all. My husband agrees", "Well there's definitely a risk of escalation by giving him her phone.  Which could be avoided by buying your son his own phone, and just not allowing your daughter to use her phone.\n\nA month and a half without a phone?  Seems very harsh.  Wouldn't a punishment where she gets punished till she learns her lesson make more sense.  Just seems arbitrary and more likely to just make her mad at you and your son then actually learn anything.  \n\nThat's my two cents.", "You're wife is right. Taking the phone away is an acceptable punishment giving it to her brother will only make the relationship between the two of your children worse. If that's your goal than good job! Also punishing your child is one thing, but wanting to hurt them emotionally because you are angry is another thing. Taking away the phone is punishment enough to show that actions have consequences and that she has to earn back your trust and the privilge to have a phone. Taking away and giving it to your son feels more like wanting to hurt your daughter emotionally in addition to the punishment of not having a phone. You said you did this angry. You might want to consider what emotion was truly motivating you to go the extra step of giving her phone to your son.", "NTA for being upset, but your wife is sort of right as right now they're already upset at each other, I'm guessing...so giving one's phone to other will definitely not resolve any issues. I would just hang onto the phone and give it back when you deem the punishment over, then buy your son a brand new phone.", "This will lead to more resentment from her to him. Rn it seemed like a stupid thing kids do because they have trouble with empathy and with their siblings. After this it could be worse.", "I'm going to go with a YTA.  I'm not sure if the correct answer is e.s.h, and maybe as more info comes out, I would come to that.\n\nCouple of things:\n\n1.  Your husband is absolutely right that this is only going to cause more issues between your daughter & your son.  That's not fair to either of them.\n\n2.  I feel like there is a lot of context missing here on the picture.  It also sounds like this was a learning opportunity to discuss the situation with your daughter, rather than just lashing out.\n\nIntent... matters.  That's where there are different crimes based on whether there was intent or not.  Posting a picture in a private group chat of her brother (you don't mention it being some kind of embarassing picture), doesn't sound awful on the surface.  Especially as a lot of context is missing.  But obviously - the result sucked.\n\nBeyond posting the picture, did your daughter encourage/cause any of this?  What caused her to post the picture and say roast me? \n\nTo me this seems like an opportunity to talk to your daughter about unintended consequences of posting stuff online, even if it's private.  You yourself mention you were \"so damn upset\" - it sounds like you reacted from the hip, rather than really thinking this through and parenting.", "YTA this is going to cause further problems.  Just take the phone away and stay to the rule. Your son gets a new one when he's 13 and she will get her old phone back when her punishment is up.", "Definitely NTA for taking the phone away . What she did was cruel and the consequence was fair \n\nBut you fucked up by giving it to your son to use .. she has a punishment already and all you’ve done is created something he can throw in her face and create even more of an issue cos clearly they have issues between them for her to have done that in the first place \n\n\nFocus your energy on helping them mend their relationship and your daughter fully understanding how cruel it was to do that", "YTA. You're absolutely right to come down hard on your daughter, but by giving your son her phone, it's likely to make the relationship between them even worse.", ">In my anger, I said...\n\n&#x200B;\n\n>I was so damn upset that I just kind of blurted it out\n\nYWBTA if you stuck to this threat that you admit was made in anger and that your wife does not agree with. I understand that you were angry on behalf of your son and hurt that your daughter would do such a thing, so I won't say Y T A, but listen to your wife and come up with a better solution.", "Soft YTA. I understand the logic behind it but this will just breed even more resentment between siblings.", "YTA. The punishment of taking the phone away is warranted. Giving it to your son is not. He gets his own phone. This is probably going to sour the relationship more.", "YTA. You do not punish one child by rewarding the other. This is just bad parenting. Sorry.", "YTA\n\nYou are just giving her more of a reason to lash out against her. You almost certainly created a WORSE situation for your son. His gain should NOT have been mentioned in your punishment AT ALL.", "Nta, but you should remove it from your son as well. So the drama can calm down.", "NTA-I love the symmetry of it all. There are no options that wont lead to resentment. Your daughter did something cruel so either she thinks shes punished unfairly or your son thinks the punishment isnt enough.", "YTA\n\n&#x200B;\n\nWith a parent like you, small wonder your kids hate each other and do these things.", "NTA because it doesn't rise to that threshold. \n\nI think you could have handled it better. By not saying you will give it to your son. \n\nAs someone else suggested give her a Nokia phone", "NTA for taking the phone away from her for a while, its definitely necessary since she’s shown that she isn’t mature enough to have one. what she did was wrong and mean. but i don’t think giving it to the brother is the best idea, it might make her resent him even more and have a worse attitude towards him. but i don’t think you’re a jerk for doing that as a punishment, you needed one and just blurted it out. i don’t blame you", "NTA\n\nThere’s nothing wrong with that punishment other than I’d say your daughter is getting off lightly.", "NTA but i could very well be in the wrong. You however are standing up to your sons bully, who happens to be your daughter, and giving her a clear consequence. The issue is that youre taking it away, which means she needs to get a phone after the new year. IMO, you could give her a nokia so she still can communicate, but cant use social medias", "NTA\n\nI'd even say that 15 is too young to have a smartphone, though just barely. Mine won't be getting one until 16, unless something changes my mind. This incident seems to showcase the lack of maturity that makes me feel that way.\n\nThere's so much garbage on social media, and addiction to that stuff is no joke. (The irony of posting this while browsing reddit isn't lost on me, haha)", "NTA. This barely scratches the surface of what punishment she should be getting. Cyber bullying her own sibling? Not sure you're doing enough.", "YTA but this is a good opportunity for you to model how to apologize for and rectify your behavior.  Apologize to your daughter for acting emotionally in the moment and let her know that your son isn't going to get her phone, you will keep it safe for her until it's time to get it back.", "Info: what's the nickname? Teasing from his friends? N t a for taking her phone, but you're doing your other kid a disservice by not teaching them to suck it up. A little ball busting is pretty normal at that age, and it's important to learn how to let people's dumb commentary roll off your back and to not take yourself so seriously. If it wasn't this, it would've been something else eventually. Seriously, giving him her phone (presumably full of private conversations and connected to her social media and email, etc) because he got teased is NOT going to make her more empathetic toward him lol.", "NTA I'm on board with this.", "NTA. Definitely your daughter shouldn’t have a phone and I hope there was more to the punishment. Obviously if she is posting something so hurtful online then you should probably focus on that.", "NTA.  Go a step further; if she wants a smartphone, she has to pay for it.\n\nIn the meantime, get her a flip phone for emergencies.", "I didn't get my first cellphone till I was about 17 and it was a slide phone with no internet access, I had it for  emergencies with school and football. I'll never understand giving a smartphone to a child and expecting them not to do stupid shit.", "NTA- that’s horrible", "ESH Obviously your daughter was in the wrong, and I do think the punishment is just, but your daughter is never going to understand that and it will just cause more issues between them. Just=/=efficient when it comes to raising a child", "NTA, as the punishment seems to fit the crime... but still a bad decision most likely. Your wife is exactly right that it will breed further resentment between them", "NTA", "Going with NTA but I do agree that you shouldn't have commented on giving the phone to the son (or at least I'm much more on the fence about it than anything else here). I mean, yeah it's going to breed resentment but anything he does to punish the daughter could do that. That's what happens when one sibling does something to the other and get's punished. Unless there's genuine remorse it's going to breed resentment. The mother is right to say that, but wrong to block the punishment FOR that reason.   \n\n\nStill, just better to get the son his own phone anyway and avoid the issue, imo, to keep peace with the wife (which... I don't usually support but relatively low stakes here to do it)", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nBurner for obvious reasons, but my daughter (15) did a really crappy thing and posted a picture of my son (12) and writing “Roast Me” under it. It was in a private group message but apparently it was screenshotted and ultimately got back to him and his friends in the middle school due to a friend’s sibling. It earned him a shitty new nickname and some very avoidable teasing.\n\nHe doesn’t have a phone because we have a “No phone until you’re 13 rule.” He turns 13 in a little less than two months. We took away my daughter’s phone until after the New Year. This lines up with the fact that my son will be getting a new iPhone for his birthday.\n\nIn my anger, I said that I was giving my son the phone that my daughter was no longer allowed to use. By the time she gets it back, he will have his own. He’s only allowed to use it in the house.  I know it was petty, but I was so damn upset that I just kind of blurted it out. My wife said that I went too far and that it will only lead to resentment between the two.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA for taking the phone but your wife is right it will cause more problems and resentment. Which it sounds like is already happening. Two wrongs do not make a right. You need to confiscate the phone keep it under lock and key until punishment is over.", "NTA. Daughter uses people outside the family and bullied her brother who could be teased or bullied by other since its ok as his sister joinrd in. Family comes first. I'm harsher wouldnt get it back for a year nor allow to go out with friends. Some lessons are better learned over time.  Having a phone is not a right. It is a privilege.  She will think twice before losing privileges", "NTA…but her social media would be basically shut down after that stunt.", "YTA for giving her phone to your son. Taking it away was a good punishment (relevant to the crime). Giving it to your son WAS petty and it was done out of your anger. You should never punish children out of anger. This was a good opportunity to talk to your daughter about privacy, appropriate sharing, kindness, etc. Instead it sounds like the result is only going to breed more resentment between your kids.", "NTA it's horrible that the bullying started at home .your daughter should absolutely reap consequences.", "NTA. There is something wrong with your daughter.", "Is OP going to wipe the phone before son gets it? \n\nBecause if he gives his son her phone without wiping, he’ll have all her friends number and apps to get in and he could do something much worst than the “roast me” post with all that access.", "\"intent matters\"  \nOn the surface that's true, but not in this case. Imagine a group of guys/gals that use a private chat to share their risque pictures of their spouse and rate them? Even if none escape the chat, by your logic that's okay.  \n\n\nI disagree wholeheartedly. The daughter screwed up here and can't be trusted with a Smartphone at this time. (There is a better argument about giving the phone to the son, though)", "Have you not been on the internet? She invited people to roast him. Set him up to get made fun of.", "NTA. She’s getting it back in a few months per OP. Son is getting his own phone when he turns 23 in a few months.", "It's actually pretty karmic. She abused her phone privileges in a way that negatively impacted her brother. Him getting use of the tool of his torment fits.", "She's getting it back in a few months. He will have his new one already.", "> use a private chat to share their risque pictures of their spouse and rate them?\n\nAgain, there is no context of that in the post.  It sounds like it was just a normal picture, unless OP as added additional information.\n\nAlso, your example (referencing spouses) is about adults.  Adults (should) know better.  I still think a valuable learning/teaching lesson was missed here because OP (based on their post) got upset and lashed out.", "It was a normal picture with \"Roast me\" on it. So it literally was asking other members of the chat to make fun of them. Which is fundamentally not cool unless the person is in on it. That's the whole point of a \"Roast me\" and why they're okay.  \n\n\nAnd how do kids learn? Well there are different tracks but punishments are one of the ways. And the punishment of taking away the phone until she matures is pretty in line.", "Absolutely, taking away the phone was appropriate punishment. Giving it to her brother is where OP went wrong.", "Yeah... I get that, I get the motivation a bit and was on the fence on that point (also why I didn't really argue that point, but it seems people are arguing with even taking the phone away...) but I think of anything that's where a line got crossed. Personally (and I'll take the downvotes) I wouldn't call him an AH as he hasn't actually done it yet (and I'm N T A about the initial title question). But I agree that THAT would push it over if he stuck to that.", "NTA.  I'd just take her phone and give a new one you your son though.", "NTA", "YTA for issuing a punishment in a fit of rage. \n\nIf you genuinely think the punishment is fair, that's one thing. \n\nIf you think its not and are just too stubborn/proud to admit it, that's worse.\n\nI will say this: giving him her phone means either giving him ongoing access to violating her privacy or factory resetting her phone so she loses everything. Those aspects are not fair.", "NTA. Your daughter was testing the waters to see what maliciousness she could get away with and your reaction was correct to take her phone. And there's nothing wrong with temporarily giving it to your son.", "YTA did you enjoy yourself giving away your daughter’s phone?", "YTA. Sorry this is like the worst punishment I’ve ever heard. For one, your daughters going to resent you, and it’s going to cause even more shit between her and her brother. Second, yeah you shouldn’t punish your kids by rewarding the other. The rule should still stand, no phone until 13. Sure, take your daughters phone for a month, whatever. Don’t break the rule.", "Info: Did you do a factory reset on this phone or does your son have access to her contacts, email, social media, etc.?", "NTA. Why are you giving her another phone? She can get a job and buy her own.", "NTA. Someone’s gonna learn today that’s for sure.", "NTA - Your daughter acted horribly. She deserves to have her phone taken away. Giving it to the person that she hurt is the perfect punishment. It is a natural consequence of her actions.", "NTA - Actions have consequences and if your daughter doesn’t know to not be a fucking dog on social media then she shouldn’t have a phone. Any division that arises is because she doesn’t know how to have accountability for her actions and that’s something you might have wanted to teach her sooner. I would sit her down and make sure she understands that the only reason this is happening is because her actions caused harm and distress to someone who she is supposed to trust and protect.\n\nBut then again, older sisters are dogs anyway. At least from my experience", "Yeah, YA. Not a good idea. You set a rule of not phone til your 13. Why does daughter doing a crappy thing mean that you are going to break the rule? If it applied to her it should apply to him too.", "ESH", "N-T-A for taking her phone as what she did was horrible\n\nBut \n\nYTA for giving the phone to the son. As everyone has state, your daughter's online life is on that phone. To give it to your son, that will destroy her privacy. If you do wipe it before giving it to the son, you will delete important files that she has. \n\nNot only will you create resentment between them, you will create resentment between you and her. That could be the kiss of death", "YTA - never a good idea to form a punishment in the heat of the moment.", "When he turns 13.", "Why are you giving it back? Is he still dealing with bullying and name calling based on her behavior? If it’s not over for him why is the punishment over for her? That makes no sense. If consequences of her actions continue in perpetuity for your son then she should get a job and buy her own phone.", "Assuming he hasn’t done something to it or used your daughters info on the phone to do something much worse to her. 3 months is a long time in teenage time. That’s 3 months she’s going to hate you and her brother more and more. I see a black eye in one of your kids future. Or a smashed phone"]}