{"id": 25122, "submission_id": "15wi4ff", "title": "AITA for yelling at my sister because she keeps standing right outside the bathroom door when I'm in there?", "selftext": "I (F19) live with my parents and my little sister (F13).\n\nMy sister has been going through a phase of standing right outside the bathroom door whenever I'm in there. Our home has three bathrooms so she's not waiting to use it. She just stands there giggling and will sometimes bang on the door.\n\nIt's really annoying and I've asked her to stop multiple times. I have IBS and also have really heavy periods so I often take a while in the bathroom and need to be left in peace. Everyone who lives with me including my sister knows this.\n\nYesterday I was on my period and was in the bathroom and my sister kept bashing her fist against the door and giggling again. I told her to stop twice and she wouldn't and when I got out of the bathroom I snapped at her. I yelled at her to stop being inconsiderate and asked her how she'd like it if I did the same to her when she's in the bathroom. \n\nShe started crying and ran to her room. My parents said I was being too harsh on her and that she's just messing around. I felt bad for yelling but I feel like she needed to learn a lesson. Am I the asshole?", "created_utc": 1692554279, "permalink": "/r/AmItheAsshole/comments/15wi4ff/aita_for_yelling_at_my_sister_because_she_keeps/", "score": 183, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I yelled at my sister because she keeps messing with me when I'm in the bathroom\n(2) she's only a kid and trying to get my attention and I may have overreacted by yelling and upsetting her and could've been more mature in handling it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your sister is more than old enough to understand that: \n\n1. People don't want to be bothered when they're taking a shit.\n\n2. You have a medical condition that means you need more time in the bathroom than most people.", "NTA. People close the door for privacy. For her to involve herself in your toilet habits is creepy. Making someone else feel vulnerable and annoyed is not just messing around.\n\nIn a calm moment, sit her down and ask her what she hopes to achieve by this. Tell her it gives you only negative feelings about her and ask her if that was her goal. Listen to her answer, because she might have something else going on that needs addressing.", "NTA. Personally, I’d start doing the same to her whenever she’s in the bathroom/her room/start banging on the table when she’s eating etc. so she realizes how annoying and frustrating it is. I’m also petty as hell so take that with a grain of salt 🤷‍♀️😂", "NTA\n\nYour sister is 13, not 5. You’ve told her to stop multiple times before yelling. You have a lot more patience than me lol, I would have yelled much sooner. \n\nIt sounds like your parents coddle your sister a lot judging by how she acts.", "NTA.  You're sister is absolutely TA in this situation.  She is old enough to understand what she is doing and why it's wrong.  You're parents are also TA's for allowing her to continue and enabling her behavior.", "NTA. A 13 year old needs to be taught boundaries. You taught her yours.", "Nta. Your sister isn't a kid anymore and she understands what she does.", "I don’t think you’re being rude. You’ve asked your sister repeatedly to leave you alone in the bathroom and everyone in the house is well aware that you need your privacy when in the bathroom- and that should be a given to ANYONE using the bathroom in general. \n\nIt’s not like she between the ages of 3-8 years old, she’s 13, that old enough to start warranting your own personal space, so why infringe on yours? \n\nI think if there was any way you could have gone about it that could be wrong is if you wanted to talk to your parents and ask them if they could talk to your sister first, but I feel like that’s only applicable if she was younger than 9, if she was special needs, or after you’ve talked and maybe even yelled a couple of times to see if she gets it. If it takes a few times for you to get heated and your sister is still being inconsiderate, then older adults should be involved.", "NTA, your sister is a teenage brat, and your parents are not helping by letting her \"mess\" around when you are in the bathroom.", "NTA. She's 13 and knows what she's doing. Yes, she is still a young child. They are annoying and obnoxious, but usually because they want attention. She loves you and wants to pick on you.", "NTA. What you tolerate is what will continue. Your sister needs to learn some respect for others.", "nta. she’s 13, she needs to grow up. honestly it’s probably the parents fault for letting her think it’s okay to behave that way.", "Not too harsh, NTA.", "NTA and quite frankly? Your sister is weird.", "NTA\n\nBang on her door at all hours of the night and giggle.  When they yell at you, tell them that is kind of harsh.  And keep doing it.", "NTA\n\n> My parents said I was being too harsh on her and that **she's just messing around.**\n\nIf your parents weren't just fully allowing this behavior as something totally fine that they should excuse and ignore it wouldn't have come to this point. Like yeah, sure, it's always better to keep your cool than to lose your cool.\n\nIt's also better not to incessantly pester someone doing shit you KNOW they don't want you to do, for no reason other than because you enjoy that it bothers them, until they finally snap at you. Your sister isn't the victim here, and 13 is more than old enough to be taking some responsibility for her actions.", "NTA. Next time ask her if she has a bathroom fetish.", "Not too harsh. She's old enough to be respectful. NTA I'd get an airhorn and go stand outside of her room periodically and blow it. NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (F19) live with my parents and my little sister (F13).\n\nMy sister has been going through a phase of standing right outside the bathroom door whenever I'm in there. Our home has three bathrooms so she's not waiting to use it. She just stands there giggling and will sometimes bang on the door.\n\nIt's really annoying and I've asked her to stop multiple times. I have IBS and also have really heavy periods so I often take a while in the bathroom and need to be left in peace. Everyone who lives with me including my sister knows this.\n\nYesterday I was on my period and was in the bathroom and my sister kept bashing her fist against the door and giggling again. I told her to stop twice and she wouldn't and when I got out of the bathroom I snapped at her. I yelled at her to stop being inconsiderate and asked her how she'd like it if I did the same to her when she's in the bathroom. \n\nShe started crying and ran to her room. My parents said I was being too harsh on her and that she's just messing around. I felt bad for yelling but I feel like she needed to learn a lesson. Am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, but your parents are. Your sister needs to learn basic courtesy, and your parents are encouraging her bad behavior. Have a conversation with your sister: Sit with her and explain her actions are rude, crude, cause you anxiety, and is kind of disgusting, and find out where did she get the idea that listening to someone going to the bathroom was funny? (ew).", "NTA. 13 is plenty old enough to know that isn’t appropriate, and to respect your wishes when you asked her multiple times to stop. Your parents need to step up here and deal with this, not gloss over it as ‘messing around’.", "Warn your sister that you intend to tell EVERYONE, including her friends, to \"be careful when LS is around, she creeps on you when you're in the bathroom. I don't know WHAT'S wrong with her and our parents won't do anything, but its SO CREEPY. Just thought I'd warn you.\"\n\nNTA", "Time to return the favor to Mom and Dad. NTA", "NTA. Next time do the same to her!", "NTa\n\n&#x200B;\n\nStart doing the same to her until she stops. Or - she is 13 - make scratching and gurgling sounds.", "Have your parents taken her to the doctor??That sounds like a very immature for thing for a 13 yo who will soon be going into high school if you live in the us. I have a sister with autism and she seems to do similar things so it might be nice to get her evaluated so your parents can find a way to help her because instead it will just continue to be frustrating. NTA. But if this is the only thing she does then she is definitely TA and this should still be addressed by parents. Just thought i’d offer a different perspective.", "Sister needs an air horn to the face. Sometimes I'm running a gamut of emotions on the toilet, from fear and anger, to sorrow and terrible ennui. That absolutely does not need an audience.\n\nNTA", "Nta. When I'm taking a shit, I don't even like being on the same floor of house with somebody else.", "NTA She is old enough to understand it is inappropriate to stand outside the bathroom door and listen to whatever is going on in there. Maybe start doing that to her. Then let your parents says you are the A H.", "You SHOULD do the same thing to her and then see how much she likes it she definitely won't", "Your sister is a massive asshole, and so are your parents. \n\nYou are NTA.", "FIVE is a young child. Thirteen is way to old to be pulling this nasty behaviour, then crying when she gets called out. LS is, in her own way, a bully.", "yeah, like what do they think happens when people “mess around” as they put it? people they mess with get fed up and snap. consider it a life lesson. nta.", "Oh for Heaven sakes, she’s 13 not 3. She’s in 8th grade and still cries over being told to knock off bad behavior?!  She DID need to learn the lesson and you didn’t say anything wrong or even particularly harsh. Your parents should have out a stop to this already. \n\nNTA", "NTA. She is 13, and this is a behavior she should have grown out of 8-10 years ago. Is she developing psycho-socially as expected? Have you spoken to your parents about this behavior?", "Your parents are raising an AH. You are NTA and I don't know why she thinks it's funny but I wouldn't interact with her at all until she can act her age.", "NTA, at all. I would’ve snapped a lot sooner than you did and said a lot worse, honestly. You were very nice about it.", "NTA. \n\nYou have tried patience and reason and it didn't work. Your parents are being unreasonable. Sometimes people don't get it until you put them on blast. It's never fun for anyone, but sometimes it's necessary.", "13 is old enough to know better and if your parents think you're being harsh, they're part of the problem.\n\nNTA.", "NTA", "Wtf. She's old enough to know better, your parents are assholes\nNTA", "NTA. She is way old enough to stop this.", "Umm? 13 is definitely not a young child. Four or five is a young child.", "NTA. Everyone deserves their privacy, especially in moments like this. Next time she does it, tell her through the door that if she’s going to keep standing there she can wipe for you. OR hand out some used toilet paper. It might be gross,but at least you’ll get a laugh about it. Then you can tell your parents “you were just messing around too.”", "NTA, you've tried to politely tell her to stop and she persisted in doing it specifically because it upset you when you're already not having a great time based on your medical issues.\n\nThe fact your parents aren't disciplining her behaving like this when it's a known habit of hers is really shitty.  And the fact they're coming down on you like this is stupid.  To put it succinctly, \"I wouldn't yell at her if you'd just discipline her so she isn't doing shit like this.\"", "NTA betcha she won't do it again. If she does, you better follow through on your threat and do it back.", "NTA   \n\n\nIf she keeps doing it, you should consider carrying out your threat.  Might be the only way of getting her to back off.", "NTA.  !3 is old enough to know when you are deliberately being an asshole and apparently old enough the play the victim when you snapped.  Your parents are wrong to call this creepy, rude, inappropriate behavior “just messing around”.  She behaves like this because they down play her rudeness.\n\nThe next time the little brat in on the toilet bang on the door nonstop.  \n\nAsk your parents how they would feel if you did this to them.", "Info: does she do this to anyone else?", "No, you weren't being too harsh on her.  NTAH.", "NTA. I'm a woman, and I really get tired of \"she started crying\" every time another woman is confronted. It's so manipulative and your parents are playing right into it.", "Let her do it to the parents a few times and see how they feel.", "NTA. I hate that every shitty behavior from children nowadays is brushed off as a phase. Common girlhood phases in my experience: the princess/mermaid phase, the obsessing over a tragic event phase (mine was the Titanic sinking, my best friend's was the Bermuda Triangle disappearances), the not-like-other-girls phase, the emo phase, the fanatic fangirl phase. Notice how harassing someone in the bathroom is not on that list. It's not a phase, she's just an asshole.", "NTA. The way I see it, is you have to options available (maybe other redditors will have a more clever solution)\n\nOption 1: Put on headphones and just ignore her because she's doing it to get a response. \n\nOption 2: Give as good as you get so that she knows what it's like. This may backfire and cause the bathroom war to escalate. \n\nYour parents are AHs though. Because even if you didn't have a medical condition (which should be a deal breaker right there), everyone deserves tranquil me-time in the bathroom.", "NTA. She needed to be put in her place.", "NTA Your sister's behavior is annoying and creepy.", "The petty in me loves this!!\n\nNTA.", "I was looking for this!", "Your sister sucks and so do your parents.", "NTA. She’s old enough to respect boundaries.", "NTA. I don’t have any health problems and I don’t like being bothered when I’m tryna take a dump. \n\nalso i love that this is a bathroom story on a sub titled am i the ASShole lmao", "Nope. NTA. Teenage girls suck. She TA.", "NTA - sister needs to learn some manners, simple as that."]}