{"id": 25283, "submission_id": "15yg9rd", "title": "AITA for buying my grandparents house and “screwing” my family out of their inheritance.", "selftext": "So i (28m) used to take care of both my grandparents from the time i was roughly 19 my grandparents health started to go downhill and none of my 7 uncles or my mom really wanted to help out much so i ended up moving back in with them to help out as much as i could. My grandpa was in a wheelchair and my grandma had just gone into remission from cancer. Around 2020 when Covid started to become a serious concern my grandma was seriously wondering what would happen if her or my grandpa died because they would not be able to live in their house that they had owned since around the mid 1960s, it is according to my grandma, an old governors mansion from the 1800s it has 10 bedroom 5 bathrooms on 15 acres of land when they bought it it needed a ton of work and they have spent the last 60 years making it a wonderful home and both wanted to die in that house they had raised all their children in that house and even some grandchildren it is the family hub everyone had grown up here. after one bad health scare with my grandpa my grandma realized that if she lost him she would no longer be able to afford the house with losing half of her income. So i offered to buy the house from them, i have a fairly high paying job for my area and because i had been living there rent free while taking care of them i had quite a large saving, originally i told her i would just give her the money or help her out but she didnt want charity so she and my grandpa sold me the house for $90,000 (roughly 10% of the properties value) and i would let her live there until she died (which of course i would) because they knew i would keep the house in the family and most of my Uncles and my mom just wanted to sell it for a quick buck (only 1 uncle, josh, knew about them selling me the house and didnt mind at all because me and him had almost exclusively done all the maintenance or house work on it for years). \n\nUnfortunately my grandpa died in april 2021, and after that my grandma’s youngest sister moved in to spend time with her because they were both widows and could emotionally support each other, so i took advantage of the covid interest rates and bought another house about 10 mins away so i could still be close by if she needed anything but have my own freedoms. Sadly last week my grandma passed away and after the funeral the whole family gathered for her will reading, my Uncles all got nice items, my uncle josh got my grandpas Old 1940-1950s Ford truck, my mom got all my grandma jewelry, i got nothing (because I already got the house), the reading ended. All of my relatives were confused about the house and asked the lawyer to which she said the house was already sold. Well it didnt take long to for them to put 2 and 2 together and i am now getting harassed by most of my family saying i fucked them and they need the money from the sale of the house and some have even threatened to sue me if i dont sell the house and give them their rightful inheritance. \n\nSo aita for “screwing” out of their inheritance", "created_utc": 1692733321, "permalink": "/r/AmItheAsshole/comments/15yg9rd/aita_for_buying_my_grandparents_house_and/", "score": 34, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Buying the house for 10% of value, knowing my family could use the money from the sale of the house\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Funny how much more family cares once their \"loved ones\" are gone.\n\nNTA. I'm sad to keep reading posts about family vultures looking for the inheritance they expected, but love OP's who take care of their family!", "So you, at age 28, have spent nearly a third of your life taking care of them. Every day. Your grandma selling you the house for 10% of its value is your reward for the years of hard work and sacrifice. No one else could be bothered to help. With 8 children, they could have all split the work and done just a bit of it, but it sounds like only one Uncle even pitched it and he was completely okay with the situation. \n\nYour grandma wanted the house to stay in the family. By selling it to you, she got what she wanted. You are NTA.", "NTA.  They chose to sell the house to you, I assume you didn't coerce them into selling or the price.  It is legally yours now, not much they can do.  You may want to consult with an attorney to be safe.", "NTA - the inheritance came from the money you used to buy the house. If it was such a big family hub, they should be happy to keep it in the family instead of selling it for a buck", "NTA you took care of your grandparents with no expectation of benefiting. Your grandmother made you a deal and you took it. Tough for the rest of the family.", "NTA.  They aren’t entitled to your grandparents assets. They could have donated it all to charity if they wanted.  What are they going to sue you for? For taking care of your grandparents when they wouldn’t step up?", "NTA, your grandparents legaly sold you the house, so it is yours.....", "NTA.  \nDont give them anything. No promises, no money.", "NTA - As long as your Grandmother was of sound mind when she sold you the house, you're good.  This is what happen when people assume they will just get a share of that isn't theirs to begin with.  They all had the opportunity to find out what Grandmother was planning to do with the house and didn't ask.  Must suck to be them.", "Where were they when your grandparents needed their kids assistance?\n\nNTA", "NTA. \n\nBut I’m surprised you can buy a house for 10% of the value. In my country that would not be possible because of legislation (to prevent money laundering and tax evasion).", "INFO : What happened to the $90K you paid for $900K property?  Hope you have a good lawyer.", "NTA\n\nFirst off, never spend money you don't have...\n\n>they need the money from the sale of the house and some have even threatened to sue me if i dont sell the house and give them their rightful inheritance.\n\nSecond, there is nothing for them to inherit. The house was already sold in a deal between you and your gp. Your aunts and uncles are entitled to absolutely nothing. What, exactly, are they going to sue for?", "INFO: Why would your grandma not be able to afford the house if it's already fully paid for, and how did paying them a scant 10% of the house's value alleviate this financial concern?", "Nta but your family is.  You were a wonderful person and grandchild.  I am sure your grandparents were proud of you and loved you very much. At a young age you stood up and took care of them. Your relatives did not. The house is yours.  Your relatives can make all the threats they want but they have no rights to the house.  It is yours. Bought and paid for.  You allowed your grandparents to stay in their home. Think of the stress you took off their shoulders. Ignore those money grabbing relatives.   Wish I could give you a hug. You are a mature kind caring person.  Be proud.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo i (28m) used to take care of both my grandparents from the time i was roughly 19 my grandparents health started to go downhill and none of my 7 uncles or my mom really wanted to help out much so i ended up moving back in with them to help out as much as i could. My grandpa was in a wheelchair and my grandma had just gone into remission from cancer. Around 2020 when Covid started to become a serious concern my grandma was seriously wondering what would happen if her or my grandpa died because they would not be able to live in their house that they had owned since around the mid 1960s, it is according to my grandma, an old governors mansion from the 1800s it has 10 bedroom 5 bathrooms on 15 acres of land when they bought it it needed a ton of work and they have spent the last 60 years making it a wonderful home and both wanted to die in that house they had raised all their children in that house and even some grandchildren it is the family hub everyone had grown up here. after one bad health scare with my grandpa my grandma realized that if she lost him she would no longer be able to afford the house with losing half of her income. So i offered to buy the house from them, i have a fairly high paying job for my area and because i had been living there rent free while taking care of them i had quite a large saving, originally i told her i would just give her the money or help her out but she didnt want charity so she and my grandpa sold me the house for $90,000 (roughly 10% of the properties value) and i would let her live there until she died (which of course i would) because they knew i would keep the house in the family and most of my Uncles and my mom just wanted to sell it for a quick buck (only 1 uncle, josh, knew about them selling me the house and didnt mind at all because me and him had almost exclusively done all the maintenance or house work on it for years). \n\nUnfortunately my grandpa died in april 2021, and after that my grandma’s youngest sister moved in to spend time with her because they were both widows and could emotionally support each other, so i took advantage of the covid interest rates and bought another house about 10 mins away so i could still be close by if she needed anything but have my own freedoms. Sadly last week my grandma passed away and after the funeral the whole family gathered for her will reading, my Uncles all got nice items, my uncle josh got my grandpas Old 1940-1950s Ford truck, my mom got all my grandma jewelry, i got nothing (because I already got the house), the reading ended. All of my relatives were confused about the house and asked the lawyer to which she said the house was already sold. Well it didnt take long to for them to put 2 and 2 together and i am now getting harassed by most of my family saying i fucked them and they need the money from the sale of the house and some have even threatened to sue me if i dont sell the house and give them their rightful inheritance. \n\nSo aita for “screwing” out of their inheritance\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You will need an attorney.", "YTA..ish. 10% is too little. Grandma didn't want to get kicked out so her reasoning makes sense, but she also probably thought she'd live longer.", "YTA\n\n&#x200B;\n\nBut: since the property was sold for 10% of the value that close to them dying, tdepending on where you live they can dispute that anyway. They will just need to sue - and it seems they are willing, so it will be fine.", "Nta you bought that house you don't owe them anything.", "NTA. They can kick rocks. Grandma did what she wanted with the house. It was never theirs and they have no claim to it.", "NTA. The house is not part of the inheritance and has nothing to do with anything. It was legally sold to you, before your grandparents passed away. That's the end of the story. Your relatives have zero claim and you don't have to do anything for them.\n\nMaybe they should've pitched in a bit around the house, hey?", "NTA", "NTA F them, that's your house", "I offered my grandma more than 90000 but she wouldnt here of it that was the price she wanted", "And if you don’t already, install cameras.  I can see extended family feeling they have a “right” to just go to the house and take what they want.  NTA.", "two live far away(one in England and one in New Zealand) but most of the family all lives within one hour and would always come on holidays, events, birthdays. But i can’t stress that this house wouldn’t even be standing if not for Josh, he owns a commercial construction company and has done so much work and helped its crazy, but he doesnt care about money because he is in the process of selling the company so he can “go to a beach somewhere and get hammered every day”", "Im assuming this is the US, but you can sell whatever you want for under market price as long as everything else is legal as well", "My grandma used it for living expenses, i know after my grandpa died, she lost most of her income and they had little to no savings after multiple health problems i paid the house taxes and gas and electricity after i moved out but she used that money for herself", "Ironically 2 of my uncles that have done very well for themselves are the ones causing the biggest stink, Josh doesnt care because he was the only one to not live in the house since birth (he was born in like 59)and is in the process of selling his commercial construction company and retiring so he doesn’t care he is ready to travel and get hammered on a beach somewhere his words lol", "My grandpa was the primary breadwinner, his pension was most of the bills, taxes etc. She had her own pension but idk how much of a hit she took after he died rough and there saving were almost gone after all the medical issues they went through over the  years and i wanted to pay more but my grandma would have none of it, and i think she knew she didnt have very long left so i think she used the money just for day to day expenses, i payed the taxes and gas + electric for the house after i bought it she just paid for her own food and stuff she wanted after i moved out", "this!!!!", "Why?", "The 90,000 was the number that she wanted, I originally wanted to use my saving as a downpayment on a mortgage that would have given her more ( probably closer to 280,000) but i payed the taxes and gas and electric on the house while she lived there, i think she knew she didnt have very long and used that money for daily expenses, she lived about 2 years after my grandpa died", "Nah, the house is not covered in the inheritance, there is nothing to dispute. At the very, very worst, there probably should've been a gift-in-kind reported at tax time (for the difference in the value of the house vs the sale price), that's the only thing that could maybe bite the OP here, but I'm frankly not sure how that all works in this kind of situation, I don't think the relatives will be able to do anything if the sale was done legally, which it seems to have been.\n\nNTA.", "They wanted you to have that home, keep it and disregard your disgruntled family. NTA", "still. talk to a lawyer to be sure.\nalso here in Germany it would be taxed a lot since it is a gift of 810.000 $ (the price below market value) not sure how the rules are where you live but just make sure that you are safe. Otherwise NTA", "So the only one who has the right to object; Josh, isn't objecting.\n\nEnjoy your inheritance and the memories you were able to built by caring for them.", "There should have been a gift return filed for the 90% value of the property, but nothing to prevent it in US", "Don't listen to these people. You didn't swindle your family from their inheritance.   Your family members made an assumption and they were wrong.  They can be pissed but they're not right.  You made an agreement with your grandparents to buy the house and keep it in the family and that's what you are doing.  Your Aunts and Uncles can get bent if they don't like it.\n\nIt probably feels like a betrayal because besides from 1 Uncle, no one else knew about the sale.  I'm sure there is a reason for this but they are reacting from surprise.", "riiight.... but you stated they sold you the house BEFORE he died. sounds like you swindled your family out of their inheritance...", "So, either they needed the money, and your response was to low-ball them by taking advantage of their precarious position, OR\n\nThey didn't need the money, which was why they were OK with such a ridiculously low offer.\n\nEither way - you came out of this smelling like roses, hm?", "She has been threatened with litigation. I can imagine how she could be accused of elder financial abuse or other not good things.", "The other family members may try to sue using the argument that this was elder abuse and the grandparents were either coerced or not of sound mind when signing over the home.\n\nAssuming OP's telling is factual, none of that actually happened here. Even so, the family members may still try their luck with a lawsuit since there's a $1m house on the line.\n\nPurchasing the home for 10% of the value doesn't help OP's case. Hopefully they have sufficient documentation to defend themselves.", "You also lived rent free. Absent info on others being a holes to your grandparents as opposed to just not super involved, I'll say NAH because I can completely see why they think you took advantage of your elderly grandparents. Anyway you twist it, you still came out ahead by almost a million at the expense of your family members.", "If they live in the US the gift giver pays the tax but individuals have a lifetime gift tax exemption of 12 million dollars so they are probably good. OP might be looking at a big capital gains tax bill if he ever sells it though. Always a good idea to have a lawyer involved with real estate transactions.", "They sold it to me a few moths after my grandpa pretty much returned from deaths door, and it had really hit my grandma that she would not be able to afford to live there after he died", "while also swindling his grandparents.\n\nPeople downvoting me need to read up on Elder Abuse Laws.", "Why are you attacking OP over this? A bit jealous, are you?", "Jealous? Nah. I’m doing ok. \n\nIf OP wanted to act in a fiduciary capacity, he should have placed his grandparents interests above his own. Instead, his solution to “help” his grandma, who was apparently in financial straits, was to buy her house for 10% its value while also keeping the transaction secret from all but one family member."]}