{"id": 25476, "submission_id": "16107fn", "title": "AITA for not disciplining my 5 year old over a crush on a classmate?", "selftext": "I have a 5 year old daughter who recently moved from pre-K into the Kindergarten / after care at her school. When she moved up she met another little girl who is one year older. We’ll call her Penny (6). She talked about Penny for weeks, telling us about her, asking to have a playdate, etc. \n\nAbout 2 weeks ago she came home and told us that she asked Penny to be her girlfriend when they get older, and she said yes. She has been telling all of our family since that Penny is her girlfriend. We didn’t make a big deal about it since she’s 5 years old and really doesn’t even know what that means.  We have LGBTQ family and friends, so she knows that girls can marry girls, or boys can marry boys if that’s what makes them happy. \n\nI had never met Penny or her mom before yesterday. When we got to pick up at the same time, i introduced myself and told her how fond of Penny my daughter was. She seemed annoyed and asked me to explain to my daughter that she’s behaving inappropriately. \n\nHere’s the thing - we have discussed bodily autonomy with our kids forever. She knows she is not to hug or kiss or touch anyone that doesn’t want to be touched, just as no one is allowed to touch her against her will. I checked with the teachers, and they have not had any instances (or complaints from Penny’s mother) of my daughter hugging or kissing her. They said they always play together with dolls, the play kitchen, etc.  Nothing out of the ordinary. \n\nI don’t want to jump to conclusions and assume that her mom is uncomfortable with them both being girls… honestly, I took it as a harmless 5 year old crush on a new friend. \n\nI sort of (uncomfortably) laughed off her moms request because I don’t know what I’m supposed to do. I’m not going to discipline my child for liking a new friend. She’s 5. She has never hugged or kissed this girl - and from my daughter’s perception, Penny is her friend and they play together at school. It’s not like she’s harassing another kid. \n\nWhat am I supposed to do here?", "created_utc": 1692972209, "permalink": "/r/AmItheAsshole/comments/16107fn/aita_for_not_disciplining_my_5_year_old_over_a/", "score": 57, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I may be the asshole for not taking the mothers wishes seriously. Like I said, as long as my daughter is not touching, hugging or kissing this girl against her will, I don’t really see the problem\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info- did you ask ask Penny's mom what behaviors she concerned about? If Penny had expressed discomfort? What is it that your daughter is doing or saying that Penny is complaining about?\n\nCause you seem to be only be focusing on hugging and kissing ... and there are a lot of other ways that an unwanted crush could be uncomfortable for the object of affection. Just because she's a girl, doesn't make respecting other people's boundaries any less important.", "There are two general options here. One option is explaining to your kid that it's great that she has friends, but that she's too young for any of those friends to be a boyfriend or a girlfriend, and that those kinds of relationships are for older people. The second option is to just not push the whole girlfriend thing at all, but just let her hang out with Penny as long as both of them are enjoying it, and realize that the whole \"girlfriend\" thing is likely to fizzle out before it even gets started. Both positions are reasonable.\n\nI don't think it's a good idea at that age for adults to talk about \"your girlfriend\" - just call her Penny.\n\nPerhaps the mom is bigoted because they're both girls, but perhaps the mom is of the first type of parent and thinks that any sort of expression of romance is inappropriate because they're little kids. \n\nNTA", "NTA - this is ridiculous.", "NAH, you have done things pretty much right so far. But same-sex or not, the other parent may be concerned about the somewhat romantic leaning (at least the wording used) by your daughter towards their daughter. That is valid. You should, in my eyes, talk to your daughter about how other people may not be comfortable with being crushed on, and get her to focus on her friendship with Penny, rather than planning any current or future romantic pairing.\n\nYour daughter's feelings are not inappropriate per se - she just has a little crush / infatuation but not everyone at her age is ready to be or talk about being someone's girlfriend/boyfriend/partner and your daughter should be coached on following others' boundaries. Again, it is not that her feelings are wrong or inappropriate or offensive, but it comes down to how she expresses those so as to not make others uncomfortable.", "NAH - Without a little further information on how Penny herself feels about the situation, I'm erring on the side of caution because for all you know it's quite possible that while they are friends your daughter maybe feels a little more strongly about the relationship than her friend does. It's possible that Penny's mother isn't reacting due to the same sex situation so much as her own child having expressed something?", "INFO: Why didn't you ask for specifics on what the inappropriate behavior was?", "NAH, but you should explain the difference between friends and girlfriends to your daughter. She and Penny are friends, there is no romantic love involved, and if you want the girls to continue their friendship, you should take Penny's parents' opinion into account - not for their but for your daughter's sake since she likes this girl so much.", "NTA, they’re 5 years old, it’s just innocent stuff. It’s good that you taught her proper boundaries and consent. So she won’t break people’s boundaries and she can defend herself when someone is doing things she doesn’t like.", "NTA", "NTA. Your daughter is just doing what kids do and not doing anything harmful to anyone. I wouldnt even call it a crush, it isnt romantic feelings. She just likes someone a lot more than others and doesnt know how to classify it correctly, so she calls it her girlfriend. We call it a best friend.", "NTA - At 5, my daughter said she wanted to marry her girl friends too. It is absolutely harmless and in no way should you punish her for it. As we get older we are so conditioned to distrust, to self-protect, to hold back our feelings. Let her experience and enjoy her love for her friends, as long as it is appropriate which it sounds like it is.\n\nIf the other mother approaches you again. Hear her out, show that you respect her perspective but assure her that there is nothing inappropriate and that the girls don't even understand what a romantic relationship is, but that you will monitor the situation and intervene if it starts to turn down an inappropriate path.", "NTA.\n\nI don't wanna jump to conclusions either, but I've heard a ton of people talk about how cute it is for their 5-year-ols to claim they have a \"boyfriend/girlfriend,\" and not take their house-playing seriously. So I am personally inclined to believe it IS the girl-girl aspect.\n\nIt's so silly. Kids don't really know what that stuff means (well, they *know* but they don't *understand* or grasp its implication). A lot of kids also claim they're going to marry one of their parents one day and people think that shit is cute as hell while being 100% more concerning if you were to take it seriously like Penny's mom is. They mimic adults and in their mind, relationships = I really like a person. There probably isn't even a romantic intention, they're just copying the people around them. BUT OH LAWD NO, Little Penny is gunna grow up to be a lesbian now because she had a \"girlfriend\" when she was five! If anything, Penny's mom is over-sexualizing a harmless label on a friendship.\n\nSilly.", "NTA", "NTA - Let your kid be a kid. She'll find out how cruel the world is on her own. You don't need to join in on the repression.", "NTA. Kids have little to no understanding of romantic relationships at that age. My 5 yr old thinks kissing means you've gotten married. \nHopefully your daughter and Penny can remain friends at school, but it seems that Penny's mom will be unlikely to encourage their friendship on her end.", "NTA discipline for what? Nothing has happened.  I would have asked the mother what exactly she thinks is inappropriate?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a 5 year old daughter who recently moved from pre-K into the Kindergarten / after care at her school. When she moved up she met another little girl who is one year older. We’ll call her Penny (6). She talked about Penny for weeks, telling us about her, asking to have a playdate, etc. \n\nAbout 2 weeks ago she came home and told us that she asked Penny to be her girlfriend when they get older, and she said yes. She has been telling all of our family since that Penny is her girlfriend. We didn’t make a big deal about it since she’s 5 years old and really doesn’t even know what that means.  We have LGBTQ family and friends, so she knows that girls can marry girls, or boys can marry boys if that’s what makes them happy. \n\nI had never met Penny or her mom before yesterday. When we got to pick up at the same time, i introduced myself and told her how fond of Penny my daughter was. She seemed annoyed and asked me to explain to my daughter that she’s behaving inappropriately. \n\nHere’s the thing - we have discussed bodily autonomy with our kids forever. She knows she is not to hug or kiss or touch anyone that doesn’t want to be touched, just as no one is allowed to touch her against her will. I checked with the teachers, and they have not had any instances (or complaints from Penny’s mother) of my daughter hugging or kissing her. They said they always play together with dolls, the play kitchen, etc.  Nothing out of the ordinary. \n\nI don’t want to jump to conclusions and assume that her mom is uncomfortable with them both being girls… honestly, I took it as a harmless 5 year old crush on a new friend. \n\nI sort of (uncomfortably) laughed off her moms request because I don’t know what I’m supposed to do. I’m not going to discipline my child for liking a new friend. She’s 5. She has never hugged or kissed this girl - and from my daughter’s perception, Penny is her friend and they play together at school. It’s not like she’s harassing another kid. \n\nWhat am I supposed to do here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I thought dogs and cats get married when I was 5.  If she says anything else just ask her what specifically it is that she thinks your daughter has done so she has to spell it out. If it is that, just laugh and tell her to behave they’re just kids. NTA", "NTA. At that age my(m) cousin (m) use to tell people we would get married when we were adults.  Be honest with your daughter, her friends mom doesn’t want them to be GFs cuz they are still so young so it’s best to just be friends for now. As long as you aren’t disparaging her feelings you are just teaching her that sometimes other people place boundaries and we should respect those boundaries as long as we aren’t hurting ourselves. Her feelings are normal and if when she is old enough to have a relationship she can pick anyone who picks her back.", "NTA.\n\nAsk penny's mom what exactly is bothering her. At the end of the day she DOES have the right to switch kindergarden if this really bothers her. But as long as they just play together, you have nothing to tell your daughter.\n\nIf the mom tells you they should stay away from each other you should reply with \"take it with the teachers, I see no reason why\". Be prepared to explain to your daughter that they can't be friends.", "NTA, and nothing to do. \n\nIt's cute that your five-year-old is using a term she heard. It makes her feel \"grown up.\" There's nothing more here than a word that kids her age don't understand. They like the sound of it, that's all.", "NTA, but you do need to not chuckle off other parent's concerns for a few important reasons. The first is that whole bodily autonomy thing you touched on being also social autonomy, next is the concept that their parenting style is as important to them as yours is to you, another is that this other parent may be BATSH\\*\\* crazy and may physically attack your child. Those are just rattled off the top of my head, but there's probably more reasons.", "NTA nothing inappropriate seems to have happened", "NTA. No one has any evidence of unwanted physical or verbal contact between the two. They’re just kids being kids. Just let them have fun.", "I refer to my close friends as \"girlfriends\" all the time. \n\nNTA- the other mom is a homophobe.", "Absolutely NTA....", "NTA\n\nYou should say clearly that your daughter has not behaved inappropriately.  If she presses further let her know you do plan on having a talk with your daughter about dealing with bigots.", "NTA. I think as a society we put too much emphasis on the terms boyfriend and girlfriend when it comes to kids. It makes perfect sense to me that if a 5 year old heard the term girlfriend that she would take it to mean a friend that’s a girl. I had a “boyfriend” when I was in 2nd grade and all that meant to us was that we’d play in the sandbox together and be on the same soccer team at recess. I definitely think pennys mom is getting too worked about all this. Especially if you’ve done a thorough job of teaching body boundaries and have checked with everyone involved that no physical boundaries have been observed ti have been violated between the kids. I’d definitely just chalk it up to pennys mom being at least slightly homophonic and needing to chill.", "Bless you, I’d have either laughed in her face or asked her to explain her bigotry", "Soft YTA. \n\nEchoing other commenters that lots of parents don’t want any sort of BF/GF comments regardless of gender. I hated it when I was a kid and as an adult it think it’s super creepy and inappropriate to encourage that kind of language for elementary school kids. It just gives me the ick. \n\nYou being so dismissive of her will absolutely lead to her limiting her daughters interactions with yours - it would for me if I was her parent. \n\nShe’s not going to trust your judgement and it’ll be your 5-year old who feels the consequences of it.", "**Editing to NAH - I would caution against brushing off concerns. I'm super paranoid with my kids because I'm a survivor of CSA. I wouldn't get funny with this particular thing but I definitely am known to be wary of other kids and adults. You don't know this Mums experiences, so try to be empathetic and reassuring that your child understands boundaries etc.\n\nAll that said, this is a totally innocent thing. My eldest would frequently say she wanted to marry two of her closest girl friends when she grew up.\n\n> When we got to pick up at the same time, i introduced myself and told her how fond of Penny my daughter was. She seemed annoyed and asked me to explain to my daughter that she’s behaving inappropriately.\n\nCan you elaborate on this though? What triggered her to say this? Had Penny mentioned your child to her - or was it something you said in the conversation that made her get defensive and weird about it?", "NTA. This mom is definitely opposed to the idea of the 2 girls being \"girlfriends.\" You can share with her that yiur chikd knows and respects personal boundaries and has not exhibited any behavior that needs to be addressed.", "She could try think that a girl who is her friend is called a girlfriend. No big deal and I completely agree with you. People make to big of deal out of something that IMO is innocent. I think you are doing great.", "Info needed: you state that you’ve had conversations about consent therefore your child could not be crossing boundaries but you literally asked no follow up questions? You have no idea what the mom objected to because you didn’t ask. So nobody knows. It’s possible your child has made her friend uncomfortable and the mom was trying to relay this information.", "Nta. Actually, I’d sit that one out. I’m sorry if Penny is about to lose a friend but you can’t control her crazy mother. Just be ready for Penny being a bit sad.", ">She seemed annoyed and asked me to explain to my daughter that she’s behaving inappropriately.  \n>  \n>I sort of (uncomfortably) laughed off her moms request because I don’t know what I’m supposed to do.\n\nOK. So... with so much vagueness to the part of this post that involves Penny's mom... \n\nYOU ASK PENNY'S MOM WHAT YOUR DAUGHTER HAS DONE THAT SHE DEEMS \"INAPPROPRIATE\". \n\nNothing that you have specified above is generally \"inappropriate\" and some of it might be little kid stuff, but have you verified what Penny's mom's issue is?  And even if it is something that you do not believe or many people believe is bad, that doesn't make Penny's mom automatically a homophobe projecting onto children. Maybe your daughter did do something inappropriate, and Penny's mom has a right to determine what her kid does (and she is going to fully pull her daughter away from yours).\n\nYes, YTA. You didn't do the bare minimum to help your daughter navigate a friendship and show respect to another child.", "What are you supposed to do here?  Exactly what you've done.  Other mom is either homophobic or over sensitive.  I'm really hoping it's the latter.\n\nObviously NTA.", "INFO did you ask Penny's mom directly how she (or Penny) thought your daughter was behaving inappropriately?", "Obviously Nta", "NTA. You’re parenting your child just fine, teaching her boundaries, body autonomy and what’s right & wrong. She’s 5! It does sound like Penny’s mom is a bigot possibly as your child is doing nothing wrong or inappropriate", "I have never understood people who encourage kids to have (or think it's cute when kids have) boyfriends/girlfriends. I despise people who tell young children that \"so-and-so is your girlfriend/ boyfriend\". They have no business thinking of young children in terms of romantic relationships.  People will go as far as talking about *babies* having boyfriends/girlfriends. Children don't understand it and adults pushing these ideas on children is disgusting.  Then those kids push those ideas onto other children.  Then you have a whole school full of children running around picking out boyfriends and girlfriends without really understanding what it means. Unfortunately, sometimes, you also have kids teaching other kids what older people *do* when they are boyfriends/girlfriends. Because some adults don't know when to stop with the inappropriateness and teach their kids wayyy too much wayyy too young. Sorry, rant over.", "I’d be most worried here about stifling your daughter’s development of different types of friendships and exploration of that space, which sounds like it is proceeding very normally and positively now, moreso than I’d be worried about placating another parent who maybe isn’t comfortable about your daughters using ‘girlfriend’ terminology, which doesn’t seem to signify anything other than friendship at the moment anyway. \n\nSo I would’ve asked the other parent what specifically their concerns are to see if there’s anything there that actually requires an intervention (like, did Penny tell her parents she was uncomfortable about something, or is the parent just upset when Penny told them about her ‘girlfriend’?) and not try to have some talk about boundaries and saying if nothing has actually happened to warrant that, otherwise it might just impose anxiety or shame on something that is perfectly innocent and healthy. \n\nNTA.", "NTA", "You need do nothing.", "According for the story, Penny is not uncomfy with the language and topics discussed. In other words she doesn’t mind being crushed on. In that case it’s solely pennys mom who’s wrong here", "Afaik, penny isn't the one with the problem, her mom is. If mom said penny was uncomfortable with what the daughter did, your suggestion is valid but one shouldn't discipline their daughter for failing to make third parties uncomfortable", "Oh man.. this is what I was trying to say but you articulated it so much better haha.", "Honestly, because I don’t tolerate any kind of bigotry in mine or my children’s lives. The moment took me by surprise and I was more concerned about affecting my daughters friendship with this little girl. I didn’t want to put the mom on the spot and have things go badly - that could lead to her telling her kid not to play with mine. I just tried to not really acknowledge it", "> I don't wanna jump to conclusions either, but I've heard a ton of people talk about how cute it is for their 5-year-ols to claim they have a \"boyfriend/girlfriend,\" and not take their house-playing seriously. So I am personally inclined to believe it IS the girl-girl aspect.\n\nI know plenty of parents who really dislike this - regardless of gender. My child had a few 'I want to marry my friend' moments and we gently explained that marriage is a choice between two grown ups and we should just have precious friends at this age.\n\nWe've also had her be really upset over another kid saying this to her like she didn't have a choice (you *are* my girlfriend kind of language) \n\nI don't think it's that weird to explain language is a boundary also.", "I didn’t really laugh, I was just surprised and said I had not been made aware of any issues between the 2 kids. She said my daughter is telling others that they are girlfriends, and that is when I kind of nervously giggled and said she was really excited about her new friend. \nI didn’t mean any disrespect, I was just taken off guard and wasn’t sure why she was so concerned", "I think I would want the other mom to explain further what she means by \"inappropriate\" before jumping to conclusions.\n\nIf she means, \"Your daughter is being inappropriate by asking my daughter to be her girlfriend because girls don't date girls\", then that mom is the AH and you should ignore her.\n\nIf she means, \"I don't think 5yos should be pretending to 'date' anyone regardless of gender\", I can kind of see where she's coming from but would just reassure her your daughter is pretending and knows not to touch anyone without their consent, so it's pretty harmless.\n\nIf something happened you weren't aware of, like your daughter said someone 'inappropriate' that Penny is now repeating or there was a touch that made Penny uncomfortable, that would be another conversation.\n\nBut you won't know until you ask the other mom to explain her concerns a bit more. Most likely, it'll be something inane you can just ignore (and certainly shouldn't involve any kind of discipline). But if her comment is bothering you, then you should ask her for more info.", "Kids emulate the world they see. Having a schoolyard BF/GF in grade school is a tale as old as time. \n\nIf this is how parents feel nowadays I worry for our future.", "Yes she said Penny had told her all about my daughter as well. And then kind of rolled her eyes and said my daughter has been telling everyone that they are girlfriends, and it wasn’t appropriate. I didn’t really know how to react and she could tell I was surprised and said I hadn’t been told that there was anything inappropriate happening, that my daughter was just enamored with her new older friend. \nI wasn’t rude about it, but also didn’t want to justify her feeling that they were being inappropriate.", "Isn't it possible Penny's mom would have had the same reaction to the parent of a boy who was behaving the same way? I don't think we know enough to land definitively on homophobia on the part of Penny's mom.", "I stated in other comments - the whole interaction was about 90 seconds.  I didn’t ask a follow up question but I was surprised and told the mom that I was not aware of anything inappropriate having happened. She didn’t say anything else - and her initial statement was that my daughter was telling their friends that they are girlfriends and it’s inappropriate. \n\nI never said my daughter ‘could not be crossing boundaries’ - I asked the teachers afterwards and they all said nothing inappropriate has happened and the girls have fun playing together in all the normal ways. \n\nSo I have no reason to believe my daughter has done anything inappropriate. I understand if the other mom is uncomfortable with the whole situation, and I’m not judging her for it. I’m just not sure why I need to tell my 5 year old that her liking a new friend isn’t ok…", "I did though. I confirmed with the teachers and spoke with my daughter about not touching anyone that doesn’t want to be touched. The teachers have also said nothing inappropriate has happened between them. \n\nAlso I specifically said that I did not jump to conclusions about the other mom being homophobic. I let her know that I wasn’t aware of anything inappropriate having happened, and she didn’t elaborate. The whole encounter lasted about a minute and a half", "Yes, I would be hesitant to have any talk with OP’s daughter here until we know that something inappropriate or uncomfortable has happened. Otherwise it just runs the risk of making the girls feel shame over a very innocent friendship (which might or might not, who knows, also have a tinge of very innocent six-year-old proto-crush, which is still healthy and not to be discouraged).", "I will say (though I'm not saying this is the case here) some of my closest friends parent similarly and are huge on boundaries etc. That didn't stop their son from harrassing my daughter in an inappropriate way. I don't think the correct course of action is assuming your child won't do something just because you've told them not to. Part of teaching boundaries is accepting other people's perception of things is valid and to adapt your boundaries to suit them.", "While you might be right and she may be a bigot, she may just also be concerned about dating talk with a kindergartner.    To be honest, I would have been if a boy had been talking like that to my daughter.   (Or a girl)  i also always have thought it weird when parents “think it’s so cute.” (Not saying that’s what you are doing here).  I understand that it’s a natural phase to have crushes, but in our house, talking like being exclusive needs to wait until middle school/high school.", "but you're okay with your daughter accidentally sexually assaulting someone because you can't be bothered to teach her not to touch other people without permission. she's 5 she's ale to be told not to kiss or touch someone that doesn't want to be touched kissed hugged or any other thing your daughter does. the woman wasn't being a bigot she was letting you know the behavior your daughter is displaying is Inappropriate so you can teach her not to do those things to people. instead you laugh it off an accuse her of bin a bigot. teach your kid not to touch other people without permission", "You assume bigotry when she could just be protecting a child that feels overwhelmed by your daughters infatuation. \n\nIt sounds like your daughter is so comfortable with what *she* wants that she isn't being thoughtful with what *others* want.", "This is a fair point to make. I suppose I'm speaking from my own personal experience as I've seen *many* instances of parents squeeing over how cute it is but have yet to witness the contrary. But the absence of evidence is not evidence of absence.", "I think with this info I’m going YTA.  You didn’t mention that your daughter is telling everyone else at school that they’re girlfriends.\n\nI wouldn’t assume the mom is being bigoted either.  She may be equally unhappy if a little boy was going around saying that.  Id just discuss with your daughter that for now they’re friends and that’s great.  They’re too young for girlfriends or boyfriends or any “romantic” label.\n\nPhysical consent is great.  But if Penny doesn’t want the whole school calling them girlfriends and that’s what your daughter is going - that’s also a reasonable boundary your daughter (and you!) need to respect \n\nEta: I also think your title is misleading.  Doesn’t sound like the other mom asked you to “discipline” her.  She asked you to explain to her. Which is a valid ask.", "Well, I've never spoken to another parent about it, but I don't especially like it when little boys in my daughter's class say they are her boyfriend and I was very, very unhappy when a mock wedding happened. I don't think the language of boyfriend/girlfriend is right at that age, they're much too young for those concepts and I think \"friend\" is enough. I have difficulty with adults framing young children's friendships in adult relationship terms and I know I'm rowing against the tide, but I do discourage that kind of language from my daughter when I hear it.\n\nI haven't any concern about touching etc I don't think there have been any instances, I just think there's time enough for that kind of talk later on.", "Ngl I do think it's not suuuper appropriate - even if I think the Mum in question was a bit rude about it. Not sure I'd say 'inappropriate' but it's on that uncomfortable in between line where it really depends on perception. \n\nI'm not a huge fan of kids doing the bf/gf type thing. When my daughter talked about marrying her friends I would tell her that's lovely but explain it might make them uncomfortable to talk about because it's an adult decision - it's okay to love them but two grown ups have to decide if they want to get married so maybe they can just be really special friends.\n\nSo whilst she said those things - I never actually encouraged them because I don't think kids should be playing at adult relationships. Obviously I never shamed her for them or anything. We just parent in an extremely hyper aware place when it comes to boundary setting and understanding appropriate behaviour. \n\nPersonally I do think you should tell your child to not be saying those things to another child. It's okay to think things privately but we shouldn't be encouraging young kids to make a game of adult relationships.", "Penny's mom is way OTT. If there was a boy who was Penny's friend and respected boundaries but said she was his gf most likely the mom would be fine with it.", "Okay but did you ask the mom?", "Teach yourself how to fuckin read Jesus Christ", "Posts like this make me realize that stats saying over half of Americans read below a 10th grade level are actually true", "If you actually read my post you would already know that my daughter HAS been taught all of that. And the teachers that observe the kids together all day long have confirmed that none of that has happened. \n\nWhat are you even talking about", "I definitely hate it as a parent... Actually I recall hating it as a kid too lol. I remember kids getting fake married and hiding to kiss and it made me uncomfortable even when I was little. \n\nMy friends daughter is currently having a falling out with another friend (all six up) because of gf bf drama. I was gobsmacked that was a thing lol.", "Christ, playground relationships are as old as time and not that deep. As long as everyone is being respectful there’s nothing to change", "This is how kids learn, by copying things they see around him. Children have been playing with baby dolls for centuries, pretending to be mommy and daddy. If you consider how babies are made, you could call that utterly creepy, but this is simply how kids learn.\n\nI had a boyfriend in kindergarten when I was 4. He had broken his ankle and I used to push his little wheelchair. We were going to get married and have babies and everything, it just seemed like that was how that should work out. Then when his ankle was healed he didn’t want to be my boyfriend anymore. I remember feeling some slight disappointment about that.. but what I remember most is that it really wasn’t any different than the other things I played at. It had nothing to do with actual relationships, just like pretending playing with baby dolls has nothing to do with being a parent. There was no kissing or even holding hands. It was just a word that sounded interesting and a 4yo girl, pushing a 4yo boy’s wheelchair for a few weeks, until both moved on to other games. It was just cute.\n\nKids learn to understand the world by copying things they see around them, as long as nothing concerning or dangerous happens, it’s not really beneficial to get in the way of their natural development.", "When my daughter came home and told us about Penny being her girlfriend- she specifically said she asked her if she’d be her girlfriend when they got older, and Penny said yes. \nShe knows that you have to be a grown up to be in a relationship or get married. We didn’t make a big deal about it because I did not want to encourage or discourage any further behavior. My daughter is a stubborn little thing - as soon as we tell her no to something, that’s all she wants. So we brushed it off, and only refer to Penny as her friend.", "I replied that I was not aware of anything inappropriate that happened. I didn’t specifically ask - but her words to me were that my daughter was telling other friends that Penny is her girlfriend and that’s inappropriate", "I never fake-married anyone as a kid, and don't recall actually wanting to. But I definitely had an aversion to the concept after the first grade. Blew a kiss to a boy and he stabbed me in the face with a pencil. Still have a lead \"beauty dot\" on my face over 20 years later from it. After that, I was pretty much over the idea of playing house.", "Sounds like you were a jealous outcast on the playground and now hold that grudge.", "You know, I have given my perspective some thought and I'm comfortable with it. So it's not going to change. I just offer it as an example of what the other mother may be thinking.", "Again, I personally would discourage bf/gf type language. I would also ask further questions re Penny's Mum - or just explain to your child that Penny's Mum is uncomfortable with them playing girlfriends.\n\nI just personally prefer to err on the side of caution with this stuff", "I wouldn't like it if I was her mom.  Many people don't want to feel forced to discuss things until they think their children are ready.\n\nThat said, I don't know how you could have handled it any better.  Seems like neither of you are AH and it's hard raising little kids right now.", "Oh my god hahahaha that is one helluva tale. I can't believe you were permanently marked. God.. that's so hectic lmao.", "Lmao what? I was five. I don't even remember who the kids were. I just remember thinking it was dumb", "Honestly though, if the other mother wasn't coming from a bigoted place, she would have brought up that it wasn't the fact that it's two girls.", "Yeah... I still remember us both being dragged off to the office, me with blood streaming down my face and him repeating \"I forgot the pencil was in my hand!\" I'm not sure who was crying more. I have absolutely no recollection of what happened to him, punishment-wise.\n\nI remember being a teenager and a buddy asked me, \"Why don't women make the first move?\" And I was just like, \"Well... I can't speak for all women, but...\"", "> I remember being a teenager and a buddy asked me, \"Why don't women make the first move?\" And I was just like, \"Well... I can't speak for all women, but...\"\n\nThis is so glorious. Like.. very unfortunate and all. But thanks for sharing haha."]}