{"id": 25470, "submission_id": "160wlrc", "title": "AITA: Coworker is NOT a morning person", "selftext": "I, 39m, work in agriculture. Long days, long hours, great money. We recently hired a new guy. He's 35ish. He told us early on that he is not a morning person and, boy, was he right.\n\nWe show up at 6am and for the first hour or so, this guy is just a huuuuge pain in the balls. He whines about being tired, he whines about the long hours, he whines about the dust, smells, bugs, grease, chemicals, equipment and pretty much everything else that was explained to him when he was hired. This is the job.\n\nHe does this every morning without fail. But after the first hour, a switch flips and he is a reasonably capable and competent employee. No bitching or crying for the rest of the day and we all get along fine. We more or less like the guy. Just not for the first hour of the day. Every. Day. For months.\n\nAbout a week ago, he turns up in the morning and is on a tear. Just ranting. We all go along with our day, but this morning is worse than others. It just. Keeps. Going. He's unstoppable. Until I finally tell him, \"OK man... I have heard enough. Close your mouth, buckle down, find something else to do AWAY FROM US. Or quit. I don't know. But I am tired of hearing your shit.\"\n\nGuy goes ballistic. \"So run me off! Fire me! Whip my ass!\" No, dude. No one wants that. We all have a job to do and families to feed. Just shut up. He does not. He escalates his fit until he is literally taunting me and the rest of our crew because no one has the courage to thrash him. Uh... because we are professionals? But I, for one, was approaching that line.\n\nHe finally walks away for half an hour, comes back in better humor, and apologizes. I accept his apology. Then he just stands there. Waiting expectantly. For what? Me to apologize.\n\nNo sir. Your attitude is a problem. If the first 2 hours of your day are miserable, it is your responsibility to wake up earlier and get it out of your system before work hours. Stuff your hissy fit up your ass. Call your mom, maybe, because no one else cares.\n\nSo he calls the big boss. Who promptly fires him, chews my ass for antagonizing the goober, and has a bad day of his own.\n\nSo. Am I the asshole? I am feeling slightly guilty, as the guy has kids and a mortgage just like me. But I also feel fine with it, as dude is a crybaby. Despite his warning about bad mornings, where does my duty to take shit and abuse off this asshole end?", "created_utc": 1692963017, "permalink": "/r/AmItheAsshole/comments/160wlrc/aita_coworker_is_not_a_morning_person/", "score": 237, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I got angry and told a coworker to shut up or quit.\n2) He got fired.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA! \nHe called the boss.. on himself.. bless his heart. \n\nYay for stress-free mornings now!", "NTA\n\nI get where the dude is coming from, I'm not a morning person either. But I just stay quiet and hate the world internally for an hour or so. There's no reason to escalate things to others, especially not constantly.", "NTA. You put up with a lot, for a long time. He had plenty of time to adjust his attitude. He's a grown man, and should know how to behave.", "NTA I’m glad the trash got taken out. It’s ok that some people aren’t morning people as long as they aren’t making it other people’s problem. No one was asking him to be chipper. People like that are annoying. It’s his fault for not handling himself. \n\n> the guy has kids and a mortgage\n\nWe all have financial responsibilities. He’s not special. He clearly didn’t care all that much about his family if he was willing to risk his employment to throw tantrums. \n\nHe’s unhinged and I wouldn’t want to be around that guy.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI, 39m, work in agriculture. Long days, long hours, great money. We recently hired a new guy. He's 35ish. He told us early on that he is not a morning person and, boy, was he right.\n\nWe show up at 6am and for the first hour or so, this guy is just a huuuuge pain in the balls. He whines about being tired, he whines about the long hours, he whines about the dust, smells, bugs, grease, chemicals, equipment and pretty much everything else that was explained to him when he was hired. This is the job.\n\nHe does this every morning without fail. But after the first hour, a switch flips and he is a reasonably capable and competent employee. No bitching or crying for the rest of the day and we all get along fine. We more or less like the guy. Just not for the first hour of the day. Every. Day. For months.\n\nAbout a week ago, he turns up in the morning and is on a tear. Just ranting. We all go along with our day, but this morning is worse than others. It just. Keeps. Going. He's unstoppable. Until I finally tell him, \"OK man... I have heard enough. Close your mouth, buckle down, find something else to do AWAY FROM US. Or quit. I don't know. But I am tired of hearing your shit.\"\n\nGuy goes ballistic. \"So run me off! Fire me! Whip my ass!\" No, dude. No one wants that. We all have a job to do and families to feed. Just shut up. He does not. He escalates his fit until he is literally taunting me and the rest of our crew because no one has the courage to thrash him. Uh... because we are professionals? But I, for one, was approaching that line.\n\nHe finally walks away for half an hour, comes back in better humor, and apologizes. I accept his apology. Then he just stands there. Waiting expectantly. For what? Me to apologize.\n\nNo sir. Your attitude is a problem. If the first 2 hours of your day are miserable, it is your responsibility to wake up earlier and get it out of your system before work hours. Stuff your hissy fit up your ass. Call your mom, maybe, because no one else cares.\n\nSo he calls the big boss. Who promptly fires him, chews my ass for antagonizing the goober, and has a bad day of his own.\n\nSo. Am I the asshole? I am feeling slightly guilty, as the guy has kids and a mortgage just like me. But I also feel fine with it, as dude is a crybaby. Despite his warning about bad mornings, where does my duty to take shit and abuse off this asshole end?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- Why did he bother getting the job in the first place if he hates getting up in the morning and dealing with bugs and shit for days on end? I’m surprised he got hired in the first place lmao", "NTA. Not being a morning person does not give him the right to rage dump on anyone, but especially not in a work environment.", "NTA. Many people, myself included, are not morning people. I just keep my thoughts to myself and stay quiet. You did nothing wrong. Your boss was subjected to this treatment every work day, you were.", "NTA. I work a morning shift and it took me a decade to stop hating everyone and everything for the first hour of life. I did the right thing and STFU during this hour. Also, the guy called the boss on himself...", "lol I’m not literally the guy from your story but man I’m that guy 😭", "I work regular business hours, so I might complain a little if there was a one-off time we needed to be working at 6am. The guy in the OP, though? That's his job, every day.  You don't have to love being up at the butt crack of dawn, but go find something to do away from others if you can't human properly for a few hours.", "NTA. Everything would've been fine if he didn't call the boss. You had no influence on his stupid decision to do that.", "NTA I say. Im also not a morning person and I do whine as well. But all I’m going to say is ‘Im so tired’. After that one sentence I will just be quiet and stfu for like 30 mins. That dude sounds annoying and that’s kinda his fault for getting fired lol.", "NTA. Dude was creating a hostile work environment. His mortgage and kids are not your problem. His attitude made him a huge problem. Sounds like he needs to do some growing up.", "NTA.  I am not a morning person.  Everyone at my office knows it.  Not because I'm rude or complain, but because I'm quiet and look like I hate the world.  \n\nThis guy was something else.  He was miserable in the morning, so he was making everyone else miserable.  \n\nDon't feel guilty. What happened is the best outcome to keep the morale of your job at a decent place.  What a rough way to start each day!", "NTA. Leave the attitude in the car and get on with it works best for me", "NTA\n\nSeems like there's a pretty simple solution here. If you're not a morning person (and I'm not either! That's totally fine), then don't take a job that starts at 6:00AM daily?", "NTA", "NTA. \"Not being a morning person\" might warrant \"please don't talk to me and don't expect me to talk to you\". It does not warrant \"and therefore you must listen to me gripe and moan for an hour+ every day.\" I can't believe you put up with it for months! \n\nEither he needs a job that starts later, or he needs to get up an hour early to get it out of his system. Or, you know, just grow up and act like a civilized human being.", "NTA\n\nI’m not a morning person either. My alarm goes off at 4 AM every day, M-F and I’m reasonably sure life is not worth living for at least an hour. Sometimes it extends further than that but I just don’t talk to people until I’m certain I’ll survive.", "NTA.\n\nWhat you did is completely natural for a man with integrity and consistency.  This dude clearly isn't on that level.  He is unstable, tbh", "NTA But the ass chewing was deserved. \n\nPretty much he was gonna quit or cross a line to get fired eventually all on his own and that's what management was waiting for. They were gonna get every second of work even half assed out of him until he did. \n\nYou just broke first, and pushed the inevitable line crossing and VERY WISELY stated your self on the right side.", "NTA\n\"I'm not a morning person\" is not carte blanche to harrass coworkers every morning. As soon as he started dumping his emotions on the rest of you, he violated everyone else's boundaries to limit work conversations to work matters. Burdening the whole team with his grumpy outbursts is not okay. You should have called him out on that the first week. Now you know.", "There is a saying in Spanish: Lo cortés no quita lo valiente -- Being courteous/gracious/civil doesn't make you less brave. \n\nHis behaviour was unacceptable and he needed to be told off, but the problem is that you let your (justified) anger take over you and you responded in an aggresive manner that only added more fuel to the fire.\n\nI sympathize with you, many times I've been the one who dares to put assholes in their place because no one else has the guts to do it. But even if I'm right, if I have been rude or aggressive I do apologize. It is possible to set boundaries and being firm while staying calm and respectful, doesn't matter how angry we are.\n\nAnd since he came and apologized by his own initiative, it would have been a generous gesture to apologize for losing your temper. In no way would had affected the fact that you were right.\n\nTLDR: ESH", "NTA he should be a quieter not morning person. \n\nI would needle him every da if I were you, maybe asking him if he has a case of the Mondays.", "NTA. Good riddance.", "NTA\n\n\n\n\nI am the exact same way in the morning. I am unpleasant and everything bothers me till about 8AM or 9AM without fail. But I just don't talk to anyone for any reason I don't need to till then. Lol", "NTA- dude's own attitude and actions got him fired. If that was enough to get him canned, he was on thin ice already.", "NTA, btw have you ever read Bartleby the Scriviner? there's a plotpoint in that story about how the two other workers at the office have one who is terrible in the morning but great in the afternoon and the other is great in the morning but terrible in the afternoon. This reminded me of that character, Nippers.", "Lol i like how he gets himself fired, NTA.", "Why did your boss chew you out? \nNta. Its not right to take out own problems out on other people. Constantly. Every day. For months.", "Yes, I'm not a morning person either but you just get on with it because that's what you do when you're an adult.", "God, can you imagine wrangling multiple children to school, your own set of problems, AND having to deal with this asshole each morning? His wife must live on cigarettes and self hatred.", "He's still the asshole here. But I can explain why he took it most likely.\n\nI took an early morning job thinking I could handle it and promptly realized how wrong I was. But I was stuck with the job till I could find a replacement. So it made it even more miserable. So I just didn't talk to anyone for the first two hours or so of my shift cause I was a crab ass till about 8AM or 9AM. But I tried not to make it other people's problem. Unless they started to expect extra work from me because it made them look good to the boss. Lol Then I just promptly said no and refused. XD If they want to work harder in the morning that's a them problem. Not a me problem.", "Yeah same here. It's why I don't do first shift jobs ever. I'm insufferable and cranky for the first hours of the day and completely exhausted by the end of the day and just wanna go right to sleep after I'm home.", "For me I just don't talk to or work around others until I'm forced to or it's been a few hours. Hence why I work second or third shift.", "Don’t feel bad, be grateful. He needed firing. NTA.", "NTA\nMaybe he was trying to get fired so he could collect ...? Can't collect if you quit.", "NTA. All he had to do is keep his mouth shut.", "NTA.  It's on your boss to hire or fire.  Not you.  Guy can't shut up, he's lucky he wasn't fired a long time ago", "NTA. As an adult, you learn to manage your emotions and not take your frustrations out on others...or you should. He didn't and suffered for it.", "Hand me my coffee and run until about 10 am. That being said, what did this guy expect getting a job in agriculture? It's dirty, stinky, hard work and the hours are long. If he absolutely totally cannot deal he needs to find a M-F, 9-5 office job. Dude did all of you a favor getting himself fired. NTA", "NTA.\n\nI am \\*not\\* a morning person, at all. I could be an extra in a zombie movie for about the first hour after I get up. I just shut up, shuffle around dimly, and find some damn coffee.", "Yay! I love the expression \"Bless his heart.\"\n\nThanks for that pick-me-up.", "Hallelujah.\n\ndon't worry about the guilt, OP. it will dissolve away after a couple of blissful mornings of peace.", "NTA this guy has a ‘i’m in a bad mood and it’s everyone else’s problem’\n\nDuring the busy season farm work happens 24 hours.  He could have asked for a noon to whenever shift.  \n\nHe didn’t.  Took no responsibility for his behavior. OP it isn’t your responsibility to pick that up for him.", "[removed]"]}