{"id": 2548, "submission_id": "yxolyb", "title": "AITA because I’d rather my fiancés dad be homeless than live with us?", "selftext": "My fiance 26 male and myself 26 female just had our baby 9 months ago. We are still adjusting to new parents life and being newly engaged. My fiancé’s father in the 7 years I’ve known him has always treated my fiancé as a ATM even though we are not financially stable enough to lend money we somehow always end up assisting him. For some context my future FIL works in timeshare and is hugely commissioned based and he does not sell very well so every check he gets is less than $20. \n \nHe’s been kicked out of the house and it foreclosed in 2020. The house he kept in terrible shape I’m talking dog shit engrained in the carpets, moldy smell, bathroom floors are slimy and smell of urine just to name a few things. He constantly has fallouts with my fiancé and at one point I had to get in between them to diffuse a situation that almost turned physical. He is currently living in a motel because none of his 3 adult children want to to take him in for all the reasons I’ve mentioned and then some. He has recently reached out to ask for money to pay his rent yet again. To which I told my fiancé absolutely not because a couple months ago he stole my fiancés card and try to pay his rent with it after we already said no. So naturally I’m through helping him. \n\nHe is on a week to week basis in his motel. His girlfriend paid his rent this week luckily but I know we will encounter the same issue next week until he’s homeless. When he becomes homeless I do not want him to live here because I know he will never leave and I like my space. I don’t feel like I should have to live with my 62 year old FIL. However none of his other children will let him live with them. I told my fiancé I don’t care if he lives out of his van but he did not like that very much but I’m willing to give an ultimatum. It’s me or him so am I the asshole?", "created_utc": 1668686930, "permalink": "/r/AmItheAsshole/comments/yxolyb/aita_because_id_rather_my_fiancés_dad_be_homeless/", "score": 118, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I may be the asshole because he is my fiancés dad and considered family obviously so kicking him to the streets in terrible but I feel like we have no other choice but I could see why some people may think I’m wrong for that.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Nta. It's time FIL realizes sales may not be the job for him.", "This is a hill to die on because if his dad lives with you, he will be a significant factor in your finances, time, and personal space.  My wife and I are caretaking for my difficult MIL while raising children. It is exhausting almost every day.  They always fight and I always step in to stick up for my wife. But, now that our kids are old enough to notice our fights with her, that was the last straw for us.  We’ve recently given her an ultimatum on her behavior.  She’s been a little nicer because she doesn’t have enough money to live elsewhere, but her resentment will still be a gloomy cloud over our heads as long as she lives with us. \n\nSince you’re engaged, you guys need to talk more about how you envision your relationship and lives together as a family, and if your fiancé is willing to let his dad disrupt these goals, then that is a major problem.", "I'm not sure who the conflict is with.\n\nIf you and your fiancee are conflicted about this, I'll go with a clear NTA.\n\nBut if its you and your future FIL who are in conflict, I'd wonder why your fiancee isn't in the middle of that.\n\nI see \"should dad live here\" not as a you &. dad question but you and your roommate question. So if your talking about it with dad, but not roommate, then that's a problem.", "NTA\n\nFamily dynamics can be complicated and I can imagine this is a difficult situation for your other half but your FIL is not taking responsibility for his own life.\n\nSince he is capable of working, he needs to find another job that has better pay than $20. That is not your responsibility. \n\nYou are doing your best to provide for your family and having this boundary in place by not having your FIL move in is protection for your family.", "Nta. He can collect social security or apply for low income housing.", "NTA \n\nHe will ruin your relationship and your home", "NTA. Your fiancé is being manipulated. He needs to grow up and decide what is more important. If you had told me fil was an amazing man who you loved and respected but was down on his luck I’d say you are the a. BUT that’s not the case. You have a child to raise. Your first priority is your child. Every time your fiancé gives money to his dad it takes away from your child. That’s not ok. What happens if there is an emergency? Do you have 1k back if the car breaks down? Or if your roof needs replaced? What happens if one of you loses your job? Do you have savings to float you until you find a new job? What happens if the electric bill is double next month? Can you cover it? Now stop and think in the past 18 months (entire pregnancy and baby’s life)...how much money has fiancé given fil? Would that amount cover any of these expenses????", "NTA. You agreed to be a family with you fiance not raise his father.", "NTA", "NTA. That would be a hill to die on for me.", "NTA, but wouldn't it just make more sense to make sure he stays at a motel? Rather than waiting for him to become homeless and then deal with him needing a place to stay.", "NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy fiance 26 male and myself 26 female just had our baby 9 months ago. We are still adjusting to new parents life and being newly engaged. My fiancé’s father in the 7 years I’ve known him has always treated my fiancé as a ATM even though we are not financially stable enough to lend money we somehow always end up assisting him. For some context my future FIL works in timeshare and is hugely commissioned based and he does not sell very well so every check he gets is less than $20. He’s been kicked out of the house and it foreclosed in 2020. The house he kept in terrible shape I’m talking dog shit engrained in the carpets, moldy smell, bathroom floors are slimy and smell of urine just to name a few things. He constantly has fallouts with my fiancé and at one point I had to get in between them to diffuse a situation that almost turned physical. He is currently living in a motel because known of his 3 adult children want to to take him in for all the reasons I’ve mentioned and then some. He has recently reached out to ask for money to pay his rent yet again. To which I told my fiancé absolutely not because a couple months ago he stole my fiancés card and try to pay his rent with it after we already said no. So naturally I’m through helping him. He is on a week to week basis in his motel. His girlfriend paid his rent this week luckily but I know we will encounter the same issue next week until he’s homeless. When he becomes homeless I do not want him to live here because I know he will never leave and I like my space. I don’t feel like I should have to live with my 62 year old FIL. However non of his other children will let him live with them. I told my fiancé I don’t care if he loves out of his van but he did not like that very much but I’m willing to give an ultimatum. It’s me or him so am I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "He sadly lives in the past. He use to be in the presidents club when he was great at his job in his 40’s but it’s like gambling he’s just excited at the “chance” of getting a deal. It’s so frustrating", "Well said. It will come down to either choosing us or choosing his dad. We’ve done everything we could for that man and it’s already caused so many fights between us that I lose count. I do not want the same conflict your dealing with! I commend you for having the patience for that.", "Yeah it a conflict with my fiancé and myself. My fiancé is all about family and thinks if we have a spare room we should always allow family who have nowhere to go to live with us. However I have a baby and our finances to worry about not my FIL’s comfort. I also offered to sign him up for cash assistance and food stamps but I heard nothing.", "Which is what is frustrating as he will use that to manipulate my fiancé. He will tell him he “applied” to places like target and that he hasn’t heard back yet. He will make it seem like he’s trying even though he says this every time. With nothing changing.", "Well said. We have gone struggled at times because of that! We dont have enough to cover expenses in those cases so I feel like my stress and resentment is understandable. Enough is enough. My family comes first.", "We have already spent over 5,000 ensuring that’s the case but we are no longer able to do that. We are struggling ourselves right now financially so it’s not an option.", "OP it sounds like out of all the children your husband took on the role of care taker so his need to people please & codependency are running his thought process. You're NTA for wanting your limited finances to be spent on your home & your family- meaning you & his child. FIL isn't even willing to help himself by the sounds of it. I don't view a boundary as an ultimatum. Saying if you give him our money/ let him believe that he can eventually live in your home with you both supporting a whole other adult then I will be forced to do.... x. NTA", "I assume you are willing to give up your family as well ?", "And nothing will change (for the better) he moves in with you.\n\nIt will put even further strain on your relationship and make you feel uncomfortable and helpless in your own home. \n\nYou are entitled to feel safe and comfortable in your home and not be taken advantage of and you know this will happen if you allow him to move in.", "Can you not get him into more steady work? You owe him nothing, but I guess your best option is to make sure he doesn't become homeless and end up at your door anyway possible.", "You hit it on the nail. He is definitely the caretaker to his friends and family which drew me to him 7 years ago but now it’s part of the issue. Boundaries are much needed. Thanksgiving is coming up and the get together is at our house and I’m sure he will make comments about being homeless and purposely make us all uncomfortable as he always does and try to stay but I’m not budging.", "I’m willing to but don’t get me wrong if anyone else in his family were down on their luck we would allow them to love with us as it is a hand up and not a hand out. They work hard for their money and would do everything to get themselves out of the hole. His dad however will take it and spend it on stupid stuff like vodka or eating out. He also destroys the homes he lives in and I’m not cleaning up after him. The rest of his family is not like him so I would be open to helping the rest of his family or my family just not him. In regard to a place to stay that is we are not giving money to anyone anymore. Period.", "My fiancé owns a business he started in 2020 in landscaping. He tried to have his father work for him which ended in him costing him way more and ruining his reputation due to the crappy work his father would do. When that no longer worked he suggested working at lowes or something and he always said he would try and yet he has not done anything. I even offered to sign him up for government assistance and he didn’t even go for that.", "I do not envy you one bit. Id to set boundaries with family saying theyd no food, electric etc. It was sending me to a breakdown but therapy helped me see that I'm not responsible for other people's choices. Ever. They can try to hand me their baggage but I've got enough of my own & I don't have to pick theirs up. FIL is choosing his job, his choices that got him kicked out, whether he applies for financial help etc. None of that's your problem. Id have the convo with your fella well in advance so he chooses wisely. If he picks his dad over you then unfortunately you've tough choices to make.", ">male and myself \n\nSounds like he is just happy sponging off his kids then and has no intention of helping himself.", "I will definitely have a very clear conversation where I map out the cause and effect of his choices regarding his dad. This is the last fight I’m having , I ain’t got no more left in me for this topic with him.", "That is true. Well his luck has run out because I’m going to stand firm. I’m not going to allow him to tear apart our family. It’ll have to be a choice of him or us sadly.", "NTA", "NTA.", "NTA  I think your decision is wise.  Otherwise, your fiancé will be supporting him until he dies.   If your fiancé can't see that his father will not take care of himself, then it is best you skip the years of misery that are ahead.  It has to be his decision, not one forced on him.  He has to see it himself.  Otherwise, he will blame you for everything that happens to his father.  Tell him to go live with his father in the motel.  Maybe this will open up his eyes that adults don't keep jobs that pay $20 a pay period.", "NTA. I understand family helping family but I want to help good people; not lazy good-for-nothings.", "Nta. You ned to die on this hill", "NTA\n\nThis is just like a mother in law craziness with a father instead. \nSomeone who has blatantly disrespected you and your fiancé and even his own home doesn’t deserve kindness now. He will make your lives more dramatic and a living hell. You can’t take money to help an ahole if it means robbing your family of their needs. \nWhy doesn’t he just move in with gf", "NTA - protect your space and get your partners head out of the clouds. Ultimatum time. Sure FIL can live with HIM, not you or your baby just HIM in the motel together bc he’s not welcome in the family home. \n\nFIL is in a bed of his own making. Don’t let him ruin your relationship and home as well.", "NTA I would not live with him either. You can call it an ultimatum or a boundary, but not wanting to live with that guy sounds like the best boundary you can have. Don’t break it, and make sure you let your better half know that it’s a deal breaker for your and that you will find your own place if that happens. If you have a lease it’s easy, the landlord doesn’t want him there and you likely has signed a binding contract saying  ivory else can live there.", "You’re right which is why I struggled with it for so long because so can’t make that decision without resentment building if something happens to his dad so it has to be him to make that choice! If he can’t see it now then he never will so we will see what happens in these coming weeks because his gf is not going to keep footing the bill and our stance on it is firm. If my fiancé goes back on it then I know where I stand.", "Because she won’t allow him to move in because she knows he a broke man who treats his homes like trash", "Be wary about merging your finances with him. He'll use your money to help his family.", "So then why would it be up to you? If she has the same issues this is a DING DING DING moment. He isn’t your responsibility. If he was nicer and more responsible then sure take him in, but if he was, he’d have other invitations as well….", "He makes more than me so unlikely but his money is our families money and we already agreed no more money is to be spent that way and I have my eyes glued to our banking transactions to make sure I hold him accountable.", "That’s very true! I’ve always felt bad about it because I thought I was being selfish but sometimes you have to be to protect your family. If it’s selfish to have him be homeless rather than shatter my family than so be it.", ">My fiancé is all about family\n\nask him what about the family he created with you? If his dad moves in it's going to create financial and personal issues in THAT family"]}