{"id": 25494, "submission_id": "1613y71", "title": "AITA for telling my wife about a surprise date we're no longer going on?", "selftext": "So I (27M) was putting up a surprise date for my wife (25F) to go out to our favorite Japanese restaurant. \n\nMy wife however, is on a call-type of work. She's a babysitter for a friend of hers. \n\nSo here's the issue. My wife mentioned to me that this weekend, she had to go watch her friends 3 kids overnight tonight and tomorrow night. She hasn't been looking forward to it and has actually been dreading it. I was a little disappointed, but she's making money, so I can't be too upset. \n\nBut then, her car broke down yesterday night (Thursday). She can't drive it and she's ordering parts in today. She asked me to drive her to work today and she's going to stay there until Sunday Morning. I was on a time crunch & still getting ready for work. I reluctantly agreed and took her to work before I had to get ready. She asked to grab a coffee and offered to buy me breakfast so I wouldn't be so crunched for time. I kept looking at the time and got more and more peeved that my time to get ready was slipping away for a coffee & a 15 minute drive bc of her car. I got her there, but on the way, I mentioned the dinner. She mentioned my hair after being quiet most of the ride and I mentioned that I was going to get it cut as a surprise for a surprise date to the restaurant. She groaned and said she's rather go for a date. I said it's a little late for that, and dropped her off with a quick \"I love you\" from her & she grabbed her stuff. I did kinda snap at her and I know that's why she was quiet. \n\nNow she messaged me and said that she loved me & that she's sorry for making me late, which I was. She also mentioned that she would have loved to go to dinner if she could get out of watching her friends kids overnight this weekend. \n\nI know she's probably feeling guilty for making me drive her (she has literally no other choice). I did make a comment that I'd make her just use a motorized pedal bike to bike the 15 minutes up hill. \n\n\nSo I'm asking you all. AITA for mentioning the surprise dinner?", "created_utc": 1692980800, "permalink": "/r/AmItheAsshole/comments/1613y71/aita_for_telling_my_wife_about_a_surprise_date/", "score": 39, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I might be the asshole bc I mentioned the dinner and made her feel guilty for her car breaking down and her having to work.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, but not for mentioning the dinner. The problem is that you took out your annoyance over a series of unavoidable incidents on her. \n\nShe's not any happier about her car being broken than you are. She was aware of the imposition being put on you, and how frustrated you were, and she tried to reach out by saying that she would have rather had the dinner than deal with the car and the work. At that point, the *correct* response would have been to reassure her. You could have said, \"Yeah, I know. We'll do it next week.\" \n\nApologize to her for snapping, offer a rain check on the date.", "YTA. Your motivation for telling her was to upset her. That’s a shitty thing to do.", "YTA\n\nIn a comment you mentioned that you didn't make a reservation, so your surprise date was more of a maybe date.", "I'm not even sure I believe you had a date set up. Sounds like you just wanted to upset her. YTA.", "If you knew her car was broken last night, then you both knew she would need a ride to work today.\n\nWhose fault was it that the ride happened late? Sounds like it was yours.... because she was ready to go and you hadn't gotten ready yet \n\nWere you purposely not getting ready to stress her out over whether or not you'd give her a ride? \n\nYou honestly sounds like a dick at every point of this interaction.", "I’m not sure if you are an asshole but I do question why you mentioned it all if your intention wasn’t to make her feel bad?  If that was the intention than you would be but its possible with context its more innocent than it seems", "YTA. What were you hoping to get out of this interaction besides making her feel bad for trying to earn money, for what I assume is for the both of you? Your behavior is petty and hurtful. Apologize to your wife.", "You have a really weird dynamic with your wife. \"her car\" broke down.  Yall are married, its \"one of our cars broke down\".  You  \"reluctantly agreed\" to drive her to work for a one off situation.  You then brought up the dinner for some reason after she got called in to work this weekend.  Then we she expressed she'd rather be going on that date night with you, you were rude back to her.  You also made a snide remark how she could use a motorized bike instead of you driving your wife to work, after she apologized to you for the car breaking down.\n\nYTA.", "YTA\n\nyou knew the night before that she would likely need a ride and were not thoughtful.", "YTA. Super petty as well. No need to go out of the way to be an ass.", "YTA \n\nYou only told her about it to upset her because she “made you late”. You were being petty and an asshole. Smfh", "I mean you're kind of an asshole for having an issue driving your wife to work lol. She is your wife. Drive her to work and suck it up.", "YTA. At the end of the day, you’re upset she was called into work and ruined your surprise date plans. Then you pile more frustration on by the “inconvenience” of her car breaking down and needing to help her. So you lash out to make her feel upset, just like you are. \n\nNext time, say something like, “Honey, don’t make plans for this day/weekend. I am planning a surprise for you.”", "YTA", "ESH I think. Not harshly on either side, but still.   \n\n\nYou suck because No, you didn't need to be petty like that. You were petty and passive aggressive and you didn't bring up your feelings like an adult. BUT: if it's regularly difficult to get time with your wife when she works on-call and she's taking additional, unnecessary responsibilities like childcare for friends on top of that, then I would also get frustrated enough to be petty. It's human, but you were T A about how you handled it and I think you know that. This sub will probably rip you apart for daring to experience negative emotions that aren't 100% in the right, but I get it.   \n\n\nYour wife sucks because it seems like she's not making time for you, and because she also seems to be the kind of person who thinks about things that aren't critical as critical. No, she doesn't *have to* watch her friends kids. She just doesn't. The friend can get a babysitter, the friend can call family, this is not something she is being forced to do and she needs to be realistic about that. You should be prioritized too- with the caveat that you didn't even give her the chance TO prioritize you. The date was a surprise. How could she know?   \n\n\nMy guy, you know your wife's schedule is unpredictable. You may like surprises, she may like surprises, they're romantic and fun, but if there's no room in your life for that at this point in time, then there's just no room. She didn't even know that you'd planned anything and you're punishing her for not planning for it too? Make date plans in advance so that you can work together to keep the time free, at least until she's not on-call anymore.", "NAH\n\nCommunicate better with your wife in the future though.", "NTA\n\nShe made you late, made weekend plans without talking to you. I suspect you told her out of frustration.\n\nI would have been upset as well", "I don’t really understand the YTA votes. I can understand why OP would be frustrated, and anyone in that situation would be… we are humans, we will get disappointed. Also, I think stopping for coffee was a l little out of line from the wife when she knew OP had to get to work. That would have 100% peeved me off (I hate being late). I don’t think it is that big of a deal, and married couples should be able to say what bothers them. They aren’t children, they can talk to their significant other about things that bother them (even if it sometimes comes off as rude or annoyed). ALL of us are guilty of that in one way or another.\n\nI am already prepared to be downvoted, but I just don’t get why it’s YTA. I would have thought NAH or slight ESH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I (27M) was putting up a surprise date for my wife (25F) to go out to our favorite Japanese restaurant. \n\nMy wife however, is on a call-type of work. She's a babysitter for a friend of hers. \n\nSo here's the issue. My wife mentioned to me that this weekend, she had to go watch her friends 3 kids overnight tonight and tomorrow night. She hasn't been looking forward to it and has actually been dreading it. I was a little disappointed, but she's making money, so I can't be too upset. \n\nBut then, her car broke down yesterday night (Thursday). She can't drive it and she's ordering parts in today. She asked me to drive her to work today and she's going to stay there until Sunday Morning. I was on a time crunch & still getting ready for work. I reluctantly agreed and took her to work before I had to get ready. She asked to grab a coffee and offered to buy me breakfast so I wouldn't be so crunched for time. I kept looking at the time and got more and more peeved that my time to get ready was slipping away for a coffee & a 15 minute drive bc of her car. I got her there, but on the way, I mentioned the dinner. She mentioned my hair after being quiet most of the ride and I mentioned that I was going to get it cut as a surprise for a surprise date to the restaurant. She groaned and said she's rather go for a date. I said it's a little late for that, and dropped her off with a quick & she grabbed her stuff. I did kinda snap at her and I know that's why she was quiet. \n\nNow she messaged me and said that she loved me & that she's sorry for making me late, which I was. She also mentioned that she would have loved to go to dinner if she could get out of watching her friends kids overnight this weekend. \n\nI know she's probably feeling guilty for making me drive her (she has literally no other choice). I did make a comment that I'd make her just use a motorized pedal bike to bike the 15 minutes up hill. \n\n\nSo I'm asking you all. AITA for mentioning the surprise dinner?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Certified YTA behavior, you wanted to hurt her and you knew you would. I bet you feel good about it.", " Wtfs a surprise date", "I think what gets me is that you were scheduling a date to be a surprise knowing that your wife’s schedule is irregular. Like I know you wanted it to be a surprise for her, but because her work schedule is so crazy, you couldn’t say anything like “hey leave x weekend open, I’ve got something planned for us.” You don’t have to tell her where you’re going or what you’re doing, it doesn’t ruin the surprise, but the anticipation she’ll have for the date makes it more fun! \n\nBut yeah, YTA. For not recognizing that she would need a ride, for bringing up the date in a passive aggressive way, KNOWING IT WOULD MAKE HER UPSET, and for being snappy at her over things she had no control over! Of course she feels guilty; you basically punished her for her car breaking down suddenly and having to work! \n\nApologize and bring your wife flowers while she watches those kids because it’s the least she deserves after having to deal with the stress of a broken down car, three kids, and your passive aggressive behavior.", "Yeah, almost sounds like he would have done nothing until he heard from his wife that she had to work the. It was \"oh, bummer I was totally going to take her out but now I can't.....\"", "She's one to cry over little things, even if it's not that big of a deal. It wasn't my intention to hurt her feelings, but I was a little peeved & I did mention it to have it out there, if that makes sense.", "My husband and I refer to things as \"mine\" and \"yours\", even when we both know they are \"ours\". For us, it is as simple as, \"you use that car/computer/laptop/etc. more, so it is yours\".  But the reality is that either of can use whatever and neither of us care.  \n\nMy issue is with his attitude toward her when it was not her fault that she needed a ride for, like you said, a \"one off situation\".  She probably already felt bad, but he really could not help himself making her feel worse.", "> \"her car\" broke down. Yall are married, its \"one of our cars broke down\".\n\nI do not understand this nit pick at all. They're married, so they're not allowed to refer to something as just their own now? It has to be both of theirs?", "Not every marriage has all assets/ finances commingled.", "The babysitting is her full time job. She works when her friend works, and she's paid by the state. Sorry, I should have mentioned that.", "She did not make plans without talking to him, watching the kids is her job, and he knows that. He made plans without talking to her and then got upset when her on-call job interfered with those plans.", "being an asshole out of frustration is still being an asshole", "She did mention the weekend work plans a week ago and I did know about them prior. I didn't make any reservations or anything.", "I don’t understand why if he was so crunched for time he couldn’t just say sorry I really don’t have time to stop for coffee. Simple as that. He was the one driving, he’s the one who ultimately agreed and drove to the coffee place. \nImo he’s TA because the wife didn’t even know about the date. So she’s having this not so great week and relaying all this information back to her husband and he’s quietly in the background getting more and more upset about not being able to go on this date?", "Dude, it absolutely was your intention to make her feel bad, you need to admit that to yourself. If I understand right your wife has an on-call job which is babysitting for her friend, you know this. There was literally no reason for her not to accept watching her friend's kids that weekend - it's her job and she didn't know about the planned \"date.\" If your partner has an on-call type job you need to realize that plans might get scuttled and you especially need to realize that you can't make plans without her knowing. I know that it kind of sucks that you can't surprise her and it takes some spontaneity out of your relationship, but that is the way it goes. YTA for knowing all of this and still being upset with your wife and lashing out to hurt her.", ">> She’s one to cry over little things\n\nLike being snapped at by her husband over a minor inconvenience?\n\n>> I did mention it to have it out there\n\nC’mon now, OP. You didn’t mention it just to “have it out there.” You threw it in her face as a punishment for:\n\n• being unavailable for a date she knew nothing about \n\n• inconveniencing you by asking you to drive her to work when she was *left without a working car*\n\n• inconveniencing you further by offering to buy you breakfast as a thank you for driving her \n\n\nYTA. You can say it “wasn’t your intention” to hurt her feelings, but your actions - and the condescending way you talk about her being upset - say otherwise.", "“But I was a little peeved & I did mention it to have it out there”. This means you did say it to upset her.  You were annoyed so you “wanted it out there” because you wanted her to also be bothered.  You were/are being unfair to her since you are aware her job is an on call situation.  If she doesn’t know about the date she has no way of knowing she can’t be on call that day.  She is not in a job where “surprise” dates are a feasible option.  In the future you need to keep that in mind.  As far as the car thing goes, it sucks but it was out of y’alls control and you shouldn’t be annoyed at her for that.  I’m sorry that you can’t surprise her in the way you wanted but you shouldn’t use the knowledge of that failed surprise to punish her for not being available.", ">She's one to cry over little things\n\nIf you know this, it makes it even worse that you gave her attitude.", "to have it out there.........to make her feel bad?", "Sorry, you can still refer to it as her car or his car, but when something goes wrong, it's not just her problem or his problem when you're married, it's our problem.  As I said in another reply, he's showing a lot of resentment towards her for things out of her control. Giving your wife a ride to work when the car she uses breaks down is like the absolute bare minimum", "It does when he’s a man lmao", "Correct, but they're still married.   He's showing a lot of resentment for things out of her control.  Giving your wife a ride to work when the car she uses breaks down is like the absolute bare minimum", "Hi op - is she marriage material?", "I absolutely agree with that. I just don't see what relevance the fact that he called it her car has to that, or how it's relevant to this situation at all.", "I agree but this could be a case of her setting her life up this way.  That could always be or it could be new.", "I have to agree with you. The tone of this was just… off. It sounds like this on-call babysitting is a known thing so I’m not sure how a surprise dinner would ever happen and also wondering why it would have been planned if she told him the nights she would be gone. Also not sure why she needs to babysit for the friend. Is this a favor or an actual job like a nanny to someone she happens to know. I also think it’s weird that he was so annoyed by being late, even when wife was actively apologetic and trying to make it up to him, that he told her about a surprise that won’t happen to make her feel bad? I do not understand this dynamic so I think he’s the AH", "I married her, so yes?", "Wild assumption to blame someone for a car breaking down."]}