{"id": 25506, "submission_id": "1617bnb", "title": "AITA for ignoring my husband's extended family at a big dinner?", "selftext": "I am pregnant with my 2nd child. I'm still in the first trimester, but only for another week. So far, we've only announced to a few close friends and family. Not our extended family.\n\nWe had my SIL and her kids in town. They were staying at my MIL's, which is about an hour away. We wanted to see them the last night my SIL was in town, because we only see them once a year, and we are very close to them. We decided to pick up our 2 year old from daycare early, and drive to MIL's for dinner. Right before we left, I had a horrible migraine and became physically ill. It's just part of being pregnant, so I rallied and put myself in the car.\n\nWe get to their house, and notice his aunt and uncle are there. The aunt has always been nice to me. The uncle has always said inappropriate and rude things to me. My husband doesn't much care for them. We only see them about once or twice a year, so it's typically tolerable.\n\nWe walk in, I put my toddler down and drop my bags. First thing I hear from the aunt is \"I guess you're not just gaining weight.\" I was in complete shock and said \"yes, I guess so.\" Ran upstairs and cried in the bathroom. My husband was also shocked. He told them I had gotten sick. I'm grateful he covered for me. There were kids in the house, and I did not want their last night with their grandmother to be filled with arguing.\n\nMy anger is coming from two different places. First, my MIL should have never shared our news without our permission. Second, I feel I was called fat the moment I walked through the door. I struggle with body dismorphia and the early stages of pregnancy are difficult for me. I stayed upstairs for an hour watching music videos with my niece. Finally came back downstairs when my child was eating his dinner. The aunt just grabbed my arm and said \"hope I didn't offend you.\" I ignored her and kept walking towards my child. I refused to engage in any conversations with them for the rest of the evening. I did talk to my MIL because she just got ahead of herself.\n\nI left without saying a word to them. It was mostly out of spite, but partly because I wasn't sure if I would completely lose my temper. Does this make me the ah? Should I have sucked it up and gotten over it for people I rarely see? I feel like I put a damper on the night for everyone.\n\nTl;dr: extended family commented on my growing belly before I could announce my pregnancy. I, in spite, refused to speak with them.", "created_utc": 1692988553, "permalink": "/r/AmItheAsshole/comments/1617bnb/aita_for_ignoring_my_husbands_extended_family_at/", "score": 81, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I responded to a comment about my pregnancy by ignoring others and ruining a night for everyone. I did this in spite for the person who made the comment.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - you had a migraine, are pregnant and the first second you walk in the door the aunt calls you fat.  Added to the fact that your MIL spread news you didn't want to be out yet.  I would probably done a 180 and gone back home.", "Being called “fat” is an excuse to leave. My wife would have lol. \n\nYour husband needs to have your back if someone makes you feel uncomfortable. \n\nYou’re not an asshole.", "NTA\n\nI’m always so shocked when anyone thinks it’s okay to comment on a pregnant woman’s body.  It’s just never acceptable.  Add to that, they revealed your pregnancy early, I would have ignored them all and left as well.", "WOW NTA. How do people get through life acting like that? I hope they learned a lesson and felt awkward, but probably not. They should apologize. You were too kind if anything by not saying anything back", ">First thing I hear from the aunt is \"I guess you're not just gaining weight.\"\n\nImagine going through life thinking this is an acceptable comment to make to anyone about their body. What a socially graceless woman. \n\nNot engaging with her was the kindest course of action for everyone. It reduces the risk the aunt would continue to say completely inappropriate things and it allowed the rest of the gathering to continue without it turning into a dramatic *thing*.\n\nThe OP is, of course, NTA.", "NTA - how freaking rude of them.", "NTA AT ALL. Double respect for keeping your cool. That is incredible and you deserve a million up votes for that feat alone. Kudos to your husband for covering for you. And congrats!!!!!!", "NTA OP", "Way to bury the lead!\n\nPost should have been headlined: Am I justified in being upset with the in-laws after MIL told everyone I was pregnant before we made an announcement.", "NTA and kudos to you for not talking and avoiding a possibly argumentative situation. It was a horrible comment to make, even if you didn’t have body dismorphia", "NTA\n\nWhat a shitty way to say “congratulations”.  So rude and I would have just left so you’re better than I am.  \n\nAlso, as a life rule for anyone reading, wait for the person to tell you any life news directly before reacting.  Hearing it second-hand usually means someone was just so excited but don’t take away the opportunity for someone to tell you their own news; bite your tongue.", "NTA.  Auntie was the one who decided to start off the night by dropping a turd into the metaphorical punch bowl.  It's on her that it stank up the rest of the evening.", "NAH. You said your aunt has always been nice to you. Her comment was likely said in a friendly way, and would not be a big deal if you didn’t have body dysmorphia.", "By not making a scene but by 1) withdrawing for over an hour 2) ignoring aunt, I'm pretty sure everyone picked up on the bad vibes anyway. Look, it sounds awful - and if someone had said that to me I'd be pissed off. Your feelings are very valid, as is processing your emotions privately. I think your husband could have had a private word to aunt straight away. I also think your aunt was looking for an opportunity to open the conversation and apologise (she needed to!!). I wonder if auntie has foot in mouth disease?", "YTA for doing it out of spite & ignoring everyone else who you don’t have issues with. Everyone has family members that suck. By all means, you didn’t need to engage with her all evening but there were other people there you do like/wanted to see. Making a situation worse/more uncomfortable for everyone is what children do. You’re an adult.", "NAH\n\nIf your relationship with the aunt was bad I might think she was the A but since it’s not I think she may have been making a friendly joke. You are pregnant so nobody should judge your reaction, you didn’t think it was funny and left the situation.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am pregnant with my 2nd child. I'm still in the first trimester, but only for another week. So far, we've only announced to a few close friends and family. Not our extended family.\n\nWe had my SIL and her kids in town. They were staying at my MIL's, which is about an hour away. We wanted to see them the last night my SIL was in town, because we only see them once a year, and we are very close to them. We decided to pick up our 2 year old from daycare early, and drive to MIL's for dinner. Right before we left, I had a horrible migraine and became physically ill. It's just part of being pregnant, so I rallied and put myself in the car.\n\nWe get to their house, and notice his aunt and uncle are there. The aunt has always been nice to me. The uncle has always said inappropriate and rude things to me. My husband doesn't much care for them. We only see them about once or twice a year, so it's typically tolerable.\n\nWe walk in, I put my toddler down and drop my bags. First thing I hear from the aunt is \"I guess you're not just gaining weight.\" I was in complete shock and said \"yes, I guess so.\" Ran upstairs and cried in the bathroom. My husband was also shocked. He told them I had gotten sick. I'm grateful he covered for me. There were kids in the house, and I did not want their last night with their grandmother to be filled with arguing.\n\nMy anger is coming from two different places. First, my MIL should have never shared our news without our permission. Second, I feel I was called fat the moment I walked through the door. I struggle with body dismorphia and the early stages of pregnancy are difficult for me. I stayed upstairs for an hour watching music videos with my niece. Finally came back downstairs when my child was eating his dinner. The aunt just grabbed my arm and said \"hope I didn't offend you.\" I ignored her and kept walking towards my child. I refused to engage in any conversations with them for the rest of the evening. I did talk to my MIL because she just got ahead of herself.\n\nI left without saying a word to them. It was mostly out of spite, but partly because I wasn't sure if I would completely lose my temper. Does this make me the ah? Should I have sucked it up and gotten over it for people I rarely see? I feel like I put a damper on the night for everyone.\n\nTl;dr: extended family commented on my growing belly before I could announce my pregnancy. I, in spite, refused to speak with them.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA- I’m so sorry your Mil shared your news without permission and that your husband’s awful aunt was so rude to you. \n\nIt’s hard to stand up for yourself and/or confront people especially when you’re surprised or shocked. But I find pausing taking a deep breath and replying with something along the lines of “What a horrible rude thing to say. Why on earth did you think that comment was appropriate to make?” \n\nThen stand back and watch them flounder to answer.", "YWBA if you didn't tell the MIL not to tell anyone. \n\nYA for not clocking that ignorant witch or making a comment like \"at least I have an excuse unlike you.\"", "NTA--you are (1) pregnant and (2) had a migraine. You didn't make everyone leave. You didn't tell anyone horrible things. That is the best outcome anyone should expect of a pregnant person with a migraine. I hope the rest of the pregnancy is better.", "Why anyone is saying anything about a pregnant woman’s body out loud is beyond me.  Like what even", "A 360 is just giving them a twirl...", "I think we were both in shock it was the aunt who said something rude and not the uncle. I also didn't want him to react because he had our son in his arms, and our niece and nephew were in the house. It did definitely spark the conversation between us on how to handle these type of issues in the future.", "I didn’t read it as the aunt calling her fat. She knew that OP was pregnant (and was showing, which is common at that stage for a second pregnancy) and tried to bring it up in a friendly way. Since she was told by MIL she probably didn’t know that it was supposed to be a secret. Granted the aunt was socially awkward, but that doesn’t make her an AH.", "What MIL did annoyed me more than it angered me. She's never been great with holding onto news like this. She's also been stuck in her house for months, due to a health issue. I think she just got excited. I may confront her about not sharing any big news with others without my permission.\n\nMy anger is definitely with the aunt because there have been many rude comments made by her husband, daughter and grandson towards me.\n\nMy inlaws can be frustrating, but at the end of the day, they do love and care for me. The uncle (and possibly now the aunt) would like me to leave and never return. It's very odd because they aren't close to my husband.", "What would you suggest doing", "I didn't ignore everyone else. Just the aunt who made the comment. But I do think it made others uncomfortable.", "I was told once that you NEVER ask/mention about a woman being pregnant unless you actually see the baby's head crowning!!!", "True, edited to 180.", "When is it ever okay to point out someone gaining weight? Pregnant or not", "Calling anyone fat is disrespectful. We’re adults.", "I would have said something to the effect of, ‘It’s really inappropriate to make comments about my weight. I don’t appreciate it. Please don’t do it again.’ Then I’d have left it at that & engaged with the number of other people OP actually liked/wanted to see. \n\nIn coming back down, I’d have been honest & said, ‘Actually, yes, you did. I don’t appreciate comments about my weight.’ \n\nIt’s direct, it’s mature, you’re addressing the issue head on & then you get on with the evening. If OP was 17 or something, I’d understand hiding out in the bedroom. As she is an adult, dealing with the situation (as upsetting as it was) directly says what needed to be said & she’d have been standing up for herself in a mature way.\n\nEdit: spelling/typos.", "I just feel bad no one called her out for it. People are way too polite to people that don't deserve it. It's 100 percent not your fault that people felt uncomfortable", "Never ok to frame it as weight gain. Pretty common for women to talk about the other's \"baby bump\" and how exciting it is (assuming they know for sure that person is pregnant!).", "Agree, I'm assuming the aunt wasn't being socially awkward and not calling her fat.\n\nWhen I was pregnant with my first and told a friend that I was pregnant, she said something like \"I had wondered if you were pregnant or just gaining weight\". It was an awkward thing for her to say (and I think I replied with something like \"well that's awkward...\"), but there was no ill intent and we moved on in the conversation and friendship. Good people sometimes put their foot in their mouth.", "True, that would have been better. I think OP mentioned not wanting to argue or cause drama though. I think she probably just wasn't in the mood to socialize after that too. I don't see where she said she ignored everyone else either.", "She didn’t say you got a baby bump. She said that it was good to know that she was gaining weight because she pregnant", "Agree, and I'd be a fool to think I've never shoved my own foot into my mouth. We all make mistakes. But with the history of issues her family has had against me, it definitely made me wonder if her kindness was ever genuine. I've tolerated and ignored many comments, and emotionally couldn't do it yesterday. Maybe that's why it all feels wrong to me.", "NTAH here, your family is pretty toxic.", "NTA. You let them off easy after they openly insulted you.", "Honestly, it’s not okay to comment about anyone’s body. People need to keep their opinions to themselves. NTA."]}