{"id": 25526, "submission_id": "161kc86", "title": "AITA for stealing my neighbor’s puppy?", "selftext": "AITA for stealing my neighbor’s puppy?\n\nI (37F) live in a small city. Two nights ago, a puppy showed up in my front yard. He was VERY skinny. I could see every rib and his hip bones were were sticking out. (I feel like emaciated is the word I’d use to describe him.) I gave him some dog food, which he scarfed down in 30 seconds flat. In all, I gave him about 6 cups of food, and he drank a gallon of water. He was a little skittish, but very friendly. He was also covered in fleas, with a small sore on his side where he has been scratching himself. \n\nI have a spoiled rotten Corgi. Not knowing this new puppy, I left him in the back yard with food and water for the night. In the morning, he had escaped and was nowhere to be found. \n\nToday, the puppy showed up again. I fed and watered him again. This time, I also introduced him to my Corgi. They became besties almost immediately. The puppy has been at my house all day and I put him inside while I was gone. It is about 107 degrees outside and I didn’t want to leave him out in the heat. My fiancé and I decided we would give him a home since he has shown up hungry twice now. \n\nWhen my kids got home from school, my older son said the puppy looked familiar. He then told us he has seen it at the neighbor’s house 2 doors down when he walks home from school. He goes to school with the girl who lives there. \n\nI haven’t ever had any contact with this neighbor, but I do hear them screaming at one another at 3:00 a.m. a few nights a week. I have also picked the girl up and driven her to school when she was walking to school in the rain. I’m not saying these neighbors are bad people, but the puppy is definitely skinny and seems pretty neglected.\n\nMy son offered to message the girl he goes to school with to tell her their puppy is here. I told him not to because we are going to keep the pup. I feel a little bad because I know I would be devastated if someone found my Corgi-Boy and didn’t give him back. AITA?", "created_utc": 1693021754, "permalink": "/r/AmItheAsshole/comments/161kc86/aita_for_stealing_my_neighbors_puppy/", "score": 107, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I took my neighbor’s emaciated puppy in because it came to my house twice looking for food.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I would immediately take him to the vet and get them shipped. After reading something else on here, the police will return the puppy to the people who have the chip registered.", ">AITA for potentially saving a puppy's life?\n\nI fixed your title.\n\nNTA", "NTA. Our rescue Buddy had been starved and was emaciated like this as well as having kennel cough and other issues. I had to feed him 5 times a day for about 2 weeks to bring his weight up as well as administer pills for his other conditions. He's doing REALLY well now but it was a whole journey.\n\nI have NO patience with animal cruelty.", "NTA. They've been extremely neglectful of an animal. That is unacceptable. \n\nHowever, I would say call the local animal shelter and find out their procedures. If they seem reasonable and cooperative, turn it over to then. Tell them that you'll be back in 5 (or however many days they require) days to check. Be clear, if the owner hasn't come looking for the pup, then you're going to adopt him. Make them promise (in writing if necessary) not to euthanize the dog and promise (in writing) you'll be back to adopt. \n\nOnce a reasonable period had elapsed, you can return and adopt the dog. If the neighbors find out you do have the dog, you will have a legal leg to stand on since you went through proper procedures.", "NTA. I have no use for prime who abuse or neglect animals. Keep that baby safe.", "NTA\n\nBut make sure you go about this the right way.  You live two doors down.  They have to be on board with you keeping the puppy.  Chances are they’ll allow you to keep it, if it’s as neglected as you say.  Sounds like this poor baby needs saving, just make sure you do it properly/with their knowledge.", "Bring it to the vet, when it's chipped, bring it back to the owner, if not, get it chipped and keep it. But despite all the good things you are doing, you are showing your kids that stealing is right. The dog is a thing you stole, just fyi, even if it's starving to death, you stole it from them.", "NTA!! Considering the condition of the puppy, it's pretty unlikely the neighbors care about him. If you send him back to them, he'll probably continue to be starved and abused. If you keep him, he'll have a good life and be well cared for. ❤️\n\nLegal disclaimer: I do not endorse or encourage any criminal activity. I am simply stating an opinion.", "NTA. No excuses for animal neglect/abuse.Starvation is awful.", "ESH. How do you expect to get away with taking their dog? It’s not like you can hide it away. They are going to notice. Also, overfeeding an animal can significantly damage the animal’s health. 6 cups of dog food is way too much for a puppy.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA for stealing my neighbor’s puppy?\n\nI (37F) live in a small city. Two nights ago, a puppy showed up in my front yard. He was VERY skinny. I could see every rib and his hip bones were were sticking out. (I feel like emaciated is the word I’d use to describe him.) I gave him some dog food, which he scarfed down in 30 seconds flat. In all, I gave him about 6 cups of food, and he drank a gallon of water. He was a little skittish, but very friendly. He was also covered in fleas, with a small sore on his side where he has been scratching himself. \n\nI have a spoiled rotten Corgi. Not knowing this new puppy, I left him in the back yard with food and water for the night. In the morning, he had escaped and was nowhere to be found. \n\nToday, the puppy showed up again. I fed and watered him again. This time, I also introduced him to my Corgi. They became besties almost immediately. The puppy has been at my house all day and I put him inside while I was gone. It is about 107 degrees outside and I didn’t want to leave him out in the heat. My fiancé and I decided we would give him a home since he has shown up hungry twice now. \n\nWhen my kids got home from school, my older son said the puppy looked familiar. He then told us he has seen it at the neighbor’s house 2 doors down when he walks home from school. He goes to school with the girl who lives there. \n\nI haven’t ever had any contact with this neighbor, but I do hear them screaming at one another at 3:00 a.m. a few nights a week. I have also picked the girl up and driven her to school when she was walking to school in the rain. I’m not saying these neighbors are bad people, but the puppy is definitely skinny and seems pretty neglected.\n\nMy son offered to message the girl he goes to school with to tell her their puppy is here. I told him not to because we are going to keep the pup. I feel a little bad because I know I would be devastated if someone found my Corgi-Boy and didn’t give him back. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "For the love of god, why do people get pets they don't want to love and care for.  It breaks my heart.", "NTA", "NTA this isn't theft it's a rescue. That  is a living creature! Good luck!", "NTA. Take pictures of the pup to document his condition. If the neighbors find out and confront you, you'll have evidence of animal abuse. Potentially filing charges on them.", "Nta give him canned pumkin with his food its a weight gainer", "NTA but idk if this is teaching your children it is ok to steal or something", "NTA at all but I recommend you take it and get it chipped immediately. Fuck your neighbors and if you see them get another dog I’d call the police and if the cops do end up coming to your place I’d make sure you have documented the condition you found the stray animal in. I would look into getting a vet appointment immediately because feeding a starving animal too much can rupture their stomach and while you more than likely didn’t do it I would recommend having a professional help you get the puppy on a diet.", "NTA. You found and rescued a stray dog. He was neglected and malnourished. Take the puppy to the vet, have him examined and evaluated (how malnourished is he?), ensure that he isn't chipped.... and have him chipped yourself if he isn't.", "It’s not you puppy, it’s theirs. If you have a problem with the way they take care of their animals, call some animal protection agency or something and get that dog out of their possession", "I'm not voting. I'm going to tell a story.\n\nI was helping a friend work on his house, and a dalmatian from across the street came over and was barking at us. My friend said to ignore her, she was harmless, and told me a few things about how the owners and their kids neglected the dog. I watched the kids come out and play, and the dog wanted to join in but they just pushed her away and yelled \"Get down!\" and \"Stop!\" After a while they went inside and left the dog sitting and staring at the door.\n\nMy friend went inside to change, and while I sat and waited the dog came over to me. She was very skittish at first, but I just sat and let her come to me. I pet her, and she reacted as if she'd never felt a kind hand before. It was so weird, I've never seen a dog act like that. When my friend came out so we could go get dinner, the dog chased after us. She wasn't around when I dropped him back off, but I very seriously considered coming back to take the dog because I knew she wasn't getting any love or attention that she needed.\n\nAbout a week later my friend told me the dog died of parvo. Should I have taken her?", "YTA. You know you are. There's a right and wrong way to go about these things.", "Explain to your son why you're keeping the puppy. Make sure he understands that he could endanger the puppy's life if he tells the other family about him.\n\nNTA", "NTA but do not give the puppy so much food and water! Look into refeeding syndrome", "NTA for rescuing a loose dog without a chip and collar. \n\nYTA for stealing your neighbors property. \n\nOP get your story straight and stick with it.", "I second this, vet visit is a must", "Nice.  Well changed.", "6 cups is too much for an *average* puppy. This dog is starving, and you don't know how big he is", "If the dog is alive and there is no video of the dog getting beaten they wont do anything", "They won't do shit most of the time. This is a problem, a dog is often considered property above its well-being.", "That is seriously heart breaking! That poor baby.", "As a dalmatian owner, my heart is broken. These dogs are stuck like glue to their people. I cannot imagine the feeling a velcro dog feels when they’re deprived of that contact. I’m sorry you didn’t get to keep her, they really are amazing dogs.", "The right way rarely works.", "What the fuck is the right way here? Reward the animal abusers by returning the puppy (and likely sending it back to die starving and unloved.) What a stupid fucking opinion.", "Too much food for a starving person or dog will lead to vomiting. Dog had fleas so is probably anemic and that's more of a concern.", "I know, my sister had one. Hers and my friend's neighbor's were both of such sweet temperament. The dog was so happy when the kids were out playing, even though they wouldn't play with her. And parvo is so easily prevented.", "If OP is doing it this way then she can explain to her kids that she didn’t just simply steal the dog. \n\nI agree that the dog has to be rescued from that family OP, it’s just how you go on about this, because you are also setting an example for your kids.", ">Should I have taken her?\n\nNo, you don't steal someone else's property. You saw this dog for a few hours on one day and know nothing about it.", ">These dogs are stuck like glue to their people.\n\nCome on, this is the vast majority of dogs.", "YTA. I'm sensing there is a socioeconomic class difference between OP and this other family, and OP is potentially putting an animal before humans. It all comes down to the little girl from the puppy's house. This could be one of her only joys in life and YWBTA if you don't go to the neighbors and try to return it at least one time.", "NTA.  But got through the motions of having the puppy's condition documented by your vet and ask if you should get animal control involved as well (more to cover your ass if your neighbor decides to try and go after you for \"stealing\" their puppy, animal control will side with you and not them if they know what is going on in advance).\n\nOr take the advice u/TripleAWingingIt but let the shelter know you'd like to keep the puppy and foster it during the waiting period.  The amount of time you've had the puppy may count towards the \"hold\" time at the shelter.", "Take the puppy to the shelter as a lost dog.  Wait the number of days they require for the dog to be put up for adoption.  Adopt the puppy and make sure it has a microchip, vaccinations and flea preventative (as well as treatment for the scratched spot).  This gives you legal documentation of adoption, vaccination and a microchip.", "This. It could be the puppy escaped, like it did from OP’s yard, and the family has been looking for it. OP is trying to justify not doing the right thing but having a couple of early morning arguments does not make the neighbors bad people or bad pet owners. A kid walking to school in the rain does not make her parents neglectful. Maybe she wanted to walk in the rain. \nAnd yes, feeding a puppy 6 cups of food all at once is not good for it.", "You don’t know the pup was abused. Maybe it escaped from the neighbors, despite their best efforts, and they’ve been looking for. There is not enough evidence here to accuse them of abuse.", "Lmao don’t play the poverty card to excuse animal abuse. I grew up poor as fuck and never in my dreams could I imagine treating an animal this way. There are DOZENS of houseless people who would rather starve than allow any sort of maltreatment to their animals. Acting like poor people are lazy and shitty animal caretakers and that them being lazy and shitty is okay because “it’s their only joy in life” is ridiculous.", "Yeah, no. Dogs are living creatures and do not exist solely to comfort sad children. Her family is well on their way to killing the poor thing already, OP did the ONLY thing which is to save it from those monsters", "That \"property\" has a life. Stealing wouldve gotten them in trouble but there must be some other way to rescue such abused animals", "There is not enough info to say the pup was abused.", "OP said the poor puppy was “emaciated” and had fleas that lead to a sore from excessive scratching. Neglect=abuse and I honestly don’t know why people ever separate the two. If you found a human child in that condition are you gonna sit here and say “oh but we don’t know for sure it was abuse.”", "I will not equate an animal to a human. That’s your first mistake. It is possible the neighbors are bad pet owners. It is also possible they did their best but puppy escaped and just now found it’s way back to the area. Either way, OP has an ethical responsibility to find out more rather than assume the worst.", "Lmaooo “that’s your first mistake.” Fuck off", "Nta but be mindful of how this could go and take him to the vet if you havent already.", "DOCUMENT the state of the pup, so you have proof.\n\n&#x200B;\n\nNTA", "This is going to go badly even if you're NTA. Do you think the neighbors just won't notice the dog for years? Honestly I'd give the dog to someone else so you know it's safe but it won't come to bite you in the butt personally.", "OP needs to have a talk with the owners of this dog. Most likely they will be indifferent and give up the dog. \n\nOr even if they are not willing to give up the dog, some reasoning, persuasion and maybe monetary incentive should easily make them let go.\n\nThat's how I got my dog. \nFound a trembling, unfed 3 month old puppy tied to a bush. People in the vicinity said that he was tied there for 2 days Kept him for a few days, and eventually ran into the owners by chance. Without without me even saying anything, they told me that I can keep the dog if I want.\n\nOf course in my case the puppy was probably abandoned, but I'm sure OPs neighbours don't care for their dog much either.", "op needs to speak (respectfully) to the owners of the dog and get this sorted. Communication is the most important thing.", "I love to walk in the rain. Sure, it may look suspicious, but judging should be done after asking.", "6 cups of food for an emaciated puppy is awful. Look up refeeding syndrome - This puppy should not have been fed that much, if he's skinny enough to be called emaciated", "Yes exactly. It’s absolutely possible the neighbors are bad dog owners and bad parents, but there is f enough info in the OP to say either one for sure."]}