{"id": 25535, "submission_id": "161t2n1", "title": "AITA for telling my kid's teacher not to acknowledge a life event because she's not important?", "selftext": "I've been fostering my 7 year old Xander since he was 3 and now I'm officially adopting him next week when we go to family court next Friday. \n\nHe'll have to miss half the day so I told his teacher on Wednesday. His teacher Mrs. M got a bit emotional and said what a nice guy I was to adopt a child. It rubbed me the wrong way. I am adopting him because I love him and not for clout or praise. I was telling her because he just started 2nd grade three weeks ago and I wanted her to know that he has to miss class.\n\nMy son is mostly nonchalant about it. He knows he belongs to me and our court date isn't going to change our daily life. Yesterday Mrs. M came to me and said she'd love to have a little class celebration for Xander before we go to court. I said no. She wasn't expecting that. Then she said she'd like to come to the adoption proceedings to show her support for Xander and let him know that he is loved and supported by her and bring him a gift.\n\nI told her thanks but no thanks and that she was making this adoption proceeding about her, her and her. I give the benefit of the doubt that she means well but to be blunt, she's not important to our family. Therefore this whole thing is none of her business. I don't know anything about her and she knows very little about us. Plus my son is NOT the kind of kid who would get excited at seeing his teacher outside of school hahaha. I could tell she was hurt.\n\nI get it. My son is the cutest kid in her class and all of his teachers liked him. It would make Mrs M feel good to do these things when I'm trying to keep things as normal as possible.", "created_utc": 1693050459, "permalink": "/r/AmItheAsshole/comments/161t2n1/aita_for_telling_my_kids_teacher_not_to/", "score": 2199, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My son's teacher asked if she could celebrate my son's adoption with a class party and/or attend the adoption court date. I barely know this person and she's not family so I said no and don't make it about you feeling good because it's not about you.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Info — have you asked your son if he would like to do anything to celebrate? Seems to me like that’s the most important piece of this puzzle.\n\nIt’s not offensive that your son’s teacher wanted to share in celebrating your son’s life event. (Kids routinely celebrate bdays with their class & teacher) A polite “no thank you” is fine. Your son can never have too many people in his life who care about & support him.\n\nEdit judgment—NAH", "As a teacher she's probably seen dozens and dozens of foster children that are never loved or cared for. It probably breaks her heart.\n\nSo she's *very* excited to see Xander in such a loving household where he's being adopted into the family. She's excited and wants to be a part of it.\n\nBut I get that you guys don't want it to be a big event.\n\nThis is a rare \"nobody at all is the asshole here\".", "\"It's very thoughtful that you want to acknowledge my child's life event, but it's actually a bad message. You don't realize this because you just met him a few weeks ago, but we've been father and son for quite a while now. Going to court to legally formalize it is a hassle, not a special moment: highlighting it with extra attention will only serve to emphasize that strangers think we weren't really a family before. The last thing I would want is for you to spoil your relationship with him by making this a bigger deal than *he* wants it to be.\"\n\nNTA, but I would encourage you to come up with better talking points. Her impulses seemed like someone who wanted to celebrate your son, which is why she kept trying. If so, she might *still* try to do something like organize a class \"adoption card\" or otherwise encouraging the class to do something to acknowledge your son's adoption (if she can convince herself that she made it \"not about her\")\n\nI would also keep an eye on the situation... It's early enough in the school year that you could have your son switch to another teacher if this one can't keep to appropriate boundaries.", "NTA. I'm a teacher. If I was privileged to know this info, I would certainly acknowledge it with a congratulations email, but that's it. Boundaries are good things.", "Esh. Did you actually say that she was making it about herself? That was probably uncalled for and unnecessary. I get you want to keep it low key, and you didn't like her making a fuss. But her intentions were not bad. I think you should have asked your child if they wanted a party before unilaterally turning it down. People don't always handle adoption in the most tactful way but you have to look at someone's intention or you are going to be spending years getting angry at people. \n\n\n Maybe they want to celebrate with their friends. I'm a former adoption worker with children from foster care and it's extremely common for people to celebrate afterwards and to mark the occasion every year with a celebration. As a teacher she's probably been to adoptions like this before. It wasn't uncommon for teachers, friends, and a bunch of other people in the child's life showing up for the hearing. Her asking was not inappropriate from my experience. Teacher's are encouraged to do stuff like that. She sounds like a good teacher. If you didn't want anyone but family you needed to come up with a more tactful reply. Saying you are just trying to keep it to immediate family but you appreciate her offering to be there.", "NTA\n\nThis is not appropriate for a school setting, IMO.\n\nWhat about other children who may be fostered who are in the classroom?  \n\nIt just rubs me wrong that the class would celebrate this.  It is a family thing.", "NTA\n\nHer insistence sounds like she's trying to virtue signal, honestly. She's put it in her head that Xander needs support when there's no reason to even think that, like wtf?", "NTA. As a teacher I would have said “congratulations, that’s great news” and that’s about it.", "NTA she should’ve read the room on your first response. Her hurt feelings are her own deal.", "Apparently, AITA is coming for the teachers today.\n\nTelling her not to acknowledge it is fine: It's a well-intentioned gesture on her part, but not what you want.\n\nTelling her she's not important is seriously misguided: he's 7. You do your son a massive disservice by insulting his teacher. He spends all day with her 5 days a week. Teachers are massively important in kids' lives. She's still getting to know him, and you, because it's the beginning of the year. Give her a break. YTA.", "NTA. Its a private family event. Also, I agree that your kid should be made to feel that he’s always been your kid and this is just a little technicality in your life - no need to make a big deal about it.", "ESH She needs to respect the boundaries you set, but there's no reason to accuse her of an ulterior motive. \n\nShe's a second grade teacher, she is probably just a halpy person and wants to use opportunities to have her students practice inclusiveness and diversity. Maybe she has some personal experience with the foster system and knows how important a strong support system is. \n\nYou can give a firm no without judgements and accusations.", "I am caught her not sure if your an AH or not.\n\nTo be fair the teacher was trying to do something nice for you and Xander.", "YTA. You assign her such nefarious intentions.. NTA for saying no, but your defenitely the AH for how you spoke to her and how you speak about her here. She wasn't making it about her, she just thought it was a happy occasion and wanted to celebrate it for him.\n\nInstead of being happy your teacher care above and beyond for their students, you treat her so horribly.\n\nAlso I think you make a lot of decision for your son and make a lot of assumptions about him. You should have told her you would ask him and give her his answer. You say he's nonchalant - but for a kid to go to court can feel very exciting and special, even if he doesn't show it. Also people can be nonchalant about important mile stones, and still want to celebrate it, because it's fun.\n\n'and our court date isn't going to change our daily life.' - and birthday is going to change his life? Still teachers celebrate their student's birthdays. All celebrations teacher do for kids are about tiny things that happen to tiny kids. That's what they do. It's not about the thing, it's about the kid.\n\nMaybe the teacher thought you don't want to celebrate with the kids, because you don't necessarily need to publish it to everyone, so she suggested a smaller celebration just with a gift from the teacher, since she's already in the loop. And then you came out at her.\n\nSo for me YTA,", "You both seem pretty insufferable tbh - ESH", "NTA\n\n This isn't about her at all.", "NTA, but you could have phrased it better. It’s not that your teacher isn’t important to your child (she likely is), it’s that you don’t want to make the adoption into a big deal for your child.", "NTA: she sounds like the sort of person who would brag that some of her best friends are black.", "NTA (but kinda are at the same time). I myself am highly family-centric and if you are not part of my family then you can F-off but there is simply no such thing as too much positive support of a child, especially one in a situation like foster care. It would be/have been better to let the child decide if HE wanted the party or for his teacher to be that involved.", "Wow, your cold", "NTA - It’s a family matter and he is your child -. She wants to be involved, but it is over stepping a boundary for you. I do think it was nice of the teacher. You kindly declined, she will get over it.", "NTA. Your son needs to process this with just the few of you who really matter. We had an adoption ceremony in our family recently. The adoptive father and his parents had loved my 5 yo g'son from his infancy, and we all considered each other family, but the proceedings were especially important to them—this would be their only grandchild and they were thrilled that it would be legal.  At the judges behest, the new g'parents spoke briefly —husband and I were asked to speak also but we are keeners who will weep like banshees at the drop of a hat, so I waived that off—nonetheless, all the adults, including the lawyer and judge, cried. G'son himself just walked around the courtroom with a box of tissues he picked up from the judge's desk saying, \"why is everyone's eyes red?\" That little ceremony was enough—he did not need a big deal being made by anyone outside of our little family.", "NTA - I don’t fault her for asking, but it is a private family event and she should have left it at that.", "NTA, she was trying to butt in on a family thing.", " NTA - in fact I would go to the principal and suggest adoption education training for the teachers. She’s practicing saviorism. And that sucks.", "ESH, you could’ve said no without telling her that she isn’t important.", "YTA for how you said it and your general attitude towards his teacher. You could have more politely declined as she clearly is passionate about teaching and well-meaning. Your response was unnecessarily cruel.", "YTA.", "People worried about being humble because they are worried about being judged is going to be a problem in the future. IMO, the worst is when you're a middle-aged to boomer aged person talking about people celebrating their achievements as if those people didn't deserve to celebrate them because they were being too loud and proud about it. \n\nIf the adoption is transactional to you, it's okay to not celebrate and make it a big deal, but I say YTA because of how you turned down the teacher. She may just be a very kind person wanting to celebrate a big day for one of her beloved kids. I hope you don't raise Xander to be mean like that.  You could have said that you didn't want to make it a big deal so that Xander didn't think he was any different from his classmates, but in actuality you made it about you not wanting clout or whatever. That word of the year is so overused, like snowflake, humble brag, etc....", "NAH. Teacher is a bit extra, but as long as she respects your answer (and she did ask before throwing him a party at school), she didn’t actually do anything wrong. Just a bit socially awkward.  \nCongrats on making what already is legally official", "It's a rare occurrence when no one is TA.", "Is it a requirement to give the reason for absence? I don’t tell my daughters school, I put “day off” as the reason - none of their business!", "NTA - Though, may be worth asking your son how he feels!", "NTA - she overstepped, but you definitely could've phrased your refusal nicer. She wasn't trying to be mean or anything, and I think you could've just explained that this was a family-only event, and that Xander really didn't want to make a big thing of it.", "All of this could have been avoided if you would have simply stated that your child would not be in class...full stop. He is your child, you don't need to give a reason. NTA", "As a parent who adopted three kids, I hear you! Being treated as if adoption is heroic is gross and oblivious. Good for you for shutting that down. NTA", "NTA - I understand the teacher's fascination because fostering and adoption are relatively uncommon. The request to do a class celebration was reasonable; it's also nice to see that she asked for permission rather than just doing it. If everything stopped there, I would have had a totally different opinion.\n\nAsking to come to court was weird. I understand the interest since so few people in the population would see that kind of event, but asking if she could come to the proceeding feels like asking if she could be in the delivery room for a baby being born; everyone would agree that is creepy as hell. \n\nWhile your response may have been harsh, what your family wants is reasonable which is to treat the adoption as a legal formalization of something already true, Xander is part of your family.", "Is there a \"no one is the anus here\" option?\n\nThe teacher just didn't expect you to say that. No one is in the wrong here.", "NTA.\nAs as an educator and an ex LAC, this teacher has stepped into strange territory and is overstepping. It's entirely normal to feel excited about a child being adopted, it's perhaps normal -if you had an extensively close relationship with the child AND parent- to get a card and a commemorative gift, but I absolutely agree with you, she's doing everything possible to make it about her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI've been fostering my 7 year old Xander since he was 3 and now I'm officially adopting him next week when we go to family court next Friday. \n\nHe'll have to miss half the day so I told his teacher on Wednesday. His teacher Mrs. M got a bit emotional and said what a nice guy I was to adopt a child. It rubbed me the wrong way. I am adopting him because I love him and not for clout or praise. I was telling her because he just started 2nd grade three weeks ago and I wanted her to know that he has to miss class.\n\nMy son is mostly nonchalant about it. He knows he belongs to me and our court date isn't going to change our daily life. Yesterday Mrs. M came to me and said she'd love to have a little class celebration for Xander before we go to court. I said no. She wasn't expecting that. Then she said she'd like to come to the adoption proceedings to show her support for Xander and let him know that he is loved and supported by her and bring him a gift.\n\nI told her thanks but no thanks and that she was making this adoption proceeding about her, her and her. I give the benefit of the doubt that she means well but to be blunt, she's not important to our family. Therefore this whole thing is none of her business. I don't know anything about her and she knows very little about us. Plus my son is NOT the kind of kid who would get excited at seeing his teacher outside of school hahaha. I could tell she was hurt.\n\nI get it. My son is the cutest kid in her class and all of his teachers liked him. It would make Mrs M feel good to do these things when I'm trying to keep things as normal as possible.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NAH She may only understand foster adoption from media portrayals or she may have had different experiences that would suggest to her that your child may not have been celebrated or be celebrated after the difficulties between placement and establishing permanency.  And let’s be real - for most, there’s so much stuff.  \n\nThe so much could lead you to just being done, ready for the formality.  It could lead others to extraordinary relief.  For others it’s ambivalence because the termination of prior family relationships is really really real  (though TPR happened in another hearing without you).  That’s hard on kids depending on age, understanding and circumstances. It’s much easier to know that from the inside. \n\n‘Thank you but we’re keeping it low key.’  And repeat.  And you can think whatever about people wanting reflected glory or misunderstandings of adoption.  You can’t correct those.  Having not done that, I would be a little contrite in my interactions with her in the future.  Warm relationships (with good boundaries of course) count in primary years. \n\nEnjoy your day and keep enjoying your son.", "I don’t think the teacher is an asshole for asking and you weren’t giving her the benefit of the doubt in your post even though you say you did. She asked for 2 different ways to support your kid and you said no and that’s absolutely fine to want to make this a more intimate thing with close family. But if you responded  in an asshole way or trying to make it sound like the teacher had weird intentions you need to simmer down.", "NAH Going forward, keep the reason to yourself.  Of course she has an emotional reaction.\n\nYou didn't need to tell her anything at all.", "You can just say “thank you, but we would prefer to keep the celebration private and within the family”. \n\nTo say she’s not important is a bit harsh", "NTA\n\nBut you *are* being a bit of a jerk about it. Saying no is not a problem. Telling someone they aren't important is being a jerk.", "Just wow. I’ve seen too many kids in crappy life situations, and too few foster kids be adopted into loving supportive families. Anytime a child is officially adopted at my school, the teacher goes to show support for the child and family during this family milestone. We as teachers spend so much time with your kids, and form connections to them that don’t just turn off when school is out. I have students who I still keep up with their achievements now that they’re in middle and high school because I love them and am proud of them. She was trying to be supportive, you could have politely declined and said you were keeping the adoption low key and with only close family and friends there to celebrate. This would have acknowledged her care and happiness for your family, and allowed you to have your privacy. You come off as rude in the post. YTA", "YTA just because you sound like a rude, presumptuous person. You literally made yourself sound like an asshole. You're not an asshole for having boundaries but man some social grace would be nice.", "Yta. They’re just excited for you that you’re officially family now. It’s like a wedding. Of course your day to day doesn’t change but it’s still big. Celebrate a little! Make this a thing! Why not?!", "NTA. I have many students who do not celebrate birthdays and I don’t push it.  It’s just part of their culture.  I ask the child if they are celebrating at home, and if they want us to sing happy birthday.   It’s been 50-50 for singing.  If they say yes we sing , if not, normal circle time at dismissal.  (I teach 4th grade). I would ask your child if he wants to mark to occasion.  It’s your and his call.", "NTA. I understand her enthusiasm and think it comes from a good place.\n\nBut inviting herself to court was way over the top and out of line, in my opinion. \n\nThat would have made me uncomfortable.", "NTA, but you’re going to have to practice some more neutral responses to these kinds of comments, because they’re not going away. I have two kids, adopted via foster care 12 years ago. I can’t begin to count the number of teachers who have said how lucky my kids are to have me, or what a good thing I’ve done. I hate it. It’s creepy, and it’s thoughtless. My kids are absolutely not lucky, because something horrible happened to put them in this situation. But you’re going to want to find a polite way to dismiss the comments, because you want teachers on your kid’s side. I say something like, “Oh, we’re pretty lucky to have little Johnny,” or “Oh no, we just wanted a family.” But again, absolutely NTA for not wanting a celebration that your kid doesn’t want.", "YTA for your shitty attitude and not just saying he had an appointment.", "You've really overdone your single dad gets unnecessarily rude and aggressive to his child's school teacher for the last few years, OP, but I give you credit for mixing it up with an adoption story.", "The last paragraph is so fucked up and rude I would definitely talk about your weird hostility towards her in therapy but it’s fine that you don’t want her in court.", "We are celebrating by going bowling after court.", "Yea, I mean, I think it's disappointing OP thinks the teacher has nefarious intentions and instead of helping the kid's community celebrate with him he's pushing them away.", "Teacher has seen these social media posts of entire elementary school classes showing up for a classmate's adoption ceremony and sees this as a goal.", "If this is genuinely what you believe (and I don't think you're wrong), then why NTA and not NAH (No Assholes Here). NTA would indicate that the teacher is a asshole, which you've literally just said you don't think she is  . . .", "Nope.\n\nTeachers have to have emotional maturity. \n\nMaking someone else’s adoption about yourself and overstepping even after the first boundaries were drawn is not emotionally mature.\n\nNTA\n\nI bet dollars to doughnuts she is hitting on you (OP) because she approves of the show of morals that you’re currently displaying. Which would make the whole thing worse too.\n\nFrom one adoptive parent to another - congratulations and many happy returns.", "Teachers are also encouraged to be sensitive doing family trees or timelines of students lives because what adults might find fine could be a trauma to the kid.\n\nThis was a one email. “Lovely to hear, anything we can do to support X name as a class or would you/they prefer that we treat it as any other day?”\n\nAnd that’s it. \n\nNice to know as a teacher that the child’s legal status will change but constantly being reminded that **you are different from the rest of your family and we will keep reminding you of that every year and digging up old hurts** can be wounding to some adoptees.\n\nNot all adoptees are thrilled about the situation. Some adoptees are happy but would rather gloss it over. Some want celebrations.\n\nThat this parent is thinking about what *his son* wants is a *good thing*.\n\nTeacher stomping all over it because *they know what’s best* is not good at all.", "I might add « is there anything we can do to support your family from the school side ? »\n\nBut yeah.", "Um, there are 20 other kids in her class and they're not even in her classroom half the day. She probably hasn't had more than a couple of hours interacting with him on a 1:1 level.", "Found some offended butt hurt teacher \n\nThe teacher isnt important shes 100% virtue singling", "It's still none of her business.", "Yeah the attitude is pushing me to then being an AH. Quite agro.", "I can’t believe he’s only giving the kid a half day off  school for the adoption! \n\nI understand that to them it may seem they’re already family, but still. It is a big thing and there’s nothing wrong with acknowledging and celebrating (however low key or over the top).", "Your comment reminded me of a post from a while ago, where a woman was racist against her stepkids, but argued that she can't be racist because she married a black guy with \"black gums\"....", "Yup! She wants to go for the clout so she can tell the story later. \n\nPure self interest and ego, nothing about actually supporting the family", "The last thing my fostered adopted kids would want is for anyone in their class to think of them as different. They don’t want it hi-lighted.", "But it's not his teacher's business", "It's called \"NAH\" here and it's not that rare.\n\nBut I disagree, the teacher inserts herself in a situation she has no place in. She's not a member of the family.", "No, but it looks bad to have your kid miss school when they just started. I wanted her to know I'm not one of those parents whose kids have a bad attendance record. This is a court date and we legally have to physically be there", "That’s great!\n\nThe one piece missing in this post is what your son has told his teacher/classmates. He may have shared his excitement with them & she is trying to recognize & be supportive of that. Or she’s just an overly emotional person ... who knows.\n\nWish you both the best!", "This isn't a school community event. This is a family event.", "I have worked with students that were in the foster system.  This is a family event.  Having a party in class singles out the child when he was just a student in the class.  He needs to remain their friend and classmate and not have a new label added.  It could also leave him open to being bullied.  The kids I worked with had experienced some pretty heavy trauma at their young age and didn’t need an additional reminder of what had happened.\n\nThe kids go home and tell their parents, there are going to be some parents who get judgmental.", "Maybe!\n\nI honestly can’t tell if teacher was just offering a normal kind gesture that most caring people would make “how can I help” or if it’s truly an overstep of boundaries. Obviously, OP is uncomfortable with her offer. He’s the parents so it’s he has the final say. \n\nOP’s words & reaction just makes me feel like there’s a puzzle piece missing. But there usually are missing details in these posts. Perhaps I have just never experienced a “nonchalant” 7 yo. In my experience, 2nd graders are usually pretty clear about their emotions. If the kid was 15 I would understand that!", "You’re right!", "Mate teachers are human as well. In teaching you see awful things that happen to kids because of their parents. She’s just excited and happy and cares. It doesn’t mean she’s hitting on OP ffs.", "She wasn't stomping on anything. Maybe she was pushy she simply asked and respected the answer even if she was disappointed. I get what you are saying but nowhere in this did anyone ask the child what they wanted. You seem to be getting angry on their behalf for no reason.  Give the teacher the benefit of the doubt and stop assuming terrible things about her for your own agenda. They are human too and stop expecting them to be perfect in every situation. This was probably not the only family situation she dealt with that day. She absolutely was a little clumsy but please extend some grace. If they don't want to celebrate, fine but it is common and it was absolutely fine of her to ask.", "And one of her. She runs that room. Only 20 other kids? \n\nI'm not disagreeing with turning down her offer to do a celebration - there are all sorts of reasons that can be not the thing - but don't insult her on top of that.", "That’s not the issue. The issue is your asshole response. She asked about how to be supportive, and you should say, “no thanks it’s not needed.” But instead you automatically think she’s got some weird main character intentions for trying to be nice. Ask yourself why you’re so sensitive and have to go overboard about your response instead of just a polite “no” to the two requests to support?", "To my adoptive kids it was only a reminder of the traumas they’ve suffered. They’d rather no one mention their adoption most of the time. Kids don’t want to be different.", "True - though it’s a long process with so many prior court dates.  It’s possible that not missing school the morning before *is* exciting.  We’re not second graders at the start of a new school year, whose lives have included family court, guardian ad litem visits, court appointed attorney visits, social workers, interactionals (psychological assessments of family dynamic) … not being interrupted anymore is a huge step in this child’s life.", "It's in the afternoon so what's the point in having him home when he could get a few hours of instruction time?", "I don’t know why you’re being downvoted", "How do you differentiate between not the asshole (NTA) and no one is the asshole (NTA)?", "Fair enough. You’re NTA in this situation - it’s kinda weird that she asked & pushed it? Good on you for being honest.", "Yes, family-related or personal things never are celebrated with community. That's why kids never experience things like bar mitzvahs or birthdays with anyone ever other than family. \n\nWink, wink.", "I would have phrased it as “this is a family only event”.", "So I think that’s the problem. People that aren’t educated about adoption like to treat adoptive parents as saviors and that act of adoption as events. \n\nI’m guessing she’s seen Facebook posts of a kid being adopted with their entire class being in court with them. \n\nNTA. I don’t think she’s trying to make it about her. I think she’s ignorantly making your son a commodity because that’s how the media treats adoption. Maybe direct her to some adoption education resources so she can better understand how to interact with your son. I’d be concerned about what she says to him in the classroom.", "It’s totally normal for teachers to celebrate life events with children and their families. If you’d like to keep it private, that’s your right but the teacher wasn’t trying to steal attention and frankly I think it’s odd that you’d accuse them of this. They are trying to support your child. You should feel lucky that your child has an involved and supportive teacher. You didn’t need to be a jerk about it - you could have politely said that you’d like to keep it private and would not like a class celebration", "I read this as it’s more about you & your vision of how you would prefer to keep this event low key. Totally fine as long as your son has the same vision. He’s 7 .... \n\nMany 7 year olds like to be the center of attention & celebrate with their friends. Not the worst thing in the world for people to want to make your son feel special & loved on a special day.\n\nEdit", "Who hurt YOU", "Sure, but if your son came up to you and he said he wanted to have a party or cele rate it with his friends in some way, would you turn him down?", "YTA - dodging the question means you haven’t asked your son, the only person whose opinion matters.\n\nShe’s “not important to your family” but they spend most of their waking hours in the same room, assuming she’s his only teacher.", "That's fine - there's zero reason to infer there's bad intentions like OP was, though.", "Maybe the kid doesn't have big emotions about it. Like OP said, nothing is changing in his life, he'll still be living with the same person / people he's lived with for most if not all of his memories. Even if he's told it means he gets a permanent parent, he probably never really thought about legalities of foster kids and court ordered custody. He lives with OP, he'll still live with OP, court and adoption papers are adult stuff that he probably doesn't care about besides being told OP will always be dad now but might not have before according to reasons he doesn't fully understand.", "100% agreed with this. People calling the teacher an AH are ridiculous and seriously lack empathy.", "Teacher asked *to go to court* and *bring a gift*.\n\nUnless you’re being asked to testify, especially if a parent says no to the class party, the next statement shouldn’t be “but I want to go to court with you!”", "NTA - Not The Ah\n\nNAH - No Ah Here\n\nESH - Everyone Sucks Here\n\nYTA - You’re The Ah", "I have an adopted 7 year old. He hates it when people mention that he must be. He would hate his class celebrating something that is personally traumatizing to himself.", "Not all 7 year olds", "Every kid in class has a birthday, not every kid in class is adopted.\n\nI don't doubt the teacher has good intentions, but ultimately the kid could feel singled out by making the adoption a big deal and I think the parent is the one best able to judge the situation.\n\nKids want to be celebrated, sure, but they also really want to fit in at that age. He can still get the birthday shenanigans like everyone else.", "I don't think the teacher did a great job handing it and I've said that. But OP could have been more tactful especially since that she will likely be his teacher for the next 9 months and now things are akward. Reddit is big on these unapologetic stances but forgetting people have to find a way to interact with others who are also fallible with feelings off their own. And to play devil's advocate the teacher may have said that because she wanted to ensure the parent she wasn't coming because she felt her job dictated she be there. She over stepped surd but it wasn't malicious. I'm done responding to you I've said my peace.", "Thanx", "Parents always have the final say. There’s nothing in this post about how the 7 yo feels about this day.\n\nHonestly the thing that kind of makes me think OP has not really thought about his kid’s experience.... “he knows he belongs to me” .... that just rubs me the wrong way.", "And I have seen a few videos where the adoption is made into a celebration, even with all the classmates being in the courtroom. \n\nAll kids are different. Of course I am hoping OP knows his kid more than the teacher who has had him in her class for a couple of weeks.", "This would have been a nightmare for me.", "We only OP’s vision for the day ... to keep it private. It’s hard to know what exactly this teacher’s goal is without knowing what the 7 yo is reporting.\n\nHaving spent many years in first/second grade classrooms. Kids tend to get pretty excited about big events in their life (new babies, bday, grandma & grandpa visits) & they often don’t stop talking about it! No one knows how the 7 yo feels about this day. Hopefully, he’s not disappointed by the lack of acknowledgement.\n\nAs a mom of 4 (now adults) it’s always the parents decision of what is in the best interest of their kids. Personally, I have never been offended by anyone wanting to celebrate & support my kids. If my kids don’t want to celebrate, that’s totally fine. I certainly would not have responded in the same way OP did though. That was an overreaction imo.", "As someone who was a kid once and had an unusual family situation compared to everyone else, I *hated* the attention that brought me. OP mentioned kid's nonchalant about the adoption, I understood that to mean he already felt like this was his family before the adoption happened.\n\nI do feel OP could have been a bit more tactful, but honestly, I kinda get that he wanted to shut this down for good after already having made clear he doesn't want the school involved. For a teacher to try to invite themselves to adoption proceedings is overstepping even if it's coming from a good place.", "Well OP certainly knows his child better than anyone here.\n\nI just don’t see this as an egregious attempt to do any harm. Think the teacher reacted like most caring people would “what can I do to show support for your family”. A simple & polite “thank you for your kind offer however we are keeping this very low key & private” would have been fine.\n\nI do think it’s strange that teacher would offer to attend court just because the kid “is cutest in the class”. That makes zero sense. I suspect there’s a different reason.", "I would suspect she’s trying to recreate Facebook posts she’s seen.", "That part. It's 100% OK for this to be a a family event and not wanting something more public, assuming there's any ill will or intentions, though, seems a bit much.", "I'd believe it; teacher may think it's a \"think\" to do.", "I have said this before.. why would anyone want to be a teacher. You have to deal with the parents, the kids, administration that has no balls, and now politicians, for the amount of money they make..F that.", "You’re not the A for wanting it to be private, but YTA for how rude you were to her and how unappreciative you are. Good lord, your comments are cold and ungrateful. I don’t think she had bad intentions at all. Did you think to ask your son what  he wanted? Your attitude toward all this just seems off, like you’ve got some sort of chip on your shoulder. I hope you demonstrate kindness a little more frequently in life for your son’s sake.", "What does Xander want? I’m not seeing any comments about him being asked. Being nonchalant is one thing, but you’re still sending him to school in the morning. What about breakfast or lunch before court just the 2 of you?", "YTA for your shit attitude towards the teacher. What happened to just saying a simple \"thanks but no thanks\"? Why did you need to berate her and tell her that she's not important?  Also, I'm sure your kid is very cute but saying he's the cutest in his class is wild.", "YTA. Classic case of not what you said, but how you said it. You just sound like an insufferable ass in this. Teacher might be insufferable too but you’re just fucking rude about it.", "you’re aggressive out the gate over someone’s expression of love\n\nyou say the kid will *belong* to you (weird weird word choice)\n\nyou give weird vibes op\n\nyta be nice to the teacher. ask kid what they want", "YTA, and a big one. Every nice gesture she made (even simply calling you a good guy) has resulted in you being more and more childish. She was trying to do something nice, something that you decided your son wouldn’t care about (no, he didn’t make that decision himself). Just because she’s not a family member doesn’t mean that her nice gestures are hollow and unnecessary. As someone who was adopted…you’re an AH. \n\nBonus AH points: \n- “I gave her benefit of the doubt BUT she was making it about her by wanting to celebrate my son’s event with a gift”\n\n-  “She said I was nice…that rubbed me the wrong way”\n\n- “Our court date isn’t going to change his life” you mean like celebrating a birthday or holiday would be totally life changing?\n\n- “He knows he belongs to me”, cringe.\n\n- “I get it…my son’s the cutest and everyone loves him”…JFC.", "\"he belongs to me\"\n\nAnd that's your problem right there. \n\nYTA.", "Your attitude is way off here.\n\nNo issue with saying \"We are celebrating this on our own and rather not involve other people we don't really know, but thank you for your well wishes.\" Is perfectly acceptable.\n\nBut holy shit what's with the anger, attitude and assigning malice to what amounts to someone congratulating your kid?\n\nYou come across as someone who is looking for a fight, then been as insulting as possible to get it. What's the deal here? Completely disproportionate response and it's kinda nudged you into YTA territory for simply being a dick about it.", "uhhh YTA massively. \n\nShe doesn’t have to throw a party or attend- for sure. \n\n But why not explain the actual why- Xander is and has been yours for a long time, this is a technicality, and you don’t want to put a lot of attention on it?\n\nWhy did you have to assume negative intent? Her her and her?!! I think you need to get over yourself….you’re reallllllly excited to tell people this isn’t for clout. Cool dude, but no need to be rude.", "YTA for your attitude towards the teacher, it's bad in the post and even worse in the comments. \n\nTelling someone that they are not important is very rude, even if it's true - you could have said something kinder and chose not too.\n\nEven if she really is not important to your family..... so what? How does it hurt you or your child to have her and the rest of his class tell him congratulations?", "YTA for your reaction. This is a big milestone for a foster child. Same as getting married or having a biological child. Your kid's teacher asked if she could do something special in celebration. You said 'no, thank you', and she respected that. Why are you bent out of shape about this?", "INFO What does Xander want?", ">His teacher Mrs. M got a bit emotional and said what a nice guy I was to adopt a child. It rubbed me the wrong way. I am adopting him because I love him and not for clout or praise.\n\nThis is kind of a bizarre reaction to a fairly innocuous compliment...  \n\n\n>I told her thanks but no thanks and that she was making this adoption proceeding about her, her and her.\n\nHow did you arrive at this conclusion from what she asked?  This is a real overreaction.\n\nNot trying to be a jerk but are you okay?  Honestly, the way you describe yourself here you don't seem to be in a good place mentally or emotionally.\n\nI don't think you're a bad person for declining her offer in any way - that is your decision.  But you seem to be not in a great place if I'm being honest.", "YTA. She *is* important. More important than you seem to understand. She is a huge part of his life, she spends A LOT of time with *your* child - probably more than you do, cumulatively. She is part of his support system. This was an opportunity for him to understand that he has *more* than just *you.* I'm sad for this child and his teacher.", "Yes, you are the asshole.  Yes, you are adopting the kid for all the right reasons, and she has the right to tell you how nice you are for doing it.  She wasn't giving you \"clout\" she was acknowledging that you are a good person for doing what you are doing for a kid I'm fairly certain she wants the best for.", "YTA, I'm just starting to image all the important life events for this kid you're going to sweep under the rug to keep your cool nonchalant lifestyle going. Not to mention the way you treat other people, especially teachers who spend such a huge amount of time with your kids.  Man, IDK what happened to you in your life to make you so bitter and hateful but good luck to your newly adopted child.", "YTA - People are excusing your AH behavior to the teacher because you’re doing a great thing with the adoption. Do you normally accuse people of ill or self-serving intent when they want to celebrate your son (or u for that matter)? If so, please consider therapy to investigate where this comes from. The teacher sounds very kind. You are well within your rights to not make this event a big deal. However, you should have politely thanked her for thinking of your family and stated that you don’t want to make this a big deal.", "So your son is the cutest, mh!? Sure thing. And god forbid a teacher actually cares about her student. Sounds terrible to me. Please make sure to assess your dominance next time you see her. It's very important to know that you are superior in any way, shape, or form! YTA.", "You certainly sound like an AH. Your position may not be totally incorrect but there are certainly incorrect ways to address some situations. \n\nYou are likely misreading why she thinks you’re an AH as well. She isn’t concerned with the outcome and your feelings over why she and the class shouldn’t become involved. She would find your crass, immature, thoughtless, and needlessly rude way of ‘explaining’ why she and they stay uninvolved to be the driving contingency in what makes you so abhorrent.", "YTA a tiny bit for your phrasing. “Xander has asked that we keep this private and don’t make a big deal.” was all you needed to say. \n\nI gotta admit. I don’t understand your desire to keep this super private and quiet. But if you’ve asked him and that’s what Xander wants, ok. If you haven’t asked him you should do that. You seem to be treating this like an extra embarrassing doctors appointment, not a positive thing in your kiddo’s life. \n\nYea it may not change anything in your mind, but a lot of foster kids want the permanency of adoption for a reason. There’s a chance that what Xander feels and what he know because you’ve told him are different. Maybe this feels like a big deal to him even if it isn’t a big deal to you. \n\nFWIW communities celebrate happy occasions with each other. Maybe that isn’t a thing you enjoy, but it’s common for marriages, adoptions, births, new jobs, new homes, etc to be celebrated by the people in your life. Xander spends a lot of his time with his teacher and classmates. It’s not a bad thing if those people want to acknowledge what a lot of folks consider a happy life event.", "You can decline a celebration without insulting the person offering.", "YTA.\n\nYou think your kid “belongs to you.”\n\nYou think his teacher isn’t important, and her intentions are annoying or invasive.\n\nYou think your kid is the cutest one in her class (how could you possibly know this?).\n\nAnd although she never mentioned your adopting a kid for clout, you oddly interpreted her words to mean that. Perhaps that concept is on your mind for some other reason.", "Yta for the simple line \"he belongs to me\"", "It's an AH thing to say a teacher isn't an important person in a child's life. Some teachers can have an enormous impact on people.\n\nI think you should ask your child what he would like to do. Nothing wrong with celebrating a big event and he spends a lot of time with his classmates. Why do you want to isolate him so?", "YTA, what a horrible attitude.", "YTA the teacher cares about her students and then you tell her she’s making this about herself? Geez. Perhaps the kid would welcome the support? Perhaps letting people in isn’t horrible? Dude get some therapy.", ">He knows he belongs to me\n\nI feel bad for the kid", "You could always ask Xander if he wanted his teacher there or have a celebration in school", "I mean, none of the usual judgment really apply here cuz in and of itself your point isn't wrong but damn, the attitude on OP really is something else. YTA I guess, despite not being in the wrong", "YTA if you were as rude to her as it seems from your description here.   \nHonestly, there was no need for you to tell her why your son was going to miss school in the first place. You could have simply said 'family business', if indeed you needed to give a reason at all.   \nYou and your son are entitled to handle it as quietly or as publicly as you like. But telling the teacher to her face that she isn't important---when she will be an important figure in your son's life while she is in her class---was uncalled for.", "I get it; it’s not about HER. And since you’re so secure in that fact, it wouldn’t hurt to invite her, for the benefit of the doubt. \n\nNo assholes here. When we are secure in ourselves/lives we feel safer to allow strangers to take part in misc. aspects of our lives. \n\nbecause it’s not about Her, or You, tbh—it’s about Xander.", "YTA for the way you went about it.", "You're a fucking asshole, simply as a foster kid and how you phased things, I don't believe a single word you said, he \"belongs to me\" is a really odd way of phrasing things. Teacher just wanted to be kind and you got some weird complex. You're the asshole, and for a couple reasons.", "YTA, and you sound like you are an AH just in general. I've never heard someone speak with such a complete lack of give-a-damn about another person. \"She's not important to our family,\" okay, but your kid spends 40 hours a week with her while she educates him and cares for him. Maybe she should be.  \n\nShe's trying to love your child and to go the extra mile. And you're... annoyed by it? My dude. That's just weird to me. Let people love your child in the ways they can. Children can never have enough love.", "YTA", "YTA", "You could have handled things better when declining her offer.  You chose a dismissive attitude and created a huge negative response when it would have been so easy to decline the offer with a little tact.  You handled it not just an asshole but a big dismissive insulting asshole.", "I find it super creepy she asked to come to the adoption proceedings? So she's going to take time off work for a student she's known two weeks. What about the rest of the class. I get teachers being nice and supportive but this is weird. Maybe a second grade teacher you've kept in touch with throughout the years", "You had a half decent point to begin with, but you were an Ah about it. As per, reddit can't tell the difference between \"had a good point\" and \"had a good point but werd unnecessarily obnoxious about it\"", "Both parties here are well intentioned, and both parties have to take a crash course in communication and understanding.\n\nOP, you know your child, and I expect he has said he wouldn't like a hullabaloo to be made about the day. In that case, you've have advocated for him as a good parent ought to. \n\nThat being said, you were (and continue to be)  dismissive of his teacher's role. Teachers are VERY important in a child's development. They spend so much time going over each child's accommodations, their work, and spend eight hours a day trying to help each and every child in their care. It doesn't matter how long your child is in their class - a good teacher knows their children. \n\nFor her part, the teacher was pushy. Regardless of her intentions, she should have got the message once you communicated it to her the first time, and backed off. She came off too strong, and too emotional. That can be disconcerting.  \n\nOP, you need to communicate without being dismissive and rude. State your point clearly, and leave it at that. Wording is everything, especially when dealing with people who are working with your children, and may be in the future as well.  \n\nThe teacher also needs to learn when to back off, and respect the parent, who is clearly acting in favor of their child. \n\nA gentle ESH to all involved, apart from the child. He may have a gummy bear, if he is so inclined.", "YTA The party is too much. It's a nice gesture for her to come.", "OP you have not answered any questions on how your kid feels about it. No it’s not the teachers business unless your kid made it her business. Did he bring it up to his teacher? Does he talk about it a lot and get excited about it with his classmates? How does he feel about his teacher’s enthusiasm? I agree the teacher is weird and can be crossing boundaries UNLESS it’s your kid who’s actually wanting her excitement and support. All we really know is how YOU’RE uncomfortable with it but as you’ve express, it’s not just about you. Your child’s “nonchalant” attitude doesn’t mean he is opposed to his teacher being apart of this (especially if he really likes his teacher).\n\nedit: forgot to add, ESH", "Oof, looks like a whole lot of projection to me. \n\nYou’re clearly scared people assume bad intentions of your actions because you assume the worst in others. That’s not a healthy attitude for you to have or your son to witness. \n\nVery soft YTA, nothing wrong with wanting to keep things smaller and celebrate privately, but this judgement comes from how you went about expressing it, and the reasons you gave us in this post.", "I wasn’t gonna leave any judgement based on the post itself, but after seeing how you interacted in the comments and avoided the simple question of how your son feels, it seems that you’re the one who’s being all “me me me” about this. YTA", "YTA.  If you didn’t want her to meddle, don’t even mention it to her.  You opened the can of worms.  You had no obligation to tell the teacher he was going to miss ONE school day.", "YTA. As an adopted child I always think it’s amazing to see children get forever homes and stopping the cycle of home bouncing. Your child’s teacher just wanted to celebrate that love. If it’s so “not a big deal” then why are you adopting anyways and not just keeping her as a foster? I would think you would want to shout it from the rooftops. Your child is getting one of the greatest gifts any child could get and her teacher recognized that. Your the massive AH for thinking that she’s making it about her. Get over yourself.", "So I probably would've said N A H if she'd left it at the offer for the class celebration, since it's not uncommon for kids to celebrate huge non-birthday milestones in elementary school, but at the same time kids also don't like advertising some stuff about their life to the class.\n\nBut the moment she tried inviting herself to the actual adoption proceedings when you turned down the class celebration? NTA. She's known of his existence for less than a month, this *is* making it about her despite some of these other commenters. \n\nThere is a line between genuine good will and the appearance of good will. She is perfectly capable of showing her support privately when you pick him up for school or something without making it a huge performance. There's no need to insert herself into personal events outside of school, that's like *the* teacher-student boundary.", "You do know that teachers are the ones teaching your kids most of what they know. Having a teacher who is a life long supporter of your son in his journey growing up could’ve had a positive impact on his education. I don’t see why supporting someone is cause for suspicion. I mean, you denying your kid relationships with people is pretty “it’s all about me not my kid.” \nSure you’re protective, but that’s no excuse to never learn yourself.", "NTA but maybe you could have her write a nice card for your son instead of the celebration and whatnot.", "Your attitude rubs off on your kids, but it's only on the surface for them. This is a big deal. It's a huge deal. You may not truly understand that. Society sees hundreds of thousands of foster kids getting crapped on. You are in it for the right reasons. Be proud others see that. Let them celebrate with you and your son.", "YTA - (foster parent who has adopted here) not for saying “no” but geez the way you said “no” should have been done in a far better way so you weren’t cruel. \n\n1. Did you check with your kid’s therapist? 2. Ask your kid? 3. Did you consider the teacher is an adult providing your kid support for a third of the kid’s day? 4. Your kid (and all children) need adults looking out for them; the more support the better. 5. Your kid already has had a breakdown with adults in their life so there IS trauma. Don’t cut off your nose (meaning, remove or limit sources of support for your child) to spite your face here. You should have considered all of these factors before answering the teacher.\n\nIn my state, our agency provides a family counselor. We (spouse and all kids regardless of source) receive weekly counseling. Our counselor comes with us to school meetings (CSE - special education meetings) to advocate for our child and explain relational trauma and the impact it has on brain development, attention, and the ability for children to interact with others. This has gone on since initial placement in our home through and beyond the adoption.\n\nGood on you for being a foster parent! Our world needs more of this. And it’s hard. But you could have handled this one better.", "Bottom line:  I think you should ask Xander who if anyone he wants there.\n\nAlot of families might only show up themselves and celebrate afterwards privately.  I've also seen at least one on TV where the child's whole class showed up at the courthouse to support him and he was absolutely thrilled.  It's really all about the kid. \n\nYou say you don't *think* he wants anyone there, but ask him anyway.  You don't say if he's said anything one way or another, but make sure you're not projecting.", "You’re not wrong, but you are an asshole about being right.\n\nSet a better example for your son.", "No", "I think it's your right to not want a celebration but you sound like an AH in general. Not sure why it would rub you the wrong way in the first part.\n\nMaybe ask the kid what he wants.", "YTA for being so rude to your sons teacher.\nYTA also, for refusing to answer whether or not you've asked your son what *he wants* for *his day*.", "Yta. She is just acting nice. I can understand you don't want her there. But you didn't have to act that mean", "I wonder if, and having adopted a child myself, this makes OP slightly insecure. I know I love my child and wish she was biologically mine. Talking about her being adopted is slightly painful because in my heart she is mine no more or less than my bio kids. Op may want to consider that this insecurity is making him a bit clouded in having a whole tribe of support. Your child may not want others to know or maybe he will but her intentions aren't bad. I get how it could as a parent make you feel insecure as well. NAH", "From the post, it honestly doesn't sound like the teacher is trying to make things about her or that her intentions are selfish. And I think it's nice that she clearly cares about her student and wants to celebrate. Overall, it doesn't feel to me that the teachers intentions are all that selfish, BUT, OP is certainly entitled to keep the entire thing personal and within the family. I don't think anyone is the asshole. Maybe OP was a little harsh in how he set boundaries, but it  is overall for the best for everyone involved.", "I can tell you by personal experience it is a very big deal.  My family celebrated the day I was born and the day I became part of the family legally.  He may have been your son since he was 3 but until that paper is finalized by a judge there is always the worry something will go wrong And disrupt the family we know and love.    When my neighbor had their adoption finalized we decorated the house while they were in court. They returned to family and friends gathered to celebrate just as if he was just born.   You are the parent and ultimately it is your choice I just wanted you to see a different prospective from someone who has been there", "YTA for how you spoke to her. Telling her she isnt important isn't ok. Your kid sees her 5 days a week and it's rare to have a teacher so willing to go so above and beyond. It would have been better had you said you rather keep things as normal as possible for your kid as your worried interpreting his routine will do more harm than good and your kid also doesn't want it made into a big deal. Just be sure to be more respectful ne time and maybe appoligize.", "YTA you sound like genuine asshole and if you didn’t want a pat on the back you wouldn’t have come to Reddit", "YTA for being weirdly, unnecessarily hostile. And also, alienating your kid's teacher the first week of school is a super dumb move.", "Oh wow, YTA. I believe your feelings are valid. As the parent you are the one with intimate knowledge of your child and you should be the one deciding how this day plays out and who should be apart of it. I also agree this teacher is over stepping. But, there is zero reason to be hurtful with her. Take it from someone you knows; Your child will be greatly impacted by the relationships you have with his teachers good or bad. Your child is at their mercy five days a week. A single teacher can have a huge impact on a child's school experience and his or her future.", "YTA because you didn't aske your son if he would like his teacher to be present and because you were rude to the teacher in your wording.", "Have you asked your son if his teacher is important to him?", "Oh you’re an AH.\nThese two statements “he knows he belongs to me” and “I get it he’s the cutest kid in the class.”\nLike sure you get to decide you don’t want a celebration at school or for the teacher to be involved…but you seem like an AH  in general.", "NAH although your overreaction comes *close*.\n\nYou know how people are always saying \"No is a complete sentence\" (even though, technically, it's not)?  Well, you don't have to offer an explanation for a kid not being in class.  You *chose* to explain why the kid won't be there for half of Wednesday.\n\nIn the future, if you don't want to invite someone to comment/react, *don't tell them* unless it's necessary!", "You gave the teacher the information and she was trying to be kind in recognizing the event, as teachers do. She can't read your mind and doesn't know you well yet. She probably thought it was okay since you brought it up vs just saying something vague like \"my son will be out on Tuesday for a family matter.\"  If you didn't want this all you had to say was \"Thank you, but we would prefer it be a private family event only. He wouldn't be comfortable having it recognized in front of the whole class.\" I think OP is kind of the AH. Maybe unintentionally, but there was no need to be rude.", "Wow. I don’t understand why OP is acting nonchalant. And saying the 7 yo is nonchalant. The kid is obviously following his lead. Maybe the child does not remember his life before he was placed. Is being adopted after foster placement NORMAL? No it should be celebrated.", "YTA. \n\nWhile the teacher may not be at your dinner table every night, she is literally the biggest part of his life for 30-40 hours a week. She cares for him. This could have been handled so differently.", "YTA and it seems from your replies that you don't actually want to know whether you're in the wrong here.", "I’m a single Dad to two adopted children but I thought you were the asshole when I first started reading but then her asking to attend the adoption hearing was plain overstepping. People have a strangely warped view of adoption so I didn’t think her comment about you being kind were that weird. Yeah it’s slightly inappropriate but get used to it because it won’t be the first time you hear it and it’s somewhat exhausting chiding every person who thinks their complimenting you. I could understand her perhaps offering a letter of recommendation or character but attending with you is too far.", "YTA. If you want to keep this as a family only party that’s your choice. Your attitude and behavior towards the teacher says a lot more about you and the adoption. Why so defensive? Is this how you want to teach your child to treat other people? With suspicion and disrespect because they’re not “ important”", "YTA. “He knows he belongs to me.”\n\nThat is a cringy thing to say/think. \n\nShe was well intentioned and you could have politely dismissed her offer but instead decided to be narcissistic and overly rude to the person who will be spending 7+ hours, five days a week with your kid.", "Ok but what does Xander want? ESH", "I was going to say n a h but after reading some of your comments they read as pretty rude and very defensive. It seems like she was coming from a well intentioned place and you were pretty rude. You could have said it in a much better way and helped her to see your point of view and educated her on adoption etc. Instead you alienated her and potentially damaged her future relationship with your child. Your post and comments come across as immature and I really hope that’s not the case as your son will need a father who handles confrontation and things he doesn’t like in mature and reasonable way, and sets a good example.", "NTA.  She overstepped and she should’ve taken the hint when you declined the class celebration but then she continued to overstep your boundaries by trying to insert herself in a private family event.", "NTA. Nothing wrong with her suggesting a celebration but inviting herself to the adoption itself is bonkers. I feel like people in the comments are missing that part. Who invites themselves to legal proceedings who isn’t part of the situation or family?", "ESH. I think the teacher was well intentioned and some folks do like to find any excuse to celebrate (my mum always did and I inherited that from her) but if you don't want folks outside the family there she should have dropped it. But you are really dismissive about teachers here and I do not like the way you said that your son \"belongs to you\". He is a human being not a fucking car. You are his parent. That is not the same as ownership", "Fellow foster mom here- NTA. What a lot of people don’t realize is that for a lot of our kids, adoption is bittersweet. It is another trauma. The creation of a new family comes with the dissolution of their old family. Adult adoptees frequently state that they have very mixed feelings about their adoption day and seeing it treated as an event to celebrate is hard for them. Kudos to you for taking your cue from Xander. The teacher’s heart is most likely in the right place, but she needs to take no for an answer.", "NTA but she might be thirsty for you.", "NTA . Your family, your choice. She needs to respect that.", "NTA, but...this seems to be more about you than it does about Xander.  Have you asked him how he feels about it?  I'm sure it means a lot to him.  I also wonder why you were so hostile to the teacher.  There is some big subtext here.", "Hmm, this is borderline. You were rude to her but she was also overstepping to invite herself to a private family occasion so I can understand why you reacted this way. \n\nI could be off the mark but I am also getting some neurodivergent vibes here. Some of us express ourselves in a way that comes off ruder than we intended.", "NAH, but Mrs M is skirting the line.\n\nIt could be that Xander has been excited about this in class and she got the wrong impression, but the first \"No\" should have been enough.", "NTA. You were firm but polite in your original \"no thank yous\" and you deserve your privacy. Has the same vibes as throwing birthday parties for people who don't want to celebrate their birthday with a party.\n\nMy mom used to do the same thing and make events about herself, including inviting my most hated elementary school teacher to my high school graduation ceremony without my blessing or knowledge. Mom was excited to brag about the ceremony and the teacher wanted the event as an excuse to ask a child for forgiveness for the way they treated me in their *third grade class.* So yeah this lady was holding that weird grudge against an 8 year old little kid for *10 fucking years* and showed up at my ceremony with flowers demanding a hug and photos like she was part of my accomplishments???\n\nSame vibes coming off this lady even tho she may actually believe she has good intentions. Her wanting to be included does not outweigh the fact that she wasn't *invited.*\n\nDon't invite yourself to other people's functions and events!!!", "I’m going with NAH. Ask Xander if he would like it. He is the one that should make this decision. I think it’s strange she wants to miss work to come to court but that’s not really important. The important part is how Xander feels. It’s his moment and if he wants a celebration with people that love him then you shouldn’t deny him that.", "NAH", "NAH. My parents adopted me for the clout and were so upset when no one really cared. Sounds like your heart is in the right place", "NTA\n\nAs a parent through adoption myself, I’m in your corner on this. Adoption isn’t something most kids want to celebrate publicly. Some don’t want to celebrate it at all. It’s important that we follow our kids’ leads with these events. \n\nShe doesn’t realize that adoption related events can cause mixed reactions for adoptees. Your little one shouldn’t be put in a position of have to perform happiness for his teacher. \n\nAlso - wow do I get you about how awful those “you’re so wonderful” comments are. We adopted our son because we love him. That doesn’t make us saints; it just makes us parents. He wasn’t “rescued” like a puppy with mange, ffs. \n\n“Gotcha day celebrations” can also take a flying leap, imo. As though we don’t already have enough opportunities for our kids to feel happy, sad, conflicted, confused and homesick without adding another one. And talk about centering the feelings of parents instead of kids! It sounds like the celebration of a successful kidnapping.", "NTA but she might be thirsty for you.", "She wants to make HERSELF feel good.", "I love how genuine you are. More people like you and less ego driven people like her would be a better world. It's private personal business, she's over stepping and you need to tell her that. Period.", "The teacher's behavior is unhinged, wtf. You let her lightly of the hook. NTA.", "\"Xander is already very secure in his relationship with me, treats this as no big deal and I want to respect his feelings. I appreciate that you see this as something worthy of celebration but in fact that would, in this case, go directly against how he sees it and how I am trying to keep it.\n\nSo, if you want to support him, the right thing to do is, in fact, nothing. That may be anti intuitive to you, but that's the reality. Thank you for your understanding, and please, do not comment on this to him.\"\n\nShould the teacher deviate from this, she would in fact be an AH.", "I second this. My school is connected to the local group home and the stories we hear are heartbreaking. I would be thrilled to hear about any of my students being adopted. I can also see wanting to encourage empathy from other students by sharing in the moment. \n\nThat said, I would ASK how they would like me to handle it and include options like a party or going to court with them. If I were told not to make it a big deal, I would absolutely accept that, especially so early in the year and not having a strong relationship with the kid/family yet. \n\nYou are NTA for telling her not to make a big deal of it. She’s not TA for asking to do something, but she is for pushing it.", "Idk, I feel like op is a bit of an ass hole, for thinking that his child's teacher for a whole year at least, is unimportant...  like I remember the hell out of every caring, enthusiastic teacher I ever had, many of them had a sizeable impact on my life as a whole...", "It's always a great idea to discourage people from doing nice things so the rest of us can keep scowling.", "This. You have no idea. His teacher does in fact mean well. \nPlease please please let her know that you understand this.", "Very true, and I'll add this food for thought:\n\nOp, you say this teacher is unimportant... while she's likely unimportant to you, your kid will be spending a majority of his time with her this year.  I'm 40 now and still have fond memories of my second grade teacher.  So perhaps she'll end up more important to your son than you might expect.", "I can totally understand the teachers excitement. The teacher herself could be an adoptee who didn't have a great adoptive family. I am one. When I see adoptee's/bio-kids in good homes I smile. It's really nice to see. (I know this last sentence seems weird but I have been through some crud.) \n\nAs for OP you are an amazing parent and thank you for being an amazing person. I wish all the best for you and your family.", "\"NAH\" (no assholes here) is the judgment acronym you're looking for.", "I agree. What a great comment.", "As a teacher, I’ve encountered some really difficult home situations that still tug at my heart strings. All I can do is be their safe space and make school a place of love. \n\nI understand her instinct to want to celebrate y’all because, while family is family and all families look different,  adoptees and foster kids don’t always get the same opportunities to be celebrated or feel seen. \n\nI understand your instinct to keep it low key and just an official check mark for what you and your son already know - you are and always will be a family. It’s your family and your choice, and you’ve clearly stated your expectations. If she doesn’t respect them, request a conference with her and/or admin to ensure the boundary pushing stops.\n\nYou are NTA", "Known too many kids in elementary who got bullied for being adopted - parent is well within his rights for saying no and not to want this made public.", "But everyone has a birthday. It doesn’t tag you as different to have a birthday.", "My mom, who was a teacher for decades, says literally all this. Women in my family have been teachers for generations, but she pushed hard for my sister not to be one and to make sure her stint with Teach for America was temporary.  She loves teaching in principle but all the BS around it and the conditions are just terrible, especially for new teachers starting out.", "I am caught her not sure if your an AH or not.", "I think it’s weird he’s said “my kid is the cutest kid in her class” lol. Guarantee he’s not. I’m sure he’s cute and all, but the OP seems a little too…self absorbed? smug? Snobby?  I can’t quite pinpoint it.\n\nYeah, if he doesn’t want the teacher there, fine, but the way this is written makes it seem like he really looks down on teachers", "I can’t believe I had to scroll this far for this comment! OP sounds like such a dick. His kid will be seeing his teacher 8 hours a day 5 days a week and he has the audacity to say she’s not important? Sure, the adoption is his business but no reason to go at the teacher like he did.", "This. I’ve had teachers who have loved me like mothers do. The type of love that can change your life. To say tell her she’s not important is so callous and cruel. This guy is an asshole.", "My teachers are still important to me in my memories tbh. I had a bad one, but the other three were amazing and I still feel love for them when I think about them (even if I haven't seen them in almost 15 years). I would have been very sad if my parents said they weren't important, because I think teachers-children (usually ; I know sometimes things go wrong) share an important bond. Not family, sure, but it's important imho.", "Seriously. My kid's teachers are very important to our family. We as parents communicate with them regularly, and they're *teaching and caring for our child* for fucks sake. How is that not important?", "> Apparently, AITA is coming for the teachers today.\n> \n> \n> \n> Telling her not to acknowledge it is fine: It's a well-intentioned gesture on her part, but not what you want.\n> \n> \n> \n> Telling her she's not important is seriously misguided: he's 7. You do your son a massive disservice by insulting his teacher. He spends all day with her 5 days a week. Teachers are massively important in kids' lives. She's still getting to know him, and you, because it's the beginning of the year. Give her a break. YTA.\n\nExactly I still have fond memories of some of my teachers back when I was 7", "OP is the kind of guy that comes to conference night to yell at the teachers when their kid is at fault.\n\nNot an asshole to say no celebration, but to tell the teacher she is unimportant is a pretty accurate take of teaching in America. We are babysitters,  but paid less then babysitters. Nothing more.", "IDK how important the teacher is. School just started. Not sure my kids teacher knows any more then my kids name at this point.", "Can't believe I had to scroll so far for a sane take on the situation. YTA.", "Probably going to post again in a few months;  \"AITAH for being upset with my son's teacher for not treating his birthday like a special occasion?\"", "He’s not doing it for clout or praise though honest, he’s really just a nice guy!", "He does belong to me and I belong to him. That's my kid and I'm fiercely protective of him.", "I'm so glad someone mentioned this.\nThat remark gave me the biggest ick.", "OP you have not answered any questions on how your kid feels about it.", "Lmao and he doubled down on it below ☠️. Like he bought himself some property yikes.", "Right?  If OP doesn't want any acknowledgment or celebration at school, then they should have kept their own mouth shut about it.\n\nSeems like OP might have been pumping their own ego, by making a big show of \"he's missing school for court because I'm adopting him.\"", "Definitely a bit unhinged. Coupled with saying the kid \"belongs\" to him and weirdly saying he is the cutest in the class.", "Would you have offered to take time off of work and come to court?  This is the part I find strange", "That's kind of longwinded.  Probably easier to just say, \"I appreciate the thought, but we'd like to keep it as a private, family-only, event.\"  That's really all you need in this situation.", "What a thoughtful response, that’s what OP should say.", "And seems to want to ostracize the child from his school friends. Friends like to celebrate positive events. It gives off possessive \"he's mine and no one else can celebrate\" vibes", "*you're", "Unless I'm missing something, it seems like the teacher asked if she could do something nice, was told no, asked if she could do something else nice, was told no again, and dropped it. I dont see how everyone sucks here. OP wouldn't be an AH for tactfully saying no, but the callous and denigrating way he did it definitely makes him an AH.", "You do know that teachers are the ones teaching your kids most of what they know.", "As a foster parent, there are plenty of people who want to use your story as clout for themselves, when really your just a family. Can you imagine a teacher wanting to make a big deal about someone’s first communion? The teacher is def the AH. She’s known them for two weeks and wants to interject herself into a family.", "Teacher wanted to come to court and miss work — you do not find that odd?", "I absolutely agree. Teacher overstepped. Although, the whole demeanor of OP is rather off putting to me. Even if this teacher sent an email, he’d probably have something to say about that too. He also didn’t have to be so harsh. The whole post is just weird. As a parent, my kids teachers are important to our family because they’re a pivotal part of their upbringing. I find it weird that he’s acting like school life just isn’t a big deal. This also rubbed me the wrong way: “He knows he belongs to me.” Children aren’t property.", "Did you even read any of this", "Um, I'm adopting so he can stay with me?", "No adopted children but I also thought the offer to take time off work to go to court was really too much.", "If the OP is white and son is not, even more worse.", "He wants to go bowling", "Where do you see the teacher making it about her? Seems clear the teacher was trying to make it about her student. Oh no! She wants her student to feel special! Such main character bs! \n\nOP was a dick to her for no reason. He could have just said No Thanks to her offer.", "OP still didn’t have to be an AH in how he said no to that.", "Yes, I posted the same in a separate comment. Teacher needs reminded from a professional standpoint to respect a parent’s boundary.", "You’re trying to say N A H, but read OP’s comments, it’s YTA", "Well said!\n\nPeople, in general, can be *so weird* about adoption and put so many narratives on it that end up hurting the kid involved even if they don't mean to.\n\nI'd recommend OP check in with Xander about how he's feeling and what his preferences are. He's old enough for a simple \"Hey, I told your teacher you'd be missing class because of the adoption. She asked about throwing a little party for you. My first thought was that you wouldn't enjoy that, but I wanted to check with you first. Would a party be a good idea, or would it be better to not do something?\"\n\nAnd in general, \"How do you want people to talk about the adoption? Would it make you feel good to hear people say 'congratulations', or would that make you feel bad? If people have questions, is that okay to ask you, or would it be better if they save those questions for me?\" or whatever, just going over some common scenarios. Then you can give people a head's up.\n\n\"Xander has let us know that he would prefer no one bring up the adoption right now unless it's necessary. He wants to be treated like any other kid\" or \"Xander is okay with talking about it but making a big deal about it makes him feel weird.\" or \"Xander is very excited about the adoption and loves to tell people, he's okay with answering questions people have\" or whatever his preferences are.", "Boeing, I actually completely agree with you. The issue for me is, the OP didn't say that to the teacher in a kind, respectful way. He just seemed to go off on this lady for trying to do something that she saw as being nice.", "I love this I think it’s brilliant and very tactful actually.", "Bang on... Clear, concise, with no room for misunderstanding.  It is polite, but also sets your boundaries and expectations firmly.", "This is why OP is a massive AH. \n\nHe acted like she had negative intent.", "[removed]", "[removed]", "Beautiful!", "She offered to do an event in the class or to possibly come to the adoption herself.  She was told that they wouldn't like that. She moved on with her life.\n\nI'm actually kind of switching to saying the OP is kind of an asshole. The teacher was trying to be nice and OP accused her of being selfish about it.", "Just because you feel something is nice, doesn't mean it is, and can be forced on others who don't want it.\n\nMeaning well doesn't mean you get to steamroll over others. Good intentions used as weapons aren't actually good intentions.", "People need to stay in their own lane.", "Lol, we see it so rarely I didn't even know that acronym.", "This is batshit.", "We do not know the sexual preferences and identities of anyone but the child involved as far as I can read. You're making a lot of assumptions", "Assume much?  You’re the type of person who makes unhinged videos crying in your car after a strange man nods or says hello in a parking lot or grocery store, aren’t you?", "I was rubbed the wrong way when the teacher heaped praise on OP, turning this into a savior story.  Doing that turns OP's kid into a charity project.  As an adopted person I can tell that we don't want to be someone's project; we want to be someone's beloved child.\n\nI'm doubtful the teacher wouldn't turn a class celebration into something gross about how OP has saved his kid.", "Your choice or his?", "Unnecessarily aggressive to someone who wanted to do a nice thing for his child.", "OP is an asshole, it bleeds through their writing.   That's what you can't quite pinpoint.  Always remember that the person writing the post wrote this too make themselves look the best.  This is the best they could make themselves look.", "Yeah, that didn’t sit right with me. Here’s the thing: every parent in that class thinks their kid is the cutest kid in the class. That shouldn’t make a difference to how the teacher treats the kids, though. Zander could be the ugliest kid on earth and his teacher should still want to be there for him. \n\nIf I had to guess, I’d say that every teacher in that elementary school is going to breathe a sigh of relief when he moves on to middle school. OPs attitude makes him an AH.", "Yeah between that and \"my son knows he belongs to me\" it was very cringey. Who tf says that about another human person? Narcissists, assholes and controlling/possessive dicks.", "The way he said his son belonged to him rubbed me the wrong way aswell. Seems like the asshole for taking it that far", "I agree!!! Most parents think their kids are cute (as they should) but you do NOT need to make comparisons against other children to compliment your own. Weirdo.", "Narcissistic, I think is maybe the right word 😬", "Yes, dad seems like a total snot.", "Also completely unaware: schools have to do loads of work with Looked After Children. \n\nThese are the people who have been advocating for his son for his whole time at school. \n\nThey will have been filling in paperwork, attending meetings with other workers, hosting meetings, and justifying what they do to look after his son in school inspections. \n\nThey were probably asked their opinion on his son moving from being in care to being adopted. \n\nThis individual teacher won't have done all that, but different people in school will have, and she will have been told all about all this at the handover meetings between her and the previous teacher. It's exciting that OP is adopting his son. Just say no thanks for the party, but thanks for all your support. Sorted.", "\"He belongs to me\" was equally weird IMO", "This lol he definitely sounds like an asshole", "Yes that comment also stuck out to me", "Unless the son is a golden retriever he is likely not the stand out cutest kid there", "I’m a parent and have been a teacher. I’ve had kids feel safe enough with me to tell me all sorts of things. Some I’ve had to report to authorities, some were just sharing because they felt safe and not judged by me.\n\nI’m not saying I’ve changed every kids life who I’ve ever had. Heck, probably not even a large amount at all…but if just one kid’s life is better after knowing me even in the smallest of ways…I feel like I’ve succeeded.\n\nI also know that when my own kid was going through a particularly hard break up, one of his teacher at school was a saving grace for him.  He’d duck into her classroom if he saw his ex and was having trouble. She’d give him a snack, a sympathetic ear, and a pass back to class. I love her for that.  He even honored her at his football game when they did a special “thank a teacher” night.  \n\nHe’s doing his kid a huge disservice for not recognizing that a teacher COULD have an impact on his kid. Maybe not this teacher…but with his attitude, he seems to think no teacher could make an impact", "They might not at this moment but they will, and a lot more as they continue to spend more time together. Teacher/student relationships are very impactful in a child's life at all stages.", "Or, hear me out, she cares about her students and would offer the same gesture to any of the 20 of them?\n\nYou should chill out, the vitriol you’re spewing at a well meaning teacher is ridiculous.", "Idk about you but when I was in elementary there were about 25-30 kids in every class.  I still vividly remember my kindergarten and 2nd grade teachers because they had a very positive  impact on me as a child. So to say just because there are other kids and it's only been a handful of hours(possibly) is a little short sighted. A few hours a day at such a young age feels like forever and they're very impressionable so they can quickly form bonds.", "Not commenting on anything other than the fact that you clearly don't understand the importance the teacher and your child's classmates have on your child. \n\nThis knowledge becomes even more important as your kid grows and decides his friends know more than you.", "Oh no. Your son and his future teachers are in for a treat with you. I had a parent like you and it was embarrassing as fuck for me and disrespectful as fuck for the teacher every time there was an interaction.\n\nYTA. You're out looking for a fight where there isn't one.", "So, would you rather a teacher who doesn’t care about your son? Doesn’t want to support him? \n\nMy friend, teachers just want what’s best for students. Sometimes, that’s showing support outside the classroom. She asked because she wants to support. And your response is to say she’s unimportant? \n\nYou’re an ass.", "Teachers are someone kids look up to and for guidance. Kids sense of time is also different so being in her class for half a day is a lot of time for them.\n\nYou’re fine not wanting her coming to the adoption process (I agree that’s weird), but you’re being very dismissive of the role teachers have for kids in general.", "Good teachers are involved in the lives of their students, especially when their students are young. It’s okay to not want a teacher involved in these events. It’s not okay to speak to a professional like you’re an 18 year old acting out. \n\nIt’s pretty evident in your responses that you never had an impactful teacher in your life which is fine. That doesn’t mean your son couldn’t develop those relationships. Kids do best when there is a healthy, working relationship between school and home life. \n\nYTA for how you spoke to the teacher. I would recommend dropping this high school attitude towards teachers and remember that this is about setting your son up success over the next 12 years of public school.", "Jfc, YTA for this attitude.", "Have you ever… interacted with a teacher before? \n\nMy mother is a teacher for primary school— a relief teacher who takes over when a teacher isn’t there that day or has a meeting. She can have four classes a day. She cares about every single kid at that school, and knows all of them by name. Sometimes she just shares with me how proud she is of a kid, or who had a bad day, maybe that she noticed one kid never had a pencil case so she bought him one— out of her own meager money. Maybe about how frustrated she is that a kid is in a bad situation and how her report about their parent didn’t amount to much. \n\nAll this to say, teachers aren’t the devil. Most of them genuinely care about those kids, even if they don’t know every detail about them.\n\nYTA, you need an attitude check. Be nice to the teachers, and you’ll have a far better run for the rest of your kids schooling.", "This statement here makes you an AH, \"His teacher Mrs. M got a bit emotional and said what a nice guy I was to adopt a child. It rubbed me the wrong way. I am adopting him because I love him and not for clout or praise\".  She gave you a compliment, and you toke it a an insult.", "YTA OP. Hopefully the sane people on this thread start coming out more because you deserve to see how much of a fucking dick you sound like.\n\nYour poor child is going to suffer in life and school because you’re a parent that cares more about making it clear to the teacher that they’re not important to you. Teachers will spend hours teaching your kid over the years, and you’ll still be an ungrateful prick for it. The only one that suffers there is your kid.", "I feel like you’re also the type to discount SAHMs. 🙄", "teachers care about the kids in their class", "Knowing what’s happening in her students lives literally is her business and allows her to adjust her teaching methods to meet kids where they are. You’re contempt at her for trying to be supportive is very much AH behavior.", "It sounds like you're going to push everyone away from your son so you could have him to yourself. Your attitude and some of the language you use is a little concerning.", "Yeah, you're weirdly hostile about this. I wonder why.", "Then why did you tell her about it? Could’ve just said kid is going to be absent. You’re super hostile dude.", "I mean, it is none of her business and you have every right to celebrate or not celebrate how you’d like… BUT, you kinda opened the door by telling her your plans for why you’re taking your son out of class for a day. Why even say anything at all if you wanted no acknowledgment? You actually don’t need a specific reason to keep your son out of school for a day, literally could have just said you had an appointment. NAH, borderlining on YTA for how aggressive and pissed off you sound by being bothered by a well intentioned teacher", "Still YTA for the horrible way you spoke to her. And calling her not important? What a stupid thing to say. She's EDUCATING YOUR CHILD. She's one of the most important adults in his life. This is why teachers leave the field, because of assholes like you who disrespect and belittle them. Try to be your kid's teacher if she's so unimportant to you.", "I had a baby last year. I informed my oldest’s teachers and the administration for a couple of reasons, one of which was that I would be completely unavailable for at least a week. The other was that after eleven years of being an only child, that would be a seismic shift in their life. \n\nLet’s be real, that’s not what this is. If you genuinely felt it wasn’t her business, you could have said he had a doctors appointment in the middle of the day. You didn’t, which tells me this is either fake and written to tear down your sons teacher or you wanted her to know.", "I didn't say it was her bussiness (??), I said YTA.", "If it's none of her business why do you tell her, you could have just said that's there's an appointment and he'll be out or not even give a reason and just say he won't be here on x day", "She spends almost if not more time a week w your kid than you do it is absolutely her business \n\nThat kind of mindset is what gets kids over looked for abuse", "tell us you're on the spectrum without telling us youre on the spectrum", "Jesus, have you actually asked the kid what HE wants? Straight up ask him, \"Your teacher wants to celebrate with you, do you think that's a good idea?\"\n\nIf you haven't done that yet and are basing all these off of assumptions, YTA.\n\nActually, YTA regardless for being such a prick to his teacher, who is extremely important in his development.", "people aren't property thats why ''belong'' sounds so awful.", "Thats a pretty weird thing to say.", "Nah you're a fucking asshole who was mean to someone who wanted to celebrate a child's hopefully happy future. And that child is their own person. You don't own shit.", ">You don't realize this because you just met him a few weeks ago, but we've been father and son for quite a while now.\n\nAgreed, and the above quote is unnecessarily incendiary, to boot. Concise, succinct and without judgment is the best approach ton already-volatile situation.", "You are 100% right I was being too nice.", "Teacher here. It’s a tremendous honor to be invited to events like this. But you have to be invited.", "We now live in a world where showing up to celebrate others is making it about yourself, apparently", "Errr, where I live the teachers literally organise the first communion, so yes they make it a big deal, why wouldn't they?", "You sound like a robot with your responses. \n\nWe KNOW it's none of her business, but you told her what was up. You could have said the kid had a dentist's appointment or something... but you didn't. That's fine in itself. \n\nTeacher took interest and honestly, she sounds young and full of energy for loving her students.\n\nEven if she kind of overstepped he bounds, you treated her like shit.\n\nYou came here for judgment, yet just argue with everyone. \n\nAnd you said the kid \"belongs\" to you.\nThat's creepy and not something a normal person says... ever.\n\nFor all those reasons, YTA.", "Yet you told the teacher…", "If that's the case, why did you tell her you were taking him out of class for an adoption? You could have said, \"Family event\" or anything else. You specifically mentioned an adoption and you seem to be pissed off at her for being happy for the two of you. I don't get it.", "Then why did you tell her?", "You have a teacher who seems happy for your kid, who wanted to be part of the celebration you could have been nice and explained to her why it wasn't a good idea but nope you decided to be a prick. I can't imagine how shitty you're going to be to his teachers as he grows up.", "EXACTLY, an adopted child needs stability, not a circus of nosy teachers", "I mean, if you actually verbally told the teacher the things you said you did in this post, why do you care what she thinks of you as a parent? She has probably already formed her opinion of you.", "Ya, it's much better to talk to her the way you did.\n\nNo teacher is going to give two craps about a child missing a single day of school.", "Other kids may choose differently. That’s why you ask the child.", ">He could have just said No Thanks to her offer\n\nHe did, and she kept insisting. \n\n>She wants her student to feel special!\n\nBut *her* *student* doesn't like that type of attention.\n\n Also, bringing him a gift to show him he is loved and supported by *her*?? She literally just met him...", "This is the perfect response.  It involves kiddo\nIn the consent and decision making.\n\nLove it", "I am adopted, as is my only child - this is the answer.  I fostered my son from birth (23 hours old).  Being an adoptee myself - I am super pro adoption, it is never hidden - only celebrated.  Asking their son what he wants would be the thing to do.  Honestly - OP is coming across as being ashamed of the fact that his/her son is not their biological child. I'm not saying he/she doesn't love their son, they just sound conflicted. Celebrating this incredible event shows the positivity of family.", "Someone's nice gesture isn't when its unwanted and without consent. The teacher sees it as nice not Xanders family. As someone who was emancipated from foster care, I definitely would not have appreciated the teachers niceness if they did anything without my consent. Being adopted is so personal for some", "It's great that she asked, but the idea of \"wow this possibly intensely personal event is happening in this child's life - what if I made sure the WHOLE CLASS knows?\" is weird and is bc of social media. It puts the kid in a position to have to answer questions he may not want to. \n\nOP says she doesn't even know them like that. It's like inviting yourself to the birth of your coworker's baby just bc you're in the same department and you found out it was happening. And if you invited yourself after offering to throw an office gender reveal party and they said no.\n\nA little \"I said no, back off, who tf even are you\" is due here.", "So I can involve myself in big moments in your life, and if youvdont capitulate then you are the AH for not wanting me to involve myself in your life.\n\nThink about what you said. The person that is not part of the family is the AH for automatically inviting themselves, not the person that says, \"No, this is a family event and you're not family and you have no connection to what is going on.\"\n\nIf there's an AH here, it's not OP for denying her. It doesn't matter if her intentions are good or bad. What matters is that she is inserting herself into a life event of someone else. That's why the teacher is the AH of there's one around.", "Accused her of trying to make the adoption about her (no evidence of this) AND did it in the most petty 'tween-like and tactless way possible.", "But we don't really have any evidence that the teacher was trying to steamroll anything. She wanted to do a nice thing. The OP said \"Don't.\" Unless she keeps suggesting celebrations, she's NTA. Also, I could have done without the OP's tone, and his statement that the teacher isn't important to his family. Wait until the first time OP is 15 minutes late picking up the kid, and the teacher waits with the little one on her own time.", "She didn't force it, though.  She asked.", "That's quite a thesis you've contrived with so little info, and from a single biased perspective, yet.\n\n\"steamroll\"\n\nFascinating.", "This is really something. A weapon? In what way was this used as a weapon? Did she proceed to ignore OP’s boundaries? Because he mentioned literally nothing about that. What a way to go through life.", "Scowly McScowlface joins the conversation.", "But if the right thing for Xander is to continue to treat it as no big deal, then teacher owes it to the child to restrain her emotions. She can be as happy as she wants to be, but she doesn't get to go against what is best for the child.", "You don’t have to make it a school event, but accusing the teacher of making the event about herself is ridiculous. If my co worker is about to have baby, (something that has nothing to do with me bc I’m not family), and I offer to throw a baby shower to celebrate, does that mean I’m making her pregnancy all about me? Your son’s teacher is happy for him. That’s all. She wanted to help mark a life event for him. You not wanting to celebrate that way is fine. You just say you appreciate the thought, but you think son won’t like being singled out at school.", "Cool. Do you truly believe she had negative intent?\n\nShe offered support from your child’s community- you declined. Fine! She offered a less intense alternative- \n\nAnd you *went off*, insinuating she was selfish? You were wildly rude and you overreacted immensely. Your response was not appropriate to the situation.", "Hi, I'm adopted through foster care too! I totally get your stance on this. So many people would make a big deal about it, want to be involved, know all the details ect and then not be there to help out when things get messy. I had a whole load of adults basically use my story to make them feel better but weren't there for me as I got older.honestly it was like being a walking feel good story for other people instead of a regular human, which was super draining. op is supporting his son in a way that's safe and reassuring for him, I hope you have a wonderful family day together.", "It’s a life event for your son, and his community wants to celebrate that for him. That’s all they are saying.", "When my son had a major surgery, one of his teachers offered to bring over a dish that is meant as well wishes in her country. Of course we accepted although it wasn't \"a school event.\"  Honestly you just sound rude.", "She probably wanted a viral video lol. I love those but.... if she kept pushing after one \"no,\" then she is making it about her.", "I adopted two children from foster care who are now in their 20s. They've told me that every time I made a big deal about their adoptions it made them happy, proud, and loved. \n\nI showed them their birth certificates that were changed to show me as the father and made a big deal about it, they were proud.\n\nTheir schools made a big deal about it and they were proud.\n\nWe celebrated the anniversary of the adoption every year with a party a cake with their classmates and they were proud.\n\nWhen you make it no big deal or just family it can often seem like they (the child) are no big deal and not worth sharing.\n\nEven in the best of adoptions, there's a lot of hidden trauma with an adoption and it's better to err on the side of celebration and joy. \n\nJust an opinion from a guy that was in your position about 20 years ago and has the ability to look back on my actions and what helped, what didn't and what was neutral.  \n\nNAH, you don't know what you don't know.", "As a teacher and parent to 3 adopted children, I think this lacks a little perspective. I taught in an iZone school and could detail horror stories to a therapist for years of the things that I have seen, had to report, had to go to court about, and even funerals attended. Being a teacher doesn't always come with a lot of joyful celebrations for children. Especially in today's political climate, you can't even be happy when a kid finds a loving forever home no matter the parent or parents. \n\nA single dad that adopted one of my first Kindergarten students became a grandfather yesterday. I congratulated them on both occasions, and graduation, and getting his license, and his first job and many milestones in between. \n\nWhile this may be just a legality for you, it is life affirming for your son. It is as important as an other anniversary. I adopted my 3 at the start of the year. We took our first \"Real Family\" Vacation as read from their social media post. Talk to your son and see what he wants. He has always been yours, but now you are forever his. CONGRATULATIONS 👏🎉🎉", "You're adopting a child while knowing fuck all about them 👏🏻👏🏻👏🏻", "NTA exactly. Insta and tic Tok have left people to view things as a photographic moment. I'm sure she thinks she means well and if she was close to the child, if she'd been along the journey with them it would perhaps be different but what's extra special for some is normalcy for others.  I raised my nephew and we'd get the odd school teacher who would say to him aren't you a lucky boy! No, no he isn't a lucky boy. He is a child with a parent and wants to be the exact same as his peers. Not special or different, not lucky or grateful. Just a kid and their parent (s)", "I mean those grunts 15 year olds are fond of making can make their opinions perfectly clear hahaha", "Thank you. I don’t get the no asshole here, OP is giving me big AH vibes. I understand not wanting the teacher a part of a personal event, but being so aggressive and fucking rude about it? Ever hear of having tact, OP?\n\n\nProbably the same type of guy that would whine if a teacher didn’t give his kid enough attention. Also, I’ll put money down his kid is not the cutest in the class.", "Fucking yes. OP, YTA all the way.", "I thought that was really weird wording, too. As a parent, it jumped out to me. My kids don’t “belong” to me. I mean, sure, they are mine…as in they are my kids…\n\nBut I do know many parents see their children as property and treat them as such instead of actual people.", "This.  Children are not property.", "AH is the right word.  YTA OP.", "Omg yes holy shit this is why he reacted so wildly and took offense this is EXACTLY how they respond. This comment blew my mind!!!!!!", ".", "Yea, this. I'm friends with my grade 1 teacher on Facebook. I remember her very well.", "I e seen adoption finalizations where the teacher brought the whole class on a field trip to celebrate with the parents. It was amazing and touching.", "Yeah, OP is very weirdly hostile. I agree with the YTA judgment", "Okay no, buzz off with that nonsense. Plenty of people who are neurotypical are like this, and plenty of people who are on the spectrum (like me) are not like this", "Most public schools in the US don’t include religion in a significant way because there is division of church and state. I’m not sure where you are.", "Instruction from the teacher you think has malicious intentions for your son?", "Wait I thought the teacher wasnt important?", "instruction from the teacher you hate?", "But you said she doesn't spend any time with him, so which is it?", "Adoption does change the legal status between child and parent so it is important—", "How is offering support from his community or from her “nosy”? She asked no questions about his story. She offered support, it was declined, she offered a less intense alternative, and was suddenly on the receiving end of vitriol", "He’s absolutely the AH here. All he needed to say was, Xander has been my son and knows this for a long time- this court date is a technicality. Please do not do anything to bring attention to it thank you \n\nBut no. She offered support and was rebuffed *as though she had negative intent*. \n\nShe wasn’t pushy. She offered support, an alternative, and that was fine. It was OP who *went off* and insinuated she was somehow being selfish lol\n\nOP it is possible to advocate without being an AH.", "I would not need to ask my child to know this.", "Because it’s speculative and unnecessarily rude. Why attribute such malice to the teacher? There’s no indication she wanted to do anything other than support her student. \n\nWhat, any time a teacher is nice it’s because they want attention on themselves? Come on. \n\nOP seems like a dick, not for not wanting her support, but for how he dealt with turning it down.", "> Someone's nice gesture isn't when its unwanted and without consent.\n\nBut she didn't *do* the gesture.  She literally just asked for consent. She did precisely what you suggested she should have done.", "That’s understandable, but the teacher has only asked if she could do this gesture. Sounds like she hasn’t done anything yet.", "Not only that, I don’t trust that the teacher would not just be doing it for clout.", "As a veteran teacher I agree completely. She overstepped her bounds, professionally and socially.", "I disagree. Teachers are very meaningful adults in the lives of children, and showing their students support is a big part of the job, especially at the developmental stage second graders are in. It’s a bit different since it’s so early in the school year and the teacher and Xander haven’t really had time to build the relationship, but if this were happening in October or so, I wouldn’t think this was inappropriate at all.", "Her wamting to go to the court struck me as very odd, tbh.", "Lol it is not at all comparable to asking to be present at someone’s medical event. \n\nAnd a teacher asking if the parent would like their child’s community- their peers and their teacher- to celebrate this, that’s not for social media that’s just…a compassionate teacher. When that was declined, which I also would have done, she offered her support in a more personal way….\n\nAnd faced straight up vitriol. \n\nIt may be early in the year but this is going to be a significant adult in this kid’s community. \nSo she offered compassion and recognition of this event. \n\nIt’s ok that it was declined. The issue is how OP declined. \n\n**It’s like people forget that some teachers are in this for the right reasons and are compassionate and offer their support with significant family or home situations.** That’s sad.", "He’s not an AH for declining. \n\nHe’s an AH for attacking her and questioning her motives", "He’s an asshole for the way he spoke to her and assumed ill intent on her part, not for his decision.", "Yeah, \"the teacher isn't important to the family\" is not only mean but it is untrue.  During school hours, she is *the* adult figure in his son's life.  Which is why kids often form attachments to their teachers.\n\nI had two good parents, but the teachers I had growing up were still important to me.  I could tell them stuff I couldn't tell my parents.  They gave me attention when my parents were sometimes too busy to.  And they would look out for me like caring adults are supposed to do for kids.  The OP just pissed on all of that.\n\nYTA, OP.", "The entire tone is so oddly harsh. I’m curious if Xander is actually as aloof about this as OP is or if he‘s just following the adults lead.  Maybe the teacher notices something about Xander the OP is brushing off, like a sense of excitement for a big event or sees Xander enjoy celebrations when in class.", "If Xander has been going to the same school for two years, he may have friends in his class that want to celebrate as well.  The teacher could just be speaking for them.", "He said no the the party then she tried to invite herself to the court hearing. I would say that's trying to steamroll.", "I meant if she did force it. No harm in asking. It's pretty normal to want to celebrate a good l thing like this when she probably knows how bad it could be. So no, asking isn't forcing. \n\nWe don't pay teachers enough for the shit they see and deal with.", "If she ignores his clearly expressed wishes, that is forcing. Asking is perfectly logical and the right thing to do. But if she were to continue after being told not to, then she's deciding for him what's appropriate.", "/wave.", "And they dont understand the actual importance of a supportive educator...", "THIS IS THE ONLY QUESTION!\n\nOur kids wanted us to send cupcakes to their class so everyone could celebrate with them... getting a new puppy. Some kids like to celebrate & some kids don’t. Shouldn’t the 7 yo be able to have a say here.", "The teacher wanting to come to the adoption ceremony is 100% making it about her - as OP says, this is a family event.", "She wanted to take time off work — is that not pushing the boundary", "No, not all 7 year olds like to be the center of attention and celebrate with their friends.  Op knows Xander best.", "This would have been my personal worst case szenario..", "Ask the kid", ">7 year olds like to be the center of attention\n\nGood god. I'm glad you weren't my parent", "\n\n>7 year olds like to be the center of attention & celebrate with their friends\n\nthat's quite a broad reaching statement that isn't true of all, or even most, 7 year olds.", "Not all of them", "She isn't important to the family. She's the kid's teacher, and that's it. I'm a teacher and it's very easy to think you're more involved in your students' lives than you actually are.\n\nThere's absolutely no reason for her to be at the adoption ceremony beyond her desire to \"be involved\". This is a moment for the kid and his family.", "Celebrating a family isn't inherently about saviorism or commodifying kids. Good grief.", "A lot of people don't tell people they're adopted because it becomes a label. Hes my dad. Period.", "That was my impression. \n\nThe son already feels a full member of the family, OP is already his dad so from his perspective, nothing is changing.\n\nIt's boring grown up paperwork at the boring courthouse. \n\nMy brothers in law adopted my two nieces from foster care after 4 years.... and they reacted pretty much just like OP is saying his son feels. They were a bit younger when the adoption became official (6 and 5) but their dads had always been their dad's as far as they were concerned, this was their family before and it's their family now. Nothing in their world changed for them.", "Our kids are very close in age (now 26,26,28,30) so we spent (seems like) 50 years of living with teenagers in our home. We usually got no reaction or an overreaction on a daily basis.", "It's my least favorite thing about this sub - how people justify rudeness with \"you owe no one anything, even basic kindness, especially if they accidentally cross a boundary they didn't know you had.\" This intentional lack of grace and tact in interpersonal skills is self-sabotaging in the long run and really speaks to the overall emotional immaturity of this sub.", "The problem isn't the fact he declined, it was his superior attitude and condescending tone of his post. \n\nBoth his comments;  how his kid is the cutest one in the class & how the teacher is of no importance, are pretty big red flags that he's probably got narcissistic tendencies.", "He could’ve gotten his point across a million different ways, but he chose the way of a narcissistic AH. Just calling it how I see it 🤷🏻‍♀️😂", "My older brother died right after I graduated high school. The kindergarten teacher who taught me and my younger brother came to the funeral.", "\"I really appreciate your offer and it's sweet of you to ask, but we would like to keep this event low-key and private\"\n\nHow are you responsible enough to adopt a child, but haven't figured out the very basics of deflecting a well-meaning, but slightly pushy person.  This is about the same difficulty as refusing extra food when you're full at grandma's.  Actually grandma might be more difficult.", "She's important for teaching, but not for intimate family moments. This thread is wild. He's not saying teachers aren't important for anything, but y'all are acting like this is his kid's favorite teacher that he loves. School JUST started. The teacher JUST met the kid.", "A lot of parents will assume things incorrectly about their children and their wishes throughout their life. There is literally no downside to asking. Put the stubborn pride away.", "It’s like they didn’t even read the post, they just jumped down to the comments and started going", "She hasn't done that specific gesture, but she was told once already not to make a big deal of it, and then immediately came up with another, even more personal plan to make a big deal of it by showing up to the adoption proceeding. It doesn't sound like she's the type to take no easily.", "She asked and was told no so that should be end of story.", "They aren't the AH for declining, alot of comments were saying she's was just being nice.  That is why I added my response.", "This, I experienced so much self serving niceness when I was in foster Care. None of it was genuine, and it was largely self serving.  Actually has someone say I was their ticket into heaven  . . They didn't accept my placement because they genuinely wanted help. I aged out before graduating hs and was constantly told that little bit of money not enough and that their done after hs. So I'm very warry of these performative niceties.", "Seriously? Is everyone here such a fucking cynic? Theres no chance this teacher actually cares about her students and is happy to see one whos gone through the foster process actually make it out of the system?", "But not really the parents and this is about OP and his son's relationship. She doesn't really belong there", "Hey quick question. Am I surrounded by robots who think every personal decision should go through a commity of public morality.\n\nAnd if you are feeling shitty about doing something, maybe you should take a second to exam that before posting on Reddit whether or not someone is an asshole.", "Okay fine but OP specifically stated his kid is not the type to be happy to see his teachers outside of school. All this extra dialogue is irrelevant.", "Her motives don't matter. He said no and she didn't listen and tried to continue with what **she** wanted.\n\nNot her kid, not her adoption, not her life.", "After I have repeated myself and you continue your behavior. I will raise my voice at you, but that doesn't make me an asshole, it makes me mad that you are continuing to ignore me when i say you aren't wanted in this situation. \n\nYou don't get to involve yourself in others' lives and then play the victim when they shut you down, even if they are aggressive in their actions. You initiated the fuck-up, so you're the asshole.\n\nIf OP told her off right away, he'd be the asshole. But, he said no and she didn't listen. **That** makes **her** the asshole.\n\nOP is curt, but that doesn't mean anything when she won't take \"No\" for an answer. He's not one of her 7yo students. He's allowed to say No to her.", "Heck I’m 31 and I can remember all my teachers names from before 6th grade and how I felt in their class.", "Invite herself to the court hearing and bring a small present of some kind.", "She asked about a party, he said no. She asked about a completely different way of celebrating by going to the courthouse, he was a dick in the way he said no. It’s not like she asked him multiple times and wouldn’t take no for an answer; she asked two separate questions.", "Smart kids, sounds like they found a cupcake loophole lol\n\nPrior to COVID for a bit we did stuff like this at work (healthcare) make up off the wall stuff and bring in cupcakes. The higher ups didn't want us to keep food in our area but were ok with celebrations.", "Her offering the party beforehand, I can see that as being an ok gesture. She was told no and that the 7 year old wouldn't like that sort of thing. She then kept going with insisting and suggesting ways for her to be apart of it, that's where she's the A H. Plus nowadays idk if I would trust someone to do something like that and not try to post about and talk about it everywhere, let kids have privacy, especially something as big as adoption.", "Yes 100%. I feel like people are missing this part. That’s next level crazy to me.", "Absolutely! Especially true of 7 year olds who may have some trauma in their past. (not specific to this story since we don’t have any background, but often true with many kids who are “in the system”)", "Yes sure, but the Info question remains unanswered. Did he/she ask their son what he would like?", "I agree, but all OP had to say was: I appreciate the thought, but I think kiddo would feel singled out.", "I disagree, teachers have a huge impact on children. Kids spend more time in class that with their parents. The teacher could have no meaning for OP but that doesn't means it's the same for his son", "This attitude is so shitty and toxic! Even just calling a teacher unimportant is fucked, especially after multiple comments indicating that he wants his kid in class and not missing school. Her intentions are misguided, but this dude is presumptuous af.", "I didn’t say it was. If the family wants to invite the whole class to the adoption proceedings and everyone is happy about that, then great. The problem is assuming that that is the default and inserting yourself into the family’s plans without invitation.", "But it can turn into that, and the teacher showed that she buys into that crap by telling OP what a wonderful person he is for adopting.", "Exactly. Most kids just want to be “normal”. They don’t want to be othered.", "Mine are 15 and 12 at the moment. So I am very familiar with that situation haha", "My guy, you are speaking my thoughts this morning. This sub honestly makes me laugh hysterically but also sad…to think that so many people not only agree with OP or any other person in the wrong, but they feel the need to share how much of an asshole they are as though they’re proud of it. \n\nOP of this post was evidently jerking himself off while writing this out trying to paint the teacher in a bad light here.", ".", "OP is welcome to have whatever \"celebration\" he wants, but his reasoning for it is bananas. He does not have the child's best interest in mind, period. There is a reason why there are *thousands* of kids who were adopted by their foster parents but end up back in the system. My state alone has at least 1k. OP should be opening his arms up to anyone who wants to show support to his kid, especially now, but he is ignorant to appropriate relationships and boundaries. His attitude will only hurt the kid. \n\nHe doesnt need to have a public party, but he especially doesnt need to be a dick about it. Sabotaging his relationship with his child's teacher is irresponsible parenting.", "Teacher \"Oh great, should I do an event with the class?\"\n\nOP \"No thanks. We don't want to make a big thing out of it.\"\n\nTeacher \"Ok. If Xander would like, I could come to the adoption ceremony.\"\n\nOP \"We're going to keep it small and low key.\"\n\nTeacher \"Ok.  I'm so excited for Xander. I hope you two have a great day.\"\n\nIs that so hard?  How was this anything but polite?  How is she making it about \"her\" and not Xander?", "It quite literally IS the end of the story.\n\nWhat on earth is going on here?", "His teacher of 3 weeks is that invested in his adoption that she is trying to change the way the family wants to celebrate it. That’s not cynical, it’s just not being an idiot. \n\nIf there was a longer term relationship there AND if the family/child wanted him that’s fine! But pushing your way into an incredibly private moment with virtual strangers is absolutely an AH move. Downvote away!", "I literally shared why I'm early of such things as somewho spent a decade in foster care and was emancipated from it. Reality is not everyone is nice for nice sake. It's the feeling they get from it, without taking into account the person they are allegedly doing something for. Xander family didn't see it as nice, abd rejected it  as they should have. Maybe another kid and family would appreciate it and that would be OK in that situation.", "That’s the situation and that context matters. \n\nThe issue is that OP assumed negative intent and got extremely aggressive and insulting with his wording after his child’s teacher offered 2 options of support **and did not get pushy or insistent* which is why this dialogue matters. \n\nHis decision was fine- it’s the right one for his family. \n\nHis actions were not appropriate. \n\nHe acted like her **offer** was not appropriate. No- it’s just not helpful or wanted. There are better ways to communicate that.", "Yeah, she has probably seen the videos where the teacher and whole class come to the proceedings to celebrate and wanted to have a feel good moment/video doing as such. It's perfectly within OP's rights to keep it private, although it sounds like he could have been nicer about it.", "I’m hoping he meant to say “belongs with me” and didn’t realize how ick it sounded with a different preposition? 😬", "Yea that part gave me the ick too.", "Agreed. That gives off creepy vibes.", "personally, that just sounds like you overthinking that single line and making it something it wasn't", "Super bothered by this also. Makes me actually question OP's motives for fostering.", "Same. I hated attention as a child", "Same, I would have been embarrassed and super uncomfortable.\n\nNot everyone reacts the same way to focused attention like that. Especially for something that makes you feel different and singled out with a possible side of trauma mixed in ( we have no idea how he came to be in foster care) and the uncomfortable comments and questions that might come up from other 7 year olds.", "School just started. Let's assume the kid's actual parents knows him and his wants better that someone who met him a week ago.", "Sure they can and do have a big impact, but they don't have any place going to the adoption ceremony. That's a family affair, and she's overstepping what should be the boundaries of her relationship with the student by wanting to go.", "There's one AH in this story, and it's OP for talking to the teacher the way he did.", "...she....she asked????? How is that inserting if you ask?????", "Thank you. That was exactly my point.", "Totally agree, just because you don't have to let the teacher celebrate and support it doesnt mean you're not an asshole for telling her shes not important and to go away", "It’s wild to me because it tells me how many people are (or close to) being terminally online. The teacher is asking to celebrate a big moment, and show her support. Asking, not doing. Politely decline and say “we are a pretty private family, and we already have a close-knit celebration planned. We don’t want to make him feel like he’s different. We appreciate the kind gesture, but no thank you.”", "\n“I give the benefit of the doubt that she means well but to be blunt, she's not important to our family. Therefore this whole thing is none of her business. I don't know anything about her and she knows very little about us. Plus my son is NOT the kind of kid who would get excited at seeing his teacher outside of school hahaha. I could tell she was hurt.\n\nI get it. My son is the cutest kid in her class and all of his teachers liked him. It would make Mrs M feel good to do these things when I'm trying to keep things as normal as possible.”\n\nThis whole section, screams narcissist. “Oh, my kid is the cutest, everyone likes him. so of course you want to do this but no, you’re not important to our family.” \n\nA simple no thanks would’ve sufficed. But since he’s a narcissist, that wouldn’t do 😂", "The kid wasnt asked at all about this though, and if you read OPs responses he literally refers to the child as being his property, he owns them. I dont know how people can read what a smug asshole OP is acting like and instead choose to jump all over the teacher asking (not actually doing it) to do something they perceived as nice for the kid.", "I’m replying specifically to someone who is talking about teachers showing support, and pointing out OP’s kid specifically doesn’t want to share moments with teachers outside of school. I absolutely agree with what you’re saying but it is not at all what I’m discussing or referring to right now. I’m literally only speaking on the subject of involvement outside the classroom and what that might not look like for Xander and Xander only.", "Absolutely. I do wonder if he asked the kid what they wanted though", "I’m hoping he meant to say “belongs *with* me” and didn’t realize how ick it sounded with a different preposition? 😬", "I got a whole “Matilda” vibe. Teacher is Miss Honey.", "Are you adopted?  Because, as an adoptee, knowing you belong where you are, family wise, is literally the best thing ever.\n\nDunno if having a party or something at school is suitable, but, my parents used to celebrate my sister and I's adoption anniversary.", "Perhaps OP is just a bad writer. Yes you’re correct... it’s just my personal opinion. I just don’t like the way he phrased that sentence. Could mean nothing. I just can’t imagine saying or thinking that about a child (I have 4). It’s a strangely possessive statement. In my opinion.\n\nHe knows he’s my son makes sense to me ... He knows we are a family makes sense ... even he knows he belongs with me would be okay. He belongs to me .... ugh. I just don’t like it.", "Oh my god grow the fuck up. Not everybody can be eloquent on the internet.", "Same and I still do. Birthday parties with a lot of kids singing Happy Birthday to me? Oh god just end me already, it’s misery", "I remember at my son's 2nd birthday he cried when everyone sang 😅", "Do we know if his classmates even know he was being fostered?  Kids can be cruel and he may want to avoid all the remarks about why his \"real\"* parents didn't keep him.\n\n*\"real\" in quotes because the people who love you and raise you are your real parents.", "Absolutely! I will also assume the teacher meant no malice & was just trying to offer her help", "Ah yes, OP is horribly abusive to his child because he worded one phrase strangely…", "i don’t want to minimize your experience but “belonging” * in * a group is not at all the same as belonging * to * an individual", "But he didn't say anything about the family belonging. It was literally \"he belongs to me\".", "I don’t know .... “he belongs to me” is not really a term of endearment.\n\nOnly time I ever said that is when my kids got in trouble & I had to claim them ... “that one belongs to me”", "people on sub get hung up on the dumbest crap.", "wut", "Especially not serial killers", "OP projects that his kid is the cutest. We have no reason to believe the “nefarious teacher latched onto the cute kid and then pushed her way into a celebration where she wasn’t wanted.”\nA teacher heard one of her students was having a positive life event and offered to support and celebrate that. She was rebuffed by someone with a totally asshole tone and didn’t push after that. OP is a massive AH.", "I do see the harm.  She wasn’t invited, she invited herself.  OP is NTA.", "And the whole asking to be there? WTF?  Really inappropriate.", "It’s my personal opinion .... I think it’s strangely possessive. I don’t like it.", "Except when it is.\n\nAgain, if you aren't adopted, you don't get it, how you read it doesn't remotely matter.  What you are doing is putting your own mistaken assumptions and personal bias onto a situation you have zero experience of.\n\nNo different than saying \"My heart belongs to you\".  Most people aren't going to think that means the other person owns your heart, that you've made it property.\n\nSame here.  Nuance is important, kids.", "Maybe he is a single parent adopting?", "So?\n\nYou don't have any sort of special talent to pick out teh hidden meaning in OPs comments, bud, just for creating mountains out of molehills.\n\nThe only reason you think he sees the kid as an object to own is your own bias and thirst for upvotes.", "It makes me think OP had the goal of adopting, not fostering. ☹", "I don’t know. OP’s attitude just seems off to me. It’s just too aggressive & it doesn’t match what is happening. It’s very strange. I think the teacher may have her own motives & they may actually be caring about this kid. \n\n“I get it ... cutest kid in the class” ... I highly doubt that’s her motive. But I certainly have been wrong before."]}