{"id": 25573, "submission_id": "1620uud", "title": "AITA for calling my uncle an asshole?", "selftext": "Context: I, 24 F, have a sister who is 17 and will be graduating high-school this year. Unfortunately, she is terminally ill. Although my family is devastated by this news, we still want her to be happy and behave as a normal teen would. \n\n\nA few days ago, my family hosted a get-together and most of the family came. It was going great and all was well until we sat down to eat. My grandma had asked my sister what colleges she wanted to apply to and as my sister started to list them, my uncle interrupted and said “I’m sorry, but what’s the point on wasting money on college if she’s not going to make it through all of it anyway?” \n\nMy uncle and father were the only ones laughing and i noticed my sisters face. She looked very hurt and didn’t find it funny. She then got up and walked into the kitchen. \nThat is when I got upset. I told my uncle that that was the most idiotic thing he say and that he was an asshole. I then went to console my sister.\n\nThe next day, my grandma gave me a call and said that my uncle said that he was making a joke and did not mean it that way and that I should apologize. I told her that the joke wasn’t funny and that my sister does not like to think about it and that HE should apologize.\nMy mother thinks that although the joke was distasteful, because he is my uncle and he is an adult I should not have said that. The rest of the family agrees with her.\n\nMy uncle sent a message saying that he did not appreciate what I called him and that he did not mean it that way. \n\nI do not agree with my family and i think my sister deserves a sincere apology, but i’m starting to think that I could’ve left it at him being “idiotic”.  \nSo, am i the asshole?", "created_utc": 1693070140, "permalink": "/r/AmItheAsshole/comments/1620uud/aita_for_calling_my_uncle_an_asshole/", "score": 84, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I called my uncle idiotic and an asshole.\n2) Because he is my uncle and I should respect him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \"You'll be dead within four years\" is not a joke. It's simply cruel. He says he didn't mean it \"that way\"--well, in what way did he mean it?\n\nYou called an AH an AH, and that' okay.", "NTA. What an incredibly insensitive thing to say to young woman who isn't going to be able to live out her whole life. Your uncle is TA and you were fully justified in what you said. Just because he is an adult in your family doesn't mean he gets a free pass to talk to people like this and as a \"joke\" this has got to be one of the least funny things I've ever heard. The fact that your dad also laughed is outrageous (I'm assuming you and your sister have the same dad but even if you don't, that's still gross). Your grandma also needs to step off with defending him because from my perspective, this is indefensible behaviour. \n\nAlso, while you're involved in this dispute with your family, please remember that, at 24, you are also an adult and can speak your mind whenever you choose, especially when you're standing up for someone who isn't in a position to stand up for themselves. I hope your sister is OK, and I hope the times ahead aren't too hard on you both.", "My first comment got removed because I called the uncle some not so nice names. You are NTA and if anyone says he was joking ask them “what was the joke?”", "Yes, absolutely, your sister deserves an apology.  Everyone but you and your sister in your family have a warped way of looking at things.  The uncle was in the wrong for saying such a tasteless, heartless, really repulsive thing, and it matters not that it was meant as a joke.  In fact, that makes it worse because \"who\" with two brain cells and an actual heart would make a joke of such a thing.\n\nYour father laughing at it makes my blood boil, as this is his own daughter that the uncle was referring to.\n\nYour grandmother and mother . . . I just don't have words for them.  The fact that their warped logic would entail you apologizing to someone merely for the reason that they are your elder makes no sense.  I can't think of something more ridiculous, to be honest.  An appropriate analogy would be if the uncle had punched you in the face in an attempt to mimic the antics of The Three Stooges, and when you reacted in horror and anger, as you should, everyone in your family says it was merely a joke and you owe your uncle an apology because he is older than you.\n\nApologies are not based on age, or in your family's case, one's level of stupidity.  They are based on the situation, event or person deserving of an apology.\n\nEveryone should be treating your sister with kindness and empathy.  There is absolutely NOTHING in her situation that warrants a response of a hurtful comment in gest.\n\nPLEASE show your family this response and every other one that will no doubt side with me, and please know that you have my admiration for standing up for your sister, and putting those idiotic, so-called \"adults\" who are completely devoid of empathy in their place.", "You think your uncle was an AH and not your father? Actually, I think your father was the bigger AH for not shutting down your uncle. This was his DAUGHTER!\n\nAnyway. no you're not the AH. Your uncle is. Your father certainly is.", "In no one’s imagination could that be remotely funny.", "NTA, also the \"he is an adult\" comment as if OP isn't 24? Jokes are only funny if everyone is laughing. This is the opposite of funny, and everyone who laughed or excusing the uncle are major AH.", "You did not do anything wrong.  That makes you not the asshole.  Continue to stand up for your sister ‘cause she’s going to need people in her corner.\n\nNTA but INFO (if you’re able to share and comfortable sharing):  What terminal illness?", "NTA. It doesn’t matter that he’s an adult. The only way that should be relevant is to further prove how immature and cruel he behaved, and not as an adult should. It isn’t his business whether or not she goes to college, and the fact that she started to list them means that she absolutely wants to. I respect the hell out of you and supporting her choices in life. Your sister definitely deserves an apology from him, and based on the responses, from the rest of the family as well. The only AH here is your uncle.", "NTA—he’s the asshole and you were accurate in saying so, the Internet has spoken", "NTA. DO NOT APOLOGIZE!!!! There was nothing funny about what he said and he is exactly what you called him. Tell him your sister doesn't appreciate what he said and would like an apology. You and your sister should refuse to have anything to do with him until he understands what he said was not funny and was not a joke. Best wishes for your sister's comfort and I'm sorry this is happening to both of you.", "NTA.\n\nA joke to you isn't a joke for everyone. \"To relax,  you where only joking\"", "I am so so sorry for you and your sister to be related with a bunch of unsensitive tools.\n\nI hope your sister will get into the university of her choice and she'll enjoy it to the max.\n\nNTA\n\nIt's great your sis at least has you to be there for her.", "NTA. What possible way could your uncle have meant that joke that would be acceptable? Ask your grandmother to explain that to you, and every time she tries to get around the question, saying, \"oh well, he just,\" repeat the question again; How is it funny that my sister will die before she can graduate college? What part of her dying is funny?", "NTA\n\nAt the least, you're allowed to feel about his \"joke\" how you feel.  At your age, you get to make your own decisions.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nContext: I, 24 F, have a sister who is 17 and will be graduating high-school this year. Unfortunately, she is terminally ill. Although my family is devastated by this news, we still want her to be happy and behave as a normal teen would. \n\n\nA few days ago, my family hosted a get-together and most of the family came. It was going great and all was well until we sat down to eat. My grandma had asked my sister what colleges she wanted to apply to and as my sister started to list them, my uncle interrupted and said “I’m sorry, but what’s the point on wasting money on college if she’s not going to make it through all of it anyway?” \n\nMy uncle and father were the only ones laughing and i noticed my sisters face. She looked very hurt and didn’t find it funny. She then got up and walked into the kitchen. \nThat is when I got upset. I told my uncle that that was the most idiotic thing he say and that he was an asshole. I then went to console my sister.\n\nThe next day, my grandma gave me a call and said that my uncle said that he was making a joke and did not mean it that way and that I should apologize. I told her that the joke wasn’t funny and that my sister does not like to think about it and that HE should apologize.\nMy mother thinks that although the joke was distasteful, because he is my uncle and he is an adult I should not have said that. The rest of the family agrees with her.\n\nMy uncle sent a message saying that he did not appreciate what I called him and that he did not mean it that way. \n\nI do not agree with my family and i think my sister deserves a sincere apology, but i’m starting to think that I could’ve left it at him being “idiotic”.  \nSo, am i the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "[removed]", "nta - nobody in their right mind would joke like that except for someone that has no class or empathy.  and worse is having ppl laugh right in front of her.  the fact your mother and other family members defend says something about them too.  im sure if he was the one terminally ill and someone made a joke liket hat he would be livid.  its amazing how some ppl cant read the room.", "NTA. He IS an AH for what he said. What he said was disgusting and very hurtful. Being family and/or an adult is no excuse. He needs to take what you said to him.", "This is a great example of please share the responses here with your family. Again NTA and your uncle sucks. He should not be invited to anything your sister does.", "I am glad you saw your sister was hurt and you halve your back.\n\nI agree with everything you said and did.\n\nNTA", "NTA. Especially since lots of people outlive their prognosis. Somebody needed to call him out for being lower than whale shit. Your dad doesn't win any prizes here either. I'm so sorry for you and your sister for having such a garbage family. How dare they defend his behavior.", "NTA!\n I HATE when people say something horrible, then when called out on it, everyone blames the person calling it out as being the asshole.  \nIt's like what the ever loving hell.\nI also think that people who tell a \"joke\" then when someone gets upset or offended, they use the excuse \"You shouldn't get mad, I was only joking!\"\n\nI don't know if this has been said already, but call your grandma and Uncle back and tell them both that your Uncle's \"joke\" broke your sister's heart and that YOU were the one consoling her.  \nI would also ask them what they would have done if a random person had made this \"joke\" if it would have been as funny?", "NTA that's fucked your sister knows she's going to die soon and doesn't want to dwell on it and now your laughing at her expense also what kind of father would laugh along with if my brother or bil said something about my children if they were ill I would've given them 5 seconds to get their shit and leave before I smack the fuckin taste out of their mouths calling him an asshole shows you have more restraint than most", "Your uncle's an asshole. It was a joke at your sister's expense, and it sounds like no one but you stood up for her. \n\nI come from a culture where family will take the absolute piss out of you, even if it hurts, and laugh like hyenas. If this happens, you gotta laugh at yourself twice as hard or stand up for yourself. \n\nExcept in this case, if I were the uncle and read that the joke wasn't funny or distasteful, I'd swallow my pride and apologise sincerely. Instead, they expect an apology without accepting what was said was crossing a boundary which you established then and there. Good on you, you're a good sister. NTA\n\nOn another note, I personally think it's an asshole move for your uncle and family members to expect an apology, spout excuses and not accept what happened and simply move forward in this scenario. Really gotta set the examples better, this isn't how leaders lead.", "NTA fuck your uncle.", "He was an A H. The butt of his joke wasn't laughing, so it was cruel and bullying, not humor. He really doesn't owe you an apology, he owes your sister a HUGE one though.\n\nNTA\n\nAlso, what happens if some medical miracle happens and she survives. She will need her social network and education to move forward.", "I just don’t see what part of his comment could be taken as a joke, I would ask him to explain how he did mean it then because I just don’t see what could have been taken the wrong way. I would never apologise to him, you called him an AH, if I was you that would be mild to what I would say to him. NTA you’re not in the wrong in any way.", "He didn't mean it in that way? Okay what way did he mean it then? The dudes a complete asshole and anyone taking his side is also an asshole. Do not stop standing up for ur sister and do not apologize for standing up for her! NTA", "Your uncle, father, grandma, and many other people in your family are dicks.    \n\n\nIt was an awful thing to say, this post is gonna be filled with similar replies against them, by a large majority.    \n\n\nYou have nothing to apologize for, and they have everything to apologize for, and they are \\*ssholes for saying that, and he's supposed to BE an adult, not a 11 year old unsocialized little brat.", "‘because he is my uncle and he is an adult I should not have said that’   OP you are an adult as well and called him what he is.  He hurt your Sister, and btw Dad isn’t much better for laughing as well. NTA", "Your uncle is totally the asshole.  What a sick joke!", "NTA. Tell your mom a real joke would be calling the uncle a good person. Then ask if she can see the difference. \n\nYour sister is going to need people who actually support her. Be there.", "NTA. Your uncle was out of line and he’s remarks were uncalled for….he is TA. Your grandma should have stayed out of it she’s TA too.", "NTA, at all.  What way did your uncle mean this \"hilarious joke\"?  What a cruel, thoughtless man!  A 17-year-old-girl is dying, so that's all she should think about?  I can't even!  I am so sorry your sister is going through this, much less that she is going through this horrible thing surrounded by people that say such awful things to her!", "[removed]", "NTA - he's an obnoxious shit and she wants to hold on to the future even if it doesn't happen. Good for you supporting her.", "You're also an adult. Your uncle is an asshole.", "NTA- what he said was heartless. People aren’t entitled to respect just because they’re old.", "NTA \nthats not a joke and not funny.\nYour uncle is a MAJOR asshole. The comment is simply cruel. She's already struggling with the fact she has a terminal illness and he just had to give her that cruel reminder? Fuck him. Your sister deserves an apology.", "NTA I would argue that your uncle and your father are more than assholes though.\nYour uncle for what he said and for not apologizing but trying to justify what he said by saying it was a joke; even if he really thought it was a joke (which is unlikely to me because, unless he spent his life under a rock, he should know that you don’t joke about certain things), he should have apologized THE SECOND you called him out.\n\nYour father laughing along is just as bad: he didn’t call him out and he laughed.\nAbout you uncle hinting at his child dying in less than 4 years.\nAnd he didn’t call him out afterwards either.\nYour mom and grandma are way out of line as well: your uncle should be the one apologizing to your sister and it should be a really really good apology, not one of those fake ones.\nProps to you for sticking up for her though!!", "NTA. If he's an adult, then he should learn to act like one.", "Why exactly would they send her to college though?", "Nope. NTA. Not even a little bit.", "Nta go harder, your uncle and your family are wrong on this. You shouldn’t care about his feelings when he doesn’t care about your sisters. \n\nI would 100% call him back and lay into him again about how disgusting his words were and karma has a way of teaching people the error of their ways.", "NTA. Your uncle was a huge one with that remark.", "Fuck that guy - joke? Where?  Heartless bastard.", "NTA. Just cause he doesn’t like being called an ahole doesn’t mean he isn’t one. Maybe if his mother or other family members were hinest about his behavior with him earlier in life he wouldn’t be such a jerk. Good on you. This would be a hill to die on for me", "Read the post and thought “Oh my god.” \n\nThat’s EVIL!!!!! Her sister is a teenager for fucks sake who’s terminally ill and that’s bad enough, knowing you won’t have a too long life. And then the uncle comes around and makes a so called joke “yeah…. But she’ll be dead therefore a mOneYbuRDen…” Urgh. Disgusting. And then her FATHER laughed as well!!! That poor poor girl. The uncle should apologize, that’s the BARE MINIMUM! To think this is something even near to a joking matter…. How little empathy can you have???", "thank you! i appreciate it.", "To be fair, my father is not the one who said it. But yes, he should not have laughed", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You're an adult , too. Teach the people in your family you mess with the bull you get the horns. No apologies or follow up questions!", "Which is why he's the bigger AH. He laughed AND failed to shut down your uncle.", "NTA, your father is an even bigger asshole for laughing along. Grandmother and mother are also assholes. Idiotic is the kindest word you could have called your uncle. I've got a few others in mind.\n\nFrankly all the adults are horrible people. This was a grown man telling a child who is terminally ill not to bother living what little she has left of her life to the fullest.\n\nYou're the only adult to have reacted appropriately.", "Always respect your elders even when they are hurtful ass clowns. /s\n\nThis behavior by your uncle is just gross no matter how culturally unacceptable your response was.", "NTA. Who says something like that to a terminally ill person? An asshole. And him trying to play it off as a joke is idiotic. I think you were remarkably restrained in calling him an idiot for telling a distasteful \"joke\". If it were me, I would've called him words not suited for the ears of my 2-year-old niece or my BIL's aunt (she's older).", "NTA- i don't care if he's an uncle and an adult. He behaved like a heinous asshole and deserves to be called out.", "I’m sorry but what’s the point on apologizing if he is an asshole anyway? What a insensitive and inconsiderate thing to say to someone going through this. You’re NTA.", "NTA. You managed to stick up for your sister and her feelings when her parents and grandmother failed her. And you did it without violence, which I am not normally one to use, but your Uncle would have made me see red with that statement and my sibling upset.", "NTA. That title goes to Uncle", "He is the asshole cause u called him the arsehole 🤦‍♂️", "I would respond to your uncle by saying “I do not appreciate what you said and that I most definitely meant what I said” \n\nThis girl is DYING. who makes *jokes* about someone’s life like that!? \n\nDo not cave on this. Don’t apologize. Your uncle is an asshole and so is your dad for laughing. \n\nEveryone here (besides you) owes your sister an apology", "Your uncle is a huge AH.  I'm glad your sibling has someone there to look out for her.   It's up to her to make jokes or be light hearted about it, most aren't and it's terrible to direct their thought toward the end of their life.\n\nAlso: you're an adult just as much as he is.   You have every right to voice your opinion.", "ÑTA!! Do not apologize. One has to show respect to get respect. Your uncle is eligible for the AH of the year award. What a horrible, cruel thing to say. There is no way what he said can be turned into a joke. Why is everyone defending him?\nI would have said far worse!\nYour poor sister. Thank God she has you in her corner, the rest of the family is kind of worthless.", "Nta. It was more then just distasteful, and your family even thinking it’s ok is gross. You should tell your mom you are 24 and also an adult and you won’t be apologizing for defending your sister. Also I am sorry for what your sister is going through, and I am glad she has a big sis who will love and protect her until the end ❤️.", "NTA your family seems to already be treating your sister as if she’s dead and no longer around. That joke had no other meaning behind it he’s a complete asshole and your family is as well for trying to back him up. The only way someone like that would understand it would be if they were the ones dying.", "NTA. Your entire family except for sister is. Special shout-out to your loser father", "Omg poor girl i hope some breakthrough in science can save her life and the lives of mamy others in need otherwise i hope she enjoys her life to the fullest.\n\nSidenote: i m sorry for saying this but i personallly dont think college is the best place to enjoy your last years is that what she wants herself or was it just decided by your parents that a normal teenage life is the best thing she could experience? Because college is hella stressful and often times the environment changes people for the worst. I d suggest travelling around the world and seeing the beautiful places this world has to offer. But if that was her own choice then i apologise for talking out of turn", "NTA of course\n\nBut.\n\nMy family does not curse (at least, not when we're all together).  Some people in my family will curse from time to time, but generally?  No.  It's definitely tone policing, but if someone in my family killed someone else at a family gathering and I called them an AH for the literal murder,  I would get lectured.\n\nIf your family is like that, then know your audience.", "NTA and you can tell him the rest of the world thinks he’s an asshole. I would have actually used stronger words, so he should be thankful that’s all you called him. \n\nShame on your family for defending him. And shame on your father for laughing. Sending my thoughts and good vibes to you and your sister.", "YOUR FATHER WAS LAUGHING?!? I didn’t see the part about her being terminally ill, and had to read it again. So basically, your uncle told your sister “Why are you even going to college when you won’t live long enough to finish.”?!? Is this post even real??? Because I cannot imagine a family member being THAT calloused and hateful…", "NTA.  Never was a fan of respect all elders.  Your uncle deserved every word you gave him, and I am puzzled as to why your parents didn't handle his horrid comment.  Anyone who defends him is just as bad as him, including Grandma.", "Is this a cultural thing? Because YOU are an adult. You’re 24. This bullshit of blindly respecting “elders” who happen to act like raging assholes has got to stop. If my daughter were terminal and someone said that to her they would be out of our lives forever. I’m sorry you and your sister are surrounded by careless family members.\n\nNTA", "Keep calling him that. Maybe it'll sink in. It should.", "Maybe I'm reading something wrong but putting \n\n\"Yes, Absolutely\" makes it look like you're saying  \"YTA\"", "The only apology she could conceivably send would be, \"I'm sorry you are so self-absorbed that you actually thought that comment was funny. I'm sorry you can't find it within yourself to apologize to her for what you said. I'm sorry to be related to you. I'm sorry my sister will have that comment on her head for the rest of her short life. I'm sorry she now knows she can't rely on most of her family for support. I'm sorry that I'm the only one to stand up for her against FAMILY. I'm sorry that I'm right, that you are just what I think you are. An asshole.\""]}