{"id": 25674, "submission_id": "1634vq7", "title": "AITA for not letting my struggling sister move in with me?", "selftext": "I (27f) live alone with 2 cats. My sister (35f) has a drug issue for the past 15 years with no intention to give up. She's lived with her partner and their 5 year old for a long while now.\n She's never had a job and relies on government support. Frequently stealing and scamming from friends and family, myself included, to try and get money to fuel her habit. \nI'm always being asked for money thats never returned,, rides (drug runs)  babysitting, things going missing etc. I won't go on but anyone with family members struggling with addiction may know what I mean. \n\nI help when I can but I am broke and struggling with my own ptsd and other mental health issues. She struggles with her daughter and has the 'just leave me alone 'mentality so she just tries to keep her busy so she leaves her alone. She has alot of behavioural issues that she resolves by screaming at her constantly. \n\nRecently they split and she decided to leave the apartment with her daughter claiming emotional abuse, I'm not sure the whole story. She stayed at a few friends houses, her new boyfriend, in and our of refuge centres but all the while trying to ask me to have her come stay with me. \n\nI feel so guilty for not wanting to give up my safe space to become a full time taxi, baby sitter, money giver etc. I can barely afford rent myself and struggling with mental health issues. \nThe money i give her just goes to pokies and drugs all the time. I try to give her food but she always has enough. \nI just ignore her messages when she asks daily for money or whatever. \n I can't do that if she's living with me. I need my safe space.\n\nI should also include previous attempts to help have lead to fights and other family members better positioned to help have offered a space for them but when they set the boundaries of no guests over they were rejected\nAm I the ass hole?", "created_utc": 1693176905, "permalink": "/r/AmItheAsshole/comments/1634vq7/aita_for_not_letting_my_struggling_sister_move_in/", "score": 127, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn't let my struggling sister and her daughter move in to my house with me. Instead she stayed between friends houses, boyfriends, and assistance centres. She has a heavy drug addiction and constantly is using me for money and other things already.\nI should also include previous attempts to help her in situations like this lead to fights due to the revolving door of people she has come and go from the house and other family members who offered to help were rejected when they set boundaries of no guests over.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nThis woman is clearly broken. Letting her into your home will only break you more as well. Deal with your own issues and let her figure hers out on her own. She doesn't seem to want to get better which makes it worse. She's obviously using family and friends for her own benefit.", "NTA. Your sister is refusing the help that she needs and you need a safe space.", "NTA. She is an addict.", "NTA — not for not helping you sister but for not calling child protective services for you niece.", "NTA. You deserve to feel at peace in your own space. And like you said, you’re struggling financially as well. I think that especially if your sister shows no signs of wanting to change, you have to protect your peace. I just wonder if there is another relative or someone to call to help with your niece.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (27f) live alone with 2 cats. My sister (35f) has a drug issue for the past 15 years with no intention to give up. She's lived with her partner and their 5 year old for a long while now. She's never had a job and relies on government support. Frequently stealing and scamming from friends and family, myself included, to try and get money to fuel her habit. I'm always being asked for money thats never returned,, rides (drug runs)  babysitting, things going missing etc. I won't go on but anyone with family members struggling with addiction may know what I mean. I help when I can but I am broke and struggling with my own ptsd and other mental health issues. She struggles with her daughter and has the 'just leave me alone 'mentality so she just tries to keep her busy so she leaves her alone. She has alot of behavioural issues that she resolves by screaming and swearing at her constantly. \nRecently they split and she decided to leave the apartment with her daughter claiming emotional abuse, I'm not sure the whole story. She stayed at a few friends houses, her new boyfriend, in and our of refuge centres but all the while trying to ask me to have her come stay with me. I feel so guilty for not wanting to give up my safe space to become a full time taxi, baby sitter, money giver etc. I can barely afford rent myself and struggling with mental health issues. The money i give her just goes to pokies and drugs all the time. I try to give her food but she always has enough. I just ignore her messages when she asks daily for money or whatever.  I can't do that if she's living with me. I need my safe space.\nAm I the ass hole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta she has no intention of stopping doing drugs.  She will never get better until she changes.  You can't set yourself on fire to warm her up.", "NTA and please don't sacrifice your mental health, money, peace of mind and privacy to enable a lying, thieving drug addict. She'll get better when (if) she wants to, but until that time you need to distance yourself from her.", "NTA-You had me in the first paragraph.  You need to worry about making sure you and your wellbeing and finances are good before you can even think of having the capacity to handle not one but two people and their issues.  Your post says you are not so the answer is No with no additional explanation required.", "NTA block her and her some peace", "NTA and quit giving her money! What happens if she overdoses after you give her money? Just stop that! Make it as hard as possible for her to get more of whatever she's using. If she gets herself together then and only then can you start helping her out again. But until she's been clean for a length of time... Like a year or more don't give her a penny! NTA", "At least she has a roof over her head and food. She's not being abused she's just being yelled at alot. From my experience cps isn't much different.", "Others have offered them a place to stay but when she couldn't make sales due to having no car and they said no guests could come she didn't want to stay there. There isn't much other family we try to help for a few hours at a time, I think when she starts school it will be less stressful for her as it won't be full time any more.", "That might not be enough if her mother is an addict. Could you take the daughter? At least you’d get some money from the state to help with her care? Is the father horrible as a parent?", "That's what you think, but that's not necessarily what's true! Look I'm an alcoholic and I've been in the rooms for... Oh hell, since 2002! I've heard a lot of people tell stories when they do their speeches at AA and NA! The things that happen to them when they were little and they're parents were addicts, or to their children while they were using are absolutely horrifying!\n\nYou have no idea what is happening to that child when you're not there. She might not even know what's happening to her own child! Especially if she's passing out! I 100% do not think you should ever give your sister money. But somebody needs to do something about that baby! Can your mom take her or something?", "And you have done nothing wrong. You deserve happiness and peace in your life, especially if you are also struggling mentally and financially. Yeah, it may be hard but you don’t have any obligations to help your sister or njece, esp if your sister is refusing help essentially.", "I've considered it but very self aware on my own flaws and not sure I would be up for it. We all had a pretty negative childhood which of course the cycle continues. I'd love to help break it but I don't think I'm in a position to do a better job myself so I do feel guilty judging from the outside but on the other hand I never decided to have kids. She loves her she just really struggles with her behaviour sometimes and doesn't know what to do so when the ipad doesn't work it gets hard for her. My experience with the father was he never left his room and wouldn't participate in anything. Even going to the shops she had to put her at the neighbours house. I don't want to deal with all of this at my house. I'm already in a vulnerable position myself.", "I know it’s her niece and family, but taking in a child or even sending money is a big commitment", "YTA for giving her rides and money.\nAre you trying to $!(( her?", "NTA and stop giving her money. You are enabling her to continue using.", "NTA omg don't let her in and don't give her another penny. Work on stabilizing yourself.  You and your kitties need a safe place.", "Didn’t even read it. Title alone makes it an easy NTA.", "As someone who has had addicted family members, you are absolutely NTA. You have to put yourself first in this case, and from my experience I wouldn’t even let her in the front door to visit.", "NTA. It’s important to keep your safe space safe. The fact that your sister is a user is enough reason to not have her in your home. When you have someone living with that have issues like that it will eventually put you in a heightened sense all the time and will be impossible to relax. After awhile you will feel stressed all the time. It will be detrimental for your overall health.", "Only being yelled at.  Hell, that's totally fine.  Emotional abuse doesn't exist at all and doesn't harm children. /s\n\nFfs.  Listen to yourself.  That poor kid.", "I definitely understand where you're coming from! I know my sister loves her daughter she's just caught up in her own head so just gives her the ipad or TV and gets frustrated when that stops working. I think when she starts school it will be less pressure for her. \nMum definitely is not an option. Only family was mentioned above to take them both in but she didn't accept their offer.", "Watching the violence, horror, gore, & sexual depravity in R rated movies & TV shows can mess a child's head up for YEARS, and there's no way mommy is supervising her shows adequately while she's getting high. Internet predators are thrilled to find kids desperate for adult attention left unsupervised on the Internet, which is exactly where your niece is headed (if she isn't there already). School isn't guaranteed to be a refuge; in fact it might quickly become a nightmare for a child with delayed social skills from lack of practice & who expects to be handed a screen every time she screams. And teaching her child to steal & shoplift is one short step from what your sister is already doing herself.\n\nThis is NOT about your sister \"just yelling\" at her. This is about a serious pattern of neglect. Calling CPS is a gamble but so is leaving your niece in her current risky home situation.", "NTA, as a sister of someone with issues they have to hit rock bottom before they see they need to change.  Think about if you take two people in, feed them, clothe them, pay for all thier needs.  How many times will you be able to miss work because your sister doesn't come home and you have her child to look after.  Are you willing to have her dealer show up demanding money? Are you ready to get evicted when she brings drugs into your apartment?", "NTA for not wanting to help  you can't help others til you help yourself  She will never get better if you guys keep bailing her out... I was a bad addict and my dad had to send me 1500 miles away to my mom to get better but that was after 4 OD and rock bottom. It has to happen sometime. I'm sorry your going through this. But do try to help your niece.", "NTA. If you let her move in she will never leave. Don’t give her anymore money for drugs either.", "NTA...and as someone who has seen relatives deal with addiction issues since I was a small child DO NOT LET HER MOVE IN WITH YOU! Under no circumstances; you will regret it and it might end up being a financial and emotional breaking point for you, so don't do it.", "NTA she’ll just bring chaos into your serenity", "That you think that verbal abuse isn't real abuse makes me sad.", "Please be careful with your niece. Who knows what bad people she may be introduced to or left alone with. Try to find someone who can take the kiddo in if possible. But your sister should stay with the family who place limits. That’s safer for everyone. \n\nNTA.", "I didn't say verbal abuse wasn't real abuse. \nBeing yelled at is different to being abused. She is telling her to stop running  stop jumping, yelling her name etc. She is not calling her names, abusing or threatening her in any way shape or form.\n It is just how she treats unwanted behaviour. 'Hey stop running!' Is what I mean. She just yells it and it annoys me because I like quiet. That is why I mentioned it.\n\nIn my experience verbal abuse constitutes as much more than just being yelled at for being naughty. \nShe just shouldn't yell at her as much,  because then when she does need to be yelled at, she laughs at her. which is why I included it as the post it frustrates me and I don't want it in my house and I would treat her differently but she is not my child. \nThe household we grew up in displayed real abuse, emotional, verbal and physical.  I would have stepped in if this was real. She is loved and cared for my sister just struggles when the ipad doesn't keep her distracted and she wants to play up.", "NTA, you have to do what's best for you.  A lot of my clients are active in their addiction and I know how difficult they can be.  I also know how mean and manipulative they can be when wanting money from their loved ones.  Keep a list of resources to redirect her to any time she asks for something.  Don't feel bad for looking out for yourself.", "NTA, I have a brother who is a lot younger than your sister but definitely tends to end up jobless and homeless due to his drug addiction. I got guilted into taking him in and it was living hell. He just stole most anything not locked up or bolted down. When he eventually left after police intervention, he tried telling the police about drugs in my room that I stashed. The cops didn't believe him but, it really was the last horrible fuck you he did to me. Don't let an addict move into your place under any circumstances.", "Being yelled at is different to being abused. She is telling her to stop running  stop jumping, yelling her name etc. She is not calling her names, abusing or threatening her in any way shape or form.\n It is just how she treats unwanted behaviour. 'Hey stop running!' Is what I mean. She just yells it whike shes sitting on the couch and it annoys me because I like quiet. That is why I mentioned it.\n\nIn my experience verbal abuse constitutes as much more than just being yelled at for being naughty. \nShe just shouldn't yell at her as much,  because then when she does need to be yelled at, she laughs at her. which is why I included it as the post it frustrates me and I don't want it in my house and I would treat her differently but she is not my child. \nThe household we grew up in displayed real abuse, emotional, verbal and physical.  I would have stepped in if this was real. She is loved and cared for my sister just struggles when the ipad doesn't keep her distracted and she wants to play up.\nIf you think it's worth breaking up a family because my sister yells at her daughter to stop running while she's sitting on the couch, well we can disagree .", "So silly. Your drug addicted sister is not capable of providing a sane living environment and you know it.  Read what you wrote about her lifestyle and understand that it is undoubtedly causing harm to your niece. You must feel conflicted about your need for stability and the opportunity to help her and so you minimize the chaos she is enduring. Is there anyone to take that kid in?", "Ok, that's fair.  I retract my snark.  Apologies.", "Call CPS ffs.", "Yes you're absolutely right, It is causing some harm to her development of course.\nAside from calling authorities there would be no other suitable carer in our family that would be acceptable for it. I'm conflited because that would mean us aunties would lose our visits with her which we try to maintain to be there for her. Only other option would be a foster family but she has behavioural issues. It would be a hard journey for her coming from being an only child.", "I think you need to go back and read what you wrote.  You absolutely should not prioritize the hours you get to visit with your niece over her 24/7 existence.  \n\nYour niece is being neglected, full stop.  The yelling is not the same as physical abuse but it’s breaking her psyche in ways that take far longer to heal.  \n\nI think what would be best would be to involve social services and then qualify for placement and receive the financial assistance to raise your niece.  Hopefully losing parental rights will snap your sister out of it and motivate her to take the steps needed to sober up.\n\nIf you can’t or won’t do that, then your niece is better off in foster care than with her biological family.  Don’t prevent her from having a safe, stable household just because you wouldn’t get your auntie visits when you want them.", "NTA, you need to make sure you are healthy and well in order to help other people.", "NTA my step-sister has a drug problem as well and I absolutely would not let her live with me. If she wanted to get clean and could accept boundaries that’s one thing. But her only asking for money and refusing to live with someone who sets boundaries means she has no intention of getting clean and getting her life on track. You are protecting yourself", "Of course you can't have an active drug addict who lies and manipulates family, steals and scams, living with you.  Say no, and feel zero guilt.\n\nThe person I'm worried about here is the 5 year old.  It's hard to imagine that your sister, as you've described her, is taking adequate care of this child.  I wonder if there's someone else in the family who could take care of this child, at least while your sister is still using drugs.  It sounds like you're struggling right now, but is there another sibling, an aunt, or a grandparent who could provide this child with a home?\n\nIf not, as a last resort if the child is actually unsafe, please call DCS.  Don't allow this child to be abused or dangerously neglected.\n\nNTA", "NTA Do not give in. She will use you for everything you have, time and money. And once you stop being useful you will be disregarded. The addiction has taken over, your sister might be in there, but she is not in charge. Do not let her use your niece as a guilt trip either. The only reason she took her is likely that she can score pity points and use her own kid to get people to support her.\n\nIf anything report her to CPS.", "Emotional abuse can take many forms, and yelling at your child and having the attitude that you want your kid to leave you alone is *absolutely* child neglect and emotional abuse. I literally have PTSD because of the shit that my family's done to me, and I still get triggered if anyone raises their voice at me (thankfully, this doesn't happen now that lost of my family isn't in context with me).\n\nIf you're a child and you have a parent that just starts screaming whenever they get frustrated, or whenever they're upset about something else, it's impossible to feel safe around that parent. You never know what to expect from them, and the slightest thing (including imaginary issues) can set them off. The person who is supposed to protect you and keep you safe is a source of fear, anxiety and even danger.\n\nI'm not saying that CPS should take away her kids, but mandating therapy for mother and daughter (not together) would be good. I dunno if that's a thing, but yeah. That's gonna be one fucked up kid.\n\nSure, you might have gone through worse than this child is going through, but that doesn't mean that they aren't being abused. My childhood involved >!false imprisonment, medical neglect that almost killed me several times, parents who thought that they could harass me and beat me to cure my learning disorders, drowning (once), theft...!< All sorts of insane stuff. You still won't see me telling people that anything less serious than my own experiences doesn't count as a heavy dose of abuse or trauma. This stuff isn't a competition, but any amount of abuse on a regular basis is really damaging, especially if it takes place during your formative years.", "Jesus christ, what the hell is wrong with you? Just call cps like a normal person.", "Where do you think these 'behavioural issues' stem from? Could they have anything to do with having an active addict for a mother?"]}