{"id": 2569, "submission_id": "yxzmyy", "title": "AITA for taking back my dresser from my stepdaughter?", "selftext": "F30 \nWhen I first married my husband (M36) and moved in with him I decided to give my stepdaughter my old dresser and nightstand from my parents house. My set was much nicer and she loved it so we got rid of her old dresser during the move. \n\nIt’s been about 4 years now and my husband and I have a 2 year old daughter and are expecting another girl in February. We have been co-sleeping with our daughter since she was born and she has shared our room, but now we need to move her into her own room. I have always wanted my children to have my old things from my childhood and that included the dresser set. When we gave my stepdaughter the dresser I had made it clear to my husband that once we had children OUR children would be using it since it is mine. He agreed and still agrees with me so we decided to discuss it with my stepdaughter. \n\nShe was upset that we were taking it away, we tried to ask her to downsize her things so that she can store her clothes in the closet but she refused saying we should just buy a new dresser for our daughter. So after she left we decided to leave her clothes on her bed and take the dresser out ourselves. After she came back the next weekend she waited until we left the house and moved the dresser back into her room. My husband had another discussion with her and we let her know that was unacceptable. \n\nNow her mother is involved and is calling us telling us we are being unreasonable and should just buy and new set. The thing is my husband and I have also decided to stop buying new clothes for my stepdaughter as we already send her mother child support and we need both the money and space. Once she grows out of her clothes she will not need a dresser so there is no point in buying a new one when we need to save money. \n\nTLDR: I am taking back my dresser that I gave to her a few years ago so that my daughter can have it and she is refusing to let us have it back\n\nUpdate: my stepdaughter is 13 and no we did not tell her beforehand that it was a loan but it was expected of her to give it back if we asked as we are the adults and the parents\n\nI don’t think it’s wrong to ask her to bring clothes from her mothers as she only visits every other weekend", "created_utc": 1668714534, "permalink": "/r/AmItheAsshole/comments/yxzmyy/aita_for_taking_back_my_dresser_from_my/", "score": 1361, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Action I took was taking the dresser and why it might make the asshole is because we are not replacing it\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You’re really leaning in to some unpleasant stereotypes about step parents.\n\nYTA", "YTA!!! You are talking about your stepkid as if she doesn't mean anything.\nThe damn dresser is in your house who cares which one of your three daughters are using it!\n\nIf i would be your stepkid i would be thinking that i was good enough before your own kids ce along but now that you do have them im nothing anymore.\n\nWould she move out with it then your on your right but now your just the biggest AH.\n\n\nThat your husband is agreeing is also weird af.\nBut i believe you are making him do that.\nShame on you", "YTA\n\nYou keep saying that you GAVE the dresser to your stepdaughter. You didn’t seem to tell your stepdaughter that you were letting her use your old dresser until your real children needed it.\n\nNow you’re not only taking back the furniture but you’re also telling your stepdaughter to downsize AND that you’re done spending money on her. Soon you’ll be wondering why your stepdaughter resents her half-siblings. Pay attention!\n\nSheesh. Go to some estate sales and buy another dresser.", "YTA- Why wouldn’t you have just bought a different dresser for your step daughter if you knew you’d be wanting this for your own kids one day. It’s definitely a slap in the face to your step daughter… like “oh sorry my “real” child is here now so you’re not important enough to have this” … the fact that you aren’t even suggesting getting her a new one of her own and you’re just taking hers is so horrible.", "YTA.\n\nI have no idea who you think you are. But you are one thing, A EXTREMELY TERRIBLE STEPMOTHER WHO IS VERY SELFISH and apparently only cares about her own flesh and blood.\n\nYour husband is still required to buy his OWN DAUGHTER things even though he is paying child support.\n\nYOU GAVE HER THE DRESSER AND NIGHT STAND WITHOUT TELLING HER THE DEAL BEHIND IT! YOU CANNOT TAKE IT BACK, YOU TOLD THE WRONG PERSON ABOUT THE DEAL AND NOW YOU HAVE TO DEAL WITH THE FACT THAT YOU CANNOT USE IT FOR YOUR OWN FLESH AND BLOOD.\n\nI used caps lock, maybe that way you understood how wrong you are.", "YTA\n\nYou really messed this up and I have no idea how you can recover. You should have just taken your step daughter out and bought her a new dresser. Instead you turned it into some kind of evil step mother thing.", "YTA\n\nIf you knew you wanted to give your biological child your childhood dresser, you could have:\n\n* Not given it to your stepdaughter\n* Bought your stepdaughter a new dresser of her choosing and framed it as something good/her growing out of the other dresser\n\nInstead, you moved it when she wasn't there. I wouldn't be surprised if your stepdaughter stops coming to your house as soon as she's able to make that decision for herself. Though, perhaps that's what you're hoping will happen.", "As a step child. wow. Yes, YTA.", "YTA.\nYou and your husband.\nThat poor kid.\nYou are making a massive difference between her and *”YOUR”* child, and it is gross.\nShe existed when you married your husband, you do not get to treat her like an inconvenient third wheel.\nAnd shame on your husband for actively going along with this crap.", "YTA and I’m shocked your husband is with you on this! I’m assuming the stepdaughter is still a child and you’re expecting her to process something that an adult would struggle with. \n\nYou’re basically indicating to her that now you and your husband have 2 kids, she is being pushed out.", "Wow. Way to make the poor girl feel replaced and discarded. YTA", "YTA by clearly showing your step daughter that you only view her a STEP, she will never truly be a part of your family and that you will never care for her as one of your own. You and your husband are both incredible assholes here.", "No need to say anything else than YTA. But, you should never had let her have it if she weren’t allowed to keep it. Huge evil stepmom vibe here.", "YTA - You should have bought your step daughter a new dresser.  You are treating your step daughter like she isn't part of your family.  She is your child's sibling.  She is your husband's daughter.  Just because you had a kid doesn't make her any less a part of your family, regardless of whether you pay child support or not.  I don't know what your custody arrangement is, but this is disgusting and you should be ashamed of yourself.", "Yeah YTA, Don't worry I'm sure you'll treat your 'real' child as poorly as you did your stepdaughter.", "YTA\n\nWay to go step-mom!  You are absolutely invalidating your daughter and her feelings.", "Yta. A big one. You gave your stepdaughter something. Then you are trying to take it back for your 'real' kid. As if this child isn't going through enough stress having a new half sister. now you are making her feel she has been replaced. Major ah move. The irony is, you probably could have sold her on buying her a NEW set for her birthday or Christmas,saying she was so grown up that she deserved a new set and the baby should have the old used one. See, that would have made her feel important..instead you decide to take a shit on her. Not spending money on her because of your new baby. Are your trying to be the evil step mom? Because, congrats you are nailing it.", "Super YTA and your husband is worse for not protecting his kid from your selfishness.", "YTA you don’t see your stepdaughter as you and your husbands child at all. You wanted you “own” child with him, way to be an absolute evil stepmother.", "Your child does have your old things from your old life. You gave her the dresser and the nightstand didn't you? Or are you thinking your stepdaughter isn't really your child - just your husband's kid? Who gives nice things to a teenager and then on a whim takes them back?\n\nThe teen hasn't been a disappointment or anything like that has she? Are you hoping she treats your new baby like her real sibling? This is just not making any sense to me? It seems the teen had no idea you weren't gifting her anything - merely loaning the items to her until you spawned?\n\nIf I was the stepdaughter I'd be praying for my real mom to come and get me.\n\nYTA.", "YTA.  You talked to your husband about how you were just loaning it to your stepdaughter, but I don't see anything about talking to your stepdaughter about what would happen, at any time during the four years.  \n\n\nIf you had really wanted to make this work, you would have taken your stepdaughter out to choose new (or new-to-her) furniture a few years ago, when you saw this coming.    \n\n\nBut then I read the part about how you aren't going to buy her any more clothes either so she won't need a dresser, so I'm thinking that you're not just an asshole but more likely a troll.  Nice try.", "YTA. \n\nImagine how shitty it must feel knowing that you’re in a house where you’re always second place because you didn’t birth her. Because that’s how your stepdaughter is always going to feel by doing this.", "YTA- you giveth and you taketh away. All the child is going to see is that she's a second class member of the family.", "YTA. You are helping to spread the ‘wicked step mother’ trope. Shame on you. But also double shame on her father. I cannot believe he would allow this. To treat a child so badly and play favorites is disgusting. Good for her mother sticking up for her. You have a chance to do the right thing, and I hope you’ll take it. Even if you refuse to see her as your kid, she is still your husbands kid and still needs clothing and furniture. I would even venture to say that if you couldn’t afford to provide for ALL the children, you shouldn’t have had them. Grow up please and stop damaging your family over petty nonsense.", "YTA. You say you GAVE her the dresser. Not LENT her, GAVE HER. And you threw out her old one.", "YTA in your initial statement you say “I decided to give…” and now you’re taking it back. Even in your TLDR you say you gave it to her and are taking it back. As a parent, is that the lesson you actually want to teach your children? Or are you just changing your mind now that you have birthed children? Also, your step daughter ***is*** your daughter, so your child ***does*** have the set. Buy a new set for your other daughters. And for heavens sake, continue buying necessary clothes for your step daughter! The way you are talking, you are creating a huge divide in the family.", "YTA. You need to buy your daughter clothes regardless of whether your husband pays child support or not, that is a basic necessity. You should replace the dresser as well. You are treating her very poorly, as though you do not want her there at all. Your husband is a spineless twit for backing you on this.", "YTA.  If you want your bio daughter to have the dresser, you have an easy compromise that is acceptable to everyone but you: but your stepdaughter a new dresser.  If you knew you wanted your old dresser to go to your bio kids, you should have never gotten rid of your stepdaughter’s old dresser.  That was a real WTF choice there.  Your intransigence on this issue is bizarre and unkind.  Go shopping with the stepdaughter so she has a decent place to keep her clothes.  You don’t need to make yourself the villain of this relationship, but that’s exactly what you’re doing.", "YTA \n\nYou GAVE your daughter a dresser. You TOOK it back. You decided to be even more awful by removing it while she was away because you knew how upset she got about you taking her dresser from her. You're using her genetic makeup as an excuse for a crappy decision. I don't see anywhere where you said you've told her throughout the years of the dresser is simply on loan to her. Your husband should be pissed at you. Your behavior is unacceptable.\n\nShame on you! I hope someone replaces her furniture with something even better.", "The day you married your husband is the day your stepdaughter became your daughter too.\n\nYou don't even buy her clothing or basic necessities because your husband is paying child support??  Talk about wicked step mother.  That child deserves love and necessities at your house too, not just at her moms.\n\nYTA", "YATA and your husband is to in a few years don't come back to reddit asking why your step daughter went no contact with you and your husband if I was the daughter i would just leave and live with mom permanently obviously no one in your household respect her at all \n\n\nReally i have no words how much you both suck", "YTA and I can’t understand why I have to explain why. Your step daughter is right if you want the dresser back buy her a new set. Not sure where you live, but ikea is cheap and not too expensive.\n\nAlso you are treating your stepdaughter like she is less worthy then your bio children and so is your husband. \n\nWhy should she have to downsize just because you decided to get pregnant?\n\nINFO: are you the stepmother from Cinderella?", "YTA. Way to be a wicked step-mom. I feel for your step-daughter, especially since her dad doesn’t have her back.", "YTA - What a way to make a kid feel like they are less important than their siblings. If anything, you should feel honoured that she is as excited and loves something that means so much to you. This would have been a perfect opportunity, if the dresser really meant that much to you, that you could have either gone out and bought a new one for her, or picked one out for her new sibling, together, to make her feel involved. \n\nThis is a massive middle finger that you have done to the poor kid and her mother is completely in the right to have stepped in and to have attempted to open your eyes to the big - and scaring, thing that you have done.", "Should have just gone the whole hog and thrown her out her room as well YTA", "What kind of heartless monsters are you and your husband? What was even the point in giving it to her if you planned on taking it back at some point? \n\nAnd to make it worse you guys just spring it on her, YTA\n\nMatter of fact I'm sure you two planned this so when stepdaughter doesn't want to visit anymore you can shrug your shoulders and be with your \"real\" family", "Wow YTA.  So is your husband for supporting this bs.  Then to double down and say you’re not going to be providing clothing anymore (not acceptable) makes you downright evil.  Take your stepdaughter to buy a new dresser set for her room.  Keep providing for her by purchasing clothing, as your husband is likely legally required to do.  And generally stop being awful", "YTA. Way to make sure your stepdaughter knows that you don’t consider her your daughter and that she comes second to the new baby.", "She still needs a dresser for her belongings...things that aren't suitable for a closet.", "You’re punishing a child because you now have one of your own. It’s clear you view your stepdaughter as “less than” your new daughter.\n\nI’m not surprised at you, as this often happens, but I am surprised that your husband is supporting you in this. That’s a shame for your stepdaughter.\n\nI hope you learn to love her and treat her like she deserves to be treated, especially since you chose to be a stepparent. She didn’t get a choice in the matter, I’m sure.\n\nYTA, and your husband is the biggest asshole.", "OMG this cannot be real cause if it is, you're the wicked stepmother. YTA and so is your husband. Why not just tell your stepdaughter y'all don't want her around anymore, it would hurt less at this rate. Unbelievable. Yall suck!", "As a stepchild myself u sound like the evil stepmother I thankfully didn't have. YTA in this story but the bigger AH is ur husband.\n\n\nImagine the daily pain that poor little girl goes through knowing her dad will always put her second to her stepmother and future first class half siblings.", "YTA. 100%. Treating your stepdaughter as a second-class citizen because you have *your own children* with HER father is unacceptable. Clearly you don’t see her as good enough for your family, in which case, you never should have married a man with a child. But her a new dresser, it doesn’t even have to be brand new, go thrift shopping or something. It will be interesting to see if she even wants to come back after how crappy you are both treating her.", "Boy! You are an AH and a big one at that and so is your husband. You have just told your stepdaughter she is being pushed aside for her new sibling. You gave that to her. She needs her own space in the house and a place to put her clothes goes a long way. Yes, you send child support to buy clothes but that doesn't mean you get to stop buying stuff too. Assuming your step-child is a child you are encouraging her to resent that side of the family.", "my god i hope this is a fake evil step-mother post YTA", "YTA for all the reasons everyone is telling you. Your husband is also an AH for letting you treat his daughter like this. I feel sorry for her. At least her Mom has her back because you guys suck.", "YTA. What a horrible thing to do. Stepmother gets there own baby so they throw away their partners. Your husband is worse for allowing you to do it.", "The only way you could have done this in a classy way is to have said to step daughter- look you are getting older now, would you like to pick out a new dresser set that is more your style, that you can take with you in a few years when you get your own place? Then you could have done that, and used your old stuff for the younger sibling, and everyone would be happy. \nBut no, you had to say this is mine still and i want my child to use it and actually you don’t need a dresser at all, and oh by the way we don’t want you to store your clothes here anyway. You made her feel unwanted. YTA.", "Major YTA. You clearly don't think of your stepdaughter as your family and more of a second class citizen. When you gave her the dresser you didn't talk to her about wanting it back. I hope she gets away from you and her AH father and never looks back. But that's clearly what you want as you're pushing her out of the family", "As a stepmother myself...YTA, YTA, YTA!!!\nShe IS your daughter! Let her keep the dresser. And..NO, you don't get to stop buying clothes for her either! You are a horrible stepmother if you think you get to stop caring for this girl just because you now have biological children. I hope your husband comes to his senses and stands up for his daughter,  even if it means divorcing you. And in case you missed it..YTA", "Evil step mom and evil dad alert. YTA.", "YTA. Wow, you really hate this girl, don’t you. Well don’t worry about having to see her once she turns 18. Congratulations on getting what you wanted, I guess.", "YTA! Congratulations, you became the evil stepmother.", "INFO : Is she going to have to sleep under the stairs after you repossess her furniture you gave her  and you refuse to buy her clothes after she outgrows the ones she has so doesn’t need storage anyway?", ">I have always wanted my children to have my old things from my childhood and that included the dresser set.\n\nAnd you did that. Your kid has your things. Just not your bio kid. But she is your kid nonetheless. \n\nYTA.", "YTA in every major way possible. YTA for ungifting the dresser that you gave your stepdaughter. When you give someone something you relinquish all rights to it, but then here you come talking about \"when we gave my stepdaughter the dresser I made it clear to my husband that once we had children OUR children would be using it since it is MINE.\" Way to be a literal overgrown child giving your stepdaughter who doesn't even have a dresser in your home and taking it back to give to your 2 year old daughter who doesn't even have half the amount of clothes that your stepdaughter has and that's not even talking about the size difference of those clothes either. You told your stepdaughter to store her clothes in the closet after she's already adjusted to having a dresser in her bedroom. And what the actual fuck are you talking about with this \"we decided to stop buying new clothes for my stepdaughter because we already send her mother child support and we need both the money and space.\" Just because your HUSBAND sends your stepdaughter's MOTHER money for child support does not mean he is supposed to stop caring for his daughter monetarily. Also, I love how you come right and out and admit that your family as it is right now can't afford to give your husband's daughter the basic necessities that she needs like new clothes because you're gonna need that money and \"space\" (wtf) to take care of your soon to be born daughter. The two of you are absolutely terrible as parents!", "YTA If you never let her know it was a loan than she probably thought this was a gift and it was probably very significant for her. By taking away the set you are saying that you no longer need her now that you have your own children. And you are literally pushing her out by throwing all her clothing onto the bed. \n\nYou could have framed this as a chance to upgrade her dresser and pass it on to her new siblings but you chose to isolate your stepchild. You also sound like an AH. Like even if she out grows her close she is going to need more clothing.", "YTA amd what a way to show your Stepdaughter how you really feel about her. “I know you liked the dresser that I gave you. But now that I have actual children I need to take it back. No hard feelings right. Oh and by the way since your dad and I have to pay child support don’t expect anything off us anymore.”\n\nI am so looking forward to the moment you make a new post wondering why she won’t come over to look after her sisters because that’s what’s siblings do.", "YTA. So you give your step**daughter (your child)** the dresser set you wanted to give to **your children** and are taking it back because you now have a bio kid. Why did you even give it to her in the first place if you never saw her as your own child? Also deciding to not buy your stepdaughter new clothes anymore because you need to \"save money\"? What, is she supposed to use what she has now for the rest of her life? Way to make the poor kid feel unwelcome and unloved in her own home. You're a terrible parent.", "You are the asshole and I feel terrible for your step daughter. You should be treating her as if you were her mother. You should be showing her the same love you would your own child. I am thankful that my girlfriends step father is better than this or else I would hate seeing her family. You should be ashamed of the way you treat her. It is not her fault her parents divorced. When you married her father you agreed to be her mother. I am embarrassed for you and think this is horrible behavior. You need to check yourself and think about more than stupid furniture and think about how this girl feels. Her emotions and relationship to you is much more important than an old dresser. The truth is your biological daughter will not value that dresser the same way your step daughter will. It will mean more if you let her have something of yours to make her feel like she fits in. I really hope you read this comment and would love the opportunity to discuss it more.", "YTA. With that kind of attitude and mindset, you have no business being with a man with kids since you cant treat your step kid like your own. The father needs to grow a spine for his daughter.", "YTA totally. You can’t wait until she’s 18? The baby won’t even know what a dresser is! \n\nYou’re stopping buying her clothes? You’re not even going to provide for her? YTA but her dad is the bigger one for letting this happen. For shame.", "YTA. Your husband is an asshole too. I honestly can't stand people like you who \"other\" stepchildren because they're NoT yOuR BiOLoGiCaL cHiLd. You shouldn't have married someone who already had an existing child if this is what you \"always\" wanted.", "YTA.  You are sending a strong message to your stepdaughter that she is less than your daughter.  She will definitely put your ass in a home one day and I am sure she will save as much money as she can.", "YTA. You GAVE it to her. You don’t get to just take it back because you popped out a new kid. That’s cruel of you to do. Way to show your step daughter how little she means to you. And she will remember it.", "YTA.\n\nAnd dumb. Want to give your dresser to your biological child? Take your stepdaughter, who is 16 and definitely feeling grown up, out to pick out a new one that will just be hers and frame it as “since you’re a double big sister, and nearly a grown up, you deserve to pick out your own things”. Win win.\n\nInstead you want her to get rid of a chunk of clothes and when she refused just stole it from her and left her clothes on her bed. In what world did this seem like a good idea?", "YTA I hope she has the option to live with her mom full time because you and your husband sound insufferable and like you’re trying to push her out of your “new” family", "YTA\n\nWho decides not to buy their kid clothes anymore? EVERYTHING should be 50/50. Just because your AH husband pays child support, doesn’t mean he can get away with no responsibilities. That includes clothes she grows out of. I didn’t know his ex had an immaculate conception without him. Somehow he got his ex pregnant and had a child, but he pays child support, so he shouldn’t have to buy new clothes for his daughter. \n\nYou don’t care about stepdaughter's feelings, because it’s for “our” children. If you can’t handle being a stepparent, then you shouldn’t be one. If you can’t afford kids, then don’t have any. It’s irresponsible. Not that you and your husband care about responsibility. Don’t act surprised that your shitty behavior has consequences. Soon she’ll be able to decide if she wants to stay at your house at all, but it’s not like you care. You have your children. Go back to your happy little family.\n\nEdit to add:\n\n>The thing is my husband and I have also decided to stop buying new clothes for my stepdaughter as we already send her mother child support and we need both the money and space.\n\n>I don’t think it’s wrong to ask her to bring clothes from her mothers as she only visits every other weekend\n\nNo, you clearly said both of you decided to stop buying her clothes, because her mother gets child support. Suddenly in your update you don’t think it’s wrong to ask her to bring clothes from her mothers? Is this lie supposed to make you look better? Because you clearly said you and your husband need the money. Keep up with your lies. Nothing you say is going to make you look better. Get your shit together, and treat your stepdaughter better.", "YTA and you definitely don't deserve to call her your step daughter. She is also \"our\" children.\n\nI have both. The oldest still has my special dresser from my grandma. Real wood. And so does the smallest.\n\nI would never take stuff away from the oldest unless thenoldest was done with it. No matter what it is.\n\nGo get something new.", "YTA\n\nGeez why not just outright tell her she is being replaced instead of pussyfooting around it?", "YTA. the obvious separation of “yOuR kIdS” and your stepdaughter is disgusting. you’re a terrible stepmother and I hope she goes no contact w your immature petty ass.", "YTA\n\nWay to let her know that you don't consider her family. \n\nEither you buy her a new dresser that she is allowed to choose - no matter what she wants - or the babies will have a new one. You gave your step daughter the furniture. - Did you even tell her that you're only \"borrowing\" these things to her before you decided to \"get rid\" of her own furniture?", "\"Step daughter, I only pretended to care while I had no kids of my own.\n\nNow that my REAL CHILDREN are here, I can stop pretending that you matter or that I care about you. also, you don't need new things because no one loves you anymore\"\n\nYTA\n\nWho do you want to play you in the disney movie about the evil step mom?", "YTA Cinderella’s evil step mother could learn a few things from you.", "YTA yargh so many bad takes here. Firstly that you don't consider your step daughter your child, putting that 'our' in all caps is really telling. Secondly, well, everything else. Also why not wait until your stepdaughter goes to college eventually? A new baby isn't going to give one damn about a dresser being a family thing but might later in life, and at that point your step daughter won't need it as much and you can swap them.", "YTA\n\nIf your intention was to always give the set to your bio-children, you never should have given step-daughter the stuff and got rid of hers.\n\nYou're an even bigger ass by not only stealing the set from step-daughter, but now refusing to buy her clothing because your husband pays child support to his ex? If the two of you both work, his income is responsible for supporting all of his children, including his daughter with his ex.", "YTA\n\nWhat is wrong with you??? \n\nIf you are dead set on taking back that set buy her a new one. Why would you emphasize your OWN children. Is she not part of your family?  You are treating her like she is a boarder and not a member of your family. Of course she needs a dresser. Unless you've set up one of those elaborate closet storage systems she needs a place for socks, bra's, underwear, shorts etc. \n\nYou and your husband are in the wrong. Don't be surprised if she doesn't want to spend time at YOUR house. She might even cut off all contact in the future. You obviously don't see her as part of your family.", "Wow, YTA. That's horrid.", "YTA and, also a monster stepmom. So how about if we blame all this mess on your hormones being messed up due to pregnancy? This out is not for your benefit but for the sake of your stepdaughter's wounds, the harsh loveless stabbing wounds that you and dad have inflicted on her. Please see how you and dad have cut her to her core with the loveless way you are treating her. Also, stop with this, we don't have to do anything else for you because we pay child support. Buy her the darn clothes and stop resenting her. She is your children's sibling. Will you want your husband to treat your kids that way when he moves on to the next wife?", "YTA. If this was your plan all along why the FUCC didn’t you tell her ?", "Good job on alienating your Stepdaughter. When she goes NC with her father you can both look back with pride on how YOUR children got to use a dresser.\n\nYTA", "YTA. You should have told her it was just a temporary thing, not let her think you were giving it to her.", "YTA. Why didn’t you offer to buy the step\nDaughter a new dresser set of her own? You’re literally treated her like a second hand child. Why won’t she need a dresser when she grows out of her clothes? Is she not going to have clothes at your places? Does she live with you full-time? If so why is the mom getting child support?", "YTA You and your husband are the biggest assholes of them all. You fit the stereotype of the wicked stepmother perfectly, and the fact he sides with you tells me all I need to know about what sort of father he is to that poor girl. I hope her mother goes for full custody so she doesn't have to deal with you and your husband's blatant favoritism, and at least the additional child support she'd receive will help cover the items your husband refuses to purchase for her.", "Why on Earth would you give someone a gift with the intent of taking it back? YTA It was a gift - it's not yours anymore. You wanted it for the future, *you shouldn't have given it away.*", "YTA. For capitalizing and specifying \"OUR children\" and for giving your stepdaughter something then taking it back. \n\nThis whole posts show that you clearly favor your *own* children. If you didn't want your stepdaughter to keep the furniture you shouldn't have given it to her. \n\nYou're the worst. Prepare for her to not want anything g to do with either of you when she's old enough to be on her own.", "Don't procreate or get together with someone who has kids if you can't even buy spare clothes and a dresser for them. How is this logic so hard to understand? YTA OP.", "YTA and a gross one.  As a stepmom I am telling you that you AND your husband are despicable.  You won't get her another dresser and you don't even buy her clothes???   She should get rid of her things???  I am so angry that your husband tolerates this from you and participates.  What a jerk.  I hope his daughter goes NC with you both.  You are ruining his relationship with his child and one day, he will resent you.  Of course, it will be too late for him and his daughter by then.  How can you love him and do this?   \n I cannot express how much YTA or how gross this is.  I refuse to believe you don't know YTA and I bet you would be furious if a stepmother treated your biological kids like this.", "YTA\n\nIn so many ways", "Ok so if you had told your stepdaughter that you were replacing your old dresser with another dresser of equal quality then you would totally be in the right to do so, however WTF?! Every thing after that made you sound worse and worse. I feel bad for your poor stepdaughter. You probably loved on her till your own baby came along and suddenly no extra money for clothes, taking furniture from her room and not replacing it. Imagine how she feels for one second, then imagine our own daughter being treated this way by a potential stepmother one day.  YTA.", "YTA. You sound pretty heartless. Get ready for serious trouble down the road that you brought on yourself.", "YTA\n\nWow, tell me you don't want your stepdaughter around with telling me. She is clearly not part of your family.\n\nThe only bigger AH is her father.", "YTA.  Wow.  Your stepdaughter is your family now too.  The interesting part is she doesn't even want a new set herself and would rather you buy one for her half sibling.  It probably meant something to her to have your childhood dresser.  It was something special, and she loves it.  Basically you're saying she no longer is important enough to have it because your kids come first.  No.  All the kids come first, not just the two little ones.  Then you're mad she moved it back into her room when you weren't home which is the exact thing you did to her.  You're so messed up.  I can't believe her own father doesn't see how wrong this is.  You should have never offered it to her in the first place.  I'm betting she feels very unloved right now and very uncomfortable in what's supposed to also be her home.  You messed up big time here.   Don't be surprised when she's living with her mother full-time and refuses to see you and your husband.", "YTA.\n\nI hope your husband keeps this attitude, when his daughter stops coming back, from Mom's.  This stupidity just cost you both your relationship with her.", "YTA \n\nWay to alienate your husband's kid. Are you trying to get rid of her so you can focus on your \"real family\"? Cause it looks like you're trying to slowly push her out and make her the unreasonable one until she just completely gives up goes totally no contact. \n\nDo you not see how horrible that is?\n\nHow is your solution: \"Take away her dresser and don't replace it, in fact we're not buying anything for her again\"? \n\nGross. Get it together.", "YTA, and congrats on keeping the evil stepmother stereotype alive and well!", "WTF is wrong with you and your husband?\nYou give her a dresser then when you have you OWN kid you take it back as step daughter is \"not your family\" then you decided that you no longer buy her clothes. Are you serious?\nYou're the epitome of evil step mother and the husband is a dumbass for treating his daughter this way. Roles reversed would you want anyone treating you own daughter this way?\nYTA", "YTA. This is the pettiest reason to be an asshole yet here you and your husband are. You're going back and forth with a teenager over a dresser set because y'all are too cheap and stubborn to buy a new one. If it was so sentimental you shouldn't have lent it to the step daughter in the first place or you should've communicated like adults and told her it was a loan.", "You say you agreed to taking it back later with your husband - did you agree to it with the person you gave it to?", "Was it not even an option to buy your stepdaughter a new dresser since YOU GOT RID OF HER OLD ONE. Was her ‘downsizing’ her possessions really the only answer?", "YTA. When you give a gift, that’s it. \n\nI found out recently my mother took over my childhood room, and we’ve been low/non contact for years. That’s your glimpse into the future if this keeps up. Stepchildren are still family.", "YTA - I would have a different opinion if you replaced the dresser and nightstand.  Instead you want her to downsize (toss out her stuff) and squeeze her clothes in the closet.  Did you tell your stepdaughter this was a temporary move?  You’re being unfair to her. Explain how dear the items are to you and take her shopping to replace what you are removing.", "You really went full Evil Stepmother. \n\nYTA and so is your husband.", "Tell us who you love and care about  are without telling us..you and your husband are both AH'...better hope you stay married to him..you might be the mom on the other end of the phone with him one day, when his new wife treats your children less than.", "YTA — and the popular opinion is that your husband is as well. You both view his daughter as the “other.” I wouldn’t let my daughter stay with ya’ll since you’re the typical evil stepmother trope who puts your bio kids first and he is the typical dumb cluck clueless dad who goes along with it. \n\nBuy a new dresser set for her to have. Like, it’s your responsibility since she stays with you. I guess her room should be bare and she can’t have a place to put her clothing? Putting her clothing on the bed and just taking the dresser?\n\nAnd the end paragraph where you say you stopped buying her clothing because you already pay child support to her bio mom? It is your husband’s job to clothe his own daughter when she is staying with you. Good grief.", "YTA. Your daughter is 2 and won't care about the dresser. You're showing your stepdaughter you think far less of her than your own child and that even when she doesn't need it, your \"real\" kids will always come first", "YTA-  you may have said it in the very beginning that this will be your own kids furniture one day, but did you specify that you would take it while she was still using it and also that when that happened you were not even going to replace it with something else?  \n\nDid you let her know in advance that she would then have to just throw her clothes into the closet and *gasp* no longer acquire new ones because she’s undeserving according to you because she’s not your biological child? \n\nThe idea that you think it makes sense that because now you’re short a dresser that your stepdaughter should not get a replacement, but rather just stop purchasing new clothes so that one day when she grows out of them and she’s walking around apparently naked she won’t even need any place to store clothes!  \n\nThis sounds like classic evil stepmother stuff to be honest. Next thing you know you’re gonna need her room and she’ll be sleeping by the fireplace in the kitchen on a pile of old ashes.  Whatever you set out to do in the beginning with the dresser what you have actually done is make it extremely clear that because she’s not your biological child she just doesn’t even compare in worth or value to your actual biological kids and her place in the household is really dependent on what your needs are snd what your solution is which doesn’t seem to have her in mind at all.", "Honestly YTA, no she shouldn’t have moved it back, but it doesn’t sound like you told her you were conditionally giving her the dresser. I’d be so upset if that happened, especially since I thought it’d be me bonding with my stepmom only to find out I mean nothing compared to her biological kids. It’s a low blow. \n\nETA I’m 10 years out of high school. I still have a few things that I wore *IN* high school. Not many but a few. Also if you don’t buy her replacement clothes for what she outgrows/doesn’t wear. Seriously y’all are horrible", "YTA - that poor child. Your husband is also an AH for letting you be so vile to his daughter.", "FYI child support doesn't buy yourself out of obligations to feed clothe and house your child", "YTA - Evil, wicked, cruel stepmother alert!!", "YTA  I feel for your step daughter.  In one step you made it known to her that she doesn't matter and isn't part of YOUR precious family.  Shame on you and the father both.  And you pretending to not see what you are doing, prioritizing only YOUR children..please.", "YTA. You could at least pretend to like the poor girl, jeez OP. This is literally cruel.", "YTA just get a new dresser set - does this really need to turn into such a big deal? \nCould you possibly let her choose her own new set if it's so important that your daughter gets your set?", "YTA- you could’ve made this a fun thing, and upgraded her bedroom set and let her pick it out, give her a room make over etc. let it be a fun exciting experience for her. But instead you’re no longer providing clothes that fit, probably making her live out of a bag essentially, and most likely making her feel as though she’s a guest in her own home. You and your husband suck.", "YTA, hubby is also AH for letting you treat your SD like this. You have to buy one or the other a dresser and continue paying for things like clothes. Child support is spent however her mother deems fit not you. Evil stepmother alert 🚨", "Why don't you let her choose a new dresser? Explain to her that you'd like ALL your children to use your childhood  furniture for a while, so she's had it for 4 years and now your 2nd child gets it for a few years and after that it goes on to your 3rd child. \n\nThe combination of not wanting to give her a new dresser AND not wanting to buy her clothes anymore tells her she's not worth anything to you or her dad. YTA, big time.", "YTA Why do people behave so gross in a mixed family? \n\nYou're the definition of wicked stepmother. You should have never married a man with a kid if you couldn't open your heart for said child. I pray for all your husband's children for having to deal with your hateful heart.", "YTA I feel so bad for your step daughter. Your husband shouldn’t be surprised when she goes no contact", "YTA you should have never given her the dresser if you were planning to take it back for \"YOUR\" daughter. You are pushing her aside as though she is less then.", "Yta and your husband a shitty ass father. How old his his child. Also paying some child support doesn't let him get off the hook for other support his daughter needs. Maybe you guys should have more kids. If he can't afford to support them. Maybe you both need to find another job.  You pretty much told this child she nothing to you and was just a place holder.  Also your husband crappy for marrying a Women who downs view his daughter as her.  Your husband doesn't need to worry about what daughter has at your house your probably be taking her room soon enough and she'll be going nc with you people.", "YTA.", "ive seen really pretty girly (albeit cloth) dressers on amazon for like $90 so you could have just gotten a new one for your stepdaughter and kept the “heirloom” for your other daughter. i get wanting to save money but hurting your step daughter in the process is not the way", "I am confused because you open with saying you gave it to her but later on you explain that it was made clear from jump that you intended to use the dresser when you had your own children together. If that's true I genuinely believe you are NTA at all for wanting to use furniture you have a personal connection with with your child and that, while it's not the ideal behavior, it's not a true AH move to just take it back if she was insistent on being unreasonable and not honoring what she was told initially.   \n\n\nBUT if you and your husband both know that she thought it was a gift that therefore \\*belonged\\* to her, then yes, YTA in a major way, especially for just taking it like that.   \n\n\nThe fact that her old furniture got thrown away certainly supports the idea that she was led to believe this furniture you want back was hers to keep.", "YTA 100% straight out of a Cinderella's book. Big inequality of treatment just bcos step daughter is not her child by blood.", "YTA.", "YTA.\n\nYou're making it classy you don't see her as your child. Gross. As a step mom I think that's ultra shitty to show your daughter she's less than family in your eyes. It's unfortunate you don't see how this is going to hurt her relationship with you and you think a dresser is worth driving a wedge between you", "YTA. It’s this sort of thing that gives step parents a bad name (speaking as a step mum to 2 kids and mum of 1 ours baby). I don’t understand how you can’t see that this is cruel to your stepdaughter and like to sour her relationship with your bio children? It’s cruel on so many levels.", "WTF, of course YTA\n\nIt's a dresser!!! Why do you care so much about your daughter having that specific dresser right now? Your stepdaughter is eventually going to move out or want to change her furniture in her room and at THAT time, you could give it to your daughter, but honestly, it's a dresser. It's still in your possession.\n\nBy taking her clothes out of the dresser when she wasn't home was such a shitty move. By you making a big deal over it and making sure your daughter has it over her makes it seem like she is less important. How do you think that would make your stepdaughter feel?\n\nIf you want to repair the relationship, I would be apologizing to her. I am a stepmother myself and I would never do this to my stepdaughter.", "YTA. When do you take back her Christmas presents from last year to go with the furniture?", "YTA  \nAre you trying for the Wicked Stepmother role or what? You gave her something, now you want it back. And why aren't you buying her a new dresser? You think she won't have clothes at all after she outgrows what she's wearing?\n\nYour husband isn't up for father of the year, either, given that he's putting his new baby ahead of his daughter.\n\nI don't know how old your stepdaughter is, but I hope she's old enough that she can just stop staying with you guys before you decide to put her in a closet under the stairs or in the basement.", "YTA. \n\n>When we gave my stepdaughter the dresser I had made it clear to my husband that once we had children OUR children would be using it since it is mine. He agreed and still agrees with me so we decided to discuss it with my stepdaughter. \n\nLike did you read this? That right off the bat is horrid. Do you know the difference between gave and lent? Because you gave it to her then years later when you have your own family take the thing you presented as a gift. Also stop calling her your step daughter that shits sounding Cinderella man. She's just your husband's child and your stop gap til you got your real kid. Why did you marry someone that already had a kid if you're clearly all about the bloodline?", "Ugh. My first thought from the title was that you broke up with your husband and took the dresser back when you left. \n\nThis is so much worse. There are so many things wrong with this… OUR kids, we send child support so we won’t buy her clothes, we need the money and space… \n\nThis is a living and breathing child that is under you and your husbands care and you need to stop  “othering” her! \n\nThe fact that you took it and put her clothes on her bed when she wasn’t there really says a lot about you both. \n\nYou and your husband are both a-holes. YTA.", "YTA - this is going to be one of those \"we never hear from my husband's daughter anymore and have no idea why!?\" questions in 5 years.\n\nWay to make the 16 year old feel less than.\n\nAH - both you and your husband.\n\n(I hope you aren't planning on using this girl for free babysitting -- if you do, then you get to graduate to MAJOR-AH.)", "Yta, see you made it clear to your hubby about the furniture, but what about your step daughter, oh wait. You dgaf about them, it's what you want for you and YOUR children. \n\nThe fact you waited until she was gone to do it, makes it even worse. She can now realize that her father and stepmother really don't care about her, but more about the things and the children they had together. \n\nYou can't candy coat this to make it look better. You didn't go, \"hey we can get you a dresser and stuff\" no, you expected them to downsize and shove it in the closet.\n\nCan't wait to see in a few years, \n\n\"Why won't my step daughter speak with us? We're family\"\n\nThis is something you screwed up on. Then youve decided to stop buying her clothes, I mean, way to double down on the fact she isn't part of the family or that they mean anything to you", "YTA if this is real.\n\nYou could have offered to get her another, new set at least instead of leaving her stuff on the bed. You could have had an additional conversation instead of dumping her clothes while she was gone. \n\nAnd since your husband IS HER FATHER it is ALSO HIS responsibility to provide for his daughter while she is at his house. Child support does not cover this. Stop treating her like she’s less than just because she didn’t come out of *your* vagina.\n\nHonestly though, I doubt you have to worry about it much longer. She’ll cut you both out here shortly.", "Yta... So when the stepdaughter outgrows her clothes, is she just supposed to go naked. And your first line you gave her the dresser. Not loaned not to hold on to until I get my own daughter and treat you like crap, gave. I sure hope the stepdaughter goes no contact with both of you and lives with her mom if she can. Also if this is how you doing it with a 2-year-old and getting pregnant wow she's going to be treated like crap for the rest of the time she stays with you", "INFO - why aren't you replacing the dresser with something she can keep her clothes in?", "YTA jfc good job being the evil step mom from fairytales. why did you give it to her in the first place if you always had the intention to take it away? that’s insanely shitty. removing all her belongings and moving it while she’s away? insanely shitty \n\nalso ???? full offense a toddler does not need a full dresser in their room, their clothes are much smaller and can fit much easier into smaller spaces that the clothing of a teenager or adult, you could wait. \n\nalternatively, you could take your stepdaughter to go pick out a new dresser that she likes, since you’re literally taking her’s from her.", "The actual fuck is wrong with you OP", "My goodness, you and your husband have certainly shown your STEP daughter where she stands (I'll emphasize \"step\" because you certainly do.).\n\nTo start, you gave her furniture only to ask for it BACK and REFUSE TO REPLACE IT. \n\nBut it gets better! When she resists giving back this \"gift\", you just... take it. Invade her personal space, leave her clothes on her bed and just effing TAKE IT.\n\nOh, but we're not done! THEN you justify this action by saying she doesn't NEED this furniture because YOU WON'T BE BUYING HER CLOTHES. \n\nAnd your reason? YOU CAN'T AFFORD THIS CHILD THAT YOUR HUSBAND BROUGHT INTO THIS WORLD BECAUSE YOU MADE ANOTHER ONE.\n\nGah! What a parade of horribles! YTA. A thousand times over.", "YTA for saying in your post “I decided to give my stepdaughter my old dresser and nightstand.” You’re literally lying. You didn’t give it to her. You conditionally\nLoaned it to her until you decided it wasn’t hers anymore.\n\nI wish there was a wicked stepmother award.", "I actually gasped at this one. YTA for so many reasons. \n\nRemember OP your husbands ex and his daughter were once his “real” family. What makes you so sure you and your children aren’t temporary as well?", "YTA. You should never have offered a dresser to your stepdaughter and gotten rid of hers if you intended to take it away. Your unborn child will not care what dresser she uses and the fact that you do care is bananas.", "INFO. Did you tell your stepdaughter about the agreement you had with your husband?", "YTA", "How old is your stepdaughter?\n\nYou’re an asshole no matter what, but it’s a different degree of asshole if she’s little and still going to live in your house for several years. YTA", "YTA and so is your husband….for the dresser….for buying new clothes…everything.\nWhen she moves out/goes to college, then you can pass the dresser down to the younger siblings. \nShe probably already feels like she is being replaced and not welcome in the home and you’ve made it worse.\n\nIf you planned on taking it back, it wasn’t a gift and you should have saved the old dresser. \n\nYTA!", "yikes. age was omitted for a reason op. YTA and you know it.", "She is a CHILD!! Both you and your husband should be ashamed.\n\nIf you only wanted YOUR children to use it, you should have never given it to her.  You are making it quite clear to your stepdaughter that there is a big difference in your eyes between her and your bio-kids.", "You're taking something that isn't yours. That's called stealing. YTA", "YTA\n\nYou're treating your stepdaughter like crap. Just remember that your other children will notice how you treat her. And they'll know that the only reason you're not treating them the same way is an accident of birth.", "YTA, and when your stepdaughter chooses to not come over anymore (it’s coming) don’t complain. You the adult created a hostile environment for her.", "YTA. If you wanted it back so badly, you should have offered to take her shopping to pick out a replacement. It wouldn't even have to be new, Habitat for Humanity ReStore has nice options, or any number of thrift stores could have choices. You did not think of her at all, she used this dresser for TWO YEARS! Whether she has clothes for it or not, you gave her this item to use and did not offer a replacement. Kids grow, they need new clothes. Child support should not be the only thing your spouse is contributing to raising his daughter. Tread carefully, you're on a path that can easily lead to her wanting nothing to do with either of you as an adult.", "YTA. You got rid of her dresser when you gave her yours. You owe her a replacement dresser if you want to take it back. You seem to be treating your stepdaughter like a second class citizen: it was incredibly rude to dump her clothes out and take back the dresser the way you did. How do you expect this relationship to play out? Because I would tell your stepdaughter that you are treating her very poorly and she should consider a future of No Contact/Low Contact with someone who behaves like this toward her.", "YTA. If you want the old dresser back you should be upgrading your step daughter to new furniture, not expecting her to “downsize”. You also cannot decide not to buy her new clothes. The child support you pay is to account for differences in parental incomes and for the mother to provide for her in her home. If you have joint custody it is your responsibility to provide for her what she needs in your home while she is with you. Clothing is a basic need and definitely not something you can just decide to forego.", "YTA. You are taking back what you gave her. You have hurt her so badly by doing this. You will never understand her pain.\n\nEdit misspelling", "You are AWFUL. I don’t even have words for how awful this parenting is. Poor girl. YTA times a million.", "Eww, youre being so nasty! You're most certainly the Ahole! You could have handled this so much better and not made her feel like an outkast at her own home with her own family. If you wanted your dresser for your biological kids the least you could have done was ask her to give it back but tell her you would take her shopping for a new one and she could pick it out.", "YTA.\n\nIt’s fine you are taking the dresser back, but you need to replace it.", "Wait,so step daughter won't have any clothes at your house? Nothing, no socks or undies? Will she be lugging her clothes back and forth? Wow that's not only cold that's cheap af... So no dresser, no clothes . And not going to replace her old set!  yta. Shame on you", "You and your husband are both AH. Your one of those evil step mothers arent you. Selfish asf because now you have your own children who cares about your step daughter right.", "YTA. You’re Trying to make your stepdaughter miserable so she moves out and you can replace her and never spend a cent on her again. If your husband is on your side, you know everything about what type of father he is. And there are Disney movies and Taylor Swift videos about stepmoms like you.", "YTA.\n\nWhat youre doing is being divisive and making your 2 year old more important than your stepdaughter.  When you married this guy you got your stepdaughter too which is something you should try to cherish and build on instead of tearing it down or devaluing.  Dont you feel quite flattered that your step daughter wants to keep the furniture that was from your childhood?  The fact that its a big deal to her should be a REALLY big deal to you. But instead of that, youre doubling down and are no longer going to buy your stepdaughter clothes so she has nothing to put in the dresser??? \n\nWTF is wrong with people", "So when are you taking over her bedroom OP?  Sounds like you are slowly moving her out.", "You are so much the asshole. Do you have any love or concern for you stepdaughter? You and your husband are cold and unfeeling. She deserves better than you two.", "Way to show his kid who matters more to you two, her or your shiny new children.  You made it clear to your husband that this didn’t really belong to his daughter and would be taken away when you essentially replaced her with your “real” children, but did you tell her that and did she actually understand it?   How do you think this makes her feel, like she’s valued in your home, or an equal to her half sisters?  YTA, BOTH of you.  I can understand the evil stepmother trope, but her own father, wow.", "Omg.  YTA.", "YTA for this quote alone:  \" When we gave my stepdaughter the dresser I had made it clear to my husband that once we had children OUR children would be using it since it is mine\" So you made it clear to hubby that you  didn't consider step-daughter to a part of the family.  She may not be your daughter, but she certainly is his. He's also an asshole for agreeing to this.", "YTA \nBased off of your language it is clear that you view your stepdaughter as second class to your bio children. Now you’re proving to her that she will not matter as much as her new half siblings. I don’t who’s  worse, you for feeling this way or her father for co-signing his own daughter being cast aside.", "Was your stepdaughter aware you saw her just as a placeholder for your \"real\" kids? If not, she knows now.\n\nYTA\n\nYou took a piece of furniture that she is actively using and is likely attached to due to the years of ownership (and yes, the way you gave to her is giving ownership as you didn't tell her it was temporary and she gave up ownership of the previous dresser) because \"your kids\" need it now. If, after all this time, you still can't see her as your kid, you have made sure she feels like an outsider in your own family.\n\nBlended families aren't the easiest (coming from someone who has two sets of step-parents and half-siblings), but you have to try and as the adult the onus of making sure everyone is being supported properly falls on you and her dad. You can have biological children and still give that same love to your stepdaughter, especially since you've been in each others lives for a decent period of time (from my understanding of the post, you can correct me if I'm wrong.", "What even is this post? YTA for like ten different things. First, buy her a dresser if you want yours back, she lives there, she needs to be able to store her clothes. It’s not even negotiable, your literal toddler does not need a dresser more than your stepdaughter. Further, you actually don’t get to decline to buy basic necessities for a minor child, no one cares that your husband pays child support to her mother. \n\nLastly, and maybe most importantly, idk how old stepdaughter was when you married your husband. Maybe she was already a tween/teen and you’re not exactly her mother, that’s fine, she has a mom. However, your husband is her father, and always will be. She’s not separate from YOUR children, she is equally her fathers daughter, just like your kids are. She is just as much a part of your family. You deeply suck. Get a divorce and spare her this mistreatment.", "Yta who does this? Taking furniture from a child?! Shame on you!", "YTA and I cannot believe your husband is backing you up. \n\nDon’t marry someone with children if you cannot be a decent step-parent. You didn’t even tell her it was a loaner. That poor girl.", "omg you are not only an AH you are an awful person", "YTA and so is your Husband.\n\nShe should trash the dresser and then decide to stay at her mum's place as her sperm donor clearly has replaced her.", "Info: why did you marry a man with kids if you hated his children? Just let the poor girl live at her moms full time if you are going to be a wicked step-mother.", "YTA, so much, your poor stepdaughter!", "YTA", "YTA and your husband is a bigger AH for not standing up for his daughter. You actually sicken me. How you have the audacity to enter into a relationship with someone with a child and then so quickly decide she’s not really your kid. \n\nAnd you’re not going to buy her any more clothes. Poor kid must feel like a knife block where you’re both stabbed her in the back so much.", "Yta", "YTA and so is your husband \nI think you’re just giving small step towards getting rid of your stepdaughter. The clothes and child support comment says it all. \nFeeling sorry for your stepdaughter!", "Its depends. Important question. When you give your dresser to your stepdaugther... Did you Tell her was only temporality or just discus It with your husband? If she was aweare of the conditions, not NTA, but if she dont know yes , a Big A for you and your husband. \nMake a comintment, buy a new dresser a you stepdaugther, dont be cheap when you are gonna take away something from her to give to your daughter.\nBut be aweare of something, if you are put at your dougther first in everithing, if now you star to take thinks to your step to give to your bio, she its gonna resent forever.. because the diference betwen them are gonna be BIGGER. \nPlease, try to treat bouth the more similar way posible, bouth are your daughters, dont mather the context.", "YTA for all the reasons people in the comments have said", "YTA. Awful awful person", "YTA. You really are a mean horror. I suppose now you’re going to get competitive with your stepdaughter? I don’t know how you can look at yourself in the mirror.", "YTA and WTF lady.", "YTA. Surely you already know that. If you intended to take it back, why did you throw out the dresser she had?? Poor kid. I’m reminded of an ELO lyric, “eeeeevil woman”", "YTA you should have told her it was a loan. You shouldnt have gotten rid of her old stuff. And even then youd be an A but at least a smaller one. \n\nStep parents need to stop treating step kids like warm up kids to be tossed out once you have new ones.", "YTA. Both you and your AH husband. Let me guess you only have her at all so he pays less child support. Mom. needs to go to court. Get full custody and more child support. You can then keep the precious dresser", "YTA and so is your husband. You are stealing from a child. That is never ok. Plus, she gave a reasonable way to please by getting her a dresser. You denying that isn’t being a parent or an adult. That is being an asshole who shouldn’t be married or have kids since your teenage stepdaughter is acting more mature than either of you.", "The results are in: you ARE the Asshole! Congratulations, you and your husband are raising a child who will hate you. For good reason", "YTA you basically made it look like you care for her as a mother figure,but only until you have children then she's not important ,jeez that must have really hurt that not only did you ask for it ,for your 'real' child but you yook it behind her back, also told her she now has to downsize her wardrobe, as clearly she will need less clothes being 13 compared to a child who is 2 with a vastly larger clothes collection. And now you will no longer be buying her clothes and she should bring them from her mother's. Move over cinderella we have a new comer in town", "Huge YTA!! So she is your daughter until you have biological ones then she doesn’t matter anymore. Also the comment about not buying her clothes?! Her father is responsible for buying her needs when she is with him. If he cannot afford all the children then he should get a second job. Not take away from one child to give to another.", "YTA and your husband needs to lose any custody rights.  This is emotional abuse.", "Yta. Do u understand that yet by the overwhelming response you have gotten?", "Absolutely YTA. \n\nYou cannot give a nine-year old child something important that she loves and then four years later say oops, no, it was a loan all along and you want it back for a more special child without being an unbelievable arsehole. \n\nClearly both you and her father are comfortable with her losing touch with you and ceasing contact as soon as she's old enough, and it doesn't sound as though you would be much of a loss to her.", "Yta you suck and your husband sucks.   How about step daughter get a new dresser since you are taking hers away. Or how about *you* downsize your clothes to a closet only and she can have your current dresser?", "YTA!!! and a major one at that. Like evil stepmother level asshole!", "YTA. You’re not going to buy her clothes anymore? Wtf? Why didn’t you just buy her a new dresser of you were going to want the other one back?", "YTA. Also, just bc you pay child support doesn’t mean you can get out of supporting your child at your house. Are you gonna have her start bringing groceries when she visits now too?", "Info: in your update you say you didn't tell her that it was just a loan, did you tell her it was expected to be given back when you have your own children?\n\nYTA.\n\nIf it was always intended to be taken from her, you shouldn't have gave her it.\n\nThen just because he pays support, he shouldn't provide things she needs at his home? All that will be left is her bed till one of your kids need it I'm sure. \n\nParents pay CS to support the child when they are at the other parents home, because believe it or not, he is still responsible for her. If your both struggling financially thats on you and him, maybe not add more kids into the mix if money and space are a issue?\n\nJust wait till that child support increases because she stops coming over. Its not even about the dresser, its about you and your husband driving her out.\n\nETA: you might be the adults, but only one of you gets to make the parenting decisions when it comes to her, and it's not you.", "This is a situation that you couldve so easily handled it differently and not been TA, but instead you chose to be the asshole. \n\none she is your stepDAUGHTER, she is your child. treat her like it. imo do not marry into a family with children from another family if you are going to treat them differently than your bio kids. thats not okay. \n\ni dont think it is awful for you to want to take back the furniture, i get wanting to see a kid grow up with something of yours, i had my moms furniture growing up, but ask her first. instead of just taking it away, tell her that you want to get her new furniture and take her shopping. give her a room makeover. make it fun. she is a teenager who now has to adjust to a baby. teenage years can be really hard and yes they might be older, but you have to still make sure they feel seen and special.", "I'm sorry, YTA. Stop treating her as though she is \"less than\" because she didn't come from your uterus. Just get her a new one, ffs. Poor kid. She is good enough.", "YTA    because you didn’t buy her a new bedroom set so you could have the old one. You had an opportunity to make it special for her and have her help get ready for little sibling to move out of your room. But instead you made her feel like second best and not important. Grow up and go give her a room make over. Make her feel special. The fact that you took the stuff out and set it on her bed was horrible. You basically told her to move out because you and your husband have your own family now. Apologize and make it right. Get your dresser back but do something nice for her.", "Just re-read once she grows out of her old clothes she will no longer need the dresser and you won't be buying her new clothes, how does that not scream child neglect to you???you need the money, what for you your husband an 2year old but not her, are you your husband and 2 year old not getting new clothes to save money or is it just her?? Don't worry I think we all know the answer", "Yta", "INFO:\n\n1) how old is your stepdaughter?\n\n2) did you tell her when you gave her the dresser that you planned to take it away?\n\n3) how often does she stay over with you? Is she there every other weekend, full time, what?\n\nI say this because it seems like you are expecting her to be very adult and understanding of this situation. It's going to seem like a declaration that you don't view her as your family.\n\nAlso if you didn't tell her, and probably remind her once you had the baby, that all your children get a turn with your old things then of course she's upset. I'm confused why you couldn't gift her a new one (new to her, secondhand is fine) and frame it as graduating to her own stuff. Could so easily have been a \"here's a nice new dresser, let's give your old one to your sister\" moment. \n\nShe needs to store clothes at your house. Even if her bio mom bought them, she's still going to need to keep some stuff with you. Spare clothes in case it rains, some warmer or cooler clothing for different weather, pyjamas, stuff for sports like swimwear, sneakers etc. \n\nIf you have any amount of custody, you need to maintain this basic amount of clothing for your stepdaughter. Child support doesn't mean not having to buy her anything yourself, it just means contributing to her welfare when she's not with you. Why wouldn't she have things in your house? You're her family.\n\n>we need both the money and space\n\nI hope I am mistaken, but this line has a feeling almost of resentment towards your stepdaughter. It's her home too, can't she take up any space in it?\n\nShe is not an outsider intruding on this new family you are building. She is part of it. She is at the foundation. Without her, your husband would be on a different path and the life you have now would not exist. I urge you to be compassionate and loving towards her, treat her with as much love as you show to your biological children. Without her, neither of them would exist.", "YTA do you refer to you step daughter as cinderella? I guess she’s not your daughter so why should she get anything. Jesus YTA", "YTA Way to show her you and her dad are putting your new children above her. Also why do you keep having children if you can't afford to clothe 1 you already have. You might not be required to but the dad sure as hell is.", "Question: did you make it clear to her in advance that she was only temporarily in your and her father’s life until you could replace her with a bio daughter?  \n\nYTA", "YTA.  Why don't you just rip the girls heart out and hand it to her?   You GIVE her something and then take it back.  You can't spend money on her so she won't have clothes anyway.  You're basically replacing her with your \"real children\"", "YTA You give her a dresser when she's 9, and expect her to be ok with you taking it back when you have your own kids now she's 13? Also, she won't need a dresser when she grows out of her current clothes because you don't intend to buy her any more? You and your husband couldn't make it any clearer that you don't regard her as being of value to her if you tried.", "Came back to say that I am concerned for your older daughter. Yes, the stepdaughter that you took on as a daughter and is, in fact, a part of your family. Your word choice and actions sound like you are treating you stepdaughter as a less valuable member of the family. I'm almost certain she has picked up on your preference for your biological child. Your husband should stand up to you on your behalf. He should be outraged at pain you're inflicting upon your oldest daughter. Take a good hard look at yourself and quit taking back gifts and doing awful parent things like refusing to be her new clothes. You shouldn't become a stepparent if you can't handle treating both a step child and biological child the same.", "YTA, he’s TA. Your poor stepdaughter", "YTA and your husband is an even bigger AH. I get you need space and furniture for your biological child. However, you admit that you gave your stepdaughter the furniture and didn’t explain that is was provisional on her being replaced by her half sister. You may have explained it to your husband that is not the same thing. You then take her furniture and leave her clothes on the bed and decide not to buy her anymore clothes. Your husband still has a legal and moral obligation to look after his daughter. He better believe she will remember this and the horrible way you have both ‘parented’ her. Why not just say ‘My husband And I prioritise our new child over HIS other child’?", "OMG. YTA along with your husband.  Massive, huge, ginormous As.", "YTA do you really have no idea what you have just written?", "YTA\n\nYou know that giving something to someone means you no longer control it right? By your own words you gave the dresser to her so therefore relinquished ownership. You know what it is called when you take something that isn’t yours right? So I guess you get to choose to either act a liar and thief or be an actual adult and accept responsibility for your actions. What values do you wish to teach your step child and your other children?", "YTA, not for the dresser but for the retaliation against a 13 year old.  It's your house, your dresser.  You can put it where every you want.\n\nWhat you cannot do is retaliate and play spiteful games against a CHILD!!!  Not buying her any more clothes so she won't need the dresser - spiteful.  Not planning on giving her ANY replacement dresser - spiteful.\n\nI'm surprised her father is in agreement with this train of thought.  The good news is your step daughter will stop coming to your house entirely since you have made her so unwelcome so your retaliation and your spitefulness will pay off in the long run.  Your step daughter will stop communicating and visiting her father and actually go No Contact, just like you wanted.  Nice job OP.  Terrorize a young teenager all over a dresser.  Hope you are proud of yourself.", "YTA. You should NEVER have given her this if you planned to take it away from her. How horribly cruel. You realise your telling her she’s not as important as your “real” children. You and your husband should feel very guilty about this", "YTA way to tell someone they aren’t worthy. That her Half sisters are more important. This is where the evil stepmother legend comes in", "YTA - your new baby girl comes along and all of a sudden all the things you gave the step daughter are rescinded. How painful must that be for her to realise you and her father class her as a second rare child?", "Wow YTA", "YTA\n\nYour stepdaughter was given a dresser set years ago.  Now, when you're having a child, you want to take back something you gave her?  Dick move.\n\nYou don't want to buy her more clothes when she outgrows them?  Dick move.\n\nWhat you and your husband are telling her is that she is not part of your family.  You're forcing her out and she's seeing this.  When she's 18 and off to college, that would be a good time to give your then 5 year old daughter the dresser set.  She might like it more then because it was her big sister's.  \n\nJust because you're an adult and the parent doesn't mean you get to be a dick to your stepchild.  Shame on you and your husband.", "There is a difference between “giving” something to someone and letting them use it. At the time, you let your step daughter use the dresser. She doesn’t live with you full time so she’s using it what 4 days a month? The issue with our society is entitlement. Just because someone lets you use something doesn’t make it yours. \n\nKids technically don’t own anything as their parents buy everything for them. Teaching kids to appreciate the things their parents share with them is a better mindset than teaching them entitlement and “mine” culture. \n\nIf the daughter is really that butt hurt, get her a replacement second hand dresser. But make it very clear to her; you allowed her to use your items. She doesn’t get a say when you decide to put them elsewhere. Simple.", "Please stop saying that you gave your stepdaughter the dresser as a gift. Obviously you did not. If you had made it clear to her at the beginning that it is simply household furniture that was being put in rooms, moving it around wouldn't be such a problem. But if it was only household furniture, you wouldn't need to take it away from your stepdaughter who loves it very clearly. YTA", "You thought you could use your stepdaughter to store that big dresser you don't use and don't have space for for free huh", "Your SD is 13 and it is her father's responsibility to feed, house and clothe her. I can't believe he is on board with mistreating his own child so horribly. He can't just stop buying her clothes when she grows out of them. If you can't afford to take care of the children you have you have no business bringing another child into the mix. YTA", "The literal embodiment of evil stepmother right here. YTA what the hell is wrong with you and your husband. Do you even like your stepdaughter, what has she ever done to you? This is BS, i hope her mom will let her stay with her full time she doesn't deserve this kind of disrespect.", "Yta\n\nTaking the dresser without replacing it is just a childish \nmove. By doing that you said, this is mine and you don't count. Adults are supposed to know that 13 yr old's don't see and, understand things in an adult way.\n\nBut the way you said \" our \" kids, blew me away. You definitely sound like there is a difference in your mind about the kids. \n\nHey dad, aren't they all \" Yours \"?", "You are severely lacking as a human. Do better. YTA a million times over.", "There’s no way you read over this and didn’t think YTA", "YTA... I'm both a mom and a step mom. I would never take a child's dresser away and tell them to downsize their wardrobe. That is one of the most asinine things I have ever heard somebody say to a 13 year old child... well any child for that matter. \n\nI understand you wanting to have 1 of your children use your childhood bedroom set. So quit being such a cheap ass and go buy her a dresser. You could even find one in a second hand store and refinish it.  Paint it her favorite color.  You don't just take things away from her to give to your kids because shes not your bio kid and leave her nothing to put her clothes in.  And the things you said about decreasing the child support for her and no longer buying her clothes is bullshit. You don't treat kids that way. And you can tell her father for me not to be shocked when she turns 18 and doesn't speak to either one of you ever again.", "YTA, I hope your stomach churns at night witch", "OUR DAUGHTER??? YTA!!!! She IS your daughter!!!!\n\nYou are some kinda special asshat aren’t you? You already threw her down a few pegs because she’s not “your daughter”! You are disgusting. \n\nThis poor girl now know exactly where she stands in the household. At the bottom of your totem pole. My goodness you are disgusting!!!! And so is your husband who happens to be her FATHER and should be taking her interests at heart. I hope she abandons you all when she turns 18. Gross!!!!", "YTA and you showed your step daughter how much she means to you. That dresser was given to her with no conditions. If you intended for your child to have the dresser you should've never given it to her. You made it sound like it's hers and than took it from her and gave it to her future sibling. Great way to ensure these siblings will have good relationship with no resentment. \n\nWhen it come to clothes you are even bigger AH, both parents need to provide their child with clothes and necessities while the child stays with them. Her mom doesn't have to give you any extra clothes when step daughter comes to stay with you. You need to provide your step daughter with clothes.", "You are amazing, OP! You have done a fantastic job of alienating a 13 year old from her father. Congratulations for showing a child that her half-siblings are more important than her  Fabulous choice in being so mean and clueless to a kid. She is clearly never going to feel equally loved or welcome in your home. Is this your intention, then well done.\n\nYTA.", "YTA \n\nIs this how you'd want your own child treated? Because this is where you're setting the bar. Your child doesn't replace a child. \n\nYou and your husband are selfish. You're dismissive of his daughter, who you're treating like an out of date appliance. \n\nIf your husband doesn't want to pay for his children, he shouldn't be making them. Frankly, this is shit parenting.", "Good god, did anyone tell you that the evil stepmother is not something to aspire to? Your husband is a shitty person too. YTA", "YTA, and so is your husband for not expecting his wife to treat his child as their own. If you want the dresser for your child then you should buy a new set for your stepdaughter. Child supprt doesn't negate you supporting the child while at YOUR home, it is for the mother to be able to support the child at her home. Your children are not more important than her. Get off your high horse wicked stepmother.", "YTA\nAre you kidding me!? You are willing to ruin a human relationship because of material possessions!!??\nYour children will not care about the fact that you are handing down furniture, trust me when I tell you they will care about how you TREAT a person, one that is your stepdaughter and their SISTER! \nEmpathy is a quality we are in desperate need of these days and you Ma'am (and your spouse) need a massive refresher course.\nGet over yourself and the fairytale storyline that \"handing down furniture\" is somehow this special notion, it is wood and glue that is all it is!\nIf you are so inclined to need some special hand me down, start with something small and not something you've already given to another person. For example my Grandma bought us birthstone rings and gave them to us on our 16th Bday. I bought my daughter's ring and on her 16th she'll get her's. Tradition is the story, NOT the furniture.", "YTA. Is this real or is it a Cinderella reboot?", "YTA wow Cinderella’s mom could take lessons from you.", "OP, does that dresser have a mirror? If so, look into it and you will see a Musky, because YTA times 1billion.\n\nYou gave her the dresser: your words.\n\nI could wax on about your appropriation of the Steps items you gave her, refusing to purchase her clothes, and your BS justification for doing so. Do you really need to have child support explained? \n\nI am left wondering when the step will be moved to the closet under the stairs, or onto the couch. I am willing to bet, if this is real, that those littles will Need her space and because she Only is there part time she does not need a permanently designated space. \n\nOP, you need to do better. Your husband’s daughters, all of them, deserve better. Do you even realize or recognize that the daughters share a parent? Maybe you just want to drive a wedge between this child’s family so she is out of the picture. \n\nOP, from the outside looking in, remember you gave us the view, you are a self-entitled dog chow eater. \n\nOP, you might want to get a therapist for the kids, all of them, one already needs one because of you and her spineless father, it is a good bet the others will have a lot of emotional baggage to unpack.\n\nHoping you can evolve and and really become a mother to All the kids. They deserve better than what you are putting out currently.\n\nAgape 💕", "YTA - You gave a child something, then you took it back. Worse, you messed with her stuff along the way. The rest is details. Hard asshole. She will never trust you again. This is all on you for failing to communicate that the gift was actually a loan. Give her back HER dresser. It is not yours anymore. If you don't do that and apologize sincerely and profusely, this child will disappear from your life once she turns 18 and you'll be back on Reddit wondering why. This is why. Right here. Bookmark it for future reference.", "YTA. 1. You never told her the dresser and nightstand were temporary. 2. Child support doesn’t mean you don’t buy her clothes at your house.", "YTA. For the one comment \"OUR children\". Do you not realize that his daughter is your kid now too? The moment you married him his daughter became apart of your family as \"OUR children\". And before anyone puts words in my mouth I never said her bio mom isn't her mom anymore.", ">The thing is my husband and I have also decided to stop buying new clothes for my stepdaughter as we already send her mother child support and we need both the money and space. \n\nYTA for this as well as for taking back the dresser.\n\nIf you wanted to save it for your kid later you should've actually saved it!", "I cannot believe you came here not knowing YTA. But maybe you really are that obtuse. Does your husband know you posted here? If so and he reads this I would like him to know he is walking a fine line with his daughter and if he wants a future relationship with her into her adulthood he needs to tell you to butt out and step in to repair this! I had a stepmother like you and my relationship with my father really suffered into adulthood and continued until he passed (he died at age 46). You don't care because it is more convenient for you to live with \"your\" family. It's furniture.... get over yourself.", "YTA on each and every level. If you can’t afford to buy new things for your new kids stop having children. Don’t steal back a gift. The step kid should drop you and her father.", "YTA.  Wow.  How can you not see that you just told this child she has no place in your family?  That she is not as important as your biological children.  I cannot understand how you would think this is acceptable behavior.  She may never forgive you for this", "YTA. If you didn’t want her to have it you should not have given it to her.  Trying to take it back after four years is ridiculous. \n\nAlso, as for your edits, you’re making yourself sound worse. Did you really just type that you won’t be buying your 13 year old stepdaughter new cloths since you and your husband pays child support. You are the evil stepmom right out of the fairytale and your husband isn’t any better. Shame on you", "One of the most important thing I’ve learned in adulthood as I’ve navigated romantic relationships, is that even during the bad times, during the silly fights and blow ups- your partner should still have respect for you. It shouldn’t be instinct to belittle or degrade you or hurt/harm you in any way. Physical or emotional. If a person says they love you, they shouldn’t want to cause you that kind of pain even when they’re upset with you (obviously I suppose there are exceptions to this rule, no idea, but not In this case). \n\nHer lack of emotional maturity led her to reacting to the situation instead of taking the time to respond to the situation. The two things are different. Never settle for someone who goes for your emotional jugular over a petty argument. \n\nI wish you nothing but peace & healing from this moment forward. Always choose your peace.", "Omg I know who you are!  You're that bch stepmother from snow white right?  I see you're still a compete AH. YTA", "YTA, you didn’t tell her you loaned it to her, that’s on you, give her the dresser back jfc, just because she’s a child doesn’t mean she’s property that you can just take things from", "It's people like you the reason I hated all but one of my step parents. You're a major AH. You should've specified that she wants going to keep it, also it doesn't matter if your husband pays child support she's still a child with no income. As a parent you are supposed to provide and care for your child. If this is the mindset you're going to have with your husband's daughter then she needs to go to her mother's. This was beyond childish and petty of you to go in there and take that poor child's clothes, leave them on her bed just to take back some furniture. Again MAJOR AH", "YTA. Wow. Like a MAJOR AH. How cruel you are. And I say this as a single parent with a partner who has kids.", "Honestly the whole situation could have been avoided. All you needed to do was let your stepdaughter know that she was going to get the chance to redecorate her room. And that you would move the old furniture into the baby's room. SD could have picked out a new dresser, accessories, etc, you could have looked like a generous supportive parent, and the baby could have had the furniture you wanted her to have as well. Instead, you've taken a piece of furniture out of SD's room, which leaves her with little room for her clothing. You've made it clear that she's not your \"real\"  daughter. And you look like a mean spirited stepmother to boot.\n\nYTA. And not very bright for not approaching this in a better way.", "Yta. If you and husband  don’t want to spend money and properly care for your stepdaughter then give up rights. Oh right that would cost y’all more money", "YTA you married a man with a child, that makes it YOUR child. Do you want to be the evil stepmother to your new kids big sister? I feel so sad for the sake of your stepdaughter, she's clearly just someone renting out a room with borrowed furniture. \n\nYou should go watch Cinderella and have a big hard look in the mirror, I think you'll see which character you are becoming.\n\nEDIT: spelling", "OP, she is 13, such a vulnerable age, if you and her dad want to have a good relationship with her and not hurt her, go about this better. \n\nIs not about the object, it’s about the feeling that gives, something that you gave her is being taken away by your actual children, that hurts. I hope you can reach out to her and talk it through. \n\nA 2yo doesn’t need a big dresser, their clothes are tiny don’t be mean. Maybe you can even make it a passage between sisters when they are older, but then at least take your stepdaughter to buy a new one, doesn’t need to be expensive, it needs to be meaningful. \n\nTeenagers can be even more fragile than toddlers, manage with care and kindness, you signed up for it and be careful not to teach resentment between siblings.", "…you expected her to give back her bedroom set of 4 years just because you’re the adults? No discussion when it was given, not discussion now? Thats so unreasonable. I would’ve be surprised if you didn’t discuss it because you KNEW how it would make her feel to know she only gets it until your “flesh and blood” came along.\n\nYou’re definitely can’t claim to be her parent bc you’ve made it very clear your bio kids are more important to you. \n\nYTA", "YTA and a terrible step mom. Also your husband isn’t a good father so you have that to look forward to.", "YTA \n\nYou gave the stepdaughter your dresser and got rid of her old one.\n\nNow, she doesn’t have her old dresser and you are taking away the one she uses & loves.\n\nAlso, you never told her that it’s a temporary arrangement.\n( You say you informed your husband that but apparently he never conveyed it to his daughter)\n\nIt’s clear that you don’t see her as a human being at all. Do you even remember how it would have felt to you if someone did that to you when you were 13?", "Wow.  Yta.  This was approached all wrong and clearly you and your husband don't think of your stepdaughter as family.  And then to remove her clothing?  And not to keep a few pieces of clothes that fit her at your house?  Or offer to buy her a new dresser and angle it as your daughter is getting the hand-me-down?  Why don't you just tell her you don't want her at your house anymore?  Oh wait, you already have.", "YTA, you outright state she was never told it was a loan yet she was expected to know anyway? How?", "Your husband not buying his child clothes which is in fact one of the basic necessities of life is a good way to have CPS knocking on your door. YTA\n\nStop having kids if you can't afford them....", "YTA and congratulations, you're an evil stepmom now, you gonna have so much fun being hated.", "Wow. YTA. Get her a new dresser. And buy her clothes when she needs them. This is his daughter and your step daughter. Your care of her does not end when you write a check. If you continue on this course you will alienate her. Do you want her to feel unwanted in your family? Do you want her to go NC because you prioritize your other children over her?", "YTA, clearly you pushed yourself on her to win over her Dad, now you've locked it down with a pregnancy you know you don't have to be kind. Grow up.", "YOU'RE THE A\\*\\*HOLE.\n\nIf I were your stepdaughter I would go home to my mom and never come back. Shame on her dad for even going along with this crap. Its a dresser get over yourself. You think a literal newborn needs a dresser more than a 13 year old", "YTA. Could you try any harder to show her that she isn’t “really” part of your family now that you have your own kids?  Her father should be ashamed of himself. Did you consider that it was special to her that you gave her that dresser? Plus you guys made her get rid of her old one?! So now she just doesn’t get one? This whole story is ridiculous", "Unpopular opinion, NTA - redditors please keep in mind you are talking to a pregnant OP so maybe tune down your flaming?\n\nThe stepmom here has a deep sentimental attachment to her stuff and wishes to pass them to her children as inheritance (at least emotionally). Giving it to her stepdaughter was a sign she accepted her as her own. Now that the older sibling is growing out of the need to use it in their house, let the younger kids use it. Esp since it seems bio-mum is the main provider for stepdaughter.\n\nPassing down stuff from teenager to toddler is normal and is by no means evil stepmom deed. Especially if the young pregnant mom is in financial stress. \n\nIt seems the stepdaughter might act out simply bcs she fears that she's losing the love and her younger siblings will replace her. Can't you let her know this is not the case?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nF30 \nWhen I first married my husband (M36) and moved in with him I decided to give my stepdaughter my old dresser and nightstand from my parents house. My set was much nicer and she loved it so we got rid of her old dresser during the move. \n\nIt’s been about 4 years now and my husband and I have a 2 year old daughter and are expecting another girl in February. We have been co-sleeping with our daughter since she was born and she has shared our room, but now we need to move her into her own room. I have always wanted my children to have my old things from my childhood and that included the dresser set. When we gave my stepdaughter the dresser I had made it clear to my husband that once we had children OUR children would be using it since it is mine. He agreed and still agrees with me so we decided to discuss it with my stepdaughter. \n\nShe was upset that we were taking it away, we tried to ask her to downsize her things so that she can store her clothes in the closet but she refused saying we should just buy a new dresser for our daughter. So after she left we decided to leave her clothes on her bed and take the dresser out ourselves. After she came back the next weekend she waited until we left the house and moved the dresser back into her room. My husband had another discussion with her and we let her know that was unacceptable. \n\nNow her mother is involved and is calling us telling us we are being unreasonable and should just buy and new set. The thing is my husband and I have also decided to stop buying new clothes for my stepdaughter as we already send her mother child support and we need both the money and space. Once she grows out of her clothes she will not need a dresser so there is no point in buying a new one when we need to save money. \n\nTLDR: I am taking back my dresser that I gave to her a few years ago so that my daughter can have it and she is refusing to let us have it back\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Yta. A big one. You gave your stepdaughter something. Then you are trying to take it back for your 'real' kid.", "Yup, talk about a step- ~~monster~~ mom, she and her husband are also thieves. \n\nYTA OP", "I would be asking mom to get the custody order changed so I never have to go back there! Especially since OP is saying they won't be buying her new clothes because they pay child support to the mom?!", "According to OP's post they don't even have money to buy the stepdaughter new clothes, so if that's the case then they absolutely won't have money to buy the stepdaughter a dresser. Jeez, I feel so terrible for the stepdaughter. I hope she goes to live with her Mom full time!", "Op straight up capitalized \"OUR children\" and doesn't get how she's TA.", "She says they don't any money.  But they should be able to find free/inexpensive furniture at garage sales and Craiglist.   They could then refinish it as a family project to welcome the new baby.     But no, OP has to jump at the chance to make it clear that the step-daughter is not part of THEIR family.", "The OP knew what she was doing when she deliberately chose not to tell the stepdaughter about the deal with the dresser. She either doesn't respect the stepdaughter as a young independent girl, or she knew the stepdaughter would fight her on it and is trying to go solely through the husband to get her way.", "This. Every word is true op. YTA.", "Agreed. OP is incredibly cruel. Poor kiddo.", "Right? I don't understand why they didn't just let stepdaughter pick out a new dresser for herself. I mean like, it could be from Target or Ikea it doesn't have to be heirloom furniture, but it would be all hers.", "Your child does have your old things from your old life. You gave her the dresser and the nightstand didn't you.", "Huge Evil Stepmom in the Making, sounds like the title of a REALLY scary movie.", "But, but, but..\n\n> and we need both the money and space. Once she grows out of her clothes she will not need a dresser\n\nThey are planning to ease her out of the family as she outgrows what she has at their house.   It's become inconvenient to have her there with them.", "Oh I’m waiting for the why won’t the stepdaughter come and spend time(babysit) her younger siblings", "That would’ve been a great way to solve this. Instead OP chose the Cruella Deville route.", "[removed]", "YTA If you never let her know it was a loan than she probably thought this was a gift and it was probably very significant for her.", "I hope the mom blast them on social media I'm more pissed at the dad that he allowed this", "That’s when the second child is born", "[removed]", "No it's not the same. The thing will not stay in her bloodline family. Idk what is wrong with a woman wanting her biological kid having her own stuff. Stepdaughter has a extra bio-mother who can, and should, do the same for her.", "I am absolutely disgusted and angered in her defense. That is such a huge blow, and I hope she never wants to see you or your husband (for agreeing with you) again", "And the husband because he’s a complete horror as well for condoning this.", "Evidently they got rid of step daughters because hers was a nicer set. But now they're not even replacing it at all..DB move", "This.", "This post made me sick to my stomach. That poor girl.", "The way I read it she told her *husband* not the stepdaughter that she’d want the dresser back.", "Because apparently once the stepdaughter outgrows the clothes that are currently stored in the dresser, she will be expected to walk around naked, as they will not be buying her any more clothes... because they already pay child support and they need to save money.", "Probably her secondary intent. She drives the SD away and she gets to have her own perfect family without a reminder of her husbands life before her.", "Right she admits she didn’t tell the stepdaughter of that. And I don’t understand why if she insist on taking it why not get the stepdaughter a new dresser? “I know you like the dresser but I always wanted to have my childhood dresser in a baby room. Let’s go shopping for a new dresser just for you” Have her pick one out she likes. \n\nAlso “we’re not buying her more clothes because her mother gets child support.” That’s neglect. \n\n“Our children”  🙄", "And she not even a \"SWEET evil woman\". Just an A-hole", "Yes me 2...this woman is the worst !!! \nPeople these days are disposable 🤮\nPoor kid and poor baby sisters who have this kind of woman as a mother.", "That's not exactly what she says- she says that they already send mom child support and could use the money for other things, which is always true. Any money I spend on anything could be used for something else.  Op sounds like a giant AH so I'm guessing she thinks that step daughter is already \"taking away\" from her \"real\" kids because of a child support order she has no say in. \nShe doesn't say they can't afford to buy things, just that she doesn't really want to and the freeloading kid doesn't need that many clothes anyway", "So does OP", "Or both and the third part, didn’t care how her stepdaughter feels at all about what she says because her and dad are the parents.\n\nOP, make-up your mind. Are you her parent? Then don’t treat her differently to your own kids. Don’t go through her father to justify it as parental, it isn’t. And I’d you think parenting is command and obey, you’re missing nurturing love and compassion. Command rarely works and kids don’t just obey, they have feelings.\n\nAre you not her parent and only step in the formalist sense? Then you shouldn’t have given the dresser to begin with, and now you have it’s up to her actual mother and father to decide what she should do as HER parents - not you. You’re the person who gave her a dresser and later told her dad it’s a loaner. After throwing out her things…and you told her dad whom you obviously know is a pushover with you and doesn’t stand up for his kid. \n\nYTA absolutely, however you slice it.\n\nBtw your kids have your dna, and it sounds like you’re taking back the one nice thing you did for your stepdaughter and made sure she had something of yours.\n\nI feel like your feelings were wavering and now changed towards the stepkid, and now you’re using room arrangements to separate. It’s cruel, whether you acknowledge it or not.", "She was nine, why would a 9 year old just *assume* they own the dresser now?", "I wonder if they are also taking the stepdaughter's room? She says they \"could use the space\" and wants stepdaughter to only have enough clothes to fit in a closet.", "The OP is truly infuriating me.  The more I think about the behavior, the angrier I get.  As a divorced person with a kid, who is dating another divorced person with kids, I cannot imagine making this kind of choice.  When you are with a person that has kids, they are a package deal.  If you can't handle that, then don't do it.  If you get married, you are marrying into the family.  This is just so gross.", "I can't even.  This is why Cinderella was written.", "The OP will certainly be confused as to why her baby's older sister doesn't want to spend any time with her. /s", "So sad right? I don’t think they explained the dresser was borrowed and someday they would take it from her (still very shitty) but even maybe for this girl this was a nice gift from stepmom, part of bonding and now she might feel completely displaced by “her real kids”. \n\nThe post  doesn’t even imply any kindness or care about it, a proper talk and offer to pick a new one together, and even worse “we won’t buy her clothes anymore, so why would she need a dresser?” AWFUL.", "Are you really asking what is wrong with making sure the step kid knows that they always are going to be less loved then her bio kids ?\n\nIt's not about the furniture. It's about the message that she is sending to the step kid to stay in her \"not-my-real-kid\" lane. If she wanted her \"bloodline\" to have the dresser, she should have put it in storage and buy another on for the stepkid at first.", "facts they’re both awful people and his daughter deserves better", "Absolutely! It’s not like the 9yo paid for it or anything. If a 9yo wants furniture, they should get a job like the rest of us. /s", "Tell me you view her as the other woman’s child without telling me you view her as nothing but a temporary guest in your home and the Cinderella to your perfect children…\n\nYTA by the way. Don’t be surprised when your step daughter wants nothing to do with her father bc of you and your favoritism to your spawn", "YTA. You’re teaching this girl that she’s not as important to you as your biological children and definitely building resentment. Telling her to downsize and give up furniture you gave her for her half siblings is just wild. You admit you didn’t tell her that it was a loan. Therefore it’s a gift. And you want to take it away knowing you already threw away what she started with. \n\nIf it’s that important to you for the younger girls to have this furniture then you need to replace what your stepdaughter has with a really nice brand new set asap. She gets an upgrade if you will.", "YTA and you know it. I think I need to take a few weeks off from this sub. It's getting harder and harder to not just reply \"Fuck You\" to a lot of these posts. Especially the parenting ones.", "Your edits do not help your case. You won’t even replace the dresser and you don’t want to buy her any more clothes because her dad pays the minimum obligated child support? You’re both damaging this poor child. \nI hope her mom doesn’t let her return to your home where she’s basically treated like dirt and like she’s not a part of your family. \nYTA May your kids never have a step parent like you.", "YTA\n\nSo much of an A H that you should consider auditioning for Disney movies.", "Child support doens't work like that, your husband has to have a enviromment equipped to attend his kid needs while she is there no matter if you consider the amount of time little. Not talking about the loan before is an mistake that both made and now the kid is paying for. \nYou are mother now have more empathy.", "Sounds like the ex should just keep her full time and have your husband pay even more child support. Doesn't sound like he's interested in being a parental figure, only in continuing to get his dick sucked.", "YTA.\n\nHey beautiful bonus daughter, I want to let you have something of mine that I cherished from when I was a little girl.\n\nNew kids come: Sorry step-child. Give me MY stuff. They are for MY children...not you. You aren't flesh and blood.\n\nCan you see the hurt in that?", "YTA and a major one. You lost me at your OWN children. She is your child. She was there before you. Poor girl deserves better. Speaking from the experience of having an evil stepmother and pushover father, she will never forget both of your behavior.", "YTA. You should've explained to her from the get go that your \"gift\" was temporary. Basically using her room at storage until \"your\" kid came along.  Or better yet, should've just left it at your parents. Also \"had children OUR children\" ... really? Let's add another YTA for that.", "YTA - I wish I could send this to her mother's lawyers you cold, heartless oxygen thief. Everyone else covered the other talking points so I'll refer you to every other comment with the same verdict for the rest of my opinions.", "YTA If I was her mom I’d be considering asking the court for 100% custody, revised support payments, and amended visitation so your husband has to meet her without you and PAY to be supervised.\n\nYou threw out her original furniture. \n\nYou STOLE HER ONLY FURNITURE WITH NO WARNING.\n\nYou told her to throw out MORE of her stuff, so you wouldn’t have to buy her furniture because you threw out her stuff.", "YTA. You didn't tell her it was a loan and should have if you discussed it with her father.\nAs a grown woman who had a step mother like you, don't be surprised if your stepdaughter doesn't visit when the courts tell her she has her own voice and don't expect her to have a relationship with her half siblings.\n\n>as we are the adults and the parents\n\nWay to abuse your authority", "YTA.  So much TA, Lady Tremaine.  I'm getting teary-eyed at how horribly you are othering your stepdaughter and that your husband is allowing it.\n\nThat you aren't going to even have a place for her to keep her clothes, and that you don't want to buy her clothes (and god knows what else) because your husband pays child support (like he's supposed to) is horrible.  Next, you'll probably kick her out of her room and make her sleep on the couch.\n\nI'd warn you that she's going to go remove herself from your lives, but my guess is that would probably make you happy.", "YTA.  And so is your husband for going along with it", "YTA. People have already told you why. And honestly, if you can’t afford a new dresser for her or even new clothes for a growing teen; you shouldn’t be having another baby. You clearly can’t afford it, and you’ve both made it obvious the 13 year old is going to be the one to suffer for your bad decisions or lack of planning.", "YTA—and a horrible step mom. Child support doesn’t cover even half the costs of raising a child.  Your husband is just as bad a father for not sticking up for his daughter", "YTA\n\nIt sounds like you saw your step daughter as some sort of back up in case you couldn't or didn't have kids but now that you have one, you feel like your step daughter has no more use", "YTA - Wow... way to make a kid feel unwelcomed and unloved by her father and step mother? Really?", "You're the reason us stepmoms have such a bad rap. You are basically telling the poor girl that she's essentially a guest in your home and nothing more. Taking the dresser, refusing to buy her clothes, making 'YOUR' kids a priority over her. May as well call her Cinderella and tell her to go F herself. YTA and so is your husband for agreeing to this and allowing you to treat his kid that way.", "YTA\n\n\nYou are a giant asshole.", "Your husband needs to grow a spine and look after his first child.", "YTA and I have literally nothing else to say. Have fun being the evil stepmother.", "YTA and are very petty and callous, I feel so badly for your step daughter and hope she gets away from you to live a better life.", "Holy. YTA. Your husband’s poor daughter! I purposely don’t include her being your daughter, because you absolutely have made sure that she knows you don’t consider her one. The AUDACITY of you to do this to her. Your husband is the AH as well because what the heck? You can’t just refuse to buy her new clothes and stuff because you have a new baby around. Imagine being that poor girl and learning that her dad and her dad’s wife hate you and won’t even give you your basic needs. I feel bad for all the daughters, you sound like a terrible mother.", "YTA\nYou threw her stuff away and gave it to her with the expectation of taking it back without telling her. What a shitty perosn", "YTA If you weren't going to let her keep it you shouldn't have given it to her in the first place.", "YTA. Wow, so you give her something that she loved and was important to her then you snatch it back the moment you have other kids then tell her off for having feelings about it? Wow.", "YTA. Big time. If you are aiming to be the stepmother from Cinderella, you're off to a good start.", "YTA \n\nSo you have never made it clear to this child that this was a ' loan ' not a gift and you always intended to take it back once you had your own bio kids. \n\nYou basically just needed storage until you had kids. \nDo you even realise this child has feelings and you're crapping all over them? \n\nYou went in her room, removed her things and took the dresser after she made it clear she was not happy to give it back? Wow. If you want the quickest way for her to resent you, her dad and her half sisters, this is it. Expect her to spend less and less time with you as she gets older.", "YTA\n\nYou gave the dresser to her, it is no longer yours. \n\nHer father is obligated to buy her clothing, etc. until she reaches adulthood, non-negotiable.\n\nGet over your selfishness and accept that your stepdaughter isn't going to simply disappear just because you're popping out a couple of kids of your own.", "You waited for her to leave to move it.\n\nShe waited for you to leave to move it back.\n\nYou told her that her behavior was unacceptable. But you are the modeler of this unacceptable behavior.", "YTA. I can't believe no one has mentioned this I think but you first give her the dresser, make her throw away the old one, take hers back and say she needs to buy one herself.", "4 years ago the SD was 9, and had you told the 9 year old that you were loaning her the dresser, and that she'd have to give it back any moment you wanted it back, she may not have accepted it in the first place. At 9 kids are pretty smart like that.  I feel like it's totally unfair to a child to give her something and then take it away just because \"you're the adults and the parents.\"    \n\n\nIf this is any indication of what your parenting is like.. sigh!   \n\n\n# YTA", "“Hey, kid, you know that thing I gave you when you were seven? Well that’s actually only for my real kids, your dad’s new kid that is way more important than you. So give it back because you don’t deserve it, my actual kid matters so much more even though she’s too young to have any concept or care about her bedroom furniture. “\n\nThat’s what you’re telling her. Bang up job as a stepmom. You’re straight up telling this child she doesn’t matter enough to you to consider her feelings. But why be good to a step kid? She isn’t YOUR kid after all. What she feels isn’t important. YTA. A huge one.", "Major YTA. Are you trying to audition for Disney evil Cinderella step mother? I mean you are not far of... Take furniture away, not getting her clothes, making sure that bio kids are better treated, making her feel worthless... But the worst is that at least Cinderella father was dead and not part of it all.", "YTA, absolutely. First of all, you making a point of referring to your daughters as \"our children\" says a lot about you since it was completely unnecessary in the context of your statement. We were already clear on that point. It would have been so easy to offer to redecorate her room(which can be done with little financial sacrifice). That would have achieved a few things. Making her feel like a valued member of the family, spending time renewing your relationship, and getting the old furniture back for \"our\" children. There's a reason that step mothers get a bad rap.", "Take her shopping and let her pick out a new dresser and nightstand. Even from a thrift store and she and her dad can refinish it together. \n\nI went through something similar with my SIL and my grandmother’s dresser. I relented because I love her and family harmony more than a piece of furniture.", "I don't see the problem with buying your stepdaughter a new dresser set. You could even let her pick out what she wants. Or just wait until she's an adult and moved out then you could give it to your younger kids. YTA for real and so is your husband for going along with this childish behavior.", "YTA", "YTA\n\nSo many things  are  wrong here.She may not be your bio-daughter, but in marrying her father you took on a responsibility to be a parent. You use phrases such as \"our daughter\" and  \"my children\", but your stepdaughter is also your, both of you, responsibility as parents.\n\nIt's clear you consider her a lesser member of your family because she's not your bio-kid, So much so that her half siblings have priority.  You use phrases such as \"our daughter\" and \"my children\"\n\nYou gifted the dresser and nightstand to her.  So much so you got rid of her previous furniture to replace with this gift.  Do you do this with other gifts?  \n\nHaving provided her with a replacement dresser, and getting rid of her original, you then take away the only dresser she had left, unceremoniously dumping her clothes  out of it.  She doesn't get a dresser, but her sister does?\n\nYour husband is also TA.   If blood relations are so big a thing, where's his duty as a father to 'his' daughter.  No wonder the girl's mother is kicking up a stink.  So now she is being sidelined by her father, and her mother's usurper - because that's what you'll become if you keep on this track.    This path breeds resentment, both to you, and to her siblings.   You've destroyed her trust in you, and unless you repair that, the rift between her and both her parents will only grow wider.\n\nApologise to her, for sidelining  her in favour of her younger siblings.  Give her back the furniture you originally gifted her.   The two your old won't notice, but she certainly will.  Buy another set for the younger kid.\n\nThen, if I were you, I would take some time to sit down with your husband and discuss what it really means to be a parent of three children (as will be) in your care.", "YTA - Massive.  What a way to make her feel loved.  She has every right to be hurt.  You didn't even offer to get her another set.", "Well this whole thing is really just evil.", "OUR CHILDREN…YTA bigly.", "Tell us you’re Evil and care nothing about your stepdaughter without telling us. YTA", "As a stepmother myself, YTA. My stepson alway had his own furniture in his room that we bought, we bought him clothes to keep at our house or take to his mom’s. We also bought whatever he needed whenever outside of the child support. I can’t fathom treating a kid so terribly. When you married the man, you became a bonus parent to that child. You are horrible and this girl will resent you. \n\nI’m also saying this as someone who is a step child. My stepmother was awful like you and because of her I no longer have a relationship with my dad. I knew if I ever had a step kid, I would treat them like my own.", "YTA and so is your husband. Sounds like you're planning to just throw away your stepdaughter, at least until you need a babysitter. Don't be surprised when she wants nothing to do with her younger sibling.", "YTA. Second only to your husband whose allowing you to treat his daughter like absolute garbage. You're a disgusting person.", "You both are AHs. You and her father. I hope this child decides to go no contact. At least until she is old enough to know her real value because your actions toward her has told her a lie. I hope she has more love on her moms side because he dads side is terrible. The love was not real, that’s clear if nothing else! “We are the adults” = wrong is right if we say so and F my child’s feelings.", "YTA…you and your husband both suck. That poor child.", "yta, you & your husband should be ashamed of yourself.", "YTA. And you know you are pushing the daughter away so your kids are seen as the real kids.", "YTA. 100%. Makes me so sad to hear that children have adults like you in their lives. On the plus side, you'll probably be seeing a lot less of your stepdaughter now that you are going above and beyond to let her know that she no longer matters to you now that you have a biological child of your own.", "YTA, way to make your step daughter feel like she isn't family in her fathers home now that he has new kids. \n\nThis is why people go no contact with parents when they turn 18. This is TERRIBLE parenting.", "As a kid who went to her dad every other weekend, I always brought clothes with me. So that is not odd for me, it is slightly weird to do this only now that there is a kid and one on the way... it gives a certain message\n\nI only had a bed in my room until I was like 14/15 and my dad got a new girlfriend that the interior changed and it was really promoted for me to have my own stuff there as well as I was \"living\" there too even if it was just 2 days out of 14. My opinion was not asked and even though it seems great, I wasn't ok with it.\n\nYou didn't tell your stepdaughter it was a loan, you asked her if you could move it to her half sisters room, she said no and you did it anyway thay make YTA.\nThe opinions of a kid do matter, if you would do it anyway you shouldn't have asked.\n\nSo although I can understand where you are coming from YTA, imagine how you would feel as a 13 year old when this would happen to you. Would you be okay with it?", "YTA and an evil stepmother. You and your husband suck", "YTA, you are not a parent. And what did you stepdaughter do, that you hate her so much? Honestly, you don't deserve this sweet girl as a stepdaughter. I hope her father finally understands that you don't deserve a place in her life.", "YTA as soon as I read the title of your post, I knew that you were the stepmother and not the stepfather. This is the 3rd or 4th post today about a selfish stepmother. Taking the dresser, nit buying her clothes anymore. Sounds like you're trying really hard to drive her out of the house. Good job so far. No wonder so many fairytale are written about evil stepmothers. Oh! Your husband is an a-hole too, for not standing up to you and for letting you treat his daughter like this. Sounds like he needs to take his testicles back from you. Either that or grow a pair.", "YTA and a terrible stepmother. That is all.", "YTA. And stop trying to defend it. Especially since you did not tell her beforehand. The fact that you’re continuing to argue in defense of your childish behavior is telling. Telling her to downsize her things because of your selfishness is absolutely disgusting. Why should she have to throw her things away? You are actively becoming a wicked stepmother. The fact that your husband is co-signing your behavior is hugely problematic. The right thing to do would be to buy her a new set if you are that determined to have it. Asking her to throw away her things to accommodate your ridiculous demands is selfish. Especially since she was never explicitly told you would want it back. A dresser and nightstand are hardly precious heirlooms. You and your husband are treating her as an afterthought and she deserves better.", "YTA - so selfish and disgusting. You should reevaluate your life choices.", "As my dad would say, you are a bad bi***. YTA.\n\n\nShame on you and her father. \n\n\nWhen he leaves you and starts again with the next daft woman I bet you find out the pain you're causing your step daughter through your own daughters hurt feelings.", "YTA no other comment needed tbh", "YTA", "YTTA - stop using 'WE' or 'MY husband agrees with me' - when you mean 'my husband wants a quiet life' or 'my husband doesn't care one way or the other' or 'my husband is a spineless git'\n\nWe needs the space and the money kid, WE have a real child now.  Time to sling your hook!  Once you've grown out of all the clothes in that closet, your time here will be finished.  No need to come around here any more\n\nSince he pays 'child support' there shouldn't be a need for him to see this early attempt at a child any more - he has a REAL daughter with you\n\nHusband is going to regret this later in life when his eldest daughter won't give him the time of day.", "What a way to break a young girls heart. YTA. You should have never gave/ loaned her anything.", "YTA. You are taking things away and not replacing it. You aren’t providing clothes for her?! Do you not understand she is still your husband’s child? He has to provide for her beyond child support. How unfortunate you are her stepmom.", "Wow.  You are most certainly the a hole.", "You remind me of the streotypical villainous stepmother. Taking away something you gave to a 13-year-old? Can you be crueler? Grow up, seriously.", "YTA and a crap mom.", "YTA\nI'm so over these adults who get into serious relationships with people who have children and then treat said child as an inconvenience and go on about THEIR OWN children and how they are more important. Newsflash, if you can't treat your children (both peoples)equally then don't fucking bother getting involved. I have 2 stepchildren and I love the arse off them both as well as my biological kids. I would do anything for them even when they are acting out. You do realise how unwanted you are making her feel dont you? Well done for giving her a bag of issues as she grows up.........\nAnd well done her father for backing this bullshit up. Go and buy another dresser, it is still in your home wtf is your problem?", "YTA.... how on earth could this man marry you and allow you near his daughter... what a horrible  horrible  choice  on his part", "YTA, you are absolutely an AH. Just tell the kid she doesn’t matter and should stay at her mothers because she’s been replaced. The poor kid. Your husband is also TA for allowing your treatment of his child.", "YTA. You're responsible for providing your stepdaughter a dresser. Either the one you gifted or another one you buy for her. She had a dresser and you got rid of it. It's YOUR responsibility to replace it. \n\nAlso, her father is still responsible for buying his 13yo daughter clothes. Wtf is wrong with you??", "Are you taking away her room next since she only spends weekends there?\n\nYTA", "YTA. You sound like the type of person who will make your stepdaughter step out of the photos at Christmas so you can have a photo with “your family”. Vomit. Why even marry someone with a kid if you act like this. Go whine in the step parent subreddit", "I was going with NTA until the end where you said you never told your stepchild it was a loan. Should've stored it somewhere instead of making a child think that it was her furniture. YTA.", "YTA and definitely put the wicked in wicked stepmother. Absolutely horrible.", "YTA!!! What a wonderful way to tell a child you’re not as important or loved as our own biological children and you never will be. 🙄🙄🙄", "YTA. Of course she's upset and reacting this way. You never once bothered to communicate to her that this was a temporary arrangement prior to giving it to her. Stop being so selfish. Have you even stopped for a split second to put yourself in her shoes and try to see things from her perspective?  If I were in her shoes my perspective would be that I am NOT wanted and I am being shoved out. At the very least, you should purchase your stepdaughter the new set and not just force her to downsize like that. Your selfish actions and lack of communication in this are causing the behavior out of her. Take her shopping and have her pick out a new set and make it special for HER.", "BOOOOOO YOU SUCK YTA. I also think it’s sad that you’ve known your stepdaughter for 4yrs and don’t consider her one of your own. Just sad", "Yta .... I mean clearly", "Straight up YTA. \n\n1. If you were planning on having kids, you should have saved it for them and not given it away.\n\n2. You should have made it clear before hand it was a loan and let her decide if she wanted to go that route or not. Put herself in her shoes. What if your stepmother did that to you. Gave you something and then decided to take it away.", "YTA you tossed her dresser, gave her yours and now leaving her with nothing.  You expect her to live out of a suitcase when she outgrows her clothes in her father’s house. It definitely won’t feel like a home to her.   I can’t wait until she doesn’t want to live in your house or see you anymore.   I feel bad for her father because you are causing a rift between them.", "YTA\n\nYou said that you made it clear to your husband. But did anyone make it clear to the step daughter especially since you tossed her stuff. Think about that for a moment. You gave her a dresser and tossed hers. So, it can appear like you gave it to her no strings attached. \n\nThat is one thing my stepmother did do right. When I was starting out she gave me a set a dishes, but had me promise if I didn't need them anymore I would give them back. Which I did after one move.", "\"She doesn't even need the dresser because we already decided not to buy her more clothes...\" WTF YTA", "Wow, OP, why didn’t you mention the Cinderella stepmom was based off of you? Embarrassed because it’s so old? Don’t worry, I hear being soulless helps you age better. YTA and you have made it clear who belongs in YOUR new family. That poor girl.", "I don’t even know how to start. You got rid of her dresser and replaced it with your set and then TOOK IT Back. You stopped buying her clothes. YOU HAVE MADE EVERY EFFORT TO MAKE HER FEEL LIKE AN OUTSIDER. AT 13. I hope this isn’t real because you both are the absolute worst. You act like she’s this burden instead of a part of the family. You should be ashamed of yourself.\n\n\nETA: you don’t get to use the “wE aRe ThE pArEnTs” excuse and then stop paying for clothes for a 13 year old child.", "YTA YTA YTA. Your husband is an AH. Your future child/children are probably going to be AH’s because they were raised by you. Let me be clear, YTA. Ughh…", "How hard would it have been to wait until your stepdaughter graduates & moves out to pass the furniture on to your child? They’re a BABY they don’t give an f where their clothes are stored. YTA.", "YTA….\n\nReally nothing further to add that others haven’t already said.", "Yta and dont be surprised if that kid hates you later on !!", "Sounds like you're trying to push your step daughter out of the way for your \"real\" child. YTA, and am incredibly disgusting and selfish one at that", "YTA. In your own words, you are making sure this 13 year old knows you do not view her as your child. Maybe she isn’t biologically yours, but I would hope when you married your husband, you viewed her as part of your family. You will drive a wedge between yourself and her the more you treat her as “other” than your biological children.", "Wow you're like the stereotypical evil stepmother. YTA", "YTA", "If Cinderella’s stepmother was a real person , that would be you.\n\nYTA - massively", "You’re such an asshole it’s painful for the rest of us. \n\nYou’re treating your stepdaughter like a second-class citizen who matters less than your biological daughters. You didn’t tell your stepdaughter the deal so from her perspective you’re stealing her furniture to give to your “real” daughter because your “real” daughter matters more. Something tells me you won’t disagree with that thought, since you’ve also decided to stop providing her a basic need (clothing) because….other daughters need stuff and less need for the furniture? You are so out-of-bounds here! You need to stop pushing your stepdaughter out & accept that she is part of your family, full-stop. \n\nIn case you need it put more bluntly, SHE IS NOT LESS WORTHY THAN YOUR OTHER TWO CHILDREN SO STOP TREATING HER AS THOUGH SHE IS. Your husband should hear it too, btw. Hey sucks too. YTA.", "YTA.  You and her dad need to replace what you are taking away.  How could adults think this is okay for a second?  What's wrong with you?  You took away what she had.  Replaced it with your old furniture and now you are, taking that away but not replacing it with anything else?  YTA", "YTA. It sucks that she wants to keep it but you can’t just take it from her. She is a person who believed it was a nice gift. Your husband is an idiot for going along with your nonsense. Granted it was also his place to explain the set wasn’t a gift. The fact that you think because she’s only there every other weekend makes her less of a child in the house tells me you shouldn’t have been involved with a man with kids from a prior relationship. If he values maintaining a relationship with his daughter he needs to stop listening to you. Clearly you aren’t concerned about the relationship with her as you’ve pushed him to cut her off.", "YTA you said your the parents then act the ADULTS. You’re being petty to a 13 year old", "Dude you fucking suck. YTA. Your poor step-daughter, your contingency is that she won't even have enough clothes to store at your house? Jesus.", "HUGE 100% USDA YTA!\n\nYou want to ruin your and your husband's relationship with your step daughter over furniture? That's just...I don't even know what that is. Awful is the only word that comes to mind. \n\nI mean Jesus on wheat bread, YTA", "YTA", "I was going to say this, N T A for wanting the dresser for the child that she gave birth to, but super YTA for just leaving her clothes on the bed. As I was reading I was waiting to say N T A when she offered to buy a new dresser and the step daughter refused or something, but it just kept getting worse...", "The child isn't even upset that she's taking away the dresser. She just wants it replaced. And the \"downsizing\" and not buying her clothes thing is bad. Clearly they want to push the kid out of the house until she is just an occasional guest not a member of the family", "And then she says that they never explained the furniture was being loaned but it’s expected that when a parent asks for something it’s handed over. Sure, something small and trivial, maybe. What parent takes away bedroom furniture?", "She’s not leaning… she full on dived into that toxic cesspool.", "How much are we betting that the step daughter stops all visitation with these horribly unreasonable and selfish people? I would, I bet that poor little girl is feeling so unwelcomed. They could have easily bought her a new set to make sure she felt important to her younger half sisters. Those small children don’t care what’s in their room, it’ll most likely get ruined by small children anyways. At least in the older daughters room she is at an age where she can respect the items in her room and look forward to their longevity. Talk about cruelty.", "OP is going to chase the kid out of the house and then he schooled that child support goes up when ou have less custody.", "Seriously.   \n\n\n\"I think it's time we get you some more furniture. We'd like to use this older stuff for the younger kids, so how about we go buy you something new? We can redo your room.\"", "But they don’t realize is when that happens CS will go up.", "THIS right here. And the fact that you said to hubby that you wanted the dresser for \"our children\" which um includes her, because you married the guy and its his daughter??? Like why are you so petty? Just let step-daughter have the dresser and when she moves out, your baby can have it. I doubt your 2 year old cares what kind of dresser is in her room. SMH. YTA", "Not to mention the toddler that they already have. That’s who I think the dresser is going to. I can’t wait for the next post “AITA: my stepdaughter doesn’t like her step sisters and doesn’t want to come to our house anymore” because this is surely going to cause a lot of resentment towards OP’s bio kids.", "I’ll take “How to alienate my stepdaughter” for $400, Alex.", "Also, JUST BECAUSE SHE WILL GROW OUT OF THE CLOTHES SHE *CURRENTLY* WEARS DOES NOT MEAN SHE ISN'T GETTING *NEW ONES* YOUR HUSBAND IS *RESPONSIBLE FOR BUYING*\n\nTrying to force a stepchild out of the bio parents life and home once you make your own children is disgusting.", "OP’s next post- AITA for suggesting step daughter doesn’t need her own room because she doesn’t even have a dresser or clothes here?", "I think that she is trying to drive her stepdaughter out of the house by doing all of this.  She wants her spineless husband and her biological children only. You know, the \"perfect family.\"", "Exactly!\n\nWicked stepmother right here", "Also, their baby and toddler don’t give a fuck about where their clothes are stored. 5 years until her stepdaughter is out of the house. At age 7 and 5 those kids still won’t give a shit but she can use the dresser then.", "Hopping on this. I’m also thinking that maybe giving her the dresser in the first place was a ploy to win her over to inspire confidence with OP’s hubby. But I can’t believe he thought it would be ok for OP to take back her furniture and expect her to downsize so that their shiny new baby can have it. This is incredibly cruel.  \n\nBoth op and hubby have issues.", "And is OP really restricting her clothes and clothes money so the kid has less clothes and won’t need a dresser?\n\nAlso, child support is figured based on what each parent provides for the child. If dad isn’t paying for clothes anymore, likely his child support will go up.", "Is this the modern retelling of Cinderella? Perhaps, the beginning?\nOP, idk what you thought before writing this post. I'm guessing you wanted everyone to agree with how good of a mother you are to your step daughter but you are not. YTA\nI can see the relationship of this child going downhill with her father and with you.", "Please please please show this post to your husband. This is a pivotal moment 10 years from now when you will say. I have no idea why stepdaughter hates us. You can point to this moment as reference. \nI want to make the excuse that maybe OP is this selfish because she doesn’t have kids yet but just common decency alone would show this is a terrible thing to do to a child. \nIf your aim is to help break the relationship with a father and child. Congratulations OP. You are well on your way. \nYTA and your behavior is disgusting.", "OP couldn't sound more like a Wicked Stepmother(TM) if she tried.", "SPOT ON!!!", "op 100% doesn't care about stepdaughter.", "You said it all. Everything i was thinking so i dont even need to say anything. So thank you! And OP,  YTA for infinity.", "People like this don’t even deserve the stepmom or stepdad title. These are “parents spouse” or “siblings parent” because clearly they are not taking a responsible or caring role in the raising of the kid.", "Next step is to move the stepdaughter to the attic to give the room to the real kids, since she only visits on weekends. Or she can just crash on the couch, she can sleep proper at her moms house anyway.", "Even if it’s true that to her, bio kids come first, she could at least be kind and a decent human being. \nImagine this, the dresser was the gift when she moved in, is a token of their life as a family. it must feel now like those four years of bonding were nothing, all false, she was only holding an item for someone else\n\n I remember being 13, this would have hurt a lot, it would hurt now being 15 years older than that.", "You should probably read the post again", "Oh yeah this is where she became the AH. She had already said \"when we have children\" which made it understandable but then she had to go and emphasize it.", "Why should the daughter have second hand things? She gave the dresser to the girl and she should allow her to keep it.  Next both new kids will need a room each, so the 13 year old will be on the couch.  \n\nNot sure who the bigger AH wicked evil stepmom or dad?", "Why are they having more children when they can’t afford to provide basic needs to the ones they already have? Smh what vile people", "More like Cinderella. Ugly stepsister #1 was just born so Cinderella has to throw some of her things away and have her clothes thrown on the bed bc they gave her mom child support and she’s only there part time.", "The stepdaughter wants the “new” dresser to go to the new baby. OP’s brilliant strategy is to stop buying the stepdaughter clothes so that stepdaughter will no longer need a dresser.", "Maleficent comes to mind. Oh! And did Cinderella’s stepmother have a name? \n\nOP couldn’t couldn’t be a more stereotypically wicked stepmother if she tried.", "I would even bet that if they approached it as ‘hey stepdaughter, how would you like to go and pick out some brand new bedroom furniture?! Bio daughter and the baby won’t care that they have hand me down furniture but we thought you’d like to pick out something in your own style now you’re a bit older!’ - it would have gone pretty much the opposite. You know, making it more like a treat for her. Instead they went straight for making her feel like she’s unwelcome, like she’s not even an afterthought because she’s only there every other weekend, apparently now not even deserving of clothing that she doesn’t bring with her and, by the sounds of it, coaching her from early on to resent her half siblings. I lived on a different CONTINENT from my dad from OP’s stepdaughter’s age and still had my own, fully furnished, bedroom.", "Right? The girl is 13 more five years she is going to college and the older kid will be older enough to appreciate more the furniture.", "YTA even worse they got rid of her old bedroom set and gave her a new one and now they’re taking away the gift and giving her nothing, just downsizing her into a closet. \n\nHow long before they have her living in a cupboard under the stairs", "THIS - OP you're really not looking like a good person here. YTA", "Don't forget she GAVE the dresser and threw out stepdaughter's old dresser.", "But when she grows out of her current clothes she can just go naked! BeCaUsE mY gIrLs NeEd AlL oUr MoNeY!\n\nLady you are AH stepmother and your husband is a major AH father.", "Stepmum probably saw it as a way to store the dresser until she needed it. She even got rid of stepdaughters furniture to make space for it! OP you are a truly awful stepmum and an effing AH!!!!", "That and/or a post \"AITA for wanting my husband to pay less childsupport\". Followed a few years later by \"AITA for demanding my stepdaughter shares her college fund and/or any heritage from her mother's side with my children?\".", "Yep, soon as the newest baby is old enough to sleep on their own, it will be \"well we don't need to provide a *room*, she's *only* here every other weekend\" 🙄", "The only person here worse than the evil OP stepmonster is the father who is letting his wife treat his daughter Like garbage", "That’s EXACTLY what she’s doing.  She’s trying to make her so uncomfortable that she doesn’t come there anymore and her new kid can have her room.", "Exactly. Also wtf is so special about this dresser, it's just a piece of furniture?", "And then increase the child support just to  tighten the thumbscrews on OP a little more.", "Thats what I thought as well, try to make it positive for the stepdaughter. But then I read, that OP plans to not spend another penny for stepdaughter because she needs the money for her new bio-kids. Unbelievable.", "They'll probably need the cupboard for the stroller... And what is this shit about not buying her more clothes and her not needing the dresser once she grows out of her clothes? Is she supposed to walk around naked?! It gives me the impression Op isn't only an AH but literally an evil stepmum.", "Neither is the father.", "Yep. Even if she wants to give it to her new baby, she owes her step-daughter a replacement for the one she threw out.", "THIS. OP is absolutely YTA and honestly so  is her hubby for putting a stop to this nonsense and standing up for his daughter.", "Her throwing out stepdaughter's things should entitle stepdaughter to the dresser anyway. If the dresser was a loaner, that means OP stole and got rid of stepdaughters things knowing she wouldn't have a replacement.", "Yes! I made a different comment about his lack of testicles.", "The whole thing, OP’s entire attitude and thought process, is batshit. Just baffling.", "He'll figure that out when a judge tells him he's lost custody but has to pay more child support.", "Fck if they have to stop buying  his 13yr old daughter new clothes because they can’t afford it they should stop having kids altogether", "Well he fathered a child so he probably had at least one", "Hopefully that be sooner rather than later to be honest that kid needs to be miles away from op for sure", "Perhaps but it is obviously a very weak floppy one that carries no testosterone because he can't even advocate on behalf of his oldest daughter or protect her from his current wife's bullshit. The fact that he's successfully impregnated a woman three times now certainly does not make him a man.", "That poor child. Not only does she have a very evil stepmother, her father is joining in on the mistreatment. Way to go, OP!  Not only YTA, but downright nasty.", "INFO: WTF is wrong with you?", "Yta - when you watch Cinderella, do you watch the evil step mother and think about how similar the two of you are?", "She's a 13 year old child. YTA along with her inconsiderate father. She's going to completely resent you, her father, and the kids- for good reason. I grew up in a similar situation and I wound up never having a close relationship with any of them.", "JFC you are a massive AH\n\nYou are the epitome of the wicked stepmother.\nAnd your husband is also a massive AH", "100% she only decided to let her stepdaughter use her dresser so she wouldn't have to pay to put it in storage until she needed it again.  Putting it in the stepdaughter's room was more convenient.", "This was what I was looking for. It seems this whole thing could have been solved by getting a new dresser for the stepdaughter and moving the old one for the baby. Letting the stepdaughter pick one at the store and maybe getting her a new comforter or something for her room would have totally made her feel special and avoided the whole fight.", "No perhaps about it.  She's doing everything she can to alienate stepdaughter so she will go away and leave her and her shiny new real kids alone.  \n\nOP is an evil stepmom AH, and her husband is an even more despicable AH for going along with this BS.", "Exactly. Stepdaughter \"visits\" every other weekend. OP, she isn't \"visiting.\" This is her father's home. She lives there. Even if it isn't full time, she lives with her parent. That is her room as much as the one she has at her mother's home. It isn't a visit. It is time with her father and half-siblings. Presumably you too, but you clearly don't like her, so. \n\nIf you weren't ready to be a decent and loving stepmom for the rest of your life (not just til you had your own kids), you shouldn't have married a man with a child.", "Unfortunately, there’s a lot of bio parents that let the step parent treat their kids like shit.", "This could have been so easy! Just tell SD that she’s getting a new cool teenager set and the baby is getting the old worn-out one. YTA, OP.", "YTA. Both you and your husband. You have both treated your step daughter, his biological daughter, as disposable. It was all fun to have her and give her things when it was new and she was all you had, but now that you have your \"real children\" 🙄, she's been tossed aside. It seems that she is just a relic of your husband's past the he puts up with on the weekends just so people give him a pat on the back for \"still being in her life.\" If they only knew.You took her dresser, you disrespected her spaceand her as a person when you threw her clothes in a pile like they were nothing to give one of your new favorites the dresser, and now you've told her she's not good enough to get anything else from you because she on my comes on weekends and has another parent. And to top it off, she's only 13. Which means she was 9 when you gave her the dresser. You're reasoning of your the adult/parent so she should understand and not argue has No bearing in this case. No 9 year old would ever imagine a gift given to them by someone who is supposed to be a loving parent would ever get taken away, as well it shouldnt be. Your disgusting reasoning of it's to be given to OUR child (News Flash, she is still your sorry excuse for a husband's biological daughter) is reason enough for a judge to take away any and all parental rights from you 2 and give her REAL, LOVING mother full custody and enough child support to make your head spin. Maybe then that pesky kid wouldnt be hogging all the room and dressers from your favorite kids.", "You are a storybook stepmother. Wow. Congratulations 🎊 👏  YTA", "Jesus Christ. She actually admitted, with a straight face,*that they don't buy the kid clothes anymore*. What the actual fuck dude\n\nYTA", "Jesus H, even my miserable excuse for a step mother was never this bad! OP is the thing children of divorces nightmares are made of, now that she's having her husband's \"really children\" her step daughter is last weeks garbage to be tossed aside. Op and her husband are horrible people who should feel crippling shame and guilt at their attitude towards this child. I am mortified that she could type this out and still believe she's not the most evil step mother on earth. A POX ON YOUR HOUSE OP!", "Yup. I had a stepmom just like you. \n\nNext year will mark 9 years of zero contact with my biological father. I legally changed my last name to my stepdads because he’s always stuck up for me and done what’s best for me and now for my kids. (He is the BEST grandpa.)\n\nMy “real” dad tries again and again to make contact and I continue to remind him that he chose his asshole wife over me. \n\nYTA. Hope you’re ready to carry the weight of being the reason your stepdaughter cuts contact. I hope she does. It’s liberating.", "> they don't even have money to buy the stepdaughter new clothes\n\nOh, they have the money, they're just choosing not to.", "INFO: is your stepdaughter’s name Cinderella?", "Right? I want to believe this is a troll that no one is this cluelessly cruel. Either that or there is an actual real live version of the stepmother from Cinderella.\n\nYTA a million times over. If you give a child a gift it is there’s. A parent supports their child- all of their children not just the ones they have with their current spouse.\n\nYour behavior is absolutely appalling and inexcusable.\n\nWhy did you even want her to use it if you were just gonna take it back? Why actually pretend you have a damn about this kid?\n\nYTA and I can only hope his next wife is nicer to her step children.", "The child support is bare minimum- husband has more responsibilities to ensure all his children have the things they need and more importantly, he should care that they feel safe and equally loved in their home. \n\nYTA Lady Tremaine", "YTA. It would be understandable if they got the daughter a replacement dresser and table, but no , they told her to \"downsize\" her possessions to fit in the closet and not buy her any clothes as she grows out of them. Way to make a child feel unwelcome and unwanted.", "13 is a tender age, way to cause a rift in the family. OP doesn't see step daughter as family.  Sad, feel sorry for kids.", "Yup her edit states that she never told the stepdaughter that it was a loan.", "The existing dresser is \"second hand\".   And it doesn't necessarily have to be the stepdaughter who gets the new one.   They could furnish the nursery with refurbished things then have enough for both children when step-daughter is older and actually moves out.", "If they refuse to provide a bedroom and storage space for 13yo, because 2yo needs to move into \"her own room\", it sounds like OP is pushing for 13yo to stop staying with them. But this would mean their child support would increase if Mom has to take her full-time.", "Reading between the lines, they are having their second child, so they have to kick 13yo out of the nest and take that \"spare\" bedroom for their 2yo. \n\n*We have been co-sleeping with our daughter since she was born and she has shared our room, but now we need to move her into her own room.* \n\nSo 13yo has not understood that for the last four years, she hasn't had a bedroom, she's been in the 2yo's \"own room\" with the 2yo's dresser. \n\nI hope 2yo scribbles all over Grandma's dresser with permanent marker.", "OP isn't even considering the fact that she's making her stepdaughters life so much worse, because she's too busy thinking about her biological children and uses her husband who is a literal bottom part of a stop sign as an excuse to treat her stepdaughter horribly. I don't get why the stepdaughters dad is on his wife's side rather than his child. \n\nSo OP is definitely TA. (Also an evil stepmother)", "When Disney villains out themselves on the internet", "Exactly! It was storage. Thank you!", "Yep, having been the kid in a similar scenario (although they actually were way better about kicking me out of my room when the baby came along and I totally didn't mind that part of it - I moved to the basement, which had a TV and my own bathroom!), my stepmother is awful and fucked me up in many ways. But my father let her. She is evil for what she did, but he is worse. He is my father and is supposed to protect me, not cheat on my mom, marry the ap, and let her treat us like crap.", "And the horrible father. I hope, this is not real. Daughter comes home and clothes are lying just on the bed and by the way, you don't need a new dresser because we don't want you and your clothes here anyway. Space is needed for the important children.", "Unfortunately, not all the time. Reliving old memories. PTSD", "Yeah, I can't wrap my brain around the mind-set of \"I can't clothe the kids I have so I'll keep cranking out babies.\"", "YTA- Her Dad should have redecorated her room and buy his 13 year old a new dresser she picks out to match instead of accepting your “loan” which she was deceived into believing was a sentimental gift to symbolise you becoming family. \nYou should’ve told her it was a loan and had dad take her to update her room and buy new dressers. \n\nHe is also responsible to buy her whatever including clothes she needs regardless of what he gives her mum as you know children, eat everyday and need electricity and detest heating to survive and these thing cost something. You knew he had a child when you met him. You knew you could’ve left at anytime if you couldn’t accept he had a child he has to love, care and pay money towards. His second child’s needs does not supersede or cancels out his first child’s needs or his responsibility to her. You make stepmoms look bad and he makes dads with multiple baby mums look bad.", "YTA \n\nDid you just admit on reddit that you are going to neglect your stepdaughter? Like seriously is she just suppose to live out a suitcase or just wear the same outfit the whole time at your house? At this rate she'll be living under the stairs with a sleeping bag because new baby whatever needs her room. \n\nYou're a total evil step mother.", "YTA, it would have been one thing if you had told her but you didn't.  A gift is a gift and you don't take it back like that after she's had it for 4 years! what the hell is wrong with you?  Edited to add that I don't need to ask what's wrong with you because its obviuos yuor pathetic!  Pathetic enough to steal a from a child and to stael something you gave to her......yup pathetic.", "YTA you considered her a daughter until you had your own. Next you’ll be cropping her out of the family photos. Shame on you.", "YTA\n\nI feel terrible for this little girl. She must feel so incredibly unloved by both you and her father", "With the AH father. At least Cinderella’s dad died before the step mother became evil.", "Exactly, YTA. She must just admit that she values her bio kids over her stepdaughter and stop wasting our time. It’s not even about the damn dresser (honestly, how petty), it’s about making a 13 year old child feel like their own parents don’t give a shit about her thoughts, feelings and wants. Horrible", "That poor girl. I kinda hope she just lives with her mom full-time from now on... having OP for a stepmom sounds like a nightmare", "Pretty sure this was OP's goal. Stepchild isn't REALLY hers so she can jump off a cliff for all OP cares.\n\nWould love it if her bio kids went NC in 18 years. What wonderful karma about family that would be.", "As a step mom and bio mom I don't understand why these women don't consider the kids their partner has aren't part of their family and their children. It's what you sign up for when you marry a single parent. \nYes the relationship may be different with the kids, it's harder to come in and there are boundaries and decisions out of your hands, but that should not prevent anyone from treating them with the same level of love and respect they have for their biological children. You're not there to replace the mother, but you're there as another parent and caregiver. \nOPs kids are blood related to their step daughter and her husband. \n\nOP is absolutely a major fucking asshole", "She shouldn’t be having another kid if she can’t even afford basic necessities for the first. Yes, ANOTHER kid, because the first IS HER KID.", "Swap pages, Thrift shops, FB marketplace if you live in the U.S., your community recycling centers. You don't have to buy a \"new\" dresser.", "This stepmom is the one that asks the photographer to edit out the stepdaughter out the picture.", "AITA for expecting my stepdaughter to babysit for free 5-7 days a week?\n\n“We’re a bit short on money and my husband’s daughter with his ex lives with us but pays NO rent so I kind of think she owes us. She’s 13 by the way” 😱", "How about, AITA for wanting my bio kids to have my step daughters room? She’s only here every other weekend.", "Ya think", "So help us understand this.  You gave your stepdaughter your childhood dresser, made her get rid of her personal dresser, and now that you have become a mother, decided the dresser you gifted her is now too good for her and should to your biological child?  In what world is your action fair?\n\nAnd your husband going along with your insanity!", "That’s probably what OP really wants if the custody order is changed then SD never has to come over at all and she can give her room away to baby number two.\n\nHer room might I add that was hers BEFORE this evil lady even married her dad. \n\nAlso child support unfortunately is usually such a small fraction of income that it doesn’t cover much especially in a single parent household. \n\nJust puke 🤢", "If they don’t even want to buy her clothes they’re sure as hell not going to be willing to purchase something cute enough for her to choose. Never mind that she owes her a set— since she discarded one set and is now repossessing the one that replaced it! You are an awful human being OP.", "100% agreed. Stepdaughter is 7th or 8th grade, and I teach 8th grade. I hear stories all the time that run the full gambit of “1 parent took all my stuff away and kicked me out” to “i get a new little brother/sister AND my parent let me redecorate my bedroom!”. OP could have done the second, but they are inches away from the first.", "100% agree.\n\nHey girlie, grab your coat. We're going to IKEA to find you a new teen bedroom furniture. Suddenly it is a cool experience \n\nvs\n\nHey, she's gone - lets snag her dresser from her room and dump all her clothes on her bed. She doesn't need the dresser anyway. Heck, she should not have clothes here since she's rarely here.\n\nOP, this poor girl.", "AND NOT BUYING HER CLOTHES FOR THEIR HOUSE! What the hell is wrong with these two?\n\nOP - GO TO FAMILY COUNSELING", "So true! They took away her sent and want to leave her with nothing. \n\nIf it’s a children’s dresser/bedroom set and op wants the little kids to have it then the ONLY acceptable play here would be to level up step daughter’s stuff and buy her a new “teenage set” and then move the little kid stuff into the baby’s room.", "I mean, to be fair, does the girl care about that dresser or does she just want A dresser. \n\nBased upon the call from her Mom it sounds like she just wants a dresser and a table in her room - doesn't have to be those ones. \n\nOP is the worst.\n\nYTA", "I scrolleddd for this comment 😆😆 she is the evil stepmother of Disney movies", "basically outright declaring that she means less to them than the flesh and blood daughter.\ni wouldn't be surprised if the daughter just chose to live with her mother rather than a father that doesn't have her back, though op would probably prefer that seeing her blatant dislike for the child.", "That's what I thought.  If step-mother was smart (and if she cared at all about her step-daughter's feelings) she would have planned a bedroom makeover with her, taken her Ikea or some other discount furniture store and helped her pick out a new dresser and nightstand to match the new decor.  \n\nThen said she'd use the \"hand-me-down\" furniture for her daughters.\n\nShe can't do that now, of course.  \n\nOP, YTA.", "This.\n\nOP, as a mother of daughters recently this age let me tell you - you just told that poor girl in no uncertain terms that you do not give a rip about her. \n\nI see nothing but pure unadulterated favoritism and selfishness here. You were cool with her until you had bio kids and then you threw her out just like the clothes she will one day outgrow. \n\nThe worst part is, you see nothing wrong with your behavior. You see nothing wrong with telling a child you don't love them or view them as family. You don't see anything wrong with telling a child that they are not deserving of space in your home - a child that is your family and who should be treated equally to your children.\n\nThe ONLY way to make this right is to purchase a new dresser and a new bedside table for her. You wanted hers for your child? Purchase a decent one for her. She has the right to keep clothing at her Dad's house.", "It’s the principle, she shouldn’t be taking the gift back.  \n\nOP going on like this dresser is some family heirloom, I doubt either of her OWN children will care about a set of draws.  \n\nGive it a few years when HER children are older it be on Craig list.", "Or when the child decide to spend less time at her father’s house because she is at or getting to the age when she will be able to decide that and hopefully mom takes him back to court for more child support", "Why do they even have to buy the coming baby new clothes or much of anything new for that matter. They just had a baby 2 years ago and I'm sure there's clothes, some basic equipment, and toys that are still good that the 2 year old now can't use. As they get older surely dad could have saved some of his first borns clothes so that's even more saving right there.", "Right! We’ll just stop buying her clothes so she do t need a dresser, problem solved /s. You and your husband are jerks. Way to make his daughter feel expendable because you now have kids. And mostly shame on your husband for letting his daughter be treated like this", "The fact that she said \"we need both the money and space\" tells me they're planning to kick her out of her room when the new baby is old enough to have her own room as well, which will be well before the girl is 18."]}