{"id": 25794, "submission_id": "164csj6", "title": "AITA for not buying the brands my wife wanted?", "selftext": "Throwaway account. I (35M) was asked to go some major grocery shopping for my wife (36F). We have been married for about 8 months and she has 3 young children from a previous marriage. She gave me a long grocery list and I bought what she wanted. However, instead of the specific brands she wanted that she put in the list, I just bought what was cheapest. She was really upset about this, saying there were certain brands she likes to buy. I thought this was ridiculous and we got into an argument about it. Keep in mind we are both on teachers' salaries. Her ex-husband is a businessman and she doesn't seem to realize she isn't married to a businessman anymore. I called her a nasty name and she told me I need to go look for an apartment. AITA the asshole for buying cheaper brands? ", "created_utc": 1693298391, "permalink": "/r/AmItheAsshole/comments/164csj6/aita_for_not_buying_the_brands_my_wife_wanted/", "score": 188, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because I didn't buy the specific brands my wife wanted.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA - it sounds like she usually handles the grocery shopping. You make it sound like buying the items on the list would break the bank on your salaries, but somehow it's been fine every other week?\n\nOn top of that, it's pretty presumptuous of you to think that she chooses those particular items for no valid reason. \n\nFinally, there is never an excuse to name call.", "Well, that escalated quickly. \n\nNot entirely convinced two teachers can't handle such a low level dispute without defusing the situation a little, but setting that aside...\n\n\"I bought what she wanted.\" No, you didn't. You substituted brands where she had gone to the trouble of specifying them. Sometimes, no-name brands are fine. Sometimes there's a good reason why they are so much cheaper - to the point where they're less economical than   the more expensive ones. \n\nShe disagreed with the substitutions you made and you doubled down: \"this was ridiculous,\" \"I called her a nasty name.\" \n\nYour title needs ammendments: AITA for telling my wife I got what she wanted, when I didn't, calling her ridiculous for expressing her frustration, and then calling her a nasty name? (a short story in how to bring the honeymoon phase to a swift end). There we go.\nYTA", "YTA.\n\nObviously, your salaries could handle it when she was doing the shopping. I'm not sure what your issue is now.\n\nEdit: typo", "YTA. She's told you what to buy. Just buy it. Discuss cheaper brands later. And calling her a name? Yeah she may not be married to a businessman but she shouldn't be married to a TEACHER who uses abusive language when they get angry either.", "YTA and also verbally abusive. Did you shop like that so she wouldn’t ask you to do it again?", "YTA.\n\nI'm guessing the things on the list were for her kids and you decided they weren't worth it?", "YTA\n\nYou get in an argument and start insulting the other person by calling them “a nasty name” you are the asshole. Having some minor brand loyalty is not a problem, especially since she has been buying these brands for **8 months** with zero issue.", "YTA. If you're unhappy with the brands and costs, discuss it. Don't just do whatever the hell you want. Also resorting to name calling is pretty immature.", "YTA\n\nyour wife specified the brands because there is a significance to this.\n\nshe specifically did not want you to buy the cheapest because obviously there is some important difference.\n\nThe cheapest laundry detergent will have a bad smell and make your clothes starchy and hard. The cheapest pasta will taste like mush. The cheapest tomato sauce is half sugar. the cheapest cabbage tastes like cardboard and so will the cheapest tomatoes and pears. The cheapest flour will not rise as well and the cheapest oil has no aroma whatsoever. The difference in taste between hard cheeses is so vast i can't even describe it and sausage is similar in that respect. Meat and fish range between gummy and bland, to satisfyingly melting in your mouth. \n\nhave a discussion about it. and come to a joint conclusion. don't just do a surprise saving on her just to \"show her up\"", "YTA\nYou knew what you were getting in to. You married a mom of 3, that previously was married to a business man. I don’t think this is the first time she ask for branded stuff. YTA for handling the situation like that and called her in a nasty way. You can talk and try to find a solution, perhaps ex husband you pay more child support? Or try to find different brands - not just the cheapest-", "YTA. There is more about brand than just prices. Ingredients may differ and this can be huge in case of allergies/alimentary disorders. Or some products just sit more right with the belly. Maybe some brands are (a little bit) more ethical about workers rights/environment. You can't even fathom this it seems. \n\nOf course money can restrict what one can buy, but even on a tight budget most people chose to save from some products and spend a bit more on others.\n\nIt seems even that this was the first time you got out buying groceries in your life, because no one who did it before would do it just like you did without a second tought and a single care in the world. If not, it shows you care zero for what your wife wants.", "Big YTA. The name is a huge problem. Apologize immediately.\n\nPeople with children for a while know exactly which brands they need, having tried a lot of them before. For example, a cheap detergent may make a child itch, or the child may refuse to eat certain products. This is especially true when it's young children you're talking about.", "YTA verbally abusive ?  That’s your go to in a argument or discussion ??? You didn’t even bother to discuss anything with her to see if compromise could be reached . You did it your way and verbally abused her when she called you out on it . I can’t blame her for telling you to get your own apartment !", "YTA. You were wrong for substituting specific brand preferences unilaterally but you escalated to calling her a b itch. Over groceries?  Unacceptable assholish behavior.", "YTA \n\n\nYou don't get to make decisions on her behalf, she made it clear the brand's she wanted. \n\nRather than discuss it with her, you made a unilateral decision about what's best for her. \n\nAnd then you had the audacity to insult her", "YTA for calling your wife a nasty name... and as a chef,  some brands are better than others...", "You called her a nasty name YTA.\n\nYou were also an arsehole over the shopping.", "YTA for not providing the help she asked for and for treating her like shit", "YTA my family buys a lot of stuff because it's cheap, but some stuff the branded stuff is just best. For example, name brand laundry powder for sensitive skin (family members have skin conditions). But also some cheap stuff is just cheap for a reason, and people don't like it. Thees loads of subs we've tried, but the none branded ones just don't taste as good or work as well.\n\nYou've been married for 8 months and this is the first time youve been asked to shop? If you had questions about why she was buying certain branded items, the right thing to do was use your words and have a conversation.", "As others have said NEVER substitute brands. My MIL only buys one brand of cornflakes, she needs gluten-free and whilst there are alternatives to her preferred brand, they aren’t the same. The fact that her brand is not sold in many supermarkets complicates things even further. Plus it is the cheapest gf cornflakes and ORGANIC makes it even more difficult to get. We have even discussed with one of the supermarkets whether ordering it online would solve our difficulties to be told “oh no, we substitute”. She won’t eat the others even if they are gf.\n\nIn my sons case, he has allergies on top of Coeliacs. He can’t even eat the NICE (U.K. health board prescribing body) prescribed brand of gf food - he has to get a special more expensive prescription brand.\n\nI am allergic to Ecover (one of those fancy expensive green brands of cleaning products) washing up liquid and Ariel laundry powder. Both bring me up in an itchy rash.\n\nNEVER substitute - even if the other brand is cheaper. There is usually a very good reason why a brand is specified, and it is usually NOT because of the price.", "YTA. If the brands didn’t matter then she wouldn’t have mentioned them. You could have discussed your concerns with her and found a compromise, but you didn’t. You tried to be controlling and then called her an awful name. She’s seeing dozens of red flags right now, and so do I.", "YTA, if she took the trouble to write down the brand, then the brand is important. By all means have a discussion when you get home on why that specific brand is important, but don't just substitute it then call her a b**Ch for not being happy about it.\n\nI have specific brands because of food allergies, skin allergies or simply because we prefer the taste, texture or quality of that brand enough to pay the little bit extra that it costs. Any of that could apply for your wife but you don't know because you never bothered to ask.", "\"some major grocery shopping for my wife\"\n\nHmmm. Were you intending to eat any of the groceries you picked up? Yes? Then you weren't shopping for your wife, you were shopping for your household. \n\nAnd she was VERY SPECIFIC about brands, and you got the wrong things because you thought you knew better than the person who's handled every shopping trip since you were married. And you became aggressive and called her a bad name.\n\nYTA, and you need to apologize with flowers and chocolate. Godiva chocolate. Not the cheap stuff.", "YTA she was specific for a reason. Some stuff, the cheaper brand tastes notably different and not better. You also handled it like a dick.", "YTA. Don’t. Substitute. Brands. Ever. I mean never ever. If a brand is specified on the list do not substitute. I would have reacted the same as Mrs. OP. The generic brands aren’t always the same or more economical. Just because you think she’s ridiculous for buying the brands she specified does not mean she’s ridiculous. It means she’s tried the others and they suck. Apologize immediately and never do that again. Plus, calling her a nasty name? Are you sure you’re mature enough to be a teacher? Seriously OP. I think I broke my nose facepalming while reading this.", "YTA\n\nSometimes the brand does matter.\n\nI'll put it in terms for you, as a teacher.\n\nYou're buying fruit snack packets for your children, terrific.\n\nYou get to Target, you see the Welch's brand your wife asked you to get, right next to the Target brand.\nThe price difference is $1.00.  You buy the Target brand because it's cheaper.\n\nIf you compared the sugar content, side by side, you'd see that the Target brand has 10 Grams more sugar per serving than Welch's.\n\nYour wife specified the brand for a reason. 10grams more sugar, means more sugar for the children. This can be a health issue or a bouncing off the walls sugar issue.\n\nIngredients matter, not just price.\n\nHope that helps.", "YTA\n\n>She gave me a long grocery list and I bought what she wanted.\n\nNo you didn't!\n\n> I called her a nasty name and she told me I need to go look for an apartment.\n\nYou started an argument about your incapability to read a grocery list and became insulting. \n\nIf that's a first time for you to act that way, getting therapy/counseling might be enough to handle this situation else it's the consequence of a marriage that doesn't work!", "YTA. Doesn't the ex pay child support? How much did you save buying the cheapest brands? How come you waited this long to be an AH?", "You called her a name because she has preferences? Hopefully Zillow has some nice places 😂", "YTA.  You didn't get what she wanted.  You got what you thought was best without knowing her reasons for wanting the brands she wanted.\n\nYou're really an AH though for calling her a nasty name.  That's the bigger issue here.  Name calling is a kind of abuse. You seemingly went from 0-100 on the temper scale.   Good on her for removing herself and her children from your influence. I really hope you're a better teacher than you are a husband.", "Yta did you do this so she never asks you again?  Sometimes off brands are fine. Off brand bread? Fine.  Off brand shake and bake? No.\n\n\nThen you called her a nasty name?  And remindes her she 'wAsN't mArRiEd tO a bUsInEsSmAn aNyMoRe'.  So you doubled down on being an ahole.", "YTA and it sounds like you won’t have this problem anymore because if someone treated me like you treated your wife, I would divorce them. Use your words and work to understand a situation like an adult instead of a petulant child.", "YTA. Your household has been buying the same brands for at minimum 8 months (assuming you moved in when you got married and not prior) so clearly you both can afford the brands she wanted. You tried to be cheap for whatever reason (I'm strongly guessing weaponized incompetence) and it did not work in your favor then instead of apologizing you call her a nasty name.... your wife... the woman YOU'RE SUPPOSED TO LOVE. If being asked to spend an extra $5 or so on brand name stuff triggers you to the point of calling her a nasty name you should really consider divorcing now and saving her kids from witnessing an ongoing pattern of you putting down their mom over minor things you disagree with.", "No way is this the first instance of him being verbally abusive, if she's already at her breaking point telling him to look for apartments", "Yta. If she was specific about brands, you didn't buy what she wanted by buying whatever was cheapest. \nIf you had issues with buying brands, that's something you TALK about like ADULTS.\n\nLike;\n\"Hey babe, is there a reason you specified Always for your pads?\"\n\"Yes, it's because the off-brands makes me break out and rashes on your hoo-ha sucks when you're already on your period.\"\n\"Oh. Okay.\"\n\nOr like;\n\"Hey, honey, I saw that you wrote Cheerio's on the list. I was just thinking that maybe we could try this off brand and see if it tastes good bc it's a lot cheaper.\"\n\"Yeah, sure, we can try.\"\n\nIt sounds a bit like you're jealous of her ex tbh.", "YTA, you didn't buy what was on the list. Lots of people have preferred brands. And you called her a name?\n\nMaybe you should be posting here and be looking for an apartment like she asked.", "YTA. Better hope she just suspended you instead of expelling you.    \nAnd I wouldn’t want you teaching a child of mine.", "YTA. \n\nGrocery shopping is something you have to be asked to do?\n\nAnd then you purposely disregard a carefully prepared list?  One with items you obviously can afford when your wife shops?\n\nWhy do you even have to ask?", "YTA. She may have reasons she buys those specific brands for those products. We don't have a lot of money, but there are things that I refuse to skimp on because of quality. Dish soap, laundry soap, pads, tampons, shampoo, etc. Sometimes even foods like certain soups, ravioli, coffee and tea. Cheap is great, but if it tastes like shit is it really a good deal? Same for dish soap. You'll have to pry my Dawn and Platinum Cascade from my cold dead hands, store brands simply do not compare. I know this because I tried them. That's also why you look for every coupon or sale you can find.", "YTA. She has 3 kids. You don't think she's tried off-brand cereal?   \n\nKids are notoriously picky eaters, and the cheap brand isn't worth the 0.40 cents you saved. \n\nLaundry detergent, soap, and bodily products are often chosen based on the families' dermatological needs. \n\nIs the 0.40 cents worth this argument? I think not. \n\nIt's fine. You tried to save money and you didn't get the \"gold star\" of approval you wanted OP.  Don't double down on your decision. Try and understand her for next time and compromise.  I'm.sure there are SOME brands you can change around.", "YTA. \n\nAnd I’m sorry, but there is no store brand Oreo that can truly stand up to the real thing. (And all you Trader Joe’s Joe-Joe Stans can stop typing @ me, rn)", "I once bought store brand marshmallows to make rice krispie treats. They refused to melt all the way. Sometimes brand matters. \n\nI don’t think YTA for buying cheaper versions. But you are for calling her ridiculous and not just apologizing and  saying next time you’ll get specific brands and then calling her that name. I don’t blame her for kicking you out.", "You were being an idiot dum dum husband up until you called her a nasty name. Now YTA and she's right for not putting up with the abuse. \n\nGet help. This escalation immediately makes me think that you have insecurities about her former spouse, your lower salary, feeling inadequate in your new role as stepfather/other head of household. She specified brands on the list and you decided to override her decisions because you thought you knew better. You vetoed her specifications without consultation, and made the overarching choice as supreme decision maker. When called out on it, you had to defend your authority and assert your budgeting intelligence by cutting her down in a childish manner. \n\nThis isn't about the groceries and brands. It's a proxy of a deeper issue. Otherwise it wouldn't have blown up to the point of her wanting to kick you out.", "YTA. It’s likely she’s already tried some of the generic foods and knows they aren’t good. Some of them are OK. Some of them taste like dog food.", "YTA.", "YTA for calling her that! Also, you sound jealous as fk about ex husband’s job", "YTA. As lots of others have said, she almost certainly has reasons for insisting on the brands she wants, but you called her a nasty name instead of asking. Volunteer to return the unsuitable products that can be returned as part of your apology and get help managing your emotions if you want to stay married.", ">I called her a nasty name\n\nReally? \n\nOver groceries? When you did NOT buy what she wanted. \n\nAlso ... Sometimes cheapest isn't always the best value. With some items it doesn't matter, with others it really does. Also, I'm guessing the ex pays child support towards his 3 kids? So it doesn't matter what groceries cost, right? The kids are still provided for.\n\nYTA", "YTA. Especially about the name calling. Here is an example of why the cheaper brand  can end up costing more. Cheap one-ply  toilet paper costs less than Brand 2-ply toilet paper. But you need twice as much Cheap as  Brand when you use it. So you end up having to buy twice as much cheap toilet paper, and spending more money!\nNext time, go with the name brand. It matters.", "OP are any of her kids special needs? Not that any has to be. But personally there are things I will buy name brand for ex. I CANT buy off brand Mac and cheese, at least if I buy it with expectation to feed my child. He is thick and cheesy craft only. Some things you just pay extra for. Name calling was out of line.\n\nYTA.", "Sometimes buying the cheapest ain’t better. It taste different, not long lasting, etc.", "YTA for escalating this to insults\n\nThis could have been handled by talking things through, perhaps in some cases the cheaper option is just as good when tried, in others the brand she likes would be best, because the two aren't always the same. The solution to this is a compromise, both parties are happy/unhappy with.\n\nThis sort of thing escalating to this level tells me there must be something else wrong (camel's back situation). Part of me feels like it culprit might be insecurity with OP comparing himself to ex-husband.", "I don't know, there are some things you gotta buy from certain brands.", "YTA", "It’s about COMMUNICATION. YTA", "YTA. Sometimes the brand name products are really different than the generic brand. Peanut butter, for example. I’ll only buy Jif because the texture of other brands is different. Great value peanut butter is not the same, and i won’t eat it, so it’s a waste of money. She gave you a list, you didn’t stick to it, then you insulted her. I don’t see how you could think you’re in the right.", "YTA\n\nOh dear, when a woman, your Wife or GF asks you to do the shopping, Never, I repeat Never substitute brands for cheaper alternatives to save money. Brand loyalty is important to most women.\n\nHow would you feel if she bought you cheap supermarket own brand beer instead of the premium brand you like\n\nCheaper products don't generally taste as good, or are of even a similar quality. Cleaning products are generally not as good and last less time making them a false economy.\n\nYou need to apologise and grovel if necessary for the nasty name and jibe about her ex and promise you will never do this again. re do the shopping if necessary", "YTA and she's not wrong, you should look for an apartment...\n\nWhy do you want your meager finances weighed down by her THREE children and inconsiderate spending habits?", "Info: does buying the brands she usually does create financial issues? Basically; can you two afford it?\n\nA lot if the times there's reasons why people buy brand name items. For example;\n\nThe brand of chocolate milk we buy tastes by far and large so much better than the cheaper kinds it's insane.\n\nThe brands of pasta sauce we buy don't only taste better than the cheaper stuff, but they're also healthier and contain far less sugar and salt than the cheaper stuff.\n\nThe brand of apples I buy may not be the cheapest (also not the most expensive), but they taste far better than the watery cheaper apples.\n\nSame for clothes, I try to find a balance between costs and quality.\nThe cheaper clothes might cost less but they might also not fit right, shrink too much after a few washes, fade too much after washing or tare too fast. If I buy those, I'd be spending more money on clothes over time than I would if I bought a little higher quality of clothes. \n\nSo if you're not getting in any financial trouble by buying those brands, sit down and have a conversation with your wife about why she likes them and what you like(don't focus too much on \"it's just cheaper\", come up with actual reasons about the quality and/or taste) and just keep buying them or find a compromise on the things you disagree on.\n\nIf you are getting into financial trouble by buying them, still sut down with her and talk about the finances and that you should try replacing them by good but cheaper alternatives. It's trial and error to find something you like, but still.\n\n\nBut what you don't do is call her names. Dude. You're a teacher. You should try what you're teaching the kids in tegards to conflict resolvement.\n\nSo.. whatever your answer is, YTA.", "Firstly you didn't do grocery shopping \"for your wife\" it's not your wifes responsibility you were just helping with. Secondly YTA for the way you handled such a trivial dispute", "Y A probably T A, but I will reserve judgement. It truly depends. Did she ask for cheddar and you bought American cheese? Did she ask for Hellman’s Mayo and you bought the store brand? Did she ask for Bluebell ice cream and you bought store brand? Did she ask for specific brands the kids like and you got generic? We try to be very frugal and have a grocery rule: If there is a cheaper/generic option, we will try it. If we don’t like it, we’ll stick with the name brand. We have often been pleasantly surprised and have switched to the cheapest options for many things. (Our store’s cheapest brand feta is AWESOME and I will buy nothing else!) However, the cheapest options of some products are just terrible. The cheapest chicken nuggets, for example, are horrible. My kids won’t touch them. The meat is brown/grey. We buy the more expensive, white meat option. If a person is a Hellman’s or Duke’s mayo person, there is no alternate option. Some store brands of specific cheeses can be just as good as the name brand. Switching to a different type of cheese, though, is unacceptable. Some of these things might have been for recipes and getting an off brand will screw it all up. Kids can be picky and will not eat different brands or want to take specific brands in lunches. If your wife wrote down specific name brands, you know that is what she wanted you to buy. If you want to try the cheaper stuff, have a discussion about it. That’s the bottom line. If you are going to go grocery shopping with a list your wife made, get what she wrote down. If you want to change it up, DISCUSS IT.", "You called her a nasty name and implied that she must be some hoity toity city-folk who had her \"business man\" buying her expensive gifts like Jif peanut butter and Tampax tampons. If your knee jerk response is to call your wife names you probably need some anger management and some time out in the form of a new place to live.  By yourself.  Where you can buy all the Great Value your little heart desires, spending half as much because you don't have your wife nagging you about things like 20 cent upgrades.\n\nYTA.", "Sorry, YTA.  I wouldn’t call you TA necessarily for buying the store brand… you were just trying to save money, and if you don’t normally do the grocery shopping, not a huge deal.  Usually store brands and name brands are similar but not always the same, and if that’s what she’s used to using, the cost difference is really pretty minimal in the grand scheme of things.  The reason I think you’re TA is for the nasty name calling when she was trying to tell you this.", "ESH. \n\nYou are definitely an AH for throwing out a nasty name. There is no need to name call your partner during a disagreement. \n\nNow that being said, if she is buying name brand things that you two cannot afford, then you two need to have a serious discussion about your budgets. But if she is buying them for a particular reason (i.e. intolerances, allergies, etc.) then collectively need to understand the rationale for choosing a more expensive product over a cheaper one.", "Yta for handling that situation like you did\n\nNta for the offbrand-stuff since a lot of stuff gets produced in the same factories it just doesnt have the name", "NTA in terms of what you bought. If she wanted x brand of milk or whatever then she should've specified that ..YTA for escalating it so quickly in the ensuing argument.\n\n>she told me I need to go look for an apartment\n\nWho owns the apartment out of curiosity?", "ESH - Calling names during a argument is low. \n\nIf you genuinely can’t afford to buy name brand then come to an agreement on what can and can’t be generic. In my house mostly generic is fine but I draw the line at generic brand crackers, only club is acceptable and only goldfish brand. Also no generic mayonnaise. 🤷🏻‍♀️", "INFO: what did you call her? \n\nThe brands thing I feel like NAH but a convo is due regarding finances. But I'm curious what you said that makes her tell you to look for an apt. That seems to be the bigger conflict here", "ESH in my opinion. You’re both a bit immature \n\nShe needs to realise that some of the brands she may have previously loved, are now adding up in price to a cost that may be a bit too unreasonable for your salaries. I think perhaps you should have a discussion about what you are willing to sacrifice/not sacrifice. \n\nYou said you bought what she wanted on the list, but you DIDNT. She asked for specific brands and your bought other stuff instead. Instead of choosing this yourself, you should have spoken to her first about this idea. \n\nI’m surprised this argument blew up so much, it’s incredibly immature and ridiculous of both of you for an issue which wasn’t even complicated to solve. \n\nJust go and apologise for what you said and for not consulting her first on the change of products, then ask her if you can discuss some changes to the shopping list due to the costs.\n\nAlso, calling her a “nasty name” was just immature and disrespectful. I suggest you grow up.", "[removed]", "NTA. Your wife is an idiot. Sorry you had to find out this way.", "NTA, good idea to get an apartment. If your wife gets upset at shit like this i cant imagine how she would react to something actually serious. Divorce her ass and lets see how she buys name brands for her 3 leeches.", "NTA\n\nYou are both teachers and are trying to take care of three children. Namebrand products are always more expensive than generic brands and that money can add up quick when you’re trying to feed so many people. \n\nIt’s not going to kill them not to have a fancy label on their food. The people in here saying that you should’ve just gotten your wife whatever she wanted aren’t thinking of the bigger picture, like finances.", "NTA for buying cheaper brands, but totally an AH for cussing out your wife over a small disagreement. Does she get child support from the businessman ex? Because if she does, she can buy the kids whatever brand of food she wants. I mean, FFS, it's groceries, not GUCCI flip flops.", "NTA. She's either going to have to adjust her financial expectations or go find another rich man.", "NTA, you are being smart but your wife doesnt seem to respect you to resort to telling you to go look for an apartment might mean you need to move out and consider this relationship over", "NTA for buying cheaper brands but def the AH for innapropriate name calling .", "well I would like to know how much the brand is worth to be honest because I know some brand stuff are huh well crazy expensive I think if we could get that brands mark it could help because from you they sound super expensive but are they really?\n\n\nI forgot to type with country you are in?", "NTA she obviously needs to learn how to not spend as much.", "RIP marrying a single mother with 3 children. What the hell is wrong with you...get out of there as soon as possible... Youre still young why wast your life like that...", "NTA for buying what is cheapest. You have bigger issues though if you two got into this big of an argument over grocery shopping.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway account. I (35M) was asked to go some major grocery shopping for my wife (36F). We have been married for about 8 months and she has 3 young children from a previous marriage. She gave me a long grocery list and I bought what she wanted. However, instead of the specific brands she wanted that she put in the list, I just bought what was cheapest. She was really upset about this, saying there were certain brands she likes to buy. I thought this was ridiculous and we got into an argument about it. Keep in mind we are both on teachers' salaries. Her ex-husband is a businessman and she doesn't seem to realize she isn't married to a businessman anymore. I called her a nasty name and she told me I need to go look for an apartment. AITA the asshole for buying cheaper brands? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "No, you are th A for calling her a nasty name! What an immature asshole you must be.", "Yes you are the Asshole, apparently you never really buy what your write in your grocery lists but instead you switch the brand without even asking her, sir not every product are the same. Your wife know exactly what product to pick and you switch it? You are surprised why she’s mad? And you call her Nasty name? What does it make you as man? A jerk and asshole! You both are a teachers and can’t handle a simple grocery lists and get mad at each other? If I was you sir, apologize to your wife!", "INFO: Let’s say hypothetically you teach English and you ask for a book report on Harry Potter and your student turns in one about Twilight, you’d still accept it right? I mean, similar genres, similar release time frames, similar audiences, similar character ages/troubles, it’s basically the same. \n\n\nIf the answer is no, then it would make sense you listened about as well as your hypothetical student did. Your wife didn’t say “buy whatever brand of this item,” she gave you a specific list likely based on experience and knowledge. Depending on the substitution, the cheaper brand may not be as good or even close to what she requested. If you had a legitimate concern about costs, why not call her from the store and say “hey, X is $5 cheaper, is there a reason you want this brand?” Sure some items might be made on the same production line (like certain cereal and alcohol) and rather than have a mature conversation like I’m sure you encourage your students to have, you did not buy what she wanted and you insulted her on top of it when you were in the wrong.", "YTA. Is there a specific reason she mentioned the brands?!?$ allergies, unsafe ingredients or intolerances?!? Do you even know?!? \n\nOr is it- since it doesn’t directly affect me I don’t care?", "YTA. \n\nIt is not \"ridiculous\" to like certain brands of products. There really can be a difference in taste, ingredients, and how they work in a recipe (never buying the store brand baking powder again). \n\nIf you are worried about the price of groceries or bills in general, then you have a discussion about the budget, you don't decide that you know best how money is spent. A better approach would have been to buy what she asked for, note the price difference, and then come home and talk about what is really needed. \n\nAnd having a disagreement where you both have fair points- the need to save money versus quality of products- shouldn't end with you calling her a nasty name. That alone makes you an AH. Not sure how a teacher of children is unable to control their own emotions, but here we are.", "You called her a name you’re not even willing to put here?\n\nYTA. \n\nI mean…YTA for the grocery thing, too…but yeah, if my spouse got verbally abusive over groceries, I’d kick them out, too.", "Weaponized Incompetence, thy name is OP. YTH", "YTA.\n\nFalse economy buying cheaper sometimes.\n\nA teacher you say? You need to educate yourself on what being a good husband is, that’s if it’s not too late 👍", "YTA - I would immediately leave you after that insulting situation in the end", "It was a stupid but normal squabble until you called names. Now it's no longer about the groceries, buddy. YTA", "\"Married to a businessman.\" Well, does this businessman father pay child support for his kids? Why on earth did you call her a nasty name when you couldn't even follow her instructions to buy what she asked for?  \n\n   And you're a teacher? I hate to think what you do or say when one of your students irritate you. \n\n    YTA.", "Yta for marrying someone with ideas above your collective pay grades. She wants to spend all your money on brand names, and I bet she never saves a penny.\n\nYou'll end up divorced soon enough. These fundamental disagreements about seemingly petty issues will become more polarised over time. This is likely to be the tip of the iceberg- I bet there are many other financial issues upon which you disagree.\n\nShe will look to someone else to buy her branded cereal. You will resent her and her children for their entitled expense.", "YTA. I'll bet you will be more caeeful not to run off at the mouth next time. Learn from this mistake and apoligise so you get to enjoy your own bed in future and not one somewhere else where you have to pay for the privilege.", "YTA. You called her a b\\*tch when she rightfully calls you out on deliberately buying cheaper brands? SMH", "YTA for calling her a nasty name. You should go find an apartment I guess. Doubt this is the only thing you've done to emotionally abuse her (the name calling).", "YTA \n\nName calling is never okay. Even when my husband and I argue about *real* issues, we don't name-call. \n\nIf she wrote a specific brand, there's a reason for it. Otherwise she'd just write \"mac n cheese\" instead of \"Kraft Mac n cheese.\" The flavors are very different depending on the brand and young children are *very particular*\n\nDo better. Don't act like your students", "YTA. If you didn't have the money for what she listed, you could have asked what she'd like you to substitute. Some store brand items are basically the same thing without the labels, and others are godawful. \n\nBut where you became a bigger asshole was after you came home and called her a name. What was the name? And if you're still bitter about her ex existing, why did you get married?", "YTA\n\nHappy apartment hunting, OP!", "I was already mad when you said, “major grocery shopping for my wife”.", "**I called her a nasty name**\n\nInstantly YTA  Pretty sure there's A LOT you left out of this story.", "I like baking. I always make my cheesecakes with a particular brand. I try to use the best quality ingredients I can find. Never had a cheesecake turn out wrong. \n\nI was going to visit friends house and she asked me if I could teach her how to make it. I send her the ingredient list (with brands) in advance. I arrive and she had bought store brand of almost everything including the cream cheese. \n\nIt had to bake much longer, wasn’t as firm and didn’t taste as good. \n\nThere is most definitely a difference between store brand and certain brands ( sometimes one is better, sometimes the other). If you like to cook or bake, sometimes it is vital to have a certain brand. \n\nSo YTA.", "Yep YTA. She gave you a list, you ignored it, she expressed being upset, your called her names, and you wonder why she’s told you to find an apartment??? \n\nThere are certain things that I don’t buy in generic forms either. If you couldn’t afford the list, then have a conversation with her, not demean her by calling Eve names.", "This is up to personality. Personally I usually agree with you and \"who cares this is cheaper\" works fine (there are a *few* items I put my foot down because of a taste difference). Then there are people like your wife and my spouse who want very specific brands and swear there is a taste difference for everything.\n\nAka: if she asked for those specific brands unintentional YTA, but you know it's important to her going forward so don't make it a purposeful Y T A in the future.\n\nAlso holy heck that argument escalation, you two need basic communication skills.", "YTA. Some brands/items are absolutely not interchangeable in terms of quality and flavor. You cannot even substitute them in recipies and get the same quality of end result. What you have done here is COST the household money, because she's going to have to get rid of what you bought and replace it with something worth eating.", "YTA\n\nI’m assuming you eat/live with your wife?  Your shopping for the household. “Her” kids are now “our” kids. Taking a shot at the ex (insecure much?) totally uncalled for. And then you got nasty and called her names. Tantrumming like a child. \n\nBrands sometimes matter. She specified. You didn’t get them on purpose. You’re either a cheap AH or you decided to screw this up so you don’t have to help with the shopping, which also makes you an AH. \n\nYou threw her ex’s money in her face. You called her names. And you think you have a right to be mad. No.", "Dude. Do.ypu even grasp how nasty, passive aggressuve, condescending, and controlling this sounds? Specifc brands impact things like taste and performance. But no. YOU decided to throw in her face that you think she is a frivolous spendthrift idiot and you--the superior one--know best. You do something nasty and passive aggressive (hint: good partners have CONVERSATIONS about finances) and then verbally abuse her? Yes. YTA", "YTA not all brands are the same. Sometimes you can buy generic sometimes you can’t. Calling her a name over it would have gotten you an invitation to get TF out of my house too. Congratulations you’re going to be a divorcee for being a cheapskate and an abusive ah.", "YTA the thing about name brands vs knock offs when it comes to food is tricky. You have to think of this in terms of allergies here.\n\nLet’s say I buy a certain brand of cereal that is free of nuts because I have a nut allergy that is deadly(I don’t actually it’s just an example). If I always buy the same brand it’s because I can trust it’s ingredients. If I asked a SO to do the grocery shopping and they just bought the cheapest without reading ingredients it could be deadly. The off name brand might use nuts in their flour and could kill me. \n\nThere is also ethical and religious reasons as well someone may buy specific brands. If you are a practicing Jew and only eat Kosher food then you need those Kosher name brands. It is well known that Cage-free eggs come from Chickens who are treated better than non cage free chickens. \n\nThere are many reasons why someone may need a specific brand and the cheap version doesn’t work.", "NTA for wanting to save money but definitely TA for calling her a nasty name over this. WTF are you thinking? Also, if you're so concerned about price look for coupons for the brands she wants. Often the savings can be substantial over store brands. Two major grocery stores in my area regularly have 2 for 1 deals or bundle deals (meat, sides, bread, etc.) for a great price.", "YTA for ignoring what was on the list and doing whatever the hell you wanted to. Obviously when she writes the brand, she's indicating that's what she wants. If you disagree with the choice, have a discussion, don't just passive aggressively act it out. Also YTA for calling her a \"nasty name.\"", "Doesn't sound like either of you are particularly TA but that seems to have gotten out of hand quite quickly.\n\nSome branded goods are the same or near enough to non branded.  \nOther branded goods are very different.\n\nIf I send you to the shops to get a loaf of Hovis or some Fairy washing up liquid and you come back with own brand, fair enough.\n\nIf I sent you down to the shops to get Kellogs Cornflakes and Brewdog IPA (Breakfast of champions :D) and you come back with own brand flakes and beer, then you my friend will be wearing them very quickly.", "YTA\nShe asked you for help and you bought stuff that she didn't want (if you wanna talk about a waste of money), and then called her a nasty name. \n\nShe's been buying those brands for months and clearly you hadn't noticed breaking the bank so buy what she asked you to.\n\nWhen you get home tell her that you saw there were cheaper options and want to talk about if there are things you can substitute. You know, like an adult conversation where your both on the same page instead of you making a unilateral decision for the household and then being a huge asshole about it.", "YTA. \n\nShe gave you the brands she wanted because she wanted those brands. Why is it so hard to just get what she wanted? Jfc.", "\"I called her a nasty name ...\"  \n\n\nWell, you're an asshat for this.", "There are some things you can purchase cheaper off brand and you can’t tell the difference. However, there is some things the name brand is the better purchase. Not just for taste but quality. Sometimes you use more of the cheaper product than you do the name brand which in turn costs more in a long run.", "YTA.  What makes you that is not buying the wrong brands but disrespecting her by calling her a \"nasty name\".  Conflict is normal in a relationship but disrespect should never be tolerated.  If you can't have respectful conflict then you will never have a successful relationship.", "sounds like y'all have bigger issues if you're name calling and she's telling you to look for an apartment over this after 8 months. and are all \"businessmen\" rich? my husband is a businessman in that he is a man who owns his own business, but that doesn't mean we are rolling in the dough. it sounds like this is a petty/immature disagreement to begin with. i buy almost all generic/store brands but there are certain things i prefer to have of a specific brand. maybe consider proposing a compromise of a similar nature.", "I think YTA for 1.not asking her ahead of time about getting different brands, and 2. calling her a nasty name. I get that money may be an issue, but there is a better way to address it than name-caling.", "ETA - I'm not 100% sure YTA for buying different brands and cite [Glennon Doyle's sister Amanda as source](https://podcasts.apple.com/us/podcast/6-overwhelm-is-our-exhaustion-a-sign-that-were/id1564530722?i=1000525533995). In this episode Amanda describes how wonderful it is that her husband truly owns grocery shopping, and she therefore accepts all of his purchasing decisions. \n\nBUT also outlined in the episode is how exhausting it is to carry the mental load for the household as women do. The fact that you state you are doing the shopping \"FOR MY WIFE\" is a blazing red flag that she is carrying the same burden. The problem isn't that you don't earn enough for name brands, it's that just like her last businessman husband she can't trust you to do your part. \n\nShe's definitely struggling to communicate and lay out exactly what she wants, but I can see it clearly: SHE WANTS TO BE ABLE TO TRUST YOU TO HANDLE THIS and she clearly does not. I feel she isn't being as generous as she could be (some brands don't matter/some do), but also your insecurity about your income is totally in the way here.\n\nYou guys can fix this.", "Why do you call your wife names over groceries? Why can’t you talk like two normal adults", "YTA and your wife now knows that she can't rely on you. You could have called from the store to ask about substitutions but you didn't do that. I can't really tell if this was weaponized incompetence, one-up-man-ship, or lack of respect, but your actions after the fact tell me your motives were not good.", "YTA you should have just said that you didn’t wish to buy them if she already stated them specifically", "Yeah, did you ask her what her reasons were for specifying the brands? You mentioned that she has kids, were the specific brands for them? They can indeed be very demanding about wanting some things that really aren't very different from their generic counterparts, but sometimes there are notable differences. You should have found out what these reasons were before vetoing all of them with replacements. She may have even agreed with you, but needed something specific like a Cheerios box...into which she can put the generic honey nut cereal bag for the next few weeks because she's tired of dealing with 7 year olds nonsense tantrum and this is easier until they are old enough to understand why their behavior is bratty.", "Be honest OP, if you asked her to buy beers from Brand X and came back with the house brand, would you say it’s all the same?\n\nYTA sounds like weaponized incompetence", "Sounds like OP is just on a teacher's salary without the knowledge/skills to become one..", "Yeah that quickly went from misunderstanding to asshole territory.", "Came here to say this. But you said it much better!", "This exactly this !!", "If the shopping list has specific brands, ask about that when first given the list. Or call from the store when you see the price difference if you were unfamiliar with the products. \n\nAt no point does OP specify what type of products were on the list. Things like lotion and toilet paper can be very different brand-wise, without even getting into the different flavors of branded food products. Buying a “cheaper” one is buying the *wrong* one because they are not the same and they’re not simple substitutions.", "Weaponised incompetence, but make it passive-aggressive", "I have zero respect for a grown adult who can't handle grocery shopping. & even less respect for one who gets mad at someone else when they can't handle it. YTA", "If anything, this post shows OP knows nothing about grocery shopping and cooking and how they interact.", "I think this is what OP had in mind when replacing the brands with the generic items. \n\nIf most of those items are for OPs wife’s children, whose father is mentioned in present tense and no reference is made about his involvement in raising his kids and providing for them, I’d assume he meant exactly that. \nLike he didn’t see why he should spend more from his own pocket for products for his wife’s children. \n\nThat’s between him and his wife, it’s up to them how they contribute to the children’s care and upbringing (he didn’t mention anything about this aspect). \n\nAs for escalating the argument and calling her names, totally TA. Two adults can have a normal discussion and not blow up at each other for something like this. They’re also teachers, or only OP is - I find it ironic how they’re both acting like the kids they’re supposed to educate.", "At least call her while in store and ask if it’s ok if you get a cheaper alternative", "He made the decision for the household, not her. He is usurping half of the decision, as is she if you think about it. Grown-ass people shouldnt call each other names though.", "Flowers and chocolate doesn’t make up for abuse.", "Oh, you know he's been an AH the entire time.", "Maybe. Or maybe it is and she's just not willing to let him call her names. Ever.\n\nIf he's calling her names over something minor like that, how is going to act in more serious disagreements? Maybe she's already had her fair share of verbal abuse in prior relationships and this is her boundary.", "Lucky guy his bad behaviour will save his life in the end... marrying a single mother of 3 is suicide...", "No one jumps to \"get an apartment\" on the first argument.  I suspect this isn't the first time OP has thrown a TLT (toddler level tantrum) and called his soon to be ex a nasty name.", "If he’s abusive to his wife I’m betting he’s abusive to his students.", "Joe-Joe's can't compare, it's almost an entirely different cookie. Good in its own way but it's like substituting cheesecake with a chunk of mozzarella", "I am given to understand that “Hydrox” was actually the original version but that Oreo had better marketing after it was copied. :)", "And with food, ingredients can be different. If someone in the household has an allergy and expects to be able to use what's in the house safely that can be a big problem.", "Don't make this about women or brand loyalty. Any person, including men, that does groceries regularly, quickly understands sometimes cheapest brands are trash. Detergent that doesn't clean and gives you allergy, see-through toilet paper, inedible pasta, undrinkable juice, etc.\n\nKids may be picky too", "This post is annoyingly condescending. I'm also a man who does all the grocery shopping in my marriage and has brand loyalty. Don't tell me my business, weird grandma sounding lady.", "I sincerely hope she starts buying him the cheapest, roughest toilet paper she can find. And serving him lots of spicy food.", "Saving money might be important to men but who cares am I right?", "For some stuff it is true that they are as good as the name brand, but there are certain items that do NOT have the same quality. The wife has been grocery shopping a lot longer than he has and knows which items are in which category.  He does not", "Same factory ≠ same product. Recipes / compositions and quality of raw materials VASTLY differ within the same factories for different product.  Even for cereal, there's different silo's with different quality flower within the same factory.", "How would he know if they can afford it? Sounds like he’s never done the grocery shopping before, and yet somehow they haven’t ended up out on the streets.", "I called her a \"b\\*tch\".", "Oh yeah, gotta get that bag to buy real Kraft Dinner!", "He's the AH for going against her wishes without discussing it first\n\nYou don't get to make decisions on somebody else's behalf", "If your kids won't eat store brand mac n cheese is it really worth saving 10 cents?", ">You called her a name you’re not even willing to put here?\n\n&#x200B;\n\nYeah that was the ICK here.  Having a hard time believing this guy is actually a teacher.", "Cheerios is one of the few items that I need to buy name brand. There's a very specific taste to the plain Cheerios that is just not right in the generics.", "Never mind the fact he is doing grocery shopping “for his wife”. Presumably for things that he will also eat. And 8 months into their marriage this is the first time he’s done the shopping?? He’s an AH for that alone", "Women are generally very similar when you ask them about their sanitary products. Or just buy a smoker the wrong brand.", "He mentions grocery shopping for the wife, I understand that it’s perhaps for her kids? Like not for the household. \n\nUp to them how they split their expenses since they have three children who aren’t OPs. But it’s shameful that teachers can’t act more mature than the kids they’re supposed to educate at work. OP is an AH for yelling and calling his wife names, her reaction to tell him find an apartment is exaggerated as well in my view.\n\nThey’ve only been married for a few months, perhaps they didn’t discuss these aspects in depth before tying the knot.", "Or OP has been learning from the kids rather than teaching them? It's such a teenage way of escalating things that both will have seen before.\n\nOP: Here's my homework\n\nMrs OP: It looks like the wrong homework - this is English, not Art.\n\nOP: What are you talking about? It's all schoolwork! It's so ridiculous. I chose to do a painting of Lenny and George instead of an essay. It's all the same.\n\nMrs OP: it's not the same. You'll need to do it again. \n\nOP: What a b****! \n\nMrs OP: And for that, you'll get a detention.\nOP (turns to audience) Can you believe this?\n\nYes, OP, yes, we can 😂", "Sounds more like sticker shock and he freaked.  I don't think he knew how much 3 children cost.", "Totally agree. He could have called.\nI usually do the grocery shopping but when I ‘delegate’ I (unfortunately) have to write everything in details: acceptable brands or not, package size (occasionally, bigger is not cheaper), even the look/texture of some fruits and vegetables. It’s exhausting but if I don’t do that, I don’t get what is needed. When I don’t care, it’s just the product type so SO can chose whatever he wants.\n\nOP, you should have taken what she asked OR called her. There was time to discuss optimization at home and ask her if some brands could be replaced by cheaper options.\nYTA because she usually does the grocery shopping and now she knows she cannot delegate. Very badly done.", "Yep. My husband and I usually shop together but if he goes alone, he calls me if he isn't sure what a specific ingredient is, or if something is out of stock & he's checking if a substitution is alright because he knows most of the time what substitutions are totally fine, but sometimes if I'm baking then it's not. Very rarely he might call and ask if we really need something of a specific brand because it's very expensive & usually unless it's something very specific I tell him to get the cheaper option. \n\n...there was one time though he bought coconut milk like the drinking kind in a carton instead of a can of cooking coconut milk/cream, but tbf I used to always buy the drinking kind so he just assumed that's what I meant lol", "Yep and presumably the shopping was for the whole household yet he says it was for her. Nope, for everyone mate!", "Given the nasty name calling, it’s aggressive-aggressive!\n\nYTA", "It's not like his goal was to get out of doing the shopping. It was to save money. So not really incompetence as much as controlling decisions", "Presumably she does this chore regularly and he does not, evidenced by the fact that she wrote him a list of what so buy. That means she has the responsibility of determining what to buy, probably based on trial and error, and he should discuss it with her before changing it. I would never presume to suddenly decide how we pay the bills or which car oil to use because those are primarily my husband’s tasks. If I have an issue or want to change something, I discuss it first!", "For sure. I'm sure there was a lot of weaponized incompetence and tantrums thrown around before this.", "Omg, obsessed with that comparison 😂💀", "It’s *always* that darn marketing that wins out!", "Yes this! I’m very particular about brands (I do use the supermarket own brand, but when I do, please don’t buy any other brand) because I’ve researched ingredients on everything that our usual supermarket sells. \n\nAlso, at this point, I’m way too invested to switch supermarkets. So when my family was down with COVID, our usual supermarket couldn’t deliver (it was at the time possible to do this without contact) because everybody had to order online, my parents switched from their regular chain to ours in order to pick up the things we needed.", "Not just foods but household items too. I’m allergic to most bar soaps and body soaps. Don’t know why yet. We’re still figuring it out. However, Dove bar soap, is currently the brand that I can use without having the need to scratch all my skin off. I’d be so upset if I sent someone to get it and they came back with a generic because it was cheaper.", "Did he save money? If he bought formula, diapers or any other things the kids don't use, he wasted money because they now have things they won't use and she'll also go and buy the right stuff.", "Economy is important. A big aspect of this is that it's important not to practice false economy where you think you're getting a good deal, but the product actually isn't suitable/doesn't last as long. Some things cost you extra for the brand profile, and it's worth not spending that money; other things, it's genuinely more worth getting the branded product. The important thing is knowing which you're doing.", "Well, he can start setting an example then. If he will be happy with cheapest pasta and tomatoe sauce, cheapest clothes and detergent, family will follow this tremendous genius that values economy so much he never did groceries and does not know what his family needs", "you might just wanna discuss with your partner why they prefer the Heinz beans to the supermarket ones. What exciting things do these couples talk about if they don't have time to talk about why they decided to have brand loyalty for Heinz ketchup? I know many exciting facts about my fiancee, such as that she doesn't like the home-brand mayonnaise.\n\nMaybe splitting the chores a bit more often would be helpful", "We dont have a list what she wanted and what he bought. Could all be stuff made in the same factory just with an offbrand on it.\nMaybe she doesnt know that and just wants name-brands because she is used to it or wants it for status.", "You sit down and make a budget together. Yes I’m sure she has been holding the mental and physical load of grocery shopping but he may know that they need to cut back on spending. If you budget so much for groceries and you can still buy all name brand then fine. If not compromise.", "Why?because you are in capable of following a simple instruction? And you, a teacher that’s laughable. \nSome of the cheaper brands don’t taste as nice. You could have just done as requested, but no, you behaved badly, tried to dismiss her and act like a big man telling her she was wrong, and when she rightfully called you out, you resorted to calling her names. In school, we put,bullies in time out. Time to go sit in the naughty corner and write some lines. You also got a fail on your shopping assignment. Please repeat the grade.", "Yeah, YTA a whole lot.", "YTA", "Easy YTA\n\nIt’s be one thing to have an adult conversation about whether or not the family should pay extra for specific brands, calling her nasty names because her opinion is different than yours is uncalled for", "You don’t even want to type it here, but you’re comfortable calling your wife that when she (rightly) points out that you botched the errand?\n\nDefinitely YTA.", "Calling your wife a b\\*tch over a dumb fight about groceries is actually b\\*tch behavior. You're projecting. You are not mature enough for marriage.", "Wow you’re pretty thick in the head for a teacher.", "Ahh, that's usually a non starter. For that YTA, however if this is a one off situation then communicate with love and respect. And don't do it again! I hope everything works out in everyone's best interest.", "She should divorce you\n\nYTA", "Oh, then I love she wanted you to leave. That's good on her for not being willing to deal with a verbally abusive and immature partner.", "Its a joint household, joint income, joint expense so he does if buying more expensive brands creates debt.", "it also depend on country like where I live stuff have gotten expensive as hell and brands are as much crazy that's why I'm asking brand I might have forgotten to ask the country tho", "Oh, I briefly dated a teacher who spoke to people this way. He was great with kids and horrible with everyone else. We were done after a few short weeks. I totally believe this guy could be a teacher.", "I feel like this is true for most cereal. Store brand cereal usually tastes like cardboard. I'd rather have something totally different than a store version of my preferred cereal.", "swiffer is one of mine. i tried buying store brand and was shocked at the difference.\n\nsome things- like toilet paper- i'm perfectly happy, or even prefer store brand.", "Also unlike many of the \"off brand\" oat circle cereals, Cheerios is certified gluten free.", "Yeah, 8 months is a very long time for never having done the groceries. If my husband called me a b**ch for pointing out he didn’t follow the list I took a lot of time making (hello mental charge!) I’d tell him to find a new place too.", "Depending on what he called her, it might have been an honest dealbreaker.", "He sounds like a 13 yr. old, not 35.", "Somehow I suspect he will be eating some of that food, so he was doing it for himself.", "The teacher did *not* understand the assignment.", "There wasn’t even discussion around compromise . He made the decision  and called her ridiculous and verbally abused her when she called him out on it", "No, if it's a Joint household\n\n\nThen it's a Joint decision on what gets brought,", "Absolutely and there are some brands that while they are significantly better --I'm looking at you Rao's pasta sauce-- I only splurge occasionally and only if it's on sale.", "Oh he called her a b**ch, it’s he’s only comment", "Especially if he brought yucky brands nobody will eat!", "Underrated comment.", "well ya that's why I didn't give like a judgement yet because like in Canada right now brands are crazy but just a apartment is like twice my paycheck per month so that's why I'm asking such too I don't make massive money but a teacher where I live barely make 2$ more then I do", "YTA - Name calling? From a teacher? Really? Also just reread your own post, it reeks of misogyny, and insecurity.", "Well, that escalated quickly... Some things Non-brand/Brand are pretty equal in blind taste test other things brands matter... like canned or frozen fruit/veggies, dairy - nothing is wrong with the store brand but they tend to taste a little bit better.\n\nMatPat does a decent job of getting into the whys and hows. So kindness maybe checking out coupons to help the budget OP and talk to your wife again you both need to apologize to each other.\n\nFood Theory: Yes, The Knock Off Is BETTER! - [https://www.youtube.com/watch?v=23e4PhF9e30&t=479s](https://www.youtube.com/watch?v=23e4PhF9e30&t=479s)\n\nESH/YTA- for how y'all handle it. It wasn't about the yogurt... Well, it was but... There is something more here\n\nEdit to add: if your step-kid(s) are, ND -neurodivergent, the brands can matter a lot, or kids with food allergies or sensitivities...", "My ex husband did the grocery shopping and always bought the cheapest stuff. When split, I had a heavenly trip to the grocery store and bought what I wanted.", "YTA—it would be different if she didn’t have brands listed. If she specifically asked for Prego sauce and you buy Ragu, what are you doing? It’s pretty clearly listed. If it just says “spaghetti sauce,” I’d be more inclined to side with you.\n\nNot sure why you called her a nasty name either, that’s childish AF. If she’s been buying these brands and it hasn’t been breaking the bank, then there was no reason to go “off-list.” Major YTA, good luck apartment hunting.", "YTA.  You're just butthurt that your wife asked you to do a simple household task and decided to punish her for it.  THAT's why she put you out--not for buying the store brand.  She doesn't want to put up with your petty version of weaponized incompetence OR your snide comments about her ex husband.  And I call bullshit on the whole \"we can't afford it\" thing.  If the brands she wanted were going to bankrupt your family, you'd have noticed this at some point during the last eight months.  You can clearly afford them because *you've been able to afford them all along.*", "You need to go look for that apt.  I have an inkling of what you called her and that would be a deal breaker for me.\n\nYTA", "YTA\n\n1- NEVER CALL YOUR PARTNER NASTY NAMES, what the fuck dude?? You're a grown ass adult with a degree. Do you call you students nasty names because they didn't do their homework? Probably not. So why do you respect your students more than your spouse? Disgusting.\n2- Brand names aren't even that much extra. You maybe saved $20 if you bought $150 worth of groceries. MAYBE.\n3- If I asked for Doritos and my partner got me those nasty ass off brands, I'd be pissed. If I asked my partner to get Gain instead of Tide because Tide's smell makes me gag but he got Tide, I'd be upset. Except. My partner WOULDNT do that. If I took the time to write brand specifics, he would buy the brand specifics for me. Because he knows if I write \"toilet paper\", it means I literally don't care what kind of toilet paper as long as we get some in the house. But if I write \"Charmin toilet paper\", he'll get me some fucking Charmin toilet paper because I asked for it.\n\nHonestly, you just sound like a cheap asshole.", "Did you read the ingredients and confirm they weren’t filled with a bunch of preservatives and shit you can’t pronounce? If no then asshole, not for brand name but for buying poison.", "No. But you are for calling your wife a nasty name.", "YTA", "I can’t see this working, her and her 3 kids plus the wanting of branded food, nope I give it a year.", "You are both acting like AHs.\n\nFrom now own, why don't each of you shop for yourselves.\n\nThat way everyone gets what he or she wants,", "It's just a guess but weren't you by any chance her AP and the reason why she is no longer married to a businessman?\r  \nIsn't your frustration due to the fact that she didn't get as much as you two wanted in the divorce?\r  \nI'm just guessing but either way you didn't so much wave a red flag in your wife's face as you hit her in the face with that flag - YTA", "Just buy what she wants.  Also calling your wife names automatically makes you TA", "\"I insulted her, but AITA for buying cheaper brands?\"  \nWhy dont you put \"AITA FOR INSULTING MY WIFE?\"  \nYTA", "This sounds like weaponized incompetence.", "INFO: do you always get this emotional when you make mistakes?", "Yes. She has kids and brands do matter with some product. You take your home brand loo paper and I’ll take the quilt on. Thank you. Do you like a certain beer or shaving cream? Sure.", "YTA. You're not doing anyone any favors by shopping in the dollar aisle. Shit's expensive, yes. Even the cheapest shit. But if Claussen pickles were on the list and you bring home store brand crap, it's not the same. There's a reason that she specified brands. She knows what works, and presumably is the one doing most of the cooking. You suck at communicating, and calling her a name is never ok no matter how you feel emasculated or twitchy. Maybe stick to the list from now on or take a more active role in household duties. This is the first time you've gone grocery shopping?", "Wow. YTA. Buy what’s on the list. And don’t call your wife names just because YOU couldn’t do one simple thing correctly. Get yourself together or you are headed for divorce. You’re creating fights where there doesn’t need to be any. You sound like a very annoying person to be married to.", "YTA. You’re 35 years old and you can’t figure out how to have a simple conversation about groceries without calling your wife nasty names? \n\nYou didn’t even bother to ask her why she prefers specific things from specific brands or double check what she wanted. You just stumbled into the grocery store, a place you clearly aren’t used to spending time in, decided that you knew best, and then expected to be praised for ignoring your instructions. Sounds like your wife has four young children, not three.", "NAH\n\nLook….I understand wanting to save money but (as someone who’s spouse and kids have many allergies/sensitivities) brands *do* sometimes matter. \n\nWould your spouse be willing to sit down with you to determine which brand-specific items are a want and which are a need? Perhaps there is a compromise to be had here.", "You may need a divorce -- for Her sake.", "Some things it doesn't matter, some it does.\n\nIf you buy some mayo that's not my brand, there's gonna be a fight. Canned tomatoes aren't so different (except I try for the low/no salt cans).\n\nIf it was such a big deal, she should have either done the shopping herself, or arranged for curbside pickup.", "So, your wife asked you to do the shopping, so it's normally left to her and she knows what she likes and what works.\n\nShe clearly labels them as the brands on the list but you decide to unilaterally just switch them out because clearly she's never even considered you could get the cheaper ones, and when you find out she actually wanted those specific brand you get into a fight.\n\nOf course YTA. Its fine to question \"do we need the expensive brands\", it's fine to not have realised she wanted the specific brands at all, but the way this is written it sounds like you knew and just thought you knew what was better for her and when she was annoyed at that you threw her ex husband in her face.", "Of course YTA.  You didn’t buy what she wanted and then called her a nasty name over it.  And you didn’t go grocery shopping for your wife, you went or your household and then got mad at her when you did it wrong.", "Ya I’m a cheap husband too. But you must learn my friend. Certain things are important to wives and you must follow directions to the letter. This is one of the secrets to a lasting marriage. Some things you can go cheap on others will be brought up in divorce proceedings. A piece of advice don’t you ever ever EVER by any toilet paper beside the brand she tells you. This also goes for feminine products. Suck it up apologize and learn where the compromises are and aren’t.", "YTA", "YTA you didn't buy what she wanted, you decided you knew better than her and did what you wanted.", "You're TA for calling her names. But NTA for buying cheaper. She should have specified whether she wanted cheap and cheerful or brand specific, you should have asked if she wanted cheap and cheerful or brand specific. \nI know my mum will buy certain name brands because my brother is autistic and can tell the difference between certain tastes so there will be things she has to buy a specific brand of because he won't eat anything else. \n\nApologise, then talk. Marriage isn't supposed to be easy, hell, life isn't supposed to be easy, it needs effort and work. Go forth and make effort.", "Ingredients!!! Some cheaper brands, for example, have high fructose corn syrup (not regular corn syrup) because it’s cheaper than sugar or artificial rather than natural food coloring. I would be upset if you bought artificial rather than real vanilla. Also, cheesecake made with generic cream cheese is not the same as cheesecake made with Philadelphia brand. These are just examples where brands make a difference. YTA for not discussing it with her first.", "I came into this post FULLY ready to say N A H. I know my husband went to the store shortly after we got married and came home with name brand stuff and I was like dude, this is expensive, just buy Kroger brand next time? And he was like oh my bad. And that was the end of the conversation because we can hold a normal conversation apparently? YTA for immediately jumping to a giant argument and name calling and not just talking to each other. The reason this is an argument is likely because you're not even willing to consider her side. Also if someone takes the time to write the brand name down, that's probably what they want? So extra AH points for that. Maybe the kids only feel good off a certain brand of xyz. At minimum call and ask about substitutions if you don't notice until you're at the store.", "If it was that big of a deal then she should of addressed it before hand. Anytime I go grocery shopping and they don’t have a specific brand, I get what I can and it’s 99.999997893% of the time no issue. I don’t see why it’s a big issue here. Not the asshole", "YTA.  She cared enough about the brand to actually write it on the fucking list, but you disregarded that completely because you think you know better.  You called her a \"nasty name\" on top of it.  You're a major asshole.", "YTA the money has nothing to do with it if she's been able to bug these brands for months without issue. Plus anyone who does any housework in general knows that sometimes the brand just works better then generic or store brands.", "NTA. Ive found that a majority of brands come from the same factory and are labeled different. IE: kirkland vodka and grey goose. Same vodka i think one gets filtered a bit more. If she told you to find an apartment that quick from being called a name I would look at the relationship. Just cause you wanted to save money on groceries doesn’t give her the right to give you shit for it.", "Buy the brands your wife wants, whether you agree or not. Keep peace in the family.  \n\n\nAnd, NEVER EVER call you wife a nasty name. That is a fast trip to divorce court.", "YTA\n\nYou sound like one of those men who are so uninvolved in the household while also thinking they know better. \n\nThe brands she buys are probably for taste, quality, or just because she wants to. I really doubt that the price difference among the things she buys and the things you brought warrants any of this. \n\nAnd anyways, even if you totally disagree on this topic, it still doesn’t warrant calling your wife names. \n\nApologize and learn.", "YTA.\n\nFirst of all, you're not doing the grocery shopping \"for your wife\", asshole.\n\n\"I bought what she wanted\". No you didn't. If she made the effort to write the brand, it means that's what she wanted.\n\n\"I thought this was ridiculous\". Why would it be?\n\nCome on now. Do better.", "YTA\n\nQuality and flavor of products can vary a lot between brand names. Kraft mayo and Hellman’s are really different. Look at the difference between potato chip brands. Even canned vegetables which mostly taste the same can have quality differences such as cheap brands containing stems (noticed this with green beans). ***You*** may well have done is wasted money on something none of the kids or her will eat because all you could see were the numbers at the store.", "YTA\n\nYou can't follow directions.\n\nYou can't have a constructive conversation with someone about something you disagree over.\n\nYour first resort is to start calling people nasty names when they disagree with you.\n\n\n\nAre you sure you should be a teacher?\n\n\nEdited - spacing", "YTA\n\nIf there's brands specified, there's usually a reason. And you didn't do the shopping \"for your wife\" you did a household chore. You are going to eat that food right? And if that's your attitude, (including name callung?!?) Then it sounds like you're not adult enough for married life.", "Info: What products are we talking about? Milk? Baby formula? Soap? Notebooks?", "YTA for ending your marriage so quickly; you don't comment on a previous partner, that's nasty, and calling her a nasty name is disrespectful. You're obviously way to immature for marriage. Good luck on your apartment hunt.\n\nThe thing to do was look at the list and ask why these brands; the brand was listed for a reason but you're such a jerk all you can see is they were more expensive.\n\nShe has 3 young kids and foods don't taste the same to everyone. I can eat random cheese but need a particular brand of yogurt. \n\nThe cheaper brands aren't always the best.", "YTA for calling her a nasty name. The rest is trivial marriage issues", "But you didn’t get what she asked for. You got what you think she should be getting instead - without having the conversation beforehand. And then insulted her.\n\nYTA", "YTA do you think that she never noticed the cheaper options when shopping? You didnt get what she asked, you ignored her because apparently you think your wife is too stupid to even make a grocery list. This is entirely your fault. And then you go home and call her names? Not how a husband should behave.", "YTA. It sounds like you need to find Ibotta or something to help you past the sticker shock. \n\nHelp out your family more often and you won't be so surprised.", "YTA\n\nYou had ONE job at that moment.  Your wife took the time and trouble to 1) make the list and 2) give specific instructions so you wouldn't be confused.\n\nYou DIDN'T EVEN CALL HER TO CHECK!!!\n\nMaking a mistake in good faith is understandable.  You should have apologized, returned the items, and bought the correct ones.\n\nINSTEAD, you blamed her and insulted her.\n\nYou just raised a flag as red as blood.", "You're absolutely an asshole. Who starts name calling over groceries!? Enjoy your new apartment life.", "YTA. Have you ever ate Kraft Mac and Cheese vs an off brand Mac and Cheese? Don't mess with name brand where it counts!", "YTA \n\nJust because it’s cheaper doesn’t mean it’s the same thing. Food can taste differently. Cleaning products can be less effective,this you have to use more to do the same job,which ultimately costs more. \n\nYou didn’t buy what she asked for. You got what you wanted and didn’t think to stop and question why she asked for those certain brands.\n\nThen, when she got upset, you threw her past relationship in her face and insulted her. Exactly what did you think that would accomplish?", "Yes, YTA. I am sure she would have gotten past the argument but instead of rationally and calmly listening to your wife, and hearing what she was saying, you doubled down and disrespected her by calling her a nasty name. She didnt kick you out for buying cheaper brands.", "23F with a 25M. My fiancé loves a specific brand of granola bars he likes. I do the grocery shopping and I do not under any circumstances substitute the granola bars. Why, You might ask. It’s simple. That is his preferred granola bar, they are a part of his routine and I respect my partners wishes. YTA your wife gave you specific items to get and you disregarded her feelings and desires. Also you’re an adult do not call your spouse names. Grow up", "YTA. The fact that you’re pointing out the fact that SHE has 3 young children tells me you’re bitter for what you probably consider contributing to their sustenance and thus deserve only the cheapest. And no you did not buy what she wanted—she went out of her way to specify which items she wanted and instead you bought what YOU wanted under the guise of being a penny pinching school teacher. Also, why would you bring up her businessman ex-husband? Do you feel emasculated by his existence and income? This all seems like a problem you created and seem to want to blame on her for being picky.", "I’m all for bargain shopping and getting generics. But some things you just don’t cheap out on. If she won’t make any compromises that’s one thing. But if she really likes a couple certain things give her that.", "YTA.  A huge AH.  There are reasons ppl will only use the brand name.  In certain products, the brand name is the best product.  Better than the cheaper option.  There are def some things that you can buy generic, but not everything.  Your wife has obviously been shopping her whole life & knows what works & what doesn't.  If your wife gives you a list, stick to the list.  Don't go buy the cheaper option bc you think you know better.", "More information: do you just hate your wife or women in general? Why did you get so angry when she disagreed with your choices? Why can't you talk to your wife about your valid concerns while also respecting her opinions in order to find a compromise without resorting to name calling? How did you manage to get married before your lack of conflict management skills came to light? When is your therapy appointment scheduled?", "He’s definitely the AH especially if her kids are anything like mine and will only eat certain brands of certain foods.", "No, this is ESH. She could have explained why she wanted certain brands and could have offered to pay for groceries herself or found an extra part time job if money is tight and they can’t afford her getting name brands. Both of these people acted poorly instead of discussing the issues calmly like adults", ">I don’t think this is the first time she ask[s] for branded stuff.\n\nI think it’s the first time he goes grocery shopping since they moved in together.", "I always think of diapers---I had three kids, and tried every different brand because they were so pricey. First kid needed Pampers---he would leak out of every other brand. Which meant I had to do more laundry, which increased the amount spent on detergent and running the machines, and more time for more loads. Second kid couldn't wear Pampers because it would give a rash. She could only wear Luvs. Third kid? I had to make a special trip to Target because their store brand worked best on her.   \nWhen someone requests a certain brand, you honor it. If you have disagreement over the cost, you use your words---and not nasty insulting ones.", "It's why, as a teacher, I always wanted Crayola crayons and Elmer's glue sticks. They work better and last longer.", "I was looking for this comment, because I am 100% certain something he cheaped out on was menstrual products.  Like, a take it to the bank guarantee.", "Or babies. Randomly switching formula is bad. Wrong diapers can lead to rashes.", "He substituted without asking her. That makes him an ah, since it’s entirely possible that she’s already tried the different brands and knows she doesn’t prefer them. And for some things you shouldn’t randomly switch (like baby formula, if her kids are still that young).", "Nobody gold digs by marrying a teacher. She loved the guy, though I have no idea why from this post lol.", "Since it’s apparently never been a financial problem before, I doubt that that would’ve changed without her noticing.", "He isn’t saving money, because chances are she now has to go buy the correct stuff.", "How is the wife an ah?", "It’s obviously never been a problem or even topic of discussion in eight months, so it doesn’t sound like affording it is a problem.", "Also an ah for buying the wrong things. Some stuff really shouldn’t be changed randomly, and she likely has a reason for wanting a specific product.", "Did we read the same post? She did specify brand, he intentionally ignored it.", "How is intentionally buying the wrong stuff and insulting his wife “being smart”?", "Yes she was a idiot for marrying a man that can’t be bothered to communicate and gets upset when he does something wrong.", "Some stuff you can’t just randomly substitute, like baby formula for example. It’s interesting that OP didn’t specify what he bought. Chances are it’s something where it makes a difference. Like laundry detergent that doesn’t clean properly or gives you a rash.", "So it’s wrong to marry a single mother? We don’t know if the bio dad is in the picture or if he pays child support.", "If it’s something that doesn’t work as well or shouldn’t be randomly changed (like baby formula), that means he’s wasted money because they now still need the right products.", "Buying the wrong stuff likely means she’ll now have to go buy the right stuff.", "Also AITA for intentionally not buying what my wife explicitly asked me to.", "She wrote down specific brands for certain items and OP disregarded it and got store brand anyways. So I think it's safe to guess that she wanted those specific brands if she went through the trouble of writing it down on the grocery list.", "He didn’t say that money was tight, and if  this was his first time doing the shopping in 8 months they seem to be able to afford the brands she usually buys.  Then he decided to call her a bitch when she was upset. I agree with his wife.", "He didn’t give her a chance to explain, because he bought everything without checking with her why she wants particular brands. Or do you think she should have randomly justified her entire list to him before he went?", "asked.  by his poor wife who is carrying the mental load by the sounds of it.\n\nhe also sounds like the type of guy to say \"they're your kids\" and bail out of helping", "Down with RoseArt! Lol!", "Over something this fucking small? Get a grip.", "Yta. You deserve to be called so much worse but I'll get banned and your ass isn't worth it", "My husband would be in the fucking dog house for calling me a bitch during an argument.  Resorting to name calling with your spouse is ah behavior.  YTA", "Grow the hell up YTA", "It never ceases to amaze me how many men willingly marry women they hate.", "Some life advice: if you can't type it on reddit without an asterisk, don't use it to name-call someone you love.", "You called her a b*tch over…groceries. \n\nMy dude, if this is how you communicate with your wife and I was her, I’d be telling you to look for an apartment too.\n\nHere’s how you could have done this: “why do you buy these specific brands?” In theory, that would then lead to an adult conversation where you both listen, it’s resolved, and you’re not on Reddit asking if you’re an AH.", "I am an avid baker and cheaper brands absolutely affect the end product. I have learned the hard way not to settle on most things. Buying store brand sugar is totally different than buying cheap wondra flour.", "Pasta is one of mine.  I'll go for the diet cola instead of Diet Coke, but I will ONLY buy barilla pasta.", "Cereal, toilet paper, cheese…there are certain things that I want a specific brand name.", "That’s all well and good if you can afford name brand cheerios. I can imagine how tight money might be on a two teacher salary. It might be the choice between nothing or off brand Cheerios.", "Depending how young the children are, they might not all be potty trained either and not all diapers are created equally.", "I agree with you completely. But I do think it would be amazing if a high school student had enough insight and understanding into the themes of \"Of Mice and Men\", as well as the command of painting it would require, to be able to interpret the relationship between Lenny and George in a visual manner. Again, not as an essay for English of course, but show that paiting to the art teacher and it's an automatic A.", "Yes! All it took was a phone call. Bro is weird. From the second sentence. “major grocery” shopping? OPs wife does this every week.", "Having to buy everything again because the different brand isn’t the same actually wastes money, though.", "It’s a joint household so they need to be on the same page about everything right? So Op dosen’t have the right to get the cheaper options without communicating with his wife right?", "I love cereal. Froot Loops and Frosted Wheat taste the same as the off brand ones. But try to give me off brand Lucky Charms? That is not the same and just gross. Off brand honey bunches of oats taste better than regular. Off brand honey oat cheerios taste like cardboard. I write specifically which one I need to get if I send someone to the store for me because certain cereal tastes better by brand", "Yeah. You learn over time which store brand things are decent and which are shit. Store brand garbage bags easily rip where something like Glad or Hefty bags are stronger and usually won't rip. Store brand dishwasher soap is almost always terrible and doesn't get things fully clean/leaves lots of streaks. Yet the same store brand of normal dish soap is just fine. It's really a crapshoot sometimes.", "It's not worth buying it if it won't get eaten is my point at the end of the day. Perhaps there are a few odds and ends that the children will only eat if it's name brand or just aren't quality enough and it's better to just buy the name brand (dish soap is like that often). \n\nWe know that she customarily does the shopping for the household and this argument only occurred because this time he did the shopping. He has not brought up this trouble each and every time she did the shopping. Instead he got defensive and called her a nasty name this time when she pointed out that she had wanted the actual items on the list.", "That’s why you stock up during coupon/sale time. Both of my parents were teachers. My grandma used to mail my dad coupons and he was/is great at finding sales.", "I raise a family of 8 on a single nurses salary...and I can front good cheerios.  (If cheerios was the thing, here it is name brand cream cheese and pizza rolls).", "But it might be that the kids won't eat off brand Cheerios but they're fine with off brand oatmeal. It's not a choice between off brand Cheerios and nothing, it's a choice between off brand cheerios and a totally different alternative that's still cheap, and OP didn't ask.", "Never mind diapers, I was thinking formula. Suddenly giving a baby different formula is a bad idea.", "Matey's are the most similar tasting to Lucky Charms, but not exactly off brand. Definitely a fair bit cheaper though.", "and that's before you get into having kids and taste preferences.", "There's a store chain near me that has two levels of store brand. If you buy the slightly more expensive store brand, all is good! You save a few bucks and get good quality stuff. The other brand, I tried their body wash and it didn't lather, and the razors had the blade at the wrong angle so it scratched the hell out of my legs. After that I didn't dare try the food from that line!", "I doubt it's the first time.", "My judgement was more based on OP's obvious animosity toward his wife's more affluent ex husband (who is doubtlessly paying significant child support that contributes to those groceries) and someone who is supposed to be a teacher of children jumping to \"nasty name\" calling when his viewpoint is challenged.", "Oh definitely. I don't have kids, but I still almost never buy store brand food of any type because most of it isn't even close to the name brand thing. The only exceptions are more basic staples like pasta, rice, canned goods, etc. since those usually are almost exactly the same.", "oh I don't say those are right at all for those his a butthole yes I do not have children and will never have so I try to be as neutral as possible before saying his a ass but I do say since it's a throwaway account his probably is the butthole and just don't want to be seen as one", "I also think downvoting a legit question as also kinda of butt move too but hey Reddit ^~^", "clearly what this all comes to is we all have shopping habits.\n\nand i admit it got me thinking- OP's wife has been divorced and shopping on her income, which presumably hasn't change much. \n\nIf she could afford these brand name items of her income, why wouldn't they be able to afford them of their joint income? \n\nyes, it's possible she had alimony and now doesn't but I'd assume that they took that into consideration before marrying.", "She'd have child support which would be able to handle the brands she buys", "right but that wouldn't have changed with the marriage. that would explain why she could afford brands that OP couldn't afford. but not why they couldn't afford brands that she could.\n\nthat could partly explain OP's \"she doesn't seem to realize she isn't married to a businessman anymore.\"\n\nmaybe OP has an issue with the fact that he can't/isn't supporting \"his family\"? no clue.", "Happy apartment shopping!\n\nYTA", "YTA\n\n>I bought what she wanted.\n\nNo you didn't\n\n>saying there were certain brands she likes to buy.\n\nSee. She told you that you didn't buy what she wanted.\n\n>I thought this was ridiculous\n\nYou decided your wife's opinion wasn't valid.\n\n>we got into an argument about it.\n\nDid you even ask her why she has her preferences?\n\n>I called her a nasty name\n\nYou called your wife a nasty name because she has a different opinion than you.\n\n>AITA the asshole for buying cheaper brands?\n\nFor buying the cheaper brands? No, or maybe a little for not calling your wife or asking about it before going to the store. But YTA for lashing out at your wife for her preferences.\n\n>go some major grocery shopping for my wife\n\nYou both work full time. How are you grocery shopping \"for your wife\"? You're grocery shopping for your household, aren't you? Or do you not eat the food? Do you ever cook? Are you acting like this in order to get out of your fair share of responsibilities?", "YTA. You indeed did not buy what she wanted. There are lots of reasons that certain brands might be preferred. If money is an issue, then the two of you need to agree to a budget and she can probably compromise on some of the items but there are zero reasons to EVER call your wife a nasty name. YTA", "You called her a bitch over grocery brands?\n\nYou do realize that cheaper brands are usually lower quality, which can sometimes ruin an entire recipe, right?\n\nYou owe her an apology for your ignorance and should grovel for forgiveness regarding the childish name calling. Shame on you.", "YTA\n\nYou called her a b*tch because she called out your stupidity?\n\nYou said you did the shopping for your wife. I can only imagine what else you consider you do for her. It's a household chore. Not for her. For the family. Because they should be shared and you need to step up if she let's you back. \n\nYou had one task... One simple task. Buy the grocerie for the family. She even did the hard work planning meals and even gave you an explicit list of what to buy. And you still messed it up. And then you insult her.\n\nQuit being jealous of her ex, get some therapy and if she doesn't kick you out, grovel and apologise properly.", "Bro no name shit is garbage half the time, you ignorant as fuck here \n\nYTA", "YTA - IF your wife asks you to get something specific, either get it or call and ask what is allowable as a difference.  And make sure to tell the pricing.  THis is a compromise situation and you unilaterally made a decision'", "My ex did shit like this. It was a power play to make sure I knew who was making the real decisions. You’re hung up on something and it isnt the price of groceries. YTA, do something right if you’re going to tell a bunch of internet strangers that you did. Cuz you didnt.", "This is weaponized incompetence. She asked you to do something she clearly is usually in charge of, and you screw it up so she won’t ask you again. YTA", "YTA  \n\n\nSometimes brands DO matter; when baking or cooking often cheaper brands don't react the same way when cooked or have additives (ex: cheaper preservatives) that add undesired flavours. If money is an issue, sit down and have a chat, don't insult your partner. Very immature", "Yta for calling her a nasty name. Probs beginning with B. Should of called her from the shop and checked. Or said \"oh OK no worries, can we just try these for now as we might be able to save some money in the future, sorry I didn't check\"\n\nIt's that simple.\nMarried 8 months and this is what you're arguing about?!", "And can we address that I highly doubt that all of the groceries you bought were for your wife. That is your family so presumably, you will be using some of these groceries. So you went grocery shopping for your family, and frankly, it sounds like he screwed it up.  YTA", "YTA: you could’ve just had a mature conversation with her instead of calling her names.", " YTA she literally spelled it out for you and you still couldn’t do it right. and then when she’s upset you call her a nasty name? you sound like a child, just buy the brands she likes and get over it. the fact that she told you to look for an apartment is telling me that this isn’t the first time you’ve done something like this", "YTA. \n\nEvery married man knows that you NEVER deviate from the list. And if you must, you call her as many times as you possibly can, from the grocery store. If she does not answer, immediately & frantically text her.\n\nAnd if you’re calling her a nasty name, and she’s threatening apartment after only 8 months? You guys need to talk about more than just groceries.", ">AITA the asshole for buying cheaper brands?\n\nNo, YTA for calling her \"a nasty name.\" And it sounds like you have jealousy issues.", "NTA: seems like she's got a financial bar she's expecting you to live up to. I grew up on cheaper brands and I can get name brand sometimes you can taste a difference but when you gotta make nickels count sometimes you gotta deal. Sounds like she doesn't wanna and is blaming you.", "NTA. Use the money you saved at the grocery store and get a apartment", "Did the wife list each item and it's brand specifically?  Rice Krispies is not the same as Krisp Rice Cereal.  \n\nI don't typically like buying the generic or off brand stuff because I can afford to buy the name brand.  Maybe she has issues with the appearance of generic brands?\n\nSeems like Much Ado about Nothing...", "i don't think youre TA for getting off brand, YTA for calling her a nasty name when she didnt agree with your substitutions. you shouldve contacted her prior to doing any kind of sub.", "ESA - Sounds like you both need to apologize. If she wanted the name brands then she should have gone herself to buy the stuff. Nexttttt - you should apologize for the nasty name calling.....", "i think mistake number one was marrying someone with 3 kids already lol.", "NTA, if you are asked to do the shopping and agree, it should be at your discretion to buy what is required. This should  apply to any household task. Your wife is displaying controlling behaviour by wanting you to do tasks but only on her terms and then threatening to kick you out if you don’t comply.", "Don't you think you should have checked with her before automatically changing brands?   There is a reason she put the brand names on the list.  And resorted to name calling?  What a child.", "How are you a competent teacher when you allow yourself to explode like that, do you call your students nasty names when you get angry also. First off many of us have to have certain laundry types (or anything that comes in contact with our skin) so we don't have an allergic reaction and those cheap brands can burn. I've been in the ER myself because of a chemical burn from bodywash, (on the upside I don't have body hair anymore either). If she has kids changing food products can cause stomach issues for little ones. So all in all YTA, and a prime example of one. My hope for her is to divorce your abusive self.", "YTA and your marriage is actually doomed.\n\nYour wife gets certain brands for a reason. You completely disregarded it and did what you wanted. This upset her and devolved into you calling her names and insulting her, and her having to ask you to leave. You’ve only been married 8 months.\n\nWhy don’t you ask her why those are the brands she wants? Why not ask her if there is any compromise to be had on any items? Why not have a real conversation about your financial concerns and go over your budget?\n\nGrow the fuck up.", "YTA\n\nEspecially with little kids, sometimes little kids get food aversions and will eat one brand and not the other. Yes, of course they need to be taught over time to expand their palette, but some nights mom probably just wants to get them FED.", "for the brands? no...that's a conversation rational humans can have and a lesson learned for next time\n\nfor calling her a name.  YTA", "*I called her a nasty name*\n\nDo you treat her like this all the time? Are you able to have a conversation with her without being accusatory and shitty to her? YTA buddy. The only ridiculous thing was your reaction. Do better, or find an apartment so she has a chance at finding someone that will actually respect her.", "Wondering if ex is paying child support for his kids. Perhaps that pays for groceries for the kids. In which case, OP would gladly cheap out on as much as possible and then what?", "op=yta\n\ndifferent brands have different flavors and quality(ie canned corn often will have more gristle and waste in it than a better brand).\n\nIf you wanted to get different brands, have the talk for the next shopping trip.  She wrote out specific brands, all you had to do was match the product.   PS did you bother to do a per unit price comparison? or just buy what you THOUGHT was cheaper?\n\nAnd your response for not even following directions(What would you say to a student who didn't follow directions?) was to call her a nasty name.  Yes you are the AH.\n\nPS you didn't buy what she wanted.", "What about \"the specific brands she wanted\" did you not understand? I'm so confused how you can look at a grocery list where everything is specified up to and including the very brand name you need to get, for obviously good reasons, only to then go \"nah I'll disregard that completely because obviously with me doing the groceries for the first time I must surely know better than her!\" \n\nAnd instead of buying different brands that you think (or know) is better or w/e you chose to go for the CHEAPEST?! without even looking? Dude, use your noodle! You can read, can you? What, you couldn't save such an (ridiculous) argument for *after* you get home so she can tell you *why* she needs those specific brands? And negotiate if you disagree?\n\nYTA dude, wtf. You're so out of touch with what the household needs, you need her to write you a grocery list (cringe) and then you couldn't even manage buying what it says on that list?! It's so odd! Was it a power trip?", "Well at least when someone asks why you’re not together anymore it will be a really quick and short story. \n\nYTcheapA", "YTA for disrespecting your wife instead of having a rational adult conversation about budgets and where you each are and are not comfortable cutting corners", "YTA. And I feel for your students. I can't imagine what they have to deal with. And I can't believe you have no brand preferences yourself.\n\nI enjoy a Guinness Draft.  If I ordered a Guinness and you brought me a Bud Light,  you'd be wearing a Bud Light.  \n\nYour wife asked you to do her a favor to lighten her burden.  Instead, you acted disrespectful and condescending. And now she has to deal with the shit you bought instead of what she needed.", "Yes, YTA, for buying the store brand version of groceries.\n\nI love walmart cause it's very affordable. However, half of great value items are trash, and I would genuinely rather throw them away than consume them. Kids can be very picky and notice if you give them something that tastes off. You should have communicated that you would like to try the store brand rather than waste money on a product that may not get used/consumed. You potentially threw money in the trash, and as you said, yall are on a tight budget.", "YTA. You both are teachers? lol there's no way.", "YTA. And it also sounds like you’re resentful that her husband ex makes more money than you do. Grow up", "YTA\n\nYou get in trouble and you start calling her nasty names?  She's right to tell you to go look for an apartment.  Looks like you just learned how to fuck up a marriage in 8 months by going to the grocery store.", "YTA. \n\nThis is apparently your first time shopping for a family of 5 in an 8 month long marriage? WTF.\n\nSecondly for not getting her what she asked for. You made substitutions. That didn't work for her. \n\nFinally you called her a nasty name. \n\nGrow up.", "YTA\n\nBuying the wrong stuff is weaponized incompetence on top of verbal abuse. I'm glad she's giving you the boot.", "YTA. Shopping for another person is difficult. But Jeez, kids, work it out. Make time to go over the list ahead of time, and respect that she needs a specific product. Of course compromise when something cheaper can be substituted at no loss of routine/ function. But you two have to work this out.", "Schampoo. Buyca cheap one that's mostly water andcthe rest agitates your hair so it is dey, fizzy and full of knots.\n\nBut hey, you saved money?? Or did you?\n\nSaffron. Cheap yellow tasteless powder or something that actually has a smell and a taste?", "YTA\nFirstly because you called you wife a nasty name because you are ashamed you don't make as m7ch money as her ex.  And secondly because you are incapable of following simple directions to so the shopping PROPERLY.", "YTA\n\nHonestly, it's not about the grocery brand issue that you lead off with here. It's your inability to handle the disagreement like an adult. If she said to go look for an apartment, either this is just the latest in a string of such incidents, or you used a VERY nasty name.\n\nYou're not going to make it to your first anniversary if the two of you don't learn to communicate with each other like grownups.\n\nConcerned about grocery spending? HAVE A CONVERSATION about budgets, meal planning etc (where you need to be an equal participant). \n\nThen find a compromise. Your wife is right that generic brands are not always good substitutes. Sometimes they're fine (store brand dairy is typically just as good as the expensive stuff), and sometimes they very very much are not (pasta sauce).", "YTA - You could have reviewed the list and called out some items which you felt didn't need to be the specific brand before you went and that would have resolved it. If money really is that tight then maybe find the compromise of what she really needs to be that specific brand and what isn't such a big deal.\n\nLike, imagine writing Heinz beans and someone brings home unknown branded beans. I'd be livid...", "YTA.\n\n>She gave me a long grocery list and I bought what she wanted\n\nNo, you didn't. When one takes the time to *specify* brand, it's important to learn *why*, not assume it doesn't matter. Ingredients can be different between brands, and that changes taste and can matter for allergies. It matters. \n\nBut the big part;\n\n>. I called her a nasty name and she told me I need to go look for an apartment\n\nA nasty name?.. If you can't even repeat it, you were wrong, point blank. And the fact that 2 grown adult *teachers* couldn't diffuse this before one of them devolved to schoolyard antics is rather sad.\n\nEdit for typo", "Just to add my two cents: I am neurodivergent and some things HAVE to be brand specific because the \"dupe\" doesn't taste the same at all. For example, I will only buy DiGiorno pizza because it's the only one I like. I've tried a bunch and they're just.. off lol. Anyway, my point here is that there should be a conversation about why she's brand specific before just assuming she's being extra.", "YTA, for the way you handled things and for  calling her a nasty name. It's not always about the money - some name brands are just better - delends on the product. Kids are picky. There may be only one brand of ketchup that they will eat. You need to learn to communicate better.", "So she apparently does all the grocery shopping except this one time.  Hmmmm.  And you never noticed her food budget was a problem until the  one time she asked you to go shopping.  Bet you were successful in teaching her to never ask you to do that task again.\n\nYour wife is a teacher too.  What her previous husband did for a living probably didn’t turn her into a spendthrift or you would have noticed it before a grocery run. And she earns a living same as you so she gets to make decisions about what brand she prefers.\n\nBTW, what part of household responsibilities do you routinely handle?  If the car breaks down. I assume you repair it to save money, right. If there is a roof leak, i assume you fix it yourself, right?  Do you have tools and supplies for your end of household maintenance. If so, would you be okay asking her to pick up something in that line for you; a brand or type you specifically relief on?  If so. Would it be okay for her to just get the cheapest thing?", "YTA. Name calling really?", "Okay it seems like I might be one of the few guys commenting. But yeah YTA. as stated by someone else, you’ve been married for 8 months and She’s been doing the groceries, therefore you CAN afford them. \n\nAlso someone else stated too. No name brands are only good in certain situations. Chips? It’s a pass. Toilet paper? Nawh. I feel like you’ve never learned about how to take care of your self or anything. \n\nYou also escalated the situation over brands…..", "YTA I don't even need to know what you called her to know it was a bitchy thing to do", "ETA- you both need to sit down, develop a budget and find ways to stick to the budget.  Perhaps she wants her name brand groceries but will do box dye at home.  Maybe you want to have beers with the boys once a week and will pack a lunch everyday...  It's called compromise.  Was this the first time you have ever gone grocery shopping? She didn't need to get \"really upset\" and you shouldn't have said nasty names.   It's best to \"never attribute to malice what can be explained by stupidity (or lack of clear communication)", "YTA, shopping down a brand is fine if you’ve agreed on it but there are some untouchables. You never asked so don’t know what your wife’s are.\nMines a particular soup, any others knock yourself out but that one…. If it’s not Heinz it’s going in the bin so not saving money.\nAs for the argument…. Even bigger AH. I’d suggest flowers and a heartfelt apology. After buying the flowers bet you’ve not made a saving", "YTA", "YTA......but don't worry, you'll quickly learn how to grocery shop on your own soon......", "YTA, for thinking she's ridiculous and calling her names over the smallest issue. \"Sorry, I didn't realize it was a big deal. I dont feel comfortable spending that much, though. We should talk about a fair way to split finances.\"", "You went grocery shopping “for your wife.” Is your wife the only one eating these groceries? Or have you been happy to assign the shopping to her and pretend this isn’t a task that takes time and energy and benefits *you*? YTA. I think you were annoyed to be asked to do this essential labor for your family and decided to mess it up to punish your wife and ensure she doesn’t task you with this again.", "> I (35M) was asked to go some major grocery shopping for my wife (36F).\n\nKeyword \"FOR\" YTA", "Pro tip: When she names the specific brands, buy the specific brands.", "YTA Why didn't you consult with your wife before substituting your judgement for hers? It's okay to have preferred brands. Sometimes generic is just as good, other times it's not. When she didn't like what you did, you called her a nasty name. That was really mature of you - you who want to impart knowledge and life skills on children.", "YTA\n\nI have specific allergies/sensitivities. It is hard to find things that I can eat. If I specifically ask for a specific thing, it means that that is the only thing I can eat.\n\nFor example, I love sushi. Do you know how hard it is to find sushi without sesame and with (almost) no soy?", "INFO— what were the things? That’s key. Pads, tampons, toilet paper, paper towels etc. I completely get wanting specific brands. \n\nA specific brand of organic beans? I can see not spending 2 extra bucks for that. However, you cannot say you bought her what she wanted. You didn’t. Also, really? Calling your wife a nasty name over a fucking grocery bill? YTA for that alone.", "YTA for both not buying what she asked and for calling her a nasty name…this shouldn’t have escalated. Bet an apartment costs more than brandy groceries…", "Sorry dude…She’s got champagne-taste on a beer-budget. And You’re not the saltiest peanut in the bag.\n\nEdit: Spelling", "I’m going to assume you already established a grocery budget when you moved in together based on your new salaries/child support and not the exs income. That means she likely has done the budgeting to make it work, which is why it’s been fine for 8 months. Now if you truly didn’t realize there was an importance between brands then it would just be a mistake and it would be fine. But since you brought up her ex and called her a name over something seemingly so small-either you left something major out (like a kids allergy) or you’re just TA. \n\nA lot of time goes into a grocery list, something probably not realized by the person who doesn’t typically do it, so I’ll give you the benefit of doubt. I have a tight grocery budget and I make it work. I shop sales and store brands where I can. But some items the brand name is better and it’s almost a waste of money to get the store brand. I cook and there can be a massive difference in brands. Throw in food allergies,  skin sensitivities, picky eaters, etc and there’s probably a reason why the brands are there and ignoring it is not only annoying, it can be a slap in the face. Which again would be a minor fight-unless we’re missing more context.", "A person also may choose certain brands to support certain practices of the company/avoid bad practices by other companies (e.g. labour practices, sustainable production) or to support a company run by a marginalized group.", "All of this.", "I work at a highschool, don't go to a teacher for problem solving", "My wife is very particular about the brands she uses because of the marked difference in quality and taste.  My father used to do the OP substitute for cheap and we had to stop letting him shop when he was visiting.  Sometimes cheap is just cheap. Plus, ignoring a direct request from your partner is a dick move either way.  If the positions had been reversed you would have been pissed off too. YTA.", "I had instacart for a year and could get deliveries from Aldis--so I tried out a LOT of different brands for stuff I regularly Got.  Yeah, most of them were big NOs for me.  Tho I loved getting unusual stuff not in regular stores.", "Cheap detergent can make a lot of people itch! I'm actually allergic to an ingredient in cheaper detergents, I forget what it is called, but it is sooo common to be allergic to some ingredient in lotions or skincare or laundry detergent. Even without children, people definitely know what brands they need!", "And some off brand things just suck. Others are great. But off brand baking powder has hard lumps, off brand shortening is hard instead of smooth, and off brand Ritz crackers taste like sadness. The wrong brand of lotion will give me a wicked attack of eczema and my kids will not eat the wrong brand of yogurt.", "Misunderstanding?\n\nHe chose to buy the cheapest.", "Maybe she should have specified that on the list if it was so important", "And sometimes it’s not even taste preference. People can have allergies to minor ingredients or skin sensitivities with soaps. I don’t have kids but I cook a lot and for some items it doesn’t matter but sometimes the brand name make a huge difference.", "If list soecifies and you want to replace it- call.\n\nUnless you are cheap and don't want to being hindered.", "Both?", "Likely Wife does all(/most) of the cooking too.", "it's GIGO, i think, in principle.", "He had a choice , nobody forced him to marry a single mum", "It’s funny cause you were the one being a bitch. YTA. Also, for a teacher you sound exceptionally dumb. Good luck trying to fix this. 8 months? I’m at 21 years of marriage and have never been called a bitch by my husband. Of course, he isn’t a dolt.", "How was that conducive to conflict resolution?\n\nPoor form.", "Have fun with the divorce if you can’t compromise and a brand from a grocery store and resort to calling her a bitch because you can’t follow written instructions.", "ESPECIALLY in regards to  what they eat and put on their bodies!", "Or just suck it up and use the cheaper stuff. In my experience Most cheaper things are fine in recipes.", "The kids are part of \"the household\". Yeah, even though they're not his kids.", "If I had an award, I would give you one!\n🏆🏅", " Yes, he needs to empty out HIS WALLET, for her kids. Okay. \n\n Get the divorce quick. See how well ONE teachers salary and child support works out.", "But also, I'm curious now how often he's been in the kitchen, let alone grocery shopping, for a shared family home of two adults that work and three kids for however long that he 1) needs to be asked, 2) doesn't know what brands are used, 3) doesn't know the cost of what they buy, and 4) decides unilaterally to upend the list (assuming one has..a phone??).", "Yes but it could have been a misunderstanding about if that mattered or not. I mean she took the time to write it out so you can probably assume that it does and you could say soft AH. But getting pissed and defensive about it and calling names really elevates it.", "There was an AITA awhile back where the wife actually did images of the product to buy.  LOL", "One time Kroger made a substitution without asking me. No, vanilla almond milk will NOT work as a substitute for unsweetened because I was going to make a savory recipe with this!", "Not following basic instructions *is* incompetence", "Of course she does, and he does nothing (hence the \"major\" in \"major shopping\"). If he did any of the cooking or grocery shopping, he'd KNOW why he needed to stick to the specified brands.", "Exactly. Which is why OP shouldn’t have randomly substituted stuff, because he doesn’t know what will make a difference for his wife.", "“Most” being the operative word. We don’t know what exactly he bought. Some stuff, like baby formula, would be a really bad idea to randomly switch. And a lot of people have skin problems from certain laundry detergents, so that would be another one she would have to go buy the right one of.", "Yes, exactly this. Cardboard.", "Dish soap is my hill to die on.  It's Dawn, and *only* Dawn, or the dishes don't get washed. Nothing cuts through grease and oil better, and nothing works better with our hard water.", "Except it came from the wife’s list which means that it’s been budgeted for. And it doesn’t state if there was a reason the brand name items were on the list", "🤣🤣🤣The best solution. I just do that occasionally when it’s a new product he’s not used to.\nAt least my SO follow directions so I don’t complain. 😜", "I use off brand laundry detergent. I can afford the name brands now but I got used to using off brands earlier in life and it just feels like a waste of money now to buy the brands.", "dawn powerwash. i love that stupid bottle.\n\nit annoys me so freaking much.", "Same goes for pet food.", "Any food allergies are a problem too.  I am very brand loyal at the store because I buy the ones I have checked are safe.", "I was thinking kids age 2-5 or so might not eat certain foods - Velveeta mac and cheese is not the same as store brand. Kids can be super picky about things like that and it’s 1000x easier to spend $.75 more and buy things you know they’ll eat. I can imagine being an exhausted mom seeing food my kids won’t eat and being very upset.", "Lol!  I hear you.", "OMG I saved one of the power wash bottles just for diluted dawn that I spray on pans while they soak. That freaking bottle man", ">grocery shopping for my wife \n\nThis guy doesn’t eat, apparently", "I hope she already initiated diviorce. \n\nYTA", "So sad that there are people abusive like OP in a teacher's position. Poor children.", "The fact that she had to write the brands down tells me how often you do the shopping…\n\nYTA. You knew as you were buying it that it was not what she wanted. And knew she’d probably be upset. When she was, you called her a name.", "YTA ….broooo you messed up and then you called her bitch on top of it. Do you want to be married longer than 8 months?", "My EX husband used to occasionally buy a different brand than the one I liked - hot chocolate, washing up liquid whatever - and swap them into the brand containers. He of course knew best and didn't believe that I actually could differentiate or that I had solid reasons for my choices. OP I doubt that your stbx wife is a moron - why treat her that way? YTA", "Is your household income based on only two teachers salaries or did you leave out child support from the business man? Bringing up her ex’s income makes me think you’re insecure about the money you’re bringing to the table. She’s married to you not him; get over it.", "YTA. Foremost because you called her a 'nasty name' over a disagreement on brands. \n\nDid you even stop to ask why she put specific brands on the item? No, you didn't. You didn't get the right items so you wouldn't have to grocery shop in the future. \n\nHer OR her children may require certain brands due to sensory issues. \n\nFor me, there is only ONE brand of orange juice that doesn't make my stomach upset. If my partner got the wrong one, it's a waste of money since I'm the only one who drinks orange juice and I wouldn't be able to drink it.", "YTA for sure, when my wife said I got the wrong toilet paper brand I felt bad, because she did tell me before but the other one was on sale, I certainly didn't call her a nasty name and escalate it. What the hell is wrong with you?", "NTA, if she’s that fussy about brands she can do the shopping herself. It’s all the same shit.", "ESH. Her for not listing the brands, you for calling her a nasty name.", "I am going to hold off judgement because idk what their expense’s actually are. \nI will say i understand where OP is coming from. When it comes to shopping for groceries (which can be expensive) it is better to go with what’s on sale and what’s inexpensive. Because here is the thing a few items can really add up, and if ops wife is use to a higher standard of living because of her EX than she needs to learn to look for what’s on sale because money might get tight and what she wants might be too much.", "I see Reddit is doing it's usual thing of just jumping down guy's throats. Stay classy, Reddit.  \n\n\nThat said... this reads like a whole lot of missing context. Given that, and how you're singling out a single brushstroke on the painting of your marriage for judgement is a bit... concerning. I don't know how we can judge this without knowing the general financial stability of your home, how income and expenses (and housework/workplace workload is broken down), etc.   \n\n\nIf you both are on such different pages about money, well you probably need to start with financial counselling and possibly couple's counseling as you two don't seem to disagree well. I say financial first because it feels like you need to get on the same page there before anything; it IS one of the leading causes of divorce after all.   \n\n\nAnd don't resort to name calling if you don't want to escalate. You're the AH for that, be better if you want to stay married.", "She has 3 prior kids? Ya, maybe divorcing would be in your best interest. Let the gal work her way into debt. Yes you bought the generic brand but your intentions were good considering the teacher’s salaries and 3 kids. The only one with brains in the family. Filter no, brains yes. Should still apologize though.", "Nta Depending on what they was. But if you can't afford the brands, then cheap it is. \n\nI buy cheap now that things are different, accept my mac-n-cheese. Lol\n\nThe budgets are different, so can't always buy the brand names. She may still try to act spoiled. Need to sit and chat about it.", "There's so much missing from this... 3 kids and no child support from the ex husband? \n\nFor the name calling alone you're the asshole.", "Nta.. I. some cases store brands are much better than xyz brand. You dw sounds rather entitled.. if you are not saving where you can nowadays then you must have big pockets  The comment about you getting an apartment shows she is not invested in your relationship at all. take her advice and dump her..she sounds expensive..", "Nta. She needs to realize that lifestyle is over.", "YTA you sound like when men who don't bother doing any of the mental load for their relationship finally plan a date, and it's 100% things THEY want to do with no consideration for their partner and they're like I MADE AN EFFORT WHAT DO YOU WANT FROM ME WAAAHHHH \n\nYou didn't make an effort to plan a date night. You made an effort to plan a day out you'd enjoy because the idea of going on a date with your partner for some reason sounds like a chore to you.", "What is wrong with you? You've been married for 8 months and think personal insults are appropriate when discussing grocery shopping?\n\nThere are like 100 great ways to approach discussing budgeting for food and groceries, do you both have an idea as to how much you can afford?\n\nWhy are you like this? Have you not learned to communicate like an adult yet? Do you not try and understand where the other person may be coming from?\n\nMarriage is about working things out together. Why wouldn't you just buy the items and then talk about how you can cut down afterwards? Or is it only your wife that needs to carefully watch her spending?\n\nI hope you have the cheapest cell phone, the cheapest computer, the cheapest clothes, and the cheapest toys.\n\nYTA, big time.", "Here there are many brands of Gouda cheese. I've tried them all and there's only one I like which is priced somewhat in the middle compared to the other brands. If my fiance went and got a different brand I wouldn't be able to eat it. He is however very considerate and wouldn't do that, because our grocery list is varied from cheap brands to mid priced stuff. If we bought only cheap stuff we'd probably save some money but to us it's worth it to spend just a little more on certain things we like.\n\nYTA", "YTA.\n\n\"I'm sorry, I didn't realize it meant that much to you.\" Is how you handle that problem.\n\nIf you're really worried about cost, have a respectful conversation with her about budgeting.\n\nBut being defensive and calling her a nasty name? You did not need to escalate the situation like that. YTA for how you responded.", "YTA. You didn’t fail to guess the right brand, you deliberately didn’t follow the list. Chat to her about your collective spending if that’s an issue, don’t just deliberately refuse to do what you’ve been asked.", "YTA op. For everything others tell you with calling your wife a name, but also\n1) you are clearly jealous of the her ex. Does he contribute money for his kids? If yes does your wife use it to but the food YOU also eat? If yes, double ah for not buying what she wanted. \n2) Do you ever cook? Two brand are not the same. My mom and me wanted to make some dessert, we bought mascarpone cheese and out of 4 of them only one was good for this. Other ones were just trash. Sometimes brand do matter. It’s the same for bread, flour even eggs. YTA. Not sure why you two are even together if such a small disagreement escalates to name calling so fast", "Yes YTA. In most cases brands MATTER. For SOME things it’s the “same” but honestly brand name grocery items are better & esp children are used to the same flavors consistencies etc. It didn’t end there when you’re making her have to redo all the shopping now…you called her names . I’m assuming here but she likely sent you to the store so she could have something off her back …and instead you added things to it . Are you pulling your weight around the house with housework ? Bc you don’t get told to get an apartment over one instance…I hope you didn’t “buy the cheap stuff” on purpose so she never sent you again bc that’s weaponized incompetence…", "YTA- what is “major” grocery shopping?? I have never described an errand as major. Also, you haven’t told us what you called her, but it was bad enough for her to kick you out.\n\nReal r/AmITheEx vibes here", "YTA\n\nIs this how you model conflict resolution in the classroom?  Yikes.", "YTA You called her a nasty name because she was upset? You should have asked her why she wanted those particular brands and if substitutions were ok. It would probably have better not to buy anything than to waste money on cheaper items she won't use. There are often big differences in quality, taste, and ingredients.", "YTA and a trifecta: weaponized incompetence, verbal abuse, and cheap.", "YTA, and on top of it calling her a \"nasty name\" as you put it is wrong as well. Not all brands have the same ingredients and the cheaper options aren't always worth the price difference. Especially when a lot of cheaper alternatives are filled with nasty ingredients. Now she knows she can't trust you to even go fkn shopping on your own. She also has kids, who I'm sure she wants to make sure aren't eating garbage ingredients. Also comparing your income to her ex's means not shit.", "NTA for being budget conscious, but massively ah for how you \"addressed it\", for the jab at the ex, and for calling her a nasty name.    \n\nWtf, dude? Why did you go low instead of have a productive conversation?", "Definitely the asshole, for escalation reasons solely.", "Yta, if she specified brand on the list she didn’t want substitutions.", "YTA. All the way, especially for acting like a child", "You unfortunately signed over all your independence when you married a women that already had children and a rich(we) dad. Unfortunately you will never live up to her expectations of what she once had financially. Women never decrease their lifestyle, they only increase it. You will never have the respect you deserve as man of that household with her or the children, you made a bad choice marrying damaged goods. Idk maybe you were desperate, but I am sorry that you will never be able to make important decisions for your family. You are now neutered effectively, so get used to this kind of treatment. NTA for everything except calling her a name, although this is the beginning of feeling stuck.", "It’s terrifying such dumb and immature people are teaching children.", "Left up to me, I buy the cheapest of everything. There are some things that I have learned that my SO prefers name brand, so I make sure to buy them. Have never called him names or picked fights for literally anything, let alone over a few dollars here and there that could be saved on generic products. YTA. I don’t think she is kicking you to the curb over this single incident, but if she is, she is also an AH.", "YTA. You called her names, and you never asked her beforehand why those brands specifically.", "YTA - You should accept that some name brand products are better than generics (quality/taste/effectiveness), and your wife needs to acknowledge that sometimes the generic is no different. If you had acknowledged her feedback on your purchases and then moved on to \"I am just trying to save some money, so for which products are the name brands worth the extra money ?\" Then compromise on a list of products where the name brand is justified and those where it is not.", "Look. Somethings aren’t worth fighting over. She sucks your little pee-pee. She deserves Heinz ketchup!", "ESH. You for blowing up on her, her for trying to live well outside your means.", "Bring me Diet Pepsi instead of Coke Zero and see WTF happens. YTA", "Shopping a side it must have been one hell of a nasty word for her to tell you to pack up and move out. For the alone I’m going with YTAH.", "Yep. YTA.  \nAs others have said. sometimes name brand makes a difference, sometimes it doesn't.  \nIn her case it did, instead of apologizing, you called her names.  \nIf you asked her to get your favorite brand of beer, but she bought something completely different, because it was cheaper, would you be happy? Of course not. You would probably call her names again.  \nAlthough, if she asked you to find an apartment, I suspect divorce is in your future.", "Y sorta TAH. Depends on the brand and the product- so I'll withhold judgment on that part. YTA though for letting it devolve that far though and calling names like a child.", "YTA. Not all brands are equal, plain flour substitute would be fine imo but my daughter is allergic to SOME sweet and sour sauce brands and not others so if I specify a brand there it’s for a reason. Cheap creamed corn and chicken stock ruins my favourite soup but cheap beef stock tastes better than the expensive one. If you want to save money sit down with her and question why she wants a particular brand, try buying extra of those on sale so you don’t have to buy them full price etc.", "YTA. If my husband came home with generic tampons with a cardboard application device I would not be ok", "YTA. If she has been buying them also before this one time you did the shopping then it is fine likely financially. As for brand preference - it is okay to have some. Heck, for some things I rather visit several stores than buy some other brand than the one I like. And the fact you went for nasty words… damn.", "YTA. Some off brand stuff is gross! Now you get to eat the slop you bought, I hope it tastes awful.  Also,  please go shopping again and do it right next time. Don't turn this into a  weaponized incompetence thing. \"Well, I went shopping once, but did it wrong so I don't do that anymore \"", "YTA calling your wife names when you’re angry is not going to keep you married for long.", "YTA wow. Try not to take it out on your students like my divorcing teachers would do.", "Because it's HIS money that was being spent, not hers.", "As a instacart shopper, people would rather not have the food than have the wrong brand sometimes.", "i hope the money OP saved on the name brand stuff is worth all the extra money he’ll have to pay in rent at his new apartment.", "This 🏅🏅🏅", "Great point. Two teachers salaries, and assumed 1 teachers salary prior to this for at least a little while after separation/divorce. He's playing her off to be a gold digger of sorts when they've been managing just fine until now.", "Glares at generic poptarts.", "A teacher with three children she can't afford is a millstone around anyone's neck.", "If the wife is so particular she can do the shopping.\n\nOtherwise she gets what the OP buys.\n\nWhen hubby shops he buys the brands and types of things he wants.\n\nWhen the wife shops she buys what she likes.\n\nAs long as the shopping gets done is all that matters.", "Haha right? Where was that delicacy and restraint earlier, champ?", "Store brand dish soap can never compare to Dawn Dish soap. Mr Clean magic eraser is better than other brands.\nCampbell's cream of soups are better than store brand as well.\n\nMy older sister tries to go cheaper with store brand so my family has tested stuff and some things you NEED big name brand. There's a reason they got so popular in the first place.", "My 8th graders had a unit on The Pearl. I gave them some choices for a project  for a major grade, one of which was a five panel cartoon illustrating a scene from the novel. A kid who was a real troublemaker in class surprised me with a beautifully done cartoon, the final image was a hand holding up the pearl in the moonlight. Simple, evocative, gorgeous.", "Me too!!!", "I hate how much I love them. I never used to be \"I have to use dawn.\" I like it but I wasn't crazy brand specific.\n\nNow at all times, I have replacement bottles on hand.\n\nI don't understand why it works so freaking well. It should possibly be illegal.\n\nI'm just saying.", "Presumably, but this is why they need to talk. Because even if they can afford it, he thinks they’re a waste of money while she appears to think they’re worth it. Once he knows why, some of those differences might be mitigated.", "It works because it’s Dawn (which really is the bomb dot com of dish soap) and additional surfactants that make it cling to the organic matter on the dishes. In a sprayer optimized for product distribution. \n\nNot that you asked, lol. I just think it’s a really cool bit of product improvement and engineering.", "I'm just going to keep saying it's magic.\n\nthough I admit they used the same bottle- and sprayer- design for Mr Clean CleanFreak and that is also amazing.\n\nI should clearly buy stock in that company given how much I love those two products."]}