{"id": 25835, "submission_id": "165425q", "title": "AITA for calling my boyfriend a lying POS for not buying me the perfume I wanted for my birthday", "selftext": "I (21f) am really into beauty (makeup, skincare, perfumes, etc) and collect perfumes. There’s one perfume I’ve been wanting for quite some time now but it’s been way out of my budget. I’m a college student working a part time job at the movie theater which pays about 13 bucks an hour and I have other priorities to pay for so it’s taken a while for me to save up. \n\nI’d finally saved up the amount I needed and was planning on buying myself the perfume as a birthday gift (my bday was 2 days ago). I told my boyfriend (20m) this and he told me to go spend my money on something else and he’d buy me the perfume instead. I told him he didn’t have to considering it’s expensive but he insisted. A few days before my birthday I asked him if he was sure about buying it and told him again that I had no problem buying it myself. He told me not to worry about it and said he’d already bought and wrapped it. I thanked him and figured since he’d already bought it that I could spend my money on something else. \n\nI took my best friend and my younger sister out to a nice restaurant and to the movies after. I wasted more than half the money I’d saved up but obviously didn’t think anything of it. So on my birthday my boyfriend gave my gift and it was a body spray and bath bomb. I asked him what happened to the perfume and he told me it was a lot more expensive than he’d expected and way out of his budget. I got mad at him and asked him why he lied to me and told me to waste my money on something else when he could have easily told me he couldn’t afford it and I’d have bought it myself. He called me a spoiled brat and said I was expecting too much from him. I called him a piece of lying shit and left after that. I got a few texts from him and his friends calling me names and saying I’m using him for money (??). I also got a text from his mom, who I had a great relationship with, calling me childish for throwing temper tantrums when I don’t get my way. I honestly don’t see how I’m in the wrong here but I’m not the type of person to not say sorry if I am. So aita?", "created_utc": 1693367618, "permalink": "/r/AmItheAsshole/comments/165425q/aita_for_calling_my_boyfriend_a_lying_pos_for_not/", "score": 1472, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for calling my boyfriend a lying piece of shit after he didn’t get me the perfume I wanted for my birthday?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - he lied to you and promised something and then didn't follow through. You gave him multiple chances to change his mind, he promised you it was \"already wrapped\" and got your hopes up, caused you to spend the money you had intentionally saved up for this item, and then acted like it was your fault you were disappointed and upset. \n\nAlso the way he responded to all of this? Leave him.", "NTA. Your bf deliberately lied to you, promising you something you had wanted and could more than afford for yourself, and then was surprised when you reacted poorly. \n\nHonestly? This would be grounds to break up; if he lied about a gift, imagine what other, more serious things he could lie about.", "NTA\n\nHe said he would get you what you wanted and then substituted something else.  And you're the spoiled brat?\n\nDump him.\n\nSave the money again & buy yourself some for Christmas.\n\nBelated Happy Birthday!\n\nHugs and Good Luck", "NTA your boyfriend should be your ex boyfriend.", "NTA\n\nAnd please, please, don't stay with someone who thinks it's okay to sic his friends and his mother on you. That's the most childish nonsense ever. Plus, I'm guessing the names his friends used were probably highly misogynistic, they pretty much always are in these scenarios. He did that. Your BF, the person who should love and protect you, intentionally set you up for that. \n\nYou deserve better, all around.", "NTA at all. But pls tell us which perfume you wanted.", "NTA.\n\nHe lied to you. Repeatedly. For no reason - at any point in all your checking, he could have said “Okay, you buy it, I’ll get you something else.”\n\nAnd he’s clearly not told his friends and mother he offered to buy you a specific item you were going to buy yourself, just mentioned you were ‘ungrateful’ about what he did get. Send them all a link to this post then move on with your life.", "NTA\n\nI was a little but ehhh at the headline.\n\nIf I'm reading this right, you're not as upset that he didn't buy the perfume as you are that he REPEATEDLY lied about it, refused to acknowledge the lie/s, and had his friends try to harass and join the gaslighting\n\nHe has just taken. A microphone/megaphone and told you who he really is. \n\nI guarantee you can do and deserve better. Even if it's being single and spending more time with your sister and bestie.\n\n(Edit to add word i really meant)", "NTA - he lied to you", "NTA He lied and didn’t keep a promise then went crying to his friends and mommy like a baby.", "NTA. \nYou explicitly told him what you wanted and that you’re willing to cover on your own (independent queen 👸🏻)… he told you he’d get it then fell short. \n\nSorry my dude, can’t get upset when you fall short of the expectations YOU set.", "Girl. I just knew I was going to be rolling my eyes the entire time I was reading. \n\nI don’t say this often, but get rid of him. You gave him every chance to come clean. He chose to lie, and clearly waited until the last minute to buy your gift. \n\nHappy 21st. Enjoy. NTA", "NTA\n\nYou need a new boyfriend, one who respects you. \n\nBecause this one obviously does not.", "Uhm, your 'ex'-boyfriend, right? RIGHT!!? NTA", "NTA\n\nYou were literally going to buy it for yourself. HE chose to say he was buying jt for you. HE chose to lie and say he had bought it already. \n\nUnless you’re leaving something out of the story, you didn’t demand or ask him to get you anything at all. Your plan was to purchase it for yourself as a birthday present.", "Nta", "NTA. You were planning to buy it yourself, and he insisted multiple times that he got it. He straight up lied to you to save his own ego. That's childish, as everyone else is saying. On top of that, he got mad at you for being upset that he lied, gaslighting, then threw you to the wolves, his friends and family.\n\nThis man is not worth your time or energy. Leave him and find someone whose actions follow their words. This will never change or get better and will most likely be something worse down the line than perfume.   \n\n\nYou deseerve better", "YTA for calling bim your boyfriend when you should be saying ex-boyfriend.\n\nBut for real NTA, you gave him so many ways out, explained it was expensive, and he prrlobably waited until the night before and realized he couldn't buy it at a Walmart for $10 and panicked. Also knowing that instead of trying to work it out he immediately resorted to insults and telling all of his friends and his mommy on you? \n\nRun\nRun fast and far", "I mean it was kinda of bratty but I can see where you are coming from. And He went and told his mom and friend that you bitched about not getting something expensive for your birthday. I guarantee he didn’t give the whole story about him telling you not to buy it and spend your money elsewhere and that he would get it. \n\nAlso I find it really strange that he knew he couldn’t afford it but didn’t want you to get it for yourself either. I mean that is so weird I can’t even think of a logical explanation as to why he did that.", "Esh your reaction of calling him names was an ah move. Be an adult and have an adult conversation. He’s an ah, not because he didn’t get you the perfume but because he lied and said he already had it.", "ESH\n\nHe sucks for lying, you suck for your over the top reaction, his friends and family suck for getting involved in something that is none of their business.\n\nAll this over perfume...", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (21f) am really into beauty (makeup, skincare, perfumes, etc) and collect perfumes. There’s one perfume I’ve been wanting for quite some time now but it’s been way out of my budget. I’m a college student working a part time job at the movie theater which pays about 13 bucks an hour and I have other priorities to pay for so it’s taken a while for me to save up. I’d finally saved up the amount I needed and was planning on buying myself the perfume as a birthday gift (my bday was 2 days ago). I told my boyfriend (20m) this and he told me to go spend my money on something else and he’d buy me the perfume instead. I told him he didn’t have to considering it’s expensive but he insisted. A few days before my birthday I asked him if he was sure about buying it and told him again that I had no problem buying it myself. He told me not to worry about it and said he’d already bought and wrapped it. I thanked him and figured since he’d already bought it that I could spend my money on something else. I took my best friend and my younger sister out to a nice restaurant and to the movies after. I wasted more than half the money I’d saved up but obviously didn’t think anything of it. So on my birthday my boyfriend gave my gift and it was a body spray and bath bomb. I asked him what happened to the perfume and he told me it was a lot more expensive than he’d expected and way out of his budget. I got mad at him and asked him why he lied to me and told me to waste my money on something else when he could have easily told me he couldn’t afford it and I’d have bought it myself. He called me a spoiled brat and said I was expecting too much from him. I called him a piece of lying shit and left after that. I got a few texts from him and his friends calling me names and saying I’m using him for money (??). I also got a text from his mom, who I had a great relationship with, calling me childish for throwing temper tantrums when I don’t get my way. I honestly don’t see how I’m in the wrong here but I’m not the type of person to not say sorry if I am. So aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH.   \nHe didn't realize exactly what he was getting into with the perfume, and I'm guessing you didn't tell him. He should have looked into the price before telling you anything.    \n You for getting mad at a gift. It's a *gift*.", "NTA\n\nHow the hell did he think you were going to react when you found out he lied to you.\n\nIf he lied about this he has lied to your friends\n\nDo you really what this AH in your life, what else is he prepared to lie about?", "YTA. Stop trying to live beyond your means.", "Yeah, I’m considering doing that. Its not even the perfume I’m mad about. It’s the fact that he lied and then got his friends to gang up on me.", "He sounds terrible. His friends and mom are also attacking you? How immature of all of them. He lied to your face. That's not okay. You're justified to be upset.", "Worse than that. He said he’d get it, didn’t get, substituted it, then said he had gotten and wrapped it.", "It is the Baccarat Rouge 540 extrait (red bottle)!", "Yeah! Sorry, I could def have worded the title better😭 and I am thinking of dumping him", "Thank u!💕💕 I’m thinking about ending things and just moving on", "He wants to be SEEN as generous and helpful but he doesnt actually care about being those things.", "Honey, stop considering it. He's your boyfriend, and I get that, but he lied to you and then lied to other people about you. Break it off, and find someone else to be with that won't lie to you and manipulate other people into thinking you're a bad person.", "I get that he probably thought it was cheaper when he first made the offer, but as soon as he found out the real price he should have told you it was out of his budget. \n\nHell, anyone with any amount of sense would have seen how wrong it was to lead you on.\n\nTo be honest, it sounds more like he decided *for you* that it was too expensive and you should be spending your money other ways. Not just that it was too expensive for him.\n\nNTA.", "I agree. you aren’t teenagers. Why are his friends calling you and getting involved in your private business?", "TY", " Its an attention grabber in the way that is not necessarily a bad thing  :)\n\nAs the song says, breaking up is hard to do and from the sound of it, you may have to deal with his minions, so keep your circle close.", "But being seen as generous doesn’t really fit either cuz then he would’ve gotten the perfume right? Unless he didn’t expect her reaction? I mean what did he expect when he got her a different gift then what he said he already got her…. And said he wrapped it? I have no idea it’s just bizarre", "NTA. I was actually prepared to think otherwise.  But it’s actually not about the perfume.  \n\nYou were willing to get it for yourself.  Hell, you even checked in again to make sure he was still good to buy it for you…and he lied about having bought it already.  So you did what he suggested and you splurged a little.  Then he sent his flying monkeys to make you feel like you’re unreasonable.  I guarantee he didn’t tell them that he’d lied to you about buying it, that you were actually fine buying it for yourself, that he was too embarrassed to admit that he procrastinated long enough that he ended up lying to you and didn’t want to admit that it was actually out of his price range.  \n\nSo, it’s about the lie.  He told you he had done something that he didn’t do.  This time, it was perfume.  What will the next time be about?\n\nFeel free to respond to all those texts with a summary of what really happened.  “No, I didn’t get my way.  My way was to purchase this as a gift to myself.  His way was to tell me he was going to buy it for me, even though I warned him it was pricey.  My way was to check in with him a few days before and ask if he was sure about buying the perfume and assure him I was more than happy to purchase it myself.  His way was to lie and tell me he’d already bought and wrapped it.  My way was to give him every opportunity to let me know this wasn’t in his budget.  His way was to encourage me to use the money I’d set aside for this purchase on something else so that I no longer had enough funds to buy something I was perfectly willing to buy for myself.”", "So this guy lies to you, get your hopes up, gaslights you and then get his mom and friends involved??And the fact that the mom actually chose to intercede on his behalf. Is this the kind of future you envision for yourself? Didn’t think so. NTA.", "NTA\n\nYet another one of the “it’s not about the [thing], it’s about the behavior”.", "NTA - he literally said he got it for you (lied), then gas lit you afterward to pretend it was your fault. THEN he told everyone of his friends/family a non-truth to make it seem like you were forcing him to buy it and make you look like the bad guy. 100% he's in the wrong and the way he conducted himself is completely childish.", "Nta. He's lied and lied. Is this someone you can see being with long term?\n\nFind someone who can a) afford perfume b) doesn't lie c) go running telling tales to their mommy\n\nOr find no-one and buy your own perfume like you intended.\n\nHe's dead weight. Cut loose.", "NTA, I can understand the part where the perfume was out of his budget, it could have happened to anyone as we are not supposed to know how much everything costs and yeah, some things can cost much more than we could have ever imagined.\n\nAll he had to do was to come clean about it but instead he made up a lie about already have bought it.\n\nHe crossed the line a second time when he got his friends and mom to text you.\n\nDefinitely not the kind of relationship you should keep.", "He told his Mommy and his Mommy called to scold you for upsetting her baby.....?  That's just sad!", "Fucking leave him and Send this whole story to everyone so they all of the kind of shit he is. Then block all of them and live a happy life.", "NTA. He is really something special, isn’t he ?", "NTA. He’s a tool and has been enabled by his tool mother who can’t see her soon is a tool because she is a tool.", ".", "YTA  Over perfume? Totally, YTA.", "He shouldn't have confirmed the gift. \nWhy are his friends and mom calling you? That's also so immature.", "I read the first line I don’t need to read more YTA, you will always be the asshole because that is your entire personality", "NTA and the fact he got his friends and mom to gang up on you is sad. He messed up by lying and doubling down on the lie and telling you that you can spend your money. Since you had a good relationship tell her what actually happened then tell her you are breaking up with him. He just showed how childish and inconsiderate he is. I get he probably felt bad that he couldn't afford it but he should have said it or siad he needs more time to save for it. But he instead lied that he bought it. His gift may have been thoughtful but it was thoughtless because he lied about getting you the perfume and letting you spend your money", "NTA. It has nothing to do with his gift and everything to do with lying and misleading you. You offered to buy it yourself and he still said no he’d get it. Does he support your interests or was this a way to prove dominance over you? Also his mom may not be getting the full story. He may have spun it so he doesn’t look like an absolute ah.", "NTA - He is lying to your face and manipulating you. Dump his ass.", "NTA, he lied. I think you know he isn't worth your time now, dump him and move on.", "NTA. You didn’t expect anything. You said you would buy it yourself. Not in the wrong and don’t let these people make you think you are.", "NTA. He said he would buy it when you said it was expensive and you could get it for yourself. He should have been honest and not spread lies about you.", "The already wrapped part gets me upset. Never had a girl do this to me but every guy friend that has done this to me I’m no longer friends with cause it’s just a small aspect into how they really are.", "Especially cause he could have just owned up to the fact that he couldn’t afford to buy it and instead offer to pitch in for it so she doesn’t have to use all her money on it. Would have prevented the entire problem.", "All this over \n\nsomeone repeatedly lying, \n\neven when given multiple chances to come clean and back out,  \n\nand leading someone on to the point they could no longer afford something they were planning for some time to get, \n\nand were fully prepared to pay for themselves,\n\nand then blaming them for not being happy about the deceit, and the compounded deceit, \n\nand dismissing their very valid feelings over the lost chance to use their money as they had planned,\n\nand then to lie to others and get them to blame her based on what is obviously a very distorted version of events.\n\nAll over perfume? Yeah right. You really don't understand how lying and trust works.\n\nNTA", "I agree he didn’t have a clue.  But she told him it was expensive.  She even asked him again if he was sure.  In other words, she gave him an out.  Twice she told him she would buy it herself.  He told her he’d already bought it.  When he obviously hadn’t.  \n\nI don’t think she’s mad about the gift.  She’s mad about the lie.", "And his mom....yuck who does that", "Honestly dont even bother justifying yourself to anyone giving you a hard time, just send them the link to this post. Anybody who doesn’t get where he fucked up isnt worth dealing with anyway", "Because he obviously lied to them. I'm confident he didn't tell them exactly what happened and only made it out that she's upset he didn't spend enough money on her or something.", "You aren’t kidding! Hope it smells amazing for that price tag!", "Get the dupe on dossier or oakcha and save your money, while smelling great. Also, dump the liar.", "Had to look that up.. hefty! But clearly bf didn’t even bother to do his research before lying that he already got it.", "Don't just think about it. He sounds awful", "Yeah, he wanted the insta-hit of his girlfriend's face lighting up and feeling like a great guy without having to do anything to follow through. Even though he knew it would bite him in the ass later. That's probably why he promised and promised and never once went back on it when he had the opportunity. And why he tried to make her feel unreasonable for the natural consequences of his actions. This is a man who feels entitled to zero accountability. And that's the *generous* interpretation. That's also why this is about so much more than a perfume. Who he's showing himself to be through this is not someone worth dating.", "AND big red flag that he is already siccing the mom on her.", "Except...we all know he only found out the price an hour or two before he gave OP the back-up gift.", "At the minimum, a lot got left out of the story he relayed. He probably was just complaining, saying, \"OP expected me to buy for a *insert price here* perfume. Then she threw a tantrum when she opened the gift I gave her!\" \n\nI'm sure he didn't explain how he promised it for her, reassured her over and over again, even telling her he got it already that she should use her money for something else (?!   This pisses me off so much).", "I voted ‘yes’ but I’m biased regarding the ‘beauty’ industry. It is fundamentally inappropriate for anyone to have aspirations beyond what they can afford in life - in my opinion. This does not stop me buying guitars & amplifiers I don’t really need, but I’m not asking for anyone else’s opinion, and I’m buying instruments I can afford. My opinion - is that perfumes, and make up in general, are an collectively unnecessary adornment to alter the appearance of an individual - but on occasion, it’s a treat for that individual, and perceptively the company kept by that individual. ‘Fashion’ is the same unnecessary industry. Both industries are climate criminals in the main, and I’m content to move on from the concerns I had in my youth as to how I looked, and what did everyone think of my appearance; nobody really cared….\n\nI don’t say this to be unkind. I really appreciate that it mattered to you that your boyfriend created a situation that was upsetting, and in relationship terms, you could both learn to understand one another better. But if money is something you currently have to manage carefully, then aspiring to buy or possess an expensive perfume can wait until one or both of you can afford ‘it’. Your boyfriend owes you an apology for being unkind, but there’s also something in what he says that’s worth considering. You’re NTA in this situation, but I’d encourage to reassess your aspirations. In the wider world, there are too many ‘legitimate conspiracies’ in every industry/market that we are collectively persuaded to believe in, that are simply not accurate, and therefore not worth our aspiration, or money.\n\nHope this is taken in good faith, and provokes a broader thinking. No offence intended.", "ESH\n\nHe's a liar and an idiot, but you say that you wasted money going out with your best friend and your sister? How is that money *wasted*? That some materialistic asshole behavior right there.", "NTA for being upset but you didn’t have to call him a POS.", "YTA and so is he!", "Send a group text to everyone who berated you on his behalf explaining the whole situation like you did here. He had multiple opportunities to say that it was out of his budget and to go ahead and get it yourself. They should know the facts. Then break up with him.", "nta , he expresly told you several time he was ok with buying it!", "NTA! You didn’t force him to buy it, he wanted to buy it for you, was very clear what he was going to buy, and insisted when you told him he didn’t have to. Then turned around and got a completely different thing! I would’ve been pissed too, it’s completely ok to not buy you that perfume but not to lie about it and make you waste your money on something else then still try to get credit for ‘a gift’ that you didn’t ask for", "NTA\n\nYou are too young to settle for someone who lies needlessly and causes you avoidable problems.", "So many red flags. Just break with him,seriously. He has a serious ego problem. NTA.", "I was going to say yes before reading the post , as the title seemed a bit entitled, but after reading it it’s a firm NTA. \n\nAs you said, it’s not the fact that he didn’t, but that he lied saying he did. He could’ve easily said it was too expensive for him and you would’ve bought it yourself. \n\nAlso, the fact that he got his friends and his mum ganging up on you is a huge red flag.", "NTA at all. (Dump him, btw.)", "I always say (if I want X - brand name or whaterver) Do Not, under ANY circumstances, buy me something else - I do not WANT a substitute,  and neither will I use it. And this is for mundane things, like groceries. I have told people for years - please don't buy me gifts - I don't want, nor need them.", "I don’t think you’re the AH. He knew perfectly well it was the perfume you had wanted. Just insist on buying it yourself next time. I would still be thankful for the gift.", "NTA - I admit when I first read the heading I was like hmmm and then once I read through I understood your perspective. He lied to you multiple times saying he had bought you the perfume and then reacted terribly by calling you a spoiled brat even though you asked him multiple times if he was sure cos you knew it was expensive and had the money to buy it for yourself. And the people saying you’re using him for money just make me laugh - do they realise you were willing to buy the perfume with your own money but he was the one who insisted you spend your money on something else?! They’re the AHs, definitely not you.", "NTA\n\n>  I also got a text from his mom\n\nThis tells you all you know to know about your BF's maturity, and his mother's lack of boundaries. She brought him up so don't be surprised to discover that he isn't suitable long term partner material.", "NTA. He had no reason to lie, but he did. You two could have combine finances to get you present that you really wanted.", "NTA. It's not about gifts, it's not about the perfume it's the lie. He could have told you to go ahead and buy the perfume and get you something more suitable for his budget and everyone would have been happy.", "NTA he's inconsistent and inconsiderate and trust me partners like that don't get any better", "I read the titles and expected to say YTA but actually no NTA he sounds difficult and untrue", "NTA you are literally the opposite of spoiled, should reconsider the relationship. Not cause he couldn't afford it but for lying about already buying it..", "I was like “wow, bratty much?” when I read the title but nope, not one bit\n\n\nHe is a liar and then got mad that you were disappointed, called you a gold digger despite you saying multiple times that you’d get it for yourself and that it was expensive and sent his family and friends at you? Can you just stop calling him your boyfriend? He’s obviously not mature enough to realise what he did wrong and why you’re upset. He needs a bit more growing before getting into a committed relationship if you ask me, NTA", "NTA, He does not care about things that mean alot too you.", "Wait you are telling me you took three people to dinner in a good restaurant, then to the movies and you only spent half of what you would've for the perfume? My god how much does that thing cost?? Absolutely NTA btw but I'm really curious as to how much could a perfume ever cost.", "You should leave him. How everyone came after you when he was in wrong. It's disgusting. He is a terrible bf.", "I am sorry this happened to you!! He realy sound Ike a piece of work. He did lie to you and the he wants to call you spoiled? Wow.\n\nNTA", "NTA, but yeah I honestly think this would be a dumb reason to break up especially since you're both so young. You have maturing to do on both sides and perspectives to evolve, or maybe thats the point\n\nYou guys shouldn't grow together and should break up? Idk.\n\nIf you guys had no problems and have been together a good while a perfume shouldn't be why you break up. I'd say the fact he had his friends messaging you etc is pretty messed up though. If his mother did it I'd find it at least a bit more sensible but bringing friends in never really usually means normal and sane interests are at heart.\n\nNTA, just make sure you really consider the break up if you go through with it and you do have a reason to annoyed too ofc.", "NTA.  Dump his ass.  He can’t even bother to apologize and getting others involved to rag on you", "NTA - And at the very least, his mom doesn't think you're one as well, **he probably just lied to her and to his friends**, just like he lied to you. He probably said something along the lines of \"Look at this expensive perfume! she's angry i wouldn't get this for her birthday present!\"\n\nYour boyfriend is a liar, an asshole, and doesn't respect your hobby, and probably you.\n\nIf you want to be sure, just text her saying \"I've been saving up for that perfume for X months and was about to purchase it when BF said he will get it, i tried to dissuade him but he insisted on me spending the money i saved on something else, and said he already purchased and wrapped it. So i spent the money. I'm not upset he didn't get it for me, i'm upset his lie means i need to save up for 1/2X months now, again!, wouldn't you be?\"", "I read the title and thought YTA for being spoilt but having read it you are NTA. He lied to your face. That is not ok. You dont make much money and you saved and saved for this luxury and you checked multiple times that he was ok to buy it. You should defo evaluate your whole relationship and see if this is the type of guy you want to be with. If he could lie this easily what else is he lying about", "NTA\n\nPretty much what everyone else here said, but I wanted to add that he probably lied to his family and badmouthed you, completely changed the story to make you look like a golddigger.", "ESH", "NTA. he bait and switched you and then involved his friends and mom to shut you up when you called his ass out. not cool and i’d be dumping him over this.", "NTA he did indeed lie to you. When he learnt the item is too expensive to him, he should have notified you about the situation immediately so you can react properly. But the problem here is the kid had an ego related problem so he was not able to be truthful. Men and our egos. It is what it is. 100 % on him though.", "its a good idea to send the reddit posts to his friends just to come clean and not build a bad rep, he probably completely turned the story around and “forgot” to mention most of the details to them.. obviously NTA", "NTA - he literally lied, told you not to worry about it and to spend your savings somewhere else. Then gives you cheap body spray and a bath bomb..... \n\nHis friends are calling you spoiled and after his money? That's laughable considering he couldn't afford the perfume and you worked your ass off the save for it. \n\nHonestly I'd break up with him. You can't trust him, he brushes off your feelings, his friends harass/attack you. You deserve better.", "nta .. i wonder what story he told his friends and mom for them to feel that way. Not one of them could say they wouldn't be disappointed to be promised one thing and given another", "NTA\n\nThe only reason these people are taking his side is because they have only heard his side. He’s obviously not going to tell them that he told you he had already bought it.", "NTA... I like the above persons advice on this... And honestly I go with that.\n\nYea its a red flag for sure...\n\nQuestion... Has he in any way said sorry?\n\nGoing foreword what is it that you want?\n\nIt easy for us all here to say leave him as we are not emotionally involved.\n\nBest advice I can give is to remember your heart and mind are not at war. They are still one...\n\nOne is saying I love him and the other is saying he lied to you.\n\nSo the question is do you want to forgive him or even though you still love him its a deal breaker and want to leave.\n\nAre close to your parents or another family member or close friend you know you can trust? That you could talk it through with?\n\nLet us know what you deiced. (I'm self confessed nosy bastard after all LOL.) \n\nGood luck and be well.", "He didn't just say he would get it, he said he *already had*. What a clown. Imagine being so desperate to be single.", "It’s a totally other gift that he promised her", "What do you mean by thus", "It’s not only about the perfume it’s about he lied", "He is a liar and and will repeatedly disappoint you if he isn't already doing that.\n\nHe put zero effort into your birthday.   \n\nI bet you do a lot more for him than he does for you.", "He mislead you and then he badmouthed you to his friends and family while saying that YOU are in the wrong.  \n\n\nThis is way beyond just lying to you. He broke trust in the relationship and the way he's handling that I don't think he's planning on fixing the trust in your relationship.  \n\n\nBroken promises and lies should be deal breaker in any relationship. If you can't trust your partner then the relationship will turn toxic. Well it already turned toxic.\n\nNTA.", "Explain to his mom exactly what he did. I doubt he told her the truth. NTA", "If I were you I wouldn't even consider leaving him and just do it, especially how all his friends decided to get in on attacking you.", "He went full cheap ass and bought the cheapest thing that resembled the perfume", "I’d send a link to this post to everyone who was mean then block them, dump his ass and enjoy your perfume for Christmas x", "$729 for the 100ml my lord. I’m sorry he did this to you. You had the money and his lie set you back in obtaining this. You deserve better.", ">Baccarat Rouge 540 extrait\n\nWell I can see why he backed out of buying it! That ain't the cheap-stuff at all.  \nI'll have to make a note of it, my wife has been known to enjoy expensive perfumes.. Maybe she'd like this.", "You deserve better than a lying liar who lies. 💗", "He should've looked up the price before even giving the promise. Don't promise what you are not sure about if you can keep.  \n\n\nChances are he went to the store one or two days before giving OP the gift and found out the price, panicked so he picked something generic from the store.", "Yeah that’s expensive! £235 in the uk. BF should have looked it up before making promises though.", "Did you tell him how expensive the perfume was? If so and he still agreed to buy it then he is out of order. Never mind he actually said he had already got it!!! He shouldn’t have said he had already bought it when he clearly lied. It’s the principle of him not being honest rather than the fact he didn’t want to buy it because he couldn’t afford to. The others probably don’t realise the back story of how you had been saving up for it and that he already got it for you.", "ESH \nYou for using “wasted” when talking about spending the money on your friend and sister. Twice.\n\nYour BF is a liar. Don’t WASTE anymore of your time on him.", "You’re a bit of a brat", "ESH. Seems like he gave you the easiest test in the world - not treat him like crap when you don't get what you want. You blew it. He dodged a bullet.", "Yes you are grow up", "you \"wasted half your money on your best friend and younger sister\".  stopped reading there, \n\nYTA", "YTA a gift is a gift you shut up and take it, you seem to be in this relationship to get free stuff, hope he left after that incident", "ESH.\n\nHe lied about perfume even though you gave multiple chances. Even gave hope when he said it's already gift wrapped. He should've been honest. For him it's just a perfume and you have do many already. I understand your disappointment. Plus he shouldn't have let his friends gang up on u or let his mother intervene either. Very immature. More than not buying perfume, it's the lying that bothers me.\n\nHowever I didn't like the way you worded on how you \"wasted saved up money\" on best friend and younger sister by visiting nice restaurant and going to movies. Didn't you enjoy spending time with them? Didn't you enjoy the food you ate? Didn't you like the movie that you watched? You had fun didn't you? Didn't you make memories with them? Don't they mean anything to you? They mean something that's why you spent your birthday with them right? \n\nPlease remember these are beautiful moments. You won't get them back. You can always save up the money   and buy the perfume again.", "NTA  \n\n\nHe led you on, and you're rightfully upset about it.  \nIf he'd been up-front that it was way more expensive than he expected, you'd have bought it yourself, he'd have gotten you something else that was more in his price-range and there wouldn't have been a problem.  \nHe's wholly at fault here for being unable to back out of something he said he'd do when it became untenable, and continuing to double-down until the truth came out.  \nOpenness and honesty isn't too much to expect from a boyfriend, but if it's too much to expect from him, maybe he's not boyfriend material.  \n\n\nBoth of you resorting to name-calling (spoiled brat, lying piece of shit, etc) doesn't speak well of your relationship and your ability to communicate either. I'd think very carefully on how you want to proceed.", "NTA.\n\nIf it wasn’t for him repeatedly and specifically promised it that might be different but he did.", "NTA. He is obviously not telling people what really happened in this situation.  He is making you out to be a gold digger while he is the hapless victim. \nYou told him the perfume was expensive, you told him you were fine with buying it for yourself, and he told you to go ahead and spend the money you had saved for it because he was going to get it for you. \nWhen you again offered to buy it yourself, he assured you it was bought and wrapped and told you to spend your savings on something else, which you did. \nYou then discovered he'd lied and hadn't bought you the perfume. And he'd ensured that would be awhile before you could save enough again to buy it for yourself. \nThat's the story all these people who are texting you with unkind messages are not getting. NTA", "NTA, I reckon it's because he thinks beauty frivolous hobby. I love beauty products and do the same as you save and get myself something nice!", "Ahhh to be young again", "NTA\n\n&#x200B;\n\n>He called me a spoiled brat and said I was expecting too much from him.\n\nThis is called DARVO. Deny, Attack, Reverse Victim and Offender. He denied that he lied to you. Called you a spoiled brat. Then feigned victimhood by claiming you were after him for his money. \n\nHe also sent his \"flying monkeys\" after you to try to do the same thing. \n\nWhether he's narcissistic or not, these are classic narc abuse tactics. I recommend reading more about them so you can see if he's using other ones (OutOfTheFOG is a good source). \n\n&#x200B;\n\nIf you have the ability, leave. If you don't, hon I feel for you (Dr. Ramani on YT is helpful).", "NTA\nHe lied to you,  he's the problem here.  Dump him and move on,  life is too short to deal with people who lie to you and blame you for being angry about it.", "Dump him. Not only is he a liar but he ran and tattled (while also lying) to his mommy and friends. Not cool. NTA", "why does this post look familar?", "NTA DUMP HIM.", "NTA, you really didn’t do anything wrong. That thing was expensive. EXPENSIVE expensive, so expensive that you literally asked him over and over again if he was sure he’d buy it considering how much it cost. And you already had the money for it but you let your trust in him set in and used the money, which he told you to do. I have a feeling he either didn’t even check the price until the last minute or knew exactly what it cost and made up his mind to disrespect his own promise to you.\n\nIt’s really seeming like he does not respect your wants at all considering he just let you use the money you specifically saved up for a particular product just to turn around and get you jackshit. I’m sorry but that is just so immature and careless, you deserve better.", "NTA. Why are you still with this guy.. he sounds like a total loser. Dude fucked up and immediately went made you out to be a gold digger to all his friends and his mommy.", "He lied to your face about buying and wrapping it perfume, then he cried to his friends and mother about it, which led to them borderline harassing you? Dude sounds like a compulsive liar and I don’t even know him. If he’s making this much of a scene over something he has no right to be, imagine what a serious situation would look like? He sounds like a massive headache, get out now and find someone that doesn’t play childish games; because the one in question clearly has some growing up to do. \n\nYou’re NTA, not even a spritz.", "NTA. He should have asked you how much it was to see if he could make that promise. He already had it wrapped? Lol", "NTA He had every opportunity to explain it was simply too expensive a gift but instead he chose to lie and claim he already purchased it resulting in you using the money you had saved when you were already willing to purchase it yourself.", "NTA.\n\nIf he's gone to his friends and mom about this and they're blowing up your phone, after he lied to you, I bet he's lied to them about what happened too.", "Nta", "Yeah people who drag friends and family into an argument - big red flag in my book. He did lie when he said he already bought and wrapped the perfume. \nAll in all - seems like this relationship has run its course. He will keep saying that it's about the perfume, you have to keep saying it's about the lying. You won't convince everyone but why should you care?", "NTA. \n\nPlease leave him. But also show him the comments on this post to let him know that it’s not about him not buying you the perfume, it’s the fact he lied. TWICE.", "NTA. His friends and his mom are only against you cus they dont know the full story…", "NTA. The fact that he never even looked into how much it cost and only bought something else at the last minute shows exactly how much he values you.", "What’s with this thing that i keep seeing on reddit about other ppl sending texts to one of the partners involved? I know you guys are young but it still doesn’t make sense for his mom or friends to text you shit. \n\nNo, you’re not an asshole.", "NTA. He lied to you and then spun the facts to make you sound like an asshole to friends and family. Dump his ass and send this post to the people he’s bringing into this argument so they can see that he lied to them too. His mom should know what kind of son she’s raised.", "Could you not just say you’ll pay half and he could pay half?", "NTA. If he couldn’t afford it he should have told you and then you could have bought it yourself. Getting his friends and mum involved feels excessive!", "NTA. Jesus he’s a dick.", "NTA This was important to you and he *did* lie to you. He shouldn't make promises he can't keep.", "NTA you do not want a future with this man. If he gets his friends and his mum involved over a birthday gift, imagine what any long term future would look like with major disagreements. Sorry you didn't get your perfume, but you got the gift of a great big red flag before its too late.", "You're not in the wrong. He's an immature ass that still needs two faced drama to feel noticed. He lied to you, made you believe, then failed you. \n\nYou aren't the asshole. You're just better raised than the lot of them.", "**NTA** \n\nHe told you *it was already wrapped* which was obviously a lie.  \n\nYou labelled him correctly.", "NTA break up. There’s no way this is going to be a good relationship. There is so much manipulation here it’s astronomical. First of all it’s a huge red flag that he made all these promises and grand gestures without even knowing the price of the perfume he didn’t even look at knowing you had been saving for it which implies it’s expensive. That’s just a lack of thought for you. Also his gift could have been way more heartfelt but he put nothing in it. Hell if he made such a huge mistake that he got you to spend the money without being able to afford it himself he should have done something grand. Like a long letter flower petals there’s so many romantic things you can do for free he put 0 thought into this. He woke up that day grabbed some spray and a bath bomb and called it a day. THEN he called you a gold digger which is funny considering he can only afford a body spray. You have to be the worst gold digger to ever exist. Broke men love accusing women of any standards that they’re gold diggers and he got his friends and family to back him up. Incredibly toxic selfish person who isn’t worth wasting energy on", "NTA", "Why would he say yes before checking if he can afford it? NTA", "NTA. Also dump him. Even if we give him the full benefit of the doubt, let’s say he intended to get the perfume. Let’s say he actually didn’t know it was THAT expensive, simply didn’t realize it would be THAT important to you, and that he genuinely believed you’d be happy with the substitute, the fact that he reacted to this by sending his friends/family at you is a HUGE red flag.", "Why do we always hear his “friends/mom/siblings etc. are texting me calling me names”  These people hear one half of the story then think they can express an opinion. I would tell my (ex) boyfriend the second he sent flying monkeys after me the relationship was over. Also, the perfume bait and switch was ridiculous, you couldn’t have been any clearer and he still managed to screw it up, you really think this guy is worth it?", "He lied. Notice how he never answered the question, and then gaslit?\n\n\"You're a spoiled brat\" is untrue too - YOU saved the money and were prepared to spend it on yourself. He said this to shift responsibility and make you take the emotional strain.\n\nI have to wonder if there was some resentment here too. Pretty sure you can do better tho\n\nNTA", "[deleted]", "NTA & suggest leaving him too.  I once dated someone who offered to take me away for the weekend and said they'd buy train tickets for a certain day/time etc.  I didn't need/want/or even expect them to do so and double checked two days before hand that he was cool with doing so, making clear I was more than able/happy to buy my own.  He told me that not only was it not an issue, he'd already bought and booked them and to meet him at an arranged time so we could go away.  got to the train station at said time and not only had he not booked or bought any tickets, he couldn't afford to buy his own and was essentially using me to get the tickets for him to get home and visit his family.  ashamed to say I paid up but it didn't get any better from their and very glad I didn't stay dating him.", "NTA\n\nTell him you’re taking him to his favorite restaurant for dinner. Really hype it up. Then bring him to the the fast food version of that place and break-up with him.", "Yikes.  Nta. I went into this post ready to roast you, but he point blank lied to you and told you to not buy it with the money you'd saved up.", "im forever floored by the amount of posts saying that a gaggle of enraged people are texting them. not once in any situation has that happened to anyone i know. what are people doing that they have that time?? he lied even when you gave him multiple outs. nta", "How’d I know you wanted BR540 before I even looked at your comment ha ha. Expensive and highly sought after? 99% of the time it’s BR540.\n\nNTA btw. What idiot promises someone something when they haven’t even looked up the price? He shouldn’t have lied and he should have cared enough about you to atleast tell you that he couldn’t afford it before telling you to go spend your money. He sounds pretty immature.", "NTA\n\nYour bf lied, told you he had brought you the thing you saved specifically for and to go spend your savings on something else. It is quite strange behaviour on his part.", "This. It's actual gaslighting. \n\nWouldn't even bother trying to explain yourself. Just leave and cut them all off", "I disagree with this. This really isn’t about the perfume. This is about the behavior. OP was going to buy herself a specific product. She mentioned it to her BF and he said he’d buy it as a gift. She checked in numerous times before allocating the money she had saved elsewhere. BF told her he already had the product, but he actually bought something else. It’s about the fact that he lied to her and prevented her from buying it for herself. \n\nOn the flip side, he didn’t get the reaction he wanted: A grateful girlfriend. So he went to his mom and friends who are now harassing OP. He didn’t get what he wanted so he is treating her like crap. \n\nHow is OPs behavior in the wrong and the BF dodged a bullet when the BF behaved far worse?\n\nAlso, can we stop giving our significant others “tests”?", "No the 'test' was don't treat people bad even when they repeatedly lie to you. NTA", "If you bothered to read this post, you'd know that he told her multiple times that he'd get/already got it, and OP told him multiple times that it was fine and they could get it for themselves. OP isn't mad about not getting it, they're man about the bf lying about it, then using his friends and mother to try and gaslight them. NTA", "Yeah, you really should read the rest.", "He told her he already bought and wrapped it. She’s upset that he lied and got his friends to gang up on her.", "that's called **E**veryone **S**ucks **H**ere", "Why are there so many trolls on this post?", "Please do me a favour and ask his mom/ his friends what he told them what happened. I would bet it was a very different story than what actually happened. (I’m guessing something like “OP insisted I buy this crazy-expensive perfume for her and when I refused she freaked out” or something like that.)", "I'd save a blanket response for everyone saying something along the lines of \"I never expected him to spend that much on my birthday. I expected him to answer me honestly when I initially warned him that it would be very expensive or when I asked him before I spent the money I had saved if he was sure and he promised me it was already bought and wrapped. If at any point before today he had apologized for misjudging the price I wouldn't be even mildly annoyed at him, its the fact that he lied to my face multiple times.\"", "He told you he already wrapped it when you were gonna buy it yourself , and when eventually you got upset by his actions he started a smear campaign against you to his friends and everyone else that listens to him . All of those are red flags , leave him.", "Your boyfriend is a loser. Not worth your time.", "Good! Yes. 1. He lied about it. 2. He doesn’t see the problem in promising this when he understood the context of how you could have bought it yourself. 3. He got his friends and his mom to fight his battles (who does that? I could never do that).", "Well look at you, \"considering\" leaving a guy who repeatedly lies to your face.\n\nGrow a spine and dump him.", "Yip, run and don't look back - Mum's attitude stinks and won't get better with time for her wer boy!", "I'm sorry that this is how you spent you 21st birthday, but HOORAY AND HAPPY BIRTHDAY!!!!! That aside toss him out like the little boy he is! The gal of this guy to get his crows to flock around you because of his nonsense. Please update us on how he responded to be tossed aside. Again, HAPPY HAPPY BIRTHDAY!!!!!!!!!", "and his mom. yes, consider doing that", "Hopefully by now you have finished thinking about it and have (or will be soon) dumping him. I know it sucks, but it'll suck a lot worse if you stay with him. You'll have a future of him lying to you and him and his friends and his mom gaslighting you.", "To elaborate\n\nYou are not worth it to him, you aren’t worth what he agreed to do for you, you aren’t worth the truth (even when asked)\n\nYou’re worth being given a cheap and inaccurate substitution and being manipulated/insulted by everyone *he* knows on top of it\n\nSo I ask, do **you** think this is your worth?", "I knew it. As soon as I read this story, I thought \"It's the Baccarat.\"", "I understand that you’re mad at him, but trust me, that scent is **not** worth the money and is very overhyped. You can get a molecular copy for a fraction of that scam price.", "Too bad, I was going to say you’re not TA but naaauuuurrr ESH. Hard. Your boyfriend sucks for all of the reasons already provided by others *but so do you* for not being explicit and transparent about the price. I make $400k/year and I would laugh in someone’s face if they expected me to spend $280-925 on a 1.1oz (32.5 ml) to 6.8oz (201ml) bottle of perfume. It would literally never happen and I’d be outraged if someone hid the ball on the actual price until I went to buy it. Like, not only is that an absurd amount of money to waste on something that has a shelf life, your boyfriend’s even younger than you?? When he heard “expensive,” he probably assumed $100-150, not a dang car payment.", "Would you be less pissed if he got Mancera Instant Crush for you instead?", "Even after reading the rest op is toxic and the asshole though he certainly should have been upfront with her about the cost of it and she shouldn’t have shouted at him or called him that, seems very undeserved \nPlus those obsessed with hair and beauty are always toxic horrible people\nHis friends seem sucky too\nI don’t see a good way out for anyone there tbh", "What do you mean by \"thus\"?", "She wants a several hundred dollar bottle of perfume that has a shelf life, it’s £340 ($430) for a 70ml bottle and can get more expensive.\n\nWhile the bf certainly isn’t in the right, she is expecting *way* to much when they’re barely making enough money for a single person.", "And how do they think she's using him for money when he's obviously broke?", "She shouldn’t have to.  His mom should have stayed in her lane.  Personally I’d tell the mom the truth, sure, but then I would add that he apparently wasn’t raised right if he’s an adult and his mommy is trying to run his relationships.", "The relationship breaker", "As someone that enjoys fragrances, I wouldn't blind buy BR540.   The extrait is one of my favorite fragrances, (It's unisex) but many people can't smell one of the main notes/ingredient, and it's very polarizing.  Either love it or hate it.   I'd get a 2ml sample from MFK, first.", "But she didn’t expect him to buy it. She was fully prepare to buy it herself and he told her not to. \n\nRepeatedly. After she checked multiple times and told him he didn’t have to because it was expensive. It’s not her fault he didn’t think to check the exact price before committing to the purchase.", "If only there was a way he could have looked up the price instead of repeatedly promising her the gift...", "The fuck kind of reasoning is this? People buy special things as a one off purchase. Using the shelf life logic is laughable.\n\nJust reading this makes me doubt that you earn 400k a year. \n\nNTA", "but OP only expected the perfume as a gift after the boyfriend promised that he'd buy it. she even asked if he was sure because of the price. I would be shocked too after looking up the perfume but he should have told her after finding out the price that it was out of budget for him instead of waiting until her birthday and giving her another gift after telling her it was sorted and she can spend her savings on something else.", "There's no way she sucks here. He explicitly told her that not only was he going to get it for her, but that it was already wrapped. She would have no reason to be concerned about the price with him outright lying like that. This is on him.", "This*", "The thing is she offered multiple times to buy it on her own but her boyfriend kept insisting that it was fine", "Things wouldnt escalate to AITA level if he had actually found out the price an hour or two before and were honest about his actions. He kept her from buying the perfume and afterwards caused all his friends to harrass her with claims like she was using him for his money while all her actions been very very reasonable", "No she shouldn't. However if the relationship was good before it might be worth it.\n It's op s decision", "That’s the yellow bottle. If you add the word extrait to the search and find the red bottle it’s £340", "I think the thing that has annoyed me is that she said spending time with her sister and cousin was a waste of money. Like she seems to care more about some dumb perfume than her own family.\n\nLike I said, the BF is definitely in the wrong and she’s perfectly within her right to be annoyed with him, it’s just her attitude about the perfume itself is not lending me sympathy.", "Wel she means waste money as in spend money on useless stuff. ofcourse spending time with her sister and cousin isn’t useless but it’s not a necessity but I totally get where you are coming from", "How can you use him for money if he has no money??", "Lol your boyfriend called his mommy when you got in a fight, and she called you to berate you?\n\nGet outta there.", "What’s the perfume????", "A 20 yo man who sics his mommy on you? *Yeesh.*", "NTA. He outright lied to you. I bet he didn't do research at all when you mentioned the perfume even after you numerous times told him, so he just made empty reassurances and promises only to find out that it is out of his prize range later. He really should have looked into it at once or outright ask you how expensive it is than simply assuming he can easily afford things you OP have to save for. He should have at least apologized to you when he gave you his cheaper gift.\n\nAnd then he is insulting you for not acting happy for him breaking his promises and he seemingly is talking badly about you with his friends and family. For sure he is not telling the the whole story. Likely he is just saying to them that you are pissed that he didn't buy you an expensive gift and making you look greedy.", "NTA. I was expecting the opposite but you literally told him you could do it and he flat out lied to you so that you spent the money elsewhere. This really sounds like he's trying to set you up to look \"crazy\" and greedy to everyone else so that he can ramp up further types of abuse without you being believed in the future. This isn't about the perfume. He set you up with manipulative games and he knows it. I would run because this is a major red flag.", "Girl, why aren't you dumping him right now, wake the fuck up, who does he think he is to he talk to you like that. You don't even say that to strangers, so if your SO treats you the way normal people don't even treat strangers, what is there to talk or think about.", "NTA\n\nIt's not on you, but if I were in your shoes when he offered to buy it, instead of saying \"it's expensive\" I'd have told him how expensive. If you had to save up for it, why wouldn't he have to do the same? \"Expensive\" could mean many different things to different people. You asked a few times if he was sure and he should have looked into it to be certain. The way he acted when you found out he lied is unacceptable and frankly you should dump him for it.", "NTA but you should've let him know how much it cost. He's TA for saying he had it wrapped up when he knew he had something else.", "well, I started off thinking I was going with YTA, but no. NTA. Did you discuss the price of the perfume with him or did he really walk in there to buy it with no idea?", "ESH. Firstly, agree with the general consensus that he failed to get what he said he would, and as you had discussed the fact you were saving up, he should have known it was important. But also you suck, because you took your best friend and sister out for the night, and keep describing it as being wasted. You spent presumably some quality time with two of the closest people in your life, and you keep describing it as a waste.  \n\n\nEdit: Describe to Describing", "So I’m going with YTA unless you actually told him how much it cost because I just looked it up and holy FUCK who would pay 200+ for perfume? \n\nDid he know that? Also lowkey if money is so tight and your savings would have been just enough to buy this… don’t buy this? You can’t afford it. Really harsh I know but 200 dollar perfumes seem extravagant and I’m really not sure how anyone excuses that when by your own self admission you are a destitute college kid.", "Your both assholes and both immature who are past due to growup.", "ESH - It sounds more like he saw how much it was after the fact, decided it was too much and got something he thought was similar enough within his budget. It doesn't sound like he lied or out of malice, but he also didn't communicate that it was out of his budget\n\nHe's an idiot, but you're an asshole", "The fact that you work at a movie theater and are budgeting your $13 an hour for expensive perfume. Let me think that you’re probably getting your college paid for by your parents and makes you a selfish brat like your boyfriend side and he deserves better.", "YTA for buying perfume that is out of any budget. I buy arm and hammer deodorant, works great.", "I walked into this post with a completely wrong impression lmao\n\nI don't think he *lied* to you, since a lie has to be intentional, but the BF sure has poor planning skills and I see your reasons to be mad.\n- First, you don't promise a gift before looking up the price tag. Rookie mistake. \n- Secondly, he could have saved his ass if he called and told you as soon as he realized he couldn't afford it, apologized, and asked what else you might want. This way maybe you wouldn't have spent your money.\n- Third, what do friends and parents even want with this? Did he go whining about your fight? 'Cause that is really immature and in many ways worse than the botched present.\n\nIf you choose to stay together, next time he wants to get you something tell him the price beforehand.", "Your NTA for being upset. He lied, be upset. He broke your trust. However, YTA for devolving into the tantrum and then trying to justify it. If this is repeated behavior between you two, then it is time to try counseling if your serious in the relationship. You clearly have unhealthy communication skills in an argument with each other and you need to learn some conflict resolution.  Or just break up, work on yourself, and choose a better dude.", "EHS and I think its time this relationship came to an end.", "Yes the Asshole. I feel like this should be cross posted in r/ImTheMainCharacter \n\n&#x200B;\n\nAlso get a better hold on your spending.", "YTA \nYour bf was not aware of the price of the perfume. Man have no idea how much beauty products cost. It seems like he had good intention but the perfume turned outside of his budget. You knew how much they were - have you mentioned the price? Is your bf well-off so you assumed he could afford the gift?\nAll in all I get you were dissappointed, but making such a big deal about an expensive gift you didn’t get and can easily survive without for couple more weeks/months seems petty and immature.", "YTA. Chap was struggling to find you a gift by sounds and jumped at chance of actually getting you something you’d like. In his mind he was like “boom, this is it”\n\nThen he has actually realised the price and didn’t have cash for it.. and rather than getting NOTHING did next best thing.\n\nAlso, if you kick off with your fella over a bit of perfume, you need to reevaluate what’s important to you.", "ESH.\n\nHe should have told you if he wasn’t going to get the perfume instead of assuring you you he was going to and then not doing it. when you were. He also should absolutely not have implied that you were an AH when he initially offered to buy it. He also shouldn’t have sic’d his family on you. \n\nFamily sucks, too. They should have minded their own business.\n\nYou shouldn’t have gone off on him and called him names. Even though I get why you were annoyed, name calling is just never effective in a relationship. What’s the goal? For both of you to be happy and connected? Then name calling doesn’t achieve that. If the goal is just to express anger, that’s a real recipe for disaster in a relationship.", "YTA\n\n&#x200B;\n\nSadly, perfume and cosmetics won't help - they can not cover your character.", "wtff NTA. leave him like seriously. tf he lying for???", "Most definitely NTA. He KNEW you spent time saving money for it and then told you to spend that exact money on something else because he would take care of what your money was actually being saved for. Then in turn gives people the impression that you use him for money??? Even though you spend the time to save up for something that's not even in his budget? All it took was a quick Google search and a \"actually babe, I don't think I'll be able to afford it. Go ahead and buy it and I'll get you something else\".", "NTA - Although your BF is not the sharpest tool in the box is he…", "NTA - he continually lied to you and wasn’t honest to you. He then tried to gaslight you into thinking you were in the wrong, and tried to get his family and friends on to you as well. He sounds very immature and you should leave him as he’s not going to change. And then you can find someone who actually respects you!", "NTA. As someone in the same boat with minor differences (on a disability pension, have wanted this specific perfume since it came out nearly 10 years ago, cannot afford it until now because I saved up f0r 2 years to get it, am also treating myself for my birthday) I would be so pissed off with his actions and the audacity to lie, and a little angry at myself for not being cautious and waiting until after I opened his gift to buy it or not, though please don't be angry at yourself, that's something I would do, it's not something you should do. You should be 100% angry at all his actions. Be angry at the lying, the gaslighting, and the ganging up on you. You don't need his money. Dump him. \n\nAnd at least you're not starting from scratch. You'll save up the money again in no time and can maybe even treat yourself for Christmas or just treat yourself in general. Oh, and happy belated birthday OP.", "Nta, he said he already bought it. Sole reason he is the asshole", "He has shown you who he really is. Believe him. \n\nYou're NTA.", "NTA\n\n20 year old man gets his mummy to tell you off after lying to you, not getting you the birthday present he promised, and insulting you. Nice.", "Nta but please understand that they are probably calling u an asshole irl because of miscommunication. \n\nIf u had flipped out over this without the prior conversation where bf said he would buy it, you would be TA. I think that's where his friends and family are coming from. Be sure to clarify with them that he said he'd buy it", "What kind of person that promised then lied then have a bunch of friends and mom to gang up on gf? I bet he let out of all the important details and just told them that you wanted an expensive perfume that he's too poor to buy.   \nHe's trash.", "NTA. He promised, didn't follow through and trying to play the victim when you actually sought assurance multiple times. \n\nOn the other hand—taking your sister and best friend out wouldn't be a \"waste\" of money. You are spending money who I am sure deserved it.\n\nBut sorry OP that you were lied to.", "NTA. He purposely lied to you and told you he was doing something for you, and that you should spend money on something else but he surprised you and told you he was lying and then got angry when you told him he was lying and that you spent your money already? Why do people do this.", "NTA. I guarantee you that he didn't tell his friends and mom the full story. He is the childish lying brat one and that's a massive red flag.", "NTA why are people acting like you demanded he buy it for you?\n\nDump him! He could have asked how much the perfume was  or googled it himself before offering to buy it. He could have told you it was too expensive for him but his pride was bigger than this feelings for you. He's projecting his shame. \n\nYou have the right to be upset & you deserve s better boyfriend that him. He shouldn't be dating anyone.", "NTA. And what the fuck, he make everyone turn on you! Get away from this guy", "NTA \n\n\n...But dear god why are you buying perfume you have to save up for!\n\nAssets people assets, save for deposits, invest over time, buy important consumer durables!", "What an AH. NTA. Dump him.", "NTA - no he lied to you. And he’s telling his family a different story you can let his mom know that you had spent months saving up money to buy yourself this perfume and you had discussions with your boyfriend about purchasing his perfume and he said, don’t worry I got it even on your birthday. He lied to you.", "And make sure his mum and friends know what he did.", "NTA.\nSend this reddit link to his mother and the friends he's wrangled to hang shit on you.\n\nThat way they'll know that we, the AITA collective thing they AH's too! \n\nAnd please put this melt in the bin. Please!!", "NTA, he lied and led you to believe that he had bought that one… bizarre. Why not say from the start after checking the price ‘I can’t afford that’ and let you buy it", "RED FLAG DUMP TOXIC BF /s\n\nover a gift lol, this is way immature and superficial and you are both a-holes that need to grow up", "time to dump his ass. NTA", "I would leave him, it’s going to be toxic. \n\nI’ll buy wife a $300-400 perfume once a year, every year, have for 10 years now. I don’t buy much else expensive but she loves perfume so always happy. And she would never spend that on perfume for herself.", "NTA He did lie. Best he could have done was what you said, admit he couldn't afford it and warn you. Even then he'd be better off contributing money towards your present instead of getting something smelly that is entirely taste specific. I got perfume once. Gave me a headache. My mom has gotten scented bath crap and pawned it off on me. Sometimes I leave that in the bathroom at work with a \"please take me if you like me\" sign.", "NTA. That is some weird controlling bullshit right there. Leave him. 🚩🚩🚩", "On a side note, If you want a similar perfume to Baccarat Rouge that doesn’t cost $800, Ariana Grandes Cloud is extremely similar. Not at first spray but the dry down is exactly similar to Baccarat Rouge. If you want the exact molecular replication of Baccarrat R540, then ALT fragrance or the Dupe spot have exact replications, and when I say exact I mean exact and they are less than 10% the price. I wear the Santal 33 from dupe spot and it’s heavenly. My friend who wears the real thing said that she can’t find even the smallest difference between my dupe and her original", "NTA…he’s not giving them the full story. I know how important perfumes can be as my girlfriend is a perfume princess. I figured out early on that it was safer to just go to the store with her and letting her pick one out for birthdays, anniversaries, etc. You’re boyfriend doesn’t listen, he lies and then he paints you as the ah to everyone he knows…why is he your boyfriend? Arguments should stay in the relationship…", "NTA", "NTA\n\nThe way he went about this is childish. I'd compose a message template explaining why he lied and say it doesn't matter because you're dumping him anyway then send it to everyone that texted you. Then block them. Best way for him to find out he is single is through the people he lied to lol.", "NTA\n\nHe lied to you and got you a shitty gift when it was out of his budget. I'm sorry but random body spray and a bath bomb? He didn't consider your taste, hobbies or feelings at all. He knew it was important to you and (I assume) knew how long you saved up for that perfume.\n\nIt's okay that he vents to his friends, but twisting the story so you are the bad guy and getting his mom to talk you down? 🚩🚩🚩\n\nIs this how you want to spend your future? Tip toeing around every argument so you don't get flooded by a barrage of accusations of his whole squad?\n\n\nGirl you can do better.", "NTA- He lied. He then lied to cover the lies. Then he went to his friends and probably didn't tell them the whole truth to get them to be angry at you.\n\nHe's shown you who he is. You need to decide what to do with that.", "When someone show's you who they are, believe them.\n\nHe could have admitted his mistake when he found out how much the perfume was, and come to you like a man, but he's clearly not a man of integrity.\n\nLeave him.", "NTA, your boyfriend absolutely is though.", "My man lied to you repeatedly. I'm to sleepy to go back and count the times. Seems like you were up front with him and communicated clearly as well.\n\nSorry you experienced that.", "NTA. He is, in fact, a liar who caused you to waste money you have saved.  I can't think of any justification for his behaviour.  What was the scent you wanted?", "NTA. NTA.NTA. This is ridiculous.", "NTA break up with him. But you’re really dumb for believing him. Your fault for spending your money instead of waiting", "nta. you’re angry because he promised repeatedly to do something and didn’t deliver. so frustrating", "Can't you give his friends the context?", "Knowing what perfume you wanted I think it’s pretty accurate to say he didn’t check the price, assumed it was in the $150-200 range as many scents are, waited til the last minute to buy it and panicked cause the realization struck that he didn’t have enough. Instead of being a man about it he acted like a child. NTA and your boyfriend is a AH and a child still. He, his mob of bros and apparently also mother are not worth your time. Leave his pathetic little weasel ass.", "Lol boy BYEEEEE, NTA… he was probably too embarrassed to admit straight away that the price of it was too much and that he didn’t want to pay for it. Make sure you get your story straight to his friends and mum etc (if you want to or care) because he’s most likely changed the story to make you seem like the crazy one. for example • she didn’t tell me what she wanted and got upset over what I bought • she never even told me that she would have bought it for herself", "Drop your Venmo so we can contribute to your new perfume fund", "it was your fault you were disappointed and upset.", "NTA and GET RID OF THIS DUDE!  \nWhat kind of person lies to you, then tries to make YOU feel bad about being disappointed that HE LIED?!?!   \nThen, to add insult to injury, TELLS HIS FRIENDS AND MOTHER half-truths and more lies ABOUT YOU to the point where they are HARASSING YOU?!?!  \nGirl, get outta there NOW!!! This is not the type of person with whom ANYONE needs to be in a relationship!", "NTA He lied to you then went running to his mum bad mouthing you. \nIt’s irrelevant what he lied about or why at that point. He showed you who he his and his mother showed you where he learned that behaving that way is ok..", "NTA\n\nNext time anyone calls you childish or bash you for beeing angry, tell them you aren't angry because of the perfume, your are angry that he lied. That you are angry because he told you to spend the money you'd saved specially for this special item on something else, because he'd already bought it to you. And then it turned out he lied and you are now without the item you saved up for AND the funds to spend on it. You wouldn't be angry if he didn't lie.", "NTA - He assured you he'd get the perfume you desired. You mentioned your willingness to purchase it yourself due to its cost, and you even confirmed with him before your birthday. In the end, he lied to you.", "NTA.  He lied and continued to do so after you checked in once more before spending your money on something else instead of what you worked to save it for.  The moment he realized he could not afford it, he should have told you so you knew to get it yourself.  Dump him, correct his friends and mom on the situation, but dump him.", "NTA how could you be spoiled you wanted to buy it yourself. He lied. His ego couldn't handle you buying yourself something he can't afford so he made you spend your money on purpose.\n\nHonestly I don't see you two coming back from this. You should split.", "ESH....your bf for lying about getting the exact product you wanted for your bday. You for not telling him how much it cost at least ONE of those times you asked him if he was sure about buying it. He should have confessed as to not being able to afford it before getting you what you didn't want. Has he bought you expensive things before? If not, then YTA for assuming he would get you what he can't afford.\n\nEDIT: I just looked up how much the perfume cost. IMHO, that's a lot of money for perfume.", "I don't think you have gotten as mad at him if he didn't offer to pay for it himself.  Yea he was a dick for saying I got you after you told him it costs a lot of money and you were going to pay for it yourself.  Then", "NTA  you asked, he said yes.\n\nyou confirmed, he said yes,\n\nHe said he'd bought it.\n\nand then he didn't and never planned to.\n\n make sure your ex's mother has all those details then find someone who'll respect you.", "NTA", "My takeaway is your bf sucks and you need some financial literacy", "For his part, he started out with possibly good intentions. But then he started telling you he had already bought it when he clearly hadn't, and once he found out it was out of his price range he kept lying instead of just being honest. That's asshole behavior. Relationships are built on trust, and he's being untrustworthy. \n\n>I called him a piece of lying shit\n\nI think once you say this to your partner, the relationship is pretty much done. Frankly, I think you're an asshole as well for this response. \n\nSo I'll say ESH.", "WHY ARE MEN", "NTA\n\nHe deliberately lied to your face. It doesn’t matter that it was about something “materialistic,” he lied to you twice.", "NTA\nPeople who promise things should follow through, or not promise. If he couldn’t afford the whole thing, a gift certificate towards the store it was at would have been better.\n\nI hope you save up quickly for the one you want.", "NTA- based on the title I was ready for a different verdict, but after reading it, I was like wow, what a piece of work. Who tells someone they got them the gift they wanted after you spent time saving money up to buy it and then gaslights them into thinking they’re in the wrong. Not only is he a massive jerk, but he really broke your trust on that. I don’t see how you are supposedly entitled in this scenario because you literally scrimped and saved money for the perfume because you knew how expensive it was. I feel bad that you couldn’t get the perfume yet.", "Not gonna lie, you had me with the title. But no, hard NTA. It's not about him not buying you the perfume. It's about the fact that he literally SAID IT WAS ALREADY WRAPPED. Like wtf.", "NTA- You had saved your money, you told him it WAS too expensive, and when you confirmed he said he HAD bought it. \n\n\nTo me that’s a liar. Tell all his flying monkeys to go back to their cave and mind their own business.", "NTA! This isn't about the perfume or you wanting him to spend that amount of money on you. This is about the fact that he deliberately told you that he did something that was really important to you and than lied about it several times again, to the point where you fully believed he had it covered. Because why wouldn't you have? It's really disrespectful and proves you can't trust him. If he can lie so easily about that, what else has he/will he lie about. And I guarantee he also did not tell anyone the full story and is making you look bad to everyone too, by making it about him not buying you the perfume when that isn't it at all. A healthy relationship is built on trust, respect, and open communication, and he has proven you two have none of that. It's time to move on.", "Ok, found how much it is in the comments...\n\nYTA, no dude would ever think perfume costs that much because it shouldn't. Grow up.", "Ew, his mommy texting you for him is all the answer you need. Leave him.", "I hope this is an ex boyfriend.", "Children thinking they in relationships. Lol. Why don’t you ask the playground supervisor what she thinks?", "NTA. \n\ni can’t see any reason for him to lie except that he’s insecure about his finances and perhaps jealous that you have the control to save and put money away for things. \n\nhim immediately sending his mother on you is very telling and such a red flag, OP. the fact he went to multiple people to bad mouth you over a single instance, where you weren’t even in the wrong, is a major, major red flag.", "Sounds like your BF is exhibiting text book shitty gaslighting behavior, and if his mother is getting involved that’s extra toxic. Get out!", "Nta at all and send his ass to his mom.", "So he with no prompting from you offers to buy the perfume you had already saved up for to buy yourself. Confirmed multiple times it was OK he was happy to buy it and infact had already purchased it. Then when his blatant lie is exposed as was inevitable when you opened the gift, instead of understanding you are upset because he lied and didn't tell you about not being able to afford it he jumped straight to you being a spoiled brat throwing a tantrum bc you didn't get the expensive gift. He also encouraged you to spend the money you had saved for the perfume so you could no longer buy it for yourself. Not only this he's fed his bs to everyone else around you. This guy is a tosser OP and if it were me I would be thinking very seriously about the future of the relationship. You don't treat people you claim to love like that. All he had to do was be honest use his big boy words and say he couldn't afford the perfume. He could have given you money towards it or still buy you the body spray and bath bomb but let you know so you could get the perfume out your savings.  NTA", "He obviously didn't tell the real story of what happened.  He lied about having already bought it, and then told people you were being spoiled.  He is a jerk.\n\nNTA", "ESH \n\nYou and him are both giant children for the way he lied and the way you reacted. If the cost of a bottle of perfume (or any gift for that matter) is worth a relationship then it's not worth saving. \n\nAlso - If I was your best friend or sister reading that you \"wasted\" money treating them to a nice meal and time together I'd be furious. You CHOSE to spend your money on them instead of saving what you'd earned and no longer had earmarked for the perfume. You could have just not bought the perfume and not taken them to lunch. You'd still have the money (and if it's really that big a deal to have saved up for perfume, you should look at your finances and consider the savings option more often so that one unforeseen need/want doesn't knock your entire life askew).", "To me it’s not even that he promised something and then couldn’t deliver/lied about it. It’s that he convinced her to spend her money so that she wouldn’t have the money to buy it if he for some reason failed, forgot, changed his mind, couldn’t find it, or whatever. What was the reason to make her spend the money other than making sure she wouldn’t be able to buy it for herself anymore? Once he realized he couldn’t afford it he should’ve offered to pay the portion she had spent of what she saved up so she could still buy what she wanted.", "Pleeeease respond with this!!!!", "This. Fwd the link to his mother at the very least", "😃😃😃😃🤧", "Not being able to afford a £300 perfume isn't a moral failing. This particular guy's behaviour wasn't OK but I'd wager most people would pause at that price unless they were very wealthy.", "I looked it up, the prices range for $465-$925, and I'm not even sure what the company's price actually is.", "Either he knew she was saving for ages or he's a terrible boyfriend. She didn't have to tell him the price, it's on him to be an adult and look it up.", "Other way around, she said she's not the type of person to refuse to apologize when she's wrong.", "It wasn't really bratty. He disappointed her after lying to her, anyone would be upset by that.", "He didn't want her to get it for herself because he is controlling and thought it was a stupid purchase to buy such perfume.", "He said he already bought it for her, when she was fully prepared to buy it herself. He lied, that’s the problem. What’s so hard to understand?", "That doesn't really make her TA though", "Yeah, this was my key takeaway. You “wasted” money. Why did you spend it on things you considered a “waste”? If going to dinner, etc is wasteful, you could have just saved your money for something you actually wanted.\n\nESH.", "All this over repeated lies. fixed it for you", "Yup, be lied to her and then bad mouthed her to his mom over some perfume. That he volunteered to buy.", "\"Its bought and wrapped.\" Very intentional obviously a lie. FFS", "If you can't figure out what she meant when she said she wasted money. You should refrain from judgment. Your ignorance is showing.", "She's not mad at the gift. Why do all of you seem to be downplaying what he actually did?", "And repeatedly lying is a good trait to have according to you. Dumb af", "You shouldn't be testing your partner, especially by purposefully making them upset.", "The thing is she didn’t mind buying the perfume for herself, it’s the boyfriends own fault he didn’t research how much the perfume was and his gf offered to pay it by herself and kept reminding him of how expensive he was yet he kept saying he would get it for her. \n\nHe could have told her that he couldn’t afford it way before he was supposed to give it and she wouldn’t have minded and would be content with the other gift. \n\nThe whole thing is is that her boyfriend kept saying she was going to get it and making her excited and then she just ends up not getting it.", ">Then he has actually realised the price and didn’t have cash for it.. and rather than getting NOTHING did next best thing.\n\n\n\nWhy did chap say \"it was already bagged\" When he had not even checked the price? \n\nChap must have known now important this BIRTHDAY GIFT was to his girlfriend that she was saving for it, told him about it, confirmed multiple times with him that he was okay with it. \n\nChap is an A H", "I'd find it less sensible to bring his full adult mother into it rather than his equally immature friends", "Why", "The thing is she offered to pay it full by herself but he kept insisting he could pay it", "Why would she compromise over his lie? All he had to do was be honest. She was ready, willing, and excited to buy it herself. He's the one who insisted that he would do it.", "Not over perfume\n\nOver being lied to repeatedly", "Did you read the post?", ">Sadly, perfume and cosmetics won't help - they can not cover your character.\n\n\nOh they help accentuate her already great character. \n\nNow get back to the back of the line", "He didn't have to call her a brat so they're even", "With a gift, it's the thought that counts and what he thought was that he would lie to her, so why should she be even slightly thankful?", " You would be thankful for the cheap substitute after being lied to? Either you're lying, or you need to value yourself more because this is subpar behavior.", "His mom called you, why is she involved that is creepy.", "Do it. Even after he got caught up in the fib about having already bought and wrapped it, he could have called you, apologized for lying and for not understanding the true cost, and said that he had screwed up and wouldn’t be able to buy it for you but would contribute to you saving up again if you had already spent the money. Instead he bought you something cheap to try to turn the tables on you and then recruited a bunch of his family and friends to push his narrative and make you look bad? This guy views you as an opponent to score points against, not a teammate. There’s nothing good for you in a future with someone who has that attitude.", "You're right. It's not the perfume. \n\n1. He promised something without doing his research\n2. He was disorganised then lied about it\n3. He calls you names (although you also called him names - so maybe ESH on that point)\n4. He enlists others against you, rather than the two of you talking about it.", "But he will definitely spin it as  \"My GF dumped me because I didn't buy her an expensive perfume she demanded. AITA?\" and get tons of sympathy. Dump him and get rid of his shitty friends as a bonus.", "Yep, all of that very clear red waving flags!!", "Still considering?  Be a bit more proactive.", "You don't want a relationship like this where your SO obviously doesn't care about you. This was such a simple ask and he F'ed it up. \n\nDon't waste time on him. He won't change. Maybe after you dump him, he will change for his next girlfriend.", "There is no excuse to bash you to everyone of his friends and family. The conversation should have gone, “hey…I f*d up…gf wanted a perfume and I offered to buy it for her bday without hearing the price…it was too expensive so I figured I could substitute and get her something similar” in no part of their conversation should it be calling you a spoiled brat…good guys don’t speak that way about their women", "Lol why the hell is his mommy involved?  Ridiculously childish", "and his mother.   I'd let her know the circumstances around the gift so she gets the full story.   I hate when someone screws up and gets friends and family to gang up.  It sounds so immature.  Seriously consider if this is who you want to be with", "Break up girl. Even his “mommy” got involved!!!", "This. I think getting his friends to gang up on you is the entire point. I don't think it had anything to do with the perfume or the expense. He found an opening to isolate you from other people, likely because he's going to become very abusive in the future. I was with someone like that at your age and I wish I had dumped him at the first red flag. He's extremely manipulative and this is likely going to be the first of many worse things he'll do if you stay.", "dude, someone who really cares about you and your feelings, especially for your birthday, would not do that shit to you. that whole situation would infuriate me. you saved for so long!", "Please leave him- he’s only gonna lie and flake on our bigger things- kids, marriage ect. Boy has no commitment nor care", "If he is going to lie about perfume (something that is obviously going to be noticed is different then what you wanted) what else is he willing to lie about?", "You are so in the right here.  If I saved up my money to purchase something, I really wanted and my wife told me she already got it, I would believe her, because she would go out of her way to get exactly what I told her to get.  Vice-Versa with something she wants.  If we cannot afford it, we don't get it now.  Which reminds me, her birthday is 2 weeks away.  I need to get want she wants.  It is saved on her Amazon wish list.  Makes it easy to get what she wants.", "make sure your ex's mother knows exactly how he lied, to the point of saying 'it's wrapped' and then lied to you, right to your face, then find someone worthy of you. he ain't it.\n\nNTA", "Yep. And those are the right reasons. Nothing wrong with your thinking. I don't see how you move forward if this is how he handles making a mistake.", "He’s gaslighting you. Leave", "his behavior will not change", "He's gonna be calling Mommy for every argument the rest of your lives. Know that in your heart.", "You're giving him too much credit. \n\n\nHe probably only went to buy it a few hours before giving it to op. That's when he got the cheaper options. \n\n\nI bet it wasn't even a nice body spray or bath bomb", "Yeh that's the worst bit. It's actively stopping her being able to get it for herself.", "I got this as a wedding present from my mom & it’s worth every penny. I’d tried dupes too and they’re similar but not the same—save back up for it! You won’t regret it", "Have you tried Ariana Grande’s Cloud perfume? Similar smell and not even close to as expensive.\n\nAlso, don’t waste your 20s on shitty men.", "This is the way. You're 21!! Don't waste your time on people like this, you have lots of time to find someone right for you. When people show you their true colours, believe them. \n\nAlso - obviously, your bf did not tell his friends or family the whole story. They likely only got \"she was mad I didn't get her a more expensive gift\" story, not the \"she was mad I didn't get her the expensive gift she was planning to buy for herself that is particularly special to her and that I lied about purchasing and told her to spend the money she saved up\" story. He does not respect you or your interest/hobby/collection. Based on how you chose to spend the money, you seem to be a thoughtful and generous person who deserves someone equally so.  \n\nNTA. Edit:spelling", "No it's not. It's just regular lying", "Damn!", "I stand corrected. I offer my apology for misreading what she wrote.", "u/Avriel04..actually she kind of IS an ah for saying spending her hard-earned money was wasted on eating out and movies with people that care about her. For most of us, THAT would be well worth the money spent to have that time and memories with people we care about.", "If you don't understand what she was saying you probably shouldn't be giving judgement. Dinner and the movie wasn't the waste. Its the money was for something specific that it didn't get used on due to false promises that's how it was \"waste\".", "Missed that part. Yeah that's bullshit no excuse.\n\nMan get a chill pill", "It’s perfume vs healthy relationship. Her choice. \n\nMy bets are on that he is guilty as fuck and currently saving for the same perfume and will surprise in future, but we won’t get an update on that from OP now will we… \n\nThey’re young and she needs to learn men fail sometimes… worth giving him a Jon Bobitt? Didn’t think so.", "No bringing friends into it is asking for drama and a half, if it's just his mother she's just being motherly and he is allowed to speak to his mother. If they're  ot at all ever gonna be on the same page they can break up, but invovlinf his friends could mean they have mutual friends and cause unnecessary drama. We don't know if he even told his mother to do anything, just pure assumptions. Not all mothers are rational ethereal beings.\n\nIdk but to me, talking to your family is a whole lot more mature than spilling to friends and being a nuisance and back stabbing, with family you can shit talk and discuss things and keep it in the circle until things are figured out", ">To be honest, it sounds more like he decided for you that it was too expensive and you should be spending your money other ways.\n\ni was thinking this, too. that or he thinks she's stupid enough or small enough that her saying it's expensive couldn't possibly be that serious because [insert reason for thinking poorly of gf here].", "I am thinking he only pretended that it was already bought and wrapped because he had forgotten to buy it up to that point. Then when he finally went to buy it, he found out it was out of his budget and bought something else.", "\"I mean, it's one perfume, Michael. What can it cost, $10?\"", "Creepy way to talk to a stranger and stupid advice on top.", "Kinda like she's asking for advice from strangers in their personal business?", "Send them this link. I'm betting he spinned the story in his favour.", "I really hope he made an AITA post about this! Sure we all know how he spun it.\nNTA! He lied, that was the only problem until the slander. It was never about the perfume... you had that taken care of.", "Yeah he didn’t even get her a *perfume* he got her a body spray. For people who don’t know about perfumes or colognes, there’s levels to scents. I’m not sure which perfume OP wanted but the expensive ones are almost always “parfum” or “eau de parfum”. Lemme break this down for everyone:\n\nParfum: 20-40% oil concentration\n\nEau de Parfum: 15-20%\n\nEau de Toilette: 5-15%\n\nEau de Cologne: 2-5%\n\nBody spray is usually about 3-5%. It is the lowest percentage level basically on the market, it’s the kind of scents sold at places like Claire’s and target. Body spray is not even considered perfume.", "If the scent is worth the money to her than it’s worth it to her. I’m sure most people wouldn’t pay anything for famous artworks but that doesn’t suddenly devalue the art just cause not everyone likes the way it looks. That’s the specific thing she wanted and he shouldn’tve offered and then insisted she spend her money on something else if he wasn’t willing to spend money on the ‘scam’.", "The price and her being mad at him are two separate things", "I googled it and it seems you can get that perfume in tiny test sizes with hardly any content for a much lower price. I surely hope OP tried it out before deciding to get a big bottle.", "I can't see why he kept saying he already bought it.", "Her boyfriend is a year younger, be fucking for real. For all we know, because he’s 20 and she’s 21, that could only be a few months in the difference.\n\nEdit: He’s 20 and she JUST turned 21. Even better!", "Her boyfriend literally lied to her and told her he already bought it how is she the TA if he really cared he would at least look it up and see the price", "You get an AH judgement from me.", "How is she toxic", "Lol get a chill pill. I'm sorry you can't read and have an actual understanding of what you respond to be you offer advice and judgement. Ignorance is indeed bliss.", "She gave him an out. She gave him multiple outs. He didn't just fail. Failure would be that he couldn't find it or realized it was too late that he just didn't have the money. That would've been fine. Instead, he lied. He told her that he had everything handled, that it was already bagged, that she should go enjoy herself. The one thing she's been wanting this whole time was pretty much ripped from her hands because he lied to her. Sure, they could come back from that, but let's not downplay the actual issue here. \n>healthy relationship \nWhat part of sending his mother and friends after her is healthy?", "He can speak to his mother sure, but her texting his girlfriend over an argument between them is crossing a line. He's not 5. She doesn't need to scold his playmates for hurting his feelings. He's at the age where he can and needs to handle things like this on his own without her interference besides some advice, comfort, and accountability. There's already unnecessary drama. The relationship between her and his mother has taken an unnecessary turn that can't be taken back. Now she knows that any disagreement with him will be between his mother too. Family dinners, trips, events, etc. This type of overreach would continue once he's married, too, which is worse than with friends. She would be his wife's mother in law, and children's grandmother. That type of relationship is a lot more complex than some friends they both know. Either way is drama, but this has the potential to be more harmful than if it was simply between friends.", "Also, the fact that he got his friends and his mum ganging up on you is a huge red flag.", "Found OP’s shitty boyfriend", "are u dumb", "I doubt bf told them the truth", "You don't see the difference between poisoning people she knows against her by giving them a one-sided story, getting people to actually call and text her real life, vs. an anonymous post where he's protected from literally all of that?", "We are all not calling her boyfriend and trying to destroy his reputation. Strangers on the internet won't affect his life, while his friends and family negatively affect OP's life now.", "Kinda like you vent your personal business to strangers online? \n\nHope your grandma passes peacefully. (Genuinely)", "The mention of bath bomb made me think it might be Lush? Some of their exclusive perfumes are over £100 where as a body spray and bath bomb would have cost him max about £35. I suspect he lazily googled ‘lush perfume’ saw that most of them are £35ish and panicked when he got to the shop and realised her wanted scent was one of their big ticket items so cheaped out", "Probably ego preventing him from admitting his mistake", "I'm devastated and will never recover", "Nothing, absolutely nothing implied she was told to message his playmate. My point is he was right to talk to his mother, his mother being a toss isn't his fault", "If only there was some sort of computer system where you could look up the average price of ANYTHING. Sigh.", "Beat me to it!", "Obviously. Still funny to paint her as a gold digger when he cant even afford some perfume", "I'm not complaining about my person business being talked about.  I was replying to a comment about the ops spouses friends messaging her being in her private business.", "That might have been his backup gift but I’m guessing the perfume OP was saving up for wasn’t from Lush. My favourite perfume (Christian Dior Absolutely Blooming) costs a STUPID amount. I refuse to buy it anymore because it’s hard to justify but my husband bought me a bottle for our anniversary and it was more than $250 CAD (close to $200 USD, I have no idea what that is in £ or €).\n\nThe crazy thing is that his favourite cologne (Tom Ford Neroli Portofino) costs even more than my perfume! High quality scents can be crazy expensive.", "The fact that she did shows that she thought it was appropriate. That's my problem with this.", "Oh I know it, my favourite is bitter peach so I ration it for special occasions. I just thought that seeing as he’s obviously a lazy bastard he might have got the back up at that same shop, but I can see from OP’s other comments it wasn’t lush so my Poirot guess was way off 😆", ">I’m guessing the perfume OP was saving up for wasn’t from Lush.\n\nYeah, given that she was able to take two people out to dinner and a movie with half the money, I suspect she was shopping at Sephora at minimum.", "The greatest mistake I ever made in my life (this is facetious) was picking up a sampler of bvlgari perfume at a duty free store on a trip. Now I am fucking addicted to one scent and it's 142 dollars pre-tax for 3 ounces 😭", "Lol, like a £340 perfume is a necessity", "You're not making any sense lol.\nI said and made my point it's fine for him to talk to his mother about it rather than his friends.\n\nNo one is saying his mother did the appropriate thing.", "Don’t get me wrong - I love me some Lush! But those aren’t “save up” calibre products.", "OP clarified which perfume it was and it’s anywhere from $625-1250 CAD depending on the size of the bottle (Baccarat Rouge 540 Extrait). Shit’s wild.", "Have you tried cocaine? It’s cheaper", "I never said perfume was a necessity", "You’re totally right, I was just thinking ‘expensive for a student’ maybe", "Actually I saw in one of OP’s comments she specified that it is the Baccarat Rouge 540 Extrait, so depending on the size it is anywhere from $625 to $1250 CAD!!! I can’t imagine the disappointment of thinking you’re opening *that* gift and then getting a body spray and a bath bomb.", "NTA, he never got the the gift you wanted, he never apologized for the wrong gift, and he doubled down on by calling you names and roped his friends along. 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩\nTime to dump this fool.", "[removed]", "[removed]", "It's hard to say, but I'm leaning towards you're both a little bit assholes.\n\nHe's a bit of an asshole for not telling you the second he found out that it was too expensive, you're an asshole for freaking out about it.\n\nFor instance, are you actually sure that he truly understood what this meant to you? Did he actually know just how expensive it was?\n\nWhen he found out it was out of his budget to get you this, he could've definitely handled it better and apologized.\n\nOn the other hand, you could've tried seeing it from his side and that he most likely didn't know how much this would hurt you, and not go full nuclear on him.", "NTA.  He lied to you and caused you to spend the money you had saved for your present.  I don't understand why he would do that but he was  wrong.  I don't think getting upset because he LIED TO YOU is a tantrum.", "ESH but mostly you.", "NTA. The gift thing could have been resolved. But that he got his friends and *mother* to harass you over it is the unforgivable part. And if you do end it with him, you can tell his cronies that when he sets them on you again. That's very immature. He needs to grow up.", "NTA. Dump him. He lied and made a promise instead of looking into something beforehand. Instead of apologizing when he realized he couldn’t afford it he just lied more then brought his family and friends into, probably telling them a skewed version to help bully you. That’s horrible.", "This guy and his mother sound exhausting. PLS leave him and go find someone you are more in-tune with.\n\nNTA", "Nta leave him", "NTA\n\nHere's the thing: You wouldn't have been upset with him if he came out and said, \"I looked it up and can't swing it with my budget. Is there's something else I can get you?\"\n\nYou were already planning on buying it yourself.\n\nEven a gift card going towards your purchase would've been better than outright lying to you.\n\nHe's being a child.", "He was wrong to lie to you, but your insults are too much.", "NTA", "I'm not going to lie this is a bad sign, I had an ex that did this repeatedly. One year, I only wanted one item for Christmas, I even showed him the website had the item in the cart. All he had to do was click and pay. (The item cost $60) \nChristmas comes. I see a box that would hold said item, open the box, and it was a bunch of frames with pics. While the gift was \"thoughtful,\" it wasn't what I asked for, and he never got what I wanted. Then, of course, I'm the materialistic asshole that ruined Christmas for being grumpy. You being upset is valid because hebsaid he would do something and didn't follow through.", "NTA, and he’s clearly doing a smear campaign against you now to get people to dislike you. Leave and don’t look back.", "NTA, but you two should not be together. The name calling, the lying, and getting family invovled to call your partner when you are having an argument is not healthy behavior. \n\nHe told he would get you this specific thing, something he know you wanted and were saving up for. He went so far as to tell you to spend your money, since he was getting it. Then lied asn said he had. Not sure what he expected to happen when it was made clear he never did?\n\nAnd while you are upset, name calling like that is not the answer in a healthy relationship. \n\nJust break up, and both of you should work on yourselves.", "NTA-it’s not even about perfume, he lied repeatedly!!!!", "I was ready to come flying in with a Y T A cause it sounds quite entitled on the surface but he could have just fessed up and said he can’t buy it for you and could get something else. He seems to have gone a bit off the rails in his reaction too by the sounds of it, I would make it clear to all those giving you trouble that this has come from a place of disappointment, not entitlement. NTA", "NTA. Not only is he bad news, but his entire support network is bonkers crazy for supporting his tomfoolery. Move on with a clear conscience. 🏃‍♀️\n\nYour real birthday gift is funding out who he really is before you waste any more of your valuable time on him. 🎂", "NTA\n\nLMAO, blud straight up lied through his teeth and got mad at you after you found out.", "I came here so ready to call you an ah, but omg, the guy just lied straight to your face, how dare he.\nNTA\nDump him!", "Leave his broke ass that’s funny asf", "ESH your bf sucks in communication, but yta for saying that spending a nice afternoon with your best friend and your sister is “waste of money” and is worth less than a perfume..", "His MOMMY called you? Yikes.", "I was so ready with a YTA, but nah, after reading the post it's very clear you are NTA. You had good intuition in the beginning, you knew he wouldn't be able to afford it, but you still took his word and spent the money you saved. If you want something, get it yourself. Gifts are nice, but you should never ask for something you really want because most of the time it ends in disappointment. It's for this exact reason I DONT get people gifts, I give them cash and they can buy whatever their little heart desires", "YBA- he is for not just telling you up front when he tried to buy it thay it was too much. He should have just said, \"hey u looked at that perfume you wanted I just don't have the money for that right now. I didn't realize how much it was\" and had a conversation about it. Also, he should never speak bad about his partner to his family. \n - and you are because you shouldn't seriously call your partner a lying AH when you might not know the whole story. Yes it sucks 100% but finding out why and expressing \"hey, this was important to me and you should have just told me.\" Is a better way to go. It just seems like you guys need to work on better communication from both sides.", "Is it electric cherry? Cause same 🥲", "NTA. And he goes running to mommy? Seriously?", "NTA. Throw the whole boy out.\n\nNo kind of man whines to his mommy about his girlfriend, particularly when he's the liar.", "NTA\n\nHis friends and mom better turn around quick, because your explanation is very simple and valid.", "Any man who brings friends and family into your arguments to gang up on you is not, in fact a man. Get rid of that loser and find someone who actually values you.", "When someone sends the flying monkeys, it's time to leave.", "I would need more details to judge you - calling something expensive is not really much telling, so did you and your boyfriend talk about how much that parfume is or did you just tell him it's expensive? I would consider parfume worth over $150 as expensive, but many people I know would call expensive parfume worth $30 (or even less). Moreover, you are 20 and 21 and based on how long you are together, he might have expected how much he wanted to spend on your birthday and thought your \"expensive\" was just little over his budget.\r  \n\r  \nHowever, your BF is still AH for two things: 1) he obviously waited on last minute to buy you gift, because otherwise he could have told you that it's too much expensive and 2) for involving his friends and family - this is either deal breaker and you two will break up over that, or you'll figure it out and go on...", "NTA‼️ enjoy being a successful 21 year old without him . don't ever let their bullshit stop you from knowing what's real . you worked HARD & saved up enough to buy what you Actually wanted , didn't even need his \"help\", but how could you refuse such a tantalizing lie ? he promised you fulfillment & left you empty handed then blamed you for it . that's not a boyfriend anymore girlie !", "NTA. Do you picture yourself spending your life with someone who would blatantly lie to you like that and then ask his friends and family to gang up on you?", "I had this almost exact same thing happen with my ex. He told me he would buy me a record player amp for my birthday. It was quite expensive, I even offered to pay half. He told me he would get it for me while it was on sale. He told me multiple times he would get it for me. Then came my birthday weekend and he hands me a thing of flowers and that's it. Telling me he went to buy it but it wasn't on sale anymore and he didn't want to pay the full amount (an extra $50 more).  That really hurt my feelings.", "NTA and this guy is red flag central. Lying - red flag. Demeaning something you cared about - red flag. Speaking down to you and calling you a spoiled brat - red flag. Having his friends and family talk down to you - triple red flag. No clue how long you’ve been together but your so young and he’s showing you he is not a good partner, imagine how you’d feel if he did all these same things in other situations and consider whether that’s a relationship you want.", "I'll take \"Boyfriend definitely lied to everyone about the circumstances to make himself look better\" for 500.\n\nNTA. Break up with him.\n\nYeah the perfume is an expensive gift but he dug his own grave and doubled down on his lie. Break up with him.", "NTA\n\nHow completely awful, why would he lie?  Why would he continue to lie, said he already had it.  You didn't expect him to get it, he insisted, and didn't.  I would see this is a huge red flag.  You aren't a gold digger; you would have bought it yourself.  Just wow!!  The way he had his friends text you and his parents.  I would get away fast. He let his colors shine here.", "He lied to you. Then doubled down when you called him out. THEN got Mommy and his friends to berate you on his behalf! For real?!  \n\n\nHis lying cost you to lose out on something important to you. You can't trust him, and he clearly doesn't give a shit about stuff that is important to you either.\n\nGet rid.\n\nNTA", "you had a deal and he backed out with no warning or real explanation. then he attacked you for reacting to it.\n\nhe sucks. he will not change. this is who he is.\n\nNTA", "I don't think you like each other.  ESH.", "YTA - For calling him a name and did you tell him how much the perfume was? If not, you should have said it is $100.00. You did throw a temper tantrum like a 2-year-old. \n\nAlso, this is a lesson for everyone to learn. Even if someone says they are going to get it for you. Never spend the money until you have it in your hands. ESPECIALLY, if it is very expensive. \n\nTHIS IS SOMETHING ALL KIDS SHOULD LEARN. IF you want something expensive SAVE UP. She never expected her boyfriend to buy it. AGAIN SHE DID SAVE UP FOR IT. i AM PROUD YOU DID THAT.", "Happy birthday! \n\nNTA. Your (ex?) BF wanted to swoop in and be the hero, he lied to you multiple times, he told you to reallocate your money (red flag!!!) and when his lies fell apart, he decided to tell everyone it's your fault for believing him in the first place.\n\nThis is an important lesson for you about depending on others, even when you think they can be trusted. If you want something, YOU go out and get it. Don't rely on promises or offers from others to get something done if it is important to you. If they flake, they lose nothing but your trust, which they were fine with losing, anyway. Wait to see results, before throwing away your own plan. In this case, that would mean saying, \"No thanks. I've been saving up and I want to treat myself,\" or WAITING until after you got the gift to spend your money. Dinner and a movie wasn't time sensitive and if you consider it a waste, you shouldn't have done it.\n\nWhat this guy did goes way beyond lying and beyond disappointing you on your birthday. **He got his mother and his friends to insult you and try to gaslight you for him, to cover up for his lies.** None of them are interested in the facts, because he was able to make himself the victim. This is a massive stop sign. **This is who he is.** He will try to show off, lie to you, not come through, throw you under the bus, tell others to shame you for believing him in the first place, and damage your relationships. Why? So he could look like a big man for a few days?? None of this was necessary. He just decided to throw some chaos into your life for no effing reason. I urge you to please at least take a break for a few weeks.", "NTA of course but I’m here to find out which perfume it was 👀 I’ve got the same hobby (obsession) and am saving up for a very expensive frag so I fully understand your disappointment", "NTA, you gave him every opportunity to back out of buying you a SPECIFIC ITEM that he would have known the price for in advance and he chose to tell you after you blew your money that he didnt get it for you", "ESH", "I can totally imagine how you'd be the asshole in his version: \"I knew she wanted the perfume, but I couldn't afford it. I tried giving her something nice within my budget and all she did was get mad at me\"\n\nBut you're totally NOT the AH here: if you really wanted something and even saved up for it, and then he literally tells you he already got it... Not a good sign, let's put it that way. \n\n100% not about the gift, but I would consider leaving over this lie.", "NTA.\n\nOn a slightly related note. Please make a retirement plan and go through finances. So many people are going to be absolutely screwed in a few years with wags stagnation and inflation. Save and invest what you can.", "NTA- \n\nI can't help but feel like this whole thing was premeditated to begin with.... Definitely seems like emotional abuse. Please don't stay in this relationship. \n\nThe skeptic in me is like, he probably saw this as an opportunity to confuse you, and then villainize you to everyone so you felt more isolated and reliant on him. It feels like he is trying to start financially abusing as well, and any time you want money, he'll paint you as a gold digger....Maybe I'm looking too much into it, but it feels super shady.\n\nEdit: grammar", "Straight to dumping? I think every long term relationship that started the the couple were young will have a few stories like these, if she wants to leave than she should, but I wouldn’t push her towards it.", "I had two boyfriends in a row who did similar stuff like this. They'd say \"oh, I'll do X for you,\" and then when X never happened, I'd be left disappointed. I wasn't upset about X. It was always the lack of follow through. \n\nMy therapist told me that people judge themselves by their intentions, and others judge them by their actions. That stuck with me. Don't date someone like that.", "Absolutely NTA and he sounds like bad news. He lied about having bought the gift already when you asked, and now won't take any accountability for his actions and badmouthed you to people who are potentially important to you. Unfortunately this type of behaviour won't be isolated to this event.", "NTA, your bf has shown who he is, leave him.", "This is a clear situation of right and wrong. There is no grey here. You had the money for it, you don't need him for the money. After what he did and everyone blindly siding with him will be your future. Not a single person in that situation could see past loyalty to him to see his transgression. If he did that to them, they'd be singing a different tune. \n\nThey obviously have a problem with your perfume collection or else they wouldn't judge you like this. Had you been an antique collector of coins and he got you a chocolate looney rather than a expensive coin you were saving for to buy yourself, they might not have dismissed his behaviour as easily (they might have if they were even bigger AHs bc people often don't care about others hobbies), but at the end of the day it's not what you wanted. It's what he wanted. \n\n1. He put you in a false lull of comfort\n2. He lied more than once\n3. Never felt remorse\n4. He has a gang of blind followers who don't have an ounce of care for you and a whole glass for him\n\nEdit to add judgement NTA and you should break it off, you're still very young and this isnt who you want to be the love of your life. You got a a lot more life to live and love to find", "I googled it :) - and - yes, the big bottles ARE expensive. But the miniature bottles are quite affordable, assuming somebody will spend the minimal decent amount of money for a present. I'm sure you would understand if he couldn't afford the big bottle, but bought the miniature bottle of the scent for you.   \nYour boyfrend is a lazy cheap lier.", ">It's actual gaslighting. \n\nMan....people throw this word around way to much. No, it's not. Gaslighting would be trying to convince her he never promised to get this gift or never said he had it etc.", "He said he bought it only after a later conversation and I’m imagining he was trying to not let her down because she didn’t tell him he accidentally agreed to buy a 200 or 400 dollar bottle of perfume before he knew the price.\n\nNo way someone agrees to buy that as a gift unless they didn’t know as a 21 year old on a shoestring budget", "They got baited by the title, and are mad they can’t rip OP a new one for what they thought was gonna be an extremely AHish post.", "He could have found out in less than a minute after making the offer, this internet thing has been there for a while.", "My daughter is using it - it's wonderful scent for a young girl.", "Oh come off it. You don’t think ESH because OP wasn’t “transparent” about the cost of a product. Your entire reply was a flimsy excuse to shit on OP for daring to want something expensive that you can’t relate to. That’s a boring way to go through life.", "Read the entire post again. She didn’t ask him to buy it. He offered to buy it, told her he already bought, told her to spend her savings elsewhere, but he never actually bought it. He had ample opportunity to concede it was outside his price range. Instead he doubled down and lied. If this was an ego trip on BFs part, then he is TA. What’s so hard to understand?\n\nETA:\nLol, you blocked me over that", "<3 for the out of the blue Arrested Development moment!", "As someone in their 30s, it’s a good scent for many ages 😅", "Exactly my point", "I can't help but laugh at how cuntish you choose to be over this. We're talking about two broke college kids one who thinks buying a 200/400 bottle of perfume is ok, then let her boyfriend shoulder that without informing him of the cost and then got annoyed when he bought a more reasonable gift. \n\nShould he have told her? Yeah, but I'm still wondering why she didn't tell him the price outright when he was clearly trying to make a big gesture for her and then realized her bougie ass thinks shes worth a bottle of smell-good-juice costing hundreds of dollars?\n\nFuck all the way off with your condescension, you insufferable lurch.", "They always are when they’re entire life is based around those things", "Using him for his money… what money lol he can’t even afford perfume", "I mean atleast he doenst try hiding it, I guess?", "So this story is not one sided? Is there not a problem with his friends seeing her as going for his money?  Could she be after money?  I never commented on his actions just he went to his friends for advice and they talked to her. We don't know if he told them to but he want to someone for help with a problem in their private business and so is she.", "Maybe there is more to the story.  Maybe she really is after his money and his friends now had a chance to call it out even if he was wrong.  All I was saying is he want for advice from his friends and family they went after her.  She went for advice from strangers aren't they doing the same thing because we only hear one side.", "The big bottle - yes.   \nBut he could buy this miniature bottle of the scent - quite affordable, and all in all the scent is what matters.", "1. You don't know what her life is based around \n2. No they're not\n3. You don't know her. You're just making assumptions and that's not a fair way to judge this since you're reaching outside of the information given to call her the a-hole.", "Like...that system could be in his pocket, maybe. Something wacky like that.", "i had a bf accuse me of that once. he was a line cook.\n\n\\#worstgolddiggerever", "LOL the petty part of me things OP should say this to his friends. :)", "Is the gold in the room with us?", "It could be one-sided. We will never know for sure. But I mean more so he is likely lying to his friends and family to make himself look better.\n\nThe truth is not always \"somewhere in the middle.\" Sometimes, someone simply lies. And someone is telling the truth. I wouldn't automatically assume OP is lying because she gives lots of details, specifics, and there is really no way he could clarify something to make himself look better given the sequence of events.\n\n>Could she be after money?\n\nThis guy is poor. You are reaching. He is the one that reassured her over and over again he would pay for something, and then didn't.\n\nListen, I think it's really obvious you have a bigger bias here at play. When you hear a story of a guy wronging a girl, you defend him at all costs, even if it makes no sense and you have to make up details for it to work out. Why do you think that is?\n\nAssuming all women are gold diggers, even when they're dating someone poor and not expecting much from them except for them to keep their word... shows you likely have a bias against women that you need to fix before it runs rampant.\n\n>We don't know if he told them to but he want to someone for help with a problem in their private business and so is she.\n\nAgain you are comparing apples to oranges. Talking to strangers vs. telling all your friends and family is way different. You know that, but you won't admit it because you're determined for OP's bf to be the victim. The idea that a girl can be telling the truth and the guy can lie, and actually be in the wrong, is offensive to you for some reason.", "I mean honestly for me this issue is that she had the money and she wanted to buy it for herself but she didn’t because he lied. In my opinion the cost is irrelevant.", ">but you won't admit it because you're determined for OP's bf to be the victim.\n\nOh no he was completely wrong.  Let me ask you tho what says he's poor.  She's asking for a bottle of perfume that's $500. I doubt he thought it would be that high maybe 200 or 300.  So for a 20 year old to call him poor is a stretch.  \n\n>Listen, I think it's really obvious you have a bigger bias here at play\n\nSo let's look at it.  I said he's wrong but looked at the whole picture because my comment was about the friends and family messaging her about family business.\n\nHe asked friends and family who got pissed and said she's after his money.  They know both of them so they have an educated opinion of her.\n\nShe asked strangers like you who call a 20 year old poor because they don't have $500+ for a bottle of perfume.  Which she didn't mention the bottle or price in the post I found it in the comments and looked it up.\n\nThey both are looking for advice in their private matter.  That's what I was commenting on.  He fucked up by saying he would get it then doubled down by not telling her.", "Agreed.. he lied saying he’d already purchased it (?! Like wtaf) i dont even have the words. Not “i’ll look into it” or something along those lines. Literally “i already *bought and wrapped* it”. I could never rely on anything that man says again"]}