{"id": 25830, "submission_id": "1650q5f", "title": "AITA for telling my boyfriend that he can't move in with me?", "selftext": " I (30F) have been dating my boyfriend, (32M) for about five months now. I own my home as I purchased it this February and it is my second home. I made a good amount on my first home and put most of that money towards this house. I have a good career making about 80K and my mortgage is $1500. \n\nMy boyfriend rents a room from his friend who owns a townhouse. His friend travels a lot for work and is hardly ever home. Maybe 1 week out of the month or so. My boyfriend pays $800 a month, which includes utilities. It's a nice place and my boyfriend makes good money as well, probably around 60-70k. \n\nSo recently, his friend was thinking about selling his townhouse and just moving in with his girlfriend. He told my boyfriend this, who then came over one night and sort of sprung all of it on me and told me that he should move in with me. I was really shocked as we have only been dating for five months and I really don't think that is long enough time for me to think about letting him move in. I tried talking about it with him and told him I needed some time to think it over. He was visibly annoyed, but let it go. \n\nSo yesterday, I got a text from him stating that his friend plans to list his townhouse in Oct and my boyfriend needs to be out by the end of Oct. My boyfriend doesn't have a lease or anything, but he texted me and said he needs to move in with me short term as that's not enough time to find an apartment. I texted him back and said we could talk that night. When he came over last night, he was ranting/begging me to let him move in. About how he didn't make enough money to get an apartment, and that it would just be less stressful for him to move in with me. That if he could help pay half than it would be good for me too, etc, etc.  I shut down that idea and told him we have not been together long enough for me to want to take that step. He got upset and called me heartless, and then left. \n\nHe texted me today and apologized, but still asked that I think about it a few more days. I told my friend and coworker today about everything, and he said that I'm an asshole for not letting him move in. I was really shocked, but my coworker kept going, saying that in this economy people can't afford to live by themselves and that five months is long enough to move in together. I didn't say anything, but just remained quiet. \n\nSo AITA for telling my boyfriend that he can't move in with me? ", "created_utc": 1693358343, "permalink": "/r/AmItheAsshole/comments/1650q5f/aita_for_telling_my_boyfriend_that_he_cant_move/", "score": 32, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My boyfriend says I am heartless for not letting him move in. I told him that I would not allow him to move in as I felt like five months was not enough time. My coworker told me I was an asshole, because five months is enough. The comment and my boyfriends words and actions are making me think that I am the asshole.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. 5 months is not long enough.  If things go south how do you get him out?  Will he have a rental agreement?  Then you have to follow tenant law.  If not, and he receives mail at your house, then it's a whole different issue.   His pushy nature and not respecting your clear boundry is concerning, too.  He can find a room for rent on Craigslist, he's just looking for an easy way out.  Hold your ground.", "NTA is he 32 or 12?  He’s throwing a tantrum. Let him, but decide how you feel about that.", "NTA. It's not your responsibility to give him a place to live. He's in his 30s throwing a tantrum. He can fuck off. If you're not comfortable with it, you don't have to", "NTA, Don't listen to your co-worker (and don't take relationship advice from them again). You're not obligated to take in your boyfriend. And his ranting, annoyed response speaks volumes about his character - like he can't take \"no\" for an answer.\n\nAlso, if you let him in for the 'short term', he's not going to leave.", "NTA. Do not let him push you around. His behavior about this is a series of red flags. You earn more and are a responsible homeowner. You’re still in the vetting stage of the relationship, and he should still be courting you. He also has 2 months to find a place, which should be enough time. He can likely find someone with a place looking for a roommate. Let him do that and then observe how he navigates being a new roommate.  If he’s smart, and is interested in a LTR w/you, he’ll respect your position, live elsewhere, save money, and down the line you can decide together if you have a future together.", "NTA sounds like they want to move in for convenience rather than actually taking that next step together", "NTA. His pressuring you when you’re obviously reluctant is very concerning behavior. It’s high stakes for you to let someone move in. A bad decision could have a huge impact on your mental health, peace of mind, financial and even physical health. Once he gets in it will probably be quite difficult to get him out. His being so overbearing here makes me suspect that he wants to take advantage of you. You have absolutely no responsibility to house a grown man, especially one you barely know.", "Good for you for standing your ground! He shouldn't have to move in with you just because of economic issues. Plus, if he can't afford to support himself, then what does that say about the long-term prospects for your relationship with him? \n\nYou're not his mother. It's not like you have an obligation to provide housing for him. He's basically just whining because he wants to save money.\n\nPlus, he makes enough money to be able to buy the townhouse from his roommate, I would guess. But that would mean taking out a loan and having the responsibility.\n\nBut even if he can't, he can certainly find a place to live with another roommate. People are looking for roommates to rent rooms from all the time, which is what he's doing right now anyway. So what's the big deal?\n\nAgain, you're not his mother. He's a 32 year old grown man and he should be able to take care of himself without whining and begging for you to give him a place to live as though he would be destitute and on the street otherwise, which would certainly not be the case.\n\nHe can easily find another place to live, and there are residency motels he could stay in in the meantime if he can't find anything soon enough. What would he do if he wasn't in a relationship with you? Would he just live on the street? No, he would find something.\n\nNTA", "NTA. It’s been only 5 months and he may not move out like he says he will. You are smart to say no.", "NTA. Your “boyfriend” is thirsty and opportunistic. If you’re not ready to live with him, you’re not ready to live with him.", "NTA. You aren't ready to move in together, you're not ready. He is an adult and needs to figure out his own housing situation. If he can't afford his own apartment with the amount he's making, he's bad with money as well as being manipulative and demanding.\n\nIt sounds like if you cave to his request, you will regret it for a long time.", "NTA. Tell the boyfriend to move in with the coworker.   You've only known him for 5 months, you have no obligation to him.", "Nta. Be careful. Listen to your gut. He’s a grown man, he can find a place to live or he can offer to buy the townhouse.", "NTA. You know your comfort level and boundaries. If five months is too soon for you, then it's too soon, and your BF needs to respect that.", "NTA\n\nNeither is your boyfriend, but your friend is. Listen, 5 months is enough time for some people to move in together and not enough for others. Your boyfriend is ready and interested. You are not. That's fine. You two had a disagreement that got emotional. That happens in relationships when goals/dreams aren't aligned.\n\nYour friend thinking that it is thier place to harshly judge a perfectly reasonable life decision is not fine.", "NTA -  If you are not comfortable with that, no Ody can or should try to force you to do that. \nWe are still in August and the friend asked to leave in October, so he has all September to find a new place. And what he said to you - Heartless- for not accepting something you are not comfortable todo, believe it. \nOn the other hand, before someone moves in with you, I think you have to talk about some important things: Will you make a lease? Will he be okay with it and willing to pay you rent if you have something on paper? Will you be comfortable with someone that you only have met for 5 months to have full access to your home and stuff? Will he and you share chores? Cleaning? Cooking?  What will happen if one of you want to invite friends or family yo the house? Will you share your room?", "NTA\n\nFive months isn't long enough, you're right.\n\nHe's got 2 months, which is plenty of time.", "NTA\n\nEven without a formal contract, in most states someone becomes a tenant after a certain number of days living with you and has to be evicted by a court. \n\nDo NOT let this guy move in with you.", "Nta. Super red flags. Its been 5 months, girl he's trying to pressure you into this. You will regret it if you do this, so no do not let him move in with you.", "Lady, go with your feelings. You aren't ready for this move, and there must be some good reason for that, possibly the fear that if BF becomes a housemate things will get rough between you.\n\nIt is also especially significant that he started calling you names when you told him no. And that is because...\n\nHe wants what he wants and he doesn't care what you want.\n\nStick to your guns and do not cave...and you will be see just how enraged he can be when he doesn't dominate.\n\nNTA", "NTA. He’s 32 and he wants to force his way into your house by throwing a tantrum?", "You need to upgrade your boyfriend and your friend.  5 months or 5 years, it is up to you to decide when you feel comfortable living with someone.  I know that for me 5 months would be far too early to let someone into my home.  Your boyfriend appears to be using this as a way to rush the relationship, and he is not taking being told \"no\" well.  This is a red flag.  \n\nNTA", "NTA. This guy sounds like a walking red flag. He didn't ask if you could help him temporarily while he gets on his feet, he *told* you he should move in after just 5 months, and then called you heartless when he didn't get his way. It's not as though he's about to become homeless. He has time to find another room to rent. And maybe I'm just being overly cynical, but he sounds like the kind of guy who would get settled in and then decide he shouldn't pay rent unless he's on the deed, and call you heartless for demanding money from your boyfriend.", "No no no no no he will never leave. Do not give an inch on this. NTA.", "NTA.  This doesn’t seem healthy.", "NTA, and his reaction is extremely concerning. You should very well reconsider the entire relationship. What a giant red flag", "NTA and run. Someone who behaves as though his inconvenience is your emergency isn't going to suddenly grow up and become a reliable partner.", ">saying that in this economy people can't afford to live by themselves\n\nHe can share a house with a roommate that is not you then\n\n>and that five months is long enough to move in together.\n\nIt is not.\n\nNTA", "NTA.\n\nWait at least a year before you move in with a partner.", "NTA, at all.  Moving in with someone completely changes the relationship dynamic and that’s a step that should be planned and thought out in advance.  Nobody should take that step if there is any hesitation or doubt.  Your bf’s situation sucks, but he can rent a room somewhere else if he can’t afford his own space.  He was completely out of line for pressuring you and reacting that way.  5 months is nothing.  I hope you realize that your bf sounds very immature and think long and hard about whether you are on the same page and truly compatible.  Good luck op.", "Five months is not long enough to move in together.  I'm sure there are cases where it works but FAR MORE cases where it's pure disaster.", "NTA  you'll regret it if you let him move in - he can't even afford an apartment on his own at 32, he's not asking but demanding and he's more than willing to leech off of you. If a good friend came to you in this situation and asked your advice, how would respond? I think you'll have your answer.", "NTA. The amount of time is irrelevant it's all about whether or not you feel ready and comfortable with the move. Some people are comfortable immediately and others need a lot more time. \n\nTell him to start looking for another shared space that is not your home as you are simply not ready yet. If he can't afford his own place then I guess it's time to find a new roommate. If you feel this way, you could also tell him you can see it happening at some point but will not be rushed into the decision due to this sudden change in his living arrangement.", "NTA and five months is not long enough to let someone move in.", "NTA", "NTA. You get to decide how long is long enough to have developed the level of trust necessary to live together. No one else can make that decision for you.", "NTA: Absolutely do NOT let that man move in. The way he’s pushing is very telling. He makes more than enough to have his own place, he’s just being cheap and might be financially irresponsible.", "Dump his homeless ass", "I dont think you should move in with anyone until you are engaged, especially if its into a house you own.  This has nothing to do with morality or religion, im just older and have watched so many people stay in bad relationships due to living arrangements and money. Or go thru the headache of having to kick out an ex which usually ends up being cash for keys situation.\n\n5 months is way to soon, you barely know who each other are.\n\nWhat if he moves in and you realize you are not compatible, worse you realize and he doesnt.", "NTA. Heck no.  Hold your ground. You barely know each other. He called you an asshole. Break up with him. You deserve someone who respects your boundaries and doesn't verbally abuse you.", "NTA asking to move in at 5 months isnt necessarily a bad thing(bc his specific situation and yeah economy), but his lack of respect of your boundaries is. how he behaves during this transition will be very telling. calling you heartless for reasonably saying no/lets discuss this more is not a great start", "NTA. If you feel 5 months isn't enough time, then it's not enough time. If this is the way he's gonna act, then you should probably just find a new bf.", "NTA. Trust your instincts. Getting guilted into anything, especially a major decision like that is almost never in your best interest. You have clearly made good choices in your life up until now. \nSaying “Only 5 months” indicates you don’t actually know him well enough to cohabitate. That should be all there is to it. If he can’t respect that in this situation then he doesn’t seem to have any real ambition for a long term relationship anyway.", "NTA\n\nDon’t let your bf manipulate you, and stop talking about personal stuff to your coworker. She is NOT your friend. The economy does not make you responsible for a guy you’ve been dating less than six months.", "NTA, no explanation needed to say no.", "NTA because it's your decision to make. Slight red flag on him pushing so hard (even now he's trying to play it sweet to get you to change your mind). If you don't want to move in with him yet after just five months then don't. Take your time.\n\nWill he respect your decision or continue to push?", "NTA. It's your home and you have every right to tell him no regarding living there, but he has a basic need (shelter) that you could help him with, but won't. Don't be surprised if he moves on to someone else.", "ur not obligated to take him in/let him rent but be aware of the consequences. its ur right of choice. NAH as i dan understand the pressure. but where yall live where i can purchase a house with 80k job?!", "NTAH. 5 months is not enough time for u. Go with your gut it don’t lie. Tell him to start looking for a place just nothing to high. Offer to go with him apt looking and settle on a one bedroom place.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n I (30F) have been dating my boyfriend, (32M) for about five months now. I own my home as I purchased it this February and it is my second home. I made a good amount on my first home and put most of that money towards this house. I have a good career making about 80K and my mortgage is $1500. \n\nMy boyfriend rents a room from his friend who owns a townhouse. His friend travels a lot for work and is hardly ever home. Maybe 1 week out of the month or so. My boyfriend pays $800 a month, which includes utilities. It's a nice place and my boyfriend makes good money as well, probably around 60-70k. \n\nSo recently, his friend was thinking about selling his townhouse and just moving in with his girlfriend. He told my boyfriend this, who then came over one night and sort of sprung all of it on me and told me that he should move in with me. I was really shocked as we have only been dating for five months and I really don't think that is long enough time for me to think about letting him move in. I tried talking about it with him and told him I needed some time to think it over. He was visibly annoyed, but let it go. \n\nSo yesterday, I got a text from him stating that his friend plans to list his townhouse in Oct and my boyfriend needs to be out by the end of Oct. My boyfriend doesn't have a lease or anything, but he texted me and said he needs to move in with me short term as that's not enough time to find an apartment. I texted him back and said we could talk that night. When he came over last night, he was ranting/begging me to let him move in. About how he didn't make enough money to get an apartment, and that it would just be less stressful for him to move in with me. That if he could help pay half than it would be good for me too, etc, etc.  I shut down that idea and told him we have not been together long enough for me to want to take that step. He got upset and called me heartless, and then left. \n\nHe texted me today and apologized, but still asked that I think about it a few more days. I told my friend and coworker today about everything, and he said that I'm an asshole for not letting him move in. I was really shocked, but my coworker kept going, saying that in this economy people can't afford to live by themselves and that five months is long enough to move in together. I didn't say anything, but just remained quiet. \n\nSo AITA for telling my boyfriend that he can't move in with me? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Tell him that he should put in an offer on his friend's place. No is no. Don't do anything you're not comfortable with.", "Never let a man move in with you. Period! NTA. Keep your boundaries.", "NTA.\nBut if you’re interested in that relationship you may let him stay with you temporarily so that he can have time to have a good look for the next place to stay.\nAnd if not — just don’t worry about the things your colleague says!", "Nta  this is not unreasonable at all and honestly 5 months is nothing.  Calling you heartless is very worrying", "NTA. You're the only person that gets to decided if you're ready to take that step with him or not. Clearly, you're not ready for that so don't let people push you into making that decision. Personally, 5 months is way too short. you just barely know the person as a partner", "NTA. I understand that he is stressed about his living situation, but 5 months in and he’s looking to you to solve his problems and getting angry when you won’t? These are big red flags.", "NTA. Personally, I wouldn't consider cohabitation until the relationship had been going on for more than a year. Even then there would need to be discussions and written agreements about rent and how utilities would be slplit, and whether or not the toilet seat being left up is grounds for eviction, along with other \"house rules.\"\n\nFive months is waay too soon to allow him into your home, even on a temporary basis. If he cannot respect that, then you know your decision was definitely the correct one.", "NTA- You're not ready for him to move in and that is the only thing that matters. He has plenty of time to find a new place to stay, he shouldn't be trying to pressure you into letting him stay with you, even if he says it's temporary. If he can't respect your decision about him not moving in, then maybe this isn't the relationship for you. You have more to lose if things go south after he moves in and harder to get him out once he's established residency at your house. And there have been too many stories on here where someone let their SO of a few months move in, never moved out but got taken advantage of.", "Actually there is no such thing as “long enough”.  Even if you’d been together for years, if You don’t feel comfortable with him moving in, then he doesn’t get to move in.  You don’t owe him anything.\n\nPpAnd given how entitled hes acting, your gut seems correct here.  It will not go well.", "Yep!  OP is not a social service that has to provide him with housing.  If he can’t afford an apartment he should find a roommate situation.  NTA", "With the way he's behaving OP should be grateful if he moved on to someone else.", "He would be doing her a favor for sure."]}