{"id": 26012, "submission_id": "167am9g", "title": "AITA for telling a girl \"you need to eat less\"?", "selftext": "Throwaway account.\n\nHey reddit! I (16F) recently participated in a summer exchange program and went to abroad to a foreign country to study for the semester. Over there, I had a great time, was on good terms with my host family and friends, except one girl.\n\nThis girl had a different body type to me, she was slightly bigger. (I don't mean this in a rude way, she just was,). I do a lot of extracurriculars that require exercise so I stay in shape. The entire program, I had a feeling she hated me.\n\nAnything I said, whatever I did, she always found a way to say: \"Yeah it's because you're so skinny.\" and even went as far to call me \"anorexic\" when I told her I was on a diet. (This is a healthy diet recommended to me by medical professionals).\n\nIt kinda made me uncomfortable. Once, I suggested going swimming and she said, \"Of course you'd want to go swimming, you're the tiniest person here, you can show yourself in a swimsuit.\" Like, jeez.\n\nThere was one phrase she used, A LOT. \"You need to eat more.\" I have a small appetite, and I eat less than her, it's not that big of a deal girl...\n\nBy the last day, I had had it. It was my last day, I was so sad, I didn't want to leave my friends, and I wasn't feeling hungry. It was around the 50th time she told me, \"Girl, you need to eat more. I can like see your bones sticking out.\" and I freaked out.\n\nI was having a bad day. The last thing I needed was to deal with her, so I responded, \"Yeah? You need to eat less you fat f\\*ck.\"\n\nShe was shocked, and I left before a response. She texted me later and said she was shocked how fatphobic I was being and she's glad I left. She even got her parents to text and call me to yell at me.\n\nI am feeling bad, AITA reddit?", "created_utc": 1693582970, "permalink": "/r/AmItheAsshole/comments/167am9g/aita_for_telling_a_girl_you_need_to_eat_less/", "score": 531, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Insulting her body type like that, knowing she was insecure about her body may have made it worse for her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I had an entirely different opinion after reading just the title but: NTA\n\nShe can't just insult you all the time and expect you to smile and nod. If she doesn't want to hear commemts about her weight, she should not have commented yours all the time.", "NTA. Its pretty much justified. I do not condone fatphobia or body shaming in general. Seeing the title made me think that you were the A hole. Her saying that already had changed me whole perspective on this situation. Anorexia is a serious condition and should not be made fun of. She honestly needs to grow the f**k up. If she can't handle bodyshaming then why does she do it? Shes a degenerate.", "NTA \n\nShe shamed you (out of jealousy) 50 times and you responded in kind. Totally deserved!", "NTA she started it", "NTA. She started this by provoking you throughout the whole trip. And body-shaming goes both ways. It’s not okay for someone to make fun of a person for being smaller.", "NTA. She was bodyshaming you. If ahe can't see that, not ur problem", "NTA. Your response was funny.", "INFO: Did you say anything to her about her comments prior to this?", "ESH. She sucks, but so does your reaction. You handled the situation poorly.", "NTA. She made fun of your body and  made DISGUSTING comment on your appearence. Your answer was pretty tamed compare to what the most of us would have said in your place. The one saying otherwise must be like the other girl and openly bodyshamed skinnier people, wish is  terrible.", "NTA in future leave the host family if you have problems", "Did you talk about it with her earlier? Like that you dont like what she is saying you?", "ESH\n\nShe for obvious reasons. You for your OTT reaction by swearing at her. You shouldn't have kept it all pent up until you burst. You should've clearly and firmly told her- ideally in front of others also- something along the lines of \"stop commenting on my body and eating habits. You're body shaming me and you need to stop\".", "NTA she kept attacking and making rude remarks about yout appetite and looks. She can dish it but not take it?", "Esh she shouldn't have kept saying those things to you but \"fat f@ck\" was also out of line.", "NTA. She bodyshamed you badly, didn't care abount boundaries. Well, mess around and found out. What you say was obviously not nice but maybe this girl needed that reality check", "She had no right to be commenting on your body and diet all the time, clearly, you were triggering her issues but it's not your fault (from what you tell us). Your exit line was funny and yeah, fatphobic, but considering her behavior she had it coming. NTA, assuming that you're not conveniently leaving things out and also assuming that you let her know her comments were annoying you before escalating to the \"fat f\\*ck\" line.", "Nta.\n\n And for those saying that she should stick up for herself, she was in another country with a host family. I bet nobody told the other girl to shut it and considering her AH parents reaction how many of you wouldn't also just explode on the last day. The other girl is a bully and no bully gets to cry victim when their target fights back.", "NTA, the only reason I'd consider ESH is due to the fact that you didn't stick up for yourself sooner. \n\nPeople like her are completely rotten, no heart to heart  or appeals to emotion will work here. You were completely in the right to get nasty, I think you could have even gone in for a lower blow. She has a mental disease caused by everyone around her being too damn nice, a couple cruel words will do wonders for her condition.\n\nI wouldn't take it too hard over how her parents reacted, it is very unlikely she told them the full story. Don't apologize, you'll only be enabling future antisocial behavior.", "NTA\n\nI don't understand how someone could think ESH, you were taking the hate from her for way longer than you should've. Even though you stooped down to her level, she deserved it. I'm proud of you for standing up for yourself.", "ESH\n\nShe is way out of line for continuing to make you uncomfortable commenting on your body.  She obviously has issues and I hope she gets help.\n\nYou know why you're TA and it sounds from the comments like you're going to apologize and move on.  Good for you.", "ESH.\n\nShe was out of line and so were you.  There were better ways to handle this.  Instead, you stooped to her level.\n\nBodyshaming isn't cool regardless of body type.", "ESH.  \nYes, you're justified in feeling angry and annoyed when someone is taking out their obvious insecurities on you - she is definitely an asshole for that.  \nHowever, you did not need to respond in kind, and by doing so, you made yourself an asshole as well.  \nBeing able to put up with other people acting ridiculous without sinking to their level is an important skill in life, and reacting negatively to other people also shines a light on negative aspects of yourself. Don't let people get to you like this - understand that this person is saying things to you because she is deeply insecure.", "NTA. She poked the bear and saw the results", "I was you at that age.  Genetics. 100lbs when I graduated HS.  University my roommate asked my how I \"dieted\", and if I throw up my food.  Nobody believed me.. and I've never thrown up there period.\n\nI'm late 30s and 130lbs now.\n\nIt pays off ;)  they are jealous.\n\n Not 4 days ago I got told by a 300lb woman I need to \"gain 30 lbs.   (Edit:  BTW she was gorgeous and I had no judgements until she brought up weight)\n\nImagine if I told her to lose 30..\n\nWhen ppl keep it up they're asking for it.", "NTA and ignore everyone saying ESH\n\nSome people need to be put in her place and that's all you did.", "ESH. \n\nWhile it was satisfying, body shaming her doesn’t actually show her why her behaviour was wrong or get her to stop doing it to you/others. You just sank down to her level.", "ESH.  Although I know it is hard to do, you should have called her on her comments at the beginning.  It doesn't sound like you did anything to talk to her about how her comments made you feel, and then to explode on her at the end was a bit much.  I understand why you did it, but you can't ignore something for weeks and then blow up finally and expect that you're going to be excused because of someone else's behavior.", "YTA, but sometimes you need to be and it's fine to be an asshole in life 🤷🏻", "ESH  \n\n\nBody shaming is bad no matter which way it goes", "I'm going with ESH. That girl was way out of line, and I suspect she was feeling insecure (this explains, does not exonerate). You swallowed her insults until you couldn't take it any more and exploded like hot lava.  You are young, and you have time to think of a calm response for next time someone says something insulting to you. TBH, it probably would not have ended well, regardless; the important thing is that, going forward, you feel you did your best to honor who you are.", "esh", "NTA. \n\nHowever, I am concerned by many of your comments. Specifically you being on a diet while already small, claiming you aren’t hungry many times, your almost idealization of thinness. Be careful. EDs can be triggered at any time. I don’t care about that bully, but I am slightly worried by your attitude. Take care of yourself.", "ESH. I was on your side until “you fat f*ck.” You know that was wrong.", "ESH. You were poorly treated for months. But as others said,  the last part of your statement pushed it over the edge in AH territory", "My question is…did you address it with her the first 50 times she said it? Or did you keep your feelings bottled until you exploded at her like you did? If you never addressed the issue, then how was she to know what she said was bothering you like it was? If that’s the case then you are TA. If it was previously addressed and she just ignored your feelings about it then she is TA.", "NTA \n\nshe body shamed you the whole time, completely out of jealousy, and you lost it in the last nerve, you had the reason to do so", "I was so sure you were in the wrong, but then I read the story. NTA. She pushed and pushed. She wouldn't stay off that topic, and you finally exploded.", "ESH - you both were body shaming each other.  Not appropriate.", "ESH, but she’s more of the asshole then you because she started it. She was saying that stuff because she is obviously jealous of your body and insecure about being big. She shouldn’t have started it. She was being a bully. You can only push people so far so I don’t blame you. \n\nYou kinda suck a little but barely, because you went nuclear on her by calling her a fat f$ck, which is completely understandable. It’s going to be hard for her to recover. That might scar her for life. 🤷🏼‍♀️ I know, boo fucking hoo. 🎻🤏🏼\n\nBut seriously, even though you got to tell her off it may cause you more confrontation in the long run. Problematic people like her are just baiting you so it’s best to choose your words more carefully because they are just looking for a fight. They want to be the victim and you just played right into her trap. Now she is getting her parents involved, drama drama drama. Now she can pretend to be bullied by the skinny pretty girl and get attention. But it’s ok. It’s a learning opportunity. Next time don’t fall for this. Next time people like her pull this crap just agree with them and be like “yeah I work hard for this body”. 💅🏼", "ESH. Yes, she was way over the line but you could have reacted in many ways. The one you chose makes you an AH. She clearly has some deep-seated issues and you have made those a lot worse.\nEdit: In response to the comments, there is no doubt the other girl was a major bully and I’m in no way condoning her behavior, but OP had so many choices in how she acted and spoke. She chose the absolute most AH way to react and escalated the situation.", "NTA- \n\nI hate how many people think things are “fat phobic” but when it’s about someone who isn’t overweight they call it attention seeking. I’m tall and when I was younger and going through growth spurts I was a little thinner (not quite underweight) and every girl I ever met who was a little on the heavier side would always find a way to bring it up in a passive aggressive way.  \n\nSounds like this girl just got a taste of her own medicine", "ESH\n\nYou don't get a free pass just because she started it.", "ESH... I do feel for you, I was very skinny during high school and had to endure the same comments and couldn't say a word, because most people consider only comments about someone's weight as insulting if it's about fat person - like telling someone they should eat more, when they eat normally, is compliment and not an insult.\n\nHowever, you can't be angry at what she told you, when you did the same - your response was very harsh, esp. because you nowhere say anything about her eating too much.", "Things that never happened for $2000 please.", "ESH.\n\nWould have been NTA if you didn’t add “fat f*k”", "Two wrongs don’t make a right. ESH", "NTA. Don't dish it out if you can't take it.", "NTA. Thinphobic is a thing too.", "ESH- she shouldn’t have been constantly commenting on your body and eating habits and you didn’t need to name call her. Being frustrated or fed up still doesn’t justify our bad reactions.", "i laughed out loud at that final response, and that's coming from a fat f\\*ck XD i think she deserved it!", "ESH. you both bodyshamed each other, but you were pushed to the edge so she is more of an AH than you were and she is a bit hypocritical for getting so upset at what she’d been dishing out. but imo being fatphobic or resorting to any sort of bigotry to defend yourself is not okay, especially when the weight is so different on a societal and discriminatory level. \n\nskinny people are definitely allowed to be insecure and no one should be shamed for their natural body, but it’s also important to remember the imbalances outside of interpersonal matters. you were right to defend yourself, but just call her a bitch next time.", "ESH - you both attacked each other. Whether or not one of you deserved it probably depends on the perspective of the storyteller.", "If only she did a star jump every time her insecurities judged someone.. nta", "NTA, shutting down a person who constantly insults you isn’t asshole behavior. She got what she deserved.", "NTA. Skinny shaming is just as bad as fatshaming. She fucked around and found out", "NTA.\n\nFrom what it sounds like, she's just randomly biting at you while you're minding your own business. I think she went far by saying you're \"anorexic\".\n\nI almost voted E S H because of the \"fat f*ck\" thing but again from it sounds like, she clearly started it and she got mom and dad to defend her. 🤷‍♂️\n\nI recently learned that people don't like to get called skinny and despite my bubble gut I still know how it feels being called fat or skinny.\n\nEdit: forgot to say why I almost voted E S H", "ESH, with a close Y T A. Repeated, unkind, and/or callous comments about size are unnecessary for ANYONE. She didn't need to harp on your physique and you certainly didn't need to fat shame her. I get how irritating and rude she was, but in the long run, responding as you did does damage as well.", "NTA\n\nShe was pathetic for insulting you out of jealousy, you responded to her the best way possible. Have a good day, ignore the idiot", "Just because there's something she doesn't like about herself doesn't give her a license to rip into everyone around her.  As the saying goes, those who live in glass houses shouldn't throw stones.  Only thing she proved is she can't take what she dishes out on a regular basis and is a hypocrite regardless if she's skinny or fat.\n\nNTA", "NTA\nyour 16 I do not expect you to put up with such bs. though she could just be concerned about your health (Then NAH)\npeople don't expect adult level maturity from f'ing kids", "Hahahahahaha NTA.\n\nShe got what was coming to her. End of story.\n\nYou're hilarious.", "i dont know why people are saying ESH. she fucked around and found out. thats simply life. NTA", "ESH\n\nJust because she felt the need to comment on your body, doesn't mean you have to stoop to her level and comment on hers. You could've chose to be the bigger person and let it go, but you only made the situation worse. People struggle with body image on both sides of the spectrum, and it should come from a place of understanding and education instead of petty name-calling.", "ESH.\n\nNothing she said was right or appropriate, but that is separate from your response here. \n\nYou could have addressed her body shaming without fat shaming.", "ESH bc while she deserved it, you simultaneously insult everyone else her size who didn’t deserve it. That’s the whole problem with insulting people’s appearances.", "Everyone has a biting point, you reached yours.\n\nNTA", "NTA\n\nThat girl is immature and very insecure about herself and her body. She made these comments because of her self esteem issues and she was probably jealous of the way you look.\n\nI get why you snapped, I probably wouldn’t have called her a F** F*** though. But it was the heat of the moment.\n\nI would apologize for the comment but point out her comments and behaviour. Tell her it’s not your fault she’s insecure and that she should keep her nasty comments to herself and work on her own body and issues.", "NTA: \n\nGirl: I am going to insult a girl I barely know for being in shape\n\nOP: snaps, bites back (no pun intended)\n\nGirl- WhY sHe GoTtA bE fAtPhObIc FoR?", "Yeah YTA. It sucks to be made fun of for your weight and appearance, that wasn't cool of her at all. And then you did the same thing, except fat people are more likely to be killed by medical neglect and abused by those in their life so you went lower than her. It's not at all an exact comparison because they are two different issues, but if a person of color were to poke fun at a white person for being so pale and then that white person retaliated by saying the same things racists do to attack people of color we can all recognize the white person went way too far. \n\nYou should've gone after her personality or just hit her but you went for fatphobia and that's why YTA", "Pretty clear cut ESH I think.", "NTA. Do you think she deserve an apology after saying those things to you for uncountable times? You are guilty and feeling remorseful because you know how bad those words are, but will she ever feel the same? \n\nIf anything happens, tell them what she did, and tell them you will apologize only when she apologizes to you first.", "NTA. You played an Uno Reverse and she cried about it after racking you with multiple Draw 4's.", "NTA She started it.  Weight shaming goes both ways.  She needs to stay in her lane or be prepared for a sideswipe.", "NTA, based on what you've said, but as someone who has struggled with my weight my whole life, I can assure you that she has endured digs from skinny people her whole life. People are way kinder to underweight people than overweight people. Even doctors and other \"professionals.\" \n\nSo, maybe try and be empathetic in the future, and instead of attacking, just say that you don't think anyone should be commenting on anyone else's body. \n\nUnless, of course, there were some micro-agressions on your part. Then, totally YTA. Which, honestly, based on experience, I doubt there were not some sneaky, rude, or triggering comments from your end. But, maybe you're one of the good ones. 🤷‍♀️", "NTA. Fatphobic is some nonsense. She's responsible for her own weight and she's clearly trying to bring you up to her (weight) level.", "NTA fat people need to stop doing this", "YTA. And then everyone clapped.", "[deleted]", "If not for the insult I'd have gone n.t.a, but this is a ESH.\n\nYou stooped to her level with the insult, a simple \"you need to eat less\" would have done the trick enough.", "What country was this?", "NTA - but, I reccomend speaking up for yourself before you explode. You don't need to put up with someone being mean to you like that. \n\nAfter the second time I would say something.  \"Please don't comment on my body, it's rude.\" Then if she wont stop, get petty!  Her jealousy is not your problem.", "Nta because she had it coming. It’s sad she’s got insecurities but she can’t project that onto others.", "Yeah, you broke.  She made you run out of fucks to give.  NTA.", "NTA.\nSo she can insult you but the tables turned...suddenly it's wrong for you? Huge NTA.", "Not gonna lie, you had me in the first half. NTA, based of what you wrote, the other person habitually spoke to you in condescending and disrespectful way “ you need to eat more”. Only to be offended, when you in essence,  gave her a taste of her medicine. For the life of me, I will never understand people who interact with others without a filter, and expect to handled with “Kid gloves”/ undeserved respect.", "She wanted to illicit a response and hated the one she got. NTA", "In general you shouldn't tell people to fuck off\n\nBut if someone says \"fuck you\" for no reason then you should definitely tell them to \"fuck off\"\n\nThat's what happened here. NTA", "NTA. I was kind of heavy growing up. Sedentary, midwestern lifestyle with lots of food and everything centered around eating. I was proud when I became more active, ate better, and lost weight.\n\nBut my family back home kept making remarks like \"Oh wow, you're so tiny you're just going to blow away.\"\n\nAnd it's funny how unacceptable it is to fat shame people, but it's perfectly OK to skinny shame someone. Honestly, she got what she deserved for bullying you the entire time you were there.", "You have a lot of patience for a 16 year old.\n\nNTA.", "NTA. Double standard bullshit. There's no difference in calling her fat when she calls you skinny, especially when she complains about it like it's your problem. She controls her weight, but would rather complain than do something about it.", "ESH, admittedly much less so on your part. You two were both participating in body shaming. She started it, you finished it. I hope she gets help for her self-esteem, and I hope you take the advice of those who suggest that you set a hard boundary with a person acting like that before it gets out of hand and you react in a way that could put any blame or malice on you. And I wouldn’t even say you have anything to be ashamed of even if you were a bit of an AH, because this is just a learning moment.", "Based on the information provided, ESH. With a tiny bit of extra information, I'd probably switch to NTA.\n\nI think we all agree that she was out of line for commenting so often about your body in so many different ways. \n\nBut friend, based on your description, you never asked her to stop. It seems like you literally went from zero to 100 in a split second.  So it might seem to her and her mother that your explosive insult came out of the blue.", "I’ll say NTA bordering on ESH. You were 100% justified in putting her in her place, but that wasn’t the way to do it. The comment you made wasn’t just “You’re being a jerk, cut it out” how you intended  it; it wasn’t just “You’re fat and fat people are gross” how she took it; it was both at the same time, regardless of your intentions. Did she deserve to be dressed down? 100%! Was using the language of body shaming, even in an ironic way, the best way to do it? No.", "YTA. The only reason I am saying this is because it is FARRRR too common for people to deal with insults like this and try to ignore it, only to blow up and say something actually mean. Instead just stand up for yourself from the beginning!!!!! Tell her after every comment that you don’t appreciate it, it’s rude, and it makes you feel bad. If she doesn’t stop escalate it to her parents and make sure they know how uncomfortable you are. If at that point you yell at her or say something mean, it’s kind of understandable. I just can’t believe the amount of people that ignore mean comments until they snap. That is NOT healthy.", "While I don't for a moment agree with what you said to her, I find it HILARIOUS that she thinks it's perfectly acceptable for her to comment about YOUR body and YOUR went and what YOU eat, but once the tables are turned, the pearls get clutched?  You took her shit gracefully and silently but the second you snap, YOU'RE somehow the asshole?  That's not how that works.  I'm not at all happy about what you said, but NTA.  She shouldn't start something she's not prepared to finish.", "body shaming goes both ways. had she made the remark once or twice, ok let it pass.... she's insecure. but constantly attacking your body shape, screw that, you couldn't take it anymore and honestly you do not have to feel guilty at all.", "Nah NTA she was body shaming you every chance she got. Tel that to her parents. If she doesn’t want ppl commenting on her weight then she should stfu about other ppl’s bodies", "NTA - she had it coming. You can’t go around commenting on other people’s bodies and get all pissy when the same is done to you in return. I do think you should have told her parents that she was making inappropriate comments so they could have stepped in and intervene before all hell broke lose (assuming they are good parents). But anyways, I don’t feel bad for her one bit.", "Mildest YTA for the \"fat f**k\", not for telling her to eat less after she's been pestering you. Context really is everything here.\n\nBut I do worry about the fact that you're 16, normal to small size, and on a diet, even if medically recommended. By whom for what?", "NTA. She fucked around and found out.", "ESH. I think people miss the point of this subreddit. She was an asshole, you were an asshole back. That’s TWO whole assholes (what kinda genetic fuckery is going on here?)\n\nYou were justified in your outburst but it was still a dick thing to say.", "lol.. nta", "NTA, don't dish it if you can't take it. Now she might know how you felt and there's a sliver of hope she'll think twice before imparting her \"wisdom\" in the future.", "Back when I was in school I had a severe weight problem. No matter what I did I just could not gain any weight. I mean I looked like I was starving myself despite eating more than anyone I knew. Hell my parents even had me tested for worms and other parasites it was so bad. Anyway there was a girl with the opposite problem I had and 1 day she just walks up to me for no reason and says \"you know you're disgustingly skinny!\" And my response was \"well your disgustingly fat!\" And she ran away crying I did not feel bad in the slightest because she started it. Same thing as what happened to you if this other person doesn't like people making comments on their weight then they should not be commenting on others because that tells everyone that they are ok with weight jokes", "NTA. She couldn't help but continue to comment on your body in a derogatory manner so she shouldn't be upset when you give it back to her. Also, calling someone anorexic is way over the line for a multitude of reasons. Classic case of a hater who can't handle taking her medicine.", "NTA she's insecure af about her weight, that's why she's projecting and making all those rude comments. If she don't wanna be said about the same things, she should put effort into keeping good shape.", "NTA\nIf she doesn't want people commenting on her weight then she should keep her mouth shut about the weight of others. \n\nShe's a hypocrite. She thinks it's completely fine for her to harass you about your body and eating habits because you're skinny but that it's not ok when you strike back in defense of yourself. \n\nCould you have handled it better? Probably but I think you already know that. Like you could have tried talking to a trusted adult about the situation before hand, perhaps even her parents may have behaved and treated you better if you had been the first one to talk to them about the situation before this last straw. But all that's a moot point now. \n\nShe kept harrassing you so she has no right to cry now that you snapped nor was it ok for her parents to treat you like this. If anything her parents should have talked to your parents and then your parents could have had a discussion with you about what happened. What they chose to do instead of that was wrong", "NTA \n\nWell deserved. She kept bodyshaming and humiliating you.", "NTA.  Her parents should be parenting her, not you.", "NTA.   \n\"You need to eat more\" is just as hurtful as \"you need to eat less\" and given how many times she insulted you before you did so in return, I'd say it's more than fair. Body shaming goes both ways, and it isn't okay to make fun of someone for being slim JUST AS MUCH as it isn't okay to make fun of someone for being bigger.", "NTA she needed to stop commenting on your body.", "NTA, she had it coming. \n\nPlease ignore the people who are trying to make you feel bad or telling you you’re fat phobic.", "NTA. When I read the title I was thinking YTA but after you told me about all the shit she said to you, I completely changed my opinion. You are NTA for giving her a taste of her own medicine. Also ignore the people saying ESH.", "Why are you a thin 16 year old on a diet recommended to you by a physician?!?", "ESH  \n\n\nboth of you for body shaming the other", "ESH she was wrong, and a bully and deserved to be called out. You did it the wrong way though.", "ESH. You didn’t need to go there, but I don’t blame you much for doing it. It’s hard to be the bigger person in these sorts of scenarios. All you’ve done with that comment is reaffirm that unwarranted commenting on people’s bodies/lifestyles is acceptable.", "NTA\n\nFat people don't get to throw slurs and pester folks of less girth without repercussions.  She kept bringing the topic up, she earned that retort.", "NTA you simply revealed \ntheir hypocrisy", "NTA.  She sounds toxic as hell.", "\"This girl had a different body type to me, she was slightly bigger. (I don't mean this in a rude way, she just was,). I do a lot of extracurriculars that require exercise so I stay in shape.\"\n\nYTA...if you're so \"active\" that you stay in shape then why would a \"medical professional\" tell you to go on a \"diet\". That sounds counterintuitive. If you're active, then you don't need to be restricting anything. \n\n\"Yeah? You need to eat less you fat f\\*ck.\"\n\nAside from that, commenting on anyone's body (whether it's related to weight or how they dress or anything), that makes you an AH. You have no business shaming anyone about their own body.", "ESH\n\nShe should not be body shaming you\n\nBut you should not use profanity.", "Yup, YTA. Don't try to justify being a shitty person to other people, just because you were having a bad day.", "ESH you both body shamed each other.", "NTA, skinny shaming is just as bad as fat shaming", "You are not the ah here. She was a bully that used your weight to feel a little better about herself.", "NTA and I'd say don't take the ESH comments to heart OP, I don't know if you told her to stop before but honestly I don't think it matters as much as people make it out to, IMO no normal person would call someone skinny dieting \"anorexic\", or make the swimsuit comment. I doubt telling her stop would've achieved much, the things she said aren't things you say in good faith so I really can't fault your response", "NTA. I'm absolutely tiny due to my natural body type and severe illness. I constantly get comments , I mean day in day out for about the last 20 years. \n\nI feel if you're skinny everyone thinks it's fair game to comment on your size but god forbid a skinny person says anything to someone who is fat!\n\nI wouldn't dare do what you did because I'm too much of a coward. I just take the comments about my size and will just say yes I know I'm small I have bowel disease. But I WISH I had the nerve to make a comment like you did because it's definitely what I'm thinking in my head!!", "NTA. And honestly, I can relate. My mom would constantly tell me that I am way too thin and need to eat more. It's so annoying! Dude, if I made a comment about her weight, she would lose it and tell me \"you have no right to make comments like that about me!\"", "NTA \n\nYou could have phrased it nicer bu to be honest she had it coming. I would have told her to stay off my plate way before you", "NTA she came at you first and projected alot of her own insecurity, fat or skinny body shameing isnt nice. That being said, what comes around gose around lmao", "NTA. Don't dish it if you can't eat it yourself", "NTA. I used to hate those comments from fat chicks!", "NTA. She was being as asshole.", "NtA. She was harrassing you lmao ?? What did she expect? \nThe \" fat f*ck\" miiiight have been too much for other people but not for me.\nGood for you !", "The way i said “yes you fucking are💀” reading the title then read the first line i was disappointed in myself but yeah def NTA", "NTA. There's an old saying about glass houses and stones...", "NTA YOU GO GIRL", "well served, just right.", "NTA, she started it anyways.", "JAH - justified asshole \n\nYeah, cold objective morality dictates what you said is cruel and there's probably a better way to handle the situation but I'm grinning and cheering you on.", "NTA. She was body shaming and bullying you the whole time. You finally pushed back and the jealous mean girl cried victim. You did nothing wrong, wipe this toxic person out of your life.", "ESH\n\nUnless you’re a doctor, don’t comment on people’s weight. It’s unnecessary and often just ends with everyone hating each other.", "YTA and I’m glad you were. She was body shaming you and telling you what to eat, you gave it right back.", "ESH. She asked for it but that doesn't make it OK to say it. She's clearly insecure about her figure and reflecting that on you, but you should have just told her to drop it, rather than going eye for an eye.", "NTA. It was not kind. But you have a right not to be harassed.", "NTA. She was taking all insecurities out on you. Just block her and her parents. It sounds like a her problem not you.", "YTA.", "NTA, and I would even say so based on the title. Some people really do need to eat less, and in your case she deserved it more.", "i would have done the same thing except the first time she insulted me.", "NTA.\n\nWhen you comment on someone else’s body constantly don’t be surprised when you get some back about yours! It’s not fatphobic. What’s the word for skinny-phobic? Cause that’s what she is.", "NTA. You tell her you will apologize when she apologized for each and every time she called you skinny and told you eat less. Tell her bullies never win. Actions have consequences. Next time keep her mouth shut.", "NTA, no one should comment on anyone’s body the way she has done to you, she had it coming.", "NTA, she was taking out her self hatred on you.", "NTA\n\nBody shaming is body shaming, and she dished out what she couldn't handle", "Absolutely no way you're TAH. She was likely verbally messing with you to get off her mind how bad she felt about herself. And if she needs her parents to win her arguments, she wasn't raised to handle personal affairs independently. PS I applaud you for calling her a fat f**k, I understand you feel bad but also please understand that if they're insulting you, they're free game.", "NTA\n\nIt was rude, but funny. \n\nBody shaming includes all body types. She can't give you crap all summer for your body type then cry that she's the victim. Well, she can, but she's  turd for doing it.", "NTA, I would have done the same tbh. She sounds miserable.", "I was always super skinny. I can't tell you how many times people would come at me like this. It's crazy how so many people think body shaming only goes one way. You're definitely not the asshole. Listening to someone body shame you over and over again will eventually evoke a negative response. She should be ashamed of herself. She's trying to make you feel as bad as she feels about herself.", "Aw, hell no. NTA. As a big ass girl myself, she deserved it.  If she can't take it, she shouldn't dish it.", "Oh so this girl thinks it’s okay to body shame you for being skinny, but gets offended when she gets same in the return? \n\nWhatever! Let her live with it now. I’m surprised you didn’t say it earlier!", "In the future, instead of going for the jugular, make it introspective. \"why does my eating affect you so much? I'm happy with myself. Maybe you should think about what's really upsetting you here\"\n\nNTA\n\nBut maybe you could have also told an adult what was going on. She has issues she needs to address and someone in charge of her care needs to see that she needs help. t's not your job to make her feel better, but telling an adult could have taken the focus off you possibly.", "NTA\nVery similar thing happened to me, and I said something similar too. \nOp, the girl was practically bullying you for the sole reason of you being skinny. Your comeback was deserved. If you were being fat phobic, she was being skinny phobic.", "NTA this is so funny. As a fellow skinny person, (I’m just not a foodie, it doesn’t excite me that much), I’ve gotten comments like this my whole life and it weighs on you. They say you’re not allowed to complain because, we’ll, you’re skinny, but then they make rude unsolicited comments about your body in a critical and objectifying way. I don’t appreciate it and I don’t make comments about other people’s bodies to them but they feel entitled to it. Honestly, good for you. You’re not going to be this person’s friend anyway. Otherwise my advice is we have no choice but to forgive them for their ignorance and understand it comes from insecurity and a desire for you to look like them to make themselves feel better.", "I was all ready to answer different before I read the whole post\n\n\nNta that girl is a bully and it’s sounds like you put up with her until the last possible second. She body shamed you your whole trip and you made comment at her jealousy.", "NTA. I'm thin and I'm fit and frankly I have a very nice body. I also put so much work into it. And the amount of annoying women I've met who have made rude comments drives me insane.   \n\n\nNot eating like a pig doesn't mean you have an eating issue. Honestly whenever I order from a restaurant in North America, the portions are insane. When I went to Europe for a bit, the portions seemed normal. So I REALLY FEEL YOU. I've come close to snapping as well.", "NTA - usually I say don’t make comments on anyone’s body unless they ask. But to me she was asking for it. And I’m a fat girl.", "NTA\n\nShe asked for it. You don’t get to be a dick to someone all year, then get mad when they finally clap back. Fatphobic or not, her comments were worse due to the constant repetition.", "NTA, and I understand how frustrating it can be when someone is thin, and it seems effortless, but just as people can be fatphobic, they can be skinnyphobic too and I'm tired of people brushing it off \"but your skinny, so clearly your weight isn't an issue\" as if being underweight isn't something we all worry about.", "NTA she was insecure and was jealous, but now she'll play the victim. IF you want to help her, tell her that she was body shaming you because she wanted your body type the entire trip. Not only that but she should be more sympathetic towards other women instead of catering towards the \"make gaze\". It's not your fault you look that way!! No one can help what they were born looking like, even if they're attractive it was JUST AN ACCIDENT! \n\nI'm sorry that happened, but learn from it. Women shouldn't be in constant competition with one another, there's literally no reason for it. Even the \"best\" men are doofuses.", "She honestly deserved that nobody should be commenting on other people's bodies.", "NTA. She had it coming. Unfortunately in the world we live in today people are gonna give you fault for defending your wellbeing. Fuck around n find out. She found out 🤷‍♂️", "NTA - You should have spoken up sooner. Not necessarily the first time, or even the second… But before the last day. This is something you learn, to respond faster but softer…", "NTA ultimately but you need to do better. Don’t let someone else’s bad behavior justify your own. You basically took shit from her until you exploded at her. You need to do better for yourself. Like tell he to stop making comments about your body and then escalate it if she doesn’t stop. Meaning stop being around her, report it to someone in charge, stop talking to her etc.", "NTA. \n\n>She was shocked, and I left before a response. She texted me later and said she was shocked how fatphobic I was being\n\nWhy don't you text her back saying you were shocked how thinphobic she was being?", "Lmao I feel like she deserved this!! You wouldn't have brought up bodies at all if she hadn't been bringing it up over and over again. She deserves to taste of her own medicine, NTA", "NTA - Don’t dish out what you can’t take back, good on you OP for standing up for yourself!!", "\"I can't go swimming I'm too fat\" - \"honey maybe if you went swimming regularly you'd be less fat\"\n\nUgh, NTA. She definitely deserved it.", "NTA. Don't dish it out if you can't take it.", "NTA. She started it.", "NTA. Willing to bet that if it was the other way around, this sub would go full NTA. Don’t dish what you can’t take.", "You know - I have been extremely skinny and very overweight at different times in my life.  I was *just* as uncomfortable and self-conscious with my skinny body as with my fat one.  \n\nI hated wearing bathing suits and would wear huge oversized clothes so no one could tell how small I was and begin harping on my body. \n\nPeople should really learn NOT to comment on other people's bodies unless specifically asked \n\nNTA", "Karma is a bitch.", "Fat-phobic troll being fatphobic, YTA.", "ESH. I can't blame you for reacting, but we are responsible for our reactions as well. What she was doing the whole time was wrong, but you responding the way you did sabotaged yourself and she didn't learn anything. You should have addressed it.\n\n \"I don't appreciate the way you are constantly making comments about my body and my eating- I'm active, I don't eat much, and I'm healthy. I'm sure you wouldn't want anyone to comment on your weight or your eating choices day-in, day-out when you are trying to have fun with your friends\" something to that regard. \n\nHigh-road all day long, and let them feel the guilt. It's not too late to respond to both her and her parents with this information now, along with an apology for \"losing your cool and stooping to her level\".", "ESH. Nobody should be making comments on peoples’ bodies or eating habits.", "NTA but that\"... you f f...k \"is way too much. The first part is ok.", "ESH if you eat more and she eats less you'll be friends.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway account. \n\nHey reddit! I (16F) recently participated in a summer exchange program and went to abroad to a foreign country to study for the semester. Over there, I had a great time, was on good terms with my host family and friends, except one girl.\n\nThis girl had a different body type to me, she was slightly bigger. (I don't mean this in a rude way, she just was, she was still a good person). I do a lot of extracurriculars that require exercise so I stay in shape. The entire program, I had a feeling she hated me.\n\nAnything I said, whatever I did, she always found a way to say: \"Yeah it's because you're so skinny.\" and even went as far to call me \"anorexic\" when I told her I was on a diet. (This is a healthy diet recommended to me by medical professionals).\n\nIt kinda made me uncomfortable. Once, I suggested going swimming and she said, \"Of course you'd want to go swimming, you're the tiniest person here, you can show yourself in a swimsuit.\" Like, jeez.\n\nThere was one phrase she used, A LOT. \"You need to eat more.\" I have a small appetite, and I eat less than her, it's not that big of a deal girl...\n\nBy the last day, I had had it. It was my last day, I was so sad, I didn't want to leave my friends, and I wasn't feeling hungry. It was around the 50th time she told me, \"Girl, you need to eat more. I can like see your bones sticking out.\" and I freaked out.\n\nI was having a bad day. The last thing I needed was to deal with her, so I responded, \"Yeah? You need to eat less you fat f\\*ck.\"\n\nShe was shocked, and I left before a response. She texted me later and said she was shocked how fatphobic I was being and she's glad I left. She even got her parents to text and call me to yell at me.\n\nI am feeling bad, AITA reddit?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, she was skinny shaming so 🕺", "NTA don’t dish it out if you can’t take it", "NTA.\n\nShe shouldn't have dished it out if she couldn't take it back.\n\nAll my bullies in the past stopped only after I STOOD UP FOR MYSELF, which is precisely what you did and I applaud you for that. Good on you.\nEveryone saying ESH is stupid.", "That's not fat-phobia, it's a low blow, hitting her in her insecurity, but she had been taking low blows all summer. NTA", "I came here thinking for sure you’re TA. But no, if she can comment on your body nonstop you can absolutely stand up for yourself. Well done.", "ESH\n\nwhat does her weight have to do with her being an AH? if she's rude and obnoxious, call her out on being rude and obnoxious lmao", "Yeah, YTA but she asked for it by also being an AH to you, with her constant attacks. She did it because she felt jealous and/or insecure. You did it because you felt angry. Both of you were wrong, but at the risk of sounding childish: she started it. \nDon't beat yourself up about it too much.  \nIf you decide to apologise to her (I wouldn't) make sure to let her know that you didn't appreciate her taking jabs at your diet or your size, either.", "Tell her parents all that shit too. They should teach her not to dish it out if she can’t take it. NTA", "NTA but you probably overreacted. Was that the first time you met an American girl?", "ESH. Both had immature ways of dealing with each other. But that’ll come with time and experience. \n\nBigger girl needs to get a grip and not project insecurities onto other. \n\nOP - I’m guessing your outburst isn’t typical of you at all and you probably surprised yourself. Going forward set that boundary early on, tell her she’s hurting your feelings and please stop. It’ll be up to her to listen and behave accordingly. Might be kinda awkward but that’s ok. She does it again then she deserves to be barked at.", "Oooh she was peanut butter and jealous. I’m an overweight guy too, ya can’t “shame” skinny ppl man, it just doesn’t work that way lol we all know it’s because she too wants to be skinny. I want to be skinny. \n\nWe have to eat less, thems is the facts. Calories in calories out. Why tf was she paying so much attention to your eating habits if it wasn’t out of jealousy? NTA she had it comin’, I’d say you went easy on her lmao", "ESH\n\nShe shouldn't be saying those things, but your comment was way outta line. \n\nAlso, you're 16! If you are as active as you say you are, why are you on a diet??\n\nIt's worth pointing out that if your diet is prescribed by anyone other than a registered nutritionist/dietician ( I can never remember which is the legit one), it's likely bunk.  Doctors, for example, get next to no training when it comes to diet and exercise.\n\nI'm very suspect of your side of things because the internet loves to jump all over a fat person and reward thinness.", "NTA. \n\nI’m words of wisdom from Chicago: \n\n*She had it coming*", "ESH\n\neta: i'd vote justified AH if it were an option", "NTA; she's just jealous of you and projecting. She bullied you the entire trip and she got bit. Her fault.", "NTA, her insecurities are not your problem. I understand feeling self-conscious about your body (I still battle my insecurities), but her constantly making jabs about your body was completely uncalled for. Let me be clear I think fat shaming is terrible. However, so is skinny shaming. Any type of body shaming is terrible. Could you have said something differently? Probably, but at the same time, you were pushed to your limit. And for anyone telling you you're supposed to be the \"bigger person,\" tell them that being the bigger person doesn't mean accepting abuse.", "ESH. Makes me lose my faith in humanity a little every time someone posts pretty much this exact story. She was making you feel uncomfortable. You could have said, “please stop commenting on my body and what I eat. It’s really rude and making me feel super uncomfortable.” You could have said, “you’re being an asshole and you need to mind your business.” I totally agree she crossed a line, even if it is obvious she was coming from a place of deep insecurity about her body. The truth is, people will treat you better because of how your body looks and they will treat her worse because of how her body looks. That context shouldn’t be ignored. You making mean comments about her fat body is more powerful than her making mean comments about your thin body because it packs the extra punch of a society that hates fat bodies. All that being said, I think she was being mean and thoughtless and rude and you had every right to tell her so in no uncertain terms. Instead, you decided to call her fat and tell her to eat less. She’s wrong for harassing you, but she’s right about you having an anti-fat bias because if that wasn’t in you, you would have just called her an asshole instead of using fat as an insult.", "Lol NTA\n\nLet’s be clear that being thin is a privilege. I am never going to entertain any reverse racism type BS when people start complaining about skinny women and all bodies matter… HOWEVER \n\nshe came for you and you did not send her LMAO\n\nYou did what you had to do… Furthermore, it sounds like you sort of just blacked out from anger due to prolonged harassment. It sounds like she felt insecure and jealous of you… Doesn’t make it OK to comment about peoples bodies. Everybody needs to keep their body to their selves , so she learned today 😂", "YTA (slightly).  You handled that poorly.  It sounds like she has some huge insecurities and is lashing out at you because you represent the ideal that she feels she cannot achieve.  As a result, she is saying mean, ignorant, horrible things to you.  That is not fair to you.  The best way to respond to that would be to ask her to stop and explain how rude she is being to you.  You instead chose the nuclear option of hitting her exactly where you knew it would hurt.  The result:  now you both look bad.  As difficult as it may be, taking the high road could have led both of you to be happier in the end, rather than now where you are both unhappy and you are questioning yourself.", "Body shaming is bad in either direction. You both were wrong.", "NTA, it was justified. She had no right to call you anorexic or tell you to eat more at all. All you did was give her a taste of her own medicine🤷🏻‍♀️\nAnd for the record, I'm fat. Like, 200lbs(I know, unhealthy, I'm working on it). And I don't find what you said offensive since, as I said, you just said the same back to her that she's been saying to you.", "YTA. Why do you think it's okay to call someone a fat f***?", "The saying „don‘t dish it if you can‘t take it“ fits extraordinarily well here lol\n\nI mean, could you have told her to stop before, or been more tactful about it? Sure. But at the end of the day it‘s not your fault she seems to have some personal issues regarding weight. \nI don‘t like people who just nag others to no end and then start clutching their pearls at the first sign of resistance. Seeing as she was down right rude to you I‘d say you didn‘t exactly miss out on a great friendship or anything. I wouldn‘t worry too much about it. \n\nNTA", "That's not nice of her to be mean to you like that. NTA.", "First I will get this out of the way, NTA. The only thing I will suggest for the future is speaking up sooner, before you boil over and escalate things. A simple \"I don't appreciate you constantly talking about my weight.\" earlier may have prevented a blow up.", "NTA after she bitched at you all the time you responded once?", "ESH.  16 is a difficult time, and people's bodies are changing, often times out of their control.  She shouldn't be shaming you, but nor is it OK for you to do the same to her.  \n\n\nAnd yes, it is not quite symmetrical, while no one should be body shamed, it is a lot more hurtful to call out someone as being fat over being too skinny", "I originally thought YTA, but after reading... Definitely NTA.\n\nShe started it... You just finished it. If she didn't want you to comment on her weight then she shouldn't have commented on yours.", "This reminds me of the time I was abroad and the host family daughter took the money she was supposed to spend in my food for herself, and I was left hungry for days... I couldn't say anything to her parents because she was intimidating as fuck, but I have horrible memories of how I was treated by her (not just this instance, she did some heinous shit). Being abroad and alone while someone in the host family is awful to you is very disheartening, it feels like there's nothing you can do to fight it.", "NTA...", "ESH. You shoulda just told her her comments on your weight and appearance were making you uncomfortable when they started, not let them carry on until you snapped and were mean in return. That's what maturity is. Setting your boundaries and addressing them with people before they become a problem.", "YTA. It is never okay to fat shame anybody. But your not the only asshole, she shouldn't have picked on you because you were skinnier than you, that was her jealousy taking over.", "Lol same - context is a hell of a drug! NTA", "Humm let's be all passive aggressive and then act all offended when you won't take my crap anymore.  NTA", "Same. Thought “yeah, pretty much” but after reading it more “wow…. Ehm, yeah no. She had it coming.”", "This is the problem - people don’t see skinny-shaming as body shaming. I’m naturally slim from a family of naturally slim people, I also exercise lots and eat a lot of fruit and veg. \n\nI had a friend who was an absolute amazing woman tell me over and over and over that I “needed to eat more cake” even though I am a totally healthy weight (slightly low, but not unhealthy) for my size and body type. \n\nIn the end I got so pissed off I put myself on a cake-a-day diet for a month. And I don’t mean some little slice of fruitcake - on no; I was having those massive cream filled buns from Birds and similar EVERY DAY! \n\nI weighed myself at the start, and at the end. My skin went horrible and I felt awful and I LOST TWO LBS! \n\nAt least she never mentioned it again 😒", "NTA for insulting her *specifically*, but that doesn't make the comments okay.\n\nThe other girl was obviously out of line, but when the OP called her a \"fat f\\*ck\" she wasn't the only person who heard. Every other person there is hearing the OP use \"fat\" as an insult.\n\nI am not saying you should be nice to people who bully you, but when you reply think about the collateral damage.", "Same for me. I had a verdict but when I read it fully it changed", "But OP was never called a \"fat f*ck\"", "I would say they could have left out the F\\*t F\\*ck part, but otherwise NTA.", "A lot of \"bigger people\" don't consider shaming a thin person as an insult. It's wild how it does not go both ways.", "this but also anorexia is a far more serious condition than obesity, as in it's fatal way more often although it is less common", "I probably would have done the exact same thing lmao . Good job OP, maybe next time they’ll stfu about others bodies and eating habits.", "I have to ask, do you genuinely think she would have stopped?", "OP is 16 - I don’t know any 16 year olds who would, or would even want to come up with something so measured. NTA, the other girl had it coming.", "I'm now picturing an airhorn  \n\n\n\"Of course you want to wear a swimsuit, you're so ski...\"  \n\n\n\"HOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOONK\"", "Agreed - it wasn't ok when the girl did it, it's not somehow better to do it back.  It also makes it easy for the bully to justify their own behavior.", "This is the correct answer. Two wrongs don't make a right.\n\nYou need to (pun not intended) be the bigger person.", "I agree with you. OP is 16, plenty old enough to at least be learning to communicate in a reasonable and mature manner. It's not \"victim-blamey\" to call her out on her own AH behavior. Two wrongs don't equal a right and all that. ESH", "Thats a bit victim-blamey imo.", "You must be living in an alternate universe, this is not a normal respons to hardcore bodyshame/hrassment. You are living in a wattpad fantasy and need to wake up really soon. Insane behaviour.", "Not sure how long it's been since you were 16, but good luck thinking a teenage brain is known for being logical and measured. \n\nAlso, saying something like that to a teenager who has already demonstrated a pattern of body shaming? Pfffffffft. Yeah, like that will cut very deep. She needed to be wrecked, and OP did a good job of it.", "Completely deserved. People need consequences for their actions.", "agree", "Tit for Tit", "What does ESH stand for, been trying to work it out. I'm new to this sub", "Calling someone \"skinny\" is usually not body shaming.  Reading between the lines I think the OP probably gave off some bad vibes during her stay. The other girl  may have been indirectly insulted by the OP on occasions. Contrary to the majority opinions here. i think she is a major A/H", ">People like her are completely rotten, no heart to heart or appeals to emotion will work here. You were completely in the right to get nasty, I think you could have even gone in for a lower blow. She has a mental disease caused by everyone around her being too damn nice, a couple cruel words will do wonders for her condition.\n\nI don't know about rotten. It's more likely she's super insecure and projecting. That being said she still needed a reality check.", ">Being able to put up with other people acting ridiculous without sinking to their level is an important skill in life\n\nAgreed, but not even just \"put up with\". You can stick up for yourself without insulting the other person.", "This is good life advice. I try to live by it, and have failed sometimes, but it is worth trying.\n\nI grew up around way too many assholes. It wasn't great but it did teach me that if you let them set the bar and model your actions after theirs and behave like they do, then you become an asshole too. \n\nBreak the cycle.", "\"Just sit back and take it OP, be the bigger person\" It is ALWAYS the victim that gets told that shit. She had it coming.", ">Imagine if I told her to lose 30..\n\nShould have. Some people need to get a reality check every now and then.", "I like passive aggressive approach. “Thank you. I’m happy with my weight. Are you happy with yours?”", "Exactly", "HOW you put a person in their place matters though. ESH is coming because you CAN trash a person without using body image issues.\n\nEx: \"I'd rather a bone stick out of my rib than a nasty ugly personality spill from my mouth at every opportunity\"\n\nAlso 'cruel' and 'place putting' but focuses entirely on the persons chosen behavior.", "I’d say not NTA if I believed this was real", "You are really telling a bullied kid that she overreacted? The bully wanted to talk about body shapes and OP told the truth, how is that wrong?", "Someone pushes you, but when the victim pushes back, you call them an AH?\n\nStop blaming the victim.\n\nPeople like you encourage bullying.", "She made those worse for herself", "I grew up with french parents in texas so ... my mom always made sure i ate but correctly. i remember being in middle school and so many girls teasing me, saying i was too skinny, wanting attention. so much crap i had to put up with JUST because I had a mom who wanted me to have a healthy lifestyle", "IMHO you sound like the person who would think a no tolerance bullying policy is a good idea. Oh no she hit him back how could ge after he made her feel miserable for the entirety of their meeting.", "It wasn't a free pass. She earned it from all the bullshit", "Some people need harsh. OP did her a favor. People have probably been tiptoeing around the subject with her for a long time.", "Aint that the fucking truth", "OP deserved it.....by being skinny and existing?", "What perspective could possibly exist from the high calorie individual?", "I agree.", "Yeah well she got a taste of her own medicine and it hurts. Too bad so sad. I am fully against commenting/insulting ones appearance. But if they keep coming after you doing it then they can't be mad when it comes back to them", "Yeah cause violence is better...\n\nLol tf", "That's why ESH is an option, YTA is absolutely the wrong vote", "mmmmmmmmmmmg how about no ? The other girl bodyshamed op over and over, nutrition is an incredbly personnal thing and she burned so many bridges with op. op answer was not nice at all but the girl 10000% deserved it. You are either a very strange person or a larger one.", "hey! i phrased it different when i first wrote so i needed to clarify that, and forgot to edit it when i rewrote it.\n\nand i get it abt the me being TA part, i've texted and apologised to her and will call and do the same if she wants to, thanks :)", "How can it possibly be a Y T A? At the very least it’s ESH or NTA. The other girl was doing the same thing for a while. If she can’t take it she shouldn’t dish it", "hello! i fully understand your vote and thanks for weighing in :)\n\nabout my diet, it was recommended to me by my personal trainer & my parents approved it! we ran it by a family doctor and he said it was okay, thanks for your worry anyways", "There are plenty of diets that aren't centered around weight loss.", "‘Diets’ aren’t necessarily for weight loss. It could be a diet for weight gain, to help with intolerances/allergies or to increase intake of certain nutrients etc.", "Nope. We have not been invited to talk about her body. We've been invited to talk about her actions.", "It's hard to be the bigger person when the other person weighs 200 lbs more than you", "Yeah, very soft ESH. Sure, OP could have handled it a bit differently-- after the first comment, said something like \"Wow that's really rude, please don't comment on my diet or my body.\" \n\nAnd each time it repeats, \"what a rude thing to say.\" \"Wow.\" \"I've asked you before to stop commenting on my body, it's very weird that you keep doing it.\" \n\nThat would've been the mature way to handle it, and possibly could have stopped the comments before it got to the point that OP exploded. But OP is also 16, I can't really blame her for not being able to come up with the most ideal way to handle things.", "Same!", "How is that different than all the comments made in company about how \"skinny\" OP is? It's the exact same thing, using skinny as an insult. \n\nIt seems that you're insinuating the double standard is okay... And as someone who constantly experiences the \"collateral damage\" (to use your words) of thinphobic comments, I have to point out the hypocrisy in what you've said. My feelings get just as hurt as a fat person's when my weight is used as an insult toward me.", "I'm pretty sure OP wouldn't use it as an insult to anyone else", "It's a logical extension of whatever principles unpin the statement that \"minorities cannot be racist.\"", "Yeah, seriously.it pisses me off, and truly hurts my feelings. \n\nDoesn't it occur to any of them, while commenting how \"anorexic\" I look, that I might actually BE ANOREXIC? Thanks for using my trauma as an insult.", "She might have. It could've been tried instead of directly going nuclear is my point. When you directly go nuclear, at the very least you're being an AH towards yourself because you're giving everyone an easy way out to blame and shame you and ignore the original issue that provoked you. In life we have to be strategic as human beings living in a community, instead of behaving like headless chickens.", "She might have. She’s young too. She was definitely an AH and body shaming OP but she may not have realized it, especially if she’s trapped in her own “I’m overweight” self-esteem spiral. That doesn’t make it okay, but sometimes calling people out on their shit can be a wake-up call.", "you must not know many 16 year olds... lol. it's definitely easier to be an asshole, especially in a situation like this, but there's always a better way to deal with it", "Well it's a learning opportunity. Sure the other girl is the bigger ah. But OP should also learn (for the future) that penting up and bursting in an ott manner is ah behaviour and take steps to develop some sense of how to handle these conflicts as and when they arise.", "To me, she was absolutely fine until the last three words/ NTA if she stopped at \"less.\" ESH after those last three words. Totally unnecessary.", "She is 16 not 6 she knows being fatphobic is wrong.", "Yes, like being called out for bullying and body-shaming. OP gave the bully ammo to play victim.", "It might not hurt the bully. But it will hurt nearby people that her her size or larger that did nothing wrong.", "Read the community info before interacting in a subreddit.", "DEMENTED. SKIN AND BONES IS NOT AN INSULT TO YOU ?  go touch some grass really. Insane behaviour. Wtf is wronf with this sub", "Rotten might be too harsh, true. What I'm getting at is that if OP were to explain how those comments made her feel instead, and tried to have a normal and healthy conversation with this person, I'm certain she would have just walked all over OP and continued insulting her instead.", "Very true.  There are a lot of ways OP could have approached this situation before the nuclear option of using the Uno Reverse card", "If the goal is to make the situation worse, then sure, fight fire with fire.  If the goal is literally anything else, be the bigger person.  Not saying it's not hard, and I'm certainly not perfect.  But aspiring to rise above drama and other people's BS means you're less likely to lose your composure and display something ugly about yourself.  \nMaybe the moral high ground doesn't matter to you, but to some of us, maintaining our morals even when it's tough is important.", "She only had himself to blame 🎶", "I know, but there is a history of larger women verbally attacking me, and if I started a fight with them all, I'd be punched like 25 times now lol\n\nOne girl was gonna beat me up and we talked it out and are friend now actually for years.\n\nSometimes I understand because societal pressures that I don't have ti worry about. ... and it makes me a pushover when it comes to this sometimes.\n\nI'm not being someone's destroyer of confidence even if they try to be mine.  \n\nIf that makes sense :)", "I know, but there is a history of larger women verbally attacking me, and if I started a fight with them all, I'd be punched like 25 times now lol\n\nOne girl was gonna beat me up and we talked it out and are friend now actually for years.\n\nSometimes I understand because societal pressures that I don't have ti worry about. ... and it makes me a pushover when it comes to this sometimes.\n\nI'm not being someone's destroyer of confidence even if they try to be mine.  \n\nIf that makes sense :)", "I had this happen all the time when I was a teen. This is typical behavior from overweight people", "Yes exactly! My family is very big on knowing what we put in our bodies and that we’re healthy. Most People in America seem to not care in the slightest what they eat and what the food is doing to them. I still get called skinny when in reality…I’m just healthy. I think people confuse “skinny” and “healthy weight” a lot.", "So op was supposed to stay silent after the other girl harassed her over her apparence again and again ? Op was really tamed trust me. The other girl would have never recover from the reality check I would have gave her if I would have been in op's position.", "Well your assumption is wrong. Thank you for playing.", "If it would be an AH move out of context it's still an AH move. Grow up.", "No way, she should definitely be the one to apologize first. She belittled and provoked you for a very long time, it's not a surprise that you snapped. Could you havr handled it better? Of course. But expecting you to politely take being insulted is crazy. You can't spit in someone's face and be mad they yelled at you.", "You're 16 and have a personal trainer? Yeah ok.", "yeah if she's an athlete those are needed for peak performance", "this! my diet was created for me with a specific goal in mind, and it's completely safe :)", "Lmao", "Agreed completely with everything you said. Behaviours don’t get corrected in a rude manner, and while it may feel it’s not your responsibility to correct the behaviour, I think if you’re able, it’s a great things", "Lol they're 16 not 5 the girl 100% knew what she was doing.", "That's fair, I would've thought the same but the anorexia comment made me look at it differently. I can't really describe it but everything felt more wrong after that", "Well I would hope a grown man doesn't know too many 16 year old girls lol.", "Its a learning opportunity for the other girl to not throw stones when you live in a fat house.", "Do you honestly believe the other girl would have gotten that? Personally I doubt it, with the way she continuously commented on OP's body and eating habits, that she would even try to understand the \"proper\" way to handel a conflict. \n\nPlay stupid game, win stupid prizes. If she can't handle what OP said, then maybe she should not say similar things herself. In my own experience, what OP did is the way to handle people like the girl, otherwise they just don't seem to get it.", "You’re barking up the wrong tree my guy. This situation wouldn’t happen if the other girl wouldn’t keep her mouth shut. I’m sure many are also surprised, like myself, at how OP was able to hold it in after many insults, especially at 16.\n\nBlame the aggressor, not the victim. “Learning opportunity” lol, she’s 16 and reacted how almost anyone/everyone would even after “learning”…", "She’s not fat phobic, she retaliated against someone that was harassing her.", "Fat chick shouldn't have been skinnyphobic first.\n\nOr she should just not be jelly. No need to be a jelly belly", "[deleted]", "on the flip, if she was just being wildly and inappropriately concerned, but from a genuine place, because she really did think OPs health might be at risk from not eating enough, this was probably a hard thing for her to wrap her head around lol", "I've been reading it, I can't find an explanation.", ">I'm certain she would have just walked all over OP and continued insulting her instead.\n\nProbably but that's just more of her insecurity preventing her from realizing a different perspective.", "Originally responded to wrong comment, but what is your magical phrase that makes people suddenly change who they are?", "It does.", "You know there are other options besides “do nothing” and “body shame her back” right?", "Nah I think they aren't far off lmao. The insult was deserved", "This logic is not as sound as you might think it is. Context definitely matters. It’s an AH move to punch someone, but if it is in a context of self defense, it’s not so much then.\n\nEdited this to say:\n\nI am just talking about the logic used here, not that I agree or disagree that the fatphobic comment was an AH thing or not.", "Your behavior doesn't become ok just because somebody else is being an AH first. That's why ESH is an option. And really the only option in this case. If it's an AH think for you to say without the previous context, it's still an AH thing to say with the context. \n\nSo many options were available, she could stop hanging out with her, she could talk to her, she could talk to her friends to talk to her. \n\nBut making an AH comment still makes you an AH. \n\nIf you wouldn't say it to somebody else because it's an AH comment it's still an AH comment.", "My issue with this sentiment is that I don't think it is worse for a fat person to body shame someone than it is for a skinny person.\n\nBody shaming is equally bad, even if it comes from a supermodel.", "The problem with how OP handled it was that it allowed the girl who was bullying her the entire trip to now play the victim, and she is. Had OP confronted her about the bullying, shamed her about the bullying in front of others, the bully would have had a chance to either re-think her behavior, or apologize.", "I know, I’m a 47 year old bloke and I’d likely say something similar.", "No, being the victim of bad behavior doesn't actually give you license to behave in the exact same way. If it's bad for the first person to do it, it's also bad for the second person to do it back. ESH is the correct ruling.", "Lmao you're barking up the wrong tree dude. They addressed how terrible the behavior was of the girl making fun of her for her skinniness but that it's not ok to keep emotions pent up. You completely missed the mark here and are only focusing on one element of their comment. They're not victim blaming anyone, they are looking at how both sides need to improve. You need some serious perspective.", "I once told a girl that it was no wonder that she was adopted and her real parents didn't want her. I think I was 10 and we were at a sports club together and she had kept bullying me over and over for no reason, she was two years older than me and I didn't really know her but I happened to know her background because she lived in the same neighborhood and her dad was a teacher at our elementary school. It was some sort of weekend get together with the swimming club and normally I'd just see her one hour a week and that was it, never knew why she had an issue with me because we didn't really talk or anything, it was go there and swim and then go home. \n\nShe immediately started to bully me again on that weekend and I completely snapped. It was a horrible thing to say and I was punished having to clean the toilets. \n\nI honestly don't think I felt that guilty in general but because I got caught and was made to feel like it was wrong I regretted it. As an adult I can obviously see how traumatizing that must have been for her but I also understand that I didn't really have skills to defend myself, so I am trying to let it go and not feel bad about myself. Sounds like you were in a similar situation where you didn't actually particularly mean what you said but just thought of the worst possible thing you could say to hurt the person back.", "You're assuming she held it in from good judgement, but predicated your excuses of why having a bad response is about her being 16. \n\nAt least be consistent. \n\nShe's asking with the intention of being open to advice and become better and you're all encouraging the one bad move just to vicariously live some revenge validation.", "She call somebody a fat f**** that's fatphobia 🤣 If somebody insults you, you don't retaliate back by also being an AH. Being an AH because somebody else was being an AH, still makes you an AH. That's literally why ESH exists.", "Nah being fatphobic will always be an AH move. So is body shaming somebody for being skinny. The reason you find it ok, is probably because you are fatphobic", "It's plainly in there with the rest of the rules, it means Everyone Sucks Here though.", "I'm not trying to make people change who they are, and I'm not saying OP should try either.    \nMy approach would have been to call the other person out, in front of an audience, and say something along the lines of \"Hey, I don't appreciate you commenting on my body like that, try to imagine how you would feel if someone did that to you.\"    \nNothing magical about it, but by taking that approach, you probably win allies from the other people in the house, and either force the other person to reconsider their actions and stop, or continue being an asshole when they've been put on notice in front of everyone. If it continues after that point, I'd be willing to bet other people in the house would be taking OP's side and hopefully addressing the issue in a more meaningful way.\n\nAnd I'll repeat what I said in my first comment - OP is absolutely justified in being angry and annoyed about the way she was treated.  But OP asked if they were an AH in this situation, and imo, she was.", "like what ? Because Op said NOTHING about the other girl's body until she broke op's spirit with her disgusting comment. Op didn't deserved to be treated like that; Op was really supposed to smile and nod because FatPHObiA is horrible ? Let me tell you this, I used to struggle with anorexia for a while. Comment like the one the other girl made are really hurtful, nasty and ignorant and 100% she deserved op's answer. Act like a bodyshaming asshole, get treated like one.", "Being fatphobic isn't ok ever. Anybody who supports it is probably just a fatphobic AH themselves.", "So basically you are telling her to be passive and not stand up for herself?\n\n'talk to her friends to her friend to talk to her' 😭be for real", "Being proud of being immature. \"mommy she started it\" does not make your behavior on", "I’m not mad at OP cuz the other girl fucked around and found out, but OP should have been more graceful about it. I would say NTA given the age and the amount of shaming she dealt with, but like u/Embarrassed-Panic-37 said this is a chance to learn more tact", "They called her anorexic. Be mad I guess.", "I Googled fatphobia for a second and it’s actually defined as “prejudicial assumptions that are based on an assessment of a person as being overweight or obese”. What prejudicial assumptions did OP make here that constitutes fatphobia? At the start, OP didn’t even say that the girl was fat, just said she was bigger than herself (which is normal, everyone’s bigger or smaller than someone else).\n\nIf the girl commented on another aspect of OP, she would have responded in the same way with reference to that aspect. Calling OP fatphobic is neither here nor there.", "I am overweight myself and I still don't blame her. When the \"fat\" girl dishes out mean comments all the time, she deserves the backlash.\n\nIf she can't handle it, maybe she should learn to keep her mouth shut.\n\nWhen I insult other women because they are skinny, then of course I will have to deal with a mean backlash sooner or later.\n\nWhile definitely not very nice, she is still NTA in this case", "The mean girl was also bodyshaming and being skinnyphobic. There is no vast difference between hating on different body types. You’re supporting a bodyshaming bully, so by your own logic, you’re probably a bodyshamer as well.", "And being skinny-phobic?", "Fat person here, no, telling someone the inverse of what they already told you many times unprovoked is not fatphobic nor asshole behaviour.", "If you are delusional enough to believe that plus size people can make disgusting comment about other peoples body without getting the same energy back, I really don't know what to tell you.  Weeeeell actually a nice beginning  would be to delete your account and go to a mental health profesionnal so you can talk about all of this.  Because if you believe your comment,  you are not mentally well.", "No i'm saying there are ways to stand up for yourself without being an AH. Are you really this bad at social skills you don't know how to do that?", "Virtue signaling over the internet doesn't make you an angel either.", "Right, I don't think any reasonable person would judge OP harshly considering their age and the circumstances, but they asked, and it's a growth opportunity.", "google definitions do not give you a good context", "Are you unaware of how ESH works? You don't get to be fatphobic in response. You can call her out, but you don't get to shame her body as a response. Stop being ok with fatphobia. grow up. \"mommy she started it\" is for 5 year olds.", "No form of body shaming is okay. They were both in the wrong. OP could have retaliated in a way that called out  the girl for her actions not her body. And the girl sounds terrible and shouldn’t have been commenting on OP’s body at all. ESH, even people in the comments", "By that logic if you're supporting OP you're also supporting a bodyshamer so that kind of falls apart immediately lol", "Also bad...what do you people not understand about ESH.  Like it's a simple concept. do you have logic skills. Everybody sucks means the girls actions also sucked.", "Thank you! This girl clearly isn't fat phobic she just got fed up with being body shamed and she was having a bad day already.  She's also 16 and while I def think maybe as an adult there would have been a better way to respond she was extremely patient for 16.", "seriously what do you not get about ESH?", "Yea sure but she didnt do that, the girl started it and found a response\nIts done now", "what a truly immature response", "Alright, so where’s your definition from? Unhinged side of Tiktok?", "Dont talk if you cant take it", "I think what you're missing is that this person is 16 and was extremely patient with this obvious bully. We live in a world where people are allowed to defend themselves if they are physically assaulted. Well, this person verbally assaulted OP over and over again. One comment by OP doesn't make her just as bad as the original offender, so you're seeing people disagree with your ESH judgement.", "She is still an AH for saying it. God you are childish.", "Again an immature response. How well people can take it doesn't make your actions ok.", "The problem with this sub is the judgements have no nuance. It's all or nothing. E S H draws a false equivalence between one stressed out outburst after a pattern of hostile and targeted bullying, and said bullying.\n\nSure everyone sucks here, but im not going to say they're equally wrong. This is exactly the problem with zero tolerance, it destroys nuance.", "Thats cool but the girl cant take it so she should learn to mind her business"]}