{"id": 26022, "submission_id": "167a8kx", "title": "AITA for not wanting to help my SO with our twins?", "selftext": "We have 4 kids together in total ages 6, 4, 1, 1. For context I have always been vocal about not wanting more then 2 kids. Our first born is a boy and second born is a girl, so I was happy to have one of each. I am the sole breadwinner as daycare costs would not make it worth it for her to work as well. \n\nAfter our second child I told her I was done and wanted to have a vasectomy, she was against that and wanted to have a third. We fought about this for months (I didn't want to get it done against her will), her reason for wanting another was that she always wanted a bigger family. My reason against was that I felt that she had a hard time keeping up with daily tasks with only 2 kids, I also spoke to her at length about how another child would be financially unsustainable since I have 2 jobs and am barely making ends meet (not to mention that I too am exhausted all the time).\n\nAnyway, before we could reach a conclusion she fell pregnant (she was on the pill and according to her, barely ever missed a day). We now have a total of four beautiful children that I love, but I can not bring myself to giving her the extra help for the twins. We now are stressed and fight all the time. I sometimes want to help her with the twins but it gets me so discouraged to see everything I warned her against come to pass. I know they are my children too, but it is not fair to get yourself in a situation when everyone is advising you against it.. then ask for help when the shit hits the fan. Now when I come home from work, I help just as much as I used to with our first 2 children, nothing more nothing less. AITA for refusing to help my wife with the twins?\n\nTLDR: wife didn't want me to get a vasectomy and now she had twins that she needs constant help with.\n\n**EDIT**:\n\n\nThanks for your replies, you guys held no punches and tore me a new asshole in the process. \n\nJokes aside, to address the recurring concerns. \n\n- We live in a small house and meal prep for a couple of days at a time, so cleaning and cooking shouldn't take long. My eldest is in school during the day and my 4 year old actually helps with the twins. My wife is tired all the time not due to the work load but because she spends all day on her phone even going to bed past 3am daily because she \"lost track of time\". On my days off I used to take over so that she can rest, it takes me a little over an hour to do everything and I manage to put the kids to bed by 730pm. I feel that I am feeding into her bad habit (phone) by being so hands on. \n\n-I understand that the pill is not 100% but she does not enjoy sex with condoms which is why we use BC. Marriage is about trust.\n\n- As for abstinence anyone that lives with their SO will tell you that it's easier said than done. \n\n- I do take care of all my children (homework, playing, feeding, bathing etc.), when I say I refuse to give her the extra help I mean I do not go above and beyond or take over after work as much as I used to. Especially since I told her prior to having the twins that I am already limited in what I can do due to my work hours.\n\n- I agree, therapy would help get over the resentment I feel, but I do not have the time or money for that right now.", "created_utc": 1693582080, "permalink": "/r/AmItheAsshole/comments/167a8kx/aita_for_not_wanting_to_help_my_so_with_our_twins/", "score": 4732, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I do not think I am the AH because I literally never asked for extra kids.. it was forced on me and now I am being asked to help fix the situation. I have little time, little money and even less desire to dig her out of the situation she placed herself in.  She thinks I am an AH because when she asks me to help feed the kids or change their diapers etc. I tell her no because she knew in advance that I did not want this situation. I understand that she wanted 1 more child and not 2, that part is unpredictable which is why she thinks im an AH\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH.\n\nNot only are you both assholes, you're both idiots. You could barely afford the two kids you already had, and yet, one thought another kid would be swell and the other thought that sex with a woman who refused condoms and a vasectomy would lead to no baby.  \n\nYou both need to grow up and get your shit together. Go and get this fucking vasectomy before you're dumb enough to make another baby with anybody.", "If she refuses condoms and objects to a vasectomy, you have to refuse sex.\n\nIf you still had sex with her, you had a part in creating these kids and you need to do your fair share in caring for them. ESH.", "So you're neglecting your children just to punish your wife and make your point. Got it, YTA", "Is this a joke? You contributed to the creation of those twins.\n\nGet on board, get therapy  or pay child support when she dumps you.", "You are both AH. She should not have tried to pressure you into having another kid if you didn't want one. But you did have one (two) and now it absolutely is your responsibility to help take care of them. They are your kids weather you wanted them or not.\n\n\nAlso it's your body. You don't need her permission to get a vasectomy.", "YTA. The time to bail was when she refused to let you use a condom, not after the kids have already been born. They are here now, through no fault of their own, and they need you.", "ESH. \n\nHer for wanting more kids when: 1. You didnt want to. 2. She was having trouble manage 2 kids at the time. 3. When your budget couldnt afford another one (even more two babies). 4. Because MAYBE she got pregnant on purpose (sorry, Im assuming, but I know some cases where this really happened)\n\nYou, because: 1. You could had made the vasectomy even if your wife disagreed. Its your body! 2. You could had used condoms to really be sure. 3. Despite all, the babies are here and you have to help. There are not \"I didnt agree with these\". They are your kids too so you have to help raising them.", "YTA.  They are your kids too and condoms and non-penetrative sex are also a thing.\n\nAlso maybe get her some help, dude.  Four kids under 6 is a lot.", "YTA - it doesn't sound like you were coerced into having more kids. These children are yours and your responsibility now.\n\nEdit: to be clear, my verdict was looking specifically at him not helping with the twins. I hope he doesn't continue that when they are old enough to understand favorites.", "YTA\n\nYou didn't need her permission to have a vasectomy, and you didn't need her permission to use condoms, but you didn't do either and now these kids are your responsibility.\n\nIn the post you are strongly hinting but not saying that you believe that you wife got pregnant on purpose. Obviously I have no idea if she did.\n\nIf she did, this would be an ESH. It doesn't make you N T A. More to the point, if you believe she got pregnant on purpose, I don't understand why it is more important to hint this to strangers on Reddit than to talk to your own wife about it.", "YTA. Childcare is not a woman’s responsibility by default that a man can just “help” with when he feels like it. Those are your twins too.", "Esh those kids are here and they are your responsibility whether you wanted them are not. I really hope you get better at faking it for those kids when they get older. You should have pushed the condom issue whether she wanted or not. \n\nShe, however, should have been more careful with her pill. Based on your description, I have my suspicions about her consistency.", "YTA. The kids are here. You contributed to making them. You help out with them.\n\nI sympathize with the fact that you are exhausted and didn't want to have a third (and bonus fourth) child, but you didn't do enough to prevent them from happening (with the strategies others have pointed out), and now they are here.\n\nHow is it going to help out your marriage if you refuse to help with the twins? Things will only go downhill.\n\nYou and your wife really need to have a few conversations about this situation. Good luck.", "YTA. It happened. Deal with it.\nIt might be the youngest putting you in the crappy care home when you are old. They might be oblivious to your disinterest now but won't always be.", "ESH. Your wife is a dick. She kinda forced you into having more kids. Kinda. \n\nBut dude they are your kids. If you love them you take care of them. You have a wife and not a kid problem.", "ESH - your wife wants another kid and your only protection was her taking pills? You should have either demand using condoms or haven't slept with her at all.", "ESH.\n\nThe only ones who dont have any faults are the children. And the twins will pick up that you treat their siblings differently than them.\n\nYou have done a vasectomy without her approval, you should not had sex with her with you didn't want more kids and she did not want you to get a vasectomy.", "ESH. Your wife for being irresponsible with the pill and insisting you add more kids to your family when you couldn't afford them. She also doesn't have a say over your body.\n\nYou suck because you're also responsible for conceiving the twins (condoms and no sex are options- the pill isn't 100% effective if taken daily) and the two youngest didn't ask to be born. \n\nMore importantly, you two need to figure out a better solution. All four of your kids will realize your resent towards the two youngest, if they haven't already. If you're working 2 jobs and one is full-time, what's the game plan for the future? And did you get a vasectomy so you don't have any additional kids?", "ESH. Whether you discussed it with her, you still were having sex. Their your children. Sometimes multiples happen. You need to step up for them and if you want your marriage to survive.", "ESH. The 2 of you have 4 kids you can't afford. Go and get your vasectomy TODAY or you will find out she's 'fallen' pregnant again.", "ESH\n\nYour resentment of her is going to ruin everything anyway so might as well get a divorce bc your kids are going to see how you treat them and her. It’ll be a miserable existence. Better to leave.", "ESH, your wife sucks for wanting more kids despite the fact that y'all are barely making ends meet and watching you work yourself to death. You suck for taking the resentment you have for your wife out on the twins who didn't ask to be here. Just because your wife was against you getting a vasectomy doesn't mean you still couldn't have gotten one. Your body your choice. Y'all need to figure this out.", "You know what OP to an extent I get what you are going through. Me and my husband were deciding if we wanted him to have a vasectomy when we got pregnant with my third child. So we had 3 kids under 3 and guess what things were really hard for a very long time. And I’m going to tell you that this is going to make or break your marriage, but with the attitude you have it’s going to break it. You say you love your kids, but you already seem resentful of them otherwise you would have no problem helping them with their bath/homework/ feeding. Ya I get it is hard, while my husband only had one job he was gone 12 hours a day and he would help me with the baths and take the night shift with the baby every night. Ya your wife wanted more kids, and if it is a truly unforgivable act then you need to separate from your wife. If not then you need to adjust to your new reality with no resentments. Those are your options.", "ESH. But you have a responsibility to all of them. If you can’t handle doing more, hire someone. Also, it sounds like you don’t contribute enough at home in the first place.", "YTA. They’re here. It’s done. Show up.", "YTA, sex makes babies sometimes, and it takes two people to make them so grow the hell up and deal with it. \n\nIf she didn’t want you to wear a condom or have a vasectomy then don’t have sex until you’ve resolved that conversation. \n\nBirth control is not 100% effective, condoms are not 100% effective, hell I know a guy who was conceived after his mom got her tubes tied. My point is, sex makes babies sometimes, if you want to have sex be prepared the consequences.", "ESH - there are no winners, and your poor kids are the main losers here", "YTA. You are ignoring your children to get back at your wife. You are a horrible father", "My first husband refused to allow me to get an IUD because he wanted to keep trying for a boy, even told my OB/GYN that I couldn't have one. You know what I did? Got one anyway! \n\nI will decide how many children I have, not a single other person gets a say.\n\nShe's allowed an opinion on your vasectomy but not final say. I sure hope you've gotten that done now.\n\nNow, stop being a jerk to your family and take care of them.\n\nYTA", "ESH. She has no control over whether or not you get a vasectomy. YOUR body YOUR choice. She’s selfish for trying to gatekeep that from you in my opinion.\n\nYou mentioned in the comments about her refusing to use condoms, this should’ve been a red flag to you if you didn’t want kids. You should’ve said “no sex unless with a condom”. \n\nNgl in my personal opinion it sounds like she’s just done exactly what she wanted and hasn’t considered you. It also drives me mad when people have more kids than they can afford, it’s unfair on the children. So based on this post, I think your wife is an incredibly selfish person. \n\nHowever, you now have 2 more kids and unfortunately you’re just going to have to suck that up and be a proper dad. Think of the kids. \n\nIf you weren’t happy with her pushing you, you should’ve left earlier.\n\nYour wife is selfish and disrespectful, and you’re holding too much of a grudge and not considering your children.\n\nInterestingly some people are still saying YTA and not taking into consideration your wife’s actions. I think if this was reversed and it was a man telling his wife she couldn’t get her tubes blocked, this would be a massive issue.", "INFO: what’s your plan for the twins as they get older? Will you continue to refuse to help and care for them? \n\nAll of your kids will wise up real fast to the fact that dad only cares about the big kids because they’re the only ones he wanted. You are JUST as responsible for the twins as she is, she may have carried them but they are still all your children.", "YTA. It takes two to make a baby. You could have had the vasectomy whether she liked it or not. You could have refused to sleep with her if you didn't trust her to take the pill reliably. It's always difficult when a couple disagrees on how many children to have as there isn't really a way to compromise, but you could have dug your heals in as your reasons for stopping at two were good.", "I think you both need to have marriage therapy. She feels neglected you feel trapped and you both have a right to feel that way. What you need is to find a way forward through counselling or to separate and co parent. Neither of you are wrong but i completely agree with you you saw this coming but that isn’t going to help you move forward", "Yta, you are an adult, these are your children. You don’t get a free pass to stop helping because you think you were tricked. It’s just an excuse to be lazy.", "YTA - If you were absolutely against having more children, then it was your responsibility to use a condom, not rely on your wife's pill. In addition, you should've suggested couples counseling to discuss your desire for the vasectomy and your wife's opposition to it. You didn't do any of that, and now, no matter how it happened, there are two more children that need parental care. This means that you need to help out or be prepared to be told to get out.", "YTA. I get that you're frustrated but these are your children and responsibility. This reads more like you want her to suffer as an \"I told you so\" move which is really gross. Grow up.", "ESH. You, because it takes two to tango, and while you had both agreed on using the pill as contraception, even if she was taking it absolutely perfectly every single day (and let me tell you not one woman on this planet does this), it’s still not 100% effective, so the onus, if you were dead set against kids, is also on you. If that means that there’s no sex without a condom, that means no sex. Those children are still your children, and your responsibility. They didn’t ask to be born. \nYour wife, because she seems to have thought she has control over your body by not allowing you to have a vasectomy, potentially messing with her BC and making sure you had more kids. Having children, particularly having MORE children, should be a mutual decision - however, accidents can happen. \nTreat your children with respect, and communicate with your wife.", "ESH. \n\nHer for wanting more kids when: 1. You didnt want to. 2. She was having trouble manage 2 kids at the time. 3. When your budget couldnt afford another one (even more two babies). 4. Because MAYBE she got pregnant on purpose (sorry, Im assuming, but I know some cases where this really happened)\n\nYou, because: 1. You could had made the vasectomy even if your wife disagreed. Its your body! 2. You could had used condoms to really be sure. 3. Despite all, the babies are here and you have to help. There are not \"I didnt agree with these\". They are your kids too so you have to help raising them.\n\nEdit to add: she refused to use condoms?! Come on??? How didnt you see what would happen?! It was clear! You put yourself up to this!", "YTA YTA YTA YTA. You got her pregnant, a vasectomy wasn't the only way to make sure you stopped at two kids. You reap what you sow, literally!", "YTA. You should have both been in agreement and since you didn't want to have more you should have either abstained or used condoms, forgive me if you did, I know fully well everyone can do what they need to and still pregnancies can happen, but the way you phrase it, sounds like the birth control was only on her end, so until you resolved the argument you should have either abstained or have extra protection and worry about her actually taking the pill every day.\n\nHowever, the deed is done, you now have FOUR children, is not about \"helping her\", is about being a father, that's not \"helping\" that's raising. Those kids didn't ask to come into this world yet here they are and they deserve your love and involvement, not because of your wife although she did just carry two humans to term, but because of them, what, are you always going to be a little away and a little resentful of them for the rest of their lives so they'll notice their brother and sister have more love and attention from you and involvement from you than they get? You already have four children, neither of them asked to be here, so you owe it TO THEM, to dedicate time and love and attention to all of them not just pick and choose because you're angry at your wife.\n\nETA: I just read a comment that \"she didn't want condoms and I can only hope she takes the pill every day\", yeah no, I'm changing my vote to Y T A because nobody forced you to do the horizontal mambo lol. You entered willingly (pun intended), \"just say no\", \"no glove no love\", are basic phrases you should have been in full knowledge of and used them", "ESH. Regardless of how the babies came to be, they're here now. By not helping your wife (out of resentment, as you admit), you might feel justified in punishing your wife (which, PS, is not actually justifiable), but you're also hurting all four of your children.", "ESH. I get the vibe she probably stopped taking the pill and lied about it, which is bull shit and absolutely unfair to you. But at the end of the day those are your kids and you’re really only hurting them by not being a proper part of their lives.", "YTA. The children are yours, you are responsible for your own fertility.  You are also responsible for your own offspring.  Help her or you may lose them all.", "“Barely ever missed a day” - it’s not a multivitamin. A day missed = y’all need to use a backup birth control for the rest of her cycle. \n\nBut yes, YTA. You live in a home and are raising a family together. You can’t draw a line in the sand and say “I warned you” when it comes to this kind of thing. It’s petty, and it’s hurtful - to your wife and ALL of the children.", "ESH parents like you guys are why kids end up w divorced parents", "I think this is an out out messed up situation. I’m going with NTA. You work not one but TWO jobs.  And on top of that she wants you to do MORE than what you normally do. You’re already exhausted from work. On top of helping at home. So how would everyone feels if you lose one or both jobs and will be unable to financially take care of the home. Because due to being exhausted, your work performance becomes bad? Then it’ll be your fault for losing your job just like everyone saying Y T A for not wanting to contribute more with helping with the kids. It a no win for you it seems.", "OP: This sub is notorious for having a strong female-bias. That's why pretty much every response you're getting is ignoring the fact that you're working two jobs and providing the level of help you were providing when there were only 2 children. That's also why they're failing to acknowledge the probable sabotaging of birth control that your wife performed to baby-trap you.\n\nNTA simply because you brought up your concerns and she very clearly ensured that she'd be able to get pregnant. Yes, AITA, birth control fails... but you have to be incredibly ignorant to ignore the timing here. He says no more children and she gets pregnant before they can come to an agreement?  Yeah, she stopped taking her birth control so she could guarantee another child. That's called \"reproductive coercion\". I wish I could say that I'm shocked that you guys are pretending it's not what happened here, but... well, I'm not an idiot and likely neither are you.", "I've read your comments saying she was in control of ALL forms of birth control...broski, if she didn't want condoms, you shouldn't have done ANYTHING. The fact that you blindly went along with it KNOWING she wanted an extra kid makes you dumb and responsible for these babies too?? They're YOUR kids. Be a father ffs.\n\nESH cause her trying to change your mind is also wrong IMO", "You're all the AH here. \nYou're behaviour will show in your child's development and do you really want to mess that up for them because of you and your wife's mess?", "Those twins did absolutely NOTHING to deserve neglect from you. YTA.", "YTA", "NTA. Please be careful. A dear friend of mine started to panic when her husband scheduled his vasectomy after their second child despite being in circumstances similar to yours. She made him cancel it the day before. They now have six children (4 were “accidents”).", "YTA\n\nShe said no to a vasectomy and to condoms? cool, then no penetrative sex for her, from you, until you both figure out a way forward.\n\nTHAT is how you behave if you're back is against the wall. That's how you show her you meant business.\n\nthese are yours kids you're neglecting. Would you rather divorce her so she can take all four kids and find a man who wants to be their dad?", "Yta you, knowing you wanted no more kids, continued to have sex with her. That's on you.  They're your kids, you need to actually parent them.", "YTA.\nRegardless of how you got in this situation, you and your wife have four children.  Your behavior is creating a very toxic home life for all of these children, and they are innocent in this fight between you and your wife.\nIf you can't get past your suspicions, then get therapy!  Your attitude isn't making you happy either.", "YTA you can f**** her but you can't help her?", "YTA. The twins wouldn’t be here without you. Also, it doesn’t do any good to say “I told you so”. They are here and there is no going back. No one knew you’d have twins and your wife is probably just as overwhelmed.", "Unless you have zero idea how children are made by this point, YTA. You don’t need her permission for a vasectomy and if you couldn’t come to a resolution, you should have abstained or used condoms.", "YTA and a loser too. She didn’t fall pregnant and men who don’t want kids are in control of their own bodies, you had just as much choice in the matter as she did and you made your choice. She’s gonna leave you one day and you’ll know why.", "you had sex, presumably without a condom (birth control pills are not super effective).\nyou took the risk, so yes, you did have children with “consent”.\nYTA.", "Do you trust her? She wanted more, she got more. You however didn’t need to obey her command of no condoms. That’s on you. ESH", "Yta, you should have worn a condom,  or refused to have sex.   She sucks too,  but these kids are here and you created them,  you need to step up", "YTA. You ejaculated sperm into her vagina.  Birth control pills have never ever been 100 % effective, data everywhere says 80% at best. Condoms are 98% effective if used properly.  Did you use a condom?\nYou gambled and lost, so help with your kids and perhaps help your SO get a job/ apply for assistance so that you can afford the children you fucking brought into the world.", "Obviously YTA, those kids cant pay for your mistakes and that is what your doing.  Making them pay because you couldn’t say no to sex because she said no condoms.  You dont want more kids, then no to sex without condoms.  It’s really that simple.  You also clearly had time to get a vasectomy so stop using excuses and raise your kids.  This isn’t a “i told you so” moment.", "YTA. \n\nYou made the choice to have sex without condoms. \n\nGrow up and be a parent to your four children.", "YTA.\n\nYou should've told her if you couldn't get a vasectomy she won't get any pleasure from you. Yeah I think it's odd how she rejects condoms and doesn't want you to get a vasectomy but you shouldn't let yourself go through this.\n\nBut you have two extra kids who love you so you're gonna have to be there for them. They need you, and sometime you're gonna realize you need them too.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nWe have 4 kids together in total ages 6, 4, 1, 1. For context I have always been vocal about not wanting more then 2 kids. Our first born is a boy and second born is a girl, so I was happy to have one of each. I am the sole breadwinner as daycare costs would not make it worth it for her to work as well. \n\nAfter our second child I told her I was done and wanted to have a vasectomy, she was against that and wanted to have a third. We fought about this for months (I didn't want to get it done against her will), her reason for wanting another was that she always wanted a bigger family. My reason against was that I felt that she had a hard time keeping up with daily tasks with only 2 kids, I also spoke to her at length about how another child would be financially unsustainable since I have 2 jobs and am barely making ends meet (not to mention that I too am exhausted all the time).\n\nAnyway, before we could reach a conclusion she fell pregnant (she was on the pill and according to her, barely ever missed a day). We now have a total of four beautiful children that I love, but I can not bring myself to giving her the extra help for the twins. We now are stressed and fight all the time. I sometimes want to help her with the twins but it gets me so discouraged to see everything I warned her against come to pass. I know they are my children too, but it is not fair to get yourself in a situation when everyone is advising you against it.. then ask for help when the shit hits the fan.\n\nTLDR: wife didn't want me to get a vasectomy and now she had twins that she needs constant help with.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA", "YTA. You didn't want more. Fine, that's absolutely a stance you could take. But you also could have had a vasectomy, or used condoms, rather than just relying that your wife would not become pregnant.\n\nThey are *your kids*. If you weren't willing to participate in raising them, you should have made sure on your own they were never conceived. Now that they are here, you *absolutely* have a duty to care for them.", "YTA,  You guys are a team, or you aren't.  There is no halfway here.", "As a mother of twins, GTFOHWTS and YTA", "SHE FELL PREGNANT\n\nNo bro.  You purposely put YOUR dick into her and YOUR sperm got her pregnant.  YTA and also apparently don't know how babies are made since you're blaming YOUR ejaculation on your wife.", "YTA. The kids are here now and need to be cared for. Holding onto the past argument is moot and doesn't absolve you from the responsibility of caring for your kids. You willingly continued to have sex knowing the risk of potential birth control failure.", "Yta \n\nIf you did not want more children you should not have been having sex without at minimum taking care of birth control for yourself (ie condoms). Also it is YOUR body. You get to decide if and when you have a vasectomy, your wife does not get to decide that. You can consider her opinion, but ultimately you chose to delay the vasectomy and now you have twins.\n\nThose babies are here and you owe them care\n\nYou don’t get to opt out because you didn’t want them. \n\nGrow up.", "Yes, YTA.", "YTA. Stop it, dude. They're your kids. You helped make them, and you don't get to tap out on the last two because \"I didn't want them.\"   \nYou know where babies come from. Your wife lied to you about being on birth control, and you're the only one surprised by this.", "YTA. It is not those kids fault it’s come to this. You also bear responsibility and need to step up and care for them. You can resent your wife for it, but don’t take it out on the kids. You had lots of opportunity to not make her pregnant and didn’t care enough to be careful. Suck it up and be an adult.", "YTA. I wanted to do \"ESH\"- but we're past that (IF and only if she was purposely screwing up on the birth control, there's nothing wrong with wanting a larger family, but really only if you can afford it). Sorry, wanted them, didn't want them, wanted a vasectomy, whatever. You nutted in her. Now you have more kids and you are responsible for them. If you didn't want more kids, you should have \"my body/my choice\"'d it and got the vasectomy. You clearly didn't trust the birth control, no one was stopping you from wearing a condom my dude.\n\nYou start walking around the how telling your wife you aren't helping with the twins because you didn't want them? Jesus what an AH. You want your other kids to know that? How about your twins when they grow up, do you want your wife to tell them how dad didn't want you and so he decided not to help take care of you? Dude. You aren't going to win with this one.\n\n\"but it is not fair to get yourself in a situation when everyone is advising you against it.. then ask for help when the shit hits the fan\" Exactly. Again. Vasectomy. And shit didn't hit the fan, you had twins that have been around for a year now. Kids need to be looked after, and you have four of them. Get to work. It'll calm down over time, but you will need to start looking into ways to make life easier for all of you. Calendars, meal planning, chore division, tips online for twins/raising four kids- watch tiktoks of people who also have four young kids and try to relax a bit and be less on edge. Unfortunately, your CONTINUED ATTITUDE (I mean christ she got pregnant, carried twins for 9 months, and now both kids are 1 year old, you've had time to wrap your head around what's happening) is going to make everything much worse than it has to be.\n\nIf you love your wife, and you want it to work, you need to change your attitude fast- or you are going to be paying child support for 4 kids and taking care of those twins alone every other weekend.", "YTA. It’s not helping, it’s parenting. Didn’t want more kids? Should have kept your dick in your pants until you got a vasectomy. Your body, your choice.", "YTA take care of your kids. You wanted sex, you deal with the consequences.", "YTA Are you going to make these kids feel unwanted their whole life\n?", "YTA dude. The problem is that you are not giving the love you should to your twins. I get that you're pissed at your wife, but you are inadvertently taking this out on your children, not your wife. Dude, life isn't fair, get over it and get on with what you know is the right thing.", "YTA. You didn’t need her permission to get a vasectomy, you made the conscious choice not to have one. You made the conscious choice to have unprotected sex. You had just as much to do with making those babies as your wife.", "Do the vasectomy. She is applying \"my body my choice\". So do you.\n\nGL, cause its gonna be hard", "ESH", "“Barely ever missed a day” of the pill is the same thing as not using any birth control at all. You have 4 children, not 2. You are responsible to raise all 4 whether you want to or not. All of your children are going to resent you both and probably each other later in life for your own resentments towards each other. You don’t use a living human being, and in this case 2, to teach another person a life lesson. ESH.", "I understand your feelings being hurt, but this kinda has the same energy as \"YOU'RE the one who wanted a dog, so I'm not gonna feed it or walk it or pick up its shit.  That's on YOU.\"  And that's not cool.\n\nMy dude, these are your kids.  They didn't ask to be born.  And they sure as hell didn't ask to be the object of their father's resentment.  They didn't do anything wrong, and yet they are being effectively punished for merely existing.  And as much as you put this on your wife, it's no mystery where babies come from, so if you hadn't wrapped your mind around the potential of more kids, you had the option of not having sex with your wife until you were both on the same page.\n\nThat said, I'm having a hard time deciding between YTA and ESH because your wife absolutely bears some responsibility here as well and y'all shouldn't have had more kids until you were BOTH ready for it.", "ESH, but leaning strongly in the YTA direction. Your twins didn’t have a say in the matter, and being hands-off is not the way. They’re your kids, they happened.", "YTA. You are just as much to “blame” for her getting pregnant as she is. The kids are here. Step up and help.", "Should have given her an ultimatum. Condoms, vasectomy, or anal sex. Take your pick. ESH.", "YTA. At least in answer to if you’re one for not helping with the kids. She’s an AH along with you for why it got to this point. The biggest reason you’re the AH for not helping has nothing to do with her and everything to do with the two small humans you helped bring into this world and making sure they get the same love and care (not just the fun stuff!) from you that you have been willing to give the other children. Don’t let resentment for your situation poison the lives of those kids. And get the fucking vasectomy.", "YTA you’re not “helping” her raise the children you are the father therefore it is your responsibility.  You realize birth control can fail and is not 100%? Sounds like she was respecting your decision (which is why she was on birth control) and it failed and got pregnant again. If you were so against it you should’ve worn a condom for EXTRA protection. Birth control is not just HER responsibility it’s yours as well.", "Complete asshole.  You made this situation happen, period.  Wtf did I just read?", "You’re a fucking chump and bordering on deadbeat. Take care of your kids and partner for Christ sake.", "Also YTA. It is not **help** they are **equally** your responsibility. If you hate the situation so much leave and give up custody. If you stay parent fully.", "YTA.  she wanted kids, wouldnt let you get a vasectomy (whatever that means), said she was \"on the pill\" and you still banged her?  now youre complaining?  lmfaooooooo  well well, if it isnt the consequences of my own actions.", "Dude grow up. If you have sex expect kids. YTA", "YTA and you seem to feel justified in punishing her for having the twin babies YOU made with her. \n\nYou are punishing your wife and your children. \n\nDoes that seem ok to you? I only ask because you actually had to ask if you were being an AH, which again, you are.", "YTA.\n\nYou didn’t want more kids, she did, and while the two of you were trying to resolve that issue, she wound up getting pregnant. That’s too bad, but now you have the kids. \n\nIt’s not their fault that they are alive. You should be helping with them just as much as you would be if you’d enthusiastically wished for them to be born. Honestly, if either you or your wife has any free time at all with this many small children running around, I would be very surprised. \n\nYes, this is a season of life that is really hard. It will eventually get better as the kids get older.", "YTA\n\nThey are your kids, and you are refusing to engage with them, because of a mistake you and her made.", "If you don’t want kids you wear a condom. If wife doesn’t let you then you don’t have sex it’s as easy as that. Like it or not those kids are yours and you have to look after them. You say you love them yet do nothing for them. These poor babies are going to grow up with so much trauma because daddy will look after older brother and sister, but ignores them because he wants to say I told you so to mum. It’s too late to decide you don’t want more kids you have them so you need to look after them. If not then divorce her and pay her child support instead, but custody won’t let you only look after 2 of your 4 kids. \n\nThese kids are innocent in this so be a fucking dad to them.", "YTA. Regardless of whether you wanted them they are your children and deserve love and care.", "Honestly NTA I feel like she baby trapped you with your twins. Chances are we didn’t take a pill on purpose. I know they’re your kids but I wouldn’t help out either", "YTA, 100%.  Life doesn't always go as planned.  Your wife didn't get herself pregnant.  I sense some distrust that she didn't actually take her pills and if so that's really shitty and you need to decide whether your marriage can get through that, but regardless the kids are here now.  Your choice isn't two kids or four kids... it's either four kids with a present dad who is emotionally invested, or four kids where dad neglects two of them and causes a wealth of sibling, parental, and spousal resentment for the rest of their lives.  You get to pick which one you want to live with.  \n\nFrom personal experience, husband and I planned for two kids.  We were kind of shoddy with birth control because I had a hard time conceiving in the past.  Surprise, we ended up pregnant with our third.  So we talked about it, we decided we wanted to have the baby because we didn't feel very good emotionally about the alternative, and from that point on, she's just like the other kids in terms of parental investment, division of labor, etc.  If my husband didn't want to parent her because he didn't plan on her being there, quite simply we would be divorced because I'm not staying married to someone who neglects a child out of some sort of entitled pettiness.  For the record, unplanned kid is now a teenager, is a great kid, and we are so thankful we had her.  She is the greatest gift we didn't know we wanted at the time.  Thank God we treated her that way instead of sulking about how our lives didn't turn out the way we planned and it's not fair.", "ESH she should have taken the pill properly, you both should have had a grown up conversation about it & reached an understanding, if she didn't want to use a condom then you shouldn't have dipped your dick.\n\nThe twins are here now so deal with it & step up or step out.", "You have to find a way to get over it. Sorry it happened and:or if she tricked you but it’s water under the bridge now. Step up. I understand but YTA", "YTA, you are a grown up and should have had a vasectomy instead of playing with fire. No one is that idiotic that they trust their partner to take pill when the arguments are about the number of children.\nYou need to participate as a parent since you chose to have sex and not to sort out the contraception.", "YTA. They are your kids too and if you absolutely did not want any more children and she truly refused to use a condom then you shouldn’t have had sex. \n\nNot helping your wife with the twins isn’t punishing her, it’s punishing your kids. Grow up.", "YTA: while you and your wife were having serious conversations about expanding your family, you still got her pregnant,  Whether she missed a pill or not, the moment you realized she was dead set on having another you should have cut off all sex, used a condom or just gone and had the vasectomy.  Instead you made two babies and now you're punishing your wife and your children for something you did.  She didn't just magically conceive them.  You are being vindictive to prove a point, but this isn't making your partner find their own car keys they always lose.  This is two babies that are going to grow into people.  You need to get you and your wife into counseling immediately or your marriage is going to implode.", "wife didn't want me to get a vasectomy and now she had twins that she needs constant help with.\n\nDidn't you have part in making those twins? Even less money to dig HER out of the situation she placed herself in? She was on BC...how is this entirely her fault? \n\nYou are a major AH", "YTA!!!! You are very much the Asshole. Your wife can’t dictate what you do with your body. If you don’t want kids, don’t have them. If you’re going to make an excuse about your wife “not letting” you get a vasectomy, refusal to use contraceptives… DON’T HAVE SEX!!!! \n\nBut you did, now they’re here. They’re your children and you better step up! They’re not just mindless babies, they will grow into real people! Like it or not, they’re your children and you need to get over yourself and take care of them!!!", "Dude yta.\nDon't want kids get a vasectomy! You don't need her permission or to go behind her back it's your body your call if that was dealbreaker for her then you should've split. I get that she lied about birth control and she sucks too, but your taking your anger towards your spouse out on your kids is fucked up, as manipulative as your spouse is and she is don't get me wrong at least she's not using the kids to get back at you like you seem to be.", "Yta. \n\n\nBuddy it takes two to tango, should’ve been wrapping your Willy if she didn’t want you to get a vasectomy. \n\nJust because she wanted more kids and you didn’t sorry to tell you here reality. \n\nYou a grown adult dad of two who laid down in bed and had sex with your wife didn’t take any extra precautions to make sure she didn’t get pregnant, and if you didn’t want more kids and you didn’t get a vasectomy there are things called CONDOMS. \n\nYou’re truly the AH here and you need to actually help your wife. Not watch her struggle so you help with the other two there was absolutely no mention of you helping with the other kids you wanted so badly.", "YTA you had sex, no condoms ? You are the Daddy start acting like one", "ESH", "Stop being a dick and go help parent.\n\n\nDamn redditors think they can get out of responsibility cause they feel like it...... geez.", "YTA  \nWhile I understand you wanted to stop having children, and your wife did not...   \nI am assuming it was you who impregnated her... meaning they are your children and your responsibility.   \nWill you keep shitting the bed on helping out with them when they get older? Don't you think they will notice that their older siblings get help and love and care from dad, while they do not?   \nDon't you think your wife will resent you a whole lot?  \nDo you think it's fair to take out this frustration of yours, on your innocent children?  \n\n\nWake up man. These are your kids, and they're already a year old and you're asking if you're an asshole for not helping with YOUR kids?  \nI'm sorry but you can't say that it was just your wife \"getting herself\" into the situation, when it sounds like it was YOUR SPERM that fertilized the egg. IMO you should have told her you would not be having any of the sex until you guys reach a decision, because at this point, you're punishing your poor twins, not just *the* twins, these are YOUR twins. Give your head a shake. You can pout all you want about it, but YOU BOTH got yourself into this.", "So…you’d rather be right than have a peaceful home life…look, no matter what, you can’t unring a bell. The decision was made ( whether YOU feel that you had a say or not…that’s a different conversation). The kids are here and you’re still holding on to resentment and the fact that you just have to be “ right”. YTA. Grow up, get over it and move forward…unless, you’d rather be right and divorced.", "YTA. They’re yours whether you planned them or not. Your issues with your wife and family planning need to be kept separate from caring for your children.", "YTA, your punishing two innocent children and are going to screw up the 4 sibling relationships. Kids are smart they see and hear 100 times more than adults ever grasp. \n\nYes they are young just now but one day very soon, Your older two will begin to see how little you do for the twins and if you don't get your head out of the cloud's quickly, your twins will also feel the rejection. \n\nThat kind of damage affects kids well into adulthood. Fix yourself before your kids have to spend their adult lives fixing the emotional neglect you caused them.", "YTA \n\nAt the end of the day the only ones you’re hurting are your children. They may not see if now because they’re babies- but if you’re still acting this immature when they’re older and not helping, they’re going to think they’re the problem- **but they’re not- you are**\n\nEDIT: it literally takes **two** people to have a child. Your wife didn’t get herself into the situation, you both got yourself into the situation, by not using protection or just not having sex at all. You are both adults, take responsibility for your goddamn mistakes.", "YTA. You’re talking out your frustration on your kids and they will notice it as they get older.", "YTA - a common side effect of penetrative sex is pregnancy, or have you been living under a rock? This is on both of you. If you were adamant about no more kids, you should have had the vasectomy. The twins are here now and you can’t opt out of their care.", "YTA, you chose to have sex knowing all the risks. This isn’t a dog you get your kids to “teach responsibility.” Grow tf up", "YTA. I’m really sorry you are in this situation, but she didn’t “fall pregnant” on her own- you two had sex and it resulted in children— like it has in the past. \n\nIt was nice of you to consider her opinion on your vasectomy, but it’s your body, your choice. \n\nUnfortunately this is the situation you are in. You absolutely must step up and be a father and partner; the other option is being a deadbeat who’s wife & children resent.", "YTA\n\nYour wife might also be TA if she planned to fall pregnant intentionally when you didn't want to (and you were sorta dumb to not use a condom when you felt that strongly about not wanting a baby), but regardless, the children need and deserve the care of both parents, and you ignoring them in some kind of petty revenge towards your wife makes you TA *towards your kids* who have no fault in this whole thing.\n\nAlso it's not \"helping your wife\"  it's parenting your children.", "YTA. But both of you are. Go to therapy or something because if you both keep acting like this, you will end up in a divorce. Also, your twins will grow up thinking you don’t love them, and your other two kids will grow up thinking you love them more than the twins. \nEverything in your situation sucks.", "Ur wife was selfish ur not the asshole", "YTA.  You don't get to opt out of taking care of your twins just because you didn't want them initially.  You chose to stay with your wife, now you have to deal with the consequences.  It absolutely sucks, but it's insane to think that you can ignore the twins.", "NTA but I think this is above Reddits paygrade - I understand the anger and feeling trapped, but you should have gotten the vasectomy regardless of your SO's opinion- all this got you were 2 kids you don't want. You need some therapy to get past the resentment because the kids are going to notice.", "ESH  \n\n\nAlso, y'all need help with cleaning and childcare bc that is a lot. It'll relieve some stress. The toilet doesn't care who cleans it. The kids need their parents to be happy and there for them  \n\n\nI bet those twins are cute as hell. You should play with them once in a while  \n\n\nAlso, y'all need help with cleaning and childcare bc that is a lot. It'll relieve some stress. The toilet deosn't care who cleans it. The kids need their parents to be happy and there for them", "What the fuck is wrong with you? Those are you kids. Step up and be a fucking man and raise those kids. I told you so attitude is very immature and needs to stop now. Help with YOUR Children.", "YTA get marriage counseling and don’t neglect your children", "YTA", "YTA. They’re still your children.", "INFO:  Aren't you supposed to take Birth Control EVERY DAY for it to be effective?  If you miss a day or two, doesn't that mess with the cycle?\n\n*she was on the pill and according to her, barely ever missed a day*\n\nThis tells me that she missed taking it some days.  Maybe this was intentional?", "ESH- when you’re trying to keep from having more children, you make sure BOTH of you are using reliable birth control. No condom=no sex. “Hardly ever misses a pill” all it takes is missing it ONCE. She waited until she was pregnant to tell you she missed them, which means she knew this and that’s why she wasn’t taking them daily. She willfully missed them to get pregnant again. With that being said, don’t take the resentment you have for your wife out on two innocent children. They didn’t choose this situation and you being an absentee dad to them isn’t right nor is it fair.", "YTA and ESH!\n\nYou may not have wanted them.......................but you made them none the less.\n\nYou do understand responsibility is not about intention or wants, but about actions and consequences?\n\nAll your doing now is just whining say \"I told you so\" and even if you did.  You know how much that helps the the situation YOU BOTH CREATED.  Yes.  BOTH.  It does NOTHING!  WORTHLESS.  You are detaching yourself from a situation that is YOURS!  She asks for help when shit hits the fan and you think that it's soley on her?  WTF?  What are you?  A responsible adult is not what comes to mind.\n\nIf you REALLY felt this way, you should have done the vasectomy and if you suspected your wife would go to this length should have worn a condom.  None the less you created these two babies and now just whine about it saying \"I told you so\" as if you had no part in the process.  It's pathetic.  Sure, she has her part in it.  I'm not saying she's not responsible.  But anytime your thinking \"I told you so\" you should be telling that to yourself too!  Just pathetic.\n\nI feel sorry for these kids caught between two people fighting over a moot point as if it's going to make them disappear suddenly.", "YTA. I am sorry that you didn't want more children, but I highly doubt you were coerced into having sex with your wife. You don't get to pick and choose when to parent. I can't even imagine having twins, plus two more littles, and a spouse that refused to help based on some underlying resentment. Help your wife. Be a parent. Go to therapy.", "YTA, ultimately, you are creating even more problems here by neglecting the younger children. The older kids will follow your lead. \n\nYou knew she wanted kids but had sex \nYou helped create these kids\nYou seem to have been desperate to say I TOLD YOU SO!! \n\nTHESE ARE YOUR KIDS!! EITHER DIVORCE THIS WOMAN IF YOU CAN'T LIVE WITH HER, BUT YOU STILL HAVE RESPONSIBILITY FOR FOUR 4!! KIDS!!", "YTA. You shouldn't have had sex with her again until after you resolved the conflict between you. Now you're punishing her; you know she's struggling but you're happy to force her to struggle even more. And as a result you're punishing your own kids too. You're being very selfish.", "I... I don't think the childcare is your biggest problem here. But YTA - if there is a dealbreaker, you need to adress it. Not wanting to have more kids vs wanting to have more kids is a dealbreaker. \n\nBut those are not your wife's kids. Those are both of yours. You're their Dad. Step up and refuse sex without a condom and CARE FOR YOUR CHILDREN FFS", "Yes, yta.", "YTA.  Unless she drugged you and took semen while you were unconscious, you are a co-equal partner in this (you had many choices to avoid a pregnancy up to and including not having sex).   \n\nThey are you children.  Step up, man.", "Yta. Those babies will feel your hatred one day. Also, thr older ones will start treating the twins poorly after seeing you do it", "YTA. youre the one who got her pregnant. you don't want to help with the kids? Just leave then. you don't get to be a part time daddy", "> We now have a total of four beautiful children that I love, but I can not bring myself to giving her the extra help for the twins. \n\nSo you’re loving your children… through your neglect?\n\nThat’s despicable. \n\nYTA", "YTA\n\nGet therapy", "YTA. You could have had a vasectomy, you don't need her permission. It's your body, your choice. I also think you're failing to realize how choosing not to help her with the kids is going to have an impact on the entire family, not just your wife. The amount of childcare just doubled, and you said she was overwhelmed before. You shouldn't be refusing to help her out of spite or to show her that you were right and more kids was a bad idea, you should be doing what you can to make sure that kids are taken care of. \n\nI think part of your post suggests that you don't think you're responsible for the twins in any sense. You could have insisted on condoms, you could have insisted on a vasectomy, you could have refused sex, etc. You are responsible for birth control as much as she is, and if you knew you didn't want more kids you should have done more to prevent another pregnancy. That being said, now that the kids are here, neglecting them is wrong.", "YTA. You got her into that situation just as much as she got herself into it. You could have wrapped it or gotten the vasectomy. You aren’t “refusing to help with the twins” you’re being a deadbeat. It’s not helping her, it’s literally your job.", "YTA.\n\nYou had unprotected sex. Duh. Those are your children. Man up and deal with the consequences of your actions.", "YTA- not the victim 🙄 put on your big boy pants and help care for the kids you helped create.", "Takes two to have a child stop finishing in your wife if you don't want kids YTA", "YTA. Ok, so no vasectomy. You had other options: condoms, no sex, pull out method etc. You did not have to rely on her pill being effective; everyone knows the pill is not 100% effective. Clearly it's easier for you to put the onus of protection entirely on her rather than taking any responsibility for your own actually. \n\nThis isn't about you 'helping' her, it's about you acting like a piss poor father. They're your children. So parent.", "YTA.  If you were so against having another child you should have been better with birth control.  The pill isn’t 100%, and where are you efforts in this?  Condom?", "Yta. \nSorry but you know how kids are made, should've kept it in your pants till yall made a decision", "YTA. You didn’t control the situation how you wanted so now you’re punishing your wife.", "You don't really need us to tell you, right? You know YTA. Go get that vasectomy. You've earned it.", "No birth control is 100%.  You sound as if it feels really good to be like \"I told you so\".", "YTA. It takes two to tango. Yes obviously she most likely forgot more than one pill and that's all it takes to get pregnant by the way so here you are while she barely ever misses pills. I wouldn't have sex with someone who is even missing a pill let alone history of missing them every now and then. She wanted another baby and she got herself another baby. However as they say be careful what you wish for since she got twins out of the deal. Yes you should still help her doesn't mean you have to bend over and do everything but you have four children that you need to help her with. Maybe she can go get part-time job or do something from home. Obviously she's not going to be able to really do much for at least four more years. But I get your bitter about the situation and think well this is what she wanted so she's going to have to do it. You keep that up you too will be divorced and you will be a every other weekend dad.", "YTA. If you were so sure you didn’t want more kids you should have had the vasectomy. Now you’re blaming your wife for your lack of spine and punishing the babies you helped create.", "YTA. \nRegardless of your particularly crappy version of \"I told you so\", those children are still as much your responsibility as they are hers. They WILL notice that you're effectively an absent father in terms of how you care for them (i.e leaving it all to your wife) and they WILL hold it against you. Yes, all four of them. Maybe not now, maybe not in a few years but eventually your children will notice that you *only just* managed to do the bare minimum. \nYou're only one step above a deadbeat. Do better.", "YtA", "YTA.   \n\n\nCoercion or not, it does not matter. Why? Great question. Because the ones that will suffer are the kids. They will see the disparity in how their siblings are treated by you and how they are treated. They will sense your resentment and your lack of care. They will internalize this treatment and they will suffer for it. And knowingly treating them with contempt, even if you don't think they'll notice (they will, trust that), they will be the ones to be punished, not your wife. And the older ones will pick up your treatment as well, and that's a whole other ball of therapy worms you're planting in 15 years.\n\nRegardless of how they got here, they are here. Step up and be a decent father to ALL of your children, or step out and admit you are a poor father to all of them.", "YTA you wanted the vasectomy so get it already. Get an appointment with a urologist today. Would it have broken your marriage? Maybe. Will this situation ruin your marriage and screw over not 2 but 4 kids? Probably. You got twins they are yours, you are their father. So be a father stop punishing your children for your shortsightedness and your wife’s lying about BC. Yes I think she lied to you about it. Get a vasectomy and a marriage counselor. Be a dad already to your 4 kids.", "same way we advocate for our body our choice, its your body and your choice to have vasectomy. YTA & YA WIFE too.", "Change your thinking change your world, change your income… remove the victim mentality….become\nSolution oriented… truly. \nAlso, you did take action in having sex, also now your responsibility….", "YTA. I don’t need to repeat all the reasons why because the comments have done that.\n\nBut…kudos to everyone for these amazing comments and holding him accountable for his reproductive responsibilities!", "Oh yeah YTAH!!! Like one the the bigger AH’s!!", "YTA and if you don’t start helping you’ll be paying child support", "YTA.\n\nHow long do you plan to keep this up? When they get older, how do you explain that you are only going to go to your older kids' piano recitals or ball games but the other two can go kick rocks?", "YTA - even aside from the parts about your wife you are now showing all 4 of your children that you have ‘favourites’, ultimately you still had sex knowing there was a chance of pregnancy. You can’t opt out and sulk because that sex led to a pregnancy.", "YTA. It's not about her it's about the kids. They need you even if it's \"more help.\"", "YTA \n\nYou're placing the \"blame \" solely on your wife as if you didn't participate in the making of them.\n\nYou even blame your wife for YOU not having a vasectomy!  It's YOUR body so YOUR choice!\n\nHow dare you take yours and your wife's actions out on children who didn't ask to be born at all but especially to 2 selfish people.", "YTA\n\nSo she got herself pregnant? BC is not just a woman's responsibility Mr  1950s.", "Yta this is awful. Your twins are growing up wondering why their daddy doesn't bother with them. Forget your marriage, that's done you can't come back from this, but those twins? You could start fixing this now. But you need to start now. Because without that bond, you're fcking them over.", "She “fell” pregnant. No dude. She became pregnant after you had unprotected sex.", "YTA. This is called actions have consequences. You had no issues making the twins now you gotta stop being a baby get over your anger and help take care of them. The kids are innocent in all of this. You think your punishing your wife but your really punishing the kids. Knock it off be a man and take care of YOUR kids.", "YTA. You’re depressed and angry and need a good therapist. Being mad at your wife and taking it out on your kids is no way to live.", "YTA and doing a grave injustice depriving your kids of an involved and active father, an actual father. Pathetic.", "YTA. They're your kids. It's not fair to them to not get the best care you can provide. Your dispute with your wife isn't even relevant at this point. Too late for that, now you need to deal with the present reality which is that your accidental twins need a lot of care. Yeah, it's frustrating to deal with watching bad things you knew would happen come true, but that's part of life as well.\n\nGrow up.", "YTA - this isn’t a stray dog she brought home without asking you, they’re YOUR kids.", "How, exactly does one \"fall pregnant\"? You knocked her up, dude. Handle your business. These are YOUR children. YTA.", "YTA Regardless of your feelings or the situation, they are your kids, you said it yourself. Make sure she isnt going to burn out, could effect the level of care she is able to provide for the kids and mess with her mental health. Get the snip haha \n\nBtw shes also an AH.", "Grow the fuck up dude. You chose not to get the vasectomy, you chose to have sex, you chose to stay with your wife—these are YOUR consequences as much as hers. Stop pretending like you’re some hapless victim here.\n\nYou say you love all your kids; do you really think this resentment you have for your wife and your unwillingness to help her with them to prove a point isn’t going to negatively impact them? Think with your brain instead of your dick for five whole seconds. You’re modeling shitty behavior for your older kids, you’re creating an environment where you don’t treat the younger ones equally, and you’re ruining your relationship with your wife. What do you want out of all of this? Because if it’s a broken home and fucked up kids, you’re on the right path. If you just want a little “I told you so” and half the responsibilities you currently have—tough luck, it’s too late for that. \n\nGet your shit snipped and figure out how to make this work before you fuck things up irreversibly. YTA.", "YTA. It takes 2 to tango, she didn’t get herself pregnant. You’re ruining your relationship with your children more than anything. Those 2 children didn’t choose to be brought into this world, you and your wife did that. Step up and act like a parent.", "YTA - your body, your choice. You do not need a partner’s permission or agreement to address your reproductive concerns. \nBut you chose to risk making more children so you are equally responsible for their care and upbringing.", "YTA. Don’t raw dawg your wife if you don’t want a baby", "Yta.  Your hurting your kids to punish your wife.  She didn’t fall pregnant- you put babies in her.", "I'm just curious how she managed to make the kids by herself?", "So…you’re punishing your children for something that is out of their control? YTA.", "YTA.\n\nSo, you're mad at your wife for having another child, but she didn't get pregnant all by herself.\n\nMeanwhile you've decided to punish your wife because you git her pregnant, but *you're also punishing your children*! Do you think your kids won't realize that you never wanted them? You're making everyone else suffer because you got your wife pregnant.", "Omg Yta. \n\nFirstly, you’re damaging your relationship with your children (twins) and that’ll connect someday with them. Therapy is expensive so setting your kids up to need it out of spite is just plain dumb. \n\nSecondly, warning or not - you chose not to have the vasectomy and I hope to God you have it now. You’re just as responsible for those kids as her. You didn’t want to do it without her knowing so you didn’t do it so she could get pregnant without you knowing? Either way you’re exactly where both would lead to (constant fighting) except now you’ve increased you audience to 4 kids from 2 and you don’t truly have the means (financially or emotionally) to support any of them. \n\nWelp - you both made your bed and you both need to lay in it but make no mistake you’re sharing the same bed. You trying to hurt your wife is only resulting in you hurting ALL your kids in addition to her.", " By middle of paragraph one I knew that yes YTA", "YTA! This are your kids too!", "“Barely ever missed a pill”—missing one single pill by even a few hours fucks the whole pack. You’re supposed to use backup birth control for the remainder of that cycle.\n\nI’m not surprised at all that she got preggo if you both aren’t following simple birth control instructions. Frankly you should have been using condoms regardless\n\nYTA you don’t get to wash your hands of your own damn kids", "YTA. She didn't get pregnant by herself. You are equally responsible for the twins. You need to step up and be a dad or risk losing your wife and kids. Do better.", "AH doesn't come close to it.", "She needs “help” with them? THEY ARE YOUR KIDS! Take some responsibility and buck up. YTA and a huge one.", "So thats wild. Your body your choice, get the vasectomy next time. \n\nYTA. Should've stopped fucking your hot wife if you cannot fathom to acknowledge kids YOU MADE", "YTA. You’re trying to put it all on your wife. SHE didn’t want to use condoms and SHE didn’t want you to get a vasectomy but where does YOUR responsibility come in? You could’ve told her that you wouldn’t have sex without condoms until this stalemate was resolved one way or another but you willingly chose not to do that. Now there’s 2 more children in that house that deserve their father’s support and involvement just as much as the first 2 children do. You can’t claim to love them but at the same time refuse to help take care of them it doesn’t work like that and I guarantee those kids are going to feel the difference as they get older. Do better.", "You are the asshole. Easiest one yet.\n\nNo soup for you, NEXT!", "YTA the twins are here now so you have two choices, don’t help with the twins and deal with the fall out that causes, both to your marriage and to the twins or move past this and be a good Dad. What your wife did was awful and she is an asshole for putting you on this position, however this is where you find yourself. Holding onto this is only going to end your marriage and  cause problems for your twins- they will become aware that you won’t do things that would help them, they are the ones being punished when you don’t help not your wife.", "YTA\n\nYou did the deed. The only 100% contraceptive  is abstinence. So grow a pair and stop being an AH. Irrespective of how 3&4 ended up as your children, it's on you to be a dad. Any dick can be a father, the question is can you be a dad.", "YTA. You're neglecting two of your kids because you decided to continue to have unprotected sex knowing she was not good at taking her birth control and told you not to use a condom. Wtf did you think was going to happen? Hopefully, you learned from this and got a vasectomy. \n\n\n\n She's an asshole but you're so much more of one.", "So... let me try get this straight..\nYour wife refused to anything that could help actually prevent pregnancy but the pill that you aren't even sure that her word is true that she hasn't missed a day.\nYet you still have the devil's tango with her unprotected creating the twins you now have and somehow it's still your wife's fault for 'falling pregnant'?\nYour pull out game being weak is her fault to?\nThe second she refused any protection you should've refused sex. Your own weakness of not being able to keep your horniness at bay brought this upon yourself. So you can't even cry wolf that you got baby-trapped as you went along anyway without protection and without force.\n\nETA: YTA.", "YTA ...a big giant one at that! She didn't do this alone and they are your responsibility too. Destroying your family to prove a point is a stupid and mean spirited thing to do. Get your ass in gear and help out before you lose your whole family. Jerk!", "ESH,  because you didn't get that vasectomy. What did you think might happen, given her desire for more kids? \nNow it's a shitty moment to shirk the responsibility, but back then it would have been your right!", "ESH. You are both assholes. At least you deserve each other. Although I have a feeling that you won't stay long together.\n\nPoor babies though :(", "ESH.  But the children are here and need a father.  \n\nAs soon as the youngest are in school your wife needs to get a job and share some of the financial burden.", "ESH They are your children. They are here now. You don't want them to think that you favour the older two or don't love them as much. They didn't decide their existence.\n\nBut also, leave your wife. Your relationship doesn't sound healthy. It kind of sounds like she went off birth control on purpose, which is a sexual assault.", "Good lord, you're both AHs!\n\nRegardless of your wife's feelings, you could and should have gotten that vasectomy if you were sure you wanted no more kids. It's your body and bodily autonomy applies to dudes too.  THEN you continued doing the deed with her KNOWING she wanted more kids, without even condoms. Are you SURE you didn't want more kids? Because that is the only logical outcome of how you were behaving.\n\nYour wife is the AH because according to you she struggled with the 2 you already had and you both were fully aware you couldn't afford more. And she \"barely missed a day\"? That's not how BC works. Even when you do it 100% right, accidents can happen.\n\nHowever, your kids are here now and you are as responsible for them as your wife. Man up and handle it.", "> (she was on the pill and according to her, barely ever missed a day)\n\nDid you know before she was pregnant that she missed some days. Barely ever is not ever that is very important.", "Bet you get a vasectomy now wether she agrees or not", "ESH.  Your wife for intentionally going off the pill and not telling you, and you for not taking care of your twins other than financially.\nI only feel bad for the kids.  You and your wife deserve each other. \n\nAnd yes, she lied to you and got pregnant on purpose.", "ESH, poor kids", "ESH. You should’ve had the vasectomy. She shouldn’t have manipulated you into more kids, I’m highly suspicious it was on purpose she ‘missed’ pills. All that really doesn’t matter now, you have two kids that are YOUR children and you’re punishing them by withholding love and support. You guys need marriage counseling now, and you have to stop taking out your frustration on YOUR babies. You aren’t helping her, you are parenting and that is your obligation.", "ESH\n\nShe says she \"barely ever missed a day\" of birth control pills? You might as well not take them if you're skipping days. Also, please say you have now gotten the vasectomy with or without her consent.\n\nYou're punishing your wife by withholding love from your two youngest children? What is their crime?", "ESH.", "NTA\n\nWhen will parents learn that the 3rd child statistically tanks the marriage?  She wanted them, she can care for them. You are working 2 jobs to support the brood she demanded. \n\nI hope you got that vasectomy while she was pregnant.", "You’re both the AH. Those are your kids and you share the responsibilities. She shouldn’t have pressured you since she knows y’all situation. She need to start working if you guys are going to be financially comfortable.", "Time for a divorce. The twins will never feel loved by you. This way you can forget they exist.", "They’re here now, continue loving them and be involved! They’ll be gone in the blink of an eye and you might need one to wipe your ass some day", "ESH\n\nYour wife is TA because she kept pressuring you when you made it very clear you were a nogo on more children, but\n\n\nMy dude, you had sex with her. You were fearful have having more children and still had sex with her. I don't buy her taking birth control. I know it does fail, but it sounds like she was pretty desperate for more children and it has happened where women have purposely stopped birth control to get pregnant. I have no proof of this so I won't count it against her. It's just a possibility. \n\nAlso, it is your body and your choice. You should have straight up told her you were getting a vasectomy and she had to terms with it. Your TA for not going through with the vasectomy and for putting all the blame on her for your inaction. It takes two people to make a baby.", "ESH\n\nBut also, \n\n>I didn't want to get it done against her will\n\n...she has no 'will' in this situation. Just as no man has the right to control what a woman does with her body, a woman has no right to control what a man does with his. If you wanted a vasectomy you should have gone ahead and got one. Leaving birth control entirely in the hands of someone who adamantly wanted another child and is aware that a vasectomy is something you want was incredibly foolish on your part. I highly doubt she was taking her pill properly, it seems much more likely she skipped it intentionally so she could get pregnant ASAP before the two of you came to a decision. This was something YOU could have prevented by taking control of your body. \n\nI don't believe anyone should ever have a child forced on them when they have explicitly said they don't want it, if it's not two yes's then it's a no. You had your opportunity to avoid this, and you didn't, so now you need to take care of all of your children.", ">before we could reach a conclusion she fell pregnant\n\nso you knew that you were in the midst of an unresolved serious conflict regarding the number of children you're willing to have and you kept having sex? the one activity that famously leads to getting pregnant? \n\nalso did you even *talk* to each other before getting married? how come you only found out after your second child that she wanted a bigger family?\n\nESH for marrying each other when you can't even agree on this one important thing.", "ESH. Your wife is wrong for pressuring you into more kids when you couldn't manage the ones you had. But you do have them now, and you're just as responsible for them as she is.\n\nShe has damaged the relationship and your trust in her. I'm not saying legit birth control failure can't happen, but given the context here I find it quite likely she just \"forgot\" to take a pill or got less consistent about the time she took it -- even if the failure was legitimate, given that this was at least 19 months ago and abortion rights were overturned 14 months ago she did have the termination option and chose not to take it. Which, of course, is her choice, and if she didn't want an abortion she was in no way obligated to have one (no one is ever obligated to abort any more than they're obligated not to), but not being obligated to do it doesn't exempt her from the consequences of not doing it. Those consequences are that she's hurt her marriage. Likewise, you could have chosen to hurt your marriage by getting the vasectomy without her agreement, and now you're dealing with the consequences of more children.\n\nThat said, you did have sex with her knowing this was an open question and that you were capable of getting her pregnant. You did father more children with her, and those are your kids now who are dependent on you, and none of this is their fault. It's them you're hurting by refusing to help her, not her (or at least, more than her). Your children are not getting the best quality of care they could be, and that's equally on you.\n\nI think the best way forward here is to acknowledge that it's unfair and it sucks and your relationship has been damaged, but it's not the twins' fault and they need you. You can decide whether you think your relationship is worth trying to repair -- if it is, couples' therapy. If not, separation or divorce (an in-house separation might be a good idea for you given the young children who need two caretakers). But either way, start helping with the babies. Don't blame or punish them for their mother's actions.", "ESH. Should have got snipped. If it's her choice to keep a pregnancy despite your desires, you had every right to get a vasectomy despite her wishes.....especially since there's a good chance she \"\"\"\"fogot\"\"\" to take a pill and that's how she ended up pregnant again\n\nEdit: changed verdict", "ESH You are both at fault, she for her wants, I don't know if she missed a pill or not and you for not being more pro active in preventing a pregnancy.    \n\nIf you really not wanted children you should been adamant about wearing protection.", "NTA but the twins will see the difference as they get older", ">We have 4 kids together in total ages 6, 4, 1, 1. For context I have always been vocal about not wanting more then 2 kids. Our\n\n>Anyway, before we could reach a conclusion she fell pregnant (she was on the pill and according to her, barely ever missed a day).\n\nESH\n\nYou (both) did the crime. Now you (both) have to do the time.", "ESH because you both should have figured out before marriage that you had completely different expectations how many kids to have. She should not have pressured you. However, you are the bigger AH because 1. You should have said no condom, no PIV, 2. You are neglecting innocent children because you feel angry at your wife. \n\nWhat do you think this will do to your 4 children as they witness it? You think they won't notice that you prefer the older two and hate your wife? That you wish the younger two had never been born? I hope you are saving up to pay for the psychiatric bills of all 4 kids. That is the reason you are the worst. \n\nYou and your wife need major therapy together. You can't pick and choose which of your children you want to care for. \n\nWith 4 kids under 6 plus money issues and a huge conflict between spouses, I would break down. I don't think I would be parenting very well. You need to hire some help (not family as that sounds like it usually increases stress on Reddit, lol). A house cleaner to come once a week, someone who can babysit or be mother's helper on a regular basis, or daycare. Get the older ones in school/preschool. \n\nDaycare is subsidized in many states/counties in my country based on income, or to allow the mother to work part time or take college courses to complete a certification for a better job. It's really helpful to have daycare because it helps the kids exercise & get outside, engages their mind, learn to be with other kids, and start to learn all the stuff kindergarten expects of them these days (which, trust me-- she won't have time to teach). Since you, OP, are not teaching them anything good with your behavior, I recommend looking into it!", "Nta. You didn't want a third kid. She did and now they are her responsibility. You are helping her still, which is enough. The only thing that you could've done was abstain from I tercourse with her if you didn't want to end up with another kid", "What does \"help with the twins\" mean, per say?", "ESH she clearly baby trapped you and you really could’ve wore a condom or refuse sex", "Nta I think she baby trapped you man.", "So, are you going to punish the twins just so you can say \"I told you so\"?", "You sound as if you believe you have no personal autonomy.  She didn’t want you to get a vasectomy or use condoms so you didn’t. That makes no sense.  If you were so sure you didn’t want more kids, you would have done something about it.  Blaming her is  copout.  Your body, your choice.  Sounds like you just want to pin it all on her without taking any responsibility.   You better learn to coparent well with her.  This marriage is toxic af.", "Lol dude, did she force you to have sex?\n\nHow are you going to explain to your twins when they are older why you aren't as involved in their lives?\n\nMassive YTA. \n\nTake care of the kids you helped create. Jfc.", "YTA You KNEW she wanted another kid, but you had sex with her anyway without using protection yourself. Now you are blaming it on her, when you are just as much to blame. She didn't get herself into this situation alone, and now you act like you don't want to be the parent of the twins. It's not THEIR fault, this is entirely on you and your wife. Man up and take care of your kids for fuck's sake!! And PLEASE get a fucking vascetomy before you have any more unwanted kids. You are a HUGE asshole. And so is your wife for tricking you into a pregnancy when you can't even afford it.", "my opinion will be unpopular however, I think you’re both the AH. I say this because my father also told my mother that he did not want more kids and like your wife my mother had twins. After the twins were born my father basically started to resent our whole family and eventually started seeing another women (who is now my stepmom). I think women should learn to respect their husbands wishes when in comes to procreation because the only ones who lose in the end are the children that feel unwanted and unloved.", "Men confuse me. “I didn’t want another baby but I still nutted in my wife and she baby trapped me!!!”\n\nIf you don’t want kids stop having sex or get a vasectomy. So easy.", "YTA! You weren’t so worried about only having 2 kids when you were having sex and conceiving twins. Step up and care for your children", "Wait, what?  These are your kids.  That situation sucks, but you had (I'm assuming) consented to have sex with your wife and she got pregnant.  Either parent your kids or get divorced.", "You should have gotten the vasectomy regardless then shrugged your shoulders when she asked about it.  Nothing she could do about it then.\n\nI told my wife I didn't want anymore than two kids, she was on the fence about the 3rd, I scheduled my procedure and made it a moot point.", "Really your are punishing your children.   Good Job!  They didn’t get a say in any of this.  The two youngest ones are always going to know that daddy didn’t want them - therefore probably doesn’t love them.  The two older ones are either going to resent you for screwing with mom, or more likely, make the younger two lives miserable by taunting them for the rest of their life that dad wanted US it he did NOT want YOU.", "YTA, they are also your kids, what's wrong with you? Yes, you foretold what was going to happen, but you bear as much responsibility as she does. You say that you didn't wanted to get fix if she didn't wanted you to, but did you really wanted to? You could have avoided this, but failed, and it's all on you.\n\nYou need to man up, you have four kids, not just the two you wanted.", "My friend got pregnant at 19 or 20 despite birth control. She gave the baby up for adoption, so it wasn't a baby trap situation. Birth control fails. Mine is supposed to stop my periods, and I still get it every so often. So for all I know, if I weren't 47 with PCOS, I'd find myself knocked up.\n\nThat said, ESH. You're TA because they're your kids; you can't just decide you're never going to feed them or change a diaper because you never wanted them. Is that going to translate to never going to their school plays and soccer games? \n\nYour wife is TA because she objected to you getting a vasectomy, and having kids is a two yesses proposition. Your body, your choice. You didn't need her permission, and I'm sorry she got pregnant again despite your objections.", "You’re a complete AH", "YTA. It took both of you to become pregnant. You can’t just ignore 2 children. Please get help or separate before they become aware of that.", "I don’t think ESH is quite strong enough.\n\nYTA - but it applies to both of you.\n\nThere are a hundred reasons why, that others have already listed.\n\nThe biggest reason is that the ones this will REALLY damage is your kids.\n\nI get it. You’re exhuasted from working two jobs. She’s exhausted from managing 4 kids (even though you help with two of them).\n\nAgain, it’s the kids getting the shortest ends of both sticks and none of this is their fault.\n\nYou two need counseling ASAP so you can lay aside all this resentment and come together for the sake of the kids.\n\nCause yeah, even though she has been an AH as well, if she walks out the door and leaves you the kids, how tired will you be then, and what will you have proved to anyone by acting like this? Same goes for her. If you walked out, what will her insistence on having more kids have proven to her?", "YTA it doesn't matter if you wanted the kids or not, you are the father and you fucking do your job. Hownisnit the kids fault you didn't come to an agreement with your SO?", "You know by having this attitude you just aren't creating problems within your marriage, your also going to create problems within your children.  That's  what makes YTA.\n\nYous couldn't agree on the amount of children and usally you see here on Reddit most say children need to be a yes from both but since they are here you have to be fair.\n\nJust imagine, (well you won't have to as they getting to that age) you are bonding with your two oldest while neglecting the twins.  Both the twins and other children, will realise that daddy doesn't like them and depending on how your oldest ones are it could be a source to bully from.\n\nI applaud you for exhausting yourself to provide and not walking away from the situation like some men we have heard do in similar scenarios.  However you need to be fair to all your children and also think what type of relationship you want with your wife.\n\nHonestly you not helping her will be a sore point and place of resentment which will effect your marriage.  When she finally gets to be herself and not just be the carer of the children you will see she won't be as selfless when it comes to you.  She won't make time for you because you couldn't make time for her when she needed it.\n\nI know you have your own issues with it all too, this why your being this way but honestly think if the shoe was on the other foot.  If YOU where the one in a situation that you needed assistance yet she won't give it to you as she told you it wouldn't be a good idea.  Your husband and wife, when you have the ability to help each other out you take your pride out of it and you help.  If you don't want to do that why are you with them.", "you chose to blow a load... it's your responsibility\n\nWhile no BC is 100%, I have a feeling she was not on the pill.\n\nESH", "YTA. I get that you didn’t want more children right now, but you have them. You’re not just punishing your wife, you are also punishing your children who didn’t get a choice in any of this. If you choose to have sex, you choose the possibility of having kids. I get it. Parenting is exhausting especially after working all day. But it’s a 24/7 gig. When you’re off the clock at work, you’re on the clock at home, and ALL of your children deserve time and attention from their father. You need to figure out a way to move past this so that you can be there for your kids.", "YTA. Whether you personally wanted more kids or not, the fact is those kids are yours. It’s not like she got a dog behind your back, therefore the responsibility for it should fall on her. They are equally as much your children as they are hers.", "Just one question. Is it worth your marriage? You have the kids now whether or not you planned on it. So, is it worth destroying your marriage over?", "If you felt so strongly - why didn’t you go ahead with the procedure, use condoms or abstain until it was done? It takes 2 to tango…ESH.", "YTA. It’s not that you are not helping her, it’s you ignoring half your kids. Changing diapers, feedings, baths, bedtime etc are all bonding times with your kids and you’re choosing to not bond with them to prove a point? Your kids are going to notice the divide. The oldest will see you neglect the younger and the younger ones will feel it, if they don’t already.", "You should have gotten the vasectomy.\n\nWhy deny yourself a vasectomy (which you claim u so wanted) in the name of \"not going against her\" BUT NOW YOU'RE NOT HELPING W THE KIDS?\n\nIn other words: Neglecting your kids is far worse then getting a vasectomy despite your wife saying no. \n\nThis is not time for the blame game. \n\nThese kids are innocent. Your wife is an asshole too. You're both stupid as well. I don't mean that angrily. I mean it subjectively.\n\nStand your ground once you figure out what your core values are and stick w them.\n\nAnd don't let the kids suffer. Im a parent of 3, single parent for the first two.\n\nI know it's hard but it's TEMPORARY.\n\nThey'll grow up. Life will have many changes.", "YTA.\n\nYou didn't need your wife's permission for a vasectomy (yet, sadly, women often need their husbands' permission, but that's another discussion). Your wife could have chosen to leave you and find someone who wanted more children.\n\nYou could have used condoms, or you could've chosen to not have sex. I'm hoping she didn't force you into sex, because obviously that's rape. \n\nSo if you didn't take any precautions, yes, you should help because you chose to have sex.", "YTA. You made adult decisions to have unprotected sex with someone who wanted more kids. Birth control is not 100% effective. So now your kids suffer the consequences of two adults decisions? I’m confused how you think you could possibly be right here. The fact is you participated in creation. The fact is the creations are here. The fact is you have 4 kids not 2. Get over yourself and be a father. Your behavior is disgusting.", "ESH.  And now resentment sets in and festers.", "It seems that people here really are trying hard to ignore OP working 2 jobs and still helping at home. If people comment without any criticism for the wife, just know that your bias is very clear. OP needs to take care of all his kids, but don't act as if this situation was caused by him alone. \n\nESH", "NTA. You’re working 2 jobs to support your family and helping with the older kids. \n\nShe’s dishonest. Definitely get the vasectomy now. Not sure I could stay married to a 🐍", "ESH, she def sabotaged the Birth Control- which is VERY BAD- but bro, why were you having sex with her (raw sex at that) when you knew she wanted another kid and stopped your vasectomy for it? Like, damn dude you know what makes babies right?", "The kids are here.   Time to man up.", "I originally was going to vote Y T A, but on reflection, it's ESH for me.\n\nAdding to your family is and should definitely be a joint decision. It wasn't her place to regulate your body in not receiving a vasectomy any more than it would have been right for you to demand she get an abortion. The two of you were at an impasse and until you jointly made a decision you should have been using back up methods of birth control, so that is on the both of you. If you do not want anymore than the four you currently have, I hope that one or the both of you have or are planning to take the necessary steps to prevent future pregnancies to avoid contention.\n\nWith regard to your not wanting to help with the twins, see my point above. If you also failed to use a back up method, no one bc method is 100% fail proof unless you are sterilized. Your partner should be able to expect just as much assistance with your twins as you give to your eldest two. You're a huge AH for acknowledging that you don't help with them as much and need to do better.\n\nPlease seek some counseling because your post is festering with resentment and blame to your partner (while not acknowledging the part you played). I understand that you are tired and stressed, but your kids deserve for you to try to work through your feelings.", "ESH except these poor kids", "YTA for the only reason that you're talking about human beings who will now grow up feeling you don't love them as much as the other 2.\nIt'll be obvious, the babies will even feel it now. For whatever reason, these are the cards you've been dealt with, just do the right thing.\n\nYou're acting like a dick, so did she but right now that hardly matters.\n\nGo re-train, focus on what you can do to earn more money without having to work 2 jobs.\nYou've got lost in self-righteousness with the kids as collateral damage", "YTA - whether you like it or not, the kids are yours too. Though she may have pressured you and perhaps wasn’t careful, you did help create them. The only way you could have truly prevented it is by vasectomy or abstaining from sex.", "Doesn’t sound great from her but at the same time why not put protection on if you were against it. Works both ways , but these children should not suffer they didn’t ask to be born but they should be treated and loved just the same", "She fell pregnant?  She literally fell into semen and magically became pregnant?  You didn't wear a condom as a backup and left the birth control to her.  My first born was conceived when I was on the pill and I was extremely responsible taking it.  It happens.  Regardless if she didn't take it properly on purpose..you as a man and the father are responsible for those children just as much as her and need to step up.  YTA.  Be a man.", "YTA ok antibiotics render the pill useless. Taking the pill a few hours late can also render it useless. The only 100% way not to get pregnant is to keep it in your pants. How did you get to be an adult male and not realise that having kids comes from having sex and if you dont want them don't have sex. Just as much your fault you chose to have sex with her or did she steal your sperm? Ontop of that, do you want to be a single man with 4 kids with your ex-wife trying to date on 40 percent of your salary? Help your dam wife and get over it. You did her now help with the consequences. Spend less time stressed and more time happy just by spending time helping with the kids that is way too much. Really? Divorce gonna be easier? Lord have Mercy", "Do you expect your situation to be easier as a single parent? Probably not huh? So help her out before you are one. YTA.", "You need to take responsibility for your own part in creating these children.  She is shady for incorrectly taking her birth control.  But, you could have insisted on condoms to add in preventing pregnancy.   These are your children and wanted or not it is part of your responsibility today.  You can't go back and change what happened.   You and your wife need to get in counseling asap so you can work past this.", "YTA. For starters, “she” didn’t have twins. Y’all had twins. You may not have wanted the babies, but they’re here now. You don’t “help” your wife with parenting tasks. You just do them. If you wind up divorced are you expecting to only get the first two and ignore the others?", "ESH but her more if she got pregnant on purpose. Y still the TA if you had sex with her without other protection other than the pill knowing that she wanted kids. Also the twins are already there so you cant just not help with them.", "ESH", "Vasectomy is usually reversible. \n\nYour body, your choice. There were other options too. Birth control isn't 100% the woman's responsibility. Even without the vasectomy, there were condoms. \n\nAnd why would you leave 100% of the responsibility to someone who already couldn't handle her responsibility according to you? \n\nThis isn't a thing you FAFO. \n\nYTA. \n\n(To be clear, everyone sucks here, but not as much as OP. )", "YTA\n\nIf you were really serious about not having anymore children then YOU should have taken measures to ensure you did not impregnate your wife!!\n\nYou were more than happy to leave protection to someone you KNEW wanted another child. Take responsibility for your lack of responsibility!!!!", "YTA- it takes 2 to create kids. If you were concerned about a bc malfunction you should have been wearing condoms or abstaining", "ESH\n\n>wife didn't want me to get a vasectomy \n\nNot her choice\n\n>she fell pregnant\n\nYou got her pregnant\n\nNo offense but this marriage is doomed. Your anger and resentment seems to already have suffocated out any love and attraction you have to your wife if all you are doing is arguing over your children. \n\nDo your kids a favor and end it, since you have no problem saying they are the problem.", "Your body your choice if you wanted a vasectomy you should have got one. Don’t bang your wife and be surprised by the results. Maybe go get the vasectomy and help your wife with your children doesn’t matter how they got here.", "She did not become pregnant by herself. You two need to talk- with 2 jobs, she should pull her weight. Also, try to include family to help you out.", "This is an ETA situation.\nShe's TA for pressuring more kids.\nYou're TA for literally ignoring your own damn children.\n\nSHAME ON YOU BOTH!", "ESH.  Takes 2 to tango, and you both had a hand in the creation of these twins.  Now it's time to take responsibility for them.  Might be time for you to start looking for a single, better paying job so you have more time to dedicate to the family.  Once the kids are all in school, then SHE needs to get a job, too.  And dude?  Get the vasectomy.  And go in for the follow-up.  These can fail, too.  Get into therapy, both of you.", "ESH. Y’all are too immature to be parents. Get some therapy before you screw up your kids.", "Unpopular opinion here… NTA. She’s a stay at home mom and you work two jobs. The kids and the house are her job.", "YTA. You had other ways to prevent pregnancy and did not choose them. And these children did not ask to be born. They will be seriously damaged by your neglect. You cannot take out your anger on them.\n\nI have great sympathy for your situation and would probably want to blame my partner, but again, I would do my part to prevent a pregnancy I didn’t want. \n\nYou are well and truly stuck and the only mature and responsible way forward is to make peace with it. Real peace. Get counseling, practice meditation, take up jogging—whatever works. And remember they are only children for a short time. And they are only terribly needy for a very short time.", "NTA", "ESH", "YTA. If you really didn’t want to have more kids, you could’ve wrapped it up or not had sex until you got the snip. You knew she wanted more kids, and you didn’t take adequate precautions, so now you have more kids. Be a father to them, for christ sake.", "So when these kids grow up some, are you gonna a be like, \"sorry, can't come to your game. Your mom baby trapped me and I'm not responsible for where I put my dick or anything that results.\"\n\nBuck up and deal, dude. This is what happens when you leave shit to chance.", "It’s not “help,” they are your kids and your responsibility as much as hers. \n\nBirth control is known to fail and you should have used a condom or other backup if you were dead set against another pregnancy. You could’ve gotten the vasectomy even tho she wasn’t in favor of it. Or you could have just not had sex til you got on the same page. \n\nBottom line, she did not get pregnant on her own and you have equal responsibility to these kids.\n\nYta", ">we could reach a conclusion she fell pregnant\n\nYTA. Fell pregnant? That's not how it works.", "This. I totally agree. YTA.\n\nLook, the kids are here. Your wife is drowning and instead of throwing her a life preserver you are standing on the boat with your arms crossed yelling \"I told you to swim!\" That won't help a drowning person. And if she drowns, how will that impact all 4 of your kids?\n\nThe only thing your behavior is going to cause is divorce or serious PPD. You two need counseling desperately. But what those kids need, and it is the KIDS - all 4 of them that matter - are two functional parents who put them first. Not their Dad pulling a selfish \"I told you so\" to their mom while she struggles.\n\nHere is what I know - if Mom is seriously overwhelmed as you state, she is going to be a crappy parent to all 4 kids. Your role, as a father to these kidos, is to be the best father and role model for them you can be and part of that is stepping in where your wife is too exhausted to parent well and picking up the slack.", "God forbid OP trust his wife not to sabotage her birth control and baby trap him.\n\nLike, seriously, are we really supposed to punish OP for trusting his partner?", "I agree and they both need family's help  with kids because she needs to get a job.\nHow expensive can be public kindergarten??", "Yea nothing you can do about it. It's hard now, but they will grow up. If you want to stay with your wife, let it go, and get through it now for the sake of the kids and your relationship. If you don't want to stay with your wife, separate now and stop the aggro between you. This will not end well for the kids. \n\nAnd just to point out in the TLDR of OPs post, he says \" *she* had twins\" no man, you both had twins! He's an AH for that", "Also, stop busting in your wife if you don't want kids.", "Totally, ESH. The timing of it all is super suspicious so I can understand why OP feels the way he does. But even if she sabotaged her birth control, at the end of the day there are two little helpless babies he had a part in creating. \n\nOP- don't not care for those babies because of your partner, care for them because they didn't do anything wrong in this situation and depend on the adults in their lives to survive.", "Fair share? You mean like... working two jobs and then coming home to provide the level of child-care he was providing before she sabotaged her birth control?", "OP states he gives the same level of care as when they had 2 kids. He just didn't increase the amount he does after working two jobs. But I agree with ESH.", "To be fair she was supposed to be on birth control.", "He still had sex with her because she said she was taking birth control, and she clearly lied about it.", "He's neglecting *two out of his four children*. This will have absolutely no impact on how the twins will feel about themselves, him and their siblings who kept getting daddy's attention and care while they were left alone with their burnt out mother, absolutely not at all /s", "Right? “Fell pregnant” like she tripped and not like \n\n“we kept having sex without protection and I ejaculated inside, despite not taking care of my own reproductive responsibilities”", "How isn't this an ESH? Did you guys miss he working two jobs or is that lost on everyone? Why do people assume that he would be the one dumped? Why is the criticism only on him when both obviously need to get with the program. This bias is incredible. I'm not even on his side, I just can't abide people just blaming a single side especially if one side felt pressured into it. The condescension here is insane as well. My dude is already working two jobs due to bad decisions on both parts and is still helping at home, do you want him to split in two? Where is the criticism for the wife in all this?\n\nEdit: Spelling", "He should do that! And let her have full custody of the kids she wanted so much! At least he would have to live with a horrible partner that he, rightfully, resents.", "Strongly agree. Your wife sounds gross and manipulative and you choose to have sex with her knowing the consequences that could result. \n\nESH. I only have empathy for the children.", "EXACTLY! And they both need serious therapy but regardless of all that, YTA. These are YOUR children!! File for divorce, don’t have intercourse, get a vasectomy, all are options. Not supporting your own CHILDREN is disgusting and definitely not an option..", "Did he say she refused to use a condom? Didn’t see that in the post", "Thank god someone brought up that there are a LOT of ways to enjoy sexual intimacy that don’t involve PIV !   Good god.   The lack of imagination and creativity \n\nYTA.  If OP doesn’t want more kids, then don’t do activities that …. Checks notes …. Create more kids", "He said \"She fell pregnant.\" LOL as if he had no contribution to that act.", "THIS. OP unless she raped you, you share responsibility for these kids. The pill can absolutely fail even if you never miss a day", "Agreed. YTA. Your body your choice, and you chose not to get a vasectomy. Don't blame your wife, this was your decision", "You're right -- it sounds like he was baby-trapped into having more kids. Her consistently taken birth control failed immediately after he requested a vasectomy? Only a fool would see that as a coincidence.\n\nOP works two jobs. He's fulfilling his responsibility by being the sole provider *and* by helping out with the kids.", "Not coerced but he was trusting and did not protect himself. ESH in my opinion. I have friends that have kids and want more kids and I see them struggling financially and in other ways and I don't understand it at all so I'm with OP, But then the kids are already here. So yeah ESH.", "I 100% believe he was coerced. He was adamantly against having more children, stated clearly that he was okay with their family as is, and was nice enough to hold out on the vasectomy for her. That doesn't mean he wanted more kids. It meant that he didn't want to ruin his relationship by doing something they didn't agree on, so he wanted to wait until she understood. It's incredibly fucked up that she decided to bring more children into this world when he didn't want to and clearly wasn't ready. Obviously he had a part in it, but damn. You don't have kids with someone who doesn't want more. This was always going to happen. NTA but they probably need therapy or smthn. Neither of them are going to get over this by themselves anytime soon.", "How is this not coercion? She refuses condoms, she is in control of her birth control pills, all I can do is hope that she doesn't miss a day. I was pushing for a vasectomy she didn't want that either. Couples need to make these kind o decisions together.", "Omg. YES! If we were talking about a woman who didn’t want more kids, ever and wanted to get her tubes tied, we would be saying “It’s your body!” Yes, that may mean a divorce (you know, the thing that happens to half the marriages in the nation) but to not do it risks bringing a child (or children) into the world you 100% do not want and absolutely cannot care for. That hurts everyone involved.\n\nLike, does the OP think those twins WONT realize they were an unwanted burden by their father? Or that they won’t realize their mom resents them for being twins (and will probably blame them down the line for the inevitable break down of this marriage?)\n\nAnd that’s the biggest rub of all. The marriage is on a collision course with divorce, or at least “staying together for the children”…how is that an improvement over nixing one’s sex life or splitting up before babies 3 and 4 because your wife wanted more kids?!", "To be fair he is working two jobs to keep them afloat, I doubt he has a lot of free time. And she’s a SAHM. So by default it is her responsibility, but he should be helping out as much as he can when he’s off. If he can’t provide money they are all shut out of luck. This is a horrible situation but she wanted the kids so now she has them. They both have to deal.", "Can we get this printed on a t shirt?", "I'm very glad this man isn't your husband anymore wtf", "I feel bad for the kids. OP Will never love them and always have resentment for them.", "Did you know it’s possible to *not* have sex with someone when you don’t agree on appropriate birth control methods?", "Glad I’m not the only one that came to this conclusion", "A million times over!!!", "Plus it’s definitely going to cause problems between the 4 siblings if he clearly favors 2 of them. He’s harming everyone involved.", "How is this not ESH then?", "I'm honestly a little wary of the timing here. Birth control does fail, but her falling pregnant shortly after multiple fights where OP makes it clear he doesn't want anymore is extremely suspicious. If she did let her birth control lapse, she's a monster to do it. However, OP also knew how desperate she was and took no precautions to protect himself. I feel like I'm victim blaming if this is all the case, but at the same time, it takes two people to make a baby.", "Definitely", "Ideally it should be taken at the same time every day to maximize efficacy. Hence why other hormonal methods like the ring and the patch are helpful as there is less opportunity to ‘almost’ have hormones every day!", "He's working two jobs while also helping out at home. How do you not see that he's drowning, too, and it's because *she* put a hole in the boat?", "“I totally agree.”\n\n“YTA”\n\nPick one", "Oh c'mon. She told him no vasectomy and not condoms. You don't have to be genius to figure out what she was doing.\n\nEDIT : To add that the pill, like every time of contraception, is not 100 % efficient. The only sure way not to get pregnant is no sex or sterilisation.", "Childcare is actually very expensive. Only one of the kids is public school age so it would not be worth it at all for her to go to work and send the kids to daycare.\n\nETA: ESH", "It’s very easy for daycare to cost more than one of the parent makes. The 6 year old is likely in public school but the younger three would be in daycare. Average nation wide cost of daycare for one infant is $12,500, and one preschooler is $10,000, plus after school care for the eldest, average $3000 a year. So a total of $38k in childcare a year. So if she’s making less than $18/hour after taxes it’s cheaper to have her stay home.", "Kindergarten isn't child-care. It's school and, in some places, it's not even a full day's worth of school.", "My daycare for my ONE child is $1655/month. It was the ONLY daycare that had availability in my daughter's age range, and I have to travel a half hour to get there. Luckily,  I live in Canada and have government assistance for the bulk of that cost, but that assistance does not extend to multiple children (ie: I don't get the same for a second child) so basically, I can't afford more than 1 child of my own.", "EXACTLY pull out \n\nWithdrawal is still I think 70sum% effective!?? Cum on her tits bro\n\nEdit:[stats](https://www.plannedparenthood.org/learn/birth-control/withdrawal-pull-out-method/how-effective-is-withdrawal-method-pulling-out)\n\nIf a man nut in me I think he must want me to possibly be his baby mama- I am on Mirena tho 99.8 effective", "I dunno...in cases like this, when the one wanting the kids is the one in charge of contraception, I'm not sure I'd leave just the one line of defense.", "Birth control is not 100% effective. If you forget to take it, are on antibiotics, start a new medication, etc. it can drastically reduce its effectiveness. OP is an adult. He should have just said “no condom, no sex”. Just because he didn’t want kids doesn’t erase the fact that he was having unprotected sex. And unprotected sex, even with birth control being used, can still result in kids.", "I've seen so many stories of women sabotaging their own birth control because they want another baby/a baby with someone who doesn't. I personally wouldn't have trusted her to maintain her birth control properly and would have taken other steps, like condoms, refusing to have sex, or just getting the vasectomy.", "Any dude who ever takes a woman's word that she is on birth control is an idiot.  I don't care if it's your own wife.  Plenty of women have said that they are on birth control and haven't been.\n\nOP should have gotten snipped if he didn't want more kids.  His body, his choice.", "She refuses condoms and was vocal about wanting another kid ... Any smart adult would be extra cautious about the possibility of her messing up her pills on purpose", "He is absolutely an asshole here but \"fell pregnant\" is the common term in the UK. (And maybe other non-US English speaking countries?)", "Fell pregnant like someone else did this not him", "He added it in a defensive comment.", "Bingo. OP has 2 kids, he knows how babies are made, that the pill’s not 100% effective, and that his wife is not going to terminate if she is pregnant. And he keeps on doing the same.damn.thing that brought his other kids’ lives into being. \n\nAlso. Does the dude know how few days a month a woman is fertile? Ask anyone who has been trying to conceive, they will tell you it is a shockingly small window. Old school NFP alone could have helped OP still have PIV but avoid it when there was a risk of pregnancy.", "Exactly!", "No contraception is 100% even when taken properly. If you decide to have sex with someone it's always a risk you take.", "My first born is a plan B baby, my second you could literally see the Nuvaring still in when I learned I was pregnant at 12 weeks. Ish happens, birth control isn’t fail proof; if he didn’t want more kids he could’ve just kept it in his pants, isn’t that what men constantly tell women", "I definitely think the woman is shady, but on the pill, one missed pill CAN result in pregnancy if the timing lines up. Just wanted to throw that out there. But I don’t disagree that OP’s lady was up to something on this one.\n\nEditing: I am fully aware that pregnancies can happen even if birth control is taken perfectly/no pills are missed. I was pointing out to the above comment that even missing one (when the post states she “barely missed any”) COULD result in pregnancy, unlike some other forms of birth control that have longer lasting effects.", "So it's fine for OP to pretend he only has two kids instead of four?  How do you think that will turn out for the two he refuses, with your reddit blessing, to acknowledge?", "she told him she \"barely missed any\".  You can't miss ***any***\\*\\*.\\*\\* He knew she wasn't responsibly taking the birth control and wanted more children and he didn't bother to use any other form of control like condoms? OP ITAH. He wants to blame the wife and say \"I told you so\" but there were two people having risky sex that resulted in twins. Sounds like they both made dumbass choices but OP's TAH for blaming it on his wife and not helping with the kids because he's being a petulant child himself.\n\neta - ESH but in response to OP's question of if he ITAH - yeah. he is.", "Ah. But he literally said he isn't helping with the twins at all. So. No, he isn't.", "Probably should’ve wrapped his Willy then.", "Also, birth control failure tends to lead to twin pregnancies. So the fact she has twins, backs up BC failure.", "He could have worn a condom and used other things like spermicide afterwards.   He’s still TA.", "SHE refuses condoms and you just go along with that?  You should’ve said “no condom. No nooky” especially knowing she wanted another child and you do not, you should have taken the extra precautions! You decided to have unprotected sex and obviously know how babies are made…now you have twins that are your responsibility and yes you are a huge AH for acting like you didn’t play a part in their conception.", "Are you serious ? \n\nYou wanted a vasectomy. You should have gone and got one instead of not doing and still have sex with a woman who wanted another child. \n\nPart of me is thinking that you wanted her to get pregnant and be overwhelmed just so that you could say \"I told you so\".", "Be a grown up and say no? Pull out? They’re your kids and they don’t deserve an absent father who favours their siblings just because you chose to have sex knowing it could lead to unwanted pregnancy and are pissed at their mom. You’re punishing innocent babies.", "Hahahah!  \n\n1) your body- your choice. It works both ways. \n\n2) “she hardly ever misses a day”. That’s not how the birth control pill works my friend. If you miss a day- it doesn’t work for the month. It’s a collective thing. If she can’t handle taking it every day, get an implant. But she wanted to get pregnant, so it was convenient to miss a day here and there. \n\n3) you were completely complicit in this, knowing she wanted more kids and that she missed days with the pill, and she didn’t want you to use a condom. \n\nYou had sex, you both created these kids, now you need to take care of them regardless. YTA. You’re both TAH for having kids you can’t handle, can’t afford, she knew you didn’t want, but hey, let’s just procreate because we can.", "Unless you are saying she assaulted you - you can abstain from sex. If you consented to sex, then you also consent to the inherent risks. \n\nIf you truly wanted to prevent pregnancy there are other methods of birth control. Why does she refuse condoms?", "If you knew you didn’t want any more children and she was fighting against in and refusing condoms, you should have held off on sex till the matter was settled.", "YTA, and not incidentally I strongly object to your beginning premise that wives can veto their husbands' decisions over their own bodies, with the added implication that a wife would need her husband's consent to have her tubes tied.", "YTA.\n\nYou wanted to leave the burden of responsibility for birth control on someone who absolutely wanted more kids.\n\nWas a really worth the few minutes of pleasure? You now have 18 years of financial burden.", "Sex strike isn't only a woman's thing. You would not have been an AH for refusing sex as long as this wasn't sorted. She is pushes to have more kids, refuses any contraception while promessing she is on the pill? Tbh you could've seen this coming miles away. I'm not even sure she missed a day, but she is quite an AH too if she did this on purpose.", "SHE refuses condoms and you continued anyway? \n\nDo you not have a spine or any pride in yourself?\n\nShe didn’t force you to sleep with her, you could have refused.", "Are you serious? Your defense is she assaulted you? That’s what sexual coercion is. \n\nAlso those are your kids. \n\nHonestly you where taking about having kids so you either should have doubled up contraception or not had sex. \n\nMy dude. This is on you and regardless you have a responsibility to those children. They’re yours. It’s not like a puppy where your wife wanted the dog and you didn’t. \n\nIf you don’t raise your kids it makes you a shit dad. And I don’t think you want to be a bad dad. So grow a pair, get the snip snip and be a parent to your kids.", "Dude, I'm pregnant with my 4th (not planned) and I'm giving my husband the ultimatum to get snipped or no sex without condoms. \n\nYou're an adult. You can use your voice, you don't have to have sex. This is just as much on you as it is on her. \n\nYta. Step up and care for the kids you helped create.", "If your wife was refusing to practice adequate birth control (barely ever missing a pill means she was missing pills, this makes then ineffective) and not letting you use options (condoms or a vasectomy), then you should have stopped having penetrative sex. \n\nHand jobs exist. Using toys exist. BJs exist. Cunnilingus exists. There are ways to get off that would have prevented this.\n\nOr you could have put your foot down and said no condom/vasectomy, no sex.\n\nYou didn't. You kept having sex. \n\nIt takes two to embryo, my friend. Y'all dug this hole together and now you need to get out of it together. \n\nAnd for God sake, get the damn vasectomy.", "True, having (more) kids or not is a joint decision. Having sex without a condom is as well...you accepted her choice and these children are the result. You were passive when you should not have been. This needed active decision making on your part, but you allowed her to dictate. \n\nBy now helping her now, you're also punishing those kids. The children are here and you're both overwhelmed and tired. Figuring over child care wont help either of you.", "So, dont have sex?  Unless you're claiming she raped you.", "You can exercise control over your body and get the vasectomy or you can take control of your body and refuse to have sex. Don't act like an innocent bystander.\n\nBesides all that is irrelevant. You have 4 kids. You have to do what is needed to take care of the 4 kids. End of story.", "Funny story: she wouldn’t have been able to get pregnant if you had refused to have sex with her. \n\nJust like she gets to make decisions about her body, you get to make decisions about yours. You decided to not make sure you were protected against pregnancy, you now have more kids. Take care of them.", "Now that it's close to two years since she last got knocked up, have you had the snip now?", "Did she rape you?\n\nYou have the choice to not have sex without a condom. You have agency. Unless you plan to go to the police about this because she forced herself upon you?", "Pull out, condoms,  abstinence.  All of these things you are in control of. You could have easily done any of these things.  I have my ribs tied, and I'm still extra careful so as not to have even more children. I highly recommend that vasectomy now as any more kids, and I think you'll definitely hit a breaking point.", "You don’t come inside her dude.. it’s really that easy\n\nI haven’t used contraception for 15 years and have zero unwanted pregnancy.\n\nIf you didn’t want children that is your responsibility too.\n\nI think you should talk to someone as you resentment and anger is affecting the whole family. \n\nI totally get it though.\n\nEverything you were worried about came to pass. \n\nBut you were part of it.", "A vasectomy is your decision and your decision only to make. \n\nI also think you are just punishing your children and not her. Helping with them means having a relationship with them. They basically don't know you right now. It does sound like you have a lot of problems in your relationship and a lack of boundaries. You should have gotten the vasectomy or use condoms or not have sex until this is sorted but you essentially didn't hold up your boundaries and now you have the classic result: resentment", "You could try not having sex with her if she doesn’t allow you to use birth control?\n\nWe say all the time that whether a woman gets pregnant or uses birth control or carries a pregnancy to term is up to her, because it’s her body. Same goes for dudes. Whether you want your body to remain capable of producing children is your decision.", "Then don't have sex. You chose to have sex with someone who sometimes forgets? to take the pill. If you didn't want kids you should have either not had sex or used extra protection. If you do not take your pool every day at the same time like a robot it becomes a lot less effective quickly. Like drastically. When I was on the pill as a teenager I made sure to take it every day at the same time. That sucked and required quite some forward planning, especially during summer, but I did it. You know why? Because I didn't want to get pregnant. You don't barely miss any days if you don't want to get pregnant, you simply don't miss any days at all.", "How can she \"refuse condoms\"?  You guys NEED to find a therapist NOW before baby #5 is on the way.  Tell her you're getting a vasectomy -- you're beyond the asking stage.  If she balks that means she's absolutely planning for baby #5 and beyond.  I think you know in your heart that she wasn't taking those pills.  \n\nDoes she bring it up to you that she wants more help from you?  Are you kids suffering in any way because of you not stepping up?", "I apologize, I didn't see the part where you and her agreed that she was continuing on birth control pills. I feel you a little more.\n\nHowever, the responsibility on birth control is on both partners. In general  it's recommended men use another form such as condoms, especially for new relationships where they don't know the other person well. Now you are in a long term relationship, so it's unfortunate you were potentially decieved. You knew, though that she wanted another kid and that she refused other methods. Therefore, at that point you should have stopped having sex with her.\n\nSo I still think the YTA verdict for not caring for your children. If you were forced into sex though, then that would be different.", "You get a vasectomy if you wanted one. She wanted more children and made that decision independently.", "Lol didn't know she could physically stop them from being in your penis, no glove no love have you not heard of that phrase? You are in control of your own body, unless she r*ped you, in which case we're talking about a whole other huge problem, you could have said no and abstained from having sex with her", "Don’t have sex. Lord.", "YTA \n\nIt takes 2 to tango. Responsibility for kids sits with you both.\n\nYour kids will also notice as time goes on that the youngest get less support/help from you. They may wonder why. How will you explain that? That you didn’t want them ? \n\nStop taking this out on your kids.", "Then don’t have sex. Problem solved.  You participated so now you have 4 children you are responsible for…go get the vasectomy now before it’s 5 kids.", "Did she rape you?", "Because she isn’t forcing you to have sex with her? If she won’t use a condom then you don’t have sex it’s as simple as that.", "Did she insist on the sex when you said no sex without a condom? Because that's rape.\n\n&#x200B;\n\nWhy were you \"pushing\" to do something with your own body rather than just doing it.", "Don't have more children if you can't take care of them 🤗 Just because he works 2 jobs doesn't mean he isn't a parent anymore. Being home with 4 kids under 6 would be ridiculously hard work, and he took part in creating them, so, no, not her sole responsibility.", "It’s her responsibility during the day, when he’s not home. Not 24/7 which would mean he gets time off work and she is working literally ALL the time", "Nobody here cares that he works two jobs. They only care that he has a penis", "Cuz he is being very self centered and holding a grudge and it won’t do anything but hurt everyone involved. It sux but tbh he needs to use barrier protection if neither one of em is willing to get sterile. He nutted in her. That he chose.", "It’s more like he’s standing there yelling “I told you I was too tired to rescue you if you went in the water!”. The problem is: she has his kids. Whether it’s fair or not, if mom drowns they’re all going to drown with her. He didn’t take steps to NOT have another baby with her, nor plan for how they were going to afford life once it was established that she was again pregnant. It really is a ESH situation. Full Yikes", "Eh, I think they both had a part with the hole on the boat\n\nHe didn't have to have sex with her before the vasectomy issue was settled. He could have insisted more on condoms. He could have pulled out. She didn't just \"fall\" pregnant- OP 100% shares responsibility for that.\n\nHonestly, warning signs were there he couldn't trust her on birth control, it should have been no sex until they reached a consensus.", "Then they need to figure out a workable solution. Maybe it is calling in family for help or figuring out a nanny situation. Finding a local teen to work as a mother's helper after school. I don't know.\n\nBut knowing your spouse is drowning, watching them drown - that is going to end very badly for their marriage and the children. \n\nThey need couples therapy desperately. And he needs that vasectomy.", "He filled the boat with water. Everyone knows that BC pills aren't 100% effective. He should have worn a condom if *he* really didn't want more kids.", "He fucked that hole without a condom so now they all have to swim. You're all over here defending the guy. Feelings don't matter here anymore. They have a job to do, end of story.", "she put the hole in the boat? I'm pretty sure if he didn't put his sperm in her then that would have solved the problem as well. They are both assholes and those kids are suffering because of it.", "In some parts of Europe, “kindergarten” is literally day care.", "That's a great new slogan for planned parenthood!! \"Cum on her tits!\" 🤣🤣", "Lololol 😂", "And she had said she wasn’t perfect at it. Which I don’t know why he wouldn’t double up?  It’s like he just delegated the whole responsibility of their shared couple fertility and checked out, then he was surprised when she was pregnant. \n\nIt’s not his wife’s job to ensure their entire reproductive fertility. It’s on him too. He shouldn’t have been having sex or should have insisted on wearing a condom. \n\n\nAnd now that the babies are here he can’t just claim “I didn’t want them so I’m not responsible” it makes him a shit parent. And frankly I’m just not empathetic to people who shirk parental responsibilities. It’s one thing to decide to put up a child for adoption or relinquish your parental rights. But if you’re responsible for that child you take care of it.", "It sounds like she wanted to get pregnant and missed some days.", "I know it’s a common term but it is absolutely is absolving him from his responsibility in *being the person who did the impregnating*", "Yeah, it's even more of a risk when they stop taking it because they want a baby.", "Exactly, it's SO funny how you never seem to hear anyone telling the guy, \"well why didn't you just keep it in your pants if you didn't want more kids??!\" Like the thought of depriving his poor peepee of sex is completely out of the question, smh.", "Not even that - you can take every pill as recommended and still get pregnant", "You dont even have to miss it, just take it an hour or two too late. The pill is very finicky like that.", "Depending on the pill being an hour late can mean you get pregnant.", "Shady! She was pretty fucking open about wanting more children.", "Or being on antibiotics.", "This times a million. Those poor baby twins.", "100% agree. How can he say he loves all 4 children then only help out with 2 of them. Does he just let the twins cry? Let them sit in soggy diapers? Not feed them when hungry just to prove a point? Dude, if you had sex, you were NOT coerced. Man up and love those babies. YTA", "Ha! In 20 years when the kids are complaining that their father never treated them like his children.. Reddit world will start telling them that their family is toxic and they should cut them off", "There's a large difference between adding more responsibilities to your already packed life and refusing to acknowledge your children.\n\nHe's still supporting them financially, and still providing them with love and attention. I have no doubt that he'll be a good father, even if he's not supplementing his wife's needs after she baby-trapped him. He's simply not adding even more onto his full plate, which is exactly what he conveyed to her before she sabotaged her birth control and reproductively coerced him.", "He's earning the money that pays for their food and housing. He's giving them love and affection. He's enabling their entire lives. Let's not pretend that working two jobs and directly helping raise two children isn't already a massive amount of work.", "No no no! Don’t you get it! \n\nOP didn’t want the twins. So by the power of imagination he should have been able to will his sperm to not impregnate his wife even though she’s on the pill which isn’t 100% effective. \n\nIf only she hadn’t Pied Piper’d the sperm after every sexual encounter and soothsayer Op to have sexual relations without a condom then Op wouldn’t be in this situation. It’s her fault entirely not OP’s. As such he can just decide not to help because he wants an extra hour of sleep./s \n\nOP’s defense is wonky as fuck. She didn’t baby trap him. She didn’t coerce him. They where discussing having a kid or not and she got pregnant because like dummies they had sex without a condom while making the decision. \n\nThe pill is never 100% effective so double up people!\n\nEdit: it’s also not lost on me that his defense is that his wife assaulted him by sexually coercing him. That is a serious allegation and frankly given birth control fails more than people think and he was having sex without condoms i don’t know how you would unravel that thread. And if she was missing pills then Op had full control over his body, he shouldn’t have been having sex. Pregnancy is always an outcome when having sex unless you’re infertile or in a same biological sex relationship. Even vasectomies aren’t 100% effective. So idk. She could have been missing pills. But he also was playing fast and loose a bit too during this serious family planning time.", "Someone needs to buy OP the book Ejaculate Responsibly by Gabrielle Blair", "Humm I suspect if genders were reversed and a woman was being manipulated into having unprotected sex and getting pregnant, the judgement would not be the same.  \n\n\nThat being said, YTA. The kids are here, they need to be taken care of. But that marriage seems to be very unhealthy and I'm not sure you guys should Stay together with this amount of manipulation and resentment.", "Better yet, don't insert in the first place. Sticking things in places can cause a lot of problems, between unknown USB sticks in computers, fingers in plug sockets, and penises in almost anything.\n\nContraceptives can fail and non penetrative imtercourse is a thing", "He's punishing his wife for getting pregnant and the children for being the result. Total YTA.", ">If you miss a day- it doesn’t work for the month. \n\nObjectively not true. Generally 1 day, for some it is 2. The effectiveness goes down, but it doesn't completely become ineffective because you miss one dose.", "She only told me that she had missed pills when she was already pregnant..", "OP had unprotected sex with someone who is pushing for more babies.\n\nLol YTA", "Sadly, that is true for many women, depending on the state, if you're in the US. I wanted my tubes tied. I was told I was too young, would change my mind bc I only had one kid, and would need my husband's permission. My husband said \"why the hell would she need my permission?! It's her decision!\" They still refused to do it. 2 weeks later, he got a vasectomy. No one asked if he got my permission. It's a sad reality. Not that OP is remotely right. He's still YTA. No one forced him to have unprotected sex. He chose to do that knowing the risks.", "Did she stealth him? Does that count as rape when a woman does it?", "Quit making women the only part responsible for pregnancy. Period. Women having to take bc pills against her own desire so her husband can continue to have sex and not take any responsibility for their children. \n\nAnd it's the relationship with your kids that is really being harmed. You're not bonding with them by not caring for them and they will grow into adults that realize you're a pouty baby who can't take responsibility for his own actions.", "I said that. I’d argue she’s responsible 50% of the time he’s at home and he’s responsible 50% so they both have a little time not working, otherwise they are both working all the time. They need to switch off nights putting everyone to bed or delegate one puts the older ones away and one puts the twins away and switches off.", "No, they care that he’s quite literally acting like he’s not a father to a set of twins that he claims to love. It’s insane to think that he doesn’t need to help with the kids", "He works two jobs and that’s a lot, but she’s also working! She’s doing all the things that allow him to have those jobs - presumably cooking his meals (and buying groceries), washing his clothes so he has something to wear to work, cleaning the house so he doesn’t come home to filth. All of that is work, and especially with 4 kids on top, can be very hard to manage, and she deserves breaks too, she deserves to have help as well", "That doesn't answer my question lol. How is  OP's wife nta?", "Absolutely. The kids are the ones really suffering in the long run.", ">He didn’t take steps to NOT have another baby with her,\n\nH: \"Darling, I don't think we're going to be able to go on this vacation... We're in debt and spending this much will ruin us...\"\n\nW: \"What!? You know this vacation has been a dream of mine! You can't just cancel it!\"\n\nH: \"I'm sorry, but if we spend that money, we'll be homeless.\"\n\nW: \"We'll talk about this later!\"\n\nA week later.\n\nW: \"Honey, I just bought the tickets and paid for the hotels for our vacation.\"\n\nH: \"What!?\"\n\nH goes to reddit and asks if he's the asshole for getting upset about this situation.\n\nYou: \"Well, he didn't cancel his credit cards so this is on him.\"", ">Honestly, warning signs were there he couldn't trust her on birth control\n\nYeah, this is bullshit. He had no reason to suspect that he couldn't trust his wife. That's what you do when you're married -- you trust your partner not to betray you.", "When two people cannot afford to have kids (or in this case more kids) adoption is an option", ">They have a job to do, end of story.\n\n\nYeah, and he's doing three of them: two paid and one unpaid.", "I think it’s an Eminem quote tho I think it may be sum cum on ur lips sum cum on her tits 🤷🏼‍♀️ \nBut definitely", "It’s kinda a no brainer \nI had a guy tell me he HAD TO cum “against” something so I gave him head and when he told me he was nutting I gave him a compact mirror and said here cum against this \nWasted my blush tho\nApropos it was NARs orgasm", "Wholeheartedly agree. I get not wanting more, but at this point, in punishing his wife, he's also (and arguably more importantly) punishing his KIDS. And it's not just the newest 2. Because the time that he doesn't help his wife with them also takes away from their elder two. And if he thinks those kids won't ultimately feel that resentment he feels towards how they came about (and ultimately them), he's being daft. Speaking as someone who's currently watching my ex alienate his kids because they can tell he's there more out of a feeling of duty than any desire to be there with them....\n100% AH on him. If he didn't want kids, take measures to make sure it doesn't happen and don't just leave it all on the one who wants them.", "Does that justify refusing to help wife or care for two of your own children while the others can totally see? How do you think this will affect the kids?", "That is a possibility, but it’s still OP’s responsibility to use other protection or abstain if he does not want children. As said before, birth control is not 100% effective. You could take it every day for 6 years without any issue and still suddenly get pregnant. The pill is just synthetic hormones— it works to stop ovulation but it’s not a miracle worker. Illness causing vomiting or diarrhea, antibiotics, supplements, taking the pill at a different time than usual (ex. If you usually take it at 8 AM but end up forgetting to take it until 9 PM the following day) can drastically reduce the effectiveness as it can cause the hormones to be disregulated or not absorb properly.\n\nIt is common knowledge that birth control is not 100% effective, so if you *really* don’t want kids, it should be used in conjunction with other protection (condoms, spermicide, etc.). It is not only OP’s wife’s responsibility to be on protection, it is OP’s responsibility as well. Since OP is the one who does not want kids, he should have just gotten the vasectomy (his body, his choice) or made it clear that he would not be having sex without a barrier protection.", "You mean like the op who didn’t wear a condom?   Ya he’s a Ah blaming his wife for his poor choices.", "That doesn’t mean the man is absolved of responsibility. There are forms of contraceptives for women AND men for a reason. If he was super against having any more, he should have been using condoms whether she was on the pill, shot, had an IUD, etc. because all of those CAN fail even when used correctly. \nHaving twins is just as much on OP as it is his wife, even if she was being shady as hell with her birth control. It takes two to make them, it takes two to protect against them.", "Oh definitely! Was just pointing out that some birth controls fail after just one “slip-up,” others have better protection even if used incorrectly.", "Yep, if you are on antibiotics, birth control can stop working. And all birth control is only 99% effective. That is why 2 forms of birth control are better than 1.", "Happened to me lol", "I took mine the same time every day for years. My kid is now 8. 🙃 It definitely can happen", "And what do you think the children will take away from this about their dad? We're talking about hands-on care here, according to OP, and nothing involving parenting happens in a vacuum. I can see the older kids growing up believing they matter and their younger siblings don't. I can see the twins growing up hating their older siblings because dad is actively engaged with the care of the siblings, but not with their care. OP's vindictiveness will harm his children most of all.", "A good father takes care of his kids, even if he’s tired and didn’t want to have more kids…", "And she missed days. Miss it once in the month and you are more or less having 0 protection. Op is a grown man and totally the AH.", "No I would also say YTA. You always take your own birth control into your own hands. \n\nYou never take someone at their word and just go with it, and you always double up when making decisions about family planning. \n\nBut that’s not really the full issue here. The issue is that now that the babies are here and they didn’t abort, put the twins up for adoption, etc. OP is refusing to help with them. That makes any parent an AH no matter what.", "He was not manipulated into having unprotected sex. That would be if she poked holes in the condom or something like that. He willingly had sex without a condom. Birth control is not 100% effective. If a girl willingly had sex without a condom I would be telling her the exact same thing. That you are responsible for your own birth control. I would especially be saying that if it was a woman because at this point women should assume that most men will not provide condoms. When I was in my early twenties and slightly promiscuous, I carried condoms with me everywhere I went. I had sex without a condom once and ended up with chlamydia. And guess what, that was my responsibility. After that I learned my lesson and I walked out of multiple apartments in the middle of things getting heated because a guy was pushing too hard to convince me we didn't need condoms. And I was on the shot which is even more effective than the pill. If someone refuses to use protection, don't have sex with them. It's really that easy.", "Hmmm…no. It’s never ok to manipulate anyone into having unprotected sex. Male or female.", "Yeah hence my very first statement saying “say no”", "It sounds to me like your wife lied to you in order to have more children you didn't want. You also made a dumb decision by agreeing to have sex without protection of your own, knowing you didn't want any.\n\nBut your choices NOW are basically two things:\n\n1. Stay married to your wife. Help with all the children you helped create because they are your children.\n\n2. Divorce your wife if you feel like she lied to you to have more kids, and cannot reconcile that with staying married. And then also help with all the children you helped create because they are your children.", "Dude, bc pills are not 100%, she could get pregnant even by taking them religiously. Don’t get me wrong she is a huge AH, but so is you. Unless she raped you, you had multiple choices", "INFO: Have you had a vasectomy yet? \n\nI think you’re feeling that things happened outside of your control. Bringing some of that back by getting a vasectomy could help you", "Bc she lied to get her way. SURPRISE! She outwitted you! \n\nHere’s what you do: you schedule your vasectomy, get a trusted loved one to take you bc you can’t tell her it’s going to happen, and then go for the gold. \n\nWhen you come home, it can be your petty, retaliation to her “oops I did miss my pills”.", "pregnancy trap", "It varies by location and doctors age. There have been plenty of men that have needed their spouses approval for a vasectomy. It was almost impossible for a guy to get a upped otherwise just twenty years ago.\n \nIn both cases, it's less about controlling someone's body, and more about the doctor trying to save their own ass from future lawsuits from people that decided they made a bad decision.", "Yes a woman can poke holes in condoms and stuff. But she said “I don’t want to use condoms and I’m on the pill” he said ok and had sex with her without the condoms and then was surprised the pill failed. Which it does and can even when someone is perfect with it. \n\nIs it trapping if she sabotaged their birth control. Yes. But also he participated and knew she wanted kids and they where only using one method of birth control. I just personally wouldn’t have had sex without either doubling up or in his case getting the vasectomy. \n\nSo idk. He chose to have semi protected sex with his wife during serious family planning discussions. Idk how you could pull that thread since I think she would have to admit to stopping her pills. Otherwise you’re looking at like a 1%-3% chance of pregnancy.", "I don't know if improperly taking BC pills is considered stealthing or has any legal ramifications. That would be incredibly difficult to prove. \n\nStealthing for her would be more like poking holes in the condom, I'd think. Which he opted not to wear.\n\nContraceptives are a two way street. Everyone should be covering their own ass.", "He’s supporting all of the children", "That’s the point. She could barely manage with 2 but now has 4 all while they’re barely getting by while he killed himself working 2 jobs", "Maybe ur right and ESH but when it happens it happens and he need to step up\nEdit and for THAT he IS \n the AH\n\nThey are just lil babes and he holds a grudge it ain’t ok", ">He didn’t take steps to NOT have another baby with her,\n\n>H: \"Darling, I don't think we're going to be able to go on this vacation... We're in debt and spending this much will ruin us...\"\n\n>W: \"What!? You know this vacation has been a dream of mine! You can't just cancel it!\"\n\n>H: \"I'm sorry, but if we spend that money, we'll be homeless.\"\n\n>W: \"We'll talk about this later!\"\n\n>A week later.\n\n>W: \"Honey, I just bought the tickets and paid for the hotels for our vacation.\"\n\n>H: \"What!?\"\n\n>H goes to reddit and asks if he's the asshole for getting upset about this situation.\n\n>You: \"Well, he didn't cancel his credit cards so this is on him.\"\n\nThis whole analogy makes zero sense. LOL.", "Those are not the same at all. No one saying that he shouldn't be mad at her but at the end of the day there his kids and he should be looking after his kids regardless.", "Except a holiday isn't a pair of living,  breathing human beings. The kids need to come first! Getting all petulant about being right isn't a good look for anyone. A father saying that about his babies? The older kids will have picked up his animosity towards the two babies, it will have affected them already, if not the babies too. Those poor kids. I feel sorry for them. Not the adult who thought that sex without contraception apart from birth control pills with someone who wants more kids wouldn't lead to more kids. It takes two to make a baby (or twins in this case). He should have got the vasectomy - his body his choice (I say that as a wife who was on the fence about her husband getting one before he got one.)", "And the thing is, we, nor OP knows if this was on purpose or an accident. So, this still falls back to if he didn't want another kid he should have abstained or put many restrictions in place, like condom only. It's very common knowledge that the pill can fail.", "[removed]", "1 in 5 is still very high numbers for pregnancy. \nGood job you can't get pregnant via your mouth", "Exactly. She was clear she’s not perfect at her birth control and he was adamant about not having kids. He just assumed she was responsible for deciding to get pregnant or not so he didn’t take his own birth control into his own hands. You never leave it up to someone else. Ever.\n\nEdit: and then when a kid does come around you don’t just decide you aren’t responsible for the child. Or claim your partner coerced you when it’s not provable given the circumstances to get out of parental responsibility. If he didn’t want to be the father he could have relinquished his parental rights (which given he’s married and these are his kids then I don’t even think that’s possible)", "Yea, honestly I’d always feel like there’s would be a nagging suspicion that getting pregnant was intentional", "Just to note in this case it's clearly OP's choice, not a requirement from his doctor.  In my case: snipped a little less than 20 years ago and although my wife was very much in favor, her opinion or consent never came up with my personal physician nor the surgical office that did the procedure.", "My point is, she may very well have stopped taking the pill entirely, and just lied to OP about it. People lie constantly. And women are people, too. And she was already adamant about wanting to get pregnant again, hence the arguments between her and OP before she got pregnant.\n \nTo me, that would be the same as a guy removing a condom mid-coitus. If one is rape, both are.", "i’m sure she’s killing herself too, with all the household  responsibilities AND the children. \nI agree, she sucks, cuz she shouldn’t have pushed having another baby. HOWEVER he didn’t decide to stop having sex with her unless she wore a condom, or definitively decided on a vasectomy. He CHOSE to continue having sex with her and cumming inside her, despite knowing it might lead to a kid. Cuz sex might lead to a kid, and if it does, you have to take responsibility for your actions", "It's literally almost a direct analog... Not really my problem if you can't make the connections.", "And now this will be on repeat in my head for 2 days", "He called her SO and not spouse so they may not be married. In any case, always be warry of any protection you are using especially when one person is adamant on being pregnant. And make sure not to put your genitalia in!", "Except OP knew that she wasn't even being consistent about her birth control and as an adult who's capable of understanding that inconsistent birth control is equivalent to no birth control even if she was lying about taking it at all he was playing a risky game and won the prize (prizes, in this case) accordingly. He was lying to himself and is now trying to push all of the responsibility onto his wife because he wanted to get his dick wet.", "You’re right. But that’s a technicality in this case. \n\nNever relinquish responsibility for your own fertility people! Ever! Ever! Ever!", "He knew what? She told him she almost never missed a day. From what I understand, that's a pretty good rate for a woman if true. \n \nI'm not arguing that he had no responsibility. I'm pointing out that some people seem to be giving her more leeway than seems appropriate to me. On its face, it certainly seems like **she actively lied** to get the pregnancy she wanted, and people are just glossing over that fact because he has a penis.", "Missing even one day makes the birth control less effective.\n\nThat’s literally why they make you go to the doctor to ask them about it and they walk us through the risks, side effects and what happens if we’re not consistent.", "Your understanding of how birth control works is incorrect. That doesn't magically make your assumption that she actively lied correct. OP knew she wanted more kids and didn't want to use the effective methods available to ensure there wouldn't be and still CHOSE to have sex with her. They both suck equally.", "And purposefully not taking them makes them completely useless.", "She told him after she was pregnant", "I fully agree with your last sentence. But my assumption that she lied is just as valid as everyone else's assumption that she didn't, and all I've been trying to do is point that out to people.", "fr i would never ever ever rely on just the pill. you gotta take that at the same time every day for it to work! and when he knows that she sometimes misses a day (hardly ever=sometimes=this is not effective birth control this is just regulating her period) agreeing to have sex without any other protection is fully agreeing to unprotected sex. now, would i keep a kid if the other party does not want it? hell no. is it fucked up that she kept the pregnancy? hell yes. but he could have said “i’m not having unprotected sex with you” he could have said “i’m getting a vasectomy and i don’t need your permission” he could have said “if you do not terminate this pregnancy i will leave you”. punishing her now? after the kids are born? that’s just messed up. “she” does not have twins, both of them do. he is not “helping” with two of his children, he is barely parenting half his kids and neglecting the other half. and he claims to love them. if you love your kids, why are you punishing them? if you hate your wife, why don’t you get a divorce? on what planet is *this* the reasonable thing to do? for this situation? yta. on a larger scale esh and i am glad i don’t know any of these people.", "You should have gotten the vasectomy earlier or told her to have an abortion if you didn’t want more kids. Period. Also, your wife is more than likely lying to you and got pregnant on purpose.", "Yikes.   Idk why people continue to have kids when their partner clearly doesn't want to.   That's a major decision that all parties should be on board with.   Listen I get that it sucks but it takes two to tango here.   Yeah sounds like you got trapped but now that the situation is here your next moves determine if your the asshole.   But that's not what you should be worried about.  Are you okay with having a strained relationship with all your kids years from now? It may suck right now but the kids will all see how you treat mom and will grow resentful of you.    Or her, or both.    Take a step back it's not just you and her, it's you two and your kids.", "YTA, and this shit better be satire. Not even funny. Those are still your kids as much as hers. You can’t just opt out of their care, regardless your feelings. This sounds like laziness and pettiness on your part. Step up, or separate and pay support on 4 kids, plus help with daycare costs, because she’ll need a job! There’s no merit in what you are doing. You could have said “I told ya so!” and moved on, but no. A year of pettiness and child neglect. Using your own kids to hurt your wife.\n\nSo unhealthy. You need to get yourself together before those babies are old enough to be damaged by the dynamic!", "YTA", "ESH\n\nYou two need to get on the same page and move passed this or else it is going to be an issue until these kids are in college.\n\nCongrats on twins! You’re the father. You need to be one.", "ESH - but your wife is the bigger a**hole.\nI‘m 99% convinced that she purposely didn‘t take the birth control to fell pregnant before you could eventually decide to get a vasectomy.\nShe screwed up ALL of your lives (including the four kids) with that stupid and irresponsible decision. I get why you resent her and want to make her feel the consequences.\nAlso I don‘t get why reddit is all „your body your choice“ - yes, it is your body but when you’re married it is BOTH lives that are irrevocably effected by one partner‘s decision. So yeah, you talk it out and try to reach an agreement that both parties can live with. Only she couldn‘t wait for it and likely took matters into her own hands. She clearly sucks as a partner.\n\nHowever, those are your kids, you love them and they need you to be their dad. It sucks that your wife brought this upon all of you but since the twins are already 1yo I think you punished her enough. Times will get better anyway once the kids grow older. Hang in there.", "Crazy this woman may have lied about using BC and people are still blaming him for trusting his wife. Honestly it sounds like anti abortion talk about how he just shouldn't have had sex with his wife. \n\nI wonder how many people here would criticise a woman for getting pregnant because she trusted her husband to use a condom.", "ITT: A bunch of people that don't understand the concept of trusting your partner.", "You’re going to have to come to terms with this and “help” — ie, do your share as a parent. \n\nYTA", "NTA. It sounds like both of you are drowning and the financial burden placed on you is starting to get to you. I don’t have an advise as the children are already here. All the best! Maybe wife could also work on the days you are off so that she is out of the house and you are not busting yourself.", "You really should have worn a condom if you were 100% sure you didn’t want any more children. Whether it was a birth control failure or whether she lied to you doesn’t really matter at this point. Hopefully you have a vasectomy now or you’re wearing a condom just in case.\n\nIf you’re working two jobs, other than not doing anything to add to her workload, I don’t know what else you’re supposed to do.   \n\nNTA but by not using protection when you were adamant you didn’t want more children, you’re definitely complicit in the fact that you have four kids now instead of two.", "NTA for not WANTING to help SO with kids. You are still working two jobs for your family and helping around the house with 2 children. As  she is the primary care provider the majority of child care would fall under her anyway. I'm blown away that people are not all on your side. She needs to step up as primary care giver is her role and she maliciously or stupidly made this happen.This kind of betrayal is grounds for divorce. I would speak to a lawyer and look at your options.", "YTA,I understand your point but it's not the kids' fault,plus wear a condom", "Do you love her? If so, put the tit for tat aside and parent your kids together. This is the hardest it'll ever be, so if they're worth it, grin and bear it. \n\nIt will get easier (promise) and you'll have 4 amazing humans who'll have your back for ever. Or be petty right now and waste something beatiful. \n\nI'm gonna go NAH because I have faith these are good tired people with lots of babies who can turn this round!", "ESH but the wife is the biggest offender since she got pregnant intentionally while her husband was against it.   “Forgot” to take the pill. Nobody would buy that.", "Nta sounds like you were baby trapped you straight up asked for a vasectomy and she said no and is now complaining because she got pregnant again even though you wanted to prevent that because your working two jobs and two kids is already a lot. You asked to not have more to get your junk fixed and she said no and is upset now that you can’t help", "NTA. She can live with the concequences of her actions.", "NTA, but “my body, my choice” applies to men as well. I hope you were able to get the vasectomy.", "It’s your body, your choice. You should have gotten the vasectomy anyways. You told your wife you don’t want more kids, she got pregnant anyways. I don’t buy the whole birth control failing bull shit. She baby trapped you. I would divorce her. She would have to get a full time job. And you guys could go 50/50 with the kids. NTA", "Nta. She baby trapped you. Think about divorce.", "NTA. Sounds like the classic “i dont want more kids” and then the wife goes and does what she wants anyway because it’s her body. \nOkay that’s fine, and now it’s all your responsibility too. I don’t blame him at all, but get the vasectomy.", "ESH- but your wife is a much bigger one. I don't believe she \"forgot\" the birth Control. You shouldn't trust her anymore.\nThis situation is not healthy for your kids. You don't love your wife anymore and is Full of resentment, which I understand. I understand you probably can't divorce right now because of the Financial situation, but make that a priority for the next years.\nThe good thing is that you say you love your twins and want to take care of them but your resentment get's in the way. Not having to live with her can fix that.", "NTA ignore the others saying you are an asshole. She knew she was going to get pregnant. She probably intentionally missed a pill.\n\nAs soon as you said you wanted to get a vasectomy and oops she is suddenly pregnant? \n\nYeah right.\n\nAnd he is taking care of all the kids he just refuses to take extra care of the new twins. Did not say he was ignoring the kids. Didn't say he was starving the kids. Just said he doesn't give her any extra help with them.\n\nThat is called suffering the consequences of her decision to keep having kids. She wanted them he didn't. He said he wanted to get a vasectomy. She said no.", "NTA your wife lied about being in the pill. That enough exonerated you being the asshole.", "He’s working TWO jobs. Even if he had wanted the kids, ….she’s a stay at home mom (a luxury nowadays) and he’s helping with two of the older kids. What exactly does she want from him? Why can’t she handle the other two kids on her own seeing that he’s working all the time?", "NTA. Make no mistake, your wife 100% got pregnant on purpose. She deceived you and betrayed you, even after YOU decided to put the vasectomy on hold to be considerate of HER feelings. There's no good way out of this. Schedule your vasectomy today because she'll betray you again. Think hard about whether you want to be with someone like this. And don't neglect your kids but I'd probably hold my ground on her doing more diaper changes etc for the mess that SHE put you in.", "NTA.\n\nYou and your wife entered into an agreement where you will supply for your family and she will care for them.  I see you have stepped over your deal and are in fact helping her with the care of the children, good for you for going above and beyond, is she bringing money in in any other way while caring for the kids?\n\nMaybe she has a hobby she can use to make money?  I think she’s lazy.  Is she doing renovations on your house while you’re at work or is she a SAHM who’s only responsibility is cooking, cleaning and child rearing?", "Your wife needs to step up and get better she wanted these babies and now she gots em. You can’t remove yourself from helping out bc it takes 2 to make kids, it’s not like she took you against your will for your seed lol but if you are already working 2 jobs and handling the 2 other kids then she really needs to get her shit together. Good luck friend", "nta", "I'm going against the grain to say NTA.\n\nShe knew you didn't want more children.\nShe knew you were already working TWO jobs to try to care for the family you already have.\n\nAll these people saying you shouldn't take things out on the twins don't seem to grasp that you said you have two full jobs, plus come home and help out. You DO help her in the little time you are home to do so.\n\nThe wife wanted more children while knowing you couldn't afford it and she knew she wouldn't be able to take on another child so easily. \n\nAnd I feel the worst for the oldest child who will become a slave for mommy to help clean and watch children mommy had to have while daddy is busy working two jobs on no sleep.", "NTA you warned her again and again that another was unsustainable. Then she \"magically\" gets pregnant(she baby trapped you here bro there's  no way that's on purpose) and oh look- you were right. It sounds like your at your witts end", "NTA- you wife did what she did to you on purpose especially if her birth control seemed to be working just fine for 2 years. Then as soon as you say you want a vasectomy and she doesn't agree boom she is pregnant. If that wasn't a set up that is some crazy coincidence.", "And for the love of God help with all FOUR of your children!", "She can object to a vasectomy but his body, his choice. \n\nHe could refuse sex or go ahead with the surgery he chose for his body (then probably be turned down for sex).", "Yup. He keeps talking about it being a situation she created for herself. She didn’t get pregnant all on her own! He 100% contributed to the situation when he knocked her up!", "He shouldn’t have let her have say over his body in the first place.", "Not to mention when she dumps him, if he wants any custody at all, he’s sometimes going to have to have ALL of the kids at his place ALONE. (That’ll show her lol)", "Yup, he was there when they were conceived and knew his wife’s desires to have children and basically put all the responsibility of birth control on her. He’s not a smart man", "Yep. Gotta love how he describes the twins as a “situation she got herself into.” She didn’t come inside herself…", ">She should not have tried to pressure you into having another kid if you didn't want one.\n\nOh, for Pete's sake.  That is not how marriage works.  They were negotiating the size of their family, *as they should*.  If she wanted three kids, she had every right to sort that out with him, just as much as if he couldn't handle another child right now, he has every right to sort that out with her.  Marriage is a shared path, present and future.   Having one person deciding leads to bitterness and resentment. \n\nAnd that would be horrible if he went behind her back and had a vasectomy.  Maybe the timing wasn't right *now* for kids, but maybe it would have been okay three years from now, or five years from now.  Maybe it wouldn't have, but at least no one was unilaterally closing the door.  So much can change in a few years.  Perhaps she'd cope a little better as the kids got older.  Maybe he'd get a promotion or a better paying job with less hours.  Maybe she could work for a bit and then go on mat leave.  That's why you *have* to talk, and negotiate, and figure it out *as a team.*", "This. Ultimately you chose not to have the difficult conversation when it needed to be had. In doing so, you left it to chance and you are now as responsible for those children as she is. You could have used a condom during that period as an extra level of protection. No prophylactic is 100% effective and where you don’t want children it is YOUR responsibility to protect yourself. You chose to enjoy unprotected sex rather than protect yourself from having more children. If you had made that choice, they most likely wouldn’t be here now.\n\nMore importantly, your twins aren’t stupid. They’re going to learn they are the reason their parents fight all the time. So are your older kids.\n\nSo, if you break up, who are your older kids going to blame? How is this going to affect your relationship with the twins? How is this affecting them now? How will it affect all four of them as they grow up?\n\nYou need to reconcile yourself to the fact that those children are there and you are responsible for that. Regardless of whether or not she acted to conceive them against your will, she would have a harder time doing that had you worn protection. Now stop acting like a child. You’re a father. You gave up your choice to prevent that and you had two more children. Now look after your bloody children and pull your weight.", "YTA, OP.\n\nShe did not 'get herself into' this situation.\n\nStep one - go get a vasectomy.  \nStep two - stop being so selfish.  \nStep three - get help from friends and family.  \nStep four - instead of spending time arguing change the diapers and feed the kids, you're wasting energy blaming her and making your children feel unwanted.   \nStep five - no sex until the test confirms your vasectomy was successful.  \nStep six - apologize to your wife.   \nStep seven - grow up!!!", "Also: \"I love these twins but I don't want to do anything involving them\" is not what love is and is something only an AH would say.", "He should have used a condom if he didn't want more, but he's still the AH", "Def YTA OP- I’m pointing out at this point it doesn’t matter what bc failed or who wanted what. You made kids with your wife and they’re part of you- and 100% your responsibility. You may think you’re “punishing” your wife but the kids (who had nothing to do with this) are going to suffer. You really don’t think kids won’t notice if their dad doesn’t care or pay attention to them? Renegotiate jobs, money, etc with your wife- but don’t be an AH to your kids (any of them) over your “perfect family” plan", "I agree with YTA because they're his kids and he is responsible for them. Favoring the two older kids will definitely mess up the younger ones. They'll notice they aren't wanted. \nHowever, I do believe he was coerced. She definitely stopped taking her birth control and lied about it.", "Exactly! Especially the line about wanting to help but just being so taken back by everything he told her would happen. Like you're both partners in this. You either work it out and start helping and have some reasonable discussions with her about how you feel, while still helping out with all kids, or you end up getting a divorce because you're kicking back going I told you so. Your choice but if you love them and her you know what you need to do.", "The \"my wife wants more kids, but I don't, but I will continue to have unprotected sex\" thing is just comically stupid. How did he think that would go?\n\nAnd as someone with one under two that just had twins, it's an all hands on deck situation. There is no kids are her responsibility regardless of whether or not she is working. \n\nI'm also getting very strong OP doesn't help at all with chores vibes from the \"keeping up with daily tasks\" line. There's almost no such thing as completely keeping up with the chores with young children, it's just how it is. And one person certainly can't handle it all.", "> All of your kids will wise up real fast to the fact that dad only cares about the big kids because they’re the only ones he wanted.\n\nCan attest that the effects are lifelong: I was child #4 of a father who wanted zero (or two, depending on who you ask).", "she didn’t force him to finish inside her 🤷🏼‍♀️ don’t want more kids then pull out, even if she’s on birth control. in fact, if you don’t want more kids, get the fucking vasectomy and accept the consequences in your relationship. you don’t need permission to get a vasectomy, it’s exponentially easier than it is for a woman to get her tubes tied. he played just as much part in creating those kids as she did. she didn’t baby trap him, she was on birth control, he just couldn’t control himself and got her pregnant. pulling out isn’t effective on its own, but when combined with hormonal birth control the odds are *insanely, incredibly* small that you’ll end up pregnant. he is 100% responsible for this.", "This. You kept having intimate relations in ways that could produce a child. The implication that his wife pulled the goalie is some sort of total denial that there is a non-zero percent chance that even with perfect use she could have gotten pregnant. And it was clear if that happened, she was not terminating, and you were going to have another kid. How do you just ignore this fact and act like you were a complete bystander to the conception of these twins? You had all the information, you just ignored it and are finding out the hard way the risk wasn’t having a 3rd kid, your wife struggling and realizing you were right, but having a 3rd and 4th kid, your wife drowning, and watching it happen because you didn’t want these kids.", "Exactly.  Its not who's to blame here.  Its real life and actual babies that are fully human beings and deserve parents who help and support each other.  I get OP feeling resentful but its not going to help him get through this.", "OP has a choice here.  Be a dad and a partner or hang on to being resentful.  Its not an easy situation at all.  What he's getting back now is that there's no sending those babies back.  He has a family and it now includes two additional innocent human beings.  If OP is going to prevent hurting himself and his family he needs to change his attitude to something more positive.  And stop blaming his wife for something he is half responsible for.", "Minor note. Oral BC is actually very effective when used correctly. That last bit being important. Missed days, taking prescriptions that make it less effective or not effective at all, expired meds—all of it leads to a higher number of pregnancies. I know a friend who had food poisoning and didn’t consider that her birth control wasn’t digested properly for 2 or 3 days. All of which is to reiterate what you said about wearing a condom if you ABSOLUTELY do not want a child.", "Those things were acknowledged as well as the fact that OP continued to have sex with his wife even though they couldn’t agree on how many kids they wanted. No sex, no kids. They’re both assholes.", "Even if its the case you describe OP is still 50% of the contribution.  He's the one who contributed the sperm.  He does have responsibility.  And the twins are innocent.  The best outcome is that OP accepts that he is now the father of four.  So yeah, he needs to change some diapers!", "It doesn’t matter though. The children exist and he is going to neglect and traumatise them to prove a point. He’d be better of leaving altogether than trying to exist in a fantasy world where they don’t exist and he has no responsibility to them.", "He is working two jobs and she is working 4 24/7. He is still responsible for giving a shit about all his kids. No matter how hard he works outside the home, she never ever gets a break from being mom. If he didn’t want more kids he had plenty of options to ensure that wouldn’t happen. He chose sex, he is responsible for the outcome(s) of penetration.", ">And if she drowns, how will that impact all 4 of your kids?\n\n\nYeah i would be pissed at my partner too if I felt they did this on purpose and wouldn't feel like helping alleviate their burden. But the problem is he's effectively punishing the kids too.\n\nHow loved and cared for can those kids feel with one parent overwhelmed and the other refusing to do more if they possibly can?\n\n>Your role, as a father to these kidos, is to be the best father and role model for them you can be\n\nExactly. It might not feel fair, but that's how it is.", "It’s not even that. Taking the pill can still lead to pregnancy. It’s just dumb to keep rumbling her guts", "Birth control *can* fail, and it’s very much a “my body, my choice” scenario. He should’ve gotten the vasectomy. While that can also fail, using multiple forms of birth control together is a force multiplier in effectiveness. Since one partner in this relationship didn’t want anymore kids, that’s a no-go on having more, despite his wife’s wishes, so a vasectomy shouldn’t have even been debatable if they wanted to continue having sex.\n\nI have an IUD, and despite it being even more effective than the pill, that’s not the only form of birth control my husband and I use.", "Are we really supposed to cheer OP on for punishing his children because they were born? That's just sick.", "It’s not about trust, it’s about responsibility. Of course he should be able to trust his wife, but he also could have easily educated himself on the effectiveness of BC. A quick google search of birth control pills show that based on regular use (meaning how most people use it, ie not perfectly), bc pills are 93% effective. That means 7/100 women using this as their only form of BC would get pregnant in any given year. And OP clearly knows his wife is already overwhelmed and having trouble keeping up with two kids and household tasks, so it should be pretty obvious that a birth control method that requires taking a pill every day at the same time might not be the best method for her. He can trust her but still take extra precautions himself. It’s unfair to put 100% of the responsibility for birth control on women, men have to take on some of the responsibility as well.", "honestly though he’s just as much at fault. if he truly didn’t want any more kids it was on him to refuse sex until he got a vasectomy. birth control falls on both parties not just the woman.", "> then probably be turned down for sex\n\nThen he would be divorced with two kids.  As it is now, he's going to be divorced with four kids, two of whom he did not want.", "Yep, got my tubes tied against the wishes of my then husband. I did it knowing I might be turned down for sex from then on, but lo and behold, he still wanted it!", "Thank you! I have been waiting to see exactly this. This behavior is going to negatively impact all his kids. The ones getting the attention will feel entitled because they even get special treatment in their own home, and the poor little ones will grow up wondering what is inherently wrong with them that their own father doesn’t care if they are alive and well", "Fell pregnant?  Thats not how it works OP!", "They are both at fault here.  But once the cow is out of the barn you gotta deal with it.  OPs resentment is gonna make his family life miserable.  Since the babies are a fact he needs to accept it and deal with it.  He made half of this problem so he needs to step up.", "Because he is actively choosing to not help his wife with children he helped create. He’s not interacting with them as much, so his parenting is poor. He’s punishing the kids and his wife because he’s resentful. That’s asshole behavior.", "He doesn’t want children and still had sex is why. No contraceptive is 100% effective other than abstinence. He wants sex and not get his wife pregnant? He doesn’t need to cum inside her too. He could have worn condoms. Point is, his putting all the blame to his poor wife that is getting tired (physically, mentally and emotionally) by taking care of their children when he contributed his semen to form these children anyways.", "There are all kinds of people voting ESH", "If the judgment is E S H, then clearly the criticism is *not* \"only on him\".", "Like \"How did that happen!?\".  Exactly what my husband said LMFAO", "I think OP is from the UK, that's how they say \"got pregnant\" over there.", "Also, condoms exist.", "Bro, did you even read the story?", "Typical use of both the combined and progesterone only contraceptive pills have only around a 91% efficacy rate, so out of 100 women using them typically per year, 9 will get pregnant. There wasn’t necessarily any baby trapping here. I suspect a mother already run ragged after 2 young kids will be more likely to have “typical” rather than “perfect” use so it’s a less reliable contraceptive choice for her. I’d bet too that her HCP did not tell her the typical use failure rate either.", "Baby Trapped? Like he tripped somehow and his unprotected penis landed in his wife and he ejaculated?! He should have used condoms or gotten a vasectomy if he didn’t want more kids 🤷🏻‍♀️", "Condoms. And. Pull. Out. In addition to any other birth control. YTA", "He could have put on a condom. Not mentioned here so I think he did not do that.", "I find it amusing that people only bring “babytrapping” up as if only men are being trapped. Women get trapped more since they get left with the children to take care of like OP’s wife. I dont see it as it OP was “babytrapped”.", "Maybe he shouldn’t have had sex with her then? 🤔", "Baby-trapped when he wasn’t even bothering to take any sort of BC measures?", "Right. Because condoms aren’t a thing at all.", "He could have used condoms...", "\"Helping out\"\n\nThey're his fucking kids. If he was that against it, he could've gotten a vasectomy. Believe it or not, the doctors will not check in with your wife first before burning the shit out of them vas deferens.", "Helping out? WTF. What year were you born? You don’t “help out” raising your children.", "If he didn't want more children, he should have gotten the vasectomy and stopped having sex until he did.\n\nThat isn't even the correct use of \"baby-trapped.\" They were already together and raising children together, and there's no indication that they spoke about splitting up.", "If *you* are done with babies, you ensure that BC falls on you. He didn’t need the spouse’s consent for the vasectomy and he could have definitely insisted on condoms regardless of what BC she was using. He didn’t trip and fall on top of her to impregnate her either. Men, your body your choice. Once the deposit has been made, it is exchanged and there are no returns. Don’t want that? Don’t make a deposit. Easy.", "Nah OP already a fool because he came in that woman knowing she wanted more kids. That's on him,  no woman can baby trap a man. He the  one that controls where he came and he chose poorly. And he a bigger fool now for blaming her and not helping with the twins because child support on 4 kids and alimony for a stay at home mom gonna eat him up so he better get with the program and walk the line. Lol.", "He was still an active participant, knowing that she wanted a 3rd and NO bc is 100% effective. Wear a condom and pull out. This isn't all on her. He is a giant AH", "I have to repeat this to you too. \n\nI just need to say here. I fell pregnant twice whilst on the pill. And with my daughter I went off the pill and was pregnant two weeks later.\n\nSome women are just highly fucking fertile. My doctor told me I couldn’t even take my pill 6hrs late. It had to be the exact same time every day.\n\nIt shits me to no end that men think women simply cannot get pregnant on the pill. It absolutely happens.", "You do realize that there is a sure fire way to prevent pregnancy, it's not having sex if you don't want another baby. Birth control fails all the time.", "Might be shady, sure. But he easily could have used a condom or abstained until they came to an agreement.", "He decided not to get the snip because she wanted more kids. So yeah, no baby trapping. He damn sure didn't say no to the sex.", "If he was worried about it he could have taken responsibility for controlling his semen and worn a condom…", "Only a fool would want a vasectomy and agree to unprotected sex (with a partner they know wants more kids!)", "At this point it doesn't matter if she had the twins on purpose or not. They are his kids and he lives with them therefore he has a moral and legal obligation to those kids just like his first 2. If he didn't want to raise them he should have divorced her. Sometimes life as a parent isn't fair but you suck it up and do it anyways. But if I was him I would tell his wife to get a job working opposite shift as his so no childcare needed so she can help lighten the financial burden of the kids she so badly wanted.", "Nothing stopping him from using a condom. Or the male pill. Or abstaining. It takes two to tango.", "Baby trapped, yeah, totally..... Except he kept having unprotected sex while there was no resolution to the fight, so like..... Maybe he has some responsibility here too....", "If he really didn't want the twins he would have been pro active in avoiding getting someone pregnant.  He on some level knew the risk and played anyway.", "What complete nonsense, he doesn't get the peace out on being a parent to two kids just because he pays the bills. We're not in the 1950's anymore. \n\nIf that's what he wants then he can file for divorce and see how it flies if he tries to get partial custody for two of the kids but not the other two.", "> *and* by helping out with the kids.\n\nSounds to me like he's just ignoring the twins. That must absolutely suck for them.", "He didn't need her permission to get a vasectomy, that only works the other way around. If he really wanted one, he could have gotten it.", "Condoms are a real thing. His body, his choice.", "Yeah its called being a parent...and why didn't he use a condom then? Why is it supposed to be on the woman? It's not 1950 anymore?", "I guess he should have worn a condom and taken some responsibility for birth control too, huh?", "He could have used condoms.", "So he couldn't use a condom?", ">birth control failed immediately after he requested a vasectomy\n\nDo the math, the 2nd child is 4 and the twins are 1, that is at least TWO years in between having the 2nd and getting pregnant with the twins.  TWO years to get their shit together.  I don't see how you can jump to \"birth control failed immediately.\"\n\nAnd where did I miss the part about her cutting a hole in his condom?!?!?  Oh, that's right, he didn't talk about wearing condoms.  So not having another baby was clearly a deal to him, but not enough for him to actively do something during a TWO year span to ensure it's prevented?!?!\n\nBirth control is not fool proof!!", "You have no idea his SO baby trapped him. Maybe, maybe not.\n\nWhat we do know by OPs admission is that he willingly had sex, anytime sex is had even with birth control/protection offspring is possible only abstinence is 100%.\n\nHe has four kids, He's the ahold for clearly favoring the older two. OP needs therapy.", "And he couldn't wear a condom... why?", "Nobody trapped this grown ass man. If he wanted a vasectomy he could’ve gotten one regardless of what his wife felt about it. His body his choice and he chose to be an AH", "He also could have been wearing a condom since he didn’t want more kids. It’s just as much on him.", "\"Barely ever missed\" - she wanted to get pregnant, BUT he didn't do anything to prevent it and gave a maybe. YTA and she is too. What will these two do to prevent a divorce or animosity or the twins feeling unwanted? I can't say if he's not helping with the kids or doing enough because we don't have details. Every parent needs to participate in rearing kids, even if it is just a bedtime routine or breakfast once a week.  Some people are such excellent SAHP's, running their homes like a tight ship, managing a tight budget but his wife doesn't seem to be doing this. Everyone should work together, but these two aren't managing well. Marriage counseling would be great but probably too costly. Maybe there is a program locally at a church or Y or community social services that could help them.", "The onus isn't only on her for pregnancy prevention. If he didn't want kids, he should be using a condom.", "Nah. He was just as responsible for birth control as she was. He clearly chose not to use condoms and relied on her.", "I got stuck at \"barely ever missed\" when missing it ONCE is enough for the pill to not work for the rest of the month. That's basic knowledge if you rely in the pill🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️There's no way she didn't know that. It's quite obvious that she just didn't care about his wishes. \n\nThat being said: It's not the twins fault. OP should not treat them differently from their siblings.", "I have twins and didn’t have any kids before them. The first couple of years nearly destroyed me mentally and physically and that was with a lot of practical help and support from my husband. If you think he’s knackered, she’s probably on the verge of a breakdown caring for one year old twins alone and two more small children with minimal help. \n\nI’ll never understand men complaining about pregnancy when they continued having sex without a condom or vasectomy especially when they knew their partner wanted to get pregnant. If I really didn’t want a baby and knew the other person did, you can bet I’d make sure my contraception was bullet proof or not have penetrative sex at all.", "Hardcore Christian hypocrite type. He was and still is a piece of work", "Did you know that it's possible to not betray your partner by sabotaging your birth control?", "He could have said no to sex. He could have wrapped it up. He could have pulled out. He could have had the vasectomy but didn't (knowing his decision not to could result in more kids). \n\nInstead he's saying \"she fell pregnant\", and insinuating that it's because she didn't on purpose.. (maybe, but possibly not too).. \n\nIt takes TWO to make a baby.. HE also had a part in it. They BOTH sunk the damn boat.. and they're BOTH going to drown together because they were BOTH stupid and irresponsible. \n\nThe fact that hes trying to stand there and make it out was ALL her doing (like he played no part in conceiving the twins at all) and therefore her responsibility, makes him an AH too... \n\nThey sound like they both need to grown the fuck up. The kids are here now. By standing around picking fights and finger pointing they're not doing anything except ensuring the kids are going to grow up in a volatile and unhappy home.", "He doesn't really give any information about how much he helps out at home though. He's working two jobs + \"exhausted all the time\", so it's not a stretch to believe that when he's home he wants to relax. Especially since he's saying \"extra help\" with respect to helping his wife take care of the kids, which I interpret as him sacrificing his downtime to take care of the kids. But he hasn't given any info about how much he actually helps out at home.", "He helped put the hole in the boat. True story.", "She was not the only one to create that hole, she didn’t asexually reproduce. He may be drowning too but he can’t just exclude two of his four children from his care. Do you know how much that would fuck them up?", "*THEY* put a hole in the boat. Not him. They.", "This. Is the pull-out method effective 100% no. \n\nWas it fully effective for me and my husband over the last 13 years, yes. \n\nAnd the 2 times we wanted a baby…..he didn’t pull out and bam. \n\nIf you’re ejaculating in your partner you are upping the risk of pregnancy.", "That's such bad advice. For all we know, that's exactly what he did, but since it's only like 70% effective he got someone pregnant anyway.", "People talk a lot of shit about the withdrawal method but my husband and I used it for over 10 years. When we decided we wanted to have kids we gave it *one* shot… now we have twins. (So it’s not that the equipment wasn’t working.)", "Win?", "There's been pushback for ages against saying \"fell pregnant\" since it puts all the responsibility on the pregnant person instead of acknowledging that there was at least two people involved. Passive language is the coward's path!", "True but it should be WE feel pregnant not SHE fell pregnant so it's still a shitty comment 🫥", "My point was to stop with this 'poor wife 'nonsense. She is also culpable in the copulation event. He needs to take care of his kids. But it seems you are ignoring the 2 jobs part of the post. I would argue that having two jobs is also exhausting mentally, physically, and emotionally. This is the result of both of their bad decisions and don't give the wife a free pass as she was clearly a willing participant. They both got themselves into the mess so don't act as if she is innocent.", "So questionable", "Even with \"got pregnant\", it's like he doesn't know how it happened. He participated...now has to live with the consequences.", "I dont think so, after he said about OP being selfish even tho he's working 2 jobs which leave him totally exhausted", "*this*", "My second is a nuvaring baby too. My third pregnancy was a mirena failure. I miscarried that one. \n\nBut at the end of the day, dude didn’t want more kids but put the onus of birth control on his wife instead of putting on a condom. He is just as liable here for not taking precautions.", "I love your response. That last sentence especially. while dealing with two young kids I’m sure it was hard enough for her to remember to brush her hair. He could have kept it in his pants, he could have worn a condom, or just gone to get the vasectomy anyways. It seems like here he put all the responsibility of not having more kids on his wife and refuses to take part of the kids that came by her accident and his negligence to be more careful", "Exactly!!  The only foolproof form of birth control is abstinence. He could have taken charge of birth control that way for sure. 🤷🏼‍♀️ \nNot fun but still true. I’m going with NTA but this wasn’t completely out of his control. She didn’t get pregnant all by herself.  So, you gotta love and take care of the new babies because it’s not their fault.  But, I’d probably be inclined to keep an eye on Wifey.", "I hope he doesn’t hold on to his resentment towards the twins — they’ll know (eventually).  They are the innocents in this mess.  Two to tango, yes, but I’d definitely wonder what else my spouse would be shady about in the future.  This can be a festering issue if it’s not dealt with, either between them if feasible or professionally, if necessary.  Putting twins on top of an already overstressed (working two jobs, four kids, etc) situation will not end well.", "For some reason that option never seems to be one that's offered to men.", "This part, cause if the twins got older and were posting about how their dad never helped take care of them cause they weren’t wanted the same people telling him he’s not the ass would be flipping the switch saying what an ass you deserve better you’re still his responsibility cause he still had you.", "Exactly this. He is openly admitting to neglecting his children. He \"helps with\" (takes care of) the older two and not the younger two. People seem to be treating these kids like they're inanimate responsibilities and not sentient people. These poor twins are going to grow up wondering, \"why does daddy play with our brother and sister but not us?\"", "Even if that was the case, why leave the whole burden and responsibility to the woman, why not condom up? If he was suspicious of her, why he decided to be lazy about it?", "I just need to say here. I fell pregnant twice whilst on the pill. And with my daughter I went off the pill and was pregnant two weeks later. \n\nSome women are just highly fucking fertile. My doctor told me I couldn’t even take my pill 6hrs late. It had to be the exact same time every day. \n\nIt shits me to no end that men think women simply cannot get pregnant on the pill. It absolutely happens.", "And some pills don’t work sometimes.", "A friend had a surprise pregnancy because her antibiotics messed with her birth control. \n\nIt was *hard*—especially when things ended with the dad—but she loves her kid and made the most of it. Instead of wishing he didn’t exist she strives to build the best possible life for both of them.", "I've gotten pregnant twice on birthcontrol. Once while on the depo shot, the other on pills. I never missed a pill. Wasn't on antibiotics or anything that could've made them less effective. They were stored properly. I took them at the same time every day. I was careful. It can happen. Now am I saying that's what happened? No. Who knows if it truly was birth control failure or she purposely got pregnant. I think the stats for birth control failure is 1 out of every 100 women.", "Awfully suspicious timing here if you ask me", "Exactly this. He should have gotten the vasectomy (doesn’t matter if it’s “against her will” - it’s his body), used condoms or just not had sex with her. It was his choice to sleep with someone who doesn’t responsibly use birth control and clearly wants more children, and now he doesn’t want to be a grown-up and deal with the consequences. What an AH. \n\nOP, you can’t seriously think that punishing your children as some twisted way to get back at her is an acceptable thing to do?", "Yes !  Exactly what I thought. The thing is, the children are here now, it's a done deal.  I understand how you feel, but your doing a disservice to ALL your kids.  The two older kids now have a mom who is even more stressed and has less time to help them.  They are affected by how their Mom feels, as well as the twins.  Your twins, they at some point going to notice that you do less to help with them, wonder why you love them Lee's.  Plus, your not forming the attachment with the twins that you get by doing things with them.  \nYou should have taken more precautions as far as birth control,  Men are responsible too !  You  should have used a backup.   Be a good Dad and father, ir be remembered as a crapoy one.  And go get a vasectomy now !!!", "I wish i didn’t know this information my biggest fear is having twins it runs in my family too 😫 like no hate to twins but I could never.", "Yep sure is! And if you can’t agree on birth control methods with your partner and you don’t want to risk pregnancy, you can choose to not have sex with them until birth control is worked out.", "Exactly. When my ex suddenly decided he didn’t want to wear condoms I stopped having sex with him. I couldn’t be on hormonal birth control and was saving for an IUD to be placed (I didn’t have insurance at the time and it was expensive up front cost). He didn’t want to help with the IUD cost, which I understood, but I also didn’t want to “fall pregnant” as OP says, so no sex until IUD was placed.", "Well, when you are a parent, you don’t get the right to relax. If you don’t like that, then get a vasectomy or don’t fuck.", "Bro", ">Passive language is the coward's path!\n\nThat should be on a billboard, T-shirt, those \"the more you know\" interstitials, everywhere.", "How about taking responsibility and saying he impregnated her? Seems like a much more apt phrase", "IE ESH", "Well the guy isn’t the pregnant one is he?\nShe fell pregnant, that’s just fact.\nOf course he was involved in it… should have wrapped his Willy instead of being silly.", "I mean, his \"step one\" CLEARLY shows that he did NOT read this.", "At minimum he should've been using condoms. Not even with an eye to the possibly his wife would sabotage her own bc, but just to be as safe as possible. That he wasn't was dumb of him.", "I’m sorry for your loss.", "Yeah, I wanna know if he was using condoms, too, or if birth control was only his wife's responsibility. Because if he was only relying on the pill that a person who wanted more kids was responsible for taking consistently, then how the hell is this a baby trap situation? And he's just neglecting his own children to \"prove\" something to his wife?\n\nNo, gtfo of here with that crap.", "Right! I don’t want kids. I don’t have sex. Cuz they wouldn’t let me have a hysto cuz 1. I was too young to know that I didn’t want kids. 2. I wasn’t “legally” married only common law so if we broke up my next husband may want kids. So guess what? We stopped having sex. Which was fine for him he has ED so he was tired of trying. Don’t want kids quit having sex. You had sex birth control does not guarantee 100% no kids. You had 2 more kids man up, shut tf up and take care of yo kids. YTA", "I think this is an ESH situation", "Where did you read that he’s providing the 1 year olds with love and attention? He says he loves all 4 children but states “Now when I come home from work, I help just as much as I used to with our first 2 children, nothing more nothing less. AITA for refusing to help my wife with the twins?” Major dick move.", " How do you figure?  He doesn’t help with them.", "How can you provide a toddler with love and attention if you resent their very existence and refuse to care for them? \n\nThe child-parent relationship is cemented in the parent fulfilling the child’s needs and the child knowing they can rely on their parental figures.", "If he wasn't wearing a condom, he wasn't reproductively coerced. He relied on another human being to be responsible for him.", "I had a friend who was the result of a failed vasectomy. I've also met pill babies, IUD babies, condom babies, and my own which were pull out method... no birth control is 100%", "My 8 year old is proof of that", "Yep, my 34 yr old daughter is proof of that!!!", "Yeah, took mine for 5 year never have any side effects until I get pregnant!!! Lol\nI remember when I was waiting for a doctor appointment I was talking to another girl who was there bc she have to change her pill bc she was having horrible side effects, and I was telling her that I never had any, then I think and say: “ well I kind of have just this one”, and pointed to my belly! Lol", "You sure can! But you can also terminate a pregnancy regardless of why your birth control method failed.", "Completely agree! It takes two to tango, and if he was that adamant about no more kids, he should’ve been using protection on his end.", "It seemed like my wife only got pregnant on the pill. When she stopped, never got pregnant", "Oh I’m absolutely aware that there is a pretty high failure rate with the pill. I’ve never taken the pill but I’ve heard many stories about people getting pregnant while taking it. It sounds like the person above me is one who doesn’t understand that it happens with great frequency. Some men are definitely clueless as to how birth control works.", "Tbh I was amazed that after being on the pill for 12 years, coming off and waiting for one proper period it only took me three months to get pregnant. I was expecting it to take a while because you hear so many stories about it not working so I figured maybe it was me.", "Pharmacist here! Only one antibiotic has been proven to interact with birth control, that being rifampin. There are theories for other antibiotics, but nothing is proven!", "*mini pill has entered the chat*", "On the pill, according to the CDC the pill has a failure rate of 9%, or between 6-12 people out of 100.", "But he was not “respecting her opinion” that she thought he shouldn’t have a vasectomy. He had his passive aggressive response ready should she get pregnant. He feels it’s an excuse for not taking care of their youngest children. Their older children are going to see him for what he is, a guy who treats them better than their youngest siblings.", "Yea men are allowed to say I don't any more children and I'm getting a vasectomy. If that's a deal breaker for her, well, then he needs to decide if he's firm in his decision. If he is, then they need to decide if this is a marriage-ending decision. \n\nOP it was nice that didn't want to do it without her consent, but you should have worn condoms for your protection. Failing to do so has now put in a bad place and you're probably headed divorce now anyway. YTA.", "I hate when guys blame women for getting pregnant like we can do that on our own. It's the responsibility of BOTH people.", "Yup. After I had my baby I didn’t want to go back on birth control. For personal reasons and I didn’t want it to interfere with my breastfeeding. My husband isn’t a fan of condoms but he is a fan of sex, so he agreed to use condoms lol", "Aside… am I the only one who despises the phrase “fell pregnant”? It’s not some fuckin biblical event that just happens to someone’s body.", "Thing is that he's blaming her for these kids existing, hence why he wants to go the \"I told you so\" route and not help her, but it's his sperm that made those kids. If he didn't want more kids, he should've stopped having sex or dealt with his sperm in other ways than putting it anywhere close to his wife's vagina.\n\nSince he chose to have sex with her, then he is responsible for those kids and he can't take his poor decision making out on them. He and his wife need to deal with reality and figure out how to make this work without constantly complaining that \"I didn't want this.\"\n\nSo, OP, YTA and you need to get on the same page with your wife and make a game plan that doesn't involve just resenting each other.", "I don’t think the judgments are saying you can’t be upset about the situation. But whether he’s the AH for not helping with the kids now that they’re here. \n\nI’m on team ESH but those kids still need their parents to step up as much as they can.", "And she's doing six, 4 children, a husband, and the house.", "Exactly, I mean I empathize with the difficulty of working two jobs but if his wife is wrangling children, caring for the house, and making meals every day of the week so he can have his day(s) off, she's fully within reason to ask for him to contribute more.", "You know, there are some things you really don't need to discuss or share. This is one of them.", "I mean he should get a vasectomy if he wants to continue having sex without a 5th child.", "Just because his wife is against it doesn't mean he can't do it.", "He made an excuse blaming his wife for his lack of getting a vasectomy and still has not gotten a vasectomy. \n\nHis wife can't just get herself pregnant - he nutted inside her and is literally trying to claim she 'got herself into this' mess.\n\nDid YOU even read the OP?", "Thank you. As odd as it sounds, it was for the best. Having a baby at that point would have financially destroyed us. Over 3/4 of my take home would have been daycare. I would have essentially been working for only a few hundred dollars a month at most. We got our third eventually. It happened when we were in a better financial situation to have him.", "he did not wear condoms and he is deflecting full responsibility on her.", "Exactly", "How?", "EXACTLY!! Why is birth control always on the women. If you don't want a baby, put on a condom.", "Accidental pregnancies on the pill are also more likely to happen during months when you have stomach/digestive issues that lead to diarrhea or vomiting because both can cause medication to not absorb properly. Gross I know, but important to know!", "Right? He could have taken extra precaution and worn a condom.", "There are sooo many thing that can interact with birth control pills: some diabetes meds, st Johns’s wort, anti fungal medications, anti-seizure meds, sleep disorder meds. There are even some concerns that supplement pills of garlic, alfalfa, and flax seed can potentially interact.", "Yep! My sweet and only child is the result of me not paying attention to warning on the antibiotics impacting how well the pill works 🙃", "only UP TO 99% effective.", "If OP truly didn't want more kids and didn't want to risk it, he could have just stopped having sex with his wife until they finally decided if they were going to have a 3rd child or not.\n\nIt's not like she got pregnant all on her own.\n\nEdit: forgot to add, OP might not have wanted to have more kids, but he sure as heck didn't do anything to prevent it. \n\nYou had the kids OP, you have to be a parent to those kids. YTA.", "Or having charcoal", "Agreed this happened to me, they didn't know this 35 years ago. Unless he had to have her sign a paper to get a vasectomy,  I really don't have a lot of sympathy.", "Plenty of forms of birth control (the pill included) are even less than 99% effective in reality. The *most* effective forms (IUDs, for instance) are 99%, but that's the best case scenario rather than the standard.", "No, the pill, and most other methods are in the LOW 90% effective.  They list the pill as 91-92% effective.  It appears only IUD, implants, and LAM are closer to 98% effective. (Yes, I know.  Who expects LAM to be more effective? But it’s a relatively short window, and strict rules for it to work).", "Eating grapefruit can also make the pill not work!", "Hi sorry to be that  person but that is a myth, only 1 type of rare antibiotic used to treat TB has ever actually been proven to interfere with birth control. \nhttps://www.nhs.uk/conditions/contraception/antibiotics-contraception/#:~:text=Most%20antibiotics%20do%20not%20affect,diseases%2C%20including%20tuberculosis%20and%20meningitis", "My birth father also had a vasectomy two years before I was conceived. Nice to know I'm not the only one lol!", "I’ve met three “tubal ligation” babies as well.", "To be fair, you're asking for trouble with the pull out method. I don't think that's even 80% effective. At least the others are all over 97% effective.", "I know 3 IUD babies.. one of them is my brother and why were 19 years apart 😂", "The \"pull-out method\" is NOT a form of birth control.", "My mom did not want kids. Had been on the pill for years when she got pregnant with my brother. Got different birth control. Took it the same time every day for 3 years. Her second accident (me) will be 28 this month. It definitely happens, but the timing of her getting pregnant does make me question if she just went off the pill because of the vasectomy talk.", "Ooh, my surprise pill baby is the same age! lol. They were determined", "Well, in the US, it depends on what state you're in. Also depends on if you can afford to go to another state and how far along you are,  or would be, by the time you get to that state.", "Exactly. The wife isn’t solely responsible for the birth control. He could have wrapped it up. He didn’t and now they have four kids.", "She probably had a hormonal imbalance already.", "I vaguely remembered being told it was 1 out of 100 when I was first placed on birth control, but that was over a decade ago nearly 2. The 6-12 sounds a lot more reasonable considering how many people I know who've had birthcontrol fail. It's why I always tell people to use a minimum of 2 types preferably 3 to be extra safe.", "Exactly!", "What", "What? Husband? Wtf does that mean.\n\nThen he's also doing 6 jobs\n\n2 jobs,house,wife,2 kids", "The next couple years are going to be hard with the twins but time flies so quickly and they will become far less exhausting(and less cute) before you know it.  Best to give it your all right now because it is what all kids deserve, and when the early years go well the later years will too.  Also get clipped before getting wild with your wife.", "Still only 99.99% [effective](https://www.discovermagazine.com/the-sciences/friday-flashback-thats-one-miraculous-conception)", "Weight! If you're over a certain weight (depending on the pill), it can be less effective as well.", "Did you know St. John's wort is used as an ingredient in a lot of different beers and liquors as well as some teas and other drinks?", "I had been on the pill so long, I never gave it a thought. Root canal and a 10 day course of antibiotics then BOOM! I was 37 with a 16 yo and a newborn.", "I have a niece and a cousin for the same reason.", "My only child was the result of the 1% failure rate. No antibiotics were needed to help that along.", "The accurate effectiveness with everything you’ve mentioned being taken into account (meaning human error/antibiotics etc) is going to lower the effectiveness rate:\n\n“The birth control pill is very effective if a person takes it correctly and does not miss any pill days. According to the Centers for Disease Control and Prevention (CDC), the pill is 99.7%Trusted Source effective with perfect use. This means that fewer than 1 in 100 people who take the pill may become pregnant in 1 year.\n\nHowever, with typical use, the effectiveness of the pill is 91%, meaning that about 9 in 100 people may become pregnant in a year of taking it.””\n\n\nSource-(good read about efficacy of birth control methods):  https://www.medicalnewstoday.com/articles/322799#effectiveness", "Yes. I was thinking \"you were still having sex while in this debate?\" If this isn't a time to defer gratification, then when is it?", "Condoms. Could've worn condoms until the vasectomy issue was resolved. I think ESH. And they could do with some help.", "That part! He could have stopped having sex or started wearing a condom if he didn't go through with the vasectomy if he truly didn't want to add more children to the roster, and not helping to take care of them gives a YTA in my opinion.", "Didn't they even discuss the matter before they got married or had the 1st kid? Isn't kids and the number of them one of the first things a couple should discuss?", "He could have also started to use condoms, instead of trusting that her “barely never forgetting her pill” would work and thus happily keep on having intercourse. 🙄", "Yeah, thing is it’s not even like he was like I was using the pull out method and she was on the pill or I was using condoms and she was on the pill. He said absolutely nothing that he did to prevent the situation. At least it should be good basic fucking sexual health to understand that accidental pregnancies happen, and if the person you are a fucking wants more children/would not have an abortion. You should probably be extra fucking careful with your birth control while y’all figure that shit out. Like no I’m sorry baby trapping is my partner who had their form of birth control tampered with baby trapping is it mommy didn’t put this pill in her body and I wanted to come inside her so bad so I did and now whatever happens because of it is her problem. Fucking pitiful children having children.", "No no, see she “fell pregnant.” \nHis words, taking his responsibility out of it.", "How many toothpastes are charcoal based now? They use it to dye food commonly as well.", "See, this makes me angry. If he had gone and done it behind her back y'all would be calling him all kinds of AH for doing it behind her back. He genuinely wanted her to agree. That is a husband not someone who \"it's all his fault.\"", "Even IUDs can stop working with antibiotics. My doctor put me on the IUD to stop my periods to increase my iron levels. Image my surprise when I started my period while on antibiotics", "Pharmacist here, this is 100% correct!", "Yep! My mom had her “tubal” after I was born, then 7 years later…surprise! The boy they always wanted. When I was around 15 or so, she kept getting massive cysts on her fallopian tubes so her doctor scheduled her for a hysterectomy. When he got her open, he found they had only done 1 side.", "I worked with a woman, blended family, that she had her tubes tied and he had a vasectomy. Mother nature took care of that for both of them and 'poof' a \"I should file a lawsuit baby\", lol. Crazy. They immediate fixed their respective botches as possible. They love the little kiddo, but super crazy circumstances.", "I have a friend who's oldest brother was an antibiotics baby. Second oldest sibling was a vasectomy baby. And friend was second-vasectomy-and-tubal baby. Mom just said fuck it and convinced her Dr to take it all out, but that took three years.... And a sister was born in the mean time.\n\nTheir parents love them immensely, but never wanted kids due to health risk reasons", "Currently pregnant with my oopsie baby (I was on the pill) \n\nFirst doctor visit I was 10 weeks along and I told hwler then and there I wanted to set a rough time line for a tubal litigation early next year (baby is due November)\n\nI have heard so many stories about this and she clarified that they way they USED to do it, the body would basically heal and the tubes would open back up allowing that cheeky sperm to pass through again. \n\nNow, they take the tubes out completely. \n\nSign me up!", "That's rare. My mom had an ectopic pregnancy after she had me. Worst pain ever she said. Led to endometriosis and finally a full hysterectomy. \nAlso know someone who had an oophorectomy and still conceived a child. Also after many abortions which was her choice of birth control she still managed to have 3 kids.", "Friend of mine had a tubal ligation baby.  She had the procedure done after having baby number two and the midwife that had been there was also the midwife assisting the birth of the unexpected baby..  Apparently she screamed at the midwife that it was her fault she was in “this mess” and “don’t fuck this up again”.  Thankfully the midwife took this in her stride and they were all friends again afterwards. It can certainly happen though!", "Too true.", "It’s okay. It’s typed up so you can read it again if you are confused.", "Yeah I’ve seen studies showing issues at 90 kilos (~200lbs) and even just a BMI of 25 (which is barely considered overweight for women.. not that BMI is super accurate).", "Named Onyx, I presume, short for Onyxpected.", "There’s a lotta ways to give and receive sexual gratification other than vaginal intercourse.  Without getting pregnant.  And it is possible to use MULTIPLE back up methods as a preventative measure against pregnancy. If insistent on vaginal intercourse, back up with Condoms. With spermicide. (The sponge use to be an additional option). And Plan B.  It takes two to make a child.  They are your children. For shame that you are not only punishing her, but THEM by your selfish actions.", "My aunty regularly poked holes in my uncle's rubbers. May that Machiavellian woman  rest in peace.", "Yep, his fertility is his responsibility. He could have worn condoms that he kept with him so they couldn't be sabotaged. I don't care what the wife did if she baby trapped him or not, had he taken responsibility it wouldn't have mattered what she did. It's 100% on him for making someone else responsible for his fertility and being upset at the outcome. \n\nFor the OP, YTA", "Absolutely.  If he truly didn't want more children, it was up to him to make sure it didn't happen.  Don't rely on someone else to handle the birth control.", "The number of desired children often changes once a child is born and the reality of parenthood sets in.", "I haven’t seen that reaction. Plenty of “just do it”. I’ve seen where people get judgemental when guys refuse to get one when their partner is begging them", "He shouldn't have done it behind her back; he should have done it after telling her he was going to.  Children should always be two yeses.  The person who is done having children should be the one to make sure there are no pregnancies.", "It's reversable but regardless - they could've abstained until they sorted this out.  He can't continue to have sex then be shocked when a baby happens. BCP isn't 100%. Condoms aren't 100% (and who knows if he was using them?)", "That explains my period while I was on antibiotics after I got home from the hospital and breakthrough bleeding.  Was on pretty heavy duty meds for a while in Apr-June when had a bad bout of pneumonia.", "When I was pregnant with my son, there was a lady who went to the same birthing class that this happened. She said she was expecting twins, though. She always referred to them as her rotten eggs, lol (jokingly)", "Just FYI, endometriosis can’t be caused by something like an ectopic pregnancy. It was probably already there, she just didn’t know until after the pregnancy. No hate, there’s just a lot of misinformation about endo out there.", "That’s a kind offer but I respect my brain cells too much for that", "BMI is a terrible representation for women unfortunately. BMI was based on average male height and weight and even shows me as overweight on a BMI scale (I'm 5'3 and weigh 8 stone) I look underweight. It also doesn't take into consideration any muscle mass. \n\nI was apparently obese by BMI terms when I was 10 and a half stone. Though I was a fitness instructor then and bout 3 stone of that weight was muscle", "Wtf??? You shouldn't have to doubt the condoms from your significant other, that's totally on her for being a asshar and lying about the protection", "I gotta say, this is the sassiest exchange I’ve seen all day and I love it. Y’all have sarcasm down to a beautiful art 😂", "I know… that’s why I mentioned in my comment that it isn’t accurate. I weight lift; according to BMI I am always overweight. \n\nThe only reason I mentioned it at all is there are studies done where they used BMI as the reference point for birth control efficacy.\n\nEdited to removed duplicate phrasing", "She was on the pill. Other people have said she might have lied, but even if she took it 100% reliably every day it doesn't make it 100% effective. And yeah, some people might try to poke holes in condoms. \n\nPoint is he needs to take responsibility for himself, just like women do. He should trust her and he did, but now there's 2 babies he didn't want and he did absolutely nothing to prevent it.", "YTA... Hands down. You are taking no ACCOUNTABILITY. There is only ONE way a woman can get pregnant. Take a guess at what that is 😒", "YTA, they are your children. You say you love them but you are not showing that. I get that you didn't want anymore children but your wife did not get pregnant by herself. You are just as much responsible for the younger 2 as much as the older ones.", "YTA. Takes two to tango and you keep putting all the blame on her. It's your responsibility too.", "YTA. If you didn't want more kids you should have stopped having sex until the issue was decided. You don't get to not help with them now that they're here. THEY did not choose to be born, and THEY are entitled to being cared for by both of their parents. Whether you wanted them or not they're here now and you're just as responsible for their existence as your wife. Like, how can you even ask this question? Of course you're the AH.", "YTA.\n\nYou should have been more careful of you were so adamant about it (no sex without condoms for example).", "YTA. What you wanted or did not want is irrevelant  now,you did not take any steps to prevent this situation. You did not use condoms and you did not get the vasectomy.  You left all the contraception job to her, just as you leave childcare. She did not make the twins with her finger so you are as responsible for them as she is. When you take care of them you are not \"helping with the twins\", you can't babysit your own children. Does the fact that you didn't want them even make a difference? Because when you talk about how \"My reason against was that I felt that she had a hard time keeping up with daily tasks with only 2 kids\" I get the feeling that you weren't parenting the children that you did want either", "So because the twins weren’t a part of your overall plan they’re denied the experience of your parental attention? YTA", "YTA  It does not matter what both of you wanted in the past.  The fact is that now that you have 4 children you need to help with all of them.  You owe it to the children.", "NTA. Just swap the genders and realise how fked up it is. She's just using you as someone to fund her lifestyle.", "NTA. This is a rough one. But in the end, wife wanting more kids and expecting husband to enable her wish *against his will* makes her the asshole.\nBtw, OP, you might want to consider a paternity test.", "NTA\n\nYou working your ass off to support your family financially and at home I don’t think it’s too much to ask for you to get a break. It’s not as tho you aren’t still helping because you are. \n\nI’m sorry you have to put up with that 2 jobs 4 kids and barely making ends meet is not a fun place to be in. I feel like if anything you should’ve talked more with your wife about not wanting kids and some alternatives for the valid concerns you brought up.\n\nLike maybe she could get a job that comes with daycare and she takes some of the kids there.. maybe wait a few years to have another one until you get a promotion or get a 2year degree or trade schooling to get more money. That way you can get more money and time to spend with the kids.\n\nConversations NEED to be had. As a female I feel bad that we always put the burden on men to provide and care for us. You shouldn’t feel bad for wanting autonomy over your own body, help her understand that or use condoms evry time since it sounds like she’s not consistent with the pill(which you have to be) unless she was intentionally skipping to trap you into more kids.\n\n\nIf anyone’s saying your the problem they need to  consider what it’s like in your shoes and stop being misandrist", "YTA. The way you’re acting is going to continue to build resentment that will never be overcome. \n\nLike it or not, this happened. You have four kids now, and two of them really need your help. So does your wife, even if you’re upset with her. Birth control can fail. I’d highly encourage you two to get counseling if you’re able to afford it. This is not just a sweep under the rug type of thing, but in the meantime you need to take care of your children.", "If you didn’t want any more kids then you should’ve been wearing a condom. Bc pills can fail even when taken everyday. Regardless if she got pregnant on purpose or not those are your kids too and you need to be helping. It sounds to me like you’ll be heading in the direction of divorce soon as you both seem unhappy and then what are you going to do when it’s just you and the 4 kids on your days with them?? Not take care of them and make the other kids do it? Your just being childish and only hurting your twins by not bonding with them as much as you could be. YTA.", "YTA, obviously you have to help your wife with your kids", "YTA\n\nIf you were so against having more kids that you would end up refusing to take responsibility for them, you never should have made the vasectomy a conversation. I get that you were trying to be fair to your wife but really you needed to be thinking about any potential future children. Which you were not.\n\nYou didn't get snipped, you humped two more babies into your wife, and now you both have four kids. Suck it up and do your fucking job.", "YTA \nPerhaps she baby trapped you but I know plenty of women who the pill failed on. They are many elements that effect the pill such as sickness or medication. It is a hormone which your body isn’t guaranteed to agree with hence why it isn’t 100% effective.\nSo you hadn’t had the vasectomy yet, but you apparently didn’t pull out or wear an condom. You didn’t refuse to fk or was assaulted against your will so these babies are equally the result of your actions. \nStop being a resentful AH and start being a father equally to your four children and a partner. Otherwise you will spend your life with 5 people who will potentially grow to resent you.", "YTA. Did _you_ do anything to prevent pregnancy?", "YTA. You are creating a cyclone for yourself. Fact is wanted or not they exist. They didn't ask to be born. Not helping your wife is impacting their lives not just getting back at her for how you feel wronged. Whatever the case you have decided to stay with her, so by not helping her she is going to become more and more exhausted. This is going to impact your relationship. Resentment all around. Man up, and get over yourself. Maybe get some couples counciling to give yourselves the opportunity to feel heard before this turns into deep bitterness. Although it sounds like you are dangerously close.", "YTA,despite what you knew and say about the situation,you're their daddy ,act like one,a good one.Sure it's a lot of expense and work ,love em anyway and shut the baby  factory down.", "YTA. If it was so important to you that you have no more kids, you shouldn't have had sex. You should have doubled up on protection to cover any gaps, you should have advocated for termination. You didn't do any of that. It takes two to make a baby. Refusing to help with your and acknowledging only the older two tells the your whole family which kids you love most. You are teaching your older two to shirk responsibility if they don't want to do whatever needs to be done. You are also teaching them their mother's feelings don't matter and they can treat people badly if they don't get exactly what they want.\n\nAnd for everyone saying he was baby trapped, he was already married to her (though maybe not for much longer) and had two kids. What was she trapping?", "YTA. You cannot make a child without an egg and sperm.\n\n\nHalf of that equation is your responsibility\nIf you don’t want a baby, don’t let the sperm and the egg meet- condoms have been around for a very long time now", "*“My reason against was that I felt that she had a hard time keeping up with daily tasks with only 2 kids”*\n\n\n⬆️ She’s your wife; not your pre-teen daughter asking for another Guinea pig when she can’t seem to manage finding time for cleaning the cage every Sunday afternoon… This is such a gross thing to say about your wife \n\n\nYTA", "YTA - then you shouldn't have had unprotected (on your side) sex with her. You're responsible for your own parts.", "YTA", "YTA. No, you don’t get a pass on this. You are a parent and they are your responsibility. Your beef is with your wife, not the kids.\n\nAnd I do have sympathy for you, just as you held off on the vasectomy- hardly ever missing a pill is messed up. In my world when it comes to kids it is a two yes one no world.\n\nI hope you two are seeking counseling to work through this situation. Good luck.", "YTA - how the children came about is irrelevant now that they're here. Stop being so petty! When are you going to get over yourself? Your wife needs some support from you so help her for God's sake. What does watching her struggle really prove, other than that you're the asshole?", "YTA condoms.", "YTA Are you serious? You could've used a condom, double condom, and no one forced you to have sex with her. How can you not see how YTA you are?? Dear lord.", "YTA. You're responsible for where your jizz ends up. Take accountability for the children you created.", "YTA- you fucked her, it’s also your problem. You should have said no.", "YTA, you are their father, this is critical bonding time you are refusing to have. Not to mention it is extremely hard taking care of two babies, a toddler and a young child. I get you work two jobs and are tired too but marriage is about equal partnership not I told you so, so now I won't help when you are drowning. This path will only lead to resentment from your wife and kids and possibly a failed marriage. Consider getting daycare and your wife getting a job full or part time so you both can financially help and for her to get a break from children 24/7", "YTA - Do you really want to live a life where you and your wife are constantly at odds and your wife is stressed out just to have a 'I told you so' moment? Focus on where you are now instead of digging over old ground - help out with the kids, all of them. You're just making everyone miserable, including yourself, if you stick to your guns here, and it's not fair on the kids to neglect them because of what happened between the adults. And if your wife is as stressed out as you say she's already learnt her lesson. (BUT obviously get that vasectomy).", "geez yes YTA \n\nIt's an unfortunate situation but they are still your kids and do you think it's fair to them? They will probably grow to resent their father when they see you only \"raise\" their brothers but not them\"to teach your wife a lesson\"\n\nFreaking grow a pair, man up and take care of your kids", "YTA. Next go get a vasectomy and start changing diapers. Lead your house next time and this wouldn't happen. Too late for I told you so. Get government assistance if available.", " YTA … they’re still your kids dingus.", "YTA\n\nnot much explanation needed 😂", "YTA- you were there when they were conceived which means you’re equally responsible. Also, do you really think when they grow up that the twins won’t be able to tell that you treat them differently? I know you said you love them but subconsciously you’d be treating them differently. \n\nAlso ‘I felt that she had a hard time keeping up with daily tasks with only 2 kids.’ Yeah YTA", "YTA suck it up. You’ll survive.", "YTA - accidents happen even on the pill, and you could've still taken extra precautions. Resent your wife a you want but don't let it affect how you're there for your kids. They don't deserve to feel like runner ups when it's not their fault they were born.", "YTA\nOp knew that without the vasectomy, there was chance of pregnancy.\n\nOp is essentially blaming his children for being born.", "YTA. Maybe some shared AH-ishness, but the kids are yours and you need to help where you can. Final answer.", "didnt want more kids, she wanted, no more sex !!! or for sure protected sex from your side.\n\nnow... get over it, they are there they r yours, grow up! she did not insert a needle into your balls to take your sperm....\n\ni even forgot i was to give an judgement... YTA", "YTA there’s really no need for the story.  The kids were born, step up and do your job as a parent.  End of story.", "YTA\n\nYou are \"punishing\" your wife for getting pregnant again by hurting two children who did not ask to be born. And yes, your actions will hurt them. Kids pick up on emotions like sponges - they won't know why they are the cause of anger and resentment between their parents, but they will *feel* it. And blame themselves. \n\nGrow the fuck up and be an adult here. You don't always get what you want, but at least you have choices and some modicum of control. Those kids only have one childhood and no choice on how it will be spent. \n\nGo to therapy, get over your pettiness and resentment, divorce if you need to, but be a proper fucking parent to all your kids.", "YTA. Quit playing favorites with your kids. They will notice as they grow up.", "YTA. Didn't want more kids? Then don't have PIV sex, that fkn simple. Men love to cry baby trap, but it takes two to tango. You could've wrapped it up. But NoOoOo, your little peesh wouldn't feel as good. Also, you are married. Those are your children. You don't get to sulk and stomp your feet like a toddler. Be an adult. Take care of the children you created. Or do everyone a favor and divorce her and be another every other weekend POS \"father\" that whines about his whole 300 dollars a month in child support. She'd be better off. At least then she could get a break, and possibly meet a real man.", "YTA, they are your children. If you didn’t want to have more than two kids… you could have not had sex… or used a condom…", "YTA- It's still your family. Things don't always go to plan,that's just life. If you love your children why won't you help with them? It's not like it can be undone. All you can do is either accept that this is your life now, step up, contribute and make the most of it OR you can keep being petty and refuse to help your wife which will eventually cause a divorce.", "YTA. Oh dear, do you want to hear that you were right about hard it would be? Congratulations, you were right but you didn’t prevent this pregnancy any more than she did. Even if you suspect she didn’t take her bc it is not 100% effective. Since you knew she wanted another baby and you did not you could have gone without sex until it was settled. But you didn’t do that. Now you have two more children, that are also YOUR CHILDREN who need their father to be a father. Do you care for your wife at all? Instead of holding a grudge just move on and grow up and care for your kids.", "YTA. Not wanting to ‘take care’ of your own children because of an unwanted pregnancy is juvenile. It takes 2 to have a baby. Pull your finger out and help her with your damn kids! Her taking the pill is not 100% bulletproof (all you need to do is have the runs or drink too much orange juice or alcohol for the pill to stop working - look it up). If you want a vasectomy, go do it! It’s your body and choice to do so. The lack of personal accountability 🤦‍♀️", "YTA: you don't get to pick and choose which of your children to take care of, and it's crappy to act like this is a \"told ya so\" situation. You made these kids with your wife, and they're your responsibility even if you only wanted two.\n\nAlso you mentioned that your wife was on the pill, but not that you were using any other contraception like condoms. The wording implies you're blaming her for the pregnancy, as if she \"forgot\" to take the pill regularly. But if you were solely relying on the pill, then you're even more YTA.", "YTA. You hadn’t made a decision and pregnancy remained a risk with one BC method. They’re your kids too and making clear you didn’t want them by only providing care for the older ones is a terrible example for all the kids.", "YTA.\n\nThey're your kids. Unplanned pregnancies happen all the time, that doesn't absolve you of your parental responsibilities. Simply saying you love them and provide for them isn't enough.\n\nUnless you're trying to insinuate that your wife was lying about being on birth control, but even then this would, at best, be an ESH. You still had consensual sex with your wife who you knew wanted more kids. You either should have avoided sexual relations until you were on the same page or, if that's not feasible, use condoms to be safe.", "YTA\n\nYou’re refusing to care for your babies to spite your wife. Wear a condom or pull out next time if you’ve made the decision to neglect any further children and your wife. YTA x1000.", "YTA. You know what causes kids, right?", "Oh I’m so mad… YTA- personally Ya I got pregnant on the pill and with a condom. Regardless if you wanted them or not… they are there and right now you’re showing those kids how you don’t give a shit about them because you’re being a petty child.. Great dad figure right there.. \n\nHow about you man up and “help” with your damn offspring. What happens if your wife ever died? You just gonna “ignore” the kids you didn’t want… you just gonna work and never do the kids laundry or cook or school? Or shopping or doctors appointments or EVERY FUCKING THING ELSE… I never wanted my kids but hey guess who got left holding the fucking responsibility while the man took off or half ass helps.. Children are not something people can just DECIDE to not take care of. Wtf. Grab your vagina and put on your big boy pants. You’re a father to kids whether you wanted them or not. Don’t punish the kids because your wife might have done it on purpose or maybe it really was a damn accident.  IT DOESNT FUCKING MATTER. These are human beings now in a world with a parent who purposely ignored them because HE FEELS LIKE HE DOESNT WANNA TAKE CARE OF THEM. If you didn’t want kids FOR SURE then keep your pecker in your fucking pants if she wasn’t being responsible. How about that? Ffs. Grow UP. No fucking wonder some many kids are fucked up when people treat them like accessories. Ya well  I DIDNT WANT A BABY WAAAAAH WAAAAAAH WAAAAAH. 😭 too fucking bad. Those living breathing people are there and it’s your responsibility to be a father whether you “want” too or not.", "YTA – And the worse of it all is that you try to make it sound like she coerced you into having more kids, man up and take care of them all.\n\nAlso is so lame your excuse for not getting a vasectomy done, I mean after all is your body your choice even if she was against it, so if you wanted so badly to not have more kids I don't see why you thought you could go on without a vasectomy but expecting her to take pills every day.", "Im no sexpert - but last i checked it takes two parts to make a baby. Seems like you just want to conveniently blame your wife for everything. Dont want more babies? Dont have sex. Wear a condom. So many ways that YOU as the man, can prevent it too. \n\nTheyre your kids, like it or lump it. YTA", "ESH. Please have these types of arguments before getting married. Don't make your kids suffer.", "YTA.  They ARE your children, even if you didn't particularly want to have a larger family.  \n\nHow is this any different than any other consensual relationship where the woman gets pregnant but the man didn't want a child?  Birth control CAN and DOES fail.  If you adamantly don't want more offspring, then DON'T HAVE SEX.  \n\nI know there might be some here who say that's not fair, but that's the only 100% guaranteed way.  Even a vasectomy, in the early days, can fail.  Your wife didn't \"fall\" pregnant, she was impregnated with YOUR sperm.\n\nYTA, too, because, work load or no work load, helping to take care of your children is about love, and bonding, and joy, and developing relationships, giving baths and hearing giggles, learning what they like to eat, and the list goes on and on.  It's NOT about who does more or less, who earns more or less...it's about LOVING these little people who are your FAMILY.  Not doing more just to prove a point is a dick move.", "YTA.  And just so you know, you don’t need anyone’s permission to get a vasectomy.", "YTAAAAAAAAAAA YTA YTA YTA YTA", "YTA and you sound like a child with that \"it's not fair\" bullshit as an excuse not to help. Whether it's fair or not they are here and they are your responsibility.", "Having a hard time believing this is real.", "No, if she refuses condoms and objects to a vasectomy, you get a vasectomy anyway. That's the way. She has zero right to object to him taking control of his own fertility.", "I agree with this. ESH.\n\nThough I do feel for OP being the sole provider for 6 people OMG", "I can't be the only one thinking - she was definitely lying about taking her birth control towards the end.", "Yes and he's not just punishing her he's punishing those children who are going to wonder why they are treat differently from their siblings and why their dad doesn't seem to love them as much. He needs to talk to someone and then him and his wife need to see someone together to work through their issues.", "And if he was really worried about more kids he could have taken responsibility for birth control, he could have used a condom. These twins will know their father didn’t want them. I find it hard to believe that he loves them. If he did, he wouldn’t be using them as a weapon against his wife  YTA", "All I needed was to read the title to this post to know immediately OP is the AH.", "My man’s treating 2 newborns like a goldfish he didn’t want", "This ^", "The people saying Y T A are insane to me because if OP's wife was lying about contraceptives, that is SA.\n\nA man poking holes in a condom, lying about a vasectomy, or stealthing IS SA, why is it not SA ***IF*** she stopped(\"missed very conveniently\") taking pills?\n\nPersonally? It's an ESH EASILY especially depending on whether or not this pregnancy was purposeful.\n\nIf OP was really baby-trapped, it wasn't his conscious choice, they weren't in the financial position to have children, and it's really scummy that so many of the comment section has the view of, \"You should've had 0 faith in your marriage partner to not sexually assault you and just abstained from sex.\"", "Yeah ESH, but it is ridiculous how many people are saying 'you didn't want kids don't have sex' but would also say 'consent to sex is not consent to pregnancy' when women need abortions, and how no one is going to just stop having sex because they might get pregnant. If a man poked a hole in the condom to get his wife pregnant on purpose he'd rightfully be slammed for it. \n\nHe still shouldn't take it out on the kids because it's not their fault in the slightest, but I don't have any sympathy for the wife if she really did skip her BC on purpose.", "You totally agree but voted YTA?\n\nIt’s ESH, no more no less.", "This ^ it needs to be higher. Body autonomy isn’t just for women, it goes both ways. If it had been the other way around this would have been a completely different post.\n\nIf he wants one he shouldn’t be bullied or pressured into not having one.", "This 100%!! Forget her, these are YOUR BABIES we're talking about! Have a little integrity. You made them, time to step up and CARE for YOUR CHILDREN.\n\nEdit: ESH btw.", ">OP- don't not care for those babies because of your partner, care for them because they didn't do anything wrong in this situation\n\nThis part.", "Op mostly is drained by his 2 jobs and 4 kids are just too much for him. It's understandable. I would say op is not an asshole but it's certainly understandable how he has no energy helping more than he was.", "No no no, didn’t you see? She FELL PREGNANT. Clearly he had nothing to do with it!", "Same that’s so unfair to him to ask him to help out even more when he’s already providing for 6 people. The amount of time and responsibilities are not shared equally", "Where did he say they weren't using protection to his knowledge? He explicitly said she was on birth control. So either it failed or she lied.", "And he still had sex with her.", "If he was so adamant about not having more kids he could have used condoms on top of the pill. Maybe she got pregnant on purpose, maybe not, but dude knows how babies are made.", "Her vagine fell on top of his junior.", "That's a common way to phrase it in UK English", "I hate that term.", "Yes! This post has really gotten under my skin. If OP had posted in a subreddit asking for help with his resentment towards his wife getting pregnant, that would have been honest and understandable, and people might have helpful advice. We’ve all dealt with resentment for one thing or another. \nBut going on Reddit to get validation that you’re right and you shouldn’t have to parent your twins is totally missing the point. Your wife was hoping for a third child, somehow you were blessed with twins. It’s probably the hardest time in you and your wife’s life as far as convenience goes, but I hope you find a way to deal with your resentment and not take it out on your wife and children. You are a grown-up and you need to dig deep and be the best husband and best father you can be to all four of your children. \nSomething helpful I learned when my kids were young and I was exhausted was that you’re not just raising your kids. You are influencing 4 generations for every child you have.  As much love, time and energy that you put into your children now, you will be modeling not only for your own kids, but your grandchildren and their children. You showing your kids how to be a good dad will show them how to be one also. That’s four generations and it’s worth putting the effort in now. I know it’s hard. I hope this perspective is helpful. Wishing good things for you and your family.", "Y’all literally believe women are just babytrapping liars. BIRTH CONTROL FAILS. He’s not fulfilling his responsibility because he HAS TWO OTHER CHILDREN?????", "1.3k upvotes for “he’s right to abandon the twins and pretend he only has two children!”. Amazing world we live in.", "Ewwwww. This isn’t 1950. Or even 1980. Help raise your kids, you selfish jerks.", "Hold up though. OP if you were adamant about not having more kids, and she was refusing to “let” you get a vasectomy, then you should have wrapped it before you tapped it regardless of her method of birth control. \nYTA. You wanted to get your dick wet without consequence. \nPregnancy is the consequence of unprotected sex. \nBirth control isn’t infallible.", "Likely? Yeah. *Definitely*? No. Birth control pills can fail to prevent pregnancy even when taken on schedule, it’s rare but it happens. Just felt the need to clarify that because some people genuinely don’t know birth control pills can fail and it’s a risk everyone should be aware of.", "It isn’t help, it’s parenting. Her “job” is to watch her children while he is at work. Anything above that is extra and is just parenting that should be split 50/50", "He’s 50% responsible for this.\n\nNeither of these people sound all that decent. Though I’ll give them credit for the stress of being parents to four small kids.\n\nHowever. Why don’t more women have hormonal IUDs? It’s a local hormone injection that lasts for a decade. Don’t do copper because there’s a higher risk of infection (my sister nearly died).", "I think he’s helping with the original two kids and not at all with the two new babies. Those babies are going to notice their dad doesn’t care for and  interact with them as much as their siblings.", "> \n> If a man nut in me I think he must want me to possibly be his baby mama- I am on Mirena tho 99.8 effective\n\nJust gotta nut in you 500 times. That's how statistic works right?", ">I am on Mirena tho 99.8 effective\n\nMy Mirena baby is 9 months old. 🫠\n\nNeither of us wanted more kids in this situation, but here we are. I'd be livid if my husband had been like, anyway, _I didn't want that one so I'm not going to help take care of them._", "Are you seriously saying you don't use condoms? I mean, just to cover for the pregnancy gap, possibly, but more for STIs. Also, do you want to be a \"baby mama?\"\n\nI have to tell you, the majority of \"baby mamas\" I know wish they weren't, and they wish they knew the father. Your comment makes it sound like you are working on extremely risky ground.", "Yep \n\nThe effectiveness of the pull-out varies massively between perfect and typical use, because the margin for user error is colossal\n\n•\t⁠Perfect use: 96% effective\n•\t⁠Typical use: 78% effective\n\nWhich actually isn't a million miles off the effectiveness of condoms\n\nCondoms:\n\n•\t⁠Perfect use: 98% effective\n•\t⁠Typical use: 82% effective", "Damn you can get pregnant from falling? American high school sex Ed really did me dirty.", "lol. “I had unprotected sex and it resulted in a pregnancy. but I don’t have any responsibility here, right????”", "So you don’t stick it in! She didn’t rape him. Both twits are asshats", "Baby trapped? No. He could have worn a condom. But apparently that’s too much work, and instead he’s comfortable relying on oral contraceptives which don’t have the best track record.", "Jep no birth control is 100%... I got pregnant with a perfectly placed copper IUD that had worked for an entire year prior and suddenly.... didn't anymore\n\nIt's not like there was user error\n\nBut yeah, it is a coincidence that makes me think twice if the twins were an accident but I still don't think he was baby trapped. He had sex with his wife knowing there's a risk and he was shit out of luck.", "So does being over 30. So does being black. I’m all 3 so I make sure my BC is iron clad. I do not want twins in my late 40s.", "Yeah, and with baby twins there is absolutely. Zero. Downtime. I am a twin. My mom can’t even remember most of our first year or so of life because literally all she did was feed us, change diapers, put us down for naps, and attempt to sleep herself before one or the other baby woke up hungry again. Didn’t get more than 3 hours of unbroken sleep for the entire first *year*. And we were their only kids at the time. I don’t super want kids but I *really* don’t want twins. \n\n(My dad was helping, don’t worry. But he worked very physically demanding 14-16 hr shifts at the time, so he was also exhausted.)", "Or a fucking abortion. Jesus christ, did they not even talk about that option? These poor fucking kids.", "“She didn't just \"fall\" pregnant- OP 100% shares responsibility for that.”\n\nTHIS!!!!!  Like how the hell can ANYONE NOT BE CONSIDERED AN AH when they are literally admitting to neglecting half of their children just to prove a point and gloat in his having been right ab more kids being a bad idea?  Dude didn’t care enough about not having more kids to stop having irresponsible sex!  And the fact that SO MANY of you are seemingly missing the part where he IS NEGLECTING HIS INFANTS or just don’t care ab that is really gross….he is definitely TAH based on what his question was-‘is he an AH for not helping w the twins?’….YES DUDE, YES THE FUCK YOU ARE!!!!", "But his wife actively wanted the drowning to happen. Also refusing to drown together is something most people would normally find a perfectly good solution. Why throw your own life away for no gain after all.", "Considering OP says \" I felt that she had a hard time keeping up with daily tasks with only 2 kids\" they probably weren't helping much or at all with household tasks or childcare even before this happened.", ">which I interpret as him sacrificing his downtime to take care of the kids.\n\nThat's... That's parenting when you have kids, _especially_ when you have young kids. I'd _love_ more downtime when I get done with work, but then it's dinner time, bath time, and then corralling the bedtimes for 3 young children. I have small kids similar to OP's (5, almost 3, almost 1) and there simply isn't time for everything you want to do. There's precious little downtime in general. My husband and I joke that we can pick one thing to do in a night, if we're lucky. \n\nLike, I empathize with both OP and wife, I really do. But he doesn't have more rights to downtime then she does, and he damn well needs to be helping out at home. This phase of their life will pass, and how they treat each other during it says a lot about what kind of marriage they're gonna have on the other side when there's time for hobbies and time together.", "They may already know.", "Right?! Which is why if he didn't want anymore, he should've been wearing a condom himself. Birth control fails and he can't just blame her if only she was using it.", "Yep. Dealing with that right now lmfao", "Yo, I’m sorry I’m all over this thread and I’m about to get the fuck off but as a woman who works in reproductive health this shit is just fucking mind blowing to me. I bet you none of these men talking about baby trapping or none of this shit have alarms on their phone for when their partner is supposed to take their pill, or have extra water for her in their bag or something to take it with if she can’t take medication on an empty stomach. I’ve worked with so so fucking many women who are trying to fit there a pill into their busy ass schedule because they have to take it on the same time absolutely every day no exceptions and it’s hard to find a time when you’re absolutely available every single day of the year but sure failing to put something that can be super finicky in terms of reactions in your body on time is baby trapping when literally all the other person would’ve had to do was put a piece of rubber on their penis at the exact time and place where they’re having sex so it’s not even like they can forget or have it slipped your mind. I fucking bet you if we made men take placebo’s for a month like this all the fucking baby trapping bullshit would stop and people like my partner who are actually victims of assault and having their shit tampered with could be taken seriously.", "The mini pill is much more finicky about timing, with a restricted window - so travel & multiple time zones can be especially tricky to stay on top of. The combined pill still obvs has to be taken daily but exact time isn't so important \n\nThe mini pill has loads of advantages, but the margin for user failure is quite a bit higher", "The combo pill is more forgiving, but absolutely the progestin only pill", "Or puke.", "For a lot of people, when you go off the pill is when you are like the most fertile you'll ever be.", "Women sometimes think this as well.", "Spiteful neglect is still neglect.", "Fuck that, cum on your lips, and some on your tits is the quote", "Ding ding ding, we have a winner. Baby trapping is when she put holes in his condoms, or if he were sneaking his condoms off without her knowledge. Anytime YOU don't want anymore kids YOU become responsible for seeking out permanent BC because pills and condoms don't work 100%. \nSounds more like he's just selfish and too immature to take responsibility for HIS actions. Both of them, 1) not getting a vasectomy, and 2) choosing to continue to have sex when he hadn't gotten a vasectomy.", "No sex in a relationship is a deal-breaker for many men and women though.", "If she truly sabotaged it on purpose then it's definitely an ESH situation. But it's not obvious that she did. \n\nEither way, once your kids exist, and especially if you're still with their mother and living in the same house as them, it's not at all relevant how they came into being. You still have an obligation to care for them.", "Also some ADHD meds", "That's how my son was born. Antibiotics cancelled my pill and we didn't know that was possible", "That's why it says in the patient information sheet you should use condoms for the duration of the antibiotics and 7 days after", "My mom says she has one kid for every form of birth control they used.\n\nI don’t exactly buy it but there is only one way to not get pregnant and it doesn’t involve birth control.", "It is not legal or accessable in many locations", "Both my babies were conceived two weeks after I went off bcp. I took it from 16 years until 31 and then 36 for my second baby. It was crazy fast which shocked me to no end.", "No, I'm right there with you. I hate the phrase.", "Ahhh poetry FR love him tho", "Completely understand! The universe sometimes knows better than we do.", "The way he says she got herself into this situation makes my skin fucking crawl. If he didn’t want kids he could have done a number of things to prevent it.", "That would not put me in the mood for sexy times…\n\nBut the more you know!", "99% is perfect use. Typical use is about 93% effective.", "It seems like \"don't have sex if you don't want a baby\" is only really a thing when talking about women's reproductive rights...", "He also could’ve worn condoms and pulled out (because condoms can break) but instead just kept cummin in his wife", "Right like did OP even attempt the pull out method? Did he suggest wearing condoms? Like I’m so confused how he’s just like well too bad lady you got knocked up with twins you deal with it🤷‍♀️", "This! He is as much responsible as she is, regardless of the situation of her birth control. If OP didn’t want more kids and they were not on the same page, then he can choose not to have sex.", ">it is not fair to get yourself in a situation when everyone is advising you against it..\n\nOP needs to reread this part of what they wrote.", "Charcoal in food! \nAsk about that black beverage as we head into spooky season\nwww.businessinsider.com/does-activated-charcoal-make-birth-control-less-effective-2017-6%3famp\n\nNot JUST birth control, all of us with daily medsshould take care! \n\n/end psa", "Also, if the pills get overheated, for example if left in/near a window in direct sunlight or in a purse in a hot car", "My tubal baby is due in march. I had mine tied after my last pregnancy during my c section. I’m 43, I was expecting menopause. Guess not.  My adult daughters think it’s hilarious. I have grandchildren older than this kid.", "Make that four...sort of. \n\nMy mother had her tubes tied. She was also on birth control for periods. She was not happy to learn she was pregnant with me, especially when she was concerned there'd be something wrong with me after all that (I'm fine), and because she kept trying to miscarry and spent most of the pregnancy on bed rest. She then gave birth to me on the toilet (not intentionally). \n\nI'm her second favorite child, so no regrets on her part, but, no, birth control is never 100%.", "My pill and condom baby was 19 this year! 😁", "Ok, wife said she was on birth control.  Op seems foolish to have trusted this.  The kids are his, has to help, FOR the children's sake.  Sounds like he is punishing her, and looks like there's cause to want to do this, doesn't make it right.  Should've snipped it Dude!", "Yeah I had a friend this happened to, hormonal birth control actually made her super fertile. She found out about her daughter in the second trimester 😬", "I honestly feel so bad for all these kids. The older ones will be affected by this too. They will either follow dad and treat their siblings poorly or they will be hurt that their dad doesn’t care about their beloved siblings. \n\nEven a divorce will suck. How much you want to bet he doesn’t want any visitation with the twins? And fights all child support for them only. \n\nI distinctly remember my dad paid child support for my brother until he graduated college. The moment I turned 18 as a senior in high school he contested it to stop paying for me.", "I thought it was even lower than that. Like 87% or something. I'm infertile and on birth control for pcos. I don't always take it correctly. I rarely miss a dose, but sometimes I take it at 730 am and other times I've taken it at 1 pm. \n\nMonday Friday it's clockwork. Those weekends days though. 🤣", "Of the times I've been prescribes antibiotics not one doctor has warned me of this. I know because my health teacher in high school was actually good at his job.", "No because meanwhile he could have insisted on wearing a condom or no sex until the more kids decision was agreed, because everyone knows the pill isn't 100% effective. Anytime you ejaculate into a (fertile) woman, you gotta accept the consequences without blaming anyone else.", "It’s also HIS body. Just saying…", "He could've prevented in other ways that he's responsible for: condoms, pulling out, pulling out while wearing a condom, not having sex. He can't be that opposed to another pregnancy and then blame it all on her when he did nothing to prevent it except whine she didn't agree to a vasectomy. He's equally as responsible here and sneaking a vasectomy would've been AH territory just as much.", "It seems they did the girl side only. \n\n(Stupid joke)", "That would make me wonder about the doctor's beliefs, honestly. although maybe that wasn't as big a deal back then as it is now.", "Omg did she sue", "Yes, called a salpingectomy. Had it done after #4, no regrets! Mine was done with the little lasers or whatever they are, so 3 tiny tiny little cuts (one above each hip and one below the belly button) that all healed fairly quickly. I can't even see the scars anymore (it's been a year next week).", "They must have started doing that after 2005 because when I had my tubal ligation after my fourth and final child was born, they just cut, tied, and burned the cut ends of my fallopian tubes. I was having my fourth c-section so I was open already and it was easy for them to do it then and there since my husband and I were done having children.", "With all due respect, lol! Life is crazy. Congratulations on the little one.", "Agree. He has every right to be angry with the wife, but he needs to decide if he can work through it an forgive her. If he can, then he needs to forgive her and stop punishing her. \n\nIt's hurting the kids more than the wife and they had no hand in the wife's betrayal.", "👏🏿👏🏿👏🏿👏🏿👏🏿", "OMG LOL!!!", "May she not lol", "That’s my husband’s line about me…the last of four by six years.", "Exactly! And at the end of the day, the real victims here are these 4 children.", "And all he had to do was just the vasectomy because it’s his body and his right to get one", "This 100% people need to stop blaming solely op they both got into this mess and both did some dumb things. Op has valid reason and should have had the confidence to take control of his own reproductive health", "You know the best form of birth control HE had control over? Abstinence", "I took into account that he still came in his wife knowing she wanted more children and was actively refusing condoms. He knew what he was getting into and came in her anyway.", "fucking literally", "To be fair then, does she have ANY free time? I doubt it.", "I could not agree more, the assholes are the majority of the commenters on here,  he trusted his wife when she said she was taking the pill, the same as if the husband had the injection then the wife would trust that he had had it done and would not impregnate her.\n\nThey are married and he should be able to trust her 100% when she says she is covered (and no I am not on about the small chance of the pill failing, she stopped taking it and you all know it).\n\nHe is working two jobs and still coming in and bathing, changing kids because she has struggled to do what needed to be done, if she is not coping then it is selfish to the husband and the two existing kids to deliberately get pregnant, he also says he is still helping out with the kids, he is just not doing as much with the younger two, if he is looking after the older two, surely all she has to do is sort the twins.\n\nShe sounds chaotic and disorganised, I was a stay at home dad for my kids when they were born as my wife earned a lot more than me, kids were entertained all day, fed, cleaned, bathed and ready for bed when she came in to a clean house and her dinner ready for her, she read them a bedtime story as her one to one time with them and then had her tea and chilled because she had a stressful job and I liked to take care of her.  \n\nMy kids were never in the house, we played games, joined clubs, sports, day trips,  when off school we would go camping, adventuring, etc,   they were always active and always happy, they never had a sit in front if the TV upbringing, like so many do.\n\n\nAs soon as my kids were both in school, I got a job during school hours and still managed to maintain the house, kids and have her tea ready for her.\n\n\nSome mothers are organised and take to parenting like a duck to water, some suffer with depression and need help and some are just plain disorganised or even lazy.\n\n\nMy kids are parents themselves now, and they are both amazing dad's who support their wife's as much as possible, they love doing bath time, snuggle time, nappies and stories, it is the reason they want to get home in the evening, yet all around now you see lazy parents shoving phones, tablets or just the TV in front of the kids while they play on their phones or check Facebook or even find time to call others assholes on reddit.", "This OP is making me ashamed to be British", "Still…he has 2 new kids and ignoring them because he’s pissed at his wife is selfish and sick. If he really didn’t want more kids, he would have 1. Made the choice about his own body and got the vasectomy. The fact that he didn’t means he was still open to the idea of having more kids. No one needs anyone else’s permission regarding their body. 2. He could have just obtained from sex until a decision was made. He was an active part in creating these babies and now he’s not even willing to be a participant in their lives, simply to punish his wife. YTA", "\"helping out with the kids\" you mean being a parent. You mean fulfilling his legal obligation of being a fucking parent. Regardless of how the twins got here, they're now here, he doesn't have to stay with his wife but calling it help or \"extra help\" when it's his responsibility to PARENT his children. He can't just pick and choose what kids he fully parents because he didn't want more than two. Jfc", "Exactly it's an ESH situation.", "I totally agree he’s TA. Not disagreeing there. He should’ve wrapped it if he wanted to be “extra sure” they wouldn’t conceive.", "There was a couple who kept falling pregnant no matter what they did. Pill. Condoms. Vasectomy. Finally she got a hysterectomy.\n\nThe doctor left a tiny bit of her womb attached to a fallopian tube. A fertilised egg attached to that and her womb regenerated around the baby. It was considered a miracle at the time but of course now we know the umbilical cord is full of stem cells and can heal mothers of all sorts of things during pregnancy, but it’s the only case I ever heard where it healed a whole damn womb!\n\nThe parents sued the doctor for the cost of raising their child to adulthood.", "I had a patient years and years ago while I was still working in NZ. She was super fertile. She and her husband had decided 4 kids were enough and she'd had a planned tubal ligation during/after the C section of number 4. A year later she was pregnant. Her husband then had a vasectomy. She again fell pregnant. Husband was still producing a small amount of active sperm even though his surgery was deemed successful. She ended up having a hysterectomy when she gave birth to number 6. As I recall they were ok about the surprise babies after the initial shock wore off.", "I know a dude with four kids, which are the result of three pregnancies that all occurred while he was wearing a condom, and the mom was on the pill. His jizz is just too damb potent for contraceptives, it seems.", "On antibiotics, taller/ more muscular/ heavier in general than the intended dose,  too hot or humid around the pills, too cold around the pills, you haven't had them appropriately blessed by a warlock on the blood moon...", "And the fact that he didn't want to do it without her consent I would take as being at least slightly open to having more kids? Like if he wasn't at least 1% open to being convinced, why would he even make it a conversation?", "Despise that phrase incredibly. Seems to take all the responsibility off the impregnating partner. I know it’s a common phrase in the UK, but I really don’t like it.", "Yes my friend's little sister was a tubal ligation baby. She wasn't expected but is very loved. She came like 15 years after the procedure", "Or wear a fucking condom.", "Or wrapped.", "YES! THIS!!!", "Thank you!", "Man. ESH but the kids. Reach out to friends and family for help if you're drowning,  but do not take it out on the kids. You both need couples counseling and individual therapy. And guess what? If you keep it up with not helping with the twins, you will need a child therapist too. \n\nShe needs a work from home job to help with bills and you guys need to get a support system to help with the kids...  you both need your heds out of your a$$e$...", "I’m going with ESH but to answer OP’s question, Yes-for neglecting two of his kids for any reason. If this pregnancy was an accident, the timing sure is shady. I’m not saying it couldn’t be a coincidence, because things do happen, BUT they are both responsible. He wanted a vasectomy, she didn’t want him to get one. She said she was on the pill, but did she actually take the pill, and was he wearing a condom? \n\nIt takes two to tango. If they were both refusing to agree then they both should have taken precautions or just stopped having sex until they could come to an agreement. You know who isn’t at fault here? Those two babies. They are innocent.\n\nOp claims to love all four of his kids but is basically using the babies to punish his wife. Who does that hurt the most? Not mama, it’s the children that suffer. Stop playing “I told you so” and favorites. Take care of and treat all your kids the same or when they are older they will remember. \n\nOP is working hard to provide but a mother doesn’t get to punch in her card and go home to relax. A mom usually can’t even go to the bathroom by herself and if she does chaos usually is waiting or putting their hands under the door. OP gets to quit for the day. She doesn’t. \n\nYou told her this would happen but maybe this really was an accident. No matter if it was an accident or not, those kids are yours. Would it really kill you to change a couple of diapers or help with meal time? You share a responsibility. \n\nNo one falls pregnant. Your wife couldn’t get that way by herself. Fair? Haven’t you already learned nothing in life is fair. You pull up your bootstraps and do what you have to do. Moaning and groaning and fighting about it isn’t going to change or help anything. Maybe you both should attend marriage counseling or family therapy.", "I\"m punishing my wife by making all 6 of our home lives worse and withholding time and attention from my babies.  \n\n\nyeah, yta", "She didn't rape him, unless he was and he didn't say, so yeah. He chose to continue to have sex with her knowing she wanted more kids.", "And for the older 2 to be able to fully look back and feel (justifiably as far as facts go) \"everything changed when you two got here.\"\n\nThose older ones will be scratching their way out the door and the whole family will figure out how to pin it on the twins, IF THEY STAY TOGETHER. Meanwhile dad will have figured out how to get over himself enough to get laid once the twins are moving into whatever 2 tagslong children get into when mom finally gets some space in this mess she and dad managed to make of things. \n\nThey'll have 2 older, given \"the same as before, no more no less\", which means they're getting less from mom and will feel that like a mother fucker but if it keeps up They'll know it was because of the twins that they grew up in a divided house because the grownups didn't care enough to give their children what they need and deserve to have a shot at. \n\nUnless this guy wants to divorce, change his last name, remarry and raise his wife's dead ex-husbands bastards with the commitment of a shitty step-dad, he needs to take ownership of this situation and life and house and start dadding all over that family.", "By \"default\" he gets to leave work. She doesn't. I have 3 kids. A 7 month old who's started refusing sleep and I still have their older siblings 6 and 8 to take care of. I. Am. Exhausted. By the end of the day. I want my partner to give me 10, even 5 minutes where I'm not touching the baby or anyone else when he gets home. \n\nWhen does mom shower? When does she eat? When does she sleep? Biologically the postpartum period lasts for 2 years. At any point during this time you can develop postpartum anxiety, depression, rage, or psychosis. Many times they overlap. Most every time they are heavily contributed by a partner who doesn't do diddly squat to help. \n\nOP needs to suck it up and stop being a bitter little shite stain and be a damn adult. Or he may lose his wife and kids and I'm not meaning in divorce.", "A bunch of stuff can mess with the pill including:\n\n- hormone shifts, not that unusual straight after being pregnant \n\n- vitamin c (orange juice, most fruits, many vegetables)\n\n- antibiotics \n\n- alcohol", "I very much get your point and agree with you about the general sexism. But people do talk about women experiencing reproductive coercion. \n\nBut I agree that they don’t tend to call that being “baby trapped”. People tend to use the more serious “reproductive coercion” when it happens to women.", "I trust my wife 1000%, but pre-snip we used BOTH pills and condoms, because we cannot fathom depending on just one method. It boggles my mind that anyone does.", "Yeah that was my interpretation too, unfortunately", "Absolutely true - but some are more effective than others \n\nLARCs (hormonal & non hormonal IUD, implant) are 99% effective with both perfect and typical use , because there's little to no opportunity for user failure \n\nWhereas the pill is 99% effective with perfect use but *only 91% effective with typical use*\n\nSimilarly condoms are 98% effective with perfect use but *only 82% effective with typical use*\n\nThe effectiveness of the pull-out varies massively between perfect and typical use because for obvious reasons the margin for user error is colossal (96% effective perfect use, 78% effective typical use)\n\nSource: NAD but worked on public health teen pregnancy prevention programme)", "Yep my sister got pregnant during a bowel infection", "When the pill is taking absolutely perfectly, it’s around 99% effective. The true effectiveness given the way people actually take the pill is about 93%.", "Okay now I feel like I should get another vasectomy because y'all are scaring the shit out of me", "Oh definitely. I have 2 kids to prove it!", "Wow! I learned a new thing today!\nIs this info disclosed on the prescription paper that comes with it?", "He got his pigeon pair straight up, so why would he want more kids /s", "First of all, that’s really assuming that all the same people post on exactly the same post/comment and see exactly the same things and that’s just not how the Internet works. Second of all OK don’t have a vasectomy, but wear a condom or pull out it’s not that fucking hard he mentions absolutely nothing. He did to avoid an accidental pregnancy and sexual health 101 is if you and your partner are not on the same page about what you would do in the case of an accidental pregnancy you use extra fucking precautions, or do not Pasco. He was horny and made a bad decision and is now punishing his wife and children, who didn’t ask to be here for it if that’s your definition of a husband, I feel very bad for whatever type of relationships you’ve been in because in mine, we both take responsibility for choices, but take two of us", "[Let the boys by boys?](https://www.youtube.com/watch?v=7ADgCeYJMN4)", "Of course YTA. No clue why you’d even ask", "ESH\n\nYou should have gotten your vasectomy when you wanted, but you didn't. She shouldn't have badgered you into bringing more humans into the world you didn't want and couldn't afford to raise (both money and energy/time), and now you both made some choices and there are two more humans in this world.\n\nThey didn't ask to be born and they are your responsibility. Please get that vasectomy now, whether your wife agrees or not, it's your body, your reproduction, and your choice. It's not up to her and it never was.\n\nDo not make the children suffer for their parents' poor choices.", "To be fair, the wife sucks, too. Especially since she knows they are struggling financially before, yet her want for \"a big family\" trumped practicality. Even if she didn't get pregnant on purpose (which I think she probably did), when you're having a hard time providing for the kids you already have, you wouldn't even be discussing more kids until you've got the current situation figured out\n\nHonestly, both OP and his wife should be sterilized.", "Yes. ESH, big time. Screaming \"I told you so\" doesn't solve the problem. If you \"can't bring yourself\" to care for your children, you're being stunningly vindictive and making the situation worse.\n\nWe don't know what happened with OP's wife and her birth control, but certainly, pressuring OP into bringing another child into the world (or another child that turned out to be two more children) was a bad idea.\n\nTherapy needed for all parties! Including the kids, a few years down the line.", "Isn’t the whole point of his post that he didn’t want to have more kids because he knew they couldn’t handle it financially/mentally?", "It is insane to me that that comment has over a thousand upvotes.", "I don't really know how much any of this matters anymore. Even if they divorce, OP still has four kids and only caring for two of them would cause serious damage to the younger two. He literally said he sometimes wants to help but then remembers he doesn't actually want to so he stops himself. I'm just gonna say it, that's incredibly fucked up. YTA", "The article mentions 80% actually, and that is IN A YEAR. Also, she was allegedly on the pill, so that + pulling out should have been pretty effective in this case.", "Yet, he didn't get a vasectomy or use a condom while having sex with his wife, who he knows wants more children...", "Where did I say he doesn’t have a responsibility to them? I was simply clarifying the birth control issue.", "They won’t answer how. Gotta make sure they throw some of the blame on her. As if it’s her fault he’s an ass parent"]}