{"id": 26096, "submission_id": "1689q6g", "title": "AITA for inviting my ex wife’s family to my wedding with my second wife?", "selftext": "I (38M) am getting married to my fiancé Alissa (30F) in a few months and we’re currently finalizing guest lists. We got into a huge argument over me wanting my ex-wife Hannah (38F) there.\n\nGrowing up, I was an only child with a single mom. Pretty lonely. Except my mom was best friends with Hannah’s mother so I grew up with her and her siblings plus her dad was always like the father figure I never had. We then got married young and have two kids together. As we got older into our 30s we both realized we missed out parts of our lives/careers and amicably split. After the divorce, we still worked on having a healthy relationship when co-parenting our sons and I’m still extremely close with her parents, siblings, nieces/nephews whom I see all like my own.\n\nI’ve been trying to explain to her how Hannah’s family is basically all the family I got and that I’ve spent almost all of my life being treated like one of their own so I want them to be apart of this next milestone in my life (especially because they have all been so supportive of me finding love again).\n\nTowards the end of our argument, Alissa contested that they’re not my family anymore, nor my blood relatives so there’s no reason for them to be invited. If that’s the case, the only “family” I would have at my wedding is my mom, my two kids, and a single cousin while she would have dozens of extended relatives and family friends who are not “blood” either.\n\nShe just kept saying “your ‘family’ being there will ruin my wedding” and I just feel so torn. I’m trying to be understanding of her feelings and this is her first marriage so I get why she is hell-bent on the “perfect wedding day”, but also I feel like I’m asking for the bare minimum of having people who I’ve considered family for 30+ years there. AITA?", "created_utc": 1693678907, "permalink": "/r/AmItheAsshole/comments/1689q6g/aita_for_inviting_my_ex_wifes_family_to_my/", "score": 89, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) the action I took that may make me the AH is that I plan on invited my ex’s family to my second wedding\n\n2) this may make me the AH because ur makes my fiancé extremely sensitive and might hurt her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Buddy you need to wake up. This is a major red flag for your marriage. She is literally trying to get you to kick out members of your family. Your children's family. She is asking you to deny your children a relationship with their mother and grandparents.\n\nDo you think this is going to stop here? No, this is just the beginning.\n\nI would NEVER marry someone who wanted me to give up my family and hurt my children. I would never marry someone who would not support my healthy co-parenting relationship. And if you go forward with the wedding without resolving this, you will be betraying your family and your kids.\n\nNTA", "NTA - saying “my wedding” not “our wedding” and not caring that the people you consider your family is there are pretty big red flags.", "NTA but here’s the thing- sounds like she has never been married and doesn’t share children with an ex.  If that is all correct, she has no idea how you can be friends and a support without “benefits” and emotional bonds that are beyond appreciate.  Sounds like she doesn’t know your ex and hasn’t seen this in action to see there isn’t any chemistry. \nYou had your big wedding and your ex and ex family was there.  She hasn’t.  I can see where it would be weird and seem as if you aren’t over your ex.  I can see where her family would be asking all sorts of questions.  It is not often ex spouses and their families are invited to the next wedding.\nY’all need to talk and fast.  This will not resolve itself and is sure to get worse- far worse.", "*<She just kept saying “your ‘family’ being there will ruin* ***my*** *wedding”>*\n\n I thought it was YOUR wedding too...\n\nNTA", "NTA. These folks are family to your children- she can't just expect you to suddenly shun them.", "INFO:  How long have you been with Alissa?  How well does she know your ex?   Do they get along?", "This is a really tough one.  \n\nCould you invite some of the ex’s family - for example your former brother-in-law/sister-in-law but not your ex or her parents?\n\nAlso, have you talked about how you are going to handle things like the holidays after you are married?  For example are you going to want Christmas spent with your ex and her family and your wife, while she is going to want to keep things separate?\n\nI think you are asking for an IMMENSE amount of self-confidence and emotional maturity from your fiancé and while she might not understand the depth of your relationship with your former in-laws, I don’t know that you fully realize what you are asking of her and the perception it might cause.\n\nI’m voting NAH and in my infinite wisdom, advising counseling.", "Nah. I understand you still have a connection to your ex-wife family and are close and I can see why you want them there but also don’t think she is wrong in not wanting your ex-family at her wedding with you. That’s a huge ask. If you guys have kids are you going to want your ex-family to be grandma/pa or aunt and uncle?", "Blood alone does not make a family. Too many people do not realize this.", "Yes you would be. This is your fiancés biggest day of her life.  Why in the world would you think she would want to spend a minute of it with your ex wife’s family?   Why would you deliberately spoil her wedding day!", "ESH. Eh, I can see both sides. Your wife not wanting to see your ex wife at the wedding isn’t wrong, I think a good number of brides would feel the same. However, you wanting to invite your ex’s parents and siblings shouldn’t be denied since you have your own relationship with them. It may be a chance they won’t come if their daughter/sister isn’t invited but I wouldn’t see the hurt/wrong of sending them a invitation. I think you really need to have a serious convo with your future wife and see how she really feels about you carrying on a relationship with these people. Down the line is she gonna make this a deal breaker?", "I think it's a little creepy to invite your ex and her family to your new wife and your wedding. You could be family but they don't need to be there. I'd be weirded out to you can still have a relationship but you don't need to invited to something like this. It doesn't feel right.", "YTA. Cancel the wedding. Your fiance will always feel second best.", "ESH\n\nJust elope. It’s not about your family and friends. Your wedding is about the two of you.", "NTA but DTMFA put your kids and your family first.", "NTA. It would be one thing if your ex was horrible and manipulative or treated your fiancé bad. But she’s the mother of your children, her family is still your family and you guys divorced amicably. There’s no reason for them not to be invited unless your fiancé is insecure and doesn’t trust you.", "YTA\n\nYou are basically telling her that she needs to pound sand and always be last in your relashionship. That your ex will always live in the shadow of your ex.  Put yourself in her shoes for one moment!", "YTA. \n\nWhile I can understand your past with that family, your soon to be wife has nothing to do with them and technically speaking neither do you anymore. These people were your family at some point and they will still be part of your life because they are your kids' grandparents. However, by marrying your fiancee you are starting a family with her. It is understandable why she wants the wedding day to be about you and her and not wanting to see people from your past there. Maybe she wants you to create a bond with her family since they will be your in laws from now on. What can she expect going further? Since you want to invite these people at your wedding, do you intend to do this for all the events in your life? For your next birthday, will you invite everybody (ex in laws, actual in laws, ex wife + wife) and ask them to play happy family? What if you have a kid with her? Will you impose these people for all the events in your shared life? Will she ever have privacy and celebrate things with HER family or do you intent to force a relationship between her and your ex family? \n\nAlso, how would you feel if she invites some exes and their families at your wedding?", "Woah.\n\nSo what's more than a red flag? A red flag that is on fire and has sparklers and flaming pinwheels attached? This sure is one.\n\nNTA.", "NTA my friend, this is likely not a good match for you.  \n\nAlso guarantee your sons will become some sort of issue, next.   \n\nHope I am calling it all wrong, but for her to be so opposed in these circumstances is not great. Your amicable co parenting is also likely to become an issue.", "Has she ever meet them? Has she always knows how you feel about them? It sounds like once you are married it’s who she is allowed you to see and have around.\n\nBlood is not the only family. Family is people who love and support you. I would be worried how she would treat your kids or what she would say to them whe you are not around. Once you have children is she going to tell your child the other kids are not family or ignore them due to the new baby being the only real family?\n\nThis is just an eye opener.", "NAH. She doesn't want the ex-wife at the wedding which is understandable. He however wouldn't be able to celebrate his wedding with his family. Would she accept a compromise if ex-wife didn't attend but other 'family members' did? I would leave out those members that always says the wrong thing (but they meant it as joke!) to avoid setting off any fireworks at the wedding.", "Invite the family but not the ex. Seeing the ex wife at the wedding is going to ruin it for your fiance.", "ESH\n\nI would *hate* it if the person I'm going to marry wanted his ex at the wedding. Alarm bells would be ringing left and right. However, she's not willing to compromise which is also bad.", "NTA.  Cancel the wedding.  This is just the beginning.  A successful and respectful co-parenting relationship is rare so beneficial to your children.  This woman will make every attempt to destroy that.  Think of your kids.  Don't marry her.", "NTA \n\nDump Alissa. She aint the one. Do NOT allow her to push away the only family you have, you might divorce her, but not even divorce separated you from Hannah’s family.", "I don't think either of you are ready to be married. Having kids from another marriage complicates a LOT of things. A reality you're going to have to face for the rest of your life.\n\nShe's telling you who you can and can't invite to her wedding... and you're inviting an ex-wife which is just weird at best even with your backstory.\n\nESH.  \n\n\nEDIT: I love all the downvotes.   \nKids will complicate the relationship, it's just a fact. I'm living it. It's not anyone's fault, it's just a reality.  \nHer telling him who can/can't be at the wedding is a red flag.  \nHim wanting his ex-wife there IS weird and very obvious to see how it would be a red flag to someone who hasn't been married or had kids before and had to co-parent.   \n\n\nIf they're at this point and haven't discussed and come to an understanding on this MAJOR part of his life (his kids and the other side of the family she will have to deal with) they are *not* ready for marriage. - this is why ESH.", "NTA. This rule is not going to be limited to your wedding day.  She expects you to cut out Hannah, her family, and don’t be surprised if she starts asking you to limit time with your sons in the interest of your “new” and “real” family. She will never accept Hannah et al as a legitimate part of your support system.", "Very big red flag .\nNext time she will ask not include your blood family as she is now your family ???\nNTA of course", "You are not considering her feelings on this, she does not want your Ex there, and why would she. She see's, her as a clear and present danger to her relationship with you. She already shares you with your ex over your boys.\n\nWould you agree to have her Ex and family there if it was the other way round, I suspect not.\n\nYTA a bit\n\nGive her the day!", "Just wait until *after* the wedding when she starts pushing and pouting and throwing tantrums to get them totally out of your and your kid's lives.  Unless she wants your kids out y'all's lives too.....\n\nYou need to think very, very carefully bout getting married to this.", "NTA. Alissa and some commenters are caught up on \"ex\" and missing \"lifelong family\". I think you need to consider delaying the wedding until you've worked this out. Regardless of her hang ups, these are also your kids' blood relatives. Are you sure she treats your kids right when you aren't there? If she can't accept that they are your extended family, she may not be the right one for you.", "NTA.  In fact your fiancé 100% is. Remove the ex-wife aspect from this for a second and think about how your fiancé is trying to tell you that you aren't allowed to invite your best friends and closest chosen family members to YOUR wedding. Would you stand for it if she was like \"Nah, that guy you want to be your best man, he can't be there.\"  Absolutely not! This is no different, just so happens you slept with one them.\n\nI'm currently planning my wedding (his first, not mine) and I don't have a large family and an even smaller one if you count the people I care to talk to.  I will have three family members at our wedding...vs my fiance's 50 or so.  BUT, I will have my chosen family, all my closest friends, there. He has NO issue with that..and guess what, I slept with two of them in the past! I was in multi-year relationships with both...just so happens we make better friends than partners. Family isn't always blood, the best family usually isn't.\n\nThe presence of your family there won't ruin her wedding day, SHE will. She is the issue here, not the people you call family but her feelings about them. Personally, if I were you this is a hill I would chose to die on because this isn't going to get better.  What happens when you have kids together and want to invite your \"dad\" to they birthday party. Or when you want to take a family vacation which includes your ex wife and possibly her new husband because you coparent that well? (I have a few friends who do this every family vacation so it's not that far fetched.)", "Do. Not. Marry. This. Hag. Wake up!", "YTA,  this won't last", "I think Alissa is not mature enough to get married. You’ve managed to coparent and stay on good terms with your ex-in-laws which is fabulous!\nI have a feeling that there will be a lot of DRAMA in your future cause by the new Mrs. you may want to re-think this wedding if she is not willing to give a little to make you happy.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (38M) am getting married to my fiancé Alissa (30F) in a few months and we’re currently finalizing guest lists. We got into a huge argument over me wanting my ex-wife Hannah (38F) there.\n\nGrowing up, I was an only child with a single mom. Pretty lonely. Except my mom was best friends with Hannah’s mother so I grew up with her and her siblings her dad was always a like the father figure I never had. We then got married young and have two kids together. As we got older into our 30s we both realized we missed out parts of our lives/careers and amicably split. After the divorce, we still worked on having a healthy relationship when co-parenting our sons and I’m extremely close with her parents, siblings, nieces/nephews whom I all see like my own.\n\nI’ve been trying to explain to her how Hannah’s family is basically all the family I got and that I’ve spent almost all of my life being treated like one of their own so I want them to be apart of this next milestone in my life (especially because they have all been so supportive of me finding love again).\n\nTowards the end of our argument, Alissa contested that they’re not my family anymore, nor my blood relatives so there’s no reason for them to be invited. If that’s the case, the only “family” I would have at my wedding is my mom, my two kids, and a single cousin while she would have dozens of extended relatives and family friends who are not “blood” either.\n\nShe just kept saying “your ‘family’ being there will ruin my wedding” and I just feel so torn. I’m trying to be understanding of her feelings and this is her first marriage so I get why she is hell-bent on the “perfect wedding day”, but also I feel like I’m asking for the bare minimum of having people who I’ve considered family for 30+ years there. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "If it's the ex-wife's family that you want to invite, meaning your children's grandparents, aunts, uncles, etc., who are like family to you, then I would say N T A. If you're wanting to invite your ex-wife, then I could see where your fiancé might not want her there and you insisting might make Y T A. It doesn't sound like your children are so young that they would need their mother there so maybe the compromise is that ex-wife's family can come but not the ex-wife.\n\nI had a destination wedding for my 2nd marriage and my son, who was 13 at the time, walked me down the aisle. His grandparents on his father's side flew with him to the wedding, he stayed with them that weekend at the destination, they all attended the wedding and they flew back with him while my husband and I stayed for a brief honeymoon. That was 21 years ago and although my son's grandfather has passed away a couple of years ago (broke my heart), I am still very close to my son's grandmother and stay at her house when I'm in town (as does my 2nd husband, sometimes even by himself if I don't go down with him). They were, and she still is, a part of our family, regardless of my former and now pretty much non-existent relationship with my son's father. That's how healthy relationships work, especially if there are children involved. Your wife needs to accept that your former in-laws are a part of your and your children's family or you need to rethink this marriage.", "NTA. The future holds weddings, birthdays graduations, funerals. And the emergence visit to the hospital. Please think real hard, will you ever have to choose one loved one for another.", "NAH. Your desire to have them there is understandable, but so is her not wanting them there. You are embarking on a new phase of your relationship with her, and having them there could make her feel like you're stuck in the past, thinking of that relationship. \n\nWould you be able to celebrate with them on another day?", "This.  The marriage will not work if the fiancé doesn't understand/appreciate the role Hannah's family plays in OPs life.  \n\nIts the wedding now, but eventually its going to be birthdays, holidays, and events where she insist that her family is OPs new family, and the ones who should be invited...  \n\nI might have kinda, sorta, understood not really wanting an ex at a wedding but she completely lost any credibility with that whole \"they're not your family anymore,\" Yea no, you don't get to dictate who someone considers family. \n\nNTA", "Yeah I'm with you on this. NTA", "Agreed. These people aren’t going to magically disappear from your life. Next thing you know, she’ll be demanding you never see them again. NTA.", "Absolutely. Does she realise that, having kids together, you are family for life with these people? Does she understand the principles of supportive co-parenting you are working to keep in place, and the importance of modelling strong supportive family to your kids?\n\nI’d be postponing until you are on the same page. She is setting herself up to be a wicked stepmother and undo your good relationships. And why? Jealousy.", "Her attempt at controlling your feelings is a huge red flag. You sound like a caring person that she is attempting to manipulate. Try couples counseling and/or move on. So sorry for your situation.", "There is a big difference between not having them at the wedding and not being in their lives. I can understand not wanting an ex at the wedding. As long as she isn't insisting no contact at all then it's fair enough that she wants to feel comfortable at her own wedding. The ex is always going to be a part of their lives moving forward as there are children involved. NAH", "I agree, NTA", "How tf did you get to this conclusion? \n\nShe is literally trying to get you to kick out members of your family. - How is she doing this? By not wanting his EX in laws at her wedding. \n\nShe is asking you to deny your children a relationship with their mother and grandparents - when did she do this? \n\nStop with these stupid remarks, you are blowing it out of proportion. This woman wants to celebrate their wedding day with their family. These people are not family! And she is not asking him to cut contact with them, she is just asking to not have them imposing at their wedding!", "NTA. The above is definitely something to consider. I thinks it’s very likely that if you give on to this now, your new wife will push to stop seeing you family. You may need to decide if being with her is worth giving up your chosen family. Food for thought: a person who truly loves you would try to meet you somewhere in the middle and at least try to see your perspective, maybe find a compromise that you’re both okay with. Is she doing that? Or straight out insisting that they are not invited?", "So much this.", "She had the rest of her life to incorporate his ex and her family into hers. She has a right to this day.", "They don’t need to horn in on his fiancé’s wedding day.", "Agreed. I can’t imagine having my husband’s ex wife at my wedding. Certain family he’s close with is a little different especially considering the history. I think there needs to be compromise/consideration on both sides.", "This is sage advice.  OP and his fiancé need to be on the same page before wedding.", "💯👍👍👍", "💯", "You would think the ex would show enough respect to stay home and allow the bride to have her OWN SPECIAL DAY.", "The thing is they have not the same Idea of how OP should see his ex and his 'chosen' family. It is not just them being at the wedding or not. It is indeed possible OP's fiancée doesn't want these people totally outside from his life but for sure she is downplaying their importance in OP's life. The mariage won't work if she doesn't aknowledge it. Her feelings don't make her an A H but for sure they can't marry for the moment and should discuss their values and life views to check whether they align or not (I don't think so).", "[removed]", "It's not just his fiance's wedding day, it's his too. It's not all about her. He's allowed to have the people he loves there, just like she does. I don't see how they'd be \"horning in\". It's not like they're gonna sit there holding up signs that say \"Team Ex-Wife\".", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "This day is her day. Why an ex would even want to be there is terrible. She had her OWN wedding. Let his fiancé have hers.", ">Why an ex would even want to be there is terrible\n\nDude, LOTS of people go to their ex's wedding when they share children, so long as the split is amicable. \"Terrible\" is a very weird view on it, there's nothing terrible about joining family. It's actually super healthy to approach things like that when there's kids involved. Like I said, it's not just the bride's day, it's OP's too.\n\n Also, your rationale is very odd.... if people already having their own wedding was grounds to not attend someone else's, then there would be lots of very sparsely attended weddings.", "Why can you let this woman have this one day for herself when she will be spending the rest of her life with them?  I asked my and he agreed. One frigging day.", "> Why can you let this woman have one day for herself\n\nIf she wants her wedding day to be only about herself, she needs to marry herself, and not a separate person, who also has his wants and needs for his wedding."]}