{"id": 26116, "submission_id": "168uxl3", "title": "AITA for eating my roommate's food?", "selftext": "I'm (18) a freshman in college and I live in a double with this other guy (18). Before moving in, I tried contacting him on instagram to break the ice and also discuss stuff we would be bringing but he left every one of my texts on read so I assumed he didn't like my approach. No biggie. He moved in before me and by the time I came, I found a lot of his stuff on what was supposed to be my side of the room so I asked him to move it. Not only did he have the audacity to ask me where he'd keep the stuff, he outright refused and it wasn't until I threatened to report him that he complied.\n\nOur relationship has not been good at all. If he's not playing music hours into the night, he's bringing people over and they sit on my bed. If it's not that, he's making messes in the room and not cleaning them up until told. But what has really pissed me off is his tendency of putting his food in my mini fridge without my permission ranging from stale leftovers to alcohol. His excuse is always \"there was an empty space so I thought...\". I'd repeatedly told him not to do this without asking me and that I'd gladly allow him to use it if he just asked but apparently he's too high above to be asking.\n\nMy final straw was when he put fucking laundry detergent in my fridge, LAUNDRY DETERGENT. And you wanna know what he said? One of his friends told him that refrigerated laundry detergent makes your clothes come out more cooler and silky. Hello logic? I told him to never put anything in my fridge ever again and if he did, I'd eat/use whatever it is because everything inside it would be mine. Eh? Yesterday I came back to find a plate of donuts and a pepsi can. He wouldn't learn so I ate 2 of the donuts and left the other with a few bite marks. I also drank most of the Pepsi.\n\nHe came back, opened my fridge without my permission infront of me, and immediately asked me why I ate his food. I corrected him and said it was my food since it was in my fridge but he started ranting in frustration and I ignored him. He threatened to go to the RA and I told him to go ahead, so he did. The RA heard both our sides of the story and told my roomie that it was fair game since I'd warned him not to put his food in my fridge. Roomie tried throwing another tantrum but RA told him he should consider moving out because he clearly doesn't understand how to share a room and respect boundaries.\n\nRoomie has been quiet and it's the most peaceful it's ever been between the two of us but I can't help feel like I shouldn't have eaten his food and should have just taken it out instead.\n\nAITA?", "created_utc": 1693741651, "permalink": "/r/AmItheAsshole/comments/168uxl3/aita_for_eating_my_roommates_food/", "score": 42, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I ate my roommate's food\n2. Maybe that was too far and I should have just taken it out of my fridge instead\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA  you gave him fair warning.  Roommate sounds like he has bullying tendencies. If you'd simply taken it out he would have continued to press the issue.  You might have gotten a similar response from throwing it away,  but I'm not sure you would have. \n\nI do suggest locking your fridge if you can find a way, because I wouldn't put it past him to mess with your food.", "NTA.  You gave fair warning.  The RA being on your side and telling him to consider moving is a clear indication here - at most schools, they are supposed to mediate, not take a side.", "NTA - but I'd be careful eating his food. who knows what he's done to it now that you've pissed him off", "NTA. You warned him and he still didn't listen so suffered the consequences. Hope you don't have to deal with him anymore. Also this feels like it would fit on the petty revenge subreddit or something", "NTA. He was warned. Your roommate is the type that will stomp all over boundaries if you let him.", "No, you were fine. Even the RA shut your roommate down.\n\nBut I would have already complained to the RA and  asked for a different roommate. And you still can, if your roommate starts up again. NTA", "NTA, it sounds like he was making your life extra stressful", "NTA - I love it when stupid people tell on themselves only to see how dumb they really are...", "NTA. Sounds like it’s sorted out.", "NTA You asked him repeatedly to stop.  You took it a step further and essentially gave him a final warning that you would eat his food if it's left there.  Now he's dealing with the consequences of his own actions.  \n\nNot sure what your school is like, but if he's unwilling to move out, can you ask to switch roommates so you don't have to deal with him?", "NTA. Well played I’d say. Good on the RA for having your back. …. Roommate has been an asshole from day 1. I wouldn’t give it another thought.", "Nta, you put your foot down and stopped putting up with his bs and he didn't like it. You honestly waited a lot longer than I did and I wouldn't have been as nice about it, so good for you. He seems like someone who always has his own room and got whatever he wanted growing up, hopefully he learns how to share or, better yet, does move out.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm (18) a freshman in college and I live in a double with this other guy (18). Before moving in, I tried contacting him on instagram to break the ice and also discuss stuff we would be bringing but he left every one of my texts on read so I assumed he didn't like my approach. No biggie. He moved in before me and by the time I came, I found a lot of his stuff on what was supposed to be my side of the room so I asked him to move it. Not only did he have the audacity to ask me where he'd keep the stuff, he outright refused and it wasn't until I threatened to report him that he complied.\n\nOur relationship has not been good at all. If he's not playing music hours into the night, he's bringing people over and they sit on my bed. If it's not that, he's making messes in the room and not cleaning them up until told. But what has really pissed me off is his tendency of putting his food in my mini fridge without my permission ranging from stale leftovers to alcohol. His excuse is always \"there was an empty space so I thought...\". I'd repeatedly told him not to do this without asking me and that I'd gladly allow him to use it if he just asked but apparently he's too high above to be asking.\n\nMy final straw was when he put fucking laundry detergent in my fridge, LAUNDRY DETERGENT. And you wanna know what he said? One of his friends told him that refrigerated laundry detergent makes your clothes come out more cooler and silky. Hello logic? I told him to never put anything in my fridge ever again and if he did, I'd eat/use whatever it is because everything inside it would be mine. Eh? Yesterday I came back to find a plate of donuts and a pepsi can. He wouldn't learn so I ate 2 of the donuts and left the other with a few bite marks. I also drank most of the Pepsi.\n\nHe came back, opened my fridge without my permission infront of me, and immediately asked me why I ate his food. I corrected him and said it was my food since it was in my fridge but he started ranting in frustration and I ignored him. He threatened to go to the RA and I told him to go ahead, so he did. The RA heard both our sides of the story and told my roomie that it was fair game since I'd warned him not to put his food in my fridge. Roomie tried throwing another tantrum but RA told him he should consider moving out because he clearly doesn't understand how to share a room and respect boundaries.\n\nRoomie has been quiet and it's the most peaceful it's ever been between the two of us but I can't help feel like I shouldn't have eaten his food and should have just taken it out instead.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "You're the saint. For not causing bodily harm long ago.\nYou did nothing cruel nor over the top\nThe guy is spoiled, immature and entitled- a child.\nLet him eat his new realization.\n\nYou, would be a roommate anyone would be happy with.", "NTA- you actually had to DO something because talking was having zero effect. Plus it made him bring in the RA to mediate, and lo and behold, that disinterested 3rd party agreed with you. Nicely done!", "He's such a loser you are not the a******.", "NTA. You should have done it sooner so you would have been at peace already.", "NTA\n\nHere go a few of those life lessons that come with college. Your roommate is clearly spoiled and used to getting to do whatever he wants without consideration for other people. Maybe he'll learn eventually, but for the moment he's not a reasonable person. For your part, don't look for reason from an unreasonable person.", "Roommate sounds like he's been catered to his whole life - indulgent parents, likely. In his prior living experiences, he's likely always had his way. This is why parents who cater to their kids do them no favors - at some point, they have to exist in the real world, which will not cater to them.\n\nOP,  your action was endorsed by the RA, you simply have a roommate who has never had to think of others before. The sooner he has to, the better for him.\n\nAn optimistic view is that it's dawning on roommate that other people are not simply NPCs and maybe he's turning over a new leaf. It does happen. But keep those boundaries bright, OP - roommate may have further lessons to learn."]}