{"id": 26121, "submission_id": "168pins", "title": "AITA for expecting my girlfriend to pay her part of the rent now that she has a full time job?", "selftext": "My partner and I moved to a new country a year ago because I was given an amazing job offer.\nWe moved together, because we're in a long term relationship, even though she didn't have a job lined up here when we moved.\n\nInitially, when she didn't have a job at all, I 100%, without any hesitation, let her know that I would be paying for everything for the two of us, including our biggest expense - the rent.\n\nA few months ago she got an internship job and she was the one who let me know that she'd like to contribute to the rent. We split it so that her pay would be fair and would not overburden her, since internship salaries are not all that great. However, a few months in, because of other unexpected expenses on her side, she asked me if I could cover the whole rent for us again. I accepted.\n\nNow, she's still in her internship, her additional expenses are no longer an issue and she got a full time offer from her job which will pay her significantly better.\n\nDespite her bettered financial situation and outlooks, she now considers that I should pay the whole rent indefinitely, her arguments being:\n- I can afford it and it's the manly thing to do\n- She moved to a new country for me so it's in some way my responsibility \n- She would like to use the extra money for girly expenses that she could not make before: nails, hair etc. and says I should understand this since I am partly to blame for why she hasn't had these done in a while, since I made us both relocate here\n\nShe also currently doesn't cover any other expenses for our household, except that we split weekly groceries 50-50.", "created_utc": 1693722435, "permalink": "/r/AmItheAsshole/comments/168pins/aita_for_expecting_my_girlfriend_to_pay_her_part/", "score": 327, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I communicated to my partner that she should pay her share or the rent\n2. I may be the asshole since she moved to a new country with me and I should be more of a provider to her, especially now\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Saying it's the manly thing to do is manipulating you.", "NTA, tell her that she is an adult, and you see her as a partner not a voluntary dependent, she needs to pay her share of the rent", "NTA. The \"I wanna spend it on myself\" is not an argument; you could also say \"I wanna buy a boat with that money\". Also the \"it's the manly thing to do\" statement is as obnoxious as saying she should stay home to cook & clean. It's the 21st century, you share responsibilities, which includes expenses.", "NTA partners share expenses fairly. She needs to contribute.", "Nta she opted to relocate, I’m assuming you didn’t force her to. She’s being a mooch", "You didn’t force her to do anything, she’s responsible for her own life choices. \nHer attitude here would be a relationship-breaker for me.\n\nNTA", "NTA - you were helping your partner out whilst they were having financial difficulty, but now she is just taking advantage. Just because you “can afford it”, doesn’t mean you should have to. And saying it’s “the manly thing to do” is an archaic way of thinking.", "NTA, but I do think there needs to be an open conversation on expectations between the two of you. This conversation should have happened before you moved away together, but that ship has sailed.", "NTA. If it's the \"manly thing to do\" she better start doing all the womanly things in the home and give up her job and you just come home from work and sit on your arse with a beer, yes? She didn't move \"for you\" she moved with you. That thinking needs to change or every argument and every time she wants something it will be thrown in your face and it will get old real fast. The % you have suggested sounds more than fair. She's in a partnership, she needs to act like she is. How old are you both, was she like this before the move? (Did you always pay for dates, holidays etc) Early to mid 20s, it's probably just inexperience/naivety in relationships on both sides, all quite normal. Though it could be who she is, being so far away from loved makes it easier to control a partner. Maybe both write down what you want/expect and try to discuss in a calm manner. Late 20s she could be trying it on to see what she can get away with. 30s+ red flag. Shes old enough to understand how relationships work. I could be well wide of the mark, you could have set her up for this line of thinking over the years, there could be many other things at play in the relationship. I just have very negative response to any woman who says \"it's the manly thing to do\" all women experience the absolute bs that is gender stereotyping. To flip that to a man either means (in my opinion ) they lack basic intelligence and empathy or are as sexist/insecure/selfish as the men who say it to us. I can't stand men who want to pick and choose which elements of a modern woman and which elements of a traditional relationship they want (want sex/living together without marriage but except you to be a \"lady\") woman who do the same to men as just as bad and that's what she's done. You can't expect a man to pay for you when you work.", " NTA - you got scam :) - none of her arguments makes any sense and you know that.", "NTA - tell it’s not the manly thing to do it’s the Adult thing to do", "NTA - she has some semi-valid points, but saying 'it's the 'manly thing' is so off-putting and makes me cringe. This point makes her sound very manipulative and makes the other points moot for me.", "NTA You could argue with her, point out the contradictions in her “reasoning”, the underlying sexism, the complete lack of personal integrity and responsibility but….why bother? The fact she’s putting so much effort and thought into shirking her obvious obligations and responsibilities rather than working with you to build a life together says this is who she is. That job she has, it will stop, as soon as you agree to just pay for everything. Save yourself a world of trouble and just dump her.", "NTA\nShe is your partner, not your child. You shouldn't be responsible for funding this lifestyle she dreams of.\nSo what you pay everything while she can burn through 100% of her income as fun money?\nNo. You need a serious talk. She needs to contribute her fair share. Please don't be a doormat\n\nETA: also she is trying to manipulate you. It is not your responsibility because she moved for you. It was her choice to move to another country with you without any job prospects at that time.\nShe is trying to guilt you. This is not in anyway an acceptable behaviour", "NTA. She wants a free ride. You need to decide if you are ok with that or whether she needs to pull her weight financially. You are certainly not the AH for expecting her to pay rent given her change in circumstance, and given she was previously keen to pay rent.", "NTA she's being sexist to say that you should pay just because you're a man. And wtf! If she wants to spend her money on girly things then she should earn more so that she can afford it. What about your hobbies and interests? Or do they not count either because you're a man? I can't understand what's going on in her head", "NTA- I agree with everyone else.", "NTA you need to sit down and talk. Finances are a BIG thing in relationships. Work it out fairly if you can and factor in important things like nails and your important treats and see what you can work out. \nGood luck.", ">I can afford it and it's the manly thing to do\n\nI can only imagine if the genders were reversed...\n\nyou can also tell her that her gender role is to clean the toilets everyday and shes not allowed to use the tv unless the man says so....\n\n&#x200B;\n\n>She moved to a new country for me so it's in some way my responsibility\n\nlol no...\n\n>She would like to use the extra money for girly expenses that she could not make before: nails, hair etc. and says I should understand this since I am partly to blame for why she hasn't had these done in a while, since I made us both relocate here\n\nthen what about your manly expenses?\n\n&#x200B;\n\na relationship is about equal partnership. and that means sharing the expenses before enjoying any extra money.\n\nNTA, and shes a golddigger. get rid.", "NTA I think it’s fair she pays a proportional share once she starts the better job", "There isn't enough information to judge.\n\nFirst of all, it's expensive to be a woman.  Anyone who wants to live with a woman needs to understand that she will have much less disposable income if expenses are split down the middle because she'll be paying a lot more for basics.  Women's haircuts cost a lot more than men's.  So does clothing and pretty much anything else designed for women.  Yet she will be expected by pretty much everyone (you, her boss and coworkers, her friends) to maintain certain standards as far as her appearance.\n\nI'm not saying that it's reasonable for her to expect you to pay for regular nail treatments and hair styling, but you should sit down with her and negotiate something fair.  I think most people would consider nail treatments to be a luxury, but a haircut at a decent (but not luxury) salon every seven - 10 weeks would be reasonable in my world.  \n\nYou should both sit down and make a budget.  I notice you didn't say exactly how MUCH she'll be paid now for her full-time job in comparison to you.  If she'll be getting less, then it would be fair for you to be paying more for living expenses.  She does have a point that she made a huge move for you and because of that, you should be open to doing what you can to make the move pleasant.  Maybe consider a nail treatment every few weeks if that's affordable where you live.\n\nIt never works if one person is living in luxury and the other person is struggling or feeling like it's impossible to save for the future.  So you do both need to take this issue seriously and work out something fair.  I know of couples where the woman spends all of the money on beauty treatments and money is a problem.  I also know of situations where the woman has no money to spare because the man doesn't understand or care that she has to pay a lot more for basics and still makes her split things down the middle.  The bottom line is that you guys need to sort this out now or it will become a problem.  Good luck.", "I'm flicking between nah and esh,\n\nPartly I understand why she views it as your responsibility but she also had the choice to stay where she was before the relocation, albeit at the risk of your relationship ending/turning to long distance\n\nBut on the 9ther hand I think that at the bare minimum she should atleast offer to pay some of the utilities now that she has been offered a higher paying position. Okay it wasn't her choice to move in but it's her choice to use electronics and such at the house. She could go out and find public power outlets to work from. \n\n\nZero contribution = zero rights to use at the end of the day", "YTA, you can share the rent but, if only business calculations matter, you also need to compensate her for the lost income and larger expenses over the past year because of the relocation that you caused.", "Well I'm not sure anyone is an A, but do you want to marry this woman? Is she the woman for you.  If so I would consider the rent paying option.  Women do find it more manly.  Obviously if you want kids she will be doing all kinds of fun stuff with her body and that will all fall on her.  Paying all the rent is what I think should be expected of husband's.   Are you going to be her husband? If so, play the long game.  Marry her. Pay the rent.  Live large.", "Yta;\n\nOP earns 2x her salary and wants a split after she made all these huge sacrifices for him.", "What was your agreement when the both of you moved? \n\nWhat was the change that she offered when she started making an income?\n\nIf neither of these addressed the current situation, you demanding anything more than she offered makes YTA. \n\nYou can request she pays more into it, but if you didn’t have the foresight to figure out how finances might work out, and plan, then tough for you.\n\nIf she is wanting to pay less than she previously offered, then maybe it’s an everyone sucks situation.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy partner and I moved to a new country a year ago because I was given an amazing job offer.\nWe moved together, because we're in a long term relationship, even though she didn't have a job lined up here when we moved.\n\nInitially, when she didn't have a job at all, I 100%, without any hesitation, let her know that I would be paying for everything for the two of us, including our biggest expense - the rent.\n\nA few months ago she got an internship job and she was the one who let me know that she'd like to contribute to the rent. We split it so that her pay would be fair and would not overburden her, since internship salaries are not all that great. However, a few months in, because of other unexpected expenses on her side, she asked me if I could cover the whole rent for us again. I accepted.\n\nNow, she's still in her internship, her additional expenses are no longer an issue and she got a full time offer from her job which will pay her significantly better.\n\nDespite her bettered financial situation and outlooks, she now considers that I should pay the whole rent indefinitely, her arguments being:\n- I can afford it and it's the manly thing to do\n- She moved to a new country for me so it's in some way my responsibility \n- She would like to use the extra money for girly expenses that she could not make before: nails, hair etc. and says I should understand this since I am partly to blame for why she hasn't had these done in a while, since I made us both relocate here\n\nShe also currently doesn't cover any other expenses for our household, except that we split weekly groceries 50-50.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "So sorry, op, but that's nonsense. She can move back. Did she ever point out that her moving countries with you involved a cash transaction?\n\nEdited for forgetting judgement: NTA", "Info: Where did you from? Where did you move to?", "OP you're a good dude and your expectations are more than reasonable. NTA and if your partner had a problem moving countries then she should have told you before, she can't use that as an excuse to put all financial responsibilities on you while she buys girly stuff for herself instead of being an actual partner and paying 1/3 of the rent which probably results in 25% of household costs since you pay for everything else.\n\nSmall side note: it's always funny to see self-proclaimed feminists defending women in these situations. What happened to the thrive for equality? Or that only applies when women would gain from it, not men?", "Manipulation in each of her “arguments.” Is she going to hold it over your head forever? \n\nINFO? When the conversation came up about moving did you use any “manipulative” arguments to get her to agree or did just she agree to move?\n(This would only make her choice of arguments make some amount of sense).\n\nI say NTA.", "NTA \nIt really seems like She’s gaslighting you OP.\n\nIf you didn’t force her and she chose to move with you, it’s not your responsibility to continue paying 100% rent if your staying together. \nshe wanted to contribute originally yet she wants to waste her money on cosmetics now instead? what changed her mind I wonder", "NTA you should split your expenses proportional to your incomes", "INFO - what's her income compared to before you moved?\n\nShe should be contributing and saying it is 'manly' to pay is sexist and shitty. However, if she's basically given up her career to move with you, that does change the equation on how much she should be contributing. Generally I'd split by salary percentage, but if she followed you to your dream job, I'd say she should be able to maintain her prior standard of living.", "Nice try, no deal. NTA", "Nta", "NTA, anyone who uses this reasoning \"I can afford it and it's the manly thing to do\" should be immediately booted", "She is TA, absolutely no way you should pay it all, and nor should she expect you too.", "NTA send this kid back to her mama. You are not the father.", "Would you have a smaller and different apartment if you didn’t include her in your move?", "she is the AH.", "NTA. Manly and girly things. Get into the 21st century.", "NTA. She just wants a free ride. If she can contribute, she should. \n\nI also feel like she can’t use moving to another country as an excuse because she still CHOSE to come with you.", "Where oh where were the men like this when I was single.  Lol I’ve never understood why someone thinks like this as a woman if you tell a man it’s his job to do this and that then the man as the right to say well as a woman you have to do blah blah blah. Once you’re an adult no matter what sex you are you are responsible for paying your way in life. Unless you BOTH agree to other terms. Ntah", "I got the same thing from my soon to be ex-gf.  She has her own business and I work for a company and get paid pretty good.  When her business slows due to the season I end up covering all the bills leaving her to worry a out her personal bills (cc, and mortgages for properties she had before we met).  She stated that if I'm not able to pay my half of the rent im out, I've never had any issues with that.  She on the other hand has on several occasions expanding months at a time.  Once she dropped the whole \"well it's a man's role\" is when I mentally and soon physically will walk away from the relationship.", "NTA, her arguments are pretty weak.\n\nIf she really wanted to get caught up on discretionary spending and buy some new clothes, get her nails done, etc. then start her paying rent after the first month at her new job.\n\nThat shouldn’t be an indefinite problem.\n\nBetter to end this relationship soon if the values are so different though.", "Nta. The manly thing to do is toxic and so are her other reasons. Why are you with her", "NTA.\n\nMaybe look at ALL her financial obligations before assuming she is able to contribute more, I'm not saying she shouldn't, I'm just wondering if she amassed any debt she is reluctant or embarrassed to tell you about. \n\nIf it really is just to blow it on self care then there needs to be a needs Vs wants discussion. She needs her hair cut because she can't do it herself, she wants her nails done as she can do those herself (again assuming there are no barriers to her doing them). \n\nAlso she sounds very entitled, it was extremely lovely and supportive of you to fund her for the time she was unemployed and then in a lower waged position. It doesn't mean you have to support her for the rest of her life. Nor you or her should expect that. That is a discussion that needs to be brought up, though most people would be grateful for the assistance and want to add to the life you seem to be building together rather than take constantly. \n\nI've got a very supportive husband who has helped out a lot, and now I'm finally earning more I'm able to put more money into the household pot. I get a little more in my pot for me, but I've hopefully lessened the weight on him and freed up a little extra money for him.", "She’s showing you why you should break up or lol dowsed to more of this entitled behavior.  All of her reasons are a big turn off IMO. \n\nThere is nothing manly about subsidizing a partners lifestyle if you are unwilling, unappreciated and are manipulated into doing it. \n\nShe’s an adult and chose to move to another country she should have made plans for how to live before and after gaining employment. \n\nHer personal hygiene is her issue not yours and as stated above she new she wanted/needed those things and chose to sacrifice to move with you she wasn’t forced and she can go back if she chooses to. \n\nYour gf is being a mooch and is feeding you a bunch of bs so that you will feel guilty and pay her to live with you. If that’s what you like I love it for you. But greedy mooches don’t ask or demand less they demand more. So imagine what that looks like in your future.", "Nta", "NTA It's the manly thing to do?  Isn't that sexist or does that only work in one direction?  She wants all the benefits of a relationships but little of the responsibilities.  It's time to rethink this relationship.", "NTA. You don’t have a girlfriend, you have a leech attached to you. Best treatment is to deal with it now, or you’d have to cut off your body part later", "NTA\n\nShe needs to get accustomed to paying her own living expenses.  There's absolutely no reason she should spending as much money on beauty products as rent each month.  She should pay her rent.", "NTA obviously\n\nShe is toxic and manipulative, also \"man things to pay the rent\" did you find her in a 1960 cave?\n\nExplain to her that it wasn't exactly a question. She has to pay her part of everything, not only the rent. Or she can gtfo", "NTA. Just the \"it's the manly thing to do\" it's enough to make her TA and embarrass any woman reading this.", "Is the internship paid? Usually they arent", "You could be nice and offer to buy her a plane ticket back.", "It's the womanly thing for her to keep the house clean and beautiful and cook and serve you dinner. Oh, she's a modern woman that doesn't conform to traditional roles? Those roles only apply for you, not for her... Right\n\nOh, and she spends time and money to make herself look prettier. That's nice. Does she also spend time and money to make the house look prettier? Or to make your experiences together more joyful? If not, you might want to ask yourself if she's doing it for you or for others\n\nOh, and she moved \"for you\", so she made you a favour? So she didn't move because a better thing for you was also a better thing for the two of you (and by extension for her). And it's not like the new country also provides her with more opportunity as well and with a higher standard of living. Which she had access to without any risk on her part. It was all just for you and a sacrifice on her part", "This is the correct answer", "Never EVER listen to a woman telling you what a man should do.  (And vice versa).", "And if she won't then she can go back to live with her parents and you can find a true partner that actually cares about you and not your money. NTA", "#NTA", "I want a private plane paid and maintained by someone else, guess what no one is offering. Jfc NTA OP", "He supported her completely while she had no income. She wasn't forced to move and never had to worry about rent and such.\nNone of her points aren't even semi-valid at this point.", "She probably has money now and wants to give herself some treats she couldn't before, and I can understand that. But saying it is the manly thing to do is a bad way to approach it. \n\nIn our household, my husband gets double the pay I do, so he just pays more (70/30 on household expenses) and as I have more time (I work 40h he works 45+commute), I do more household chores. \n\nTalk to her. Find compromises and let her have a month of two off the hook, so she can get those things she wanted for a long time, then start with a fair share. I think she just stopped doing things for herself and while having a home is important, so is caring for ourselves.\n\nBtw OP, I am assuming you did spend your money on things you wanted, if you didn't, you should also treat yourself. Once a month I get a facial massage and it is doing wonders to me, and my husband gets himself spicy food from time to time. Both of you should get things.\n\nEdit: both the face massage and the spicy food cost 20€ a month, I see people think it is not the same. It is what we both want to decompress, if my husband wants spicy korean wings why the fuck would he get anything else, he wants the wings.", "I am still earning twice as much as her, but she's earning enough to even afford paying the rent on her own too. The way we always talked about rent is she'd have to pay the same % of her salary as me. So, she'd be paying half of how much I'm paying for rent since she also earns half as much. Equal percentages has always been how we talked about paying rent, not splitting it 50-50.", "She chose to go with him, she isn't owed anything.", "I see the point! However, her internship paid 3x her previous salary and as such, so far, it has compensated for her lost income. I also did not force her to come. But actually really good point, thank you!", ">Paying all the rent is what I think should be expected of husband's. Are you going to be her husband? If so, play the long game. Marry her. Pay the rent. Live large.\n\n\n\nWhat a trashcan of garbage", "mate it's not 1950 anymore. Husbands aren't solely responsible for the rent.\nShe is using him and trying to manipulate him. He is allowed to to expect a fair contribution from his partner", "She chose to make those sacrifices, she could have told him she didn't want to go.", "Honest question: given that I cover all other expenses, is it not okay for me to expect that she pays part of the rent? I'm not expecting to split it 50-50, but rather that she pays a proportional % to her income. So she'd pay half the rent that I'm paying, given that she earns half as much", "Maybe had he not had her quit her good paying job to accommodate him by moving to another freaking country, he would have a leg to stand on. They want different things. She needs to save up money for an airline ticket and move home...but who will wash and iron his clothes and cook his food and clean his apartment?? Asking her to move for him and live below the income level she made at home is a bullshit move.", "you saying \" let her have a month or two off\" you sound just like her. he's been paying for everything when she couldn't and now that she can, she doesn't want to  because she wants to buy things for herself which is fine. that doesn't mean she gets to jus not pay her half of the rent.", "[deleted]", "[deleted]", "Your point is? You ever been in a relationship longer than a few months?\n\nYou compromise. She did for OP and now is asking for OP to do the same.", "Maybe in 3 years it will be OK.\n\nFor now nah. Let her finally live after giving up so much time for you", "Do you think she washes my clothes and irons and cooks just cause she's a woman? I wash clothes. We both iron. We both cook, but I also buy us takeout. We both clean the apartment, but I do it more often than her. Way to asume gender roles, lol", "He didn't have her do anything, she could have easily said no and that she wasn't going, she chose to go with him.", ">Maybe had he not had her quit her good paying job to accommodate him by moving to another freaking country\n\nHe didn't have her do anything. She's an adult, capable of making her own choices, not a small child.", "Also \"good paying job\" - her internship now pays her 3x her previous salary. The full time position will pay her 4.5x her previous salary", "\rPlease stop perpetuating gender stereotypes that automatically assume women are the pitiful ones handling all the household chores in uncertain situations, while men are undoubtedly idle at home every day.", "Equalit is equality. If she wants to say traditional values then there are duties she needs to ipkeep. Is she says modern values then she needs to share the duties and pay her half of the rent. You cant pick and choose what you adhere to.", "She really compared her husband getting spicy food to her getting massages and facials for self care 💀 let’s see the cost comparison of those two lmao", "No, I do not want to split it 50-50. I repetitively said this. I want us paying equal %. So she'd be paying half as much for rent as I am, since she earns half as much.", "He literally said he doesn't want to split it 50/50, can you not read?\n\nHere's a list of things for you to do:\n\n1. Switch the genders, let's say OP is a woman who paid the entire rent for quite some time already, and OP's boyfriend says \"yeah although I have enough money to pay half the rent, I'm not even gonna pay the 33% that's expected from me, I'd rather go out and watch football with the boys, and you as a woman should be nurturing me anyway\"\n\n2. Realize that you'd call for the execution of the boyfriend, say all kinds of horrible things about him how he's a leech and \"OP honey you deserve better, RUN\"\n\n3. Realize you are massively sexist and you clearly consider women inferior, otherwise you'd advocate for equality and not a role where a man has to take care of a woman while she buys clothes instead\n\n4. Improve as a person", "I did not mention it, but I have said that we would be paying fair rent and she would be paying half as much as I am paying. I have also clearly communicated this to her as well.", "He took on all the costs until she got a fulltime job. So tell me where did OP not already compromise?\n\nHer wanting to spend 100% of her income on herself is just selfish. OP is asking for her to contribute at least part of the expenses which is only fair. \nShe is greedy and if she won't budge he is better off without her", "She CHOSE to move with him. According to op she's making more then she was previously.\n\nNot to mention you're overlooking that he DID take over paying for everything for a while. And even took over paying rent when she had other expenses. As much as it sucks, being an adult is paying rent.\n\nIf she didn't have op she'd be paying much more than he wants her to pay.", "NTA if you pay % for salary value.", "no seriously 😂 shorty really said \" yeah i get my face massaged and my husband buys himself food \" i'm stuck on how that's even remotely the same as self care or going half on rent ? 😭", "20€ both.", "Well, it sounds like you're doing your best to be fair.  \n\nThe plan to split the rent by percentage sounds promising.  One thing to consider though is that splitting by percentage only works if both people are making enough to cover necessities and also have some disposable income left over.\n\nWhat I mean is, if she'd have to pay $2000 per month in rent and other bills and would only have $50 left over after that, then she is not going to be happy.  So you need to look at the amount of disposable income she has (the amount of money left after paying for necessities like rent).  Is it enough to cover reasonable hair expenses and fun things like nails?\n\nLike I said, you guys are going to need to agree on what's reasonable.  If you can't do that together, I would see a counselor or financial advisor to work out an agreement.  You're in a serious relationship and it will be worth sorting out your finances so that finances aren't a source of stress in your relationship.", "So from my understanding we will just use simple numbers. By 5050 what you mean is.\n\nYou make 400\nShe makes 200\n\nYou contribute 200 to rent and she contributes 100 right?\n\nThis being 5050 you envisioned correct?", "[deleted]", "> She CHOSE to move with him. According to op she's making more then she was previously.\n\nNot relevant really. I could make 250euros a month in my fathers home country. And make 2000€ per month in my home country with the exact same job. See my point?\n\n\nHe paid everything because she couldnt work yet on her level. She left everything behind. Its the least he could do for basicslly forcing them to uproot their life (lolol  chose to move with him, what was her other option, break up. Thats not a choice thats basically blackmail, \"or you do what I want or you can fuck off\").\n\nHes earning 2x her salary while she hasnt been able to do anything for herself since the day they moved. She for sure deserves to be able to save money and also have some fun. Especially since he can clearly afford to.\n\nBtw her comments about him being a man and that means he should pay would mean I would insta end the relationship lol. Fuck outta here with that shit.\n\n\nBut without that shes a 100% right.", "It's what he wants and costs the same (20€). I buy them on packs when they get discounted and he isn't interested in those. He goes to see scary movies alone too because he loves them. I did have to say the price of both I see. \n\nWhen we talked about this, that's what he wanted. He still prefers to have his spicy food over going to a spa or getting shitfaced.\n\nI bought this man socks and some among us parafernalia because he WANTED them. If I try to give him fancy things he would just never use them, but if I spend my day baking him a cake he would be over the moon. He is just anxious when it comes to ordinary life things, and he just prefers to live a very simple life, so a spa day would make him be on high alert all day. \n\nWe had our 10th anniversary together and his plan was to go to an italian restaurant and go home and play some  games and so we did. I love him dearly. I am going to make him a cheescake for my birthday, because for his bithday we couldn't get a fancy cheesecake due to our cats being sick.\n\nI get that it sounded uneven now, but you can get really cheap deals if you buy things in bulk.", "That's what I'm saying, yes", "We picked the apartment together.\n\nWe are NOT splitting it 50-50. That was never up for debate. We would be splitting it 65-35. So that way she pays half as much as me, since she earns half as much. That was always our agreement.", "Ok i fully understand where you are coming from, but here me out. Ask her to split it 70/30 for the time being. Than once she has a solid grasp of her job in say 6 months revisit a 60/40 and leave it at that. Allow her the freedom to explore the new country and start building saving while allowing her to do some stuff she has been missing. \n\nWhile it was her choice to leave everything behind to start a new life with you in a new country. She did pack everything up to do this as well. A relationship is never just 5050 like people say it is. So instead of focusing on the financial part focus on what you have together now. Is it really worth causing arguments over something petty? \n\nEither way good luck and hopefully it works out.", "Then I guess if she has issues with it now, she can put the $ into a plane ticket home. Once again: this is why having regular money conversations is so important. You two are obviously not on the same page.", "Finances are a huge deal and often lead people to break up.  They need to focus on finances.", "NTA....the manly thing to do? Come on , we do not live in the fifties , she has to suck it up and pay half of the rent.", "INFO: were you able to save and build assets during the time she couldn’t work?", "NTA. She used you to\nGet to move to the new country. She needs to pay her fair share or move out.", "She TAH. And sexest.", "Although I don't agree with the \"it's the manly thing to do\" argument, I may have an unpopular opinion.\n\nI've moved by myself for work to another country for three years and, there, I met a lot of couples that had moved after one of them got a good job offer. My experience is that it's never a simple calculation problem.\n\nIt's indeed normal to expect her to contribute to some extent. But incomes may not be the only criteria to decide who should contribute to which extent.\n\nYou initiated the move, so it's important you inderstand what she gave up (or percieves as having given up), if you want to introduce fairness to the relationship and find a good balance.\n\nDoes she properly speak the language of the country where you moved? Did she have an opportunity to build a social network for herself? Or are all your local friends and acquaintances, people that she met from you? Did she express the wish to go back to her home country and you have discouraged her to do so because the situation is exceptionally good for you and you believe it's also a good opportunity for her?\n\nThe fact that she is focusing on herself and her appearance may be her way to cope with the fact that she feels isolated. I may be wrong here and you'll be the only one capable to judge. But I've seen spouses that felt trap in the country we were living in, not adjusting to the local weather, the local language, the local culture - and it's too easy to say that they could just give up their relationship if it's so hard on them, then it's like just ignoring the importance of their feelings for their partner.\n\nIt's important you talk with her about how (and particularly where) she sees the future. My point is that you should be careful about considering more than simply the incomes in your calculations. Life is about more than the money, the question is rather what's your respective quality of life and how to make it fair to the both of you.\n\nI can't pass judgement due to lacking INFO, but it may be that everybody is a bit of a AH here. Her for using the \"Be a man\" argument and you for not fully understanding what she is missing by prioritizing staying with you rather than going back home.", "I personally would split the rent and utilities right down the middle, and tell her you need the extra money for Manly things like a tools and trucks.", "Sounds to me like she wants a proposal, and this is her passive-aggressive way of hinting at it.", "Nta, however she did make a huge sacrifice by moving to another country.  She had to give up her job and while you were paying the bills she still went through a good portion of her savings.  She had to give up luxuries that she was accustomed too.  Find a way to comprise.   Any e for the next 6 months she pays a smaller portion of the bills so that she can rebuild her savings and then find an equitable way to split the bills.", "YTA she has nothing and nobody in this country and you're mad at her for wanting to finally spend some money on herself after months of financial worry. she's been stressed, she sounds like she's having self-esteem issues, and she gave up her entire life to follow you somewhere else. You'd still be paying all those bills if she'd decided she didn't wanna come with you, and if she decides to leave and go live somewhere she can afford to look after herself you'll be back to paying it all.\n\nalso, INFO, how much of the housework are you doing? how long have you known she's feeling shitty abt her inability to maintain her appearance? what are you doing to help her progress in her career so she can settle into her new life and feel secure? how often do you tell her you're grateful for her sacrificing her planned future to make way for yours?", "If we’re doing gender stereotypes, she’s not gonna like hers… NTA. Leave this selfish, manipulative person in the dust.", "NTA\n\nWhat is it with women that expect men to do the \"manly thing\" while not doing any of the \"womanly things\"?", "NTA. I’ll be honest with you too - this relationship is over. If a partner starts expecting this sort of thing, it’s cause they’re harbouring serious resentment.\n\nShe wants a sugar daddy, which is a different arrangement entirely.\n\nSo your choice is to discuss that change or let it go. Good luck.", "Nta", "NTA - this is not fair unless it is what you agreed in advance.", "NTA if she can pay and doesn't she is being a leech", "NTA- you’ve found yourself someone who is going to use the fact that she moved for you as leverage. Congrats my man! Don’t envy you at all.", "The mind change 😅", "NTA if she doesn’t wanna pay for rent you should make her sleep in an outhouse, or go find someone who will support her ideal lifestyle - being a bum.", "NTA", "NTA , she has to contribute since she got a job , right, every woman wants a man that will provide for her but saying 'it's the 'manly thing' is so off-putting she sounds manipulative and for me that's a relationship-breaker", "NTA you're both adults and are both working and earning so you both should be splitting the expenses. If she wants to have money for girly things she should budget for it and not use her whole paycheck. \n\nIt feels she's taking the mick and her comments about it being your fault that she wasn't able to pay for all the girly things before is pretty manipulative. She's an adult that choose to go with you. \n\nAs an adult woman that moved country myself to be with my long distance partner of 5 years, i would never say that shit. It's incredibly cruel saying it's your fault why I gave up the stuff at home to move here for you opportunities.", "Nta I moved to be with my partner and paid my own way despite him working and me not in fact in uk we get benefits and due to disabilities and children I get more then him so I cover most things for us both because we’re partners", "The womanly thing to do in this situation would be to keep the house hold clean and up to date. It’s his property that she is living on. Be the person that lives in subservients.", "NTA, kick her out and dump her. \"Manly thing to do\" sounds like something that a gold digger would say to me.", "NTA.\nEquality means being by equal. Not getting preferential treatment", "NTA and her arguments are so obnoxious, dump her.", "as a woman, this isn’t a bad thing to do. you’re asking for her part of help and initially, it should help both of you! if anything, if my man had been taking care of me and providing for me until i found a job, i’d be more than happy to help him out in advance. that’s what love is all about ❤️ hope you both are doing okay!", "NTA, but I see this as an opportunity.  Let her know as part of the agreement, of you paying. you expect the house to spotless every day, all clothes to be cleaned, breakfast cooked, lunch packed, and dinner made, she does all the grocery shopping, and anything else that was considered a woman's job.  Since she laid out expectations, you need to communicate yours.  I'm sure she will change her tune quickly.", "NTA tell her she’s stupid. Pay half of leave her. Why are you even entertaining her nonsense? Speak up and tell her like it is or leave her.", "Girlfriend is the AH.\n\nYou need to split expenses based on percentage of income.  If you make $60K and she makes $40K, then she pays 40% of all bills.  That's being an adult.\n\nYou could let her pay 10% less so she can have her \"girly\" expenses  (you pay 70% se pays 30%) but don't do more than that.  She needs to learn that she's an ADULT and you're not her parents supporting her.", "NTA. Her reasons are manipulative and taking advantage of you. She sounds like a gold digger. Be careful she doesn't baby trap you.", "NTA - she’s an asshole for the “manly thing to do” bullshit alone", "Sounds like you may need to sit down and talk. Since she added the \"it's the manly thing to do\" part I feel like she should do all the \"womanly things\" if we're going there. Does she wash the dishes, cook the meals, wash the clothes, etc? \nI dont think you're the a$$hole for asking her to pay part. I think her reasoning is the a$$hole.", "You're NTA.  However,  that's your partner.  You guys are a team unless you want to bench her.  Relationships are hard enough.  Sounds like she's only contributing to specific, personal care.  In this economic climate, it's way more different than 35 years ago.  If the goal is to grow together and build a life together,  extra money should be put into a future account to purchase a home.  Discover what her goals are,  if you're not growing together as a couple,  you should just call it quits.  \n\nRemember,  \"Shoes feel better when you wear them as a pair. Never walk through anything barefoot.\"", "NTA.\n\nAs a woman, I want to tell her to shove her arguments where the sun don’t shine and travel back to the 1950s where she seems like she belongs.", "She’s saving up to ghost you.", "Time for a new GF and she can figure out living by herself. NTA. Shes being a moocher.", "NTA. The “manly thing to do” is such a toxic thing to say.", "NTA. Split it based on income, that is what is the most fair in my opinion.", "This will just get worse if you allow this to continue. NTA", "Sadly for her, she is an adult, and responsibility comes before fun. I would love to spend lots of money on myself each month. Unfortunately I have bills and other expenses to pay first.\n\nBy all means, work out what would be a fair portion of the bills for her new financial situation. That way you both have money left every month to spend on fun stuff. \n\nNTA", "NTA.  Tell she can either pay half the expenses for the place your share or pay 100% at her own place.  \n\nThe excuse that she moved to a new country for you is lame.  There are women in every country I’ve been to.", "You are absolutely NOT the asshole for expecting the person you’re in a relationship to be an active participant in the relationship. \n\nYou owe them nothing and unless you have some kind of mutually beneficial agreement in which you’ve agreed to them not paying rent and in return you get (insert anything) then you are absolutely not in the wrong and deserve better and I sincerely hope you are able to not settle for less than you deserve. \n\nPart of this fight for equality also includes taking into consideration unfair expectations society places on men and allowing them the same respect we would want or give ourselves or others \n\nThere are plenty of hard working women who you wouldn’t even had to have asked this question that would’ve been uncomfortable not contributing \n\nThe only exception I can think of would be if half of your rent is not realistic for the amount of money they make and this was an apartment you lived in before she moved in. In that situation I would say less than half is equivalent to pay half, because it just is what it is until your lease is up and you guys can find a different place or you’ve both agreed it’s working out and nobody is having added stress (mentally/physically) trying to make ends meat, while also trying to be a human in a relationship with another person which also requires time, communication and effort to be successful", "NTA\n\nIf you want to give her some time to have a good time with the nails and so forth then that would be nice of you. But sooner or later she needs to pay rent. Those excuses are lame. It's not manly. She would be paying rent in her country of origin.", "Manly?? NTA, and she's a freeloader.", "Nta. Time to sit down and budget for hair, nails, makeup and all that jazz. They're *wants*, not **needs**. You can look Profesional without a blow out and color from a salon. You can look professional with minimal makeup and a home nail job.", "NTA", "NTA. My partner and I split expenses evenly. I mean, we have a shared account where our bills come out of, and we pay our bills first. Then we get other necessities and put money into savings, and then we can get things we want. When you're in a relationship and living together with two incomes, then everything is shared. Rent, bills, groceries, etc. When those are handled, then you can get fun things. Because that's what being an adult is.", "NTA, she is taking advantage of you. You are her partner, not her floaty.", "NTA", "NTA, if she can not contribute equally to the household she can move back to where she came. It is completely wrong to expect one person to provide everything unless it was explicit agreement prior to moving. Then she needs to do all the housekeeping, cooking and organizing.", "Nobody forced her to move. If she doesn’t pay rent, she can move back home and you will find someone who doesn’t freeload off of you", "Strongly leaning to N T A, the \"manly thing to do\" almost settles it\"but INFO: How much of a sacrifice did she have to make during relocation? Does she have degrees that were not recognized? Is there a language barriers that prevents her from a career that she could have had at home?\n\nAll in all: Die she sacrifice a career and now has some low end alibi job while you have a great career, or is she in a similar financial position and perspective that in your country of origin?", "NTA, “it’s the manly thing to do”\n\nTell her to fuck right off", "Her expectation here seems to be your money = our money and my money = my money.  That’s an attitude that will be present in all areas of your life. Sorry OP, but you don’t have a partner.  You’ve got a new age leech.  \nNTA and good luck.", "Nta OP.\nKnow what else is the \"manly thing to do\"\nFind a loving partner who appreciates the time he spent covering 100% the rent when they couldn't afford it, but now will pay their fair share as a loving partner.\nYou can ditch her see how she likes the manly behaviour then", "Immediately from point 1 she can f off. If she hadn't said that I'd have argued to let her get hair and nails done as a thank you for relocating but not after that. Tbh I HATE that mentality so I'd break up over that but I know that's just me. NTA", "Nta she should pay her share and since that was the expectation and agreement. If she wants a different set up, you should be able to say no. It could end up meaning you’re not compatible anymore", "NTA marry the catfish", "I would give her the option for you to pay for her to go to and stay in her home country or start contributing in the place you currently are. Either way you save money in the long run.", "NTA if your in a relationship you both must pay bills and such if she's paying around a quarter of the bills it's not balanced. If she can't pay the rent you can't pay for the groceries", "\"I can afford it\" So does she (her fair share, at least)\n\n\"it's the manly thing to do\" It was in 1923, not in 2023\r  \n\r  \n\"She moved to a new country for me so it's in some way my responsibility\" She choose to move with you, and if you two had stayed in your homecountry she would be paying her share. She can't let herself be pampered just because she moved country (unless it is impossible for her to find a job, which isn't the case here).\r  \n\r  \n\"She would like to use the extra money for girly expenses that she could not make before\" She doesn't need a whole paycheck for those and must learn to budget, as everyone.\n\n\"I should understand this since I am partly to blame for why she hasn't had these done in a while, since I made us both relocate here\" Again, she had some choice in here, you didn't kidnapp her, and she didn't do those thing because the family was on a budget with only one salary coming in.\n\nBasic rule : You can work, you should work; you work, you pitch in. \n\nNTA", "NTA. she's just realised how annoying it is to have your salary eaten up by bills. That's just life. And F\\*&% all that 'manly' thing. That's sexist.", "Dawg if anything you need to grow a back bone and let her know that she will be responsible for paying some of the rent", "If she does not contribute to the costs, she is a mistress, not a girlfriend. If you do not have children together, that means you do not owe her support.  She did not move there so you could get a better job. She moved there because she had no backup plan for the vacancy you would be creating. Half the rent, a considerate and convenient man in the house, etc. Now, she feels like she can afford to leave, and so she is showing her true colors. Kiss her Goodbye, and hold the door.", "NTA. Proportional contributions to joint expenses - including rent - is reasonable. \n\nAs for her reasoning:\n\n1. If your household will have antiquated views on gender roles, she should do all the cooking and cleaning. \n2. She can choose to live wherever she wants, but will have to pay rent where she chooses to live. In this instance, she chose to move with you. \n3. This is just manipulative. Life is filled with choices and she made some, to move with you. Unless you forced her to move, she shouldn't hold you accountable for the results.\n\nMight want to ask her how much longer you are going to owe her for her choosing to move with you. Might be a long while, and that could get expensive - and I don't mean monetarily.", "So she does all the housework and pays for all the dates, right? Since shes contributing nothing else.", "Sounds like she got greedy quick. \n\nNTA", "Going against the top comments with NAH leaning towards N T A. \n\nIf she's gone a year with trying to keep spending low and not having those self care things, it's understandable that she wants to splurge on herself and feel good now that she'll have a substantial income. And it's also completely understandable and normal for you to want her to be helping support the household now that she has that income. \n\nBoth of your sides are reasonable with the exception of her wanting you to cover the rent permanently. Maybe you can compromise and let her have 2 months where she can splurge and build up her savings security net before you both set a reasonable budget that allows all household costs to be met while still allowing you both to build savings and have spending money.\n\nFor info reasons, you said her income will be 4.5x her old income. What is the current cost of living compared to the country she was working in?", "NTA\n\nThese kinds of arrangements are better worked out before committing to them, as misunderstandings can get ugly.  But it’s a bit late for that now.  So have a sit down, and let her know how you feel about this.  Is this a dealbreaker for you?  Let her know.  Is there an amount you consider mandatory?  Let her know.  Open the conversation and work out what is best for your future.  If you do not do this sooner than later this will really dampen your chances of having a successful relationship.", "Absolutely NTA. You both work for your money and both should be able to buy wants after needs are covered.", "NTA. She is manipulating you. Take her ass back to your home country.", "NTA OP nip this in the bud now. She moved to support you. But either you can downsize the flat for something cheaper, but the end result is that she has to pull her big girl panties on and contribute to the household. Seriously, she cannot live anywhere for free.", "Nta she what’s you to pay fully for the rent after paying 50-50 so she can get her hair and nails done how at is that fair? And since it the many thing to do shouldn’t she do all the household chores? because due to her logic it’s the womanly thing to do?", "NTA. Time for gf to pay up *and* shut up. It's called **being an adult**. She should try it some time.", "NTA , and fyi this argument point of\" but I moved for you\", will be used in every single opportunity. It's like an obvious pair of aces to \"win\" any argument. And some stage you have to call the bluff and say if she doesn't like it she's welcome to go home .", "Ditch her\n\nNTA\n\nAbsolute leach tier \n\nYou can treat her because she's your bae but not because she thinks it's expected \n\nHad an ex who worked as a quant making double me, and still wanted those things \n\nSome of it is cultural but you can't not want to do the \"traditional sexism driven activities such as cleaning, cooking\" but also want everything paid for when both parties are equal partners who work", "1. i feel like society really trys to push this narrative of how a relationship “should be” and a lot of young men and women fall in the trap. everyone’s different. and saying that’s the manly thing to do is corny and manipulative. \n2. she chose to move. you didn’t drag her there. \n3. is she holding resentment towards you or something? or is she just manipulative and trying to get her way? i get it. every girl wants to feel pretty and pampered. but these things should be a mutual agreement in a relationship. \n\nI don’t know either of you or your relationship tho. hopefully this is something you guys can talk about and come to a compromise or something. but don’t let anyone manipulate you or feel like you have to do something in order to keep them or whatever the case.", "She is definitely manipulating you by saying what’s “manly” to do. It is sexism.\n\nNTA by willing to split some other costs but (as someone who moved to another country to be with my partner, leaving career and family behind) I would doubt your commitment to your joint future.\n\nIf your salaries are significantly different (given you got a job offer from an overseas and she just had internship previously) I would expect a couple to support each other and ensure each partner has enough financial security. \n\nSit down together. Calculate your expenses and needs. And divide proportionally so it doesn’t affect either party. \n\nIf anything happens to you tomorrow she needs to have some financial stability.", "NTA\n\nI'm sorry, but the 'manly thing to do' is such a gross reason.  She is emasculating for no reason and I would not blame you if you dumped her on that alone. Also the girly reasons makes my eye twitch something fierce.  The audacity.", "Info: Who cooks and cleans?", "NTA\n\n\"Manly thing to do\", \"moved for you\" and \"girly things\" are all very shitty arguments. \n\nIf both work, both should pay for things equally (unless the expenses are much bigger than her salary).\n\nShe moved because she is an adult and she made a choice to follow you into this new path. She could've stayed home and with her girly things if she wanted to.\n\nHer wanting you to pay for everything and wanting to have time and money for herself, along with blaming you for her rough moments in life at a new place she decided to move to with you is just super manipulative and mean. I would go a little farther and say this feels like signs of cheating, but i might be wrong.\n\nShe should apologize (you should make her apologize) and then set some rules for the household. She can agree and stay or leave and live however she wants.", "NTA kick her to the curb", "Not unreasonable and NTA. My ex-wife and I used to live in the same apartment. We paid our share of rent.", "Mega red flag.", "It would actually be a manly thing to get a boat and fishing equipment.", "I mean, they literally did move there for him. She picked up her life and went to this country with him.", "I agree, though I'd swap archaic for manipulative, given the way she used it", "Second this. Better to have the conversation late than never though. \n\nYou two have different values on how the income should be used. Unless you come to some type of understanding and agreement, there’s going to be a lot of resentment.\n\nDepending on how the conversation goes, if there is no alignment, it may bring to the surface a major value disagreement and therefore a reason why you two are not a good fit. It is worth considering breaking up.", "I would try to see if they can make a budget so she does have some money left to spend on herself. If she's earning less it can be through an uneven split of expenses. If they are earning the same, if he was covering all the rent before, that should leave them both enough money for some fun stuff (e.g., if rent is 1000, each will have 500 worth of spending money, that's quite a lot). Another option is to split it so both have the same \"leftover\" amount of money.\n\nBut all of this requires a conversation and one that doesn't involve wording like \"it's the manly thing to do\" or that it is his responsibility that they moved (she always had a choice not to move).", "I mean, OP is NTA, and there are all sorts of red flags here, like wanting to spend the money on herself, but moving with a partner often involves all sorts of sacrifices, and saying, \"Well, she opted to, so it doesn't matter,\" is kinda baloney.\n\nI spent years \"leaning in\" to my partner's academic career, and all that counts as sacrifice for her and her career.  It's not like, \"Oh, you agreed to it, so none of that matters, and I don't owe you anything.\"\n\nMoving to another country for your partner's career sounds exciting and fun, but it is also a financial and personal and professional sacrifice.  She's still the AH, though.", "She is acting asshole-ish, but also she did move, supposedly, because she didn't want to lose her bf, which was basically the only other option. It's not as much of a choice as it is just wanting to not lose someone you love deeply and have been in a relationship with for years. She left everything behind to be with him, and yes, her reasons were absolutely manipulative, but honestly, she should have communicated better and actually thought well about how it's going to sound to him. He didn't force her to move, but her desire to be with him no matter what did.\n\nIf your basically soon to be spouse got a new job and you were in her shoes, probably feeling trapped in a new country, with basically no friends, probably a language barrier, and a brand new job and not having your own safety fund, would you feel like it would be fair to ask them to let you go back to normal life by working your new job, bringing back your own habits and favorite activities that you couldn't do before because you didn't want to burden your partner with your own expenses? Just a few months of having him pay the rent so that she could save up sounds reasonable to me. Idk, she's still going to have to pay 1/3 of the rent she's perfectly capable of paying in full with her new salary, but having that money saved up in case things go south sounds great. I'm not saying a year, I'm saying just like three months. She IS in a new country she didn't expect to have to move to, and she's just starting to make good money. \n\nShe should have thought her reasoning out better and communicated instead of manipulating, I absolutely agree. But it's important to also try to see this from her point of view.", "Add in the gender Role: \"Food is on the table the second I'm home, everything made from scratch and every Sunday it must be a roast\"\nAs a point to how stupid it is to say, \"but it's manly if you pay for it all'", "I see no semi-valid points.", "This is actually a really, really good point.", "He said it was but it was a fairly small amount. She's actually employed now and has more money", "👏🏾", "If she had to do all the womanly things, those manicures aren't going to last long.", "I applaud your response.  The sarcasm alone is just ...magnifique.  *chef's kiss* I believe is how it's put?\n\nNTA.  If your partner is going to be making good money than she can pony up.  If not she can move back where she came from.", "And she didnt have to. People acting like they dont have free will and choices here when you can say no.", "And he supported her when she could not support herself because of it. If a debt was owed, he paid it. At what point does she become responsible for herself again? Never?", "So now he has to subsidize her lifestyle indefinetely?? Is that seriously your argument?", "What a ridiculous comment. You sound a lot like OP's girlfriend. He didn't kidnap her and force her to move with him. He got a better job in a different country and she voluntarily chose to move there with him. The options were to go with him or end the relationship, and she chose the relationship over not moving to a different country. It kind of seems like OP making more money may have also played a part in her decision, but she's still the one who made the decision for herself.", "Yeah you’re absolutely right - it’s all in the way she used it", "She didn’t ask for him to pay 2/3 of the rent for a few months to build a safety net, she said she wants him to go back to paying the FULL rent “indefinitely.” Which we all know damn well means forever. You’re extending way too much grace here.", "You might be right. You are more trusting than I. I truly hope you are right.", "Really depends on what, if she gets apprentice wage then I wouldn’t be making her pay rent, she need some for the food but also need some for her", "Go work on your relationship, you sound quite nasty and bitter.", "He makes 2x more than her and he wants her to pay like 1/3 of the rent. He also said in the replies she's making enough to comfortably pay the entire amount on her own. Considering this fact, I feel like 1/3 is absolutely reasonable. Sure she needs her own money but if she can pay it all and refuses to pay 1/3, that's not very nice of her. I, although, would talk about it with her because she did sound manipulative with her reasons, and offer her to pay rent on my own for like three to four months so that she can create her own safety fund, and get her to contribute then. She gave up a lot moving to another country just to not lose OP, and he has to take that into consideration, so this safety fund would also let her not feel trapped in the situation they've ended up in. But she can't make him pay all the rent for years, that's unfair.", "But how does it compare to your salary?", "Then yes she should pay her fair share"]}