{"id": 26177, "submission_id": "169q16o", "title": "AITA for Ignoring My Dad After Discovering He Hid Another Family?", "selftext": "\nI (17F) recently found out that my dad (50M) had been hiding another family for years. My mom (50F) wanted me to forgive him, but I just couldn't bring myself to do it. To make things even more complicated, my boyfriend is friends with the girl who might be my half-sister, which is how I discovered the truth.\r  \n\r  \nSo, here's the deal. My family has already been a bit.. problematic. I knew my dad was a cheater, i have a whole list of things hes done, but a few months ago when my boyfriend casually mentioned his friend, let's call her Mack. He told me to add her on snapchat. I was confused and did. She told me I might be her half-sister. She even showed me her birth certificate.\r  \n\r  \nI confronted my dad about it, and that's when everything came crashing down. He admitted that he had been hiding another family for years and that Mack was his daughter from that relationship. I felt like my world was falling apart. My mom knew about this secret for years and had decided to keep it from me and my brother (20M).  \nThe worst part is, this affair must've happened as my brother was about 2. Mack is only a few months older than me.\r\r  \nMy mom wanted me to forgive my dad and try to accept this other family into our lives. She says that my dad made a mistake, and we should all move forward as a family. But I can't shake the feeling of betrayal and hurt. I feel like my trust in my dad has been shattered, and I can't just pretend like everything is okay.\r\r  \n\r  \nSo, AITA for ignoring my dad and not being able to forgive him?\r  \n\r  \nI'm torn between my mom's plea for forgiveness and my own feelings of anger and confusion. Is it wrong for me to want some distance from my dad while I process everything? I can't help but feel like the bad guy in this situation, but I'm struggling to come to terms with the enormity of what my dad did. What should I do?  \nI've had to talk and pretend im fine since it all went down. When i did ignore him, i felt like i was judged for it.  \nI havent spoken to Mack much because i feel like i dont belong.", "created_utc": 1693828517, "permalink": "/r/AmItheAsshole/comments/169q16o/aita_for_ignoring_my_dad_after_discovering_he_hid/", "score": 43, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i ignored my dad selfishly. i think i’m an ass for not wanting to forgive him.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nThis must be a really hard situation for you.\nAnd you can deal with it in a way that's best for you.\nI read that you have a therapist so that's good that you're talking about it.\n\nYour mom can't demand this from you. She deceived you and now you know (not even by them telling you but because you figured it out on your own), but it's your process how you deal with it.\n\nYour feelings are valid. It's okay to be mad and sad.  \n\n>Is it wrong for me to want some distance from my dad while I process everything?\n\nNo, absolutely not. It's actually really good to keep your distance for a while when you want to process things. And when the time comes, when you want it, you can talk to your dad. And your mom.", "NTA. Your mom was deceptive too and has no right to ask for your forgiveness. Take the time you need to process this; talk to a therapist or the school social worker. Work through your emotions, and grieve. When you’ve done so, evaluate with a clearer head whether to forgive him. You do not have to forgive this: this is a massive betrayal on his part, and you said nothing about his being remorseful. Remember that, if you do forgive, that doesn’t mean you have to keep him in your life.", "A mistake is something that happens and everyone recognises was wrong but it’s done. A deceit is an ongoing behaviour trait. \n\nA second family is not a ‘mistake’ it’s a deceit. When your parents say ‘second family’ is your dad actively partaking in a role in this family?! Why is your mother defending this? There is a possibility that your mother may have dependancy issues or something similar. This is not normal. NTA\n\nEdit spelling", "That’s a lot to process!  If you’re able to access therapy, that might help you work through how you feel and start sorting out what you want.  Given that big shake-up of your life, it is absolutely okay to prioritize your mental health and ask for some space to process.  NTA", "NTA i would be so pissed if i was u ong", "NTA.\n\nYou're on the edge of becoming an adult, meaning that you're old enough to decide who you want to associate with, and that includes family.\n\nYou're not obligated to forgive him, or to interact with the family both of your parents hid from you your entire life. Being related does not give someone a free pass to your forgiveness.", "NTA\n\nFirst, your mom needs to back off. She’s had nearly 20 years to process her emotions, you’ve had all of 20 seconds. Second, I imagine the three of you (you, Mack, and your brother) being PISSED at the degree and habit of lying the adults had to carry on all these years to keep you three apart. To know the adults were involved in actively hiding these siblings from each other is vile. You missed out on years of love, connection, and friendship (as well as squabbles and awkwardness) because of the adults in this situation. Your mother is lucky your ire hasn’t included her yet (but should definitely remain primarily on your dad). \n\nAlso, if he’s willing to hide the existence of at least one child, I suspect there are more (or will be).\n\nGood luck.", "NTA your family needs to give you time to process this whole mess. If your mother already knew, that means she already had her struggles and processed them. You just found out and it's all new to you. You have the right to process all of this shit.\n\nGetting out of the moralistic realm and into a more pragmatic one now. It is probably best if you don't fight against the current. If everyone else is going to accept this other family, this might isolate you from the rest of your family.", "NTA.  This is an unprecedented situation.  I think you have to handle it without your mother or anyone else weighing in on it.  No one has walked a mile in your shoes, and the fact that your mother has forgiven your father is irrelevant.  Let yourself be your guide - if you feel angry and confused, be angry and confused.  The only negative thing you can do right now is to ignore your feelings and \"forgive\" him.  Good luck.", "NTA but this kind of anger, hurt, and resentment can just end up eating you alive in the long run, and why do that to yourself?  Let your father shoulder his deserved guilt (if he’s even capable of it).\n\nProtect your mental health and well being.  I’m not saying ‘right now’, but you can talk to your dad and figure out your new normal.  You definitely don’t have to believe anything he says and forgive him (I suspect he’d just evade the truth and gaslight you anyways), but if you can approach it as doing it for yourself I think you’ll navigate this awful revelation with better outcomes.", "Info.  Your father kept this from you.  Mack’s parentage is apparently public, but has she always know?  Your mother knew at some point, but when?  Did your parents jointly decide to keep this from you and your brother, or did one parent demand it of the other?  Your discomfort is valid.  NTA.", "NTA. You absolutely need time and distance from him (and your Mom) while you process this. You also need help to process it. Talk to a counselor at school. Get a referral to a therapist. Don't just talk to your friends. They are ill-equipped to help you through something like this. Your brother needs the same. \n\nBest fortune to you. I know it feels absolutely crazy right now, but you WILL come out the other side of this. Listen to your heart.", "Your parents are both the ass, not you. You have every right to be upset and should give you time to even process.", "1.  You are under no obligation to forgive your father, his actions were at best despicable and the fact that he hid it from you for SEVENTEEN years shows he knew what he was doing was wrong.\n\n2.  Your mother has no right to push forgiveness since she decided to go along with this lie.  The moment she decided to help your father made her no longer the victim and just as guilty as your father imo.\n\n3.  You can’t pretend like everything is okay because it is not okay.  This is a huge punch in the gut and it’s not fair for everyone to expect you to just go back to some semblance of normal.\n\n1000000% NTA.  Your parents have some nerve!", "NTA. \n\nSomething like that is not a one time “mistake” it’s a LIFETIME of lies. It’s a whole fine and well that your mother forgive him, but that does not mean you have to. My dad tried so hard to force a mother daughter relationship between me and his affair partner. He overlook all of the terrible shit she didn’t said to me just because he wanted a happily blended family. Feel how you feel and fuck them for trying to guilt you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (17F) recently found out that my dad (50M) had been hiding another family for years. My mom (50F) wanted me to forgive him, but I just couldn't bring myself to do it. To make things even more complicated, my boyfriend is friends with the girl who might be my half-sister, which is how I discovered the truth.\r  \n\r  \nSo, here's the deal. My family has already been a bit.. problematic. I knew my dad was a cheater, i have a whole list of things hes done, but a few months ago when my boyfriend casually mentioned his friend, let's call her Mack. He told me to add her on snapchat. I was confused and did. She told me I might be her half-sister. She even showed me her birth certificate.\r  \n\r  \nI confronted my dad about it, and that's when everything came crashing down. He admitted that he had been hiding another family for years and that Mack was his daughter from that relationship. I felt like my world was falling apart. My mom knew about this secret for years and had decided to keep it from me and my brother (20M).  \nThe worst part is, this affair must've happened as my brother was about 2. Mack is only a few months older than me.\r\r  \nMy mom wanted me to forgive my dad and try to accept this other family into our lives. She says that my dad made a mistake, and we should all move forward as a family. But I can't shake the feeling of betrayal and hurt. I feel like my trust in my dad has been shattered, and I can't just pretend like everything is okay.\r\r  \n\r  \nSo, AITA for ignoring my dad and not being able to forgive him?\r  \n\r  \nI'm torn between my mom's plea for forgiveness and my own feelings of anger and confusion. Is it wrong for me to want some distance from my dad while I process everything? I can't help but feel like the bad guy in this situation, but I'm struggling to come to terms with the enormity of what my dad did. What should I do?  \nI've had to talk and pretend im fine since it all went down. When i did ignore him, i felt like i was judged for it.  \nI havent spoken to Mack much because i feel like i dont belong.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nand you are not the Bad guy here. Your Mum is for knowing and saying nothing\n\nIf you need time to process then take it, your anger is understandable.", "INFO\n\nWhy aren't you mad at your mom too? She knew and decided to forgive him. They both didn't keep this secret from you", "NTA, but you should eventually find a way to have some kind of relationship with him. With whatever arms length distance you need. When you are a child  parents feel like they will always be there. Time has other plans for them and eventually options are taken away from us.", "You have every right to your feelings. This is a huge blow to your life and everything you know. You don't have to feel bad,you don't have to be understanding and you don't have to forgive him. You can feel however you feel and it's okay. I'm sorry you're going through this.", "NTA.\n\nYou need time and therapy to process this and it’s okay to ask for some distance from your dad while you process this. Your therapist could have your parents in for part of a session  to support you in making this request. \n\nThis is an unexpected disclosure which definitely rearranges the picture you had of your family. It is a lot to deal with, for sure. But you are also catastrophizing a bit. \n\nRegardless of the circumstances which led to Mack’s conception, that was an issue between your parents and they dealt with it as a couple almost two decades ago. You need to learn to respect that. You weren’t betrayed by your dad; when you weren’t even conceived when it happened. You need your therapist to guide you through exploring and sorting out these feelings.\n\nYour parents’ decision to not reveal to you that you had a sister may not have been the best decision but maybe it was for them. I think you’re old enough to have a therapist assisted discussion with them about that aspect of it. Your parents are the same people they have always been. But now you know more about them.\n\nI think you misunderstand what having a second hidden family means. Is he living with them part of the time? Is he still in a romantic and sexual relationship with Mack’s mom? Does he support them beyond paying child support? Does he go on vacations with them? If not, they’re not his “second family”.", "Wow.  Your parents are the assholes here, not you.  What a mindfuck.  Hope the best for you.  NTA.", "NTA just because your  mom forgives him (and hides this shit) there is no reason for you to forgive him", ">said he made a mistake\n\npray tell, how does one mistakenly impregnate a woman, hide that pregnancy, and then hide it for another 20+ years? that's deliberate effort, that's no mistake.\n\nor was the mistake mack? \n\nyour mom sounds like a battered wife. you only need to listen to stories about women who have been cheated on during pregnancy to know that NO person would be okay with forgiving and forgetting unless they're financially dependent or abused.\n\nNTA. Ignore him until he's dead. No good man hides a child from their siblings for that long and just expects you to be okay with it. You are not your mom, you don't need to forgive him.", "so many toxic ppl telling you to ‘be mad’. lol \nummm \n\ngirl process your emotions how you feel, if u need therapy then i suggest you do so.\nthis can help you process everything.\ni find it so delusional people telling you that you don’t need to be apart of the family ect ect.\n\nyour 17 \nyour so young, you will be apart of the bigger family. you already feel left out.\none day when you have the right therapy and space and time and ur ready . you will embrace this as your normal.\n\nit’s done now. the past is the past you can’t undo it.\nyour dad will never be trusted and u will be hurt and mad at him for ages. but healing comes with time and therapy and acceptance. don’t let anyone ruin what could potential be a beautiful family in future.\ndon’t let people keep you hating.\nthat’s so toxic", "NTA. Deception is a deal breaker, a fatal flaw if you will. For me, there is no going back or having a relationship with the deceiver(s). How do you trust anything they do/say.\n\nThis happened to you, not because of you. Hold your head up and find people you can trust.", "NTA\n\nThis is something that just happened to you. You're reeling with the shock and trauma of discovering so many layers of deception in what you up until now believed about your family. Your mom may be willing to rug sweep, but that does not create an obligation for you to negate YOUR feelings. She's been complicit in this deception. That complicity and her current insistence that you just not feel and react about this situation are hurtful and imo emotionally abusive.\n\nI can't imagine the hurt, betrayal, confusion and upheaval of your world you must be feeling now. All of your feelings are valid and grounded in reality.", "Im lucky to have an amazing therapist, but i feel like i just need confirmation about my feelings yk?", "Totally.\n\nYou’ve just had your understanding of who your dad is and how you fit in his life upended.  That’s a lot to process, and you deserve some space to figure out what you need, what you want, and how you want to communicate those things to him and anyone else in your life affected by this.  I think it’d be healthy to tell him that that’s what is going on, so he understands that you‘re not punishing him, you’re just working through things.\n\nKinda like how there’s a difference between giving someone the silent treatment to punish them and asking for some space because you’re having big feelings you want to sort through before you talk again.  Punishing with the silent treatment is an immature and unhealthy way of dealing with conflict, but taking space to sort out your feelings can be a very mature way of keeping conflict under control."]}