{"id": 26216, "submission_id": "16a7ogr", "title": "AITA for not paying my dad for labor for an addition he is putting on his house?", "selftext": "My dad is putting an addition on the house he grew up in and I am paying for the addition - I do not own the house but I will be renting it when it is done and it will be willed to me when he passes. I have around 20k in the house right now and will have another 15k in it by the time it is done. He keeps saying shit like “wait till you get my labor bill” and make other off hand comments about how I’m not paying him for his labor to do this but to me it seems like I’m taking all the risk here. I’m paying for the material he’s using to add onto a house that he owns and I have no legal protection to get that money back if something happens. I point this out to him and he says “yeah but you’re getting it when I die.” I talked to my mom about this and she said she sees both sides. She sees where I’m coming from in not technically owning the house but she says he would usually get paid to do this or could pay himself if he took out a loan. I’ve been debating cutting him a check for the labor when it’s all said and done but the more I think about it the more I don’t think I should, AITA?", "created_utc": 1693870004, "permalink": "/r/AmItheAsshole/comments/16a7ogr/aita_for_not_paying_my_dad_for_labor_for_an/", "score": 116, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I am not going to be paying for the labor\n2) I’m not paying for the labor on something I will benefit from\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n&#x200B;\n\n\"I do not own the house but I will be renting it when it is done and it will be willed to me when he passes. \" .. but this is bullshit. YOu opwe nothing, and the money is gone.\n\n&#x200B;\n\n&#x200B;\n\n\" “wait till you get my labor bill”\" .. tell him to send it to the owner of the house.", "NTA\n\nYou don't own the house, so it's not your job to pay for it. You're already paying for the materials. You've put 20 thousand into a house that isn't even yours. Then he expects you to pay him? Nah.\n\n>wait till you get my labor bill\n\nTell him to bill it to the house owner.\n\nWas he the one who wants to add the addition?", "I don’t think you should pay him more than you already are. He wants an addition to the house he is living in. You’re paying for the materials. You do not currently own the house. End of story. Your dad wants you to pay him to put an addition on his own house? That is crazy.", "NAH\n\nYou don't sound like you have an agreement in place for any of this and you're both improvising and muddling through it.  Ask him what he needs.  Create an agreement that is reasonable for both parties.  Live with that.   But this vague misunderstanding is not healthy for your financial future, his, or your relationship.   Talk it out.  Get a contract in place if you have to.   You're misunderstanding each other and that's a bad place to do business", "NTA. He owns the house, you’re paying for the addition. Tell him if he’s being serious you’ll find somewhere else to live", "INFO: did you want the addition? I don't really understand that from the post. It sounds like your parents already see it as your house, so I'm not clear on why the addition is being built\n\nIf you wanted it and asked him to do it, then Y-T-A\n\nIf you wanted it and looked for third-party contractors, but he insisted doing it, then E-S-H for poor communication\n\nIf he is doing it as a project to his own house without your input, then obviously N-T-A", "You should have a lien on the house to the extent you are funding improvements, at a minimum.  In case the will somehow forgets your contributions.", "INFO: is he serious about billing you for the labor or are you overthinking this? When you say you'll be renting the place, do you mean you'll be paying to live in it or collecting money for other people to live in it?", "Info how sure are you he wasn't joking until you started to turn it into a real convo? my dad makes jokes like that all the time and will joke right up until the last second", "Info — are you doing anything for him? Dinner, drinks, tickets to a game/show, new grill?", "Right now, you’re paying a lot of money for something you don’t own and have no guarantee of owning in the future. And, then you’re going to rent what you just paid for. Wondering if your $20k could have been spent differently? You’re getting no equity, but you will almost be guaranteed a large headache. \n\nESH. \n\nHave your dad put your name on the deed *NOW*.", "I'm worried that we'll be seeing a follow-up post in a few months saying, \"My dad agreed to let me rent a house that I paid to have renovated, then sold it behind my back. I'm out $30,000. Do I have any legal recourse?\" You f\\*\\*\\*\\*\\* up. Get something in writing NOW.", "YTA.  So, you’re paying to build an addition on to your parents’ home, so you don’t have to move out into the real…really, really expensive real world…is that about right?  You’re only paying for materials, so did you think it was going to build itself?  Do you know how expensive labor is?  Your father is putting in labor as much as you’ve put in material.  As you said, you’ll get it in the end so consider it an investment in your future.", "You entitled little boy.  Honestly, I hope your father decides to rent it to someone else.  YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy dad is putting an addition on the house he grew up in and I am paying for the addition - I do not own the house but I will be renting it when it is done and it will be willed to me when he passes. I have around 20k in the house right now and will have another 15k in it by the time it is done. He keeps saying shit like “wait till you get my labor bill” and make other off hand comments about how I’m not paying him for his labor to do this but to me it seems like I’m taking all the risk here. I’m paying for the material he’s using to add onto a house that he owns and I have no legal protection to get that money back if something happens. I point this out to him and he says “yeah but you’re getting it when I die.” I talked to my mom about this and she said she sees both sides. She sees where I’m coming from in not technically owning the house but she says he would usually get paid to do this or could pay himself if he took out a loan. I’ve been debating cutting him a check for the labor when it’s all said and done but the more I think about it the more I don’t think I should, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Let me get this straight. Your dad is adding onto HIS house, on HIS own will, yet using YOUR money, and is expecting you to pay him. You’re literally his child, not his employer", "NTA it's his house!!! The fact that it will be willed to you at some point is entirely irrelevant. He wants you to pay for the addition AND pay him for labor to work on his own house! The entitlement is mind blowing. I'd be tempted to pull out all together.", "NTA if you pay for the labour, then don't pay rent. I don't see how dad thinks he gets it both ways?", "I mean he could live until he's 100 years old, so him saying you'll get it when he dies doesn't mean shit even if it is in a will. NTA. He can use your rent money to recoup \"labor cost\" on his own damn house.", "NAH yet. You guys really need an agreement here. You have no ownership for a large chunk of money. Yoiu are paying market rent. The get it when he dies line - that could be decades, and the equity in the house could well be needed for their aged care. Meanwhile you could better use that money for your own home buying or living expenses, or investment for your retirement. Its 35K now but labour may easily double that \n\nmight nit be a comfortable talk but needs to happen around estate planning.", "Maybe NTA, but definitely clueless. If you are certain that the property will be bequeathed to you, then the value of the estate will surely far exceed the cost of your father's labor. Your Father! Pay up.", "How much below market value are they charging you for rent? He says he is going to put it in his will. But he could put it in your name right now and you could still pay him a monthly payment either as an annuity (below the mortgage rate) or to pay off a mortgage (at the homes value b4 the remodel). You need to get your mom involved or you could be out in the cold with nothing. You at least need to have it in writing for what you expect to get. He could go bankrupt nin 3 years and you get nothing.\n\nNTA", "He’s been wanting to do it for around 20 years. I offered to pay for it if he let me rent the house.", "Only point of correction for clarity, he does not live in it. He was renting it out previously and I will be moving in once it is done and paying rent.", "It’s something he had been wanting to do for about 20 years. I offered up the money if he would let me rent it out and since I knew I was suppose to be getting it when they pass. He’s a construction worker by trade so a contractor was not under consideration regardless of who was financing it.", ">  *In case the will somehow forgets your contributions*.\n\nIf for some reason your parent(s) spends a long time in a nursing home, and runs out of funds, then the house will be taken by medicaid in the US.\n\nYou are putting yourself in a precarious position here by paying so much for a house that you don't own.  If you really plan to do this (can't resist shouting) SEE AN ATTORNEY AND GET THINGS LEGALLY IN ORDER.", "Tbh I’m not sure if he’s serious, he says it and I rebut it and he doubles down and typically ends with “you just don’t get it” so I honestly can not tell. Haven’t really had acknowledgment that I’m paying for the addition either and saving him from having to pull equity from his house and pay interest to finance the project. It’s entirely possible that I’m over thinking it but it has also given me a complex that I should pay him - which I why I made the post. \n\nI will be renting it, so I’ll be living there and paying them rent.", "I live at home with them, buy a few hundred in groceries every month for my parents and older brother.", "He agreed with my grandfather to never sell it and keep it in the family. I understand the weakness of that in reality but that situation was accounted for in my calculation of this.", "Yeah no, I could live on my own financially independent of my parents if need be. This is a house my grandfather made my dad swear to keep on the family and I have no problem helping keep it up to date and live in to honor that. The problem I have is coming back and asking for labor as if I’m taking advantage of a situation when he had already said the work should have been done two decades ago and I have received no recognition that they are being saved from paying interest on this project since we went this route.", "Yeah, I’m sure he’ll have no trouble finding a tenant who’s willing to pay $20K up front (before they even start paying rent) for their landlord to build the place they’re going to be staying in. People will be lining up around the block for that deal, I’m sure.", "Thanks for the input", "“Entitlement is mind blowing” \n\nHe is a boomer…😂", "You should talk to a lawyer to protect your interests. Maybe have your name on the deed also, or if he really wants paid and not give you protections a lawyer may advise you to put a lien on the home. But start with asking your dad why you just can't get it now with you purchasing it a  value that they need to live. If he's bullheaded go to mom . If that doesn't help go to a lawyer.\n\nNTA", "Then there ya go. You're fulfilling your end by paying for the addition. Not to mention, they're making more money off you afterward. Asking you to pay labor for his own house is ridiculous.\n\nWith how much money you've put into this place, I would get something in writing that says it will be given to you, or acknowledging you have money put into the house.", "It’s still a house that he owns. You don’t owe him for any more than you’ve already given", "It's really hard to judge without more specifics; this context on its own is necessary to judge the post and it's probably still not enough\n\n\"I offered up the money if he would let me rent it out\" - for the materials, or the full job? What was your agreement? I'm leaning towards NTA here because I'm guessing you offered to pay for the materials so that he could do the job that he has been wanting to do for 20 years, but you also mention that he could have taken out a loan to pay for the job himself, which would presumably be paid back by increased rent revenue - is he giving you a lower rate compared to the what he could have gotten with other tenants?\n\nMy gut says this is all way too transactional for a familial relationship so you're NTA, but I don't know your circumstances", ">I will be renting it, so I’ll be living there and paying them rent.\n\nThat settles it. HELL NO, you don't need to pay him for his labor. Even paying for the materials for the addition is taking a liberty in my opinion. They own the house, the equity is theirs and they're asking you to subsidize it, and THEN pay for the privilege of living in a house you'll \"get when they die\". \n\nIf one day their fortunes change and they decide to sell the house out from under you, guess what you get? Sh\\*t. You have no security here.\n\nNope. NTA", "That’s for your family. Are you doing anything for him? \n\nYou’re treating this like there’s a legal contract here. It’s your father. You bought the stuff & now he’s helping you put it all together. Period.", "I hope it works out, but I’ve read similar stories on here on Reddit that did not turn out well. He might sell it to “enjoy his retirement years” and even con you into letting him live there tent free.", "Have you ever lived financially independent on your own, outside of your parents’ home?", "Fair enough, I agreed to pay for the addition onto the house but that’s as far as it went in the “agreement”. Labor reimbursement was not mentioned at the start and was not brought up until the addition was under roof. \n\nThe rent part is tricky because he had been renting it out to a lady for about 12 years for $400/month. I’ve agreed to pay 600/m and the addition will bring the house size to around 1,000 square feet. He’s getting more than he was before and not having to foot the bill for material but the rent in both cases is less than market so not sure how to shake out the fairness level on that part.", "I mean I’m not sure what I could be doing for him outside of buying food for him, his wife, and other son that he would otherwise be paying for. I could pay for a football game but that doesn’t seem practical in a helpful kind of way that would equate to what is being done on the house.", "No but I know what I get paid and I know what it costs to live in my area. \n\nTake care ;)", "Like I said, for me this transactional dynamic among family members is not productive under any circumstances, like that's now how familial relationships should work, but I understand that I am not everyone\n\nMy dad always said to me, \"Is it more important to be right, or to preserve the relationship?\" when it came to family. I think you are \"right\" in this scenario, but I also have absolutely no idea how to answer that question for you - sometimes we make concessions for family, but at the same time you need to put your foot down when you are being mistreated. \n\nI'm not going to tell you what you should do because, like I said, I feel like there are probably decades of context here that I don't understand. I do get a sense from this very short interaction with you that you are very thoughtful and will 100% do what's best for you, whatever that decision may be", "That’s the whole point. Acknowledging that he’s helping you. You probably couldn’t do this by yourself & wouldn’t have the opportunity without him so appreciate that.\n\nYeah, take him to a game. Show him how much you appreciate his help.", "Yeah.", "This is probably the most insightful reply I’ve had. Fair enough and thank you for the input. \n\nBe well", "FWIW I did intend to take him to a NFL game soon regardless. However, this seems as if this is presenting the situation as a lop sided agreement or I’m unfairly benefiting. If I had not paid for this then he’s have to take out a loan at, going by current rates, around 7% interest to get the project done. He is helping me but I am also helping him by not charging for him to use my money.", "Well you asked him to do this for you because you didn’t want to wait to inherit. \n\nSounds like he’s losing rent money right now if no one is living in it. \n\nIf you waited until you got it in the will you would have paid a contractor for material & labor. Now you’re paying for materials & paying your Dad rent for the mortgage on a house you will own. \n\nI think it’s a wash. You’re pretty much both even.\n\nNAH — if you’re really worried about his comments then just talk to him. Ask him the question... what would your labor bill look like if I were a stranger?\n\neta — if he took a loan he would pay himself back the labor & interest with the sale/rent of the house.", ">I talked to my mom about this and she said she sees both sides\n\nThey always say that. It's a cop out.", "NTA. \n\nI was in your shoes. I put $100k in to the house. I did not get the house because my family members are selfish dicks. \n\nDon’t put any more money in to it. Trust me.", "NTA but he will screw your over. You’ll see", "NTA, listen up now!!!!! If you are going to be renting the house after the addition is added, you dad will be able to write all the expenses off on his taxes…including the cost of materials.  He’s taking you for a ride.", "YWBTA if you are not going to pay market rent.", "your nta for not wanting to. but id say pay him something even if he doesnt ask. dont break the bank or anything. or like take him out to dinner or get him some sort of vacation package. i mean odds are when hes saying stuff like that hes joking or something. i guess it could not be that, not like i know him or anything. but idk. i feel like this board discounts family a lot. like yeah you dont HAVE to do stuff for family. but its cool to do sometimes. idk ima stop now.", "You have got to be kidding. If he expected to be paid that should have surely brought it up before this happened. You don’t mention it after the fact. NTA.", "NTA\n\nYou are paying for an addition to a building that he owns. So what if you will be renting, as your dad may live for what? 20, 30 or more years to come? And its possible your dad could sell the house in spite of you living in it. A promise to have it willed to you after death is meaningless until that event happens.\n\nNot knowing your dad's financial status, but if he is doing the work and you are paying for it, Im guessing he isnt loaded. The more time goes by, things could happen that could force your dad to sell. Could even be medical issues as he ages.\n\nGranted, these are worse case scenarios, but fact of the matter is, as your mom said, he could take out a loan to do this if he really wanted. That includes for the materials you are paying for. He still gets all the money for the value of the house if he sells it.\n\nPersonally, I would tell your dad to quit his bitching since you have spent so much on this, and are going to be paying him rent (I hope you already agreed on an amount). I would also somehow tell him that it should be in writing that he will not sell the house that you (and possibly wife and kids) will be living in.", "NTA. You knew he wanted to build the addition for a long time, and you offered to cover the cost of the materials if he let's you rent it from him. That would have been a win-win for the both of you. He didn't have to take a loan, and you would have a place to live with a bellow market rent. At this point, asking you to also pay for the labour, he seems greedy. \n\nI hope he doesn't screw you over when the addition is done.", "Don’t cut him a check unless he adds you to the title or meets with a lawyer to formalize your “inheritance”. If he didn’t want to build the addition, he didn’t have to.\n\nNTA", "^^^^^^This", "Lol a lien for what? OP isn't being repaid. This isn't a loan. The laborer puts liens on for non-payment but the dad owns it so he'd be just messing with himself.", "ESH because of this.  Family feuds are borne of miscommunication.  What's the rent going to be?  Is it the friends and family rate or top of the market? All this stuff should have been discussed before the first nail was driven. \n\nI have a friend with no money whose Dad who she took into her home and took care of for a year until he passed left his house to her older brother.  He agreed to rent it to her.  It is a bleeping disaster full of termites and roaches and Dad was just shy of a hoarder.  What a bargain!", "I hope all the money you gave him for the house is documented and signed off by him.  Do you have brothers and sisters?  Do they understand and agree to this arrangement?  What happens if he changes his mind and wills the house to someone else?", "I hope that the money used for the addition will be counted toward rent.", "NTA but agree to pay him if and only if he puts you on the deed as co owner now.", "Op....I'm kinda struggling to figure out how y'all spent 20k on materials for an addition with no labor costs....  \n\n\nNo matter, tread very very lightly with this; you shouldn't have signed up for this deal without legal paperwork, and he shouldn't have either.  Paying  that much for the privilege of renting doesn't make a lot of sense.", "Why would you pay rent? Didn’t you just contribute tens of thousands in rent?", "You can put a lien on a house for improvements you paid for and weren't paid back for. As long as she has the receipts for materials, that's all op needs. Car finance companies and credit cards do this all the time to recoup their money. Whether they get their money now or later, the lien has to be paid to the proper holder before proceeds of the sale are paid. If a third party can prove improvements were supplied or performed, they are most definitely entitled to the additional value of the house it provides, with increase of profit from a potential sale years from now.", "Labor is part of the cost of the addition though. Seems like a miscommunication. Why wouldn't he be paying for the labor of he's paying for the addition?", "You're not supposed to get paid back unless it's a loan.  OP said they'd pay for the improvements, not loan their dad funds.  OP has no basis for the lien.", "For the same reason that nobody pays you when you paint a room in your house or upgrade the stereo in your own car. It’s his property. He’s making an addition because HE wants it. He evidently has the skill to do it himself so he didn’t hire out the work. OP certainly doesn’t owe their father money so the father can get equity that doesn’t benefit OP at all except hypothetically. When the addition is done, OP will owe rent. They already when above and beyond paying for the materials.", "Wait, he has another son? So by him leaving  you the house does it mean it’s being left to you and your brother? Also how old are you and how old is your dad?"]}