{"id": 26223, "submission_id": "16ac7fm", "title": "AITA for saying I'm turned on by my girlfriend's biceps?", "selftext": "It's really confusing to me. She(18) recently asked me(19m) which part of her body turns me on the most. I didn't think before saying that I find her biceps the hottest part. Never told her that before but I've always been turned on by her muscles. My gf is  muscular from lifting weights. She looked really disappointed by my answer though.\n\nTold me that I gave her a 'weird' answer and should have said her boobs or her ass like a 'normal' guy, and that choosing her muscles made her feel 'masculine'. Was I the asshole?\n\nUPDATE : Just talked to her half an hour ago. I told her that I find her whole body attractive, including her boobs and butt. She said she was worried she's not curvy enough so I told her that that's not the case at all. She was also caught off guard because she didn't think a guy would find muscles on a girl sexy, so I reassured her that I meant what I said and also told her that her dedication to weight-lifting is also attractive. We are good now.", "created_utc": 1693882208, "permalink": "/r/AmItheAsshole/comments/16ac7fm/aita_for_saying_im_turned_on_by_my_girlfriends/", "score": 626, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I suppose I might kind of be an asshole because my comment made my girlfriend feel like I see her as a masculine figure?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. She asked, you answered. Looking a little deeper, though, it sounds like she was looking for reassurance about her femininity and rather than a direct answer to her question.", "NTA.  She can be disappointed at the answer of course, but to tell you that you should respond like a “normal guy” is an AH way to show that disappointment.  If she was fishing for specific compliments she should’ve used better bait.", "I don’t think you’re the a-hole here lol, just explain you were trying to genuinely answer instead of altering your answer to make her happy", "NTA. She asked a question and you answered truthfully. Sounds like a her problem. If anything she’s TA here and should reflect on why that answer is ‘weird’ to her.\n\nAlso this is just one of those questions that is a trap all around. If you did what she said and replied “boobs or ass” then you’re a typical man and only care about one thing, if you said her brain or personality related then clearly you don’t find her attractive, or you answer genuinely and it isn’t what she wanted you to say.", "NTA - Your GF put down a landline and you stepped on it.\n\nFYI - The safe answer is “your brain”", "NTA. You were being honest, nothing wrong with loving every part of her being.", "NTA\n\nwomen have been valued on their butts and boobs for centuries. We’re so used to being objectified for those parts, that it’s almost disappointing or hurtful when someone doesn’t focus on them.  \n\nIt’s AMAZING when guys see us beyond our “junk”! But it’s not the norm, so it feels uncomfortable to us, which often leads to the conclusion that you find our boobs and butt Unattractive. Like in her head she may be thinking “oh god my body is so bad that my biceps were the only thing he could think of”. \n\nReassure her that her whole body is sexy and amazing, but her biceps are just icing on an already perfect cake!", "NTA\n\nYou aren’t a mind reader and you answered honestly. This is just immaturity on her part.", "NTA\nAll these comments about “oh, you should have just said her boobs/brain” are goofy asf. Y’all are both adults- it’s simple. Don’t ask questions you don’t want answers to. Her lack of not feeling feminine is not his issue/cross to bear.", "NTA. So she lifts weights to build muscle then gets offended and insecure about it? Apparently she’d rather be objectified", "This is why I’m gay", "NTA. \n\nAlthough this is hilarious.", "Pfffftttt… NTA. My gf is jacked and loves these kind of compliments 😂", "NTA\n\nShe asked you a question and you gave her the most honest answer possible, the one that came right to your mind. No filter, just go. She's entitled to not LIKE your answer, but you're not an ah for giving it.", "NTA. In fact she's a bit TA for shaming you for what you like...", "Female biceps are hot tf is she on?", "You’re not an asshole you just didn’t say what she wanted to hear lol.\n\nShe was prob looking for a self esteem boost and tbh I get it biceps is kind of different answer.\n\nYou can’t backtrack now…..verbally", "She built a great physique but probably hasn't accepted it completely.", "Go figure you  were not objectifying her gender and you get dinged. Validating her personal success is what partners do for each other. Body parts we are born with, while very cool, are not earned. Indicate you know she has amazing features but you wanted to let her know you also noticed her personal  goals are being met, and makes her even more attractive for you.", "NTA - but if I had to guess, your use of \"biceps\" sounded very masculine to her and she didn't like it.\n\nPerhaps if you said her \"sculpted\" arms, which is the feminine version of muscular arms she would have been happier, IDK.\n\nShe's young, and navigating your feelings is hard. Hopefully she'll grow and learn to articulate her feelings (or at the very least, not to ask questions she won't like the answer to).", "Nta people have their likes and dislikes and one of your likes so happened to be muscles", "Loaded question from someone with self esteem issues, there is no correct answer.", "NTA\n\nI’m a pretty muscular girl and if I had asked my boyfriend that same question and he had replied with your answer I’d be flattered (because I work so hard in the gym) but I’d also be a little disappointed too. I want my boyfriend to think my natural assets are hot as well. \n\nThat being said, she asked, you answered honestly. Nothing wrong with that. If she wanted you to say boobs or butt then she should have asked that question more specifically", "Nta. Im with u on muscles on women .. my wifes muscles are hawt as fuck", "My suggestion is to reassure her by stating that her dedication to self-improvement is how you meant it. The muscles are the evidence of her time and effort.\n\nNTA, but it's probably better to show a little compassion towards her insecurity.", "Yeah, no. She's being completely irrational, she asked a question, you gave the answer. That's all there is to it. Bro, don't ask the question if you don't wanna hear the answer to it. Anyway, she'll live, you like her arms, it is what it is. Why is she even lifting if she's gonna complain that other people like her muscles. I'm pretty sure you like her ass and boobs too so she'll get over it. Y'all are young, maturity comes with time and life experience.", "Nta. I hate when ppl ask a question then get mad when they get an honest answer. Besides that, her answer is as sexist as she thinks your answer should be. She could have said eyes or hair. Nope. But i bet if you had said boobs or ass, she would have acted offended. What an odd question to even be asking, let alone having a set of answer that you think they should pick from.", "NTA. \n\nBut while your girlfriend asked “what part of me turns you on the most?”, from her response it sounds like what she was really saying was “I’m feeling insecure and/or unfeminine and want to feel pretty and attractive”. \n\nI’m sure you’ve noticed society mostly says muscular women are not attractive or are masculine. \n\nYou could tell her something like “your boobs and ass are amazing, but you asked what I find the hottest and it’s your amazing sexy muscles.” Then maybe tell her why you find her biceps sexy. It might help her feel both muscular and attractive. \n\nAlso, you’re both young so you’re figuring out this communication thing. But it might be a good chance for a conversation about how you communicate and about asking for what you want and need. It’s not to blame or shame either of you, it’s something all adults continually need to work on. But developing those good communication skills will only help you in relationships down the road!", "Best update, you two sound so sweet, NTA", "NAH. \n\nYour update shows that you two communicate well for such a young couple, good on you guys", "Personality. That's the right answer. Also, NTA.", "NTA me personally I'll leave her just for that", "Should have never answered that question.", "NTA 100% you answered honestly which sometimes isn’t what women are looking for. Sometimes a girl will vent and rant about something in their personal life, and even tho as guys we tend to think more logically and provide solutions that’s sometimes not what they want, they just want someone to validate how they are feeling in the moment. For the future just say multiple things my guy it works the best. Instead of just biceps be like, your ass when you wear leggings turns me on when you wear a tight fitted shirt, and when you wear a shirt that shows off your biceps all of those get me going to no end. Cover all angles homie.", "What? When I was young men were always telling me (with no prompt cos I didn't ask) that they liked my tits and/or eyes.  I would have loved if they mentioned something that was the result of a load of hardwork in the gym. It was actually my platonic friends who would compliment my biceps and I loved it.\n\nDid she definitely word it \"which body parts turn you on the most?\". I am wondering if you heard it wrong and missed some nuance. If she really did ask about 'body parts' maybe she would have felt a better if your reponse was a little more balanced eg \"I find your whole body so incredibly beautiful. Strong curves are so sexy. If you forced me to pick one single thing...I find your powerul arms a big turn on but you are a completely gorgeous woman in every way\". \n\nBut, maybe there is something else going on here? Maybe someone else made her feel insecure about her feminity on that day? You are both very young and she might still be figuring out her feelings about a lot of things without communicating it well.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIt's really confusing to me. She(18) recently asked me(19m) which part of her body turns me on the most. I didn't think before saying that I find her biceps the hottest part. Never told her that before but I've always been turned on by her muscles. My gf is  muscular from lifting weights. She looked really disappointed by my answer though.  \n\n\nTold me that I gave her a 'weird' answer and should have said her boobs or her ass like a 'normal' guy, and that choosing her muscles made her feel 'masculine'. Was I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I would go with something like: \"I love your tits and your ass. They look amazing. But, I choose your muscles because you earned them. I think the work you put into toning them and strengthening them makes them so hot and your hard work paid off because you get to be both sexy and strong. I guess I'm not a normal guy and maybe you will like that when I'm stroking your sexy biceps and normal guys are out chasing all the tits and asses in the world\"", "I like muscular women and fem men and enbys too 🩷💛🩵, and everything in between. I'm not weird for that so don't let yourself feel put down for what you LIKE about your partner FFS . NTA", "NAH. You're young: it takes time and experience to grapple with these situations. \n\nI have a back that looks muscular even when I haven't been doing weights. As a teenager I was the only one who didn't put something neutral like \"eyes\" into the box for saying anonymously what you like about yourself. Everyone thought that was super weird when it was read out, and I felt very small.\n\nSeems like a non-sequitor, but my point is that now (late 30s), I laugh about that, and still love muscularity (on myself and others). I can definitely see how it felt like a non-sexy answer for an 18 yo woman. Biceps specifically are something women can get harassed about being \"too masculine\" when they're defined. \n\nI'd just revisit it and reiterate that you find *her* sexy - including her butt and boobs (I assume), and the fact you love her biceps is an extra, not an instead-of.", "She's probably low key wondering if you're gay. Just say'n.", "NTA \nShe asked for your opinion.", "She dosnt understand muscle mommies yet. \nMuscular mommy thst can make you melt with a touch and make you feel safe.", "NTA. Im turned on by mens biceps😉", "NTA just reassure her that you like her very much, for her body and her mind", "NTA. If she wanted an answer like that then she should’ve just asked if you’re a tits or ass guy.", "NTA\nIf a woman I was interested in had a toned stomach and arms (especially) I'm going to be legit and say those are to me one of her best physical qualities. Boobs and a butt are nice but the vast majority of girls have that going on. Not all of them have the drive to struggle and achieve a \"performance package\" if that makes sense", "I mean... I like women's arms; I wouldn't call it a fetish, but they're nice. If I'm friends long enough with a cute girl, I might tell her I like her arms, and most likely before commenting on any other body part specifically (unless you count hair). It's not weird to say that to your GF unless it's weird for me to say similar things to other women. NTA.", "NTA if she doesn’t value your honestly she’s not worth your time", "NTA:, Something really sexy about a girl with nice arms", "NTA. Don’t ask the question if you don’t really want the answer", "NTA. How dare you answer truthfully!!!", "NTA. I think that hurt her feelings because she doesn’t consider that to be an attractive part of herself. Or maybe she lifts to make herself feel better about herself, and doesn’t want it to be sexualized. Or, she was hoping you would make her feel pretty and feminine. She should communicate whatever the insecurity is.", "Nta, just honest.", "Lol, to be a kid again.", "My brother in arms", "NTA- tell her to flex them biceps for you my boy.", "NTA. She shouldn't have asked if she didn't want an honest answer. Also, she shouldn't shame you by calling your answer \"weird\" or \"abnormal\".", "NTA - can't help but feel like this was a trap and answering boobs/answer would also have been wrong..", "NTA\n\nNothing for it, sounds like there was no good answer because she had something specific she wanted to hear that wasn't your actual opinion. \n\nI suggest talking it out with her, find out that answer she wanted if it is like other commenters suggested and she's feeling insecure about her femininity, see if there are some activities she might like to do that would help. Like fancy clothes or a fancy date? Maybe a photo shoot where they dress up in big ball gowns or something?", "No? Of course you’re NTA. If she wanted you to pick, she should’ve specified which body parts she was talking about. Also women have muscles too. It’s not an inherently masculine trait. Muscles are gorgeous, on anybody, and it’s not like you told your gf she looks like one of those fucked up vacuum packed bodybuilders. You just said her biceps are hot.", "NTA. She asked a question, you gave an honest answer.\n\nTbh its also kinda weird that she dislikes that, I mean, she works hard at having them by working out so shouldn’t she be proud of herself?", "NTA, but she could probably use some reassurance that you find *all* of her attractive", "Nta but rookie mistake, always think before you answer when it comes to women. Many times did my sister ask me what i honestly thought of her clothes and far too many did i say what I actually thought and she started to cry or was sad.", "NTA - She asked a question and you gave an answer, I don't get why she’d be offended she's worked on her biceps to be toned. You'd think she’d be stoked with that answer", "So, she lifts weights and is surprised that her boyfriend is attracted to her muscular body? \n\nI mean, that sounds stupid to me. \n\nI am glad you talked to her, but I mean, what the hell. \"I look this specific way, how can you be attracted to that?\"\n\nMuscles on women are **hot**. Curves too, tits too, asses too... it would seem I find women attractive.\n\nNTA, she asked you a question and instead of playing games, you told her the truth.", "Bro with gf Honesty is not the best policy. Take care soldier.", "She should take it as a compliment, she must have amazing arms", "Walking on egg shells around unhealthily insecure people is always so much fun!", "Whatever floats your boat mate. NTA", "I love athletic women.  The whole package.  She asked, you answered.   People need to learn not to ask the question if they arent going to like the answer.", "Women with muscle are insanely attractive. Society still hasn’t caught up to the fact that we live in an age where women can build their bodies up with all the access to gyms, knowledge & food we have. Women have always had muscle, they just never had the hormonal advantage & work intensive roles that men have had to see muscle growth. The future is now. Women should be proud of their muscle & not be afraid to develop their body.", "If that's what she wanted she should have communicated that. I get that 18-year-olds don't have the best communication skills, but she'll have to develop those skills to navigate the adult world and it's better to do so sooner rather than later.", ">it sounds like she was looking for reassurance about her femininity and rather than a direct answer to her question\n\nThat's fucking stupid. She should just ask that directly.", "When I see her this afternoon, I'll talk to her about it.", "It shouldn't be a trap, men should hold their ground and let the situation resolve itself however it may. If your partner decides to really make a huge problem out of sth so insignificant, the writing is on the wall. She asked, she got the answer, she'll live.", "Landmine!!!   She didn’t string a telephone line!!!", "🤣\n\nYour brain: so you don't find me attractive\nTits/Ass: so you only like me for my body\nYour heart: so I'm your doormat \nThere's nothing not to like about you: so you just don't want to answer\n\nI'm sorry, but he already stepped on the landline the moment the question was posed. Just plea insanity.", "Maybe something in the line of “there’re so many things i can’t decide” would work better", "“Your smile” is another safe one!", "These are the kinds of questions that should put any boyfriend instantly into overdrive survival mode. OP is young and hasn’t had time to gain this wisdom, but he will", "I took a course on the philosophy of love, sex, and gender.\n\nIf I learned anything from that class, the best response to what do you love about me is this: “My love is flexible. I love you for XYZ but there’s also a million other things I love about you and I will always find new things to love.”\n\nIt gives the other person the pride of being loved for certain conditions, but also the reassurance of being loved unconditionally.\n\nSo maybe op should have said, “I find your biceps really attractive but I also find XYZ very attractive. Everyday I find something new to be attracted to.”", "Big, pert, supple...brains.", "I do find the rest of her body sexy too, including her boobs and butt. I will reassure her of that like you suggested.", "Don't speak for the majority, bro. Some people can still think critically.", "Yes exactly", "Exactly", "I will tell her that the hard work and dedication she put into exercising are very attractive features.", "Bit much", "So true.\n\nI always try to double think when my wife asks me a question like this.\n\nA few weeks ago she made the mistake of asking my opinion on her new glasses.\nI made the mistake of telling her.", "Fellas, is it gay to like girls with arms?", "I'm a working-class gal of farm stock. Believe me, women have always had *plenty* of muscle, just not the showy kind. The practical kind though? Oh yes! The ultra-slim ideal is actually comparatively recent. \n\nMen didn't use to have the showy kind either actually...", "Ah, a fellow muscle tomboy enjoyer.", "And they were scare mongered through media about turning into ‘manish’ freaks if they did", "Lmfao ok this was a bit much. “The future is now” after this feminist motivational speech. \nBut yeah good for women that they eat well and work out since it’s a very healthy way of life.", "Nahh, ur not an a-hole for the answer but good luck in the explanation, great men in history so far failed to do so. Even Obama himself doesn't do that.", "My dear, there is not a single part of you that I dislike, from your hair to your ankles. But not your feet, them duck looking things be gross", "Or women shouldn't ask stupid questions they don’t want to know the answer to", "Yeah, at the end of the day I think she's probably just insecure that working out like that makes her less feminine. Usually biceps are considered a male attractive feature, because society is stupid. So it might be good to emphasize that you find all of her beautiful, and there's nothing \"masculine\" about just being strong. She can be a gorgeous woman while having strong biceps, and you just happen to like those too because they look really nice on her.", "That's exactly the recognition she earned from you.", "if the question she asked was uncharacteristic of her... part of me feels like she has some people (other women perhaps) getting in her head about getting \"too muscular\" or other such nonsense.", "Nah fuh dat bih she a bit much", "Fellas, is it gay to get hugs from girls?", "You see that’s where we divert, I still want them to be feminine, but with muscle 😂😂", "Also looks good, gotta love them muscle mommy's 🤤", "I’m not really a feminist, I’m just unironically that passionate about muscular women lol.", "Partners asking each other dumb questions to entrap them is just a fact of life. A tale as old as time. You just have to get good at spotting and avoiding them", "Crazy yute 😂 funny tho", "[deleted]", "I did not mean to delete my original comment btw, my phone was on in my pocket and it deleted it. But basically I was saying that it’s weird that people say “I’m not really a feminist”, bc why would you not be unless you just really don’t believe that women should have equal rights as men? Bc that’s all feminism truly is. Women being equal to men.", "Respect.", "Valif", "But ironically you think that you should be the one to determine what society should be finding attractive in women.", "You make me hope that there are actually open minded people in USA", "Once a woman asked me if I was a feminist and I said \"Of course! Either you're a feminist or an asshole!\"\n\nTurns out she was not a feminist 😐", "Personally I consider myself an \"equivalist\" rather than feminist, mostly because I don't feel like being represented by a small but loud matriarchal man hating squad that came with the latest wave of feminism.\n\nOf course, it's just another side of the same coin in the end.", "Because it has mostly moved past equal rights to putting down men and dominating them", "Good lord, people like you annoy me. Stop gatekeeping.", "I’m sorry but that is so incredibly stupid. “Wave of feminism”? It’s not feminism, it’s literally a group of idiots who claim to be feminists and hide behind that term just to be hateful and think they’re better than men (and everyone else). You and I both know that’s not what feminism truly is. “Equivalist” = feminism. The word “feminism” doesn’t just change and take on a new meaning bc a bunch of idiots use it wrong.", "No, it hasn't.", "No lol. That’s not what feminism is. Some idiot women who want to be better than everyone may use the term to hide behind but at the end of the day it is not truly feminism, nor has it ever been. It’s really not rocket science.", "What exactly am I gatekeeping and who exactly are people like me?", "[Wave of feminism.](https://en.wikipedia.org/wiki/Fourth-wave_feminism)\n\nYeap, we think the same but use different words to describe it. I guess that makes us enemies :)", "Unfortunately “what feminism truly is” is defined by those in power/vocal. \n\nMaybe it once meant something else, but unfortunately times have changed, as do meanings of words over time. Their uses change", "It was that way from day 1. Women didn't gain the vote with equal responsibilities, as men were subject to conscription and women were not for DECADES afterwards. Feminism is a female empowerment movement. \n\nWhy were feminists not campaigning for women to gain the vote on the basis of conscription? That would have been equality. Instead, millions of men were forced to go to war for their chance to vote.\n\nIn the US, it's still that way today. Men are subject to conscription and women are not. Doesn't seem very equal to me.\n\nI have absolutely nothing against feminism or female empowerment at all. More power to you. But feminism has never been about equality - it's been about gaining rights, not necessarily with the same responsibility.", "But it is what they proclaim themselves as, all the girl bosses and stuff like that still say they are feminists", "Not sure who ever said or implied that we were enemies just bc we think the same and use different terms to describe it. you took a very dramatic turn there for absolutely no reason. I’m just trying to take back the term “feminism” bc there’s no reason it should be taken over by a “wave” of overly aggressive women who wanna take over the world lol that’s all I’m saying. When I said “that’s incredibly stupid”, I wasn’t saying YOU are stupid. Sorry if you took offense or I hurt your feelings or something but I never said (or implied) that we were “enemies” lol.", "Okay, but they’re not. The word “feminist” doesn’t just magically change and get a new definition just because a bunch of idiots want to be hateful and slap the feminist label on themselves to justify their sexist ideals. Just bc they “proclaim themselves” as feminist that doesn’t mean that they are, and it doesn’t change the original definition. Saying what you’re saying is honestly just kind of furthering the negative connotation to the word instead of embracing what feminism truly is.", "Okay yeah, you're right. My initial reaction were hyperbolic because of reasons my own leaking through. You seem like a reasonable person, have a good day.", "I know I replied to you in another comment. But its like you said the “original” definition. It ha now changed\n\nThe entire landscape has changed. I considered myself feminist 10years ago as well. All the groups i was in started to spew hate and only empower women. Both sexes should be empowered simultaneously. \n\nIts a PR stunt\n\nEvery group champions equality for all to masses. Then when you get inside and involved. Its “men should have their own group”.\n\nThen when men makes groups, feminists groups anti-rally and spread hate.\n\nThis is the planet we’re on."]}