{"id": 26236, "submission_id": "16ahtjy", "title": "AITA for wanting to go on vacation with friends and not babysit my niece who is in the same hotel?", "selftext": "Hi, disclaimer english isn‘t my first langauge and i am writing this on mobil.\n\nTo start things off i (m29) and three of my friends booked us a weekend trip (Friday - Sunday) a few weeks ago. It‘s my first time off since the beginning of may, to say i am thrilled is an understatement. We plan to party at night and chill at the pool by day.\n\nI also told my brother (43) and my SIL (39) a few weeks ago that i was really excited to stay in this specific hotel since it is on the pricier end.\n\nYesterday my Brother contacted me that they will be staying in the same Hotel with my niece (4) at same time as me.\n\nIn the message he wrote me that they are also really excited that i can help with my niece since i am also there and they can relax in the meantime and according to them i have nothing better to do. Do not get me wrong i love my  niece to pieces, but i really want to enjoy this Weekend and not have any responsibility for anyone besides myself. I want to relax, be drunk and have fun with my friends. They are staying in the same hotel so i can‘t avoid them even if i wanted to.\n\nThe vacation is not refundable. I am either stuck with babysitting(her parents are really pushy and i am the worst at setting boundaries) or my family will think i hate my niece. I am frustrated af.\n\nSo AITA if i tell them i don‘t want to spend time with them?", "created_utc": 1693900266, "permalink": "/r/AmItheAsshole/comments/16ahtjy/aita_for_wanting_to_go_on_vacation_with_friends/", "score": 3647, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I don‘t want to dissapoint my family that i don‘t want to spend Time with them during my vacation.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "\"Dear Bro,\n\nAhaha, nice one!  I'll be enjoying a nice grown-up mini-vacation with my friends, but we'll definitely give you a wave if we see you by the pool.\"\n\nDo not stand for this.  Your brother and his wife have no right to demand your time.  If they don't want to look after their own child they can take a babysitter with them.\n\nNTA.  But stand up for yourself.", "You say you are \"the worst at setting boundaries.\" Well, now is the time to get better at it.\nAsk your friends to support you in this.\n\nSay \"no that's not going to work for me,\" then walk away. That's it. You don't have to answer any follow-up questions.\n\nPart of setting boundaries is knowing the person will be displeased with you, and that's OK. Let them be. You are doing nothing wrong.\n\nEnjoy your holiday!", "Here we go: \"Those plans don't work for me. I'm sorry, I'd love to spend time with (niece's name), but I've already made commitments with my time that I can not shift. I look forward to catching up with you when I get back.\"\n\nPractice and repeat.\n\nYou don't need to explain thar you're having dinner with your friends, going to a show or relaxing in the pool. \n\nNot to mention, it would be rude to your friends, who have booked this time away with you, to blow them off because of babysitting .\n\nAny reasonable family member knows that being unavailable to babysit doesn't mean you hate your neice. You are simply unavailable.\n\nNTA", "NTA\n\n>her parents are really pushy and i am the worst at setting boundaries\n\nHere is a perfect opportunity to improve on this. Here's what you should say to your brother:\n\n*\"Hey! How nice that you'll be at the hotel the same weekend as me! My friends and I have already made plans together* *~~for that weekend that we cannot change~~*\\*, *so I have no free time to watch niece for you. Hope you have a great time!\"*\n\nRinse and repeat as often as necessary. By setting this boundary you are not saying that you \"hate\" your niece; you are simply shutting down any attempts by your brother to control your weekend plans. He has no right to do that to you.\n\nThink of it another way, by caving in to your brother's demands, you will be negatively affecting a trip that your friends have been looking forward to. They're expecting a weekend of letting their hair down and chilling out with you. You cannot do either of those things while you're looking after a four year old, so don't let them down.\n\n\\*Edited following a point raised in a comment below.", "NTA your brother is a rude asshole, don't you dare do it", "NTA. That was a *really* shitty thing your brother did. Tell him that you're there on vacation, and you hope he has made suitable child care arrangement for your niece, because you will not be available to pitch in.\n\nHe will try to crowd you, anyway, and this will likely involve dumping niece on you. Make sure that he knows that this will result in you contacting the police and reporting an abandoned child.\n\nIf you are able to change the date of your booking without paying a fee, do so, and do not tell your brother. His ambush childcare ploy deserves to fail.\n\nIf not, tell your brother that you have had to cancel the vacation, but wish him a good time, anyway. He may be surprised to see you when he gets there, but in the meantime he may have made alternate childcare arrangements that do not involve you. Make sure he knows that you're not available to take over.", "NTA.  Just tell your brother you have plans with your friends and unfortunately  aren't available to watch your niece.  Suggest that he can ask the hotel if they can recommend a professional childminding service.  You are a 29yr old adult, stand up for yourself and tell him no.  Make sure your SIL knows too, because he more than likely hasn't told her the truth, she is probably under the assumption you agreed to watch your niece.", "NTA, you had a trip planned that you bought for yourself and planned out. Why should you sacrifice your time and money just to not anger your entitled sibling?-\n\nYou didn't offer babysitting services, so it's incredibly rude of them to just assume you'd provide them.\n\nDraw a boundary here or they will continuously view you as someone to take advantage of.", "NTA  Tell him, \"You probably won't want me to be around your daughter since I will either be drunk, on my way to being drunk, or recuperating from being drunk. I'm not going to be responsible for anyone other than myself.\"", "NTA. \n\nBut your 29. Act like it and say no.", "NTA. \n\nTime to learn boundaries friend! \n\nIf they had paid for the trip, that would be one thing. But you bought this trip! \n\nI’m suspicious of the timing that bro and SIL heard you were in this hotel weeks ago, and suddenly they are staying there the same weekend! It sounds like they did this intentionally, to guilt you into babysitting, on a weekend they knew you were excited about. \n\nAs a recovering bad at boundaries person, let me say. It feels anxious as hell when you start using them. But it feels so good at the same time. \n\nSomething along the lines of “I love my niece and the two of you. Any other time I am more than happy to babysit her so that you two can relax. However, this is a trip that I have booked with my friends, to relax and have fun and that’s what I plan to do. If we run into each other, I’m happy to say hello and hug my niece, but otherwise I will be busy with my friends”. \n\nAnd stick to it!!! Get your friends to help you stick to it while you are there. \n\nYour family will probably try to guilt trip you but all the things they say are their issues that they are using to try and get you to do what they want. You are a self and you matter. Your boundaries matter.", "NTA. They did this on purpose to try to take advantage of you. They want you to give up the holiday you planned so they can have their own relaxing holiday. Don't play that game.\n\n\"Hey bro. That's so weird that I told you about where I was staying and you went and book the *exact same place* at the *exact same time*. Almost like you *planned* to make me give up my holiday with my friends to take care of your kid. But I know you know that your decision to go on holiday makes no difference to my plans. And that I won't be taking time out of *my* vacation just because you \"coincidentally\" will be in the same hotel. Because there's no way you planned to take advantage of *my trip* to try and get a free babysitter, would you? Have fun at the hotel, I probably won't see you because the plans I have with my friends aren't child appropriate.\"", "NTA\n\nMessage your Brother and SIL and say something like \n\n'I hope you all have a good trip to the hotel and it will be nice to see you around the place.  However I will not be looking after my niece at all during my holiday as I am busy with my own plans for the entire time I am there.'\n\nDo not let them bully you over this as the only reason they booked the same hotel is to take advantage of you.", "NTA but learn how to set boundaries. \n\nIf you can’t set boundaries, make plans everyday: go out early every day with your friends or alone so they can’t catch you and come back late/put do not disturb and don’t answer the answer the door. Ps: sleeping in all day is also a plan. \n\nTell the hotel they can’t give your room number to anyone even your brother. don’t ever share your vacation plans with your brother ever again.\n \n\nCall your parent and share the story first: how are you haven’t had holidays in months, you booked a holiday in a pricy hotel to relax and your bother without asking you to, decided to you’d babysit - how entitled is it? Especially as they’re not paying you to babysit and the hotel is expensive and you’re always happy to help at home (if that’s the case) when it’s pre-planned. \n\nAlternatively tell your brother you’re not a babysitter, your vacation time is your vacation time and if they’re so exhausted you’re happy to babysit 1 evening at home pre-planned. Give them a couple of dates far away when it works for you. Or if you want to be nice tell them  you’re happy to reserve one evening on the trip, to catch up with them (and niece). Make it late on the trip so they don’t rope you in doing more.", "NTA - \n\nYou are there on a \"guy trip\" to relax, not take care of a kindergartner. Your brother is out of line.\n\nTell him that you and your friends are fully booked with bachelor activities and none of them would be appropriate to take a 4- year old girl to.", "Nta. \n\n\"Oh nice, I think you guys will have a lovely time at the hotel. Unfortunately I won't be able to babysit as my friends and I have made some plans that are non refundable, you enjoy your holiday though. \n\nAnd then do everyone else has said, don't let them know your hotel room, and avoid them like the plague", "NTA. It's not your responsibility to babysit just because you happen to be in the same hotel. Enjoy your vacation and let your brother and SIL handle their parenting.", "NTA, it's their problem not yours. you can just ignore them.", "NTA. \n\nBut don’t lie, don’t make anything up, just simply say, “I scheduled this trip with my friends, I will not be available for babysitting.”", "“Hey, I just wanted to say that I think it is weird that you booked a stay there while I am going to be there. And it was pretty presumptuous for you to think I would take time out of the vacation I have planned with a group of friends to babysit for you. That does not work for me. I’ve had these plans for a while and shared them with you because I was sharing my excitement with you, not so you could derail them. I truly hope you guys have fun a fun vacation of your own, but I will be unreachable while I’m there as I have plans the entirety of the weekend as I already told you. Hope you find alternate arrangements or some fun stuff for you to do with niece. Have a great weekend! I look forward to being able to hang out with niece when I actually have free time.”", "NTA is just rude to co-op your holiday because they are to cheap to pay for a babysitter. There are plenty of child friendly hotels with day programs for kids. Let them use those.   \n\n\nOfcourse you have better things to do and your Brother and SIL know this, so again just rude.  \nDon't fall for their BS", "NTA. Bro and family will likely get all sorts of upset, but that's on them. They didn't ask you: they made a demand and you're well within your rights to refuse it.", "NTA, to anyone but yourself. \n\nYou are not a built in babysitter. Something tells me your brother did this on purpose,  infringe on your vacation to get a free babysitter while looking like the excellent husband and father. That was a major jerk move. You have to set firm boundaries. Send a mass group text, this is my first vacation,  I need to relax, I have made plans that are not 4 your old friendly. Nobody asked my opinion or if I was okay with brother hijacking my trip, I am in fact, very much not okay with this. Going forward, as much as I love my family, I will not be walked on. If you want a babysitter you must ASK me in advance.", "You are 29. Tell them you have zero intention to look after her. If you have soft heart you need to have a hard arse cause you will be taken advantage off. \n\nWhy would you care about being liked by people who take advantage of you?", "WHAT IS HAPPENING AGAIN WITH FAMILY MEMBERS AND DUMPING THEIR KIDS TO OTHER FAMILY MEMBERS \n\nITS LIKE A PANDEMIC !! ITS SPREADING\n\nNTA", "Don't explain or make excuses. \n\n\"Dear Bro,\n\nI will not be babysitting for you while I am on my vacation. Make other childcare arrangements. I am not available.\"\n\nThat's it. The end. If you explain why, you're giving him room to overcome those reasons. No is a complete sentence.", "hard repeat HARD THE HELL NO. NTA tell the to fuck right off", "NTA. Maybe include something like 'I am sure the hotel knows some great childcare facilities. If I see <niece> wandering around, I'll bring her to the hotel reception, so you know she is taken care of.'", "NTA\n\nTell bro and sil No, I have plans.\n\nWhat kind of plans?\n\nAdult plans that don't involve kids. Your kid, your problem.", "nta. I'm so mad on your behalf lmao. tell them you're not there to babysit, so they should make other arrangements if they want to relax. do not let them walk all over you!!!!", "NTA\nBut why are you a doormat?\nStand up for yourself.", "NTA. Your brother is using you for free babysitting so they can have a vacation. They clearly knew you were going to be there before they even booked.", "NTA\n\nMake sure you follow the advice on keeping your room number a secret and…\n\nEvery time you are in public, make sure you have a drink in your hand. If you see your SIL or BIL approaching and you cannot evade them, start acting half-drunk and make it clear you cannot be left alone with a 4yo. Then just walk away.", "NTA-  go and stay drunk...", "NTA. Please don't allow them to disrespect you that way and let them play ignorant. Of course you have plans. You obviously didn't book a place to go on vacation with friends in the hopes family would later book the same place and you could ditch your friends to babysit your niece. They are using you and it wouldn't surprise me if they knew where you were going and purposely booked that place hoping to sucker you in. Please enjoy chilling by the pool by day and partying by night as planned.", "Just say... hey, if you're okay with her shotgunning beers by the pool by day and f*cked up at the bar by night, I'm your man. If that's not what you had in mind, you're going to have to make other arrangements.", "NTA\n\nBeer in hand a ALL times! \n\nYou didn't book a holiday, so your brother and SIL can have a break. Tell them you might see them around the pool and at meal times, but you and your friends have plans that aren't appropriate for a child. And repeat until it sinks in or send them links to the kids clubs at the hotel, but do not agree to any amount of babysitting, joining them for meals, etc, where they can slope off.\n\nIf your parents get pushy, tell them 'thanks! I'll tell bro to cancel neices bed and you'll have her for the weekend so they can enjoy their break.' And nothing more.\n\nETA: Tell the reception at the hotel your room number is under no circumstances to be given out to anyone at the front desk, put their numbers on mute.", "tell the most assertive of your friends, he will make sure all your time will be occupied, \"sorry bro, i got a full itinerary, so no free babysit service\"", "NTA,laugh at them,stand up for yourself,tell em no ,I'm on vacation, figure it out", "NTA\n\nYour brother hijacked your vacation so he could have one.", "NTA tell them you want to have a holiday and don't let them take that away from you! They are so entitled. If your other family have a problem with it tell them to look after the child.", "NTA.\n\nYou booked time for you and your friends and your brother not only piggie backed off it he also blindsided you with child support arrangements?\n\nWould be a different discussion if he asked but he didn't.\n\nNow is the time to set your boundaries and enjoy your own holiday, don't be a doormat OP", "NTA - posters below have given you good advice. But I would also ad that you and your buddies plan on going out and you don’t know how much you’ll be drinking and thus how hungover/still drunk you will be the next day. Oh and don’t just say you cannot change plans, but also that you WIL NOT change them.\n\n&#x200B;\n\nAnd do not offer to take your niece for even one minute. Your brother chose this hotel and this time after you told him about it, so he is the major asshole. No matter how guilty he and perhaps your family make you feel.", "NTA\n\nBut your brother sure is", "NTA\n\nHe can organise a babysitter through the hotel and pay them for their time. Another time tell him nothing or lie about the hotel bame.", "NTA, just drink alcohol constantly. And have like a beer can or smth in your hands at all times or around you, and if you'd like just refill it with water or juice. As long as it seems you're constantly drinking you probably won't be asked that", "NTA! That was full intention of your brother. Quite disrespectful and intrusive - to demand from you - that YOU should take care of your niece on your free weekends with friends. Give us an update pls", "NTA\nBut seriously,  just say you won't be available to help. This is the time to set boundaries,  they are using you because they know you won't say no.  You don't pay for a holiday so you can spend it minding somebody else's kid.  Don't let it happen.", "NTA.  Time to grow a spine and just say 'No.' Repeat as necessary.  You need no reason, as 'No' is a complete sentence.", "NTA and a little piece of advice, never tell family about your vacation plans again.", "Nta you already have plans, just text him no and don’t argue it. When you get to the hotel get bombed so it would be irresponsible for them to make you watch their kid. Stay drunk.", "NTA\n\nTell them: nope, I’m on vacation with my guys. I’m not babysitting and stuff. Your kid, your responsibility. Hope you have the same fun as me because I’ll be dunk with my guys and relax.\n\nThey aren’t entitled to your time just because they stay at the same hotel/time as you.  And if other thinks you don’t like your niece: let them think because you know it better.", "NTA.  In fact, if you don't tell them now what your boundaries are, you will be the AH - to yourself.\n\nYou are not being nice to anyone by not setting boundaries.  People need to know where they stand.  A person with no boundaries is a disaster waiting to happen.  Everyone actually does have boundaries and they will enforce them if someone goes too far.  Let your friends and family know what your boundaries are to save everyone from the grief of finding out what happens when someone goes too far.\n\nSimply tell your brother what you told us:  \"...i and three of my friends booked us a weekend trip (Friday - Sunday) a few weeks ago. It‘s my first time off since the beginning of may, to say i am thrilled is an understatement. We plan to party at night and chill at the pool by day.\"\n\nTell your brother you will not be able to watch your niece because you will probably be drunk, hung-over, or badly sun-burned.  This is your much anticipated vacation and that means \"no work\" including baby sitting.", "NTA.\n\nHenceforth don't share your vacation plans with them. It's a lesson. \n\nTalk to your friends and start way early. Early morning, they'll be asleep. So you won't get caught. Hold onto ur room key and keep ur mobile on mute. That way even if they call, they can't reach u. Party away all night, reach past 3 am. Give instructions to hotel guys you're not to be disturbed (especially be open about them that they're prone to disturb). Sleep away. In case they try to bang on ur door etc, just don't open. The hotel staff will escort them back.\n\nOnce they're in their room, use the gap and go out again. Stay out entire morning to midnight. Repeat the same for all 3 days.\n\nLast day, show ur face only when you're heading out of the place. When they confront, be cool and tell \" Well I did come here for my vacation. I did tell u that I'm going partying with my friends. I never agreed to be your babysitter. As much as I love niece, I don't think drunk me would be of any use to u.\" Walkaway!", "NTA, talk to the hotel and make sure that they know to NOT give your room details to anyone who asks for them. You could also respond with a, \"I'm sorry, I must have given you the wrong dates for my holiday. It's actually the weekend after when we are going on our trip as 2 of my friends have work commitments that weekend.\" And then be surprised when they change the dates and you don't see each other.", "NTA, you need to stand up for yourself. Say it with me, \"NO!\" No is a full sentence and a full answer no justification or explanation is needed.", "NTA. Tell him in no uncertain terms that you told him you were going on vacation to have fun and spend time with friends. This not a family vacation. You’re sorry that he didn’t understand or seems to have forgotten this means you will not be available at all. You will NOT be helping with niece. Tell them to plan accordingly. This is your vacation to enjoy. Do not let them ruin your time.", "NTA but explain now this is not the plan and you have friends you will be hanging out with because you have plans.\n\n\nIt’s rude to plan your vacation for ypu.", "NTA.  Turn off your phone.  Of course you can avoid them - you and your friends have preplanned the trip’s activities.  Adult activities.", "NTA, It's not a vacation if you're babysitting.  Also, make it sure that you consider them even asking as a betrayal of your trust and it will have serious and possibly permanent implications regarding what you're willing to share anything with them with in the future.", "Dear Bro.\nNo, I am not going on vacation with my friends to babysit your child instead of enjoying my vacation with my friends. I am going be hanging with my friends and have fun holiday.\nPeace out\n\nNTA", "If you haven't learned how to say \"no\" by age 29, what hope have you got in life. Pull yourself together and tell your brother your time is already booked and you're not available for babysitting. You're NTA, but you won't be allowed to have your own life if you don't insist on your rights.", "NTA. Message back saying it will be lovley to see them, but you will be busy with your friends so let's pick a night to arrange dinner. \nThis isn't your child and you aren't employed as their babysitter. \nUnfortunately you are going to have to be firm and they won't take it well. Entitled people never do.", "NTA\n\nTell them you cannot be responsible for her as you will be drinking and with your four friends. That is not a safe situation for her near water. This is a vacation you paid for and they should understand that you have your own plans.\n\nIt would be irresponsible of them to leave her at any time with you when you are distracted and drinking. Tell them you'd even consider calling the cops if they try to dump her on you (bc I guarantee they will.) \n\nIf they want you to babysit, next time they can take you along and pay for your hotel.", "NTAH! They are!\n\nLet them know in no uncertain terms that this your holiday and not your babysitting holiday that you paid a lot of money for! Stand your ground and call them out for the BS that they have pulled.\n\nYou are busy even if it is relaxing.", "NTA, what a dick of a brother. It seems to me the brother wasn't even going on vacation until OP mentioned his plans. I'm sure staying in the same hotel at the same time was just a coincidence. 😒🙄", "NTA. Get the hotel to put your room under a silent booking, with a code word. That way the hotel can’t give out your room number, and your brother cannot pretend he’s you.", "Nta Just send him cool me and my friends Will be drinking all vacation. Hope she likes wodka and shots for days.", "NTA.  Just say no.\n\nNo I won’t babysit \n\nNo I won’t just keep my eye on her for 5 minutes \n\nNo I won’t look after her while she’s swimming \n\nNo you can’t come to my room \n\nNo I won’t change my plans to suit you \n\nGuilt tripping will be the next step, including sending your niece over to see you.  Tell her firmly that you are with you friends and you can’t talk right now.  Then tell your brother/SIL to take charge of THEIR child. You are on holiday with your friends not them and nothing you intend to do is appropriate for a 4 year old\n\nIf you deviate from this, not only will you literally be left holding the baby, your friends will never want to go on holiday with you again. No is a complete sentence.  No fuck off you pair of mooching shits is a better one.", "NTA-just say NO.", "Nta. Just say you’re happy for them but you already have plans with your friends, and you won’t be able to baby sit at all. Maybe you can suggest that your brother asks the hotel if they have any babysitter recommendations.\n\nIf he tries to ‘drop off’ his daughter when you are at the pool I’d flat out say ‘I’ve been drinking and it isn’t appropriate to leave your daughter here unsupervised, as I’ve already told you that I cannot babysit this weekend’. Maybe your friends can help support you in this?", "NTA\n\n\"Dear bro, FYI. I'm going to be drunk AF and participating mucho shenanigans. Your kid is going to have a blast!\"", "NTA \n\nask him \"if he really wants his daughter to be with you while you are with your friends drinking\" \n\nyou could throw in an hour of babysitting if you want to be nice.\n\nif you want to be evil ask him to pay the hotel stay since babysitting is not relaxing no matter how much fun you might have with your niece.", "NTA and reply to bro that you plan on spending the weekend so hammered he wouldn't leave you in charge of a  rock let alone a child...", "Nta, just make sure every time they see you that youve got a drink in your hands. Preferably one in each.", "NTA tell your brother to go to hell and just ignore them if they try to talk you into baby sitting charge them a thousand dollars in cash up front and when they try to back talk just say no ticke no laundry and walk away", "Just say no. You need to learn this or you will be the family doormat for the rest of your life. It is very clear this was a planned sabotage by your brother for he and his wife to get free childcare on a mini vacation. Stop letting them use you. NTA", "What a shit thing to do to you. That’s more than entitled. Tell him you won’t be sober the entire trip. Then tell him not to try and tag team his vacation with yours without specifically asking first. That’s just gross behavior. Do not cave.", "On top of the great boundary advice given by everyone, I would recommend asking the hotel to not give away your room number to them if they ask (as bro has the same last name, I presume). Do not answer the door if they come knocking as they could just dump the kid on you. \n\nEven if you say no, from what you said about your SIL, I wouldn't put it past them. \n\nIf they try in public, make a scene. Who is going to be more ashamed than parents leaving their little kid with a drunk guy?", "Dude, man up. Tell your brother bluntly that you are on vacation and have no plans to babysit anyone under 21 years old and you are only willing to do that if they turn you on. Tell him your plans are to drink all night and  veg all day, so you can do it all again.\n\nIf you puss out and babysit, it's on you and nobody else.", "You're bad at setting boundaries? I'll help you.\nGET DRUNK 5SEC. AFTER YOU GET THERE.", "NTA they booked that hotel and now want free childcare. Totally inconsiderate", "You say you're bad at boundaries, but you HAVE to put your foot down. Tell them you're not on a family vacation and they cannot count on you as babysitting", "A little different take….  You made a promise to your friends for a getaway party weekend. You are going to crap on that so that your manipulative, gaslighting, guilt peddling brother and Sil can take your spot at the pool?  \n\nYTA. Not to your brother, niece or sil.   \n\nYTA to your friends.", "Nta-I’d simply tell them you are occupied. That said-I’d likely take niece a half day (not that you have to or anything, but it’s sounds like you’d like to help). Also-some hotels provide a babysitting/nanny service as well. Also-if one of your friends is up for it, I’d get them to be your cut off/back up for telling bro/sil that you’ve made plans, and allow said friend to help you say no. Again-big nta-you’ve already made plans to have no responsibilities, and your bro/sil are assholes for just expecting your services because you are there already. They seem to have no problem disturbing your planned break, so they can have a break, without discussing this with you prior to your trip (maybe you wouldn’t have gone). If I planned a trip to get away, and had a family member chase me like this, I’d be pretty bothered. And I’m kind of pissed at your bro/sil, and I’m not there, nor do I know you guys, just to let you know how much cringe I’m getting here", "Most hotels do not charge a cancelation fee if you change the dates. Call the hotel to see if it's possible to change dates. If so, talk to your friends about changing weekends & tell your brother you canceled.", "NTA- F that noise, it’s your holiday if they want to hijack it, they’re going to need to pay for your time and services the base rate is $25 an hour for 9 to 5 pm any times out side of that is $35 an hour", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi, disclaimer english isn‘t my first langauge and i am writing this on mobil.\n\nTo start things off i (m29) and three of my friends booked us a weekend trip (Friday - Sunday) a few weeks ago. It‘s my first time off since the beginning of may, to say i am thrilled is an understatement. We plan to party at night and chill at the pool by day.\n\nI also told my brother (43) and my SIL (39) a few weeks ago that i was really excited to stay in this specific hotel since it is on the pricier end.\n\nYesterday my Brother contacted me that they will be staying in the same Hotel with my niece (4) at same time as me.\n\nIn the message he wrote me that they are also really excited that i can help with my niece since i am also there and they can relax in the meantime and according to them i have nothing better to do. Do not get me wrong i love my  niece to pieces, but i really want to enjoy this Weekend and not have any responsibility for anyone besides myself. I want to relax, be drunk and have fun with my friends. They are staying in the same hotel so i can‘t avoid them even if i wanted to.\n\nThe vacation is not refundable. I am either stuck with babysitting(her parents are really pushy and i am the worst at setting boundaries) or my family will think i hate my niece. I am frustrated af.\n\nSo AITA if i tell them i don‘t want to spend time with them?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "To be fair, if you’re consistently drunk and constantly drunk, it is extremely irresponsible of them to get you to babysit your niece. Or hungover anyway. Just give them sour faces all the time from being hungover hangover and keep drinking coz why not 😂", "You can set your boundaries now, or allow resentment to evolve into hostility. Hostility will lead you down a road of no contact. Establish your boundaries, and grow a pair to hold to them. Welcome to adulthood.", "OP, your brother did this on purpose. \nHe is hijacking your vacation. Tell him that you're sorry, but this is your vacation, and had no plans to watch any kids.", "Nta", "Pro-tip : Be drunk from the time you arrive until you leave. Nobody who is not a shitty parent would leave their kid with four drunken dudes :)", "Tell them NO. You didn't invite them nor do you want to vacation with them. This is a girls weekend. It's going to be a huge fight where your family will jump in but you need to stand your ground. This is a hill I would die on the", "Stand up for your self", "I have spent considerable time drafting a reply for you. I hope you appreciate my effort. Edit accordingly..\n\"Hello dear brother. No.\"", "DO NOT BABYSIT. Just message your brother and say “sorry but I won’t be babysitting at all. This is my vacation”", "INFO - Why does it matter to you if your family thinks you hate your niece to say no?\n\nObviously 99% of reddit will see that you're there for a drunken getaway and your brother is crashing that. It's not reasonable for them to hold that opinion.", "How presumptive and entitled to invite themselves along!", "You're 29 years old. Get a grip of yourself.\n\n'No' is a complete sentence.", "So you plan a girls weekend, he gloms on uninvited expecting you to babysit so he can have fun?   The word you’re looking looking for is “no”.  If it was me it would be proceeded by “hell” or “f@&k”.", "You're not stuck babysitting. Say no before the vacation and if they find you, say no again.", "Grow a backbone or be a doormat.", "Nope.  Tell the RIGHT NOW that unfortunately you have made plans with your friends for the weekend and will be unable to babysit for this or watch your niece at all.  Not at breakfast, not around the pool, not in the evening.   You are not available.    When they complain (because they will) and they whine at relatives (because they will) you will simply dead stare at them and then say - I am on vacation.", "Do not change your holiday plans. Send a text to your brother beforehand to let him know that you are not available.  You need to stand up for yourself and stop being a doormat for your brother.  Update us to let us know how your well-deserved break goes. Good luck, OP", ">They are staying in the same hotel so i can‘t avoid them even if i wanted to.\n\nYes, you can. Tell the front desk not to give out your room number and not to accept any calls to the room. Don't answer when they call you. Go party. This is also rude to your friends who don't want a four year old around and/or wanted to hang with you.\n\n>my family will think i hate my niece\n\nYou're 30 years old dude. You need to use your words and say, my brother purposely chose to stay in the same place as me to steal my time and set me up. NTA but seriously if you can't say no and everyone is an asshole then that's what you're stuck with. Block their number for the weekend.", "You know they’re relying on you being a doormat so they can take advantage of you right? You’re 29 not 5 so grow up already and stop letting people walk all over you.\n\nBecause if you keep being a doormat, knowing that that’s something you need to actively work on, you will have no one but yourself to blame for all the ways people will take advantage of you.\n\nTreat this like a skill that you need to practice to get better at. I’d recommend being away from morning to night and never opening the door for them. If possible, change the hotel. If their fee fees are hurt then sucks to suck. You are not responsible for managing other people’s emotions. There’s nothing impressive or respect worthy about setting yourself on fire to keep people, especially those who don’t respect you, warm.\n\nNTA but YTA to yourself if you let them ruin your hard earned vacation.", "You are paying for a vacation with your friends and your brother and his wife have no right to demand  any of that time or any of your time in general. No means no and the sooner you learn to say it the better, don't be like me that it took 53 years for me to learn to say it and when I did it was so liberating. The fact on learning of your plans that they deliberately booked the same exact time and hotel as you is really nasty.  When you are there and if they do demand you look after your niece tell them you  want a refund for you vacation time as you didn't pay to go away to babysit for them. \nI hope you have a fab time on vacation without being pestered by you sil & brother", "Just go out don't tell them where u are. Say u have booked trios out etc and remember this for next time don't blab to people who might take advantage. Keep things private", "NTA. You aren't their babysitter by any means and they should've worked all that out prior to going on vacation. Tell them no and stick to it. You deserve to relax too.", "Absolutely NTA! Ask your friends to help run interference. Do not let them know your room number so they don’t drop your niece off, and block their number on your cell for time you’re at the hotel.  If they can afford a weekend trip, they can afford a sitter.", "NTA. Drive separately with your friends. Do not tell your brother or parents your room number and tell the staff not to tell anybody where you are. Do not give them any information about your itinerary, so they know nothing besides what you already told them. Enjoy your vacation. Ignore your family’s messages and phone calls while you are on vacation. Your family might try to leave your niece with you and run off if they catch you by the pool. You will need to use your words then, saying “I’m going to a bar or club right now, where the niece isn’t allowed.” and go off with your friends.", "NTA go enjoy YOUR vacation", " YTA.  Grow a spine.  You are freaking 29 years old.", "Tell them that you do not believe a drunk uncle and his friends would be good babysitters for their child and this is your weekend away.\n\nThen do not answer the phone to them while there. Go out at night and sleep in then when you get up head on out again.\n\nThey need to learn and you need to slap down the boundaries.  \n\nIf your family weigh in point out to them you were either drunk or hung over and in no fit state to be in charge of a child.\n\nIf they come to the room do not answer the door let them bang on it until the other customers complain. \n\nIf you chill by the pool and your brother brings over his daughter to babysit make sure you have a drink in your hand and ask him if he thinks an intoxicated person is the right person to supervise his child.\n\nIf he carries on then walk away.  Don't engage and get into an argument with him, go to the bar and buy another drink.\n\nThey are creating this issue they felt they could pressure you into it and get some free babysitting do not let them bully you like this.\n\nTell them you are happy to look after their child one night back at home so they can go out for dinner but that is it.", "Make sure you tell the hotel to not give out your room number to anyone claiming to be family. NTA", "NTA. But honestly this is your own fault by your own admission. Just say no. You're almost 30, it's time to learn to set boundaries, especially when you're aware that your inability to do so is an issue. If you can't do that... then I guess get used to babysitting.", "NTA. And make a point of explaining to them how drunk and non-babysitting you plan to be. Or make up some imaginary plans if you don't want to discuss the topic with them and find a quiet place to relax.", "No!no! No! How selfish is your brother! Tell him absolutely not! Then grab a cocktail and enjoy your self!\nNTA", "NTA - buy a handle of whiskey and swig from it every time your brother tries to talk to you at the hotel. Doesn’t matter if you filled it with tea, it will get the message across.", "Have some backbone, and say no and don’t back down. nTA", "NTA. Just be carrying a drink with you at all times. Or be blunt and tell them you're on a *vacation* and they do *not* have the fucking right in turning you into a slave so you *they* can do all of the relaxing *you* had planned to do.\n\nAs bad as you are at setting boundaries, if they keep pushing your niece your way, flatout tell them no because you have other plans.", "NTA. They want you as a babysitter.  You don't want to be a babysitter.  Just say no.  It's your time off, and they should have asked you about it first instead of turning your time off into a babysitting job.  As for your family, if they think you hate your niece, who cares?  You can choose between that and giving up your much needed time off.", "NTA but you need to learn the word 'no' or you'll keep winding up in this situation.", "\"So, my niece is down for bar hopping till I AM? Does she do shots?\"", "'No' is a complete sentence.\n\nYou're 29 (goddamn) years old. Time to resolve that boundary-setting issue.", "Always walk around with a bottle of beeer or something stronger  and look drunk or get drunk when you see them 🫣 in the hotel.and after holidays if they ask apologize 🫢", "NTA\n\nJust. Say. NO. \n\nYou told your brother about your vacation, you didn’t offer your babysitting services. \n\nMake sure you tell them now, before they arrive that you are under no circumstances babysitting for them during your vacation with your friends.", "NTA. so they booked after you told them, they expect you to sit her for free...😆\n\"dear (brothers name),\ni do have plans - which you would know if you listened or cared.\nso i gonna enjoy my time, enjoy yours with your family.\nsee you back home.\nlove, xx\"", "Screw them. Your brother and SIL are HUGE assholes. They deliberately hijacked your vacation to  have you as a free babysitter, so the can enjoy themselves. While don't giving a slightest damn if you will be enjoying your vacation. Don't do it. Tell them to know CK rocks. And don't EVER tell them about your plans. NTA", "NTA.\n\nIf they force the child on you and leave, being her to the front desk and tell them you found a lost child.", "NTA. Haha bro. Get a babysitter or leave your kid with relatives at home. Such entitlement.", "Nta block them for the duration of your stay", "NTA. Put your foot down. Also, do NOT give them your room number and tell the front desk not to give out your location to anyone. Make it known you will leave your niece at the front desk and claim they abandoned her if they try to drop her off with you. \n\nYou don’t want them randomly dropping her off on your doorstep. \n\nIt is not your responsibility to take care of her on your vacation. Secondly, don’t ever share plans with your brother again till after the fact.", "NTA.  'Hey guys, hope you guys will have a blast on the vacation.   Maybe we can grab a quick lunch one day.  I expect to be completely  drunk pretty much the whole time, so I  will probably start moving by 11 am or noon and probably won't  start back on the booze untilb2 or so, so we should  be able to meet sometime around lunch if you want to hang for a bit'", "Nta. We have an itinerary with friends and plans already. I won’t be available to see you or babysit. Have a nice family weekend! And then turn off your phone.", "Don't give your room number and if you see them, simply say you have plans all day.", "Just say NO!, i know it is difficult to stand up for yourself, but if you let them treat you like a doormat, you'll became their slave/free babysitter. NTA.", "Funny Tip, next time say 'bro i'm so excited we stay at Hotel abc to relax and Party' then when they book, arrive and ask where you are, you Go Like 'what Hotel abc? Did you get it wrong we are in XYZ' \n\nYou are nta. Stay clear that you are there to Party not to babysit and i promise you they will be angry for some time but they will need free Sitter and the Anger is forgotten", "Nta.dont babysit stand up for yourself", "NTA. Also get drunk early.", "NTA.   I would see if your friends can help you maintain boundaries.   Bro wants you to babysit?  Friend can interject that you guys already have plans.   Don't answer phone calls from your brother and if you get a text have your friends give you the moral support to say 'no'.", "Grow a spine.", "NTA.\n\n\"Um, I have plenty to do... not sure you understood, I have planned a drunken vacation with my friends.  Totally happy to help when I'm not on holiday though\".\n\nThen just either be or pretend to be drunk every time you see them. You shouldn't... they'll have  kid and you should be in the bars!", "No is a complete sentence. If you cave you’ll regret it. Time to set some clear and healthy boundaries! NTA and good luck", "\"Bro, I'm vacationing with my friends and will likely be drinking alcohol most of the time. I love spending time with [niece] but this trip is not the time. I hope you all have a great time.\"\n\nNTA.", "\"I am either stuck with babysitting(her parents are really pushy and i am the worst at setting boundaries) or my family will think i hate my niece.\"\n\nOP, time to grow a pair. Why isn't it this: parents will be stuck taking care of the child they brought into this world, or my family will think they hate her.\n\nYou planned a vacation. They purposely tried to trap you. Time to send a text: You booked a hotel at the same time and place as my vacation? That was kind of presumptuous. I planned a vacation with 3 friends. I won't be babysitting during that time. Period. Do not count on me. In the past, you've not accepted no for an answer, so I will be blocking your number during my vacation.\n\nAnd don't think you need to claim you want to drink. If you want to lie in bed or on the beach and do nothing, you don't need to justify that to them.", "No you’re not the asshole. Tell them you are there to enjoy the vacation and don’t plan on babysitting", "NTA - carry around a drink (even if it's only water) with you at all times in the hotel and act drunk, even if you're not.", "NTA. Tell them it doesn’t work for you and you already planned out the trip with your friends. Then reply to any other messages with the exact same words: “I will be on holiday with friends on those dates. I will be unavailable to babysit whether you stay in the same hotel or not. Please do not bother me on my holiday.” The only response. Over and over. Do not answer their calls or discuss with other family.\n\nAlso, block their phone numbers for the 3 days of the trip. When you check into the hotel ask to use a different name. And tell the hotel you do not want your room number or room phone number given to anyone that asks as a matter of safety. Tell your friends they are not to engage or play peacemaker if confronted by your family at the hotel. Enjoy your trip. \n\nLastly, I don’t get the feeling that you’ve spent a lot of time thinking about *why* they are doing this. It’s not because they simply want a few days of babysitting. It’s because they see you as beneath them. The idea of you having a nice holiday made them jealous and angry because they don’t believe you deserve to have something they don’t have. So they conspired to take your holiday for themself and use you as the help. Think about that. Stand up to them and any other family members who might try to interfere on their behalf. This is unacceptable.", "I am outraged when a person makes plans including someone else's help without them knowing. Are your brother and sil by any chance paying for your stay? lol", "Here's where you stand up and say \"No. Wait, I mean fuck no!\" You are not obligated to give an excuse.", "NTA except to yourself. You have plans and do not owe your brother your time as a free babysitter. You know you don't hate your niece so let your family think what they want and enjoy your long weekend.", "Wow, that is some entitlement from your brother... seriously.\n\n\"Nothing better to do\", really?! Hanging out and chilling with friends by the pool sounds like a great \"good thing to do\".\nHe decided that he wanted a kid and with that comes responsibility which he just cannot dump on someone else when it feels convenient for him.\n\nBooking the same hotel was a really shitty thing for him to do, honestly. Go on your vacation with your friends, and if he tries to dump you niece on you just tell her that you love her but are hanging out with your friends.\nIf your brother dash just go to the hotel reception with your niece and say that one if the guests left his kid with you (whilst holding your niece company while he comes back for her ofc) - he will not repeat that shit then.\n\nI have two kids myself and would never in a million years do what he just did.\n\nNTA", "It’s ok if they think you hate your niece. It will prevent issues like this happening. \nText your brother back that you have plans for adult activities and will not be available to look after niece. Ask them to contact the hotel for baby sitters. \nLie if you can’t stand up for yourself, that your friends have booked non refundable excursions .", "Lana is a lovely name.  Ignore the nonsense.", "Nta. Block them. Imagine the gall of trying to force you to give up your vacation so they can have time. They could have picked any other weekend, they could have asked. Nope. They want to mess you up on purpose. They would have to be pretty dang sure of themselves. Its time to stand up for yourself. No is a complete sentence. Block is an option as well.", "NTA. Your brother knew you booked a *vacation*. Set it clear immediately. There will be drama. They will move on. Block him the day before so he cannot call you about *an emergency *", "NAH. You should definitely tell your brother and SIL you will NOT be babysitting. You already made plans to spend time with your friends that didn’t include babysitting. The fact that they are trying to hijack your time off is very inappropriate and highly suspicious.", "NTA. If they try to just leave her, bring her to the front desk and tell them she was abandoned", "Respond immediately and say “what? What are you talking about; I’m going to be on a trip with my friends, remember? I won’t be available to babysit because we already have plans, many of which involve alcohol. My trip is not kid friendly; none of us are bringing children. You’ll have to make other arrangements for 4YO”", "Tell them no, then turn off your phone for the length of your stay. If you run into them, play up the fact that you are drunk or hungover & not suitable to care for her. It's obvious that they did this intentionally. If they try to argue that you don't love your niece, argue back that they don't love you because they did this just to saddle you with their child so they can get a break. If they deny that they are huge hypocrites and you shouldn't feel guilty about anything.\n\nYou can also try telling them that you and your friends have pre-booked multiple events that you have already paid for and they are non-refundable and you cannot miss them. They are adult events where it would not be appropriate to bring your niece. It would also be incredibly rude to your friends who you planned this vacation with, to ditch out on your plans because your relatives decided they suddenly wanted a babysitter.", "Unbelievable, the absolute audacity of your family. Do not babysit for them.", "NTA tell your brother and SIL that your itinerary is already arranged. It's a child free adult holiday where you and your friends are going to eat, drink and be merry but not necessarily in that order. If they keep pushing, keep repeating it to them.", "NTA do not let them steamroll you into giving up your vacation with friends to play baby sitter. Put them on do not disturb for the weekend. Tell the hotel they are not to share your room information with anyone, and enjoy your vacation. You should not even entertain the suggestion that you baby sit instead of spending time with your friends.", "They clearly saw this as an opportunity for themselves. Do not under any circumstances babysit on your vacation.", "Someone once said to me that you teach people how to treat you - so unless you want this to teach them that your time is at their disposal, you need to say an unequivocal and firm NO to this.\nIt's extremely cheeky of them to assume that you would help them with their daughter. \nYou are NTA if you refuse, and being an AH to yourself if you don't.", "Grow a spine, tell your brother HIS child is HIS responsibility. You’re there for YOUR vacation and relaxation, not for him to use as free childcare.\n\nNext time don’t tell family where you’re staying/going.", "\"Dear Brother,\n\nMy plan is to drink during the day, be very drunk during evenings, and hangover in the morning, so if you think it's safe to leave your kid around that kind of supervision, my price is 100$/hour to pay for the drinks. But I think it would be safer to lock her in your car under the sun at noon, so that you and your wife can relax.\n\nI also think that condoms are cheaper than a lawyer for future CPS problems. Next time, think about it!\"\n\nNTA", "NTA. Your brother and his wife are horrible. Tell them you plan to be drunk the whole time so in good conscience you cannot agree to watch their child.\n\nReally makes me feel claustrophobic what they're trying to do.", "NTA\n\nYou booked this getaway with your friends and you have no responsibility to babysit your niece. Also it's damn entitled of your brother to expect to give up your free time to help him out. They are both there with your niece, they can switch out.\n\nI would be polite but firm. \"Hey brother, love my niece to pieces. But me and my friends already made plans for that weekend, so don't count on me. Hope you have an nice vacation!\"", "NTA start every morning with 3 back to back mimosas while making unbroken eye contact with your brother.", "NTA.  Just explain it to them -  nope, you booked this holiday as a guys weekend and you have plans with your friends.  You are clubbing and drinking. This isn't a family holiday for you.  You didn't expect them to tag along in your guys weekend.  Frankly, they know all this and are really tacky and selfish to follow you.", "NTA You didn't take vacation so they could have a vacation. You took one so YOU could have one. Tell them so in so many words. Or fewer. Like \"Fuck no. Ain't happening in my lifetime.\"", "NTA - My bet is that your brother specifically chose the same dates and hotel to  in order to dump his kid off on you and selfishly ruin your vacation. Tell him you will be enjoying your own vacation and that includes drinking and you don't feel comfortable watching her while under the influence.", "Tell them you are planing on getting drunk. I´m sure they don´t want you then to watch their kid.\n\nNTA", "NTA, I know your terrible at stating boundaries, and you can't be the worst. so isn't this a wonderful time to gift your parents a vacation with your brother? If it's possible push the child to them, either that or when you do get to the hotel, leave VERY EARLY in the morning and only come back at the 10 or something after the nieces curfew, make up some stuff. Be creative. Then you'll never have to say no just say \"oh sorry you just missed me I'm sightseeing!\"", "You might want to block them and any other family members they might recruit to call and text you on their behalf for the duration of the trip so you don’t have to engage at all.", "Your family will not think you hate your niece. That’s just your bad boundary setting talking. This was premeditated on your brothers part. Dont fall for it.", "NTA Tell them that you will not be babysitting.", "NTA, your brother is using you. Everything has been pretty much said by other replies, but update us on your brother's response!", "NTA. “I’m sorry I am hanging out with my friends this trip.   I hope you all have fun”\n\nYou don’t have to make excuses or get drawn into a conversation about it if they keep on trying.  “No, I wont be able to do that” is a complete answer.", "NTA, while I'm usually not one for contacting the authorities but I would try and call ahead to the hotel and explain the situation. If Bro and SIL try to dump the niece with you, you might be able to contact the hotel staff and they can track down her parents and return her. Of course, this is AFTER you flat out tell Bro and SIL that you planned out this ADULT VACATION for YOURSELF FIRST and they had no right to take advantage of you. Only let the staff get involved if it's your very last resort and Bro and SIL don't take NO for an answer.  \n\n\nTrust me, I know it's really difficult to set boundaries, especially in your situation. You love your niece, but your post hints pretty hard at your family taking advantage of you over stuff like this. Use this opportunity to set those boundaries. If they wanted a weekend away they should have communicated with you beforehand, and you could have gladly stepped up, but barging in and claiming YOUR mini-vacation as theirs is outta line. This is YOUR weekend, don't let them take over.", "Getting sh!!faced by noon, or walking around with a cocktail looking drink all day with a wobble sounds like a good idea to dispell the notion you would make a great babysitter.\n\nOr just tell them this is Your vacation and while you love the little dickens, there will not be time this weekend to watch her.\n\nYour Choice. NTA", "NTA  - just respond to your brother “great then we can share a meal during the weekend” plus a phrase like “good choice of hotel, they have a babysitter service at the hotel. I plan to party with my friends!”\nIt’s really not your job to babysit when on vacation where they are not invited! Stand up for your self! And make sure you enjoy yourself.", "NTA. Wow! I can’t believe the audacity! Since it is non refundable I suggest you block his number once you are there, and don’t give them your room number. Tell the reception not to allow any calls from your brother/ SiL/ any family they rope in to guilt you. You are there to spend time with your friends, not family. Get drunk, smoke stuff if it’s legal. Fully book your time. Do not make yourself available. And have fun!", "Lol NTA and tell them to watch their own kid or get a sitter. They think they can walk all over you like a doormat and take away your vacation.\n\n\"I will be enjoying my vacation with my friends. That is what is better to do for me than watching my niece. She is your daughter so YOU are the one who has nothing better to do. You booked your vacation the same time as myself hoping you'd get some free babysitting but the truth is you're going to have to...and I know this is a hard subject to grasp... watch your owwwwn child!\"", "NTA. I’m also someone who has been historically bad with setting boundaries, especially with family. KNOWING that you are not good at setting boundaries is the first (important) step! It gets easier once you’ve done it a few times, and then it starts to feel Great (although all of your relationships might not love it, but that’s ok!). My advice would be to write out a response, using some of the good language people have offered in this thread. You can take your time planning it out and imagine that you won’t send it anyways so you don’t end up being people pleasing. Then you can have something you feel good about saying and prep yourself to say it. Setting boundaries means that sometimes people are going to get upset with you, but that’s ok - at least you’re respecting yourself and sticking up for yourself.", "NTA\n\nHow much are you willing to bet that bro knew what hotel you were staying at and engineered his vacation so you could babysit?\n\nHis deception doesn't deserve your attention.", "Make sure the staff doesn’t give anyone your room number.  You don’t want to open the door and find a kid dumped in the hall for you to take care of.  I know they are not supposed to give out room numbers but sometimes things happen with extremely pushy people.", "Also if all the other family members bothered you about this tell them this. I’m been planning this with my friends long before my brother planned his vacation so don’t blame me for this", "NTA. I wish I had the link for the sibling who was forced to watch his niblings and finally stood up for himself. He detailed how he set boundaries and kept his room info secret. \n\nI would suggest day drinking really early and acting super drunk around your sibling. Too drunk to take care of your niece. No reason for them to know you've only had one sip and it's your only drink so far.", "NTA - tell them you had to cancel last minute and then spend the weekend in different disguises at the hotel! \n\nEven if they discover you! Stay in character!!!", "_I'm sorry bro but I'm really looking forward to this trip and my friends are excited to share this experience with me as well._\n\n_Unfortunately I won't be able to babysit cause we have plans and I simply don't have the time, but next time sure! Maybe we can plan a trip all together to visit some cool place in the next few months._\n\n_Anyway, I'm happy you'll be there as well. It's a great hotel and I'm sure y'all have a good time._\n\n_See ya there!_\n\nNTA.", "No, tell them you’re there to party and you’ll be too drunk to watch their niece by the pool, she might drown", "They did this 100% on purpose they planned this trip last minute on their end to abuse you and force you into free child care, tell them you charge $2000 a day paid cash and due before services are rendered and the $2000 is for.1 hour or 10. Doesn't matter. They are shitty people for doing this, it sounds like they know you struggle setting boundaries and sound like the family doormat. I'd block them all until after the vacation and play dumb if they see you in public, report them to the front desk for harassment and get them kicked out if you need to do not play fucking ball here", "NTA and stand up for yourself!! Don’t let people walk all over you. Have fun with your friends!", "Op, put your foot down! You deserve this vacation! Nta", "NTA but your falling for a guilt trip - no one actually thinks you hate your niece if you don’t babysit her, but they’re saying that to pressure you to get what they want.", "NTA. Do NOT give into this. And make sure you have plan’s frequently where they cannot find you and dump the kid on you. Although that is pretty stressful for you to have to do. Just make sure if they show up you are clear with your plans and boundaries and those plans can just be “doing nothing”. If they decide to make you look like an a-hole in front of your niece, so be it. Make sure you respond to that email very clearly. I’d love an update on how this goes.", "NTA.  Say it plainly \"Bro, I'm there to relax too.  This is a friends trip and I'll be drinking with my friends the majority of the time.  I won't be able to help you with Niece\".  Don't say maybe, don't give in.  You better set this boundary loud and clear.  Nobody is going to think you hate your niece if you don't babysit while you're on vacation.  Make sure you're always with at least one friend so your brother and SIL can't ambush you.", "Dude you really need to tell them that isn't happening. Stand up for yourself...tell them to F off if you have to. That doesn't mean you don't love your niece but them deciding \"hey we are going on vacation too and staying at the same hotel so you have to watch our kid since your there anyway\" NO. The sheer audacity in this makes me sick. NTA and tell them to piss off.", "NTA.\n\n\"I don't remember volunteering to babysit your daughter, so I'm not sure what you're \"really excited\" about. I don't think it's a good idea to leave your daughter with someone who will be partying and getting drunk with friends, because that's what I'll be doing.\"", "What!!!??? That's so cheeky, oh my god. NTA 100% You HAVE to put your boundaries up here and tell your brother in no uncertain terms that you will not be babysitting on your 3 day vacation! The absolute nerve of them", "WHAT. NO. NO. NO! \n\nYou have a pre-booked, self organized, self paid \\*vacation\\*. Your schedule is set. \n\nYour brother and SIL are welcome to follow your recommendation and book the venue as well, but in no shape or way can they demand any of your time there whatsoever. Especially for chores and babysitting. \n\nPlease, please find that shiny spine. This is beyond entitled. I wouldn't even acknowledge the ridiculous demand, I would just reply \"that's nice if you're coming, maybe we can find an evening to catch up, you can join me and my friends for drinks\". Because hey, that's literally the only reasonable accomodation and ackowledgement you should be expected to provide. \n\nYou're almost 30, dude. You have to start standing up. I wouldn't mind babysitting for a family if they paid all my expenses to a destination and I had nothing better to do, but you do, you took vacation time, and you are paying for your own. \n\nAlso, in general, stop doing things for free even if you can. Put a good price on yourself, cause nobody else will have any interest in doing so if you don't.", "OMG.  Stand your ground!  This is YOUR vacation, not theirs!   Say no.  \n\nNTA", "NTA - Set a maximum of boundaries ahead of time because it will be super ackward to be rude to your brother in front of your niece (and can damage your relationship to her). I tell you right away, it won't be the perfect vacation you were expecting at first. Even with all the boundaries, the likely think that will happen is your niece coming ALONE to you by the pool to spend time with you. You need to prepare a nice answer for her. If you are lucky she'll find some friend her age and be in the 'care' of another parent. And you can push her gently to make friends if you see some good kids around. But man, lesson learned to never disclose you vacation plans to bro & SIL. Ever.", "Ignore them. Tell you are not available. On vacation and they should set up hotel babysitting services if they want time off. \n\nLearn to never share your travel plans until AFTER the trip.", "No! No, no, no. Did I say no? I meant NO!!! This is your trip away with your friends. You're not there to be a babysitter. It doesn't mean you don't love your niece. You're there to spend some party time (and recovery time) with your mates. If they ask you to babysit, tell them you wish you could, but you're on holiday. When you get home, if they want a night out, you'll babysit but not in the middle of a three day break. If they don't like it, tough. I know you say they're pushy, but you need to grow a pair and stand up for yourself. If you can do that, then you're nta. If you don't do that, then your family will always know you're a pushover and will always take advantage of you. Also, how will you explain to your mates? 'Oh, I'm just going to be away for a few hours to go and babysit'......I don't think so.", "Honestly I would just start drinking immediately wake up and take a few shots of your brother and sister ask u and ur friends had already started drinking and you don't trust urself to watch the kid \n(⁠ノ⁠ಠ⁠益⁠ಠ⁠)⁠ノ", "I mean, as told, obviously NTA.   Seems auspicious that they’d suddenly decide to randomly stay at the same hotel and have a vacation at the same place as you…a hotel I assume is more of a “resort” and it sounds like a “resort” for adults…\n\n\nIf it were me, I’d watch my niece for a few hours one afternoon or mid-morning because family is important. I wouldn’t be doing it for my brother, I’d be doing it as an uncle though.", "NTA. You are going on vacation and your family come to tell you to be a babysitter? hell no! You are in vacation, just relax and ignore them. You deserve to relax and have fun!", "This is your own time and I would tell your brother that! (If they don’t have a babysitter, then they can take her with them) Your niece is NOT your responsibility and you should not be expected to watch her. I would stand my ground and tell them that you WILL NOT BE BABYSITTING! While on your own holiday. If they say “you don’t love your niece- tell them, they don’t love you by expecting you to watch her on your own holiday. Your NTA for saying no to babysitting!", "NTA. Also just be drunk from the moment you step your foot in the hotel till you leave. Also No is a full statement.", "He's gatecrashing your friends trip. Not cool. Be firm, and strong OP. This is your vacation.  Your brother is the ah here, not you!!", "NTA - \"I can't watch your kid, sorry. it's a DRIKING and PARTYING weekend for me and my friends - that's why we all planned this together. I'm pretty sure you don't want drunks watching her and you wont be wanting her in clubs, so... Maybe on a different vacay I can help you but it will not be this weekend.\"", "NTA\n\nJust ask your brother if he minds if you and all your mates are punching shots and drinking cocktails while looking after your niece?\nMaybe you could take your niece to a stripclub or something!?\nTell your brother to get a freaking clue...", "100% NTA - you didn't sign up to go on holidays with them. You already have plans. Your days and nights are full with pre-made plans. \n\nreply to your family and say \"it'll be nice to say hi, but I won't be able to help with niece. I booked this trip with friends already and we've got a full schedule. I hope the 3 of you get a chance to relax while you're there\"\n\nYou didn't invite them, you didn't offer to help. not your fault.", "NTA.  No is a great answer.  You need to send him a message that as much as you love your niece you will not be available to watch her but look forward to spending time with her when you return from the trip.  Your family guilting you by making you feel like if you don't help that you must hate her is BS, it's total manipulation, you are allowed to have ADULT time to yourself, not babysit and still love your niece.  They have obviously pulled that guilt card on you before.\n\n I know your trip is non refundable but it's far enough out that maybe you can reschedule the days, or you can even change hotels if you can't  change the dates.  Does this hotel have sister hotels?  Sometimes you can contact the hotel and change to a sister hotel without too much trouble.  \nIf you get things changed DO NOT TELL THEM or they will change theirs too.  So when they message you you can say sorry can't help you my plans changed last minute. \n\nAlso have you spoken to your friends about what your family is trying to do?   Get together and come up with a plan they may need to be your buffer  so that when you run into your family you can't watch your niece even if it's to say sorry not today, put a drink on your hand or take you to other child free activities.", "NTA- next time tell your brother and SIL that you are staying at a posh hotel two hours away and give him the dates. In reality you’ll be staying at a nice hotel two hours in the other direction! Or tell them that you’ve canceled your reservation. Put your foot down and you don’t have to be nice about it! This is your vacation and you are NOT spending it watching your niece! She is your brothers problem; not yours! Good luck finding the cajones to stand up for yourself! Please update us to the situation!", "NTA- it sounds like your brother knows you can’t say no. I’m going to guess your sibling is the golden child as well so you don’t feel like your parents would back you up either. For everyone sayin set the boundaries and say no I have a feeling this sibling won’t accept the answer. That being said still try. Let him know that this was an adult trip planned with your friends and you will be drinking and not be able to take the kid. If you don’t drink and they know this then…\n\nThis is a childish response but I would completely ignore them and either block them or silence your phone for the weekend. Explain to the front desk that your family is there as well and under no circumstances are they to tell them your room or transfer the phone. (I have worked front desk this is sadly a common issue of family stalking family for things like this they should get it.) You can also call the hotel directly ahead of time so there is a note a check in that they are not to put you anywhere near your brothers room. \n\nI have had this happen to friends before and I’m definitely the asshole of the group and I went and said something to the family. I’m not shy and I have no problem being rude to rude people. Are any of your friends able to intervene and say something along the lines of… hey we heard you will be at the same hotel, just want to give you guys a heads up since you are bringing a kid that we are not going to be child appropriate so it would be best for your kid if your don’t let them know we are here so she doesn’t get upset that OP won’t be spending time with them. \n\nLegit this sucks I’m sorry", "NTA\n\nMaybe respond and say to them, \n\"Hope you enjoy your stay - I'm going to be with friends so dobt anticipate being free to hang out with you or niece on this trip, and I won't be available to babysit her. - let's arrange to meet up once we're all back home, when I'll be be free to spend some time with you all\"\n\nTell the friends you are with and ask them to help you (by, for jnstance, coming over and 'remunding' you they're waiting for you, if you get cornered by your brother or SIL.\nBut respond NOW to you brother and tell him you love hom and niece, but you won't be available to help look after her on this specific break.", "NTA. You are entitled to a holiday and they are not entitled to your time. This is terrible behaviour on your family's part.\n\nThey booked this deliberately to use you as free care whilst they get a holiday, on your expense. This is horrible.", "NTA", "I would reply:\n\n\"Oh wow, you really got me there for a minute, I can't believe you were pretending to be one of those pushy parents who make everyone priorise their kids. Good prank, I'll see you all when I get back\"\n\nNTA.", "If you suffer from setting boundaries then now is the time to start learning. Good luck, this one's on you otherwise and you would be the A to yourself. Be pushy back.", "NTA - you are 29 - get a spine and say no - or continue being a doormat", "NTA - Offering my opinion, you need to put your family on an information diet.  While I can sense that you are excited about your trip, you may want to stop sharing so many details.  Unreal that your brother would do that to you.", "Nta,  you don't hate neuce anymore than they do trying to push her off on other people", "NTA  they're trying to use you as a Free babysitter during vacation time you scheduled prior to them. Nope nope nope!", "Tell your brother that you will be too busy to help. You have already made plans and can't change them. They don't need to know what they are. Perhaps don't let him know your room number if you can. But don't give in, it will ruin your trip. Plus you'll be letting your friends down. NTA", "Your brother is the A.H. You told him your plans and he hijacked them. \n\nCall him out on what he did. Make it clear you're there for time with yourself and friends. \n\nYou might want to take a gift for your niece (pool toy or something she can use there) and explain to her when you see her that you're on a grown-up retreat and had those plans before you knew she'd be there and that you'll see her at a later date to do something fun with her. Because your brother might try to use her to guilt you into time with her.", "NTA, straight up tell your brother CPS will talk to him about child abandonment if he attempts to abandon his child with a partying frat boy. You signed up for partying, he signed up for parenting, and you're absolutely not switching with him. \n\nYou'll also probably need the following line: \"then you should've spent your money on a baby sitter instead of an expensive hotel with no childcare\"", "How many fake posts can a sub have?\n\nMaybe the mods should make some aitah posts, ya? Easy verdict", "NTA - tell him you have activities booked the whole time so can’t commit to baby sitting.", "Nta absolutely do not do it.", "Here's a secret every people pleaser need to know: when you finally learn to say No, people will get mad at you, but thats a GOOD thing. Them being mad at you isn't some world crushing punishment. It's the final fussy burst before they leave you alone because they realize you can't be manipulated anymore.  \n\nThe anger is a last gasp attempt to control you. Ignore it and enjoy your vacation.", "NTA and now is a really, really good time to get firm with your boundaries. This is YOUR vacation. You can either be a doormat or stand up for yourself. You planned this before they did. In fact, they probably planned it just so that you would baby-sit. If your family will think you hate your niece simply because you want to go on the vacation you planned for, it's their problem, not yours. JUST SAY NO.", "For this one, you need to put up some boundaries. I mean, what is the probability that they booked the same place, the same days, just so they can \"use\" you?\n\nIf I were you, even though they are pushy, answer saying that, this time you can't. You have planned with the guys some adult things, and you can't babysit, sorry you if guys feel offended, but it's not my responsibility since I'm the uncle, not the dad.\n\nAnd if they just throw the kid there and go out of sight, I'd just call the security and say, that the parents left the kid alone.\n\nIdk if it's easy for me, since I'm not that attached to my family and since I became a mom, I don't let her with no one at all, because I know that is my responsibility, and I have to find a way to relax with the kid together, even though our moms offer, we know and assume or obligation.", "NTA grow a backbone and say you can’t help as you will be drinking and having a good time. Speak up!", "Just tell them that you have plans for every day that you are there and those activities are non refundable and you won’t have time To babysit. Your friends have booked a pretty solid weekend and this was your plan to spend it with them. you have adult only plans.\n\nTell them you love your niece more than anything, but this is an adult vacation with your friends. You will not be available. Let them decide what they want to do and stick to the fact that you were not available", "NTA. If you're really too much of a pushover to say no to their ridiculous requests, just start every morning with a few shots. If they don't take \"I can't babysit, I'm already drunk\" for an answer, they're terrible parents... though they may start to worry you have a drinking problem.", "Answer, \"Nothing better to do than baby, while on my vacation? So YOU  2 can relax with adult free time? That's exactly what I am planning to do: relax with my friends and enjoy adult time, while on MY vacation.  Find yourself another babysitter and pay them. \"", "NTA, and go a step further, advise them their numbers will be blocked for the weekend and advise the hotel you do not want your room number disclosed to anyone so they don't just dump her outside your door.", "NTA - and wakeup call - they know why you're going there and for what and are trying to hijack and guilt you into their whim.  \n\n \\- be direct, be firm and be clear - no you are not going to hijack my mini holiday, and whether or not I have \"anything better to do\" doesn't mean you get to plan my time.   Sorry - I will be busy all weekend.   \n\nThey are doing this because you probably have succumed to the guilt in the past, but to do it on your holiday is just over the top entitlement.  Dont stand for it and don't let anyone tell you  this is somehow your responsibility.", "Is this really true? Do people really ask and expect things like this? I just can't even imagine asking something like that. \n\nNTA", "Well,  your brother can pay you for time and accommodations.  Or you can tell him the f off.  Why did he deserve rest and relaxatoon and you don't?  \n\nIt's OK to say NO.\n\nNTA, unless you keep letting yourself be a doormat.", "NTA\n\n&#x200B;\n\nDo not give in to that BULLSHIT. THis is way beyond any reasonable behavior. \n\n&#x200B;\n\n Tell the front desk they are not allowed to tell them your room number. And put them on silent.\n\n&#x200B;\n\nAnd tell Brother and SIL you won't be available for babysitting, all days are already planned. And put them on silent until the vacation is over.\n\n&#x200B;\n\n\"or my family will think i hate my niece. I\" .. Only if they are AHs. so let them think whatever they like and set a HARD boundary.\n\n&#x200B;\n\nWhenever you meet them, make sure they can SEE you are drunk (even if yo are not), and say: \"sorry, can not babysit in that state, anything might happen\".\n\n&#x200B;\n\n&#x200B;\n\nAnd NEVER AGAIN Tell them your plans.", "YWBTA for not telling bro to fuck right off, people are right, stand up for yourself", "Tell your brother your babysitting rates are $200/hour. No family discount. Cash up front.", "The only way to get better with boundaries is by exercising your right to them. NTA for using your time and money how you see fit.", "NTA.\n\nI agree with the \"Hi Bro so nice to know you are going to have a vacation and spend time together as a family.  I have a fully booked itinerary with my friends so I probably won't see you but will wave and say hi if I do. \nPlease remember I am on vacation too and am not babysitting on my vacation. Enjoy yours. \n\nDo not offer to babysit and decline when asked. \nFOOT IS DOWN", "Oh my god!! Absolutely not. As a parent with young kids, this is such an AH move by your brother. \n\nDon't feel bad about setting a boundary, they absolutely know what they are doing and it's not ok. I would send a text similar to one I saw above:\n\n\"Haha what are the chances! If I'm conscious then I'll come say hi, but I doubt my blood alcohol level will be  below 2.0 even when I'm not out partying\"  \n\nOr something to that effect", "NTA. Your brother is a major asshole. You’re going for a weekend. It costs money. You have neem off in months. Like you say, you love your niece. That’s not whatnot about. It’s about your time and money and freestime. Then assuming you’ll play babysitter, really fuck that.", "\"If you're a giver, know your limit 'cause takers gonna take\"\n\nOP NTA", "NTA Stay strong OP!", "NTA you’ve made plans, stick to them", "Set boundaries or the boundary goblin will devour you.", "Repeat after me\n\n\"dear brother... Fuck off\"", "\"Sorry, my schedule for the weekend is already booked solid. In case we don't run into each other while there, I hope you have a great time - I think you'll love that hotel!\"\n\nDone and done!", "NTA. \n\nLet them think you hate your niece. Then they will stop pushing babysitting on you.\n\nAlso tell them you will be drinking and not able to watch her while there. I think you also learned to not share your travel plans with anyone.", "NTA, but either say no, avoid them like a game of hide and seek, or let them ruin your vacay....You're choice. But this is a prime example of when you need to set boundaries. That's their child their responsibility.... And it sounds like you they are absolutely trying to encroach on your weekend", "NTA. I'd just right back and say, I assume you're paying for my entire stay then as you want me there as a babysitter? If you're not then you'll have to make alternative arrangements as  I intend to fully enjoy the holiday I've paid for.", "NTA.  Your brother is a real piece of work.", "YTA to yourself! I’m not sure what you want Reddit to do here, call your bother and tell him off for you? You are the only person able to stand up for yourself and make sure you are not taken advantage of. If you don’t want to do that then enjoy paying for an expensive place to stay while minding your niece. Your Bro is pushy because as you said you allow it. So either say no or get over it. Sorry for the harsh reality but that’s how it will be without a back bone.", "Inform your friends so they can back you up, be honest with them", "Oops- someone in your party got covid and you had to cancel the trip. Also, you've been exposed, and wouldn't want darling niece to get sick. Cough, cough.\n\nAlternatively, contact hotel about in room child care providers and have one on deck. Most nicer hotels provide pre-screening for this, and allow services to be billed to the room- meaning their room.", "Just wake up and start drinking immediately, if they try to hand the niece off act reaallllyyy drunk and then proceed to pass out in front of them. Seriously though I hate the entitlement some parents have, I have 2 small kids and they are mine and my husbands responsibility alone. We appreciate when people help us out, but it’s never expected. Do not tell them what room you are in and ask the front desk to not give out your room number if asked. Also work harder at setting boundaries, as a former boundary less person it’s needed.", "NTA... What if you just remain semi drunk? Do they still let you take care of her semi drunk knowing you will be drinking more?", "NTA. Secondly - if you’re unable to say no, ask your friends to help. Also, lie. “I’m drunk and sleepy but if you don’t care if she drowns…🤷‍♀️”", "Block their numbers for the weekend. I cannot believe the entitlement. I’d honestly tell them to fuck right off & probably never babysit for them again.", "NTA stand up to them and refuse to babysit. It's their child not yours", "Tell your brother that you and your friends have plans for every day of your break so you won’t be available for babysitting. Tell your friends that your brother is trying to guilt you into babysitting so let’s get some plans made. If your plans mean drinking in a bar, they’re still plans.", "NTA. If your family is at all rational, they’ll understand from the timeline of when you booked vs when your brother booked. Do NOT bend on this even a little - if you take her for even a little bit that weekend, they’ll probably try to guilt you into watching her more. Time off to relax is valuable, and you deserve it. Don’t let your family ruin that for you.", "Learn to say NO! And what kind o devilish plan did your brother plot to go the same weekend to the same hotel! They just couldn’t handle the thought of you being happy for once do they? \nTell them that this is a friends trip and they knew it months before. And you plan to have fun and tell them to hire a babysitter. And tell the hotel to not give your room number to anyone! Because they will leave your niece at your door.", "NTA. “I’m sorry, I already have plans with my friends and won’t be free to watch your daughter.”", "NTA, stand up for yourself. This is a completely shitty thing to do to invade your mini-vacation for a babysitter? Please tell your brother to fuck off, from me. Next time, don't tell them in advance.", "NTA\n\nTell them that you have plans with your friends for the entire weekend, and that those plans include being intoxicated, so they need to make other plans for childcare.  You aren't available for babysitting, or to spend time with family on this trip.", "If nothing else, tell your brother that you would be happy to help after you finish your third Bloody Mary ... or is this my fourth?\n\nYou're with your friends. Act irresponsible and get drunk off your a$$, or at least make it look that way.", "NTA, this was done specifically to make you look after her", "NTA\n\nsend a text saying that you will not be able to help with your niece as you are on vacation with friends and will likely be either relaxing, drunk or hungover. Also, you plan to be with you friends, not babysitting.  Say that they should not be relying on any childcare from you at any point in the weekend and they should not have booked the same hotel thinking you would be babysitting.\n\nif you feel you can’t enforce your boundaries, do not answer any calls because they may try bully you.  Repeating by text that you are on vacation and will not be helping them at any point in the weekend. Do not apologise at any time about this as you have done nothing wrong.\n\nps Do not listen to comments that you hate your niece, no one really thinks that, it’s just a form of bullying to get what they want.", "You simply say ‘oh I’m sorry we have plans for the whole weekend with my friends; next time I’d be happy to help if we arrange with more notice in the future…’\n\nNO ONE will have a problem with this and if they do they really don’t deserve a lovely SIL like you.  It definitely won’t look personal to your niece they have blatantly taken advantage of you here.\n\nNTA", "NTA  Time to hate on the in laws and the niece! enjoy your vacation, draw a line in the sand and grow a shiny new spine!", "Allude to an abundance of blow and hookers, maybe one of them loves kids too…", "Obviously the main advice has to be that you need to be firm with boundaries and stick to them.\n\nIf you're really sure you can't do that though, be drunk. Even if you're just faking it. Any time they come near you, stumble and slur.\n\nAlso, if you have the right kind of friend, get that friend to be blunt. A lot of us have one of those friends who doesn't have a social filter. Get one of your friends to stand up for you if you're not able to yet. They can embarrass your brother by loudly pointing out how rude and selfish he is for asking.\n\nNTA", "NTA but you really need to learn boundaries. You’ll feel so much better once you do", "Just make it clear you booked this trip with friends so you are unavailable, and don't tell them your room number. They won't find you. NTA", "NTA. Be clear right now that you are going to party and do not intend to be available or in any shape to watch a child, especially around water. Make sure they are clear on this and any expectations they (wrongfully) have are on them so they can't accuse you of being unreliable. Then when you get there party your face off and just be drunk the whole time, or at least pretend like you are.", "OP, please make sure they don't know your room number and make sure you continue to say 'No' when they run into you at the hotel. If they leave her with you at the hotel, report them to the hotel management for abandoning their daughter.", "YTA if you actually cave in to this insane demand.  Time to MAN UP!  This is the perfect time to set some boundaries - I don't care how hard it is for you or how pushy they may be.  Your brother is being a total AH and you're allowing him to do it.  It is mind boggling that he would completely hijack your vacation by dumping their child on you.  This is a hill to die on and it's way past time you started standing up for yourself.", "I'd have just said that\n\"Bro, Me and my friends are gonna be by the pool, drunk most of the time. If you're happy to leave your daughter in that condition....\"", "MN passive aggressive- If pressured to watch niece- agree, but be vague in time/ don’t show up/ move to later/ tomorrow/ sorry my friends took me out/ sorry too drunk/ sorry to hungover. You can agree in priniciple, but be totally unavailable in reality.", "Text: I committed to a single guys weekend trip - don’t plan on me babysitting. \n\nThey must hate their daughter if they’re not willing to watch her. That’s such a stupid dramatic thing for anyone to say. So say it right back. \n\nCan’t babysit, busy. Talk soon.", "stand up for yourself. tell them no", "NTA. If you can´t set boundaries, get drunk as soon as you arrive. Be drunk ALL THE TIME (or at least pretend to be). They won't \"let\" you babysit them", "Tell him you changed hotels and if they still go avoid them at all costs.", "NTA. You have plans with your friends. Tell them your weekend plans don't include them and aren't appropriate for a 4 year old.", "NTA - “hi bro, I think there must be a breakdown in communication somewhere. I’m not going on vacation to be your babysitter. I love niece to pieces, obviously, but this was planned as an adult vacation. Happy to plan something else down the line where I can manage niece but it won’t be this time. I want to make it very clear that despite you being at the hotel and me relaxing during the day does not mean I’m free to care for her. Please do not ruin this for me by trying to hijack my vacation so you and SIL can get a break. I love you but this isn’t a family vacation and honestly a little put off you tried to push this on me. I will be ignoring you at the hotel. I hope you enjoy your vacation but don’t be surprised if you try to dump niece on me and I walk away. This will cause a huge rip in the foundation of our relationship. I think it was incredibly rude for you to assume I will be your babysitter on a vacation I planned with my friends.” Take care of this now, remind him right before. If your parents say anything, limit your interactions with them. Learn to set boundaries.", "NTA!!  It's amazing that your brother wants to horn in on your vacation time and dump his kid on you.  Tell him no, and next time, keep your vacation plans to yourself.", "NTA. That's very presumptive of them. Do they own your time? I suspect not.  Tell them to jog on. And don't tell them holiday plans in future.", "NTA-this is an opportunity to learn to be clear about what works for you and what doesn’t. it is ludicrous of your brother to think you’ll spend your precious vacation time babysitting.  DO NOT compromise.", "NTA", "NTA. Don't respond to the message at all. If there's any way you can make it look unread from their end, do that. And if you happen to run into them, act like you're really hammered (even if it's 8 AM), act all surprised, and give them big slobbery hugs before staggering away with your friends. Do your best to pretend you weren't looking at messages and were boozily surprised and delighted to see them.", "Tell them that they will need to find other alternative plans for your niece and then disengage. Block their number for the weekend and block any relatives that may try to bully you into this mess. Don’t answer calls or texts or VMs. Don’t allow them to rile you up everyday with endless messages and conversations about their needs. If you can completely shut off your phone, do that. \n\nI had a cousin do something similar once, and I didn’t block him over the weekend. Even though I didn’t host his lazy ass, I continued to get messages all weekend long which exhausted and frustrated me.", "Change hotels if possible, and keep it private. NTA. Your brother is really disturbed.", "NTA and make it clear you are not going on vacation to babysit your niece. Say “I’m not going to babysit for you” be really clear so they don’t act like they didn’t know when they get there.", "Be drunk 24/7 so it's not safe to watch the little one.", "NTA.  But, since this is already happening, take the kid for one 1-2 hour slot after breakfast. And that's it. Have fun with her and then wish them a good weekend.  This was a pre-planned trip with others. Lots of rudeness on your families end.  Next time they get to hear about your travels post trip. Live & learn", "‘Unfortunately I will be far too fucked up to take responsibility for the child, I probably shouldn’t even be responsible for myself that weekend’ laugh and walk away…", "NTA. Get drunk, stay drunk the entire weekend.", "NTA. See if you can get the hotel to keep your room info private or under a friends name. I could see them dropping her off and running. Try not to tell them where you are, if they ask if your in your room tell them your out at a bar, etc.", "Wow the entitlement. Make sure to let them know that won't work with you, you have an itinerary /plans but that you're so very glad they brought niece on a fun holiday or some other sentimental thing. If you don't set boundaries, your SIL WILL TAKE ADVANTAGE.\n\nThe fact they didn't ask, just assumed is a red flag. NTA", "> I am either stuck with babysitting(her parents are really pushy and i am the worst at setting boundaries) or my family will think i hate my niece.\n\nI'd take option #2\n\nYour niece won't remember. You can deal with family after your fabulous vacation.", "NTA. \nYou may wanna b semi intoxicated throughout ur vacatio.  always have a bottle on your hand. I doubt they will trust u to look after their kid when u r flush with drinks.", "Get your friends to run interference for you every time your brother and sister and law try to get you. Don’t answer your phone and don’t give them your room number.", "NTA.  You reply back.  \" I told you earlier that I was going on this trip with friends and that we have adult plans.  I will not be able to babysit or help with your daughter.  It is really unfair of you to even ask.\"", "Tell them you're on vacation and will be drinking.  You will not be able to care for children.  Full stop.  Do not get into discussion.  Just say NO!", "NTA- have a drink with breakfast, mimosas, tropical smoothie with rum, whatever- when the parents ask say “well I’ve already started drinking and don’t feel comfortable with 4yo so you’ll have to make other plans” rinse and repeat", "Your family will think you hate your niece because you don’t want her dumped on you during your vacation?\nEither they are dumb, or they’re manipulative jerks.\nNTA. Enjoy your vacation. Your brother is responsible for his own child.", "NTA, if you had said to them, hey, why don't you book the same holiday & I'll be able to help look after my neice, then fine, but you didn't. They found out where you were going & decided to book the same holiday in the hope of getting free baby sitting, they should've booked somewhere with a kids club if they wanted that. You are going on a holiday for you, not them. \n\nTell them, it will be nice to see them there as well & you'll say hi & pop over for a chat by the pool if & when you can, but you are there to spend time with your friends & you will likely be hung over during the days & out in the evenings drinking, so you won't be able or willing to help out with your neice as you be in no any fit state too. Just be careful, they don't try sending her over to \"visit\" her uncle during pool time .\n\n Next time you book a holiday, don't tell them where your going or tell them a different hotel name & then say yours changed last minute, so they can't then change their booking.", "Stay hammered. NTA", "\"No\" can be a complete sentence.\n\nNTA", "Nta", "NTA\nGet a polite refusal over text clarifying that this wasn't something you agreed to, and that it would be dangerous for your neice, given you will be drinking.\nThen, if they try to turn this on you/bring this up with your family, you can show the text proof that you never agreed, and remind them that they were aware you would be drinking, and therefore unfit to watch your niece. :)", "Well you’ve learnt a valuable lesson here. Never tell your brother your holiday plans ever again as he can’t be trusted. NTA. Do not allow your family to take advantage of you like this. Be clear this is your holiday time and you won’t be babysitting their kid. They chose to have the kid they don’t get to dump her on you on your holiday for them to have free time. Tell your friends and make sure to plan other things so that the kid can’t be dumped on you. Don’t tell them which room you are in and don’t tell them your plans be clear you will be out all day and night as this is your holiday", "I do believe it is time your niece learns a few new words from you. I would start with \"Cloaca\". Be clear on exactly what it is, anatomically. Talk to her about how there are sea turtles that breath through their Cloaca.\n\nGo to dinner with your brother and start discussing turtles with your niece. Let her bring up such a wonderful word, preferably loudly. At her age, she is bound to repeat a LOT of interesting things your brother would never want to talk about at dinner!", "NTA. Stand up for yourself! It’s your vacation, tell him you are unavailable.", "Make sure the hotel knows to not give out your information or room under any circumstances. Bring your friends in on the issue. They will be happy to run interference for you. Message your brother back tell him you hope they enjoy their vacation but you will not be available. Block them after that. Enjoy your vacation w/o babysitting.", "“Hey bro, I was really hoping you are more responsible than that, what kind of parents leave their kids with someone that is going to spend the whole weekend drunk? You better take a babysitter with you or I will be forced to tell the whole family how irresponsible you are! “\nDo it and throw the blame at him.", "NTA, but YWBTA to yourself if you don’t start setting serious boundaries. I’m sure with that age gap, your brother still sees you as a child. It’s okay to demand to be respected as an adult.", "NTA This is your vacation. \n\nJust say no. If they try to leave her with you, walk away. Do not let them push you around.", "\"I'd love to look after my niece but as you'll \"have nothing better\" I just you'll just be looking after her yourself.\"\n\nNTA", "Please refuse to watch your niece during this vacation. Do not say yes to even 5 minutes. They can't just decide they can tag along and make you watch her.\nIf they get mad let them. This is your time off, you paid for a nice place to chill with your friends. \nBrother and SIL are huge entitled AH's!", "NTA - How entitled are your brother and SIL to book a holiday at the hotel you will be so that you can babysit while they relax? It's THEIR kid, hence THEIR responsibility. If anyone gives you grief for not wanting to babysit, just remind them your Brother and SIL don't want to parent. Enjoy your holidays!", "NTA\n\nYou need to directly tell them \"No\"\n\nIt is a complete sentence.\n\nIf they can't get that, send them a bill for your entire non-refundable trip including travel and stay costs.  Make sure they understand that you are not a babysitter, you are family, and that they are not allowed to co-opt YOUR vacation that YOU paid for.", "NTA. Good luck with your holiday.", "Nta send them a text back that you will be with friends. You will not be babysitting.\n\nContact the hotel and let them know not to give your room number out to anyone.\n\nStart drinking immediately. Always have a drink in your hands.\n\nHonestly you be the asshole if you let him ruin this vacation for you. If you’re not good with boundaries have a friend that doesn’t give a shit answer the door if he show up or if he approaches you and let them embarrass him by saying it’s really pathetic that you don’t want to take care of your own kid that you have to stalk and demand someone to baby sit on their vacations .\n\nHonestly get a therapist. Start sitting boundaries.\n\nIf you can’t stand up for yourself. See if your friends know someone who will pay out your part of the trip even at a lose. Be cause if you can’t stand up your going to pay a damn expensive price for the privilege of babysitting.\n\nHonestly stop babysitting. Say no every time they ask. If you do this enough they quite demanding.", "YTA TO YOURSELF....GROW A SPINE AND TELL THEM TO FUCK OFF....\nI'll never understand your kind ...being nice is one thing but you basically beg them to abuse you\nI also find it hard to believe a 20 something year old male would be this much of a pushover or people would take advantage of someone or make Such a plan so I call Bullshits on the whole story", "No is a complete sentence", "The audacity of some people with children is insane \n\nStand up to your brother and tell him you won't be babysitting. \n\nNTA", "NTA - next time you’ll know not to share any details with your family.\n\nDo tell them: ‘I think you misunderstood me when I was telling you I was staying at this hotel. I’m away on a girl weekend and we will be out until late and drinking. I’ll wave hello if we happen to bump into each others but I’m not able to provide any babysitting during my time away. Please make appropriate arrangements with the hotel/a professional babysitter if you wish to have any alone time.\nI’m so glad for you that you’re also going away. Have fun!’\n\nOr something similar.\n\nYou have to put boundaries and ask your friends for help. They can tell them off at the hotel if they try yo leave your niece with you.\n\nThey had fun making their kid, they’re the only people responsible for her.\n\nMake sure to tell the hotel ahead of time that they’re not allowed to give out your room number and ask for them to be on a different floor than you. \n\nBe ready, they will drop the kid off even if you say no. Be ready to call reception to tell them a child was left alone and for them to call the authorities. Tell the parents it’s what will happen if they try anything.", "If you get stuck with your niece it will be because you allow it. Block your brother and SIL while you’re on this vacation so that they can’t contact you and guilt you. Seriously they are such AH’s to go out of their way to ruin your vacation. Maybe be cowardly and tell them you’ve switched hotels. Better to grow up and stand up to them, even if it makes them mad.", "NTA\n\n‘That’s awesome, I’ll definitely see you around. Not  going to babysit sorry, I’ll be drunk or hungover to be left with a child.’", "NTA.. Just tell them your weekend is fully planned so you won't get a chance to spend any time with them.", "NTA\n\nTo be honest - if you're afraid of confronting them - i'm not feeling pity for you.\n\nYour brother is planning to majorly fuck up your vacation - and even then you're doubtful about stepping up for yourself?\n\nIf this was me - i'd be freaking mad and express this madness.", "Seems like ragebait to me. I know there are jerks out there, but I can not believe you told your brother you are going on vacation with your friends and he said anything close to \"they are also really excited that i can help with my niece since i am also there and they can relax in the meantime and according to them i have nothing better to do.\"\n\n\"Yes you are going to a hotel on vacation but what if instead WE go on vacation there and you babysit our kid instead of vacationing?\" I just won't believe it, or that anyone wouldn't just laugh at such a request.", "NTA. Tell them your time is already completely scheduled. Put your phone on dnd and do not look at any messages. Do not ever tell them your plans again. Have not guilt. You are not a babysitter and you paid for this vacation. Also tell the front desk not to put any calls through to your room or confirm if you are staying there.", "Your brother knows you are a push over so he planned a trip where he would have a full time unpaid nanny (that’s you op). He said you had nothing better to do? Like you booked an expensive hotel so you could what? Try a new mattress, enjoy the hotel breakfast or  check their shower pressure. \n\nHe knows exactly what he’s doing.  Yes he and your family will give you a hard time. They have trained you to except their bs and you have to show them and train them to know that you’re aren’t here for it and whatever unwanted tasks or chores the choose to force on you. \n\nNo is a complete sentence that doesn’t need explanations. They can accept the short answer no. Or the rude one hell no. You need practice to be comfortable saying no. Let this be your first opportunity to achieve the goal of setting boundaries and sticking to them and erasing push over that’s written on your forehead.", "NTA\n\nBut, explain the situation to the hotel.\n\nGive them a ring and just tell them what's going on. Let them know you'd like the rooms as far apart as possible and you'd like to make sure the desk staff don't share your room number or whether or not you are staying at that hotel with anyone. If anyone asks for a guest by the name of X, Y, or Z; they'll just say \"sorry we can't give out that information\".\n\nThen put an auto-away message in that says \"disconnecting for the weekend so I can recommend with myself\", pause all notifications, and enjoy your weekend. Carry around an empty beer bottle or a wine glass with a little juice at the bottom whenever you're in a public part of the hotel and just always be \"drinking\". Don't ruin your vacay by being constantly sloshed. But always look like you aren't sober enough to babysit. 8am? Mimosa time (or OJ in a champagne glass). Noon? Mojito time (or soda water, mint and lime).\n\nThen, never share your travel plans again.", "NTA what absolute bastards booking the same hotel so you can babysit while they have fun - after all your time is less precious than their time, send back a text saying \"sorry but I wont be able to babysit as I have paid a lot of money for this trip and my friends and I have already planned out what we want to do during the whole trip\" if that doesnt work them a quick text saying \"fuck off\" should work", "You're NTA here, but why did you tell them where exactly you where staying? \n\nNothing wrong to just have fun and chill a weekend. Your brother and SIL have no right to claim your time on YOUR vacation.", "NTA. Either your brother is a jerk or he is pandering to a controlling wife", "NTA.  Make sure  they dont know your  room number, make sure to be out early on adventures not suitable for a 4 year old.", "Drink a beer, and tell them you couldn't be responsible for a child after drinking, sorry. And of course, not during the hangover...", "They are setting you up. Say no, tf? Nta", "NTA but setting boundaries is the only way to salvage this vacation. They are way out of line for intruding on your vacation and acting like your time is less valuable. You are under absolutely no obligation to babysit and need to make it clear that your time is booked from morning until late at night with your friends and that you will not be helping watch your nieces.", "NTA. Just stand up for yourself and flat out tell them that they will have to make other arrangements for your niece because this is your time off.", "NTA\n\nCocktails for breakfast and stay visibly wobbly the entire time.\n\nHave fun!", "Hey OP, if your brother keeps insisting on you babysitting your niece, tell him “cool don’t forgot your nieces sippy cup, so she can have a beer by the pool too” he won’t ask again.. but please don’t ever actually do it..", "NTA- tell them you’ll be happy to babysit, the rate will be $30 per hour and you will be charging them your meals and all the excursions you have paid for and they expect you to miss. \n\nTell them you also want the money up front before they arrive. \n\nYou are going to be painted as an AH, so might as well give them something to be a victim about.", "Talk to your friends and find ways to be occupied at all times. If you can’t say no, don’t be in a position where you can say much.", "Some great scripts here for texting or calling! Memorize them, use them, & have a great trip!", "Nta. No is a whole sentence and needs no explanation from you. Simply say no if pushed tell them strait this is your holiday u booked it with friends and did not ask them to crash your first time off in months so they get free babysitting.", "NTA but learn to stand up for yourself. The time is now.", "Nta of course not", "Also in future OP should not share his vacation plans with his brother so far in advance for him to sabotage it. Only mention it a couple of days before the trip.", "Add a \"I'm sure the hotel will happily direct you to a babysitter that isn't either hungover or drunk, like I intend to be. Have fun!\"", "I would also add: \"You probably wouldn't want me to watch your daughter anyways since I plan to either be drunk or hungover.\" \n\nThere was a post a while back, where a childless OP was always forced to watch a bunch of kids during family functions and he was fed up with it. So he got slightly drunk (or maybe high?) and just said something like \"Sorry, can't do it right now, Wouldn't be responsible to leave the kids with me at the moment.\" Everyone was mad, but he got to enjoy a familiy function for the first time without having to watch the kids. \n\nIf OPs brother tries to trick him into watching his niece something like that might also solve the problem...\n\nNTA and enjoy your trip as you planned it.", "Let the people at the front desk know that your room number or information should not be given to anyone, even if they claim to be family. \n\nLet your brother know that you need this down time, and if they try to ambush you and leave your niece with you, you will call CPS.\n\nTurn your phone on DND as soon as you and your friends settle into the hotel.", "And don't forget to add that you will be drinking most of the weekend, and therefore, in no shape to supervise a four-year-old.", "This! Brother is pushy because OP doesn’t set boundaries. He knows he can get his way. OP, you teach people how you want to be treated, and if you watch niece, you are further teaching them that you will do whatever they want/", "Maybe also block their numbers during the time that you are there.", "NTA. Today is the day you start sending boundaries. Like, right now. Don't sit on this. Tell him TODAY you will unavailable to babysit.", "This. And if you're having trouble standing up for yourself (easier said than done), don't hesitate to ask your friends for help. It might be easier for them to tell your brother not to bother you or to drag you off whenever your brother approaches you.", "Thank you, i should engrave this in my brain", ">Part of setting boundaries is knowing the person will be displeased with you, and that's OK. \n\n\\^\\^\\^\\^\\^ This!", "> You don't have to answer any follow-up questions.\n\nYes! This is what is meant by \"no is a complete sentence\".\n\nIf you do feel pressured for a reason, \"I said no\" tends to be a pretty solid reason.", "My mom is an absolute boss at saying no.\n\n\"No, I'm not going to be able to do that.\"\n\n\"No, that doesn't work for me.\"\n\nNote the absence of \"I'm sorry\" or \"right now\" or \"I wish I could.\" All of those are openings to exploit. Resist the urge to use that language, even if it feels better to you. Boundary stompers will exploit it.", "Exactly. Either set boundaries, grow a backbone, or be forever at others beck and call, and you will be miserable. Set the precedent now, or your life will not be your own. And never ever tell your family your plans.", "\"Sorry, I have commitments to my friends for this vacation. I'd love to see niece once I return home. Hope you have a lovely time.\"\n\nThey clearly booked that hotel after you told them about it so as to exploit you. Lesson learned - next time be less forthcoming about your plans.\n\nBut you need to draw a very bright boundary here, or you'll be stuck doing this in the future as well. \n\nRemember, you need to please your friends. You committed to them before your brother tried imposing on you.", "No. Never apologise to someone who's making such an absurdly unreasonable request!", "Don’t say “cannot” because that invites them to evaluate those plans and try to “help” you by figuring out new plans. Just say you’re not going to change them.", "Hmm, i dont agree with How nice you will be staying at the same hotel.  No, they intentionally tagged along on his trip.  I'd  provably say I'm very surprised to hear that you have decided to book at the same hotel during my guys weekend.", "Also let the hotel know ahead of time that you have family staying there and that it’s very important they don’t get your room number or phones transferred. I worked in several hotels in a ski town and lots of family events. Believe it or not several family members each time came up to the front desk to spill the teas and explain under no conditions may we put them on the same floor or ever give out room location. You don’t have to tell them any drama just say it’s very important you are left alone for the weekend no matter what. Also let them know that no one in your family will ever call them for an emergency. They will note this in your file and it should show up anytime your name or room is pulled up.", "Thank you for your response. The thing is my Brother is the Messenger and my SIL makes all the decisions in their household. SIL is the type of person that can‘t take no for an answer.", "If bro is golden child, then narrative to parent won’t make a difference.", "Also make sure and let the front desk know to not give out your room number to anyone including family.", "If you agree that OP is nta, then why do you in the next sentence suggest he give up at least a 1/2 day of a 3 day vacation just because brother demands it? Really confused by your logic here. You can't set boundaries and then simultaneously let someone trample them.", "And also lie about which hotel he is staying in!", "[removed]", "Don’t share your room number and turn off your phone.", "I disagree. OP should confront this like an adult and learn to set hard boundaries.", "OP should tell the front desk that they should not connect any calls to his room in case big bro tries to dump and dash on the kid.", "Phone him from the airport  - on the return trip.", "I don’t tell family about trips Until we are back. I usually wait 6 months to a year or more before I even post pictures from a vacation. I don’t want anyone to know where I am as my extended family can be sketchy", "Better to wait until after he travels to tell them if they think because he's child free he's always available to babysit.", "And start drinking at noon.", "OP should share his plans with his brother… the wrong plans!!!! Give the wrong date/times/ location/hotel etc!!!! 😆😆😆😆", "YTA to yourself. You're 29 years old and cannot stand up to your family? Grow a backbone, OP, and tell them that you are not available to babysit the entire weekend. You have made plans and absolutely will not watch her and that they dare not approach you at any time during the weekend. What the hell, them coming to the same hotel.\n\nCome on, OP. The first hint of you even considering babysitting should have your friends ignoring you and not scheduling any more weekend vacations with you. Stand up for yourself and quit being a doormat to your family.\n\nAlso, your family has no reason to know your plans at all. Grow up.\n\n(Sorry Rediitors, I put this in the wrong place.)", "This is the answer: \"I will in no way be able to care for my darling niece in an appropriate way, as I will be trashed 24/7\"", "She was female and she got high. Everyone was pissed that she was in no condition to play free babysitter.", "I don’t know whether it’s the same one but there was one where she *pretended* to be drunk to get out of babysitting - either way it’s a great idea!", "Here is a selection of vacation babysitting AITAs...plenty more where that came from  https://old.reddit.com/r/AmItheAsshole/comments/w3x15u/aita_for_intentionally_drinking_at_family_events/  \nhttps://old.reddit.com/r/AmItheAsshole/comments/143zzbs/aita_for_getting_high_so_my_relatives_dont_try/  \nhttps://old.reddit.com/r/AmItheAsshole/comments/150knwz/aita_for_losing_my_passport_to_avoid_babysitting/  \nhttps://old.reddit.com/r/AmItheAsshole/comments/eizcvf/aita_for_saying_my_babysitting_rates_are_35_an/  \nhttps://old.reddit.com/r/AmItheAsshole/comments/t8dwiw/aita_for_refusing_to_babysit_on_our_family/hzne8dr/  \nhttps://old.reddit.com/r/AmItheAsshole/comments/w1slhu/aita_for_refusing_to_babysit_my_cousins_during_my/  \nhttps://old.reddit.com/r/AmItheAsshole/comments/14yt4hu/aita_for_not_babysitting_on_vacation/", "This is a great idea!", "Or hangout.  I really don’t want her to see me like this!  It would set a bad example.", ">Ask your friends to support you in this.\n\nThis is really good advice when learning to set boundaries. I have the same issues and after asking my friends for help they agreed readily.\n\nFor example they have been  the ”bad guys” and let me to tell me family that they aren’t allowing me to bail on our plans. They have written and sent texts for me when I can’t figure out how to reply to pressuring messages. They have told me ”you know this isn’t reasonable, right?” when I feel guilty. It’s honestly been really helpful.", "\"No, thanks, I have plans\"\n\nDoesn't matter what those plans are. Even if the plan is to relax, chill out or do nothing, it's a plan.", "Also, make sure the people that work at the hotel don't tell your brother and SIL what room or floor you're staying at. Makes it easier to avoid them.", "I wouldn’t even apologize to your bro, you’ve done nothing wrong. The presumption you would give up your vacation, which you told him about bc you’re so excited about *vacationing*, so that he could instead take your vacation is really fucked and manipulative. Tho if there’s a pattern, of such behavior, they’re likely completely unaware. \n\nIf anyone thinks you don’t love your niece bc you do the thing you said you were doing from the start, then that’s on them.", "My mom has always said, \"People treat you how you let them.\"\n\nI used to be a big people pleaser. You'll get to a point when you've had enough and will start advocating for yourself.", "If one of your friends is better at boundaries than you ask them to run interference", "Or send your brother to this post and we can back you up!!", "Yes. This is the first hard part. If you do it well it might be the only one. If you gIve in, they will double down.  While a teen my mom offered my babysitting.  It always was a working vacation.  Once out of the house I didn’t give in.", "Never share your vacation plans with them ever again. \nYou’re NOT a doormat so don’t ever allow anyone treat you as such. \nBlock their numbers till the vacation is over. \nIf they knock on your door, don’t answer. \n\nGo have fun. \nNTA.", "Watch your niece on the first day take her to a semi expensive restaurant and give the parents the bill!  \n\nAnd allow her to have dessert and a caffeinated drink!!", "Also OP you don’t have to answer your phone and you also don’t have to tell them which room you are in.  I would in fact let the staff know that you have family that you do not want your room information shared with.  Most hotels will not give that information out anyway.  Place yourself on a no transfer phone list message only list.  Talk the the front desk they will understand.", "This is excellent advice.\n\nAlso maybe block their numbers during the weekend so you don’t have to deal with incoming text messages.\n\nSorry Op. Your brother is being a massive jerk right now.\n\nEnjoy your trip!", ">\"Those plans don't work for me. I'm sorry, I'd love to spend time with (niece's name), but I've already made commitments with my time that I can not shift. I look forward to catching up with you when I get back.\"\n\n\"Those plans don't work for me. I'm sorry, I'd love to spend time with (niece's name), **another time** but I've already made commitments with my time that I can not shift. I look forward to catching up with you when I get back.\"", "It's rhetorically polite - I agree it's a ridiculous request, but sometimes, being ridiculously polite is helpful. It's not an apology that extends any obligation on OP.", "You're quite right; I've edited my post. \n\nI've not included 'I won't change my plans' because even that is an opportunity for OP's brother to manipulate the situation. 'I already have plans and cannot look after niece at all' is enough and doesn't give brother even a millimetre of space to attempt to get his own way.", "Tell them no, and if they ignore that give instructions to reception at the hotel they aren't to give your room number out to anyone or put any calls through to your room.  Don't answer the phone to your brother or SIL.  Go ahead with your plans.  You are an adult and they cannot make you do anything.  I understand it's difficult, it took me a long time to stand up to my family, but they now respect my no when that is my response.", "You are under no obligation to your SIL or HER parents.", "You know you don't actually have to force the other person to agree with you, right?   \nIf somebody refuses to take no for an answer, just stop the conversation and go do your thing. It's not on you to convince your SIL to accept that you won't babysit, it's on her to convince you to agree to babysitting.", "What is she going to do once you say no? complain? tough. Dont tell her what room you have in the hotel. save yourself the hassle", "She ‘can’t take no’ because she’s likely used to acting in a way where the end result is to always get her way. (This can be done unconsciously, so we don’t need to assume she’s doing it on purpose, although it’s still manipulative). I wonder if she is so repetitive or annoying or demanding that everyone caves to her because that’s easiest. \n\nShe CAN learn to accept a ‘no’, it’ll just be very uncomfortable for her, because she’s not used to it 🙂 it will also be uncomfortable for you and your brother. However, as another poster mentioned above, don’t let the discomfort change how you act. Set your boundary and stand your ground. \n\nThis is the only way to start to change this cycle. Sounds like she has you all stuck on a negative reinforcement loop. \n\nAnd lastly, just know that as you act differently, her behaviour is likely to worsen before it gets better. So stick it out, you won’t regret it!", "She absolutely can take no for an answer! She just doesn't have to if everyone caters to her and let's her get her way.", "So don't talk to them at all.", "You setting a boundary is for *you*, not her. \n\nIt doesn't matter if she can't take no for an answer, because the answer wasn't for her. It was for you. \n\nYou won't be doing it, anything beyond that is her problem to deal with, not yours.", "Those kind of ppl will try to wear you down, so you really need to put on repeat the mantra so many commenters already posted: \"That doesn't work for me, I have other plans.\" \n\nYou don't need to justify your reasons, **because you are entitled to do whatever you want to do in your free time**.\n\nI really hope they will listen your polite nope and you don't need to go nuclear (such as contacting hotel staff for a child being left unsupervised)", "There was a huge story very similar to this recently where the sister had triplets and was always pawning off her kids on the brother. The brother, on this new family vacation, stood up for himself by driving alone and staying in a different hotel. It too is on Best of Redditor Updates. While lengthy, please read the original and the comments.\n\nIf it's not too late, write them and tell your brother and sister that plans have changed, that due to a, water main break, you guy will be vacationing elsewhere. When they ask \"Where?\", go silent.", "If you don't want to tell them no directly you can lie and say your friends changed the hotel last minute and tell them you wont be there after all. Or say that you had to cancel. Since it sounds like they booked it thinking you are going to be there if you tell them your not they may end up canceling. Of course they will still get mad or they may still go and run into you but it could teach them a lesson on trying to force you to sacrifice your trip for them to have fun.", "Sounds like your SIL has a lesson to learn. Don’t watch her kid. Let them pay for professional childcare for the weekend. They booked *after* you. How dare they try to take away obvious vacation time from you. If they push, tell them they can watch their own child if it’s stress free enough to do on vacation.", "Only on reddit is advising someone to lie a good thing...", "Also ensure that they don't have your room number and tell the front desk that they can't give your room number out to anyone. If they know your room number already, ask for a different room and to be placed on a different floor.", "Begone, bot", "Why do people like hide from this?  Be an adult and let them know.  Despise cowards.", "Just block the parents. Or watch it ring. \n\n\"I was in a loud pub, did not hear it\"", "Definitely.  No amount of avoiding seeing them, telling them he's all booked up, not letting them have his room number etc. is going to stop them from walking up to him at the poolside and dumping their kid on him because \"he's not doing anything at the moment\".  He's going to have to stand up to them.", "I agree. Don't give information, either. \n\nIf OP receives an invitation to a family event that occurs during their vacation. They respond, \"sorry, I'm unavailable that weekend.\"\n\nIf family pushes (ha ha ha \"if\"), \"I will be on vacation with friends\".\n\nIf family asks where they are staying, \"I'm not going to tell you because then you will try to infringe on my vacation.\"", "Some people struggle to set hard boundaries with family and while op should tell them no some people ignore and keep pushing so talking to the hotel is also a good idea.", "I love the honesty of this!", "There was also one where OP was male and started drinking immediately at the reunions and parties so he wouldn't be asked to watch the kids.", "Don’t forget the guy that blew up the family by not letting his parents pay for his hotel room so that he wouldn’t be stuck babysitting his 3 nephews (again).", "It's a pretty easy 2,000 upvote layup. Why am I writing these complicated fake AITAs that get no traction? I should just do one of these.", "I have Been the bouncer friend. And the doormat  friend. It really is easier to stick up for your bffs than yourself", "Yep. It would be so helpful to the OP to have some back up when he's bad with boundaries", "I was once talking to a friend who asked my weekend plans. I said \"Sofa, TV and not look at the time. If I feel like it, go for a run, or for coffee, or just roll around the sofa\". The response was automatically \"well, I was thinking that since you don't have much to do...\" And I interrupted it right there and re-stated \"MY PLAN IS sofa, TV and not look at the time\". She understood then, and I had a wonderful weekend (and I went for a run!)\n\n&#x200B;\n\nETA: NTA OP. Your plan is to get drunk. Their plan is to take advantage of you", "This took me years, but at the ripe old age of fifty, I'm finally getting there.", "Yes indeed!", "Buy her a live animal", "Yes. For manipulators you have to give no reasons. If you give a reason, they will have a solution to solve their problem.  No reasons. \nI can not. Hope you have a great trip!", "Register under a different name.  Or something. Carry a card for CPS - if you have them try to do a drop and run, give them one of the cards and tell them that’s who they can contact when they’re ready to pick the kid up.  The audacity of trying to have you pay for a pricey hotel stay that they plan to appropriate is mind boggling.", "This was my exact advice. Hotels have this happen all the time they should be good at this especially in a higher end hotel.", "Unfortunatly there is no family on SIL side. They all died when i was about 8.\n\nI just wrote my Brother that it‘s not okay to just demand my time.", "If the brother is going to be sneaky about it, misdirection and decoys are fair game.", "We had to lie about vacation plans. 10/10 recommend", "Because some people will take advantage when given the opportunity, no matter how much you refuse. There have been plenty of posts of people trying to dump their kids and run to force someone into unwanted childcare", "Some people, like my family, do not understand or respect boundaries, no matter how clearly or how often they are stated. They have literally sent my niece over to me on her own and walked away the second 1 saw her. She was still 20 yards away from me. This has happened multiple times. She is promptly returned once they are located but it happens multiple times a year. Before anyone says report them, it's a small town and my family is friends with all the authorities and I'm the black sheep who moved away-they don't believe me.", "Its not hiding its avoiding annoyance, you can tell them no but that wont stop them. \n\nHonestly its best to attempt to avoid them entirely, 1000% they will try and leave the kid with him as soon as possible", "When I was fourteen, it was one of dreamiest experiences of my life to be flown to Las Vegas by my favorite babysitting family. I shared a room with their four-year-old, swam with her, looked after her, ordered room service for us, tucked her in, etc. Her parents spent time with her every day.\n\nBut I was *fourteen!* This is a whole ‘nother ball game for you, filled with adult activities. Draw your boundaries, protect your privacy (as suggested by others), and have fun.\n\nNTA!", "If that happens, he should bring the niece to the hotel front desk and tell them she was abandoned", "If he can’t stand up to him then have a friend embarrass the shit out of him. We all hav that one friend that doesn’t give a shit. Let them hav free reign. Because truthfully brother and sil are ruining the friends trip also. \n\nThey did t sign up to watch you babysit. Grow a spine.", "Yeah, was part of the problem that the parents in the past also drank, so he just got a head start that time?", "Ahh, I missed that one.", "The one you're mentioning -- where the OP was at a beach-type trip with family -- was also female.", "*So* much easier. I would walk through hell for the people I love.\n\nFor myself? Lololol.", "I'm in HR and I often play bouncer to the people themselves when they're sick and want to get back to work too fast. It's often easier to accept grace from someone else that from yourself.", "Ha, I had to explain that a couple times to my very extroverted friend. My couch and TV is calling. I will have the house to myself for a bit, which has been one of my favorite things ever since I was a kid. Just because our husbands are hanging out for the evening doesn’t mean we have to, too.", "There was a recent post where the OP had, in the past, been (ab)used by his sister as the unpaid babysitter on family vacations.  This time, he traveled separately.  He spoke with the front desk staff and firmly insisted that no matter who asked, his room number was not to be given out.  He also asked for a room far from his parents and sister’s family.  The sister *did* ask the staff for his room number.  She also tried to follow OP onto the elevator to learn where he was staying.  She tried multiple times to get OP to watch her children whining how it was so harrrrrd for her and she neeeeeeeeded time off.  No.  Just NO.\n\nOP, please set some serious boundaries with your brother and sister-in-law.  And please speak to the front desk staff about *not* disclosing your room number to *anyone*.", "Yes, stand up for yourself, nobody will do it for you. \nThey wanted a child, it's wonderful, now they have a be responsible and take care of them.\nBy the way, they did book the same hotel on purpose, so don't feel guilty to say no. They tried to tricked you. You are a grown man act like it. Protect yourself.", "Yay!!! We are proud of you. \n\nDid you also send the \"my time has been booked for the duration of this trip\" yet?", "Sorry I misread you post when you said “her parents are really pushy” I thought you meant your SIL parents", "It's so obvious that they planned this after you told them where you would be, specifically to unload the kid on you.\n\nThis is sneaky and backhanded. I'd even call them out on it. Don't answer the phone (or better, temporarily block their numbers) when they call. Tell the front desk to not disclose your room number to *anyone* who asks.", "Awesome! How'd he take it?", "That is amazing and you should feel very proud of yourself. Now call the hotel and make sure they don’t put you anywhere near them and that they know under no circumstances should your room number be given out and make sure to tell them they would never be called in an emergency and explain your SIL tends to exaggerate these things. As an ex-hotel worker this is actually very common. Once there switch rooms with one of the friends and disconnect phone. SIL sounds entitled and I’m sure she would pull out all the drama to get her way. \n\nIf they do contact you or try to leave the kid with you loudly announce and don’t worry about the kid or what others think…that you are so sorry but you have been drinking and it’s not safe. Then they will have to admit in front of other humans they are shit parents for asking a drunk to watch a baby. If your culture doesn’t drink you are out of luck 😂", "Just tell him you’re going to start drinking from the moment you wake up, and a drunk person can’t baby sit a 4 year old", "Nah, if the brother is going to be sneaky about it he needs to keep this kind of information to himself, not go out of his way to lie about it.", "A person can only take advantage if you let them.", "Take it out on the niece instead of dealing with the shitty parents, great idea!\n\n/s is needed as we are on reddit", "Yes. And IIRC he wasn’t always as drunk as he appeared to be. If OP wants to have fun in the pool, similar fakery would be advisable.", "I never cease to be amazed about all the parents who want to push their kids on others. Free! No one made you have kids. I never expected others to watch my son and had no problem paying for the service.", "I agree that’s more sensible.\n\nI wouldn’t even mention that I am planning to take a holiday.", "My family will wheedle, coax, demand and push until they get the information they want. It's either don't talk to them at all or give in because it becomes so much pressure applied to \"But what are you doing/who are you with/where will you be?\" \n\nSo before I went no contact I'd lie. \"Oh I know I said x hotel but y hotel had a better rate last minute! I'm not where you just showed up at.\" With people whose motto is \"My way or highway\" sometimes lying off the bat let's you have less stress overall, especially if you don't *want* to go no contact (or if you're just not ready).\n\nIf people don't want to be lied to they shouldn't put others under the verbal grinder to get answers that aren't theirs. Obviously there's exceptions due to health or safety when dealing with specific scenarios but just as a *general* rule.", "Oh I'm not saying they'll be successful. Only that they'll try and that often people would rather avoid the conflict all together to give them less opportunity to try and possibly succeed under the right conditions", "Exactly this. One of my friends recently took a bit of time off work and she literally had to pretend to her family that she was still working because if she didn't, she'd be expected to help out with looking after a family member's children. There is no saying no to her family so it was better for her to just keep shtum and enjoy her time off.", "This makes you an enabler imo.", "There is a way!  Just say no and hold the boundary.  I just don’t get this.  People need to grow spines", "People don't just suddenly start demanding to have this kind of control over family who have reached adulthood. They condition the children to exist under the firm grip of those in positions of power - either parents or golden children or whomever. \n\nHence why I ended up simply going no contact. People who had power over me won't simply take \"no\" or \"I'd rather not say\" for an answer. They push and grind and demand and drag other family into it, until they've isolated you using others who also desire such power *or* those who are also used to this control and will say \"you know how mom/dad is\" and \"just tell them because they *love* you and just want to know you're safe\" and \"do you know how much this hurts them? *You're the problem*.\"\n\nIt always shocks me when people think saying no always works to end coercion and conditioning. It doesn't work.", "I wouldn't expect you to get it.", "You are NTA. Even if that was your niece, it is not your responsibility at all. You go there for a vacation and not to babysit your niece. They are so selfish, your reaction is valid.", "Wherever you go , have a beer in your hand . Every time they ask for a favour , point to your beer can .", "It’s rude for them to invite themselves on your vacation and expect you to do THEIR job of taking care of their kid. Just tell them you’ve made plans with your friends so you might see them around but you’re NOT babysitting. Want me to tell them for you! I’m always in Mom mode, lol.", "You're being a bit of an asshole, if only to yourself. Grow a spine or keep being a doormat, it doesn't really matter to the rest of us", "NTA but I’m going to assume your brother and SIL know of your struggles with boundaries and planned/asked you specifically knowing you’d likely relent. I’m also going to assume really quickly that their go to to guilt you is saying “you must hate your niece”. That is definitely a reach as no one thinks that in the real world unless they aren’t getting their way. With that logic I guess they hate their own child by not wanting to watch their own kid while on the vacation they planned to directly exploit someone they know struggles with setting boundaries.\n\nEdit: please stand up for yourself OP. It only takes that first leap to start being okay with setting firmer boundaries, and don’t give in to any backlash they give you because they are being unreasonable, not you.", "NTA, stand up for yourself! “Oh, so sorry, but I can’t babysit this trip, I planned an adult get away with my friends and we have plans the entire time.” Don’t do it! The brother is a big AH", "NTA, unless you don't flat out, let them know now that you will be vacationing with friends, not babysitting. It's time to grow a backbone and make a stand. Otherwise, they'll be walking all over and taking advantage of you for the rest of your life. They are the parents, not you. If they want alone time without their daughter, they can look at paying someone to babysit.  You, like everyone else, are entitled to downtime. Take it.", "“No.” NTA. Please grow a backbone, the sooner you stop people pleasing the more free you’ll feel!", "OP, don't JADE these grifters. (Justify, Argue, Defend, Explain)\n\nI suspect if you tell the front desk not to even acknowledge you're a guest might help. \n\nFinally, as mentioned in this thread, stop sabotaging yourself. Don't tell grifters anything about your plans.", "Tell bro, thanks but no thanks. I booked this trip with my friends and that’s who I’ll be spending time with. Maybe we could meet up for breakfast or a dinner but this is my adult vaca and I won’t be doing kids. He book at the same time so they could have a partly child free vacation. Why did you bother telling them?", "You're bad at setting boundaries? Well, congratulations! This is a good time to learn!\n \nNTA. Send your brother, his wife, the rest of your family a message saying you are glad that they want to force you to spend more time with your niece. But since you will be partaking of alcohol during this time, as you had planned to do with your friends weeks ago, you do not see how you will be a good choice to watch your niece. Since they, as the parents, are going to be there as well, then they, as parents, can watch their daughter. Include that dropping this on you at the last minute was an ass move to do to you.", "The first time you set a boundary, especially with someone close, is always the hardest. After that, it gets easier. \n\nIf it helps you to mentally gear up, just remember that they didn’t feel the LEAST bit shy about trying to co-opt your weekend fit their benefit, therefore you should feel zero guilt about blowing off their assumptions. \n\nStill reluctant? Rip off that bandaid! You will have an uncomfortable moment. Just keep remembering that your plans came first, and no one asked before they attempted to use you. Tell them you’ll catch up with them back at home, and you’ll take your niece for an ice cream. \n\nIf they get ugly, and some of the worst offenders can tend to, stick to your guns. Insist that they made a mistake to assume anything, and you’re going strictly on a guys weekend of debauchery. \n\nOr go for equally obtuse and tell your brother you’re so glad he’s going to be there to come pick you and your buddies up from the pubs when they kick you out at closing time! Tell him stories if your buddy who is famous for puking on the way home. Project as hard as they are!\n\nGood luck, you can do this!\n\nYou can start, and preemptive is best for boundary newbies, by talking excitedly about you and your friends plans. It’s all planned out, every day, every meal, you’re so excited! \n\nPushback? Demands? \n\n“Oh man, I wished you’d said something before you booked, I could have told you that we’ve got plans for the whole weekend. I’m not going to let my friends down after we’ve all booked. Do check with the hotel, they probably have some babysitting options!”", "OP go to the front desk and make sure there’s a note written that under no circumstances should your room number be shared with anyone. Tell them they plan to Abandon their child. I’m petty though so I’d call the hotel for resources on childcare like a child center resorts have and then forward the links to bother and say don’t worry I’ll drop your kid off here.", "Also worth mentioning that your bro is likely to react negatively and possibly call you \"selfish\", but that's all just part of the process of setting a boundary. Stick with your boundaries (like a broken record if necessary), let them have their tantrums, and in the future they'll think twice about asking the same from you. \n\nEnjoy your holiday! :)", "And next time do not tell your family in advance where you’re vacationing. They clearly booked it after you told them about it, with the complete intention of dumping their child on you.", "I am the one who feel so annoyed here. I feel like the OP need to fire back about this. If ever the brother gets angry, just let them be. You don't have any responsibility on them at all", "Definitely this!!!\n\nThe answer is a big fat NO and OP's brother and sil can have a great family vacation together with their kid. Not OP's problem.\n\nNTA", "Yeah, I get the feeling that brother just scheduled this vacation at the same time and place as you just so he could use you for babysitting. NTA - tell them you will be drunk most of the weekend and in no shape to take car of the child - then actually do it!", "And when you bump into them or they show up at your hotel room, greet them with the babysitter's kryptonite phrase, \"Dude, I am sooo drunk!\"", "This...I would say you don't think a drunk you will be able to look after the niece.  And turn off your phone.", "I hear CHS has good services. NTA", "NTA/ this entitlement is unreal!", "NTA. don't agree and if they try to force it on you... tell hotel that they are abandoning their child", "💯", "Also mentally plan for what to do if they do try to drop niece off with you at the pool/restaurant/etc…. What will you say to them? What will you say to the kid? Where will you take her? \n\nLike if they get her in the pool & disappear? I would plan to walk her to the front desk. Hey kiddo, looks like we’re having trouble finding mom & dad. We’re going to have the front desk page them. \n\nThen give the front desk their names & phone numbers & leave the kid at the front desk.aunt text the parents that you’ve done so because you will not be watching niece this weekend.", "You also don’t owe anyone an explanation beyond “no” or “that doesn’t work for me”. There doesn’t have to be a reason beyond you don’t want to. No one is entitled (aside from a spouse or your own child) is entitled to your unpaid time and/or labor. \n\nThis is YOUR time off, YOUR vacation, and NOT your child.", "I don’t think he should drag his friends into this.", ">\"Hey! How nice that you'll be at the hotel the same weekend as me! My friends and I have already made plans together so I have no free time to watch niece for you.\n\n100%.\n\nIf you want to ratchet things up, copy that comment (if you're texting) and paste it in response to any \"bUt YoU hAvE tO dO tHiS fOr uS!\" If they call, repeat it verbatim, then hang up and temporarily block their number.\n\nBRO: I'll just leave niece with you.\n\nYOU: My friends and I have already made plans together so I have no free time to watch niece for you.\n\nBRO: ?!? Don't get it. It will be easier to leave niece with you.\n\nYOU: My friends and I have already made plans together so I have no free time to watch niece for you.\n\nBRO: HOW CAN YOU RUIN MY TRIP LIKE THIS?!?!??11/??\n\nYOU: My friends and I have already made plans together so I have no free time to watch niece for you.\n\nYou might have to have one of your friends detain your brother/SIL in the likely event that he runs into you in the restaurant and wants to follow you to your room (because it would make it easy for them to drop niece off, knock on your door and run away, forcing you to look after the kid). Easier and less stressful to prevent this in the first place, rather than call your local CPS equivalent.", "I wouldn't even say \"I'd love to spend time with niece\", because at least during that weekend, he wouldn't...", "OP shouldn’t make it sound as though he wants to spend vaycay babysitting and is only hampered by social obligations. Like as not the brother and SIL will try to get his friends to’let him off’.\n\nOP needs to stand his ground and be honest that his holiday is not for their convenience and that he won’t be babysitting because he doesn’t want to.\n\nEdit: He should probably also contact the hotel and make sure a note is put on his account that B and SIL can’t make any changes to his booking, move his room near theirs or anything nefarious.", "This 1000x over\n\nIt leaves no room for mistake and puts this blame where it belongs immediately.", "“My buddy thinks it’s hilarious to teach swear words and insults to young kids. I’d never do this myself of course, but I can’t control him especially when he’s not going to be happy that our vacation is being crashed.”", "This! If their culture doesn’t drink this might not work. If that is the case just ghost them all weekend. If they find you there and put you on the spot you tell them I’m on my way to this or that pre-paid excursion or event and walk away. Also if I was there and one of your friends I would be backing you up. This is frustrating and I hate when people with kids feel entitled to breaks. You don’t get breaks from the tiny human you choose to bring into this world especially at the expense of those around you. If they want to help that is one thing but no one owes people with kids help.", "Everyone is suggesting these polite messages just be honest. - I am really pissed off that you would book the same hotel and expect me to look after my niece during this time.  It really isn't ok to have done this and I recommend you avoid me until you are ready to apologise for disrespecting me like this. \n\nNow that I write this- is the op sure the brother isn't joking?", "OP! Copy this and send to you brother the moment you get there.", "Do you mean he’s TA for not standing up for himself?", "Mistake! \n\nIf one is going to all that extra trouble to avoid harassment, then don’t tell them, leave them hanging.", "Family is important to most people but that doesn't mean that OP is required to give up any part of his (short) vacation to care for a 4 year old just because his brother has decided he should. There are plenty of other times to play uncle.", "Also don’t share details with anyone especially if they have a spare key unless you want to come home to half your fridge empty and maybe a missing tv", "Or don't tell anyone until after.\n\nI don't really tell anyone my vacation plans ahead of time. I'm an adult and just do my thing, and then share how things went after I get back. At most I might give a short vague, oh yeah spending the weekend with my friends.\n\nOP is almost 30, absolutely no reason he should feel obligated to inform his 40 year old brother of his vacation plans before he goes.", "I'd wait til I returned if my sibling pulled a stunt like this", "Don't tell him at all. Wait till you get back and tell him what a great time you had.", "Or after the trip has already started? “Yeah I am\nAt xxxxx for two more days then heading home”", "This was my first thought and I had to go back and reread the post. It wasn't planned as a family vacation, yet the brother just decides to vacation there with his family because he found out OP is?\n\nAnd it's an expensive hotel. Why not skip the pricey hotel and just hire a babysitter? Then he and his wife and do something else.", "I would tell the family after the fact. But I'm petty", "I have experience with these kind of people. Do not mention it until after you are there.", "This! I would not be surprised if they planned this. Stay in his hotel so he cannot really avoid it without being an AH in the eyes of the family.", "There was an other one where op's family had organised a cruise and not told her about it, then told her she would be looking after all the children. When she said she actually wanted to come on the cruise she was told there was no accommodation left and that if she wanted to fly out to see them she would have to arrange the childcare as it was her responsibility.\nShe decided to go on holiday with her husband and son instead and had her family blowing up her phone wanting to know where she was. Her cousin told her that she assumed op would be doing the childcare because she had done it before, then said she was lucky they didn't call the police and report her for child abandonment 😂😂", "Whats with this narrative that child free people should look after other peoples children - its bizarre", "How about the one where her SIL stalked her in the hotel to find out her room number on a family vacation.  I believe they're initially wanted her to share her room with twin toddlers.", "Plus, let's not forget OP is PAYING for this hotel and now brother and SIL (and all the family apparently) is expecting him to babysit??? Like, no way in hell would I pay for a hotel - let alone an expensive one - just to be told I need to babysit.", "Calling the police or CPS might result in the child, who is only 4, being removed for a short time. That's inconvenient for the parents, but terrifying and traumatizing for the child. Settle this among the adults.", "u/gulghy something else to keep in mind:\n\nSometimes when people ask (or expect) you to do thing for them and you decline, they ask for what your reasons are for declining.  \n\nWhen the do that, remember--they aren't asking for your reasons because they want to *understand* your reasons.  They're asking for your reasons so they can *invalidate* them.\n\nFor example:\n\n>*BROTHER: We're so excited that you're at the hotel at the same time as us!  We need you to watch Niece on Saturday morning so Wife and I can go to breakfast.*  \n>  \n>*YOU: I won't be able to babysit.  We're going clubbing all night on Friday night and I'll be hungover on Saturday morning.*  \n>  \n>*BROTHER:  You can still go clubbing, just stop drinking early.  See you at 7am!*\n\nInstead, do like this:\n\n>*BROTHER: We're so excited that you're at the hotel at the same time as us!  We need you to watch Niece on Saturday morning so Wife and I can go to breakfast.*  \n>  \n>*YOU: I won't be able to.  I've got plans for all day Saturday.*  \n>  \n>*BROTHER:  What plans?*  \n>  \n>*YOU: Plans that will keep me from being able to babysit Niece.*  \n>  \n>*BROTHER:  Yeah, but what* ***are*** *those plans?  Maybe you can change them.*  \n>  \n>*YOU: It doesn't matter what my plans are.  I've made them and I've committed to them.  Contact the hotel and see if they can hook you up with a babysitting service.*  \n>  \n>*BROTHER: Okay, well, do you have plans Saturday night?*   \n>  \n>*YOU: I can't babysit at all, I'm booked solid this weekend.  Contact the hotel and see if they can hook you up with a babysitting service. I've got to go, see you later!* \n\nThe key is to decline (\"I won't babysit\"), refuse to reveal your reasons, (\"It doesn't matter what my plans are\"), and re-direct to a solution (\"Contact the hotel and see if they can hook you up with a babysitting service.\")\n\nAnother thing--don't tell your Brother or Sister-In-Law what room you're in.  They may try to trap you into babysitting by dropping Niece off without warning.\n\nHave a fun trip!", "Remember that you do not need to justify your behaviour! Because once you do, it'll be easier for them to argue with you. \"I can't because I'm meeting my friends\" \"Oh, they won't mind if you'll arrive later\". Etc. \n\nJust stick to \"no, I can't\" or \"That doesn't work for me.\" If they ask why not, say \"it just doesn't\" or turn around and walk away.", "Your family wont think you hate your niece, but they might definitely use that knowing you *do* care for her. Don’t let them weaponize her on you", "Another easy fix to this is to just continually have a drink in your hand at all times. Bloody mary or mimosas in the mornings etc. If they ever ask you to watch niece say sorry that wouldnt be responsible im drunk.", "\"validation comes from other people.  self esteem comes from yourself\".  You set boundaries by realizing external validation is MUCH cheaper than self esteem and you need to be accountable to yourself, by yourself.", "Why not?\n\nIf one of his friends says \"Excuse me! We're on holiday as friends here, why are you interrupting us?\"\n\nThis would a) help OP realise that they are in the right here b) point out the sheer absurdity of the brother's request c) it wouldn't affect them anyway because they are not related to the brother and wouldn't be upset by him d) they are also having their holiday affected so its their business as well. Win win.", "I'd just be drunk or pretend to be drunk. No good parents would feel comfortable leaving their kid with a drunk. It'd be a drunk weekend for me.", "Being polite to the brother is just a maneuver of course (though still worth doing a bit). Brother knows he’s being awful to OP. What OP needs is to figure out a nice way of explaining it to his niece, who is probably already being told that she’s going to hang out with her uncle, and thus is being weaponised against OP’s free time. And throw in a disincentive for his brother.\n\n\nDo these friends of yours swear a lot, OP?", "I wouldn’t say “sorry” at all. OP has no reason to apologize.", "Guess she's going to have to start!\n\n\"Sorry, not available - I'm on a grownup vacation with friends. Next time you want something use your words and ask me ahead of time if I can take your kids - AT ONE OF OUR HOUSES\" If you're willing.\n\nBe prepared for a lot of emotional blackmail tho as they stalk you - \"Oh look sweeties, auntie would rather be with her friends than you guys.\" At some point before or after, try to tell the kids that you love them but sometimes grownups want to hang out with people their own age, and they'll feel the same way too as they get older.", "Tough luck, what's she going to do? she can't force you to babysit her child", "That’s your sisters problem. Not yours. No means no. If they see you at the pool and ask to watch niece for a few minutes, you say “no”. The fewer words, the better. If they push the issue say no again and leave to your room. Your sil not wanting to take no for an answer in no way discredits your use of the word, no.\n\nIf you allow them to change your No into a yes…then that’s a you problem. It really is that easy.", "Does your SIL want her daughter picking up swear words and insults from your friends?\n\n“You should probably keep out of earshot, Tom really lets loose with swears when he’s on vacation. His nephew got in trouble for repeating some of that. Tom still thinks it’s the funniest thing ever.”", "Do you live with them? Don’t see why it’s your problem then.\n\nMake sure you always have a beer in hand(s). Speak loudly about how long you’ve been drinking and how little XYZ will love sitting at the bar.\n\nThis works best when done in full view of other guests and hotel staff. Because she will look like a Shit Mother for insisting your babysitting.", "Be a drunk whenever you see them. Even if you're not, just pretend.", "Block your brother and stop responding to them. Don’t agree to any meet up with them. She’ll learn to take no for an answer if you prove to her that you’re NOT a doormat. Grow the balls that your spineless brother doesn’t have.", "Cause that’s what I would do in their situation. And it’s a suggestion, not a must, mainly cause OP seems like they want to help out (a small compromise to keep parents of her back you could also say), but are annoyed that this was thrust upon them when they’re trying to get away. Edit- Just wanted to add, that I noticed the downvotes, that’s Reddit for ya. Folks read something like what I wrote, will agree with much of what I said, but will downvote me cause I let OP know if I were in their shoes, and loved spending time with my niece, that I would spend a bit of time with her even though her parents are seriously cringy assholes, it’s not the nieces fault (but if she ignored niece, she may feel bad), and not OP’s fault either. Reddit seems like they would prefer more to make these awful parents suffer, than to be nice to the niece.", "Yes.", "Not even a couple of days before.  Send a postcard once there.", "Right. They don't deserved to treat right. They are being so ridiculous and annoying as well.", "Well, since there's to be lying going on anyway, try: \"Oh, sorry bro, since I was going to be stuck babysitting the whole weekend, we cancelled. But you guys have fun!\" ...    \n\nAnd hopefully Bro and SIL will cancel in a snit since there won't be free babysitting. Then go and have fun! \n\nAlso, NTA, except to yourself by not being good at saying no.", "Yup, hotel screwed up our reservation. We'll be going to hotel 2 towns away. Will I see you there?", "He'd better hope the brother didn't request a connected room.", "Came here to say this, glad you've got it covered!\n\nOP is very NTA to want to have a friends vacay and not a babysitting job.", "Noon??  Mimosas at 8, beer by 10.", "Especially don't post pics while you are away. A friend of mine was targeted and had her apartment broken into because her friend posted pics of them while they were down the shore.", "This. People further up the comment chain are calling someone insensitive and \"lacking empathy\" for suggesting the obvious: that adults need to grow a spine and learn how to say no.\n\nLying because you're too afraid of not being liked / confrontation is NOT a healthy coping mechanism - my friend who's a psychologist says this all the time. A lot of people play false dilemma and pretend you either NEVER lie (so you tell someone their baby is ugly) or you lie as a default instead of trying to establish healthy boundaries.\n\n\nWhite lies to avoid unnecessarily upsetting someone are NOT the same as lying because you can't stand up for yourself so the only way to avoid people walking over your boundaries is just having none.", "Agreed. I don't get this. A million years ago we crawled our of the primordial ooze to walk upright. A million years later, we've ditched the spine that allows us to walk upright. Just say no.  If you're old enough to go on vacation and drink, you're old enough to stand up for yourself.", "And he should definitely get very drunk before he even arrives to the hotel. They won't dump their kids on him while he's in that state.", "Exactly this. My first thought was \"grow a pair, dude\"", "It’s not a matter of getting permission; it is simply sharing something about your life with friends and family. People normally do this with people they like. OP doesn’t indicate anything about despising his brother; he is complaining about boundary issues.\n\n It’s also wise to share your location with one trusted person in case something goes wrong. One of my dear friends didn’t tell anyone where she was going. She ended up going missing. It took the police a long time to find her and she was murdered. If someone knew where she was headed, then maybe she could’ve been saved.", "I love the honesty of this!", "I would have loved to hear that call to the police.", "I remember that one. It was awesome!", "I remember that one as well. Crazy stuff.", "Oooh, I need to find that one - that’s insane!\n\nLooks like maybe this is it:   \nhttps://www.reddit.com/r/AITAH/comments/131ce1h/aita\\_for\\_refusing\\_to\\_babysit\\_while\\_family\\_goes\\_on/", "The very first AITA post I ever read was a vacation babysitting post. I thought I'd never see anything that infuriating again on Reddit but then I joined the group and never knew inner peace again. :)", "OP send brother this whole list!", "It's mostly people with main character syndrome.", "No, it's family. It's what family does... during normal times. The problem is family with kids taking family without kids for granted. They fail to remember or choose to forget that the childfree family members are on vacation, too. By assuming a family vacation is a parental holiday with built-in free babysitting, they're abusing the childfree family members. Vacations aren't usually normal times.", "It was a guy and triplet nephews", "𝙃𝙖𝙥𝙥𝙮 𝘾𝙖𝙠𝙚 𝘿𝙖𝙮!!", "And don't forget to mainly hang out by the adult-only pool and bar. And sleep in, and stay up very late.", "I watched my young nieces (17, 20) do this with/for their friend (20) who was having a hard time setting boundaries. This is a great use of your support friends", "This is really good. Shorter always better when struggling to set boundaries", "This needs to be upvoted more.  OP....  This is how us \"Big Girls\" do this.  If I say these words... no one ever questions me.  Ever.", "And it may help if this friend is fond of swearing.", "\"a\" caffeinated drink?  \n\n\nI'd start her training on being a coffee connoiseur that day - Hey <niece>, today you learn what espresso, ristretto, cappuchino, latte macchiato, (etc) really are - and you can try ALL OF THEM.", "These don't seem like good parents.", "I personally prefer the projection approach. As someone else said: Great that you booked in the same hotel now you can pick up me, marc and Josh after the clubs close. I was afraid to get a taxi because josh's a bit of a puker but now you're here so you can pick us up afterwards.", "I don't know, I think when you're dealing with people who have no respect for peoples boundaries, giving an inch or showing weakness(such as apologising for something you're not sorry about it) is a bad mistake and they will try to exploit that", ">Best of Redditor Updates\n\nThank you, I learned about a new community today that I joined :)", "HE made it clear in the post that he does NOT want to care for his niece on his vacation but is getting pressure from his obnoxious and entitled brother. The niece doesn't know that uncle turned down caring for her, so OP is not being mean to her. You're getting downvoted because your argument makes no sense.", "*when you leave.", "It's the opposite; only on Reddit do people clutch their pearls about little white lies like this. People with real life social skills know when to tell harmless white lies to manage awkward situations or to spare people's feelings.", "No its not just on reddit. If you think about it, I'm sure you can come up with situations where it would be a good thing.", "Normally I would agree but older bro is being sneaky here. Younger bro is fighting a rearguard action against that sneakiness.", "Self-defense.  Justified!", "Oh please. There are plenty of situations where lying is harmless. Not everyone in your life is entitled to the truth at all times.", "Turns out context is important, whodathunk.", "Hair of the dog from the bottle in the shower followed by a Bloody Mary at 6:00 AM when the hotel restaurant opens.", "That line really got to me. \"Yes, bro, I'm not doing anything because that's what we call A VACATION. You're doing the same 'not anything' too, aren't you? Have a nice one, doing nothing with Baby Niece.\"", "He should surround himself in cheep beer, fruity cocktails, a bong, very loud- non kid friendly club music on video while next to the pool with the boys. The parents might figure out that dropping off a toddler and walking away might not be a good idea. Remind them that you are on a grownups vacation.", "Or just be really drunk the whole time.", "Then you just keep to your boundaries and keep refusing, saying no. If they don't listen, then don't talk to them for a while. People act like there is no way to set boundaries at all. It is weird and hard at first but gets easier, and is definitely way healthier than just going around lying to everyone about everything and being just as sneaky as they are.", "If you've grown up in an abusive manipulative family you have been conditioned since birth that their wants are more important than your needs. It can take years of therapy to undo that damage.", "Or just pretend to be more drunk than he is. Also get the friends on board — they can act as decoy and act upset at OP if there’s any hint of babysitting “you promised we would finally get quality time together!” Etc", "Yes! Alcohol, cigs, speedos, bikinis, coarse humor, escalate until they grab kiddo and leave.", "Even the illusion of it should be enough.", "Shit I'd send that and I don't even fucking drink!", "It's really sad that someone has to turn to a substance instead of simply saying no.", "I left my small child at the closed door of my cousin's empty house and my cousin abandoned her!", "That was a good one.", "https://old.reddit.com/r/AmItheAsshole/comments/13savby/aita_for_saying_ill_be_driving_myself_and_paying/", ">”but then I joined the group and never knew inner peace again”\n\nHahahahahaha.  And we just keep coming back for more?!", "Ahh thank you 😊", "The friends can also act like they have fewer scruples, because they don’t need to deal with OP’s family on a regular basis.", "Happy cake day!", "I think the tone of the \"I'm sorry but\" matters. Usually, it is letting the other party know they are being ridiculous. \n\nIt's irony, not an apology.\n\n\"I'm sorry, I would love to contribute £1 000 to the interns 21st birthday present but I've already allocated my charity money this month and I do have to pay the mortgage and childcare for my 3 children. Perhaps another time.\" ... and smile. \n\nIt also means no one gets a disciplinary note on their employment history for telling the boss to F Off, but everyone knows exactly where they stand.", "Write your brother and say… not sure what part of me telling you I’m going on vacation with my friends leads you to believe that I would be free to babysit?  Have fun with your wife and daughter, but please do not expect me to even be sober enough to recognize you 😂", "You need to be more assertive. “Not okay” is **not** the same message as “I will not be watching your daughter during my vacation. If you try to drop her with me and leave, I will alert the hotel staff.”", "Make sure you are drunk (or pretend to be very drunk) at all times when you see them around. \n\nOr just say no. Practice saying no in the mirror until you can say it firmly without room for negotiation", "Let him know in advance that if they try to drop the kid with you, you will be taking her to the front desk as a lost or abandoned child and if he can’t get it through his thick skull the same with the police.", "Nta.Good for you. Tell him your time is important and you already made plans and won't break them. \n\nIf sil can't take no for an answer then oh well today she's going to have take your no and deal with it.\n\nYou made your plans already and those plans don't include babysitting their child. It's there responsibility to watch their child not yours. \n\nJust because they quickly book a vacation and are staying in the same hotel as you are doesn't mean they can have a child free vacation by dumping their responsibilities on to you. Please go and enjoy yourself.\n\nBut next time they ask you were your going or where your staying. Don't tell them the hotel where your staying at. Just keep your information vague and never give out the correct information.", "I read that the love their niece, but hate having this thrust upon them. And it’s not the nieces fault. But there’s a good chance if OP doesn’t spend anytime with niece, and niece knows that OP is there, that could crush her a bit, and I’d hate to see that happen yo innocent child here, so yeah, I wanted OP to think about that little girl, even though her parents are basically bullies. It’s not about giving in to parents, it’s about visiting a loved one that maybe hurt, cause they don’t understand why you won’t visit/spend any time with them. I hope parents get travellers diarrhea, and are coup up with their own stink, I wish this girl my best", "Nah, just set strong and healthy boundaries", "*So* much pearl clutching.", "A white lie is told to no avoid hurting someones feelings.\n\nIn this case OP would be lying because he doesn't have enough of a spine to stand up to his family. This is not how to develop social skills, quite the opposite imo.", "this wouldn't be a harmless lie. OP would be actively hurting himself by failing to set boundaries. it's just procrastinating the conflict until when he inevitably snaps under the pressure and disrespect.", "Like at a wedding where the bride asks if you like her dress, and you think it's hideous.", "I wouldn't call lying a good thing, easier maybe, not good.", "In other words being a coward.  Got it.", "I love friends like that.", "Not just don't give a doot...live for the opportunity to shut this kind of entitlement down.\n\nAfter all, who is this rando family to fuck up my vacation with MY friend???\n\nTHIS IS MY TIME WITH OP!!!! \n\nNTA", "Easier said than done, some people need years of therapy before they are able to set boundaries effectively and there is nothing sneaky or lying about telling the hotel not to give out your room number to anyone or switching your room. Do what you need to do to enjoy your vacation and avoid family drama. A vacation is supposed to be stress free and  a boundary setting argument with family can ruin the vacation.", "Yep. If I was OP's friend I would have NO problem telling off brother and SIL. Sometimes it is easier coming from a 3rd party...", "Thank you for doing the searching for me!", "Me, my own bubble and whatever comes to my mind in that moment. Extroverts charge batteries by being in company, introverts by becoming a blanket-burrito", "ha, maybe at work then but this is his brother so he's probably not getting fired. Thing is people this entitled probably wouldn't even recognise that as irony :p", "I love all of my niblings but that doesn't mean I'm giving up part of my extremely short vacation to care for one of them just because my brother thinks I should. I'm sure OP has plenty of opportunities to see her another time that doesn't infringe on his vacation.", "This is an extremely low stakes lie which could benefit OP, it’s not sneaky or disrespectful. Don’t be weird about it", "Normally I'd agree with you, but this is a perfect example when lying is necessary. You can’t reason with unreasonable people.", "Nah, if the brother is going to hijack OP's vacations because he's a dick, OP can teach him a lesson by telling him the wrong hotel if he asks again. They're not going to learn unless they get a consequence like that.", "agreed, or just…. set a boundary and say “sorry, I didn’t book this holiday so I could babysit my niece”? nothing wrong with being honest, if bro wants to react badly then that’s on him.", "I condone using white lies in situations like this. I absolutely think it would be appropriate, if needed.\n\nLike say, the brother catches wind of a future vacation and asks OP what hotel they are stayed at, and then they decide to do this sheisty shit to OP again... back to square one.\n\nI'm condoning going that route because OP said they are not good at setting boundaries and their family sounds really controlling and overbearing.", "Isn't that just lying by omission? Keep your plans to yourself, but if bro finds out a little white lie can save you a lot of pain (at least in the moment). He'll probably be pissed after the fact though.", "That’s actually the subtle boundary: if you press on, I will tell you anything’s but my plan.\n\nAfter the third time, the person might not even bother pestering you since they cannot reliably make plans.", "Hey now!", "Lying is a very important social skill.", "Or someone asking of their newborn is cute", "Depends on how much I like the bride.", "For example, lying to someone to protect someone could be a good thing (for example protecting a friend from an abusive spouse/ex).", "I'm friends like that. Happy to help!", "that's not how /s works", "You need : * happy voice * as well to make this anywhere close to being sarcastic. You could have started with the great idea to shift the tone better.", "NP. Got it on the second word combo.", "That's a very good phrase for describing the difference between extroverts and introverts in regards to their needs for recharging.", "Vvacationing with children is not really vacationing. But pawning them off on someone else is insanely short-sighted. Watching your own kids is draining, but watching someone else's is worse.\n\nThe only time we've asked people to watch our kids on holiday was when we went with SIL and her family. We have kids in the same age range, so we'd sometimes watch theirs so they could go out with just the two of them and they did the same for us. That works. And sure, if we're taking a family holiday and my brother asks if he can take them to the pool then I'll be out the door before he finishes talking, but then he offered. I didn't ask.", "They crow constantly about their \"little blessings\", but then yeet the kids at the first halfway competent adult they see, and go running the other way 😆\n\nMy favorite thing is that they think that other people don't notice them pulling this BS, and then they still try to convince you how kids are just the best! Lmao right Sharon, because you made it look like SUCH a good time, while you're prowling for every opportunity to drop the little gremlin in someone else's lap.", "Give me your children, I'll gladly hand them over to the police and report you to CPS for child abandonment.. \n\nMaybe phrasing it that way would wake some people up.", "That’s the thing, I hate to give the parents here anything, but I (as OP) wouldn’t be doing this for the parents, I’d be looking at as lunch with niece (or whatever), at which time i can let niece know that she’s important to me, and explain that i hadn’t planned to see her at hotel, and that i wish I  had more time, but this was supposed to be my time with friends, and we’ve spent money in our vacation plans (and leave out part that her parents are assholes, if she’s old enough, she’ll get it though, and the niece would understand that it’s not her fault in these situations), and if it comes up again, she’ll more readily understand what her parents are doing to OP", "That was not his responsibility, his family is so selfish and annoying", "You are 29 an adult. You do not have to tell a soul where or what you are doing. How convient, when you told your brother where you were staying  he just happens to be staying at the same place. His kid his problem!!", "People will use any excuse to lie it seems...\n\nJust tell them no. Just change the subject, and if they can't stop then don't talk to them until you are done the thing you want to do. People act as though there is NO other option, that they just have to give in. You set the boundaries for yourself, not your family. They can 'coax, wheedle, guilt' and whatever else all they want but you don't have to tell them anything.", "It’s actually really easy…. “Such and such timeframe, I am OUT!” And leave it at that.", "The point people are trying to make is that you can't always be reasonable with unreasonable people.\n\nIf someone's reaction to telling them where you will be staying is to plan for you to babysit, I don't think a small lie next time is a problem. It's not ideal, but none of this is ideal. Sometimes the most important thing is to stop people from trying to harm you/ruin things for you. \n\nI agree that standing up for oneself and refusing to tell plans would be the best. That's really hard sometimes.", "You must be busy these days.", "So is saying no.", "Lies", "Yes, I would have no hesitation in telling OP’s family “He’s not watching your baby, he already made plans with us. Don’t be so selfish. If I see you try and dump YOUR baby on him and steal our holiday, I’m taking it straight to the front desk as a lost child. Don’t think I won’t.” \n\nThe key is to have a friend who is happy to be the bad guy!", "I have literally thrown out a friend of mine (single mother) out of her own house at one point to go have some fun with a girlfriend of hers because we were visting, yes I like your child, he likes me, we will get by without you for a few hours. Go have fun. \n\nBut that is about the only child I would be willing to do that for - he's old enough that we can play mario kart together :D", "Vacationing with young kids is still fun and is still vacationing.  We did it all the time when my sons were little.", "Hey, drinking cocktails in the middle of the day is hard work!", "And you offered (which, as a parent, I would've appreciated tremendously, so good for you!). If OP had offered to take niece of their hands for the weekend, then they wouldn't have been assholes for saying yes.", "Lucky you. I thought it was exhausting. Our youngest was a bit of an adventurer, which meant we spent our days chasing him around. And our eldest is a social animal who would just randomly enter other people's accomodation without telling us. Not great.", "Same. I love the shi out of my kids. When they were young I took them everywhere.  They are adults now and we are really close.", "And you defo don't want any kids around making it harder.", "Maybe because you're lacking in life experience and empathy. It's cool, I was the same way, mouthy and unapologetic, but other people have different strengths and weaknesses. I bet you have plenty of hangups none of us have or understand either.\n\nI'll give an example. My mother is very loving and very overbearing. She worries a lot. My job requires me to go to not so safe places and deal with not so safe people (think environmental law enforcement). I don't usually tell my mother where I'm going, only where I've just been, or else I'll have to listen to half an hour of warnings and woes and I just can't sometimes. It's no use telling her not to worry, she will anyway, and I can't tell her to shut up about it because that would hurt her feelings, and I love the old girl.\n\nSo I lie. I omit and I lie if I have to. She keeps calm, I get more rest and all's good.\n\nLying really is ok if it saves you some misery and is not harming anyone.", "I get verbally emotionally and mentally abused if I don’t give in and tell them where I am and who I’m with.  \n\nI guess I just need to grow a spine 🤷‍♀️", "Spoken like someone who's never had the joys of dealing with an abusive family.\n\nSure, in a perfect world people just \"grow spines\", but back here in reality it's not that simple for a lot of people, for a lot of reasons.", "What's your point?\n\nJust because OP's family might be abusive doesn't mean that he should become a liar...", "Us too. So many people would say: “I can’t believe you’re going to X with your kids. You’re so brave.” Not at all. It was fun. One is still in high school, one is an adult, but they both still like to hang out with us."]}