{"id": 26248, "submission_id": "16aniy6", "title": "AITA for not wanting to get involved in my parents divorce?", "selftext": "i'm (21f) my mom (43) and dad (46) decided to get divorced last month. it was taken to court because of division of property and also my dad doesn't really want a divorce.\n\nthey're not bad people. they just met and got married at a young age and I think it was the mistake of their lives. they're not good for each other and they don't know how to communicate. their whole marriage was full of stupid fights.\n\ni isolated myself from these fights throughout high school and didn't care about their marriage. i got a scholarship for university and moved to another city. i've been seeing them 1-2 times a year, but we keep in touch because they're my parents.\n\nwhen i heard the news, i was relieved to be honest and said \"all the best for both of you\". but that when it went to court, things got very complicated. all the property they bought during the marriage is in my mother's name and she refuses to share 50/50. she has her own reasons but i really don't care.\n\ni just want them to leave me alone. one side keeps calling me and asking me to talk to convince the other side. i tried to help a few times, but my general response was \"leave me out of it\". but they didn't stop calling me. yesterday my father asked for something similar again. i said \"i don't know if you're a child or me. leave me the fuck alone. just get a nice divorce, it's not that hard.\" my father got angry and accused me of being careless. after that i hung up the phone. i sent a message to my mom telling her not to call me anymore about the divorce. she didn't take it well either.\n\nAITA for it?", "created_utc": 1693918593, "permalink": "/r/AmItheAsshole/comments/16aniy6/aita_for_not_wanting_to_get_involved_in_my/", "score": 434, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i don't know exactly how to act about my parents. they have a shitty relationship and i don't think they'll ever get along. still, maybe i should have tried to help. i don't know.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA - you tried to be nice the 1st couple times and it didn't work. They learned a lesson not to push you or they will hear a harsher version of \"stop\". They are grown adults, they can handle it. Don't back peddle on your boundaries. You told them your boundaries,  they tried to ignore them, you re-expressed the boundaries,  they reacted. Nothing more to say about it. Just move on 👍don't apologize", "NTA, this is something you shouldn’t have to ask for. Your parents should know to keep you out of this. Yes, you were a little harsh but I understand being fed up.", " NTA 1st rule of divorce don’t put the kids in the middle and try to turn them against the other parent.", "NTA. Parents going through a divorce should keep their kids out of it", "NTA for not wanting to get involved or to take sides. But you went overboard in your response to your dad.  While it must be frustrating to get calls from the both of them, just stick to line 'mom/dad, I am not getting involved, this is between the 2 of you'. End of response. Rinse and repeat.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\ni'm (21f) my mom (43) and dad (46) decided to get divorced last month. it was taken to court because of division of property and also my dad doesn't really want a divorce.  \nthey're not bad people. they just met and got married at a young age and I think it was the mistake of their lives. they're not good for each other and they don't know how to communicate. their whole marriage was full of stupid fights.   \ni isolated myself from these fights throughout high school and didn't care about their marriage. i got a scholarship for university and moved to another city. i've been seeing them 1-2 times a year for five years, but we keep in touch because they're my parents.  \nwhen i heard the news, i was relieved to be honest and said \"all the best for both of you\". but that when it went to court, things got very complicated. all the property they bought during the marriage is in my mother's name and she refuses to share 50/50. she has her own reasons but i really don't care.  \ni just want them to leave me alone. one side keeps calling me and asking me to talk to convince the other side. i tried to help a few times, but my general response was \"leave me out of it\". but they didn't stop calling me. yesterday my father asked for something similar again. i said \"i don't know if you're a child or me. leave me the fuck alone. just get a nice divorce, it's not that hard.\" my father got angry and accused me of being careless. after that i hung up the phone. i sent a message to my mom telling her not to call me anymore about the divorce. she didn't take it well either.\n\nAITA for it?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta. You are an adult but you are their child. This isn’t appropriate. It’s manipulative and inappropriate", "Nta of course", "NTA\n\nThis is totally reasonable and your parents should not be trying to rope you into it.", "[deleted]", "ESH\n\nI want to be clear.  **You are N T A to not want to be involved**.  This is their problem to fight.\n\nThey should not be using you to guilt trip the other and for their personal divorce drama/trauma dumpings.  They are AH.\n\n\"just get a nice divorce, it's not that hard.\"\n\nThis is a callous, childish thing to say to too people going through a nasty event.  For SOME people it's  easy.  For divorces that involve the division of a life's worth of assets, it's very important.  You are AH for this statement.", "ESH\n\nI want to be clear.  **You are N T A to not want to be involved**.  This is their problem to fight.\n\nThey should not be using you to guilt trip the other and for their personal divorce drama/trauma dumpings.  They are AH.\n\n\"just get a nice divorce, it's not that hard.\"\n\nThis is a callous, childish thing to say to two people going through a nasty event.  For SOME people it's  easy.  For divorces that involve the division of a life's worth of assets, it's very important.  You are AH for this statement.", "Not your circus or monkeys. NTA", "NTA!!!!!!! Stay out of it!! It’s better for you in every way to stay out of it! It’s not right for your parents to drag you into *their* issues. Grown up or not, it’s not right or fair of them to drag you into it.", "The best and only place for you, where their divorce is concerned, is out of it. \n\nThese are your parents, they would do well to remember that, you are their child,  not their mediator. \n\nNTA.", "Lol no she’s not. Her parents are being manipulative and petty and trying to put her in the middle of it. She’s right divorces aren’t that hard when both parties aren’t being jackasses. They’re both making their own divorce more difficult than it has to be. Go touch some grass", "I think this was the straw that broke the camel back. They are done. I can’t blame op for not wanting this and saying that.", "NTA, but I almost want to call you the asshole for saying this:\n\n>\"i don't know if you're a child or me. leave me the fuck alone. just get a nice divorce, it's not that hard.\"\n\nThe way I'm reading this, your father would like to have a nice easy divorce, but your mother isn't being fair about it. I don't know why you lashed at him for that.", "NTA, threaten to put them both in time out. Besides you are at the age when life is about you learning what makes you happy and to branch out without needing their baggage.", "NTA. Ignore the people here saying you went overboard and weren't nice enough. Sometimes you just have to be direct and blunt when people keep trying to pull you into their drama.", "While there are a lot of downvotes for the way you talked to your dad, you are NTA. Even my 8 year old when asked a repeatedly about something says \"No is a complete sentence\". Even though you should have stopped it before it pushed you to this point, I've also been in your shoes and sometimes you snap at people that don't have any respect for your boundaries. You might be a legal adult, but you're still their child. You have no business being in the middle of it.", "Nta They shouldn't put you in the middle. Your dad needs a good lawyer.", "NTA\n\nDon't they each have an attorney to represent them individually during this divorce? If not they need to. \n\nYou are their child. Not their legal representation. Not their friend. Not their close personal confidant. Not their therapist. And most certainly not supposed to be their bridge to get what they want/deserve from the other.\n\nIf it comes up again tell the parent to talk to their attorney.  Every time. To both parents. If they continue to try and make you \"pick a side\" it will not end well for the parent forcing your choice.", "Your dad fucked up allowing everything to be in your mums name. \n\nThere’s no such thing as a nice divorce in this situation and it’s fine for you to not wanna be involved either.", "NTA, it loooks like you are only adult there ;)", "NTA, but I do see where you got your emotional management skills.", "NTA. They messed up their lives, they're not entitled to ruin yours, too.", "NTA. Their marriage is ending, that's theirs to deal with. You, as a product of that marriage, have no standing in the situation, and definitely don't need to be involved. Stand firm in your boundaries. No means no. Repeat as needed.", "Personally, I'd tell them the next time someone brings up the divorce to you, you won't be speaking to either of them again until it's settled. Maybe that will motivate them to move a little quicker. Either way they'll respect your decision and you won't have to hear about it, or they won't, and you won't have to hear about it.", "NTA.  You can be in contact with each of them about the rest of their lives, but they should not involve you in the divorce.  Let the courts settle that.", "My moms been divorced 3 times, I don't know a thing about any of them.  Her marriage/divorce, her business.  NTAH here and none of your business what the divorce is about.", "NTA\n\nThey're not asking for support from a family member during their time of crisis.  They're asking for a 3rd party arbiter to get in the middle of details of their property distribution.", "NTA you have a right to your boundaries", "NTA! My parents dragged me into the middle of their divorce when I was 22. It was horrible. I ended up going no contact with my dad for a while.", "Tell them that you’re telling them both the same thing.", "NTA! Your instincts are on target. Stay out of it. You got it right with the 'child' comparison.", "Yta op. If both sides were fighting equally and you didn't want to get in the middle I would get it. But the situation you have described is one side shafting the other and asking you not to intervene and one side about to get shafted and asking you TO intervene. If one of my parents was about to be fucked sideways by the other I would intervene even if both sides have been fighting up to that point. I get that you're tired of them fighting but are you really ok with your dad being left with nothing because your parents were annoying?", "NTA but contemplated saying YTA with this, the \"just get a nice divorce, it's not that hard.\" was so annoying. I DO know that divorce is not something you can do \"nicely\" if it's so sudden. (Please correct me if i'm wrong.)\n\n>\"i don't know if you're a child or me. leave me the fuck alone. just get a nice divorce, it's not that hard.\"", "NTA.\n\nYour parents need to stop putting you in the middle. That's what bad parents in a bad marriage do. Next, they'll be bad divorced parents, constantly asking you to continue being in the middle.\n\nIf they can't be civilized or stop playing messenger, I assume they won't have to worry about talking to you in the future.", "NTA if these were friends your age asking for help that’s one thing but your parents that are TWICE as old as you shouldn’t have to rely on you to mediate their marriage unless you’re a lawyer or sum", "NTA. My parents have been divorced for 11 years, but the one thing they did was not to blow it out of proportion. They realized that it’s not just about them, but also about their kid and how he may feel. They didn’t involve me, but informed me of what was happening, but explained that there would still be joint custody, therefore it would not be one-sided. Everything was 50/50 so that I could grow up with both parents. My parents did what you should do in a divorce, yours just seem to be out to get each other. Your are doing the right thing, don’t let them involve you at any point.", "NTA.  Your parents should know better than to drag their child through their divorce problems, but it sounds like they don't, so they needed to hear it from you.  Stick to your guns.", "Hell no. NTA.", "NTA, l think your dad wants your support because he is well aware of the property being in your mums name, this might have been done to avoid creditors etc or he had a bad credit record or for liabilities etc. Even so you are doing the right thing by telling them both to not drag you into their mess, if they are both upset that you are not taking sides, well tough luck, they are adults and it is their problem.", "NTA!!\n\nYou do not belong in the middle of their conflicts. You told both sides to leave you  out of it. Text only and do not respond if they bring up the divorce!", "NTA. i was pretty much in the same situation. i think there is a clear \"at-fault\" parent, but the way the other approached it and them trying to get me & my bro on their side was frustrating.", "NTA - It is their divorce not yours.\nThey should not be putting you in the middle of it.\n\nThey do need to settle this on their own.\n\nYou might want to send them both a message that while you love them both, you will not discuss anything regarding the divorce and division of property.  If they want to talk about anything else, they are more than welcome to reach out to you.\n\nGood luck.", "NTA.  Send your parents each a copy of \"The War Of The Roses\".  Maybe that might knock some sense into them.", "NTA. They are trying to make you take sides, which is incredibly wrong.  Send them an email, both of them in the To line, stating that you are not going to take sides in the divorce, you don't want to be involved with it, and if they insist, you will block them.  \n\nI am so sorry your parents are doing this to you.", "Even as the child is an adult, they shouldn't be involving you, thats like, divorce 101", "NTA it’s not your fault they’re being petty and childish. Everything they’re calling you for is literally the divorce lawyers job. I’d honestly block them while they go through this. I am a firm believer in if your family is upsetting your peace cut them off until they can behave accordingly.", "NTA \nand the way you handled everything is what a full-functioning adult should do. There's at least one in that family.\nSpoiler alarm! : not the parents", "NTA as someone who had to deal with their parents divorce as a young child and then as an adult living away from home had to deal with parent and step parent divorce, I put up very similar boundaries with my parent and step parent as a result of not wanting to be the point of he said she said.\n\nFrom my experience, it is fair to put in boundaries regarding direct discussions of the divorce, but making sure you stay in contact in general. It's fine to hear about it sometimes as long as your parents are respecting your boundaries. \n\nI told both parent and step parent that I would stop communication if I was involved in their 'he said she said' complaints, and only my step parent managed to steam roll my boundary so badly that I cut communication.", "NTA - Even if you are an adult, your parents should not use their children as messengers/pawns/referees or anything else in their divorce. Your relationship to them is entirely separate from their relationship to each other, and you're doing well to keep it that way. \n\nYou could not have helped their marriage, their divorce, or anything surrounding it. That is on them.", "Ah, yes two bickering assholes about to have nobody to be an asshole to except their 21 year hostage...", "NTA there are mediators whose job is to mediate. That is definitely not your job. You tell both of them that they are the ones that have to figure it out like the grown ups they are suppoused to be. Go low contact until they figure out all the divorce mess", "NTA - stay out of it. It’s not your mess to clean up. Them attempting to emotionally manipulate you for their personal gain is no bueno.", "NTA. Going through the same thing right now and definitely agree that staying out of it is the only way to go. Hope it doesn’t take much longer for you all!", "As someone who actually acted as a go between when my parents got divorced, my advice is exactly what you're doing. Let them sort it out and stay neutral.  Why parents try and involve their adult children in their marital problems/divorces is beyond me.", "NTA.\n\nI was just a year or so older than you when my parents split up.  Thankfully I was not living with them at the time.  Both of them tried to put me in the middle, and I had to set a firm boundary that while I loved them both, I would NOT in any way shape or form discuss the divorce with them.  It was their legal business not mine.\n\nI had to hang up the phone on my mom a few times when she started in, but she eventually got the message.", "NTA. You're an adult and they're adults, they can handle their own issues.", "Block them for a month so they know you're serious. Then then if they they contact you again wanting you to be devil's advocate, them then you will block them permanently", "[removed]", "[deleted]", ">1st rule of divorce don’t put the kids in the middle\n\nTHIS one hundred million times", "It’s astounding to me how many parents fail at this simple thing.  And how many kids fall for it.", "Exactly.  What's one way of many that I know someone is a bad person?  They shit on their spouse or ex in front of their children.  Plenty of bad people out there. \n\nGoes to an entire different level when they try to weaponize their kids against their spouse/ex.", "Agree. They can call you when it’s over!", "Clearly you haven’t been in OP’s position before. I have. \n\nHer parents are not in their right state of mind and the NEED a rude reality. What they’re doing is so profoundly inappropriate that it’s indefensible.", "[deleted]", "Well she was super frustrated that they kept trying to drag her into it.   She set a boundary that was being broken, repeatedly, hence the lash out", "No, trusting your spouse when you have no reason not to is not a fuck up. The fuck up is the mom refusing to make shit equitable between them, as far as I can tell.", "It's sometimes a necessity. For example if you start a company where you are personally liable, you do not want the family assets being under your name. So if something happens to the company your family doesn't also lose everything.", "I am a bit curious why they did it this way. Did she get a better rate than having him on the mortgage as well? Even so normally he’d be added to the title even if not the loan… not relevant to the question at hand but it is weird.", "People who involve their kids in a divorce are shitty people.", "She is not her fathers lawyer or advocate. She does not have to risk her relationship with her mother for her father. He should never ask that of his child.", ">just get a nice divorce, it's not that hard.\"\n\nThis is a callous, childish thing to say to two people going through a nasty event\n\n\nExactly. She is their child. She doesn't want to pick a side or be involved.", ">You should make it clear that you're there for emotional support only and will not get involved any further with anything to do with the divorce\n\n\n\nYou mean, the very thing she has been doing?", "It’s easier when you don’t try to involve your kids as weapons against the other, personal experience.", "Stolen comment", "Unfortunately it's an attitude that many people do not have or use.", "OP should've left it at \"leave me alone\" making the extra comment is involving themselves into it. OP has now given their opinion on the matter and has no longer stayed out of it by making that comment showing that they don't approve of how their father handled the divorce and tried to stand up for themselves. \n\nNTA, but they accidentally included themselves and gave their opinion on the matter.", "This is naive. Unless she invested by herself he fucked up. \n\nNot to be all doom and gloom but people you trust can fuck you over at any time. On paper he had no part in it even if she said he did, whatever he gets is what the court decides or what she decides. He’s fucked unless he can show proof of his involvement in said investments 🤷🏿‍♂️", "Yeah see that makes sense until you are in situations like this and the divorce isn’t amicable but good luck to all the parties involved", "I make quite a bit more than my wife so my marginal tax rate is significantly higher. We've put all of our income earning investments into her name so that we pay less tax.\n\nWhere we live, if we were to ever divorce it is all looked at as combined assets anyway for the purpose of dividing up. Could it burn me somehow like it had the dad here, I guess so but it's easier live my life trusting my wife.", "How's her relationship going to be with her father when he's homeless? You absolutely SHOULD step up in a dispute when someone She supposedly loves is going to lose everything, even if she has to strain her relationship with the person trying to take everything from them. It's called having morals.", "I'm not gonna say what he did was the wisest thing, but it doesn't make him an asshole IMO.", "Interesting! I didn’t have any investments when I was getting divorced just property, I guess I assumed that your incomes would be pooled and taxes would be figured off of them both. Thanks for sharing!", "Not getting 50% of properties is very, very far from being homeless, so cut down on the theatrics. Second, this is what lawyers are for, not your children. I don’t know the reasons why her father agreed to put everything in the wife’s name only but whatever the reason, it’s not OPs problem.", "Oh we are talking about different things then, I don’t think he’s an asshole I just think he’s fucked lol", "\"fucked up\" <> asshole"]}