{"id": 26273, "submission_id": "16avxx1", "title": "AITA for not letting another passenger occupy a seat that I had paid for?", "selftext": "English is not my first language.\n\nTwo weeks ago my sister (f23) and I (f30) went to see relatives in Budapest. We live in Spain, so the best option to travel to Hungary was with Ryanair, a low cost company. We had a closed turn flight because I had to go back to work. At the last minute my sister decided to stay a few more days. When I say last minute, it's literally being at the airport. We couldn't change the flight date anymore, so after buying a new book at the duty free I thought it would be nice for once to travel comfortably on Ryanair. I had a 4+ hour flight ahead of me with two seats next to each other (you have to pay extra to sit next to your companion or choose seats in general). Once on the plane I sat in the middle seat leaving my jacket and bag on the window seat. Soon after a girl (mid 20s) sat in the aisle seat. When the flight attendants were closing the doors the girl tells me to move to the window seat that her boyfriend is going to occupy the middle seat. I immediately tell her no. She began to tell me that I did not have the right to occupy the two spaces and that in any case she had the same right to the free seat as I did. I didn't feel like arguing, so my answer was \"if you have a problem, call the FA\" hoping that she would leave the matter as it was and she wouldn't continue insisting. Obviously she started to get the attention of the FA at the front of the plane. As soon as the FA arrived at our row, the boyfriend was already standing in the middle of the aisle waiting for the FA to \"put me in my place\". As soon as she started to tell the FA that I refused to move so that her boyfriend could sit down, I just showed her on my phone that I had bought both seats and that I had no intention of moving because both seats were mine. The FA apologized to me and told the boy to go back to his seat. Throughout the flight the girl was throwing profanitys and insults at me. When I got off the plane, a woman who was traveling a few rows behind told me that I should have let them travel together and that made me wonder how I acted. So... AITA?\n\n&#x200B;\n\nEdit: The idea of ​​the extra seat was not to have my things, but to be able to stretch my legs. At Ryanair the seats are so close together that the knees touch the seat in front. So having let that couple sit together implied my discomfort for more than 4 hours. Also, it's not that I chose to be petty, I chose to use the seats that I had paid for. Which they could have done at the modest price of 20€", "created_utc": 1693938420, "permalink": "/r/AmItheAsshole/comments/16avxx1/aita_for_not_letting_another_passenger_occupy_a/", "score": 40, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I paid for 2 seats and i wanted to flight comfortable for once\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA you opted to pay for two adjacent seats, she and her boyfriend didn’t pay the extra so they don’t get to use your extra seat. As for the lady behind you? She needs to mind her own business. Why should you accommodate them, why can’t they accommodate you?", "NTA and what is up with all these entitled people flying and demanding others' seats. If you want a good seat then pay for it.", "NTA - the girl and her boyfriend should have paid the extra money to sit together.  You were 100% within your rights to say no, as evidenced by the FA.  \n\nHonestly though, I would have complained to the FA about the girl's behavior.  I mean, 4 hours is a LONG time to have someone curse at you the entire time.", "Absolutely NTA.  You paid for the seat - you should get to enjoy the extra space.\n\nIf they wanted to sit together, they should have paid for it like you did.\n\nI get really annoyed when people refuse to pay the airline fees to guarantee certain things, and then complain when they don't get it.   The airlines are giving you the choice to pay for it - or not.  Don't pay for it, don't complain when you don't get it.", "NTA\n\nThose were your seats.", "NTA. If they want to sit together they can pay for it.", "NTA -You paid for the seat, it’s yours. The girl was being an immature asshole.", "NTA.  They can sit apart  for a few hours.\nThe woman behind you....I would have told her to mind her own  business \n\nNTA", "NTA. If they wanted to travel together they should have paid the extra and booked two seats together.", "NTA.  You bought both seats.", "NTA. Maybe the woman who butted in to tell you what you should do with the seat you paid for should have given up her seat.", "NTA but that girl is for verbally abusing you all flight. If only you'd told FA so they could seat her in a middle up the back and allow you some peace.", "NTA but I’m side eyeing your choice to sit in the middle and not the window. Not because you’re TA, but because I think that’s psychotic lol. \n\nEither way, they’re your seats and she can fuck off.", "NTA\n\nYou paid for them.\n\nLearn to tell people to F-off. Life is much better that way...", "NTA", "I don't get it, couldn't they ask someone next to the BF to change with the girl who had an aisle seat? Then they would've stayed together.\n\nThere are so many AITAs lately about this, and they all feature the same old entitled jerks who won't take np for an answer, that either there's something terribly wrong with airline bookings or these are fake and rage bait.", "NTA , you paid for it so it’s yours. If they wanted to sit together so badly they should of booked two seats together.", "Nta", "NTA, you get what you pay for.", "NTA I was a kid going on a coach with my mum on holiday bringing one of my school friends who dropped out last minute.\nI didn't mind too much and was happy to have a seat free next to me. A woman sits down and me being 12 said nothing. I still regret that lol", "NTA if they wanted to sit together they should have booked seats. I fly ryanair often and every time I have company we always book our seats next to each other.", "NTA. The entitlement of people on airplanes…", "~~Gonna break with the crowd here and say YTA. Having the right to do something doesn't mean you're not being an asshole for doing it. You had every right to refuse to just use the overhead bin and use an empty seat as a storage area instead of just being nice and allowing that couple to sit together. You paid for the seat, you can do what you want with it. What you wanted to do with it was be petty and selfish. So you're the asshole.~~\n\nEdit: not included in the original story is that these seats are quite cramped an empty seat next to you means a more comfortable ride because you don't have to squeeze in. At that point, yeah, it's not just petty and selfish to not give up your seat, because you're now being asked to do more than just \"Keep the thing I have a right to even though it makes no real difference to me.\"\n\nThe way the story is written it sounds petty, if it's actually a difference to how comfortable the ride is then yeah, keep what you paid for, NTA.", "¢3€%", "Xo go rrrrx,$d.d,c 'x to", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nEnglish is not my first language.\n\nTwo weeks ago my sister (f23) and I (f30) went to see relatives in Budapest. We live in Spain, so the best option to travel to Hungary was with Ryanair, a low cost company. We had a closed turn flight because I had to go back to work. At the last minute my sister decided to stay a few more days. When I say last minute, it's literally being at the airport. We couldn't change the flight date anymore, so after buying a new book at the duty free I thought it would be nice for once to travel comfortably on Ryanair. I had a 4+ hour flight ahead of me with two seats next to each other (you have to pay extra to sit next to your companion or choose seats in general). Once on the plane I sat in the middle seat leaving my jacket and bag on the window seat. Soon after a girl (mid 20s) sat in the aisle seat. When the flight attendants were closing the doors the girl tells me to move to the window seat that her boyfriend is going to occupy the middle seat. I immediately tell her no. She began to tell me that I did not have the right to occupy the two spaces and that in any case she had the same right to the free seat as I did. I didn't feel like arguing, so my answer was \"if you have a problem, call the FA\" hoping that she would leave the matter as it was and she wouldn't continue insisting. Obviously she started to get the attention of the FA at the front of the plane. As soon as the FA arrived at our row, the boyfriend was already standing in the middle of the aisle waiting for the FA to \"put me in my place\". As soon as she started to tell the FA that I refused to move so that her boyfriend could sit down, I just showed her on my phone that I had bought both seats and that I had no intention of moving because both seats were mine. The FA apologized to me and told the boy to go back to his seat. Throughout the flight the girl was throwing profanitys and insults at me. When I got off the plane, a woman who was traveling a few rows behind told me that I should have let them travel together and that made me wonder how I acted. So... AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nThat girl and that old lady can both go pound sand", "Well... she told me that they are young and I should behave like an adult and give in a little.", "I've noticed a ton of articles about this.  I have no idea what is up with entitled people all of a sudden.  I used to fly constantly for work and never had these issues.", "It's getting worse. Almost every time I fly, I get asked to switch. I'm no longer trading, esp since I'm paying extra for the seat I want.", "It was definitely a delight to travel next to her /s", "I would have put earbuds and start singing  to myself", "I got into the middle seat so I could put my legs on the window seat without disturbing whoever was in the aisle seat.", "In my experience I think there are more cases of this type since you have to pay to choose your seat. At least in Europe. People want to sit together but without paying and everyone doesn't take no for an answer well. Ryanair flights are horrible in this sense", "People behave as if it is very expensive to choose seats, but it costs between 6€ and 20€. And you can pay for just one by selecting the seat next to the one you are randomly assigned", "The idea of ​​the extra seat was not to have my things, but to be able to stretch my legs. At Ryanair the seats are so close together that the knees touch the seat in front. So having let that couple sit together implied my discomfort for more than 4 hours. Also, it's not that I chose to be petty, I chose to use the seats that I had paid for. Which they could have done at the modest price of 20€", "Cat?", "Or toddler?", "Nah, they could have learned to behave like adults and accept that they don't get to help themselves to what someone else has paid for.", "If they're old enough to travel together by plane, they're old enough to know that the seat someone else pays for isn't theirs to take.\n\nNTA.", "That's always the bullshit line given to people when they stand up for themselves.  Be the bigger person, keep the peace, etc.\n\nWhat they're really tell you is to be a doormat so the bully will shut up.", "I actually speak from experience as this has happened to me so many times now. I always book the window seat for myself and it is always the parents with young kids who practically demand I switch seats because \"their baby wants to see the plane take off/land\". I had a man yell at me and then said the least I could do as a woman was let the boy sit on my lap. Now ,I don't even bother with them just keep on ignoring till they embarrass themselves.", "Okay that’s fair, gotta do what you gotta do in those tiny seats.", "The legroom would've been worth calling out in your story, because that actually does make more sense. The way you tell it it sounds like you just wanted the seat as a place to put your stuff other than the overhead bin.", "That is CRAZY!  Let the boy sit on your lap?  haha  Like, I said, I used to travel constantly for work - up to 6 times a month - and changed positions in 2018 and haven't been on a plane since.  I got \"traveled\" out.  I'm so curious why people have gotten so out of hand.", "I just put it in an edit. Furthermore, only cabin suitcases are allowed in the overhead compartments. Ryanair is a bus with wings, quite uncomfortable and with very little space", "It has escalated to a new level recently and it is so confusing why. People are expecting too much even though they don’t even give out basic respect!"]}