{"id": 26316, "submission_id": "16bcslq", "title": "AITA for having boundaries even with her gay friend?", "selftext": "AITA For having boundaries even with her gay friend?\n\nI started seeing this girl 2-3 months ago. Things have moved very quickly, we see each other 4/5 times a week, she stays at mine 4 nights a week. She’s coming to live with me for 2 weeks soon while her parents are away, we were looking at holidays. \n\nShe has a gay friend, Tom, who she’s known (works with) for a long time but has only been friends/close with him for 4 months, after she split with her ex 5 months ago. Tom is now married as of this year too. Tom & I get on well, and we do things as a 4 sometimes now too. \n\nShe showed me this romantic getaway lodge in the forest “look what Tom sent me, Tom & I are thinking of booking what do you think” I thought she meant booking for her & I, Tom & Toms hub. \n\nWe were having a conversation about boundaries, she asked me what I considered to be crossing the line. I said for me, sharing a bed with another man. She said “so I can’t go away with Tom then?” I said what do you mean, turns out she meant for just her & Tom to go away on this romantic getaway lodge, not the 4 of us.\n\n1. I said I’m not comfortable with her sharing the bed with any man, which includes Tom. It’s just crossing a line. Just get twin beds..?\n\n2. Why would you want to do something romantic like that with someone you’re not romantic with? Especially given that her & I haven’t even done that yet? It feels really weird…? \n\n3. Sometimes I feel like I’m the third man in the relationship. We were talking about going away for my birthday; Toms birthday is 2 days before mine and “oh but then I can’t see Tom on his birthday” I said that’s fine, you can see him the day before? She seemed upset. The other night, Tom was round hers after work. I said do they want to come to the coast. She said no because her & Tom were having a Chinese with her parents later but we could meet for a walk for a bit. After, her and Tom went back for the chinese with her parents and I had to go home on my own. My sister was shocked she didn’t just invite me to join too, it very much felt like they were the relationship item, and I was the third wheel. \n\nYesterday, we almost split because she didnt like that I felt uncomfortable about Tom and would never sacrifice her friendship - I never asked her to, I only said I have a boundary on sharing the bed and that it made me uncomfortable, but that I wouldn’t stop her regardless, she just knows how I feel. She actually said she understood this and agreed when we discussed it. Now she wants to hold off on booking my birthday away and a holiday we were planning and wants to take things slow, no longer wants something ‘serious’ yet but she’s happy where we’re at - basically if I said will you be my girlfriend right now, she’d say no. \n\nYes, the dude is gay, but she’s said how if he was straight he’d be the perfect partner, and I feel like I shouldn’t be the 3rd person in the relationship. I believe it’s important your partner has to be prioritised as number 1. \n\nAm I the arsehole?", "created_utc": 1693982126, "permalink": "/r/AmItheAsshole/comments/16bcslq/aita_for_having_boundaries_even_with_her_gay/", "score": 48, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I had an opinion on her sharing a bed with another guy, I said I’m not comfortable with it because it’s crossing the line \n\n2) She feels like I’m making her sacrifice a friendship with her gay friend just because I don’t want her to share a bed, but that’s not the case\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">but she’s said how if he was straight he’d be the perfect partner,\n\nBruh, you can´t win that race, man. I was on the verge about the sharing the bed thing, bc I also do share my bed with friends, also guys, and so does my bf. But the thing about the birthday, the uninviting from her parents and THAT specific sentence... I don´t know.\n\nSeems likes she likes you but would dump you any second for a straight version of Tom. I don´t think Tom is the problem per se, but you guys don´t match as great as you might think. I´ve been there when a guy asked me after 2 months if I want to be his gf, because he was so madly in love and unable to see, that I was really really unsure. Couple of weeks later he broke it of, because he started to see what I was seeing (vastly different priorities, interests, vies of life ect.). So, yeah...\n\nAll the best!\n\nEdit: typo", "NTA. She seems to like him for the relationship and you for the sex. And seems to be trying out circumstances where he might feel romantic.\n\nI don't do third wheel. I'd move on.", "NTA. I think it's one thing for her to say \"I have a friend with whom I'm very close\" and another thing to say \"I have a friend who matters more than you.\" Tom matters more than you, mate.", "NTA. If my partner shared a bed with his lesbian friend, I would be uncomfortable too and oppose to it.", "Is Tom gay or bi-sexual. I understand your boundaries and with or without sex between them, their behavior is not alright. NTA.", "NTA\n\nI think she’s really hoping he’s not gay", "she's in love with her bestie. whether he reciprocates or not is besides the point.\n\nsave your dignity and get out of there tbh.", "NTA   So she's known Tom for only a month more that you?  But she takes Tom to dinner with the parents, is going on a romantic weekend with Tom, says he's the perfect partner except he's gay and he's more important to her than you are.   Honey Tom is her relationship & you're the booty call.    I hope you find someone who puts you first.", "NTA \nHer priority is clear. It’s not you. Move along.", "NAH\nThere are 3 vectors here, as i see it.\n1. Your insecurity/possesiveness\n2. Your girlfriend’s attachment to tom\n3. Your girlfriend’s lack of prioritization of you.\n\nObviously you are not entitled to come along, but taking a trip with tom, sleeping in bed with him ETC - i can understand the insecurity/anxiety.\nYou also have an inherent bias, as you imply you’d be fine if it was a woman she’d share a bed with.\nPlanning a romantic getaway with someone you WORK WITH and have been friends with for 4 months, is seriously fucking weird imo.\n\nShe’s clearly not prioritizing you, the relationship is over, why do you bother?", "I think the problem isn't that she might sleep in a bed with a gay friend, the problem is that this particular gay friend seems to be more of a priority than her actual boyfriend. Which, tbf, at the beginning of a relationship I think it's fair that your actual friends are more important than your romantic partner - as you never know quite how long you'll be dating them whereas your actual friends will likely be in your life for a long time. \n\nThat said, at some point that needs to switch. When you get serious about a relationship, your partner should become your first priority, above all other relationships in your life. It sounds like you are already at that point, whereas your girlfriend clearly isn't. I think it's smart to have a conversation about that, and see if you can get to be on the same page. If she isn't ready yet or expects to never be ready to make you more of a priority, and you feel like this needs to be the case from now on, then splitting up is probably your best bet. However, if she feels like you're not together long enough right now but she expects to be there after 6 months or a year, for example, then you could consider whether that's worth it to you.", "NTA.\n\nHer relationship with this guy goes back years, while you’ve only known her a couple of months. There’s gonna be an element of closeness that you would have just had to deal with had your relationship taken off. That said, her behaviors are indicative of someone who isn’t interested in giving you attention as an individual. You’re the side dish, not the main course. I think you’d be better served by moving on.", "Nta hate to say it but the girl is in love with her gay best friend. I’d be out the door you don’t need to be involved when the drama starts which it will when toms husband starts to feel like the 3rd wheel", "NTA", "NTA. Bounce bro", "NAH, I don't think it is specifically about Tom.  You're trying to control her platonic relationships with other people.  If I was early on dating someone and they took issue with my friend snd how we get on, I would see that as a huge red flag.  As the Spice Girls said, \"If you wanna be my lover, you gotta get with my friends.\"", "I'm not going to comment on where I think this \"relationship\" is going, because it's not my business and you already seem to know where it's going.   \n\n\nThat said, no you are not the asshole for having boundaries, and from what I know of your side of the story, it seems like your requests are perfectly reasonable for any adult woman to reason with.", "NTA, and btw, sorry to break this to you, Tom is fucking her", "NTA. Red flags all over\nIf he wasn't gay, he would be the perfect partner?  Going away and sharing a bed?  Having to spend his birthday with him?  \nHaving male friends, gay or straight, is all well and good, but this is more than that.\nStart walking away now.  Find someone who prioritizes you.", "Nta hate to say it but the girl is on love with her gay best friend I’d be out the door you don’t need to be involved when the drama starts", "NTA. I don’t think you’re compatible with this woman, she doesn’t treat you very well and as you said yourself, you feel like a third wheel.", "NTA. Sounds like she’s in love with Tom.", "Slight YTA and here’s what you need to know. This guy is closer to her than you are because he is fun to be around, he’s interested in what she’s interested in, he finds cool exciting places to go and invites her along, he’s a great listener, he’s interesting and she feels safe around him. Now… are you all that? If you’re not, learn to be.", "NTA. Being gay does not mean he doesn’t like women. I have a friend that is gay and married to a man, but still sleeps with women, and was married to, and have children with a woman before. \n\nMy wife had a gay friend when we first started dating, and I told her to choose between him and me after he walked into the bathroom while she was showering, with me in the room. He did not like it when I took him on about it, and it nearly ended in a fist fight. Told him he isn’t welcome in my house anymore. They are not friends anymore either. She is going to have to choose, or you will have to make that decision for her.", "NTA\n\nHate to break it to you bud. It's Tom that she really wants.\n\nYou're being used as a surrogate penis.\n\nYou deserve better.\n\nEdited for phrasing.", ">but she’s said how if he was straight he’d be the perfect partner\n\nI'm sorry OP, but you're being treated as a place holder. You deserve better than this. Leave her and move on.", "NTA, you clearly expressed a boundary.\nYour relationship is still young so of course you have to discuss these things and you made it clear that for you sleeping with another man is a deal breaker.\nGay or not, making you feel like the third wheel and wanting to cancel plans for your birthday, prioritising his instead is very wrong.", "Nta your definitely not wrong and a romantic get away with any friend is weird. I would just chalk it up and leave her be. Your choice if you wanna remain friends or something I would suggest to cut completely. Regardless of what you do your feelings are valid.", "NTA", "NTA she obvs has strong feelings for Tom its odd that hes married and planning to go away without his husband . Your partner should be NO1", "YTA. \n\nYou've only been dating for 2-3 months; she's known Tom for much longer than you, and they have a very close friendship. Just because your relationship is romantic and sexual doesn't mean it automatically supersedes all the longer platonic relationships in her life which are equally as important and meaningful. Accept that she has other people she cares about and makes meaningful commitments to if you want to keep dating her. \n\nAlso, as a side note, it's understandable that you feel uncomfortable if your partner is sharing a bed with someone else. But I see a lot of talk about 'boundaries' being used these days in ways that are very unhelpful. It's good to chat about relationship expectations, but you don't set a 'boundary' around someone else's behaviour: boundaries are something you set for yourself ('if X happens, I will do Y'). What you're talking about is creating rules that the other person has to follow. Not quite the same thing and that can be a slippery slope to controlling behaviour. I'm not saying you are being controlling in this instance, but something to think about for the future.", "I would be worried too, it seems like she loves gay men. One fucks dudes, the other posts on AITA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA For having boundaries even with her gay friend?\n\nI started seeing this girl 2-3 months ago. Things have moved very quickly, we see each other 4/5 times a week, she stays at mine 4 nights a week. She’s coming to live with me for 2 weeks soon while her parents are away, we were looking at holidays. \n\nShe has a gay friend, Tom, who she’s known (works with) for a long time but has only been friends/close with him for 4 months, after she split with her ex 5 months ago. Tom is now married as of this year too. Tom & I get on well, and we do things as a 4 sometimes now too. \n\nShe showed me this romantic getaway lodge in the forest “look what Tom sent me, Tom & I are thinking of booking what do you think” I thought she meant booking for her & I, Tom & Toms hub. \n\nWe were having a conversation about boundaries, she asked me what I considered to be crossing the line. I said for me, sharing a bed with another man. She said “so I can’t go away with Tom then?” I said what do you mean, turns out she meant for just her & Tom to go away on this romantic getaway lodge, not the 4 of us.\n\n1. I said I’m not comfortable with her sharing the bed with any man, which includes Tom. It’s just crossing a line. Just get twin beds..?\n\n2. Why would you want to do something romantic like that with someone you’re not romantic with? Especially given that her & I haven’t even done that yet? It feels really weird…? \n\n3. Sometimes I feel like I’m the third man in the relationship. We were talking about going away for my birthday; Toms birthday is 2 days before mine and “oh but then I can’t see Tom on his birthday” I said that’s fine, you can see him the day before? She seemed upset. The other night, Tom was round hers after work. I said do they want to come to the coast. She said no because her & Tom were having a Chinese with her parents later but we could meet for a walk for a bit. After, her and Tom went back for the chinese with her parents and I had to go home on my own. My sister was shocked she didn’t just invite me to join too, it very much felt like they were the relationship item, and I was the third wheel. \n\nYesterday, we almost split because she didnt like that I felt uncomfortable about Tom and would never sacrifice her friendship - I never asked her to, I only said I have a boundary on sharing the bed and that it made me uncomfortable, but that I wouldn’t stop her regardless, she just knows how I feel. She actually said she understood this and agreed when we discussed it. Now she wants to hold off on booking my birthday away and a holiday we were planning and wants to take things slow, no longer wants something ‘serious’ yet but she’s happy where we’re at - basically if I said will you be my girlfriend right now, she’d say no. \n\nYes, the dude is gay, but she’s said how if he was straight he’d be the perfect partner, and I feel like I shouldn’t be the 3rd person in the relationship. I believe it’s important your partner has to be prioritised as number 1. \n\nAm I the arsehole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Completely NTA here.\n\nYou have boundaries, she doesn't respect that. You want a commited partner, who puts you first (while still having friends of course). She wants Tom (and is probably trying to make a move on him on the getaway) but you will do untill then.\n\nDont be a replacement or a rebound. Tell her you are not happy with her, and you feel like you are being used. Wish her good luck and don't look back. \n\nNobody deserves to be a 3rd wheel in their own relationship.", "Mate, remove yourself from that whole situation entirely. She’s not mentally or emotionally stable by the sounds of it. You can find a better woman, no doubt. NTA.", "NTA.\n\n\nSorry bro but she is 100% in love with Tom and hopes she can convert him. You're just a distraction", "She's apparently in love with her gay bestie.\nNTA", "I’d also be curious how Tom’s husband feels about their relationship/her clinginess…", "Notice Tom suggested the romantic getaway...what is going on with his husband here?", "This. She's obviously Tom's gf, not OP's. OP deserves to find someone who wants to be in a relationship with him and not Tom. \n\nYou can do better, OP.", "Agree it's time to get a new girlfriend. NTA op", "aka you believe that person is both not gay and a cheater, with no evidence. Homophobia? Projection? Major trust issues? Either way, you have work to do.", "I don’t know; I think gay, he’s married to a man. He’s had girlfriends in the past but apprently never done anything with a girl as he apparently finds it “icky”", "She is hoping she can “change him”\n\nLet’s just say that he is bi btw I think she is pretty delusional if she thinks that she can also make him cheat on his husband.", ">Planning a romantic getaway with someone you WORK WITH and have been friends with for 4 months, is seriously fucking weird imo.\n\nTHIS so much. Thank you.", "They’ve known eachother awhile, but they only really became friends recently when she split with her ex", "There's always a comment like this one, huh", "You described bi people without once mentioning bi people. Impressive.", "I think in her mind Tom is her romantic/emotional boyfriend and op is her sexual boyfriend.\n\nIdk if this makes sense.", "🤣🤣🤣", "I’m thinking that Tom is pretty oblivious to all of this and just sees her as a regular friend ( she clearly doesn’t see him as a regular friend tho ) , so I don’t think toms husband has an opinion or this creates a problem in their marriage.", "Probably Tom says, she´s be the perfect partner, if she was a man.", "no they don't. it's normal to have that boundary whether you like it or not. straight or gay. that's a normal boundary.", "It’s not that hard to book one room with 2 beds", "Yeah well of course he's going to tell you he finds it \"icky\". Some alcohol, poor decision making and a romantic night away makes \"icky\" tolerable.   \n\n\n🚩 Run buddy.", "It doesn’t have to be sexual between her and Tom to see that she’s prioritizing her relationship with him over the relationship with you. It’s a bad sign at this juncture. She’s not required to terminate her friendships but when things get serious the romantic partner should come first, which for now is not happening with you.", "All the more reason for why you are not TA. Trauma bonding can quickly result in rapid, deep relationships, but that doesn’t mean you cut off everyone else.\n\nDon’t get hung up. You’re dodging a bullet here. There’s someone out there who will treasure you as much as your now-ex treasures the gay friend that she’ll never truly have in the way she wants.", "After all these years, bi-erasure is obviously going strong.", "nah. you don't get to define how ppl define themselves. some ppl place more importance on the romantic part than anything sexual and some ppl aren't necessarily attracted to a certain gender but not repulsed by them either and will have sex with them sometimes just bc availability and ease. or for the sake of threesomes sometimes too. \n\nppl don't always fit into perfect labels and boxes. ultimately we just have to respect what ppl define themselves as.", "Oh 100%", "This icky comment was what she told me about him, not him to me if ygm? she also doesn’t drink alcohol at all really, don’t know if that changes your thoughts", "Op NTA but its time to find someone who doesn't consider you the 5th wheel in your own relationship.", "My thoughts don't really matter, but if anything the fact that *she* told you he thinks it's \"icky\" makes it a double red flag in my books.   \n\n\nThat said, people have red flags man. It's the way things are.   \n\n\nMy advice if it matters is to just tell her how you feel about this friendship. If you're not comfortable with her response, then the relationship is new enough to decide it's not going to work out between the two of you.   \n\n\nDon't sacrifice your own comfort and push your boundaries beyond your limit for someone else. Stick to your guns, learn from this and move on.   \n\n\nBest of luck!"]}