{"id": 26314, "submission_id": "16bjaxm", "title": "AITA for telling my parents that they would have to pay me if they wanted to see my kids more.", "selftext": "I just got a job offer in a different state. My husband works in a fly in fly out camp so it will not affect his work. However my new job adds nearly $30,000 a year more to our budget. \n\nMy in-laws live in a different state already and make an effort to see our kids. However we currently live eight blocks from my parents. And they are losing it. \n\nThey are saying that I'm a horrible son for moving their grandchildren away from them. That they have grandparents rights and all that. \n\nI told them that I would be willing to change my family's plans so long as they made up the difference between what I currently earn and my new job. \n\nI was even willing to go net. I wasn't asking them for my gross earnings. Just the after tax difference. \n\nThey said it was ridiculous to expect them to pay to see their grandchildren. I asked them if they thought that my in-laws didn't pay for their flights and stuff when they visited? They said that is different. I don't think it is. Just because my parents can walk to my house they think that seeing the kids isn't an effort for everyone else. \n\nMy siblings have been calling me to say I'm an asshole for demanding money from our parents to see the children. I offered to let them pay me the money I will be losing if I don't take the new job. Then they figured out my parents didn't tell them the entire story. Now there is a big family fight because one of them has a job that may require he to move. And my brother will likely move after he completes his post grad. \n\nI don't actually want my parent's money. I just want them to understand the money they are asking me to give up.", "created_utc": 1694004201, "permalink": "/r/AmItheAsshole/comments/16bjaxm/aita_for_telling_my_parents_that_they_would_have/", "score": 3281, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my parents that if they didn't want me to move for my new job they would have to pay me the difference between my current income and my new job. I might be the asshole for putting money before family. But I need money too.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and \"grandparents rights\" are not a thing except in extreme situations (like if a child is left orphaned and grandparents have a right to seek custody).  \n\n\nThey are free to come visit you whenever, I'm assuming. And if they care that much, why don't they move to your new town?", "NTA\n\ncongratulations on your new job, I hope it does fabulous things for you and your family", "Nta, I get that you're not actually asking them for money but making them realize you cannot give up this job opportunity just so they can live close.\n\nEta also the fact they threatened the grandparents rights crap makes them a huge ah. If they're willing to threaten to take children away from their parents simply because they don't get their way, then they shouldn't have access to those kids.", "NTA\n\nIt's not the 1950's anymore and we don't have grandparents/parents/kids all living in the same household or even the same town anymore.  With the modern economy, the \"nuclear family\" is now the norm and not the exception.\n\nYou have a fantastic opportunity for a new job with much better pay.  The only people that can make the decision on whether or not to pursue that opportunity are you and your spouse.  If you decide that taking the job is the best thing to do... you do it.\n\nSimply tell your parents this is too good an opportunity to pass up.  You understand that they are down because they won't be able to see the grandkids as often, but your door is always open for them when they want to visit.  However, you need to take advantage of this opportunity so you can provide for your family in the best way possible.\n\nIf they can't understand that, they are just being selfish expecting you to tailor your lives around them instead of doing what's best for you and your children.", "NTA. Your title had me thinking otherwise, though. People MOVE. Jobs CHANGE. It isn't a personal slight against your parents. Although, with the way they are acting, I'd move even if I didn't have a better job because once you threaten me with legal action (grandparents rights), whether baseless or not, that's when you lose me and my kids.", "Here's how your parents are planning your life:\n1. Turn down job improvement and stay near them\n2. They will live their normal life while you are making an insufficient salary\n3. Parents will die\n4. You never have the ability to bring your missed opportunities current. You will never recoup the lost wages nor have the ability to improve your standard of living going forward because you will be too old. \nSee how that works?", "NTA\n\nJust do what is best for your own family and let your parents decide whether or not to come see your kids.", "NAH\n\nYou need to do whatever is in the best interest of your family. Your comment about them paying you is just to show your reasoning. \n\nYour parents are understandably upset because they won’t be seeing their grandkids as often. They’re sad & upset so they’re saying crazy things. Seems pretty normal. \n\nEdit", "NTA\n\nSometimes, asshole people need it beat upside their head to understand. A lot of times, subtle doesn't cut it. Hyperbole is the game of the day, then.", "NTA - You have a family now and must do what is best for them, they must be your top priority.  Your parents have had it is easy to see their grandchildren being only 8 blocks away.  Life changes occur, that is just a fact of the matter.  If they want to prioritize seeing their grandchildren, great, let them move near where your new job will be, otherwise zip it already.", "NTA but geez you could be a little less blunt and a little more empathetic towards your parents who are obviously having a hard time dealing with the fact that their grandkids are going to be moving far away.", "Yeah NTA but stupid to bring up them laying to see them. Ultimately its about priorities.\n\n\nIf the new job improves your quality of life they should accept that.", "ESH.\n\nYour parents are being the bigger AH.\n\nBut your suggestion was not honest and only to stoke a fire. There is no way you were expecting your parents to meet that demand when you offered it up as an “option”. YTA for bad faith deals.\n\nIt would have been better to just say I’m sorry no. And let them get mad.", "You and your parents are the AH. \n\nYou handled that badly. You have every right to move for a better job. You need to do what's best for your family. \n\nI don't know where you're located, but grandparents rights sound like a horse shit card to pull. \n\nIf you hadn't chosen to go with with \"paying you\" tactic, your parents would be entirely the assholes. But because you did, YTA too. \n\nApologise for being an asshole. But they need to be understanding. Perhaps they can follow if they want to continue being active in their grandchildren's lives. But they shouldn't be trying to hold you back.", "[deleted]", "YTA. it is your family.  what you suggest just seem like a way to prolong fight and start up weird argument.  i think YTA for how weird you are being with the whole thing.  tell them they can come visit.  that is it.  they will just have to deal with it.", "You ALL are the Asshole...... Every one of your family\n\n&#x200B;\n\n&#x200B;\n\nYou are all ADULTS.. YOU are providing for your FAMILY So if that mean relocation... So be it.  YOUR PARENTS  are ASSHOLES   for not being supportive of this move.. YOU ARE THE ASSHOLE  for event saying pay me 30,000   what are you 5?    Christ  do what's best for you... they will get over it.", "[deleted]", "YTA: who in their correct mind emotionally and financially blackmails their own parents for wanting to see their family members? You don’t own these children, neither do your parents. No child should have money associated with their value. You’re disgusting and a terrible parent.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI just got a job offer in a different state. My husband works in a fly in fly out camp so it will not affect his work. However my new job adds nearly $30,000 a year more to our budget. \n\nMy in-laws live in a different state already and make an effort to see our kids. However we currently live eight blocks from my parents. And they are losing it. \n\nThey are saying that I'm a horrible son for moving their grandchildren away from them. That they have grandparents rights and all that. \n\nI told them that I would be willing to change my family's plans so long as they made up the difference between what I currently earn and my new job. \n\nI was even willing to go net. I wasn't asking them for my gross earnings. Just the after tax difference. \n\nThey said it was ridiculous to expect them to pay to see their grandchildren. I asked them if they thought that my in-laws didn't pay for their flights and stuff when they visited? They said that is different. I don't think it is. Just because my parents can walk to my house they think that seeing the kids isn't an effort for everyone else. \n\nMy siblings have been calling me to say I'm an asshole for demanding money from our parents to see the children. I offered to let them pay me the money I will be losing if I don't take the new job. Then they figured out my parents didn't tell them the entire story. Now there is a big family fight because one of them has a job that may require he to move. And my brother will likely move after he completes his post grad. \n\nI don't actually want my parent's money. I just want them to understand the money they are asking me to give up.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "They just proved they are too lazy and too cheap to come visit you. \n\nWhere I come from, the grandparents travel to the grandkids most often unless they are frail. \n\nTrying to force parents with child to travel for your benefit and convenience is selfish.", "NTA\n\nYour parents immediately threatening you with supposed grandparent rights is pretty concerning though", "NTA", "NTA\n\nYou need to make sure everyone understands that you are only illustrating the huge amount your parents are asking you to give up.  Kids move away all the time, it's fine.  They can come visit, you can also visit, use video chat.    You may need to apologize, but they need to cut the cord.", "NTA My mind is boggling that parents would really want their kid to give up a promotion that would make his life better so as not inconvenience them.\n\nI saw a study once that also boggled my mind.  It was survey type study sent out to family households.  It was bunch of hypothetical questions but this one stood out to me:\n\n\"If you had the power to choose which of these would you select:  Your child moves far away from you but would be happy OR they live near you and be unhappy.\"  85% of the respondents chose for their child to live near them and be unhappy.\n\nThe mind truly boggles.", "Yep! I am a lawyer in Georgia, one of the states with some of the strongest grandparent rights. And as long as the parents are together and married, no court is going to grant visitation rights to grandparents.", "I see other people who don't quite get that, lol.", "OP could have worded it better so it was more clear", "It wasn't the first thing I said.", "OP isn’t actually asking to be paid. He is trying to make the point that his parents are asking OP to take a huge financial hit for no reason other than their own convenience.", "What the grandparents did by saying they have \"rights\" is to implicitly blackmail the parents into staying or they will take them to court for \"custody\".\n\nSo the response of \"then make up the difference\" is hardly out of place.", "As I stated in my post, I pointed out that my in-laws make the effort, and take the expense, to visit.", "I don't want their money. I just need them to understand what they are asking me to give up.", "Bruh they don’t actually want the money. They want their parents to understand what they’d be giving up if they stayed instead of moving.", "I mean it's pretty clear in the sentence \" I don't actually want my parents money, I just want them to understand what they're asking me to give up\"", "I hear you, and I know. But there are better and worse ways to make points. I get that OP doesn't want the money from his parents and is only saying it to try to get the grandparents to understand. But strategically, is a bad move. \n\nBut due to communication, that is the story the parents believed. \n\nIf I'm going to make a wild claim (X) to make a point, I make it clear that I don't actually want X, but that I'm trying to make the point. The whole issue is about seeing the kids, and all the adults have done is make a huff and puff about demanding money from grandparents so they won't take a job, and that's why OP is posting about this whole thing thats irrelevant to the thing that's actually important. \n\nI might be tired and not thinking clearly, so I might be misreading, or just getting things wrong.", "[deleted]", "i was talking about the one complaining.  not the in laws", "[deleted]", "So that’s what they told their parents? I misunderstood and thought it was a summary for us", "Grandparents rights are bullsh*t and often only enforceable after one of the parents die. But you can sue for anything and cause people problems because you are a petty person.", "The grandparents have no rights in the situation described by OP. Grandparents’ rights are rarely a real thing, absent a court order (such as in cases of abuse, neglect, or abandonment by the real parents).\n\nUsually, for example, grandparents have zero automatic right to visitation. Parents have the ultimate right to decide whether or not their child will see their grandparents.", "I tried everything else first.", "I tried every other thing I could think of first.", "I tried everything else I could think of first.", "I wouldn’t call grandparents that genuinely care about their grandchildren “petty”.  Perhaps yours are, but it’s not the gold standard.  The law was made for people that use their children for extortion, like OP!", "I guess but my point here would be that you may have not even said that. If they don’t understand, they don’t, you can not fight windmills.", "Lol. It was designed for grandparents cut off by the surviving spouse of their grandchildren. Not for them to be able to stop their children from following career opportunities.\n\nThe OP has every right to move away and use a demonstration to show them what they are \"demanding\" he lose so they can be more comfortable in their control over the family.", "\"I didn't FUCKING demand money from our parents to see my kids. I got a fucking $30k raise to take a job in another state, but they are complaining about me movibg. I said they are welcome to make up the 30k if they want me to stay, but otherwise, I am going. So chill out with the indignation and namecalling, you don't know what you're talking about.\"", "My mom who lives a 1000 miles away visited more than my IL’s who lived 20 miles away. My kids were fine. My mom was always interested in the kids. IL couldn’t tell you their names", "NTA.   \n\n\nHold fast. Your parents are about to find out what happens when they are pushy… the birds all fly from the nest. And then they have to fly every time they want to see their kids.", "This is insane.  Move where you want to and they can pound sand.", "You can tell who didn't read the entire post lol. Reading for comprehension is still a thing people...😂", "You would turn down an offer of a job that probably will improve your family's life just because the grandparents don't want to make any bigger effort to stay in touch with their grandchildren? Sounds ridiculous. With grandparents' rights, there come also grandparents' responsibilities, so at least them trying to contact the kids. Maybe you could've worded it other way, but still NTA", "NTA. You tried to put things in perspective for your parents, it didn't work. You should make the decisions that suit your family best, and moving sounds like it's best for all of you", "tell your parents they can move if they feel the need to be close.\n\nmy parents moved states a few years before I was born. right after I was born my grandparents packed up and moved a few minutes away because they wanted to be around.\n\nit’s not your responsibility to cater to your parents", "NTA and grandparents rights don’t fit in to this equation. They can come see them. Sheesh.", "NTA. But this escalation is weird. Sometimes people move. There doesn’t need to be any further argument about it.", "I am most curious as to what rights they think they have as grandparents", ">  That they have grandparents rights and all that. \n\nNope, anybody pulling out that line is the AH except in an *extremely* limited set of circumstances. You are NTA pretty much just for that.\n\nHowever, the best way to get out of this nonsense is to not engage with your parents about it. Set a clear rule - they have no unsupervised access to your children. If at any point they mention anything about this move to the children or to you, you will immediately end the phone call or visit and will not contact them again for a week. You have got to be firm with parents when they start this nonsense.", "NTA .\nAlso, I'm child-free, so maybe I look at families in a different way....\nBut has nobody expressed they will miss YOU? Not for babysitting/helping them out/things you can do for them/letting them meet grandchildren/nephews and nieces ... That they will miss you for you!!", "NTA\nIt seems this was the most straightforward way to explain to your parents why you are moving.  Looks like the whole family suddenly sees your parents think they can control them as adults and everything is falling apart.", "NTA and I think your explanation to them makes sense. It will be hard for them to get used to not seeing their grandchildren as often but that is the way life goes sometimes.", "NTA - yeah they are freaked - but they will get over it .\n\nOFC - any free and easy child care you have with them will now be gone.", "Put it this way if they really want to see their grandchildren they're going to come visit their grandchildren It's as simple as that, No matter how far away you are", "NTA.You're not infringing on any of their rights.", ">That they have grandparents rights and all that\n\nNo, they don't. \n\nNTA \n\nThey can pay you what you'd be missing if you don't take the job, or they can deal and visit like the in-laws do.", "NTA.  To me it was clear you are making a point.  You shouldn't limit your career and financial prospects or be tied to a geographic location to appease your parents.  Frankly, they are WAY overstepping IMO.  \n\n\"I'm sorry you feel that way.  We look forward to your visits.  How about that weather.\"  Rinse and repeat.  Don't engage further.", "NTA. And it may be better for you, your spouse, and the kids if your parents aren't in your collective faces all the time.", "NTA. You are doing what is right for your family. The extra income will help give your children better opportunities. Your parents are being unreasonable and selfish.", "NTA, but I think the escalation didn’t communicate with them the way you wanted, and was ultimately unhelpful.\n\nPartially, it’s unhelpful because you framed it like they actually were involved in this choice. They are not. The best thing to do for your family is for you to move and take this job. You’re going to do the best thing for your family. \n\nWhile this choice affects them, they don’t get a vote, it’s not a discussion, you were making an announcement. \n\nYou gave a hypothetical that you see as absurd to try to show them that this isn’t their decision. Since they believe they have a voice in it, they took your hypothetical as a real negotiating point. Again, it is not a negotiation. They can have feelings, but they are not included in the decision making. \n\nCongratulations on your new job. Tell your parents that you’re going to miss having them so nearby and that you look forward to them visiting. And walk away from every discussion that they approach like they have a say about this. They need to handle their own feelings here.", "NTA. That's ridiculous that they expect you to give up a better paying job just because they don't want to have to make an effort to see your kids.", "Grandparents rights are real EXCEPT that they're wrong in assuming they have them. \n\nUsually the only way they're rewarded is if you're living with them and single for a majority of kiddos lives. Then they can apply for visitation. \n\nTechnically they can still apply for visitation BUT no where does it say YOU have to facilitate said visitation; that's their responsibility and financial obligation. \n\nNTA", "NTA\n\nDo what is best for your children and marriage.\n\nYour parents sound like they can communicate for themselves, so they should have no trouble communicating with airline and hotel providers if they want to set up a time to come see you and the kids in your new home.\n\nIf they don't like that you and the kids are moving somewhere new, they can talk that through with their therapist.", "NTA - take the job, move the family. $30k additional is nothing to sneer at, and your parents should be more supportive. This time in your lives will be a cherished memory for everyone, and they can always move to join you in the new spot if they feel so inclined.", "You didn’t ask your parents for money.  You are looking out for your immediate family and $30k is a HUGE amount of money.  Your parents are just butt-hurt because now it will cost them money and effort to visit you.   They will get over it.  Children move away.  My children have moved away for work.  I am happy for them because they are successful.  I get to travel a lot to visit :).  It is a win-win.  \n\nGrandparents rights?   A judge would laugh them right out of the building.", "NTA.  They want you to give up on 30k annually just to keep you and the kids where they want you to be.  They will be costing you 30k EVERY year because of their entitlement.  And then they up the entitlement by threatening you with legal proceedings?", "Their reaction is so extreme that even if you weren't moving I would immediately start limiting their time with the kids. No unsupervised visits, at all. They are already screaming \"grandparents rights\", I would not put it past them to attempt a kidnapping. NTA, but be on guard.", "NTA, but when you opened negotiations (however non-seriously), you bought yourself more of this conflict. You're moving, that's a thing that people do, your parents will cope with it however they cope with it. Don't make yourself available for endless emotional processing of your decision. Absolutely don't make them feel they should have a vote. This isn't about them.", "NTA. Not at all. You have to do what is best for your family, and a $30000 difference in income is what is best for your family. The grandparents can fly or drive to where you are if they want to see your kids.", "NTA.  You cannot live your life to accomodate your parents' wishes at the expense of your own family.", "NTA!! If you have an opportunity take it and grandparent rights aren't a thing when it comes to moving states.", "NTA your parents have to understand this is life and the fact your inlaws have to travel to see the kids is a perfect example.", "NTA…but I would take the job after explaining to your parents they don’t get to run your life.", "No, you're not that asshole. Your parents are just super-entitled people who need to grow up. They are expecting you to give up a better future  just so they can see their grandkids more often.\n\nTell them you aren't preventing them from coming to visit as often as they want but they'll have to get used to a long drive to do it.", "NTA. You’re not in a situation where they’d be able to file a petition citing grandparents’ rights. They’ll have to do like many other grandparents do - fork over a bit of money and effort to travel and see their grandkids.", "NtA, I had this issue with my parents. At one point I was going to move 1500 miles away for a job. My parents flipped out, how are you going to take my grand kids away from us. I countered with, well you did the same to your parents. You moved to another country away from them, so I am just following your footsteps. They said well that doesn't count. Yeah of course it doesn't cause you did what's best for you. I didn't end up moving for different reasons. But I am looking to move even further. Did you live close to your grandparents? If not use that against them.", "NTA. I did tbis with my ex’s family. They harassed us to move from Big City to Podunk Town 13 hours away. \n\nI said, “hey, pay for my grad degree and I’ll quit my job and move!”\n\nThe LOOK his stepmom gave me was hilarious.", ">I don't actually want my parent's money. I just want them to understand the money they are asking me to give up.\n\nThen have THAT conversation like a damn adult.\n\nESH.", "Your ask is pretty ridiculous, and so is comparing your in laws who HAVE TO travel to your parents who live nearby. Of course it’s not the same. \n\nHowever…everyone’s feelings sound pretty valid. Yes you want the raise, so if it’s worth moving away from the grandparents, fine, do what’s best for your family. To ask your parents to pay for your raise is ridiculous though.", "ESH. \n\nYour parents suck for their emotional manipulation & OP sucks for lacking the balls to just say NO to his parents.\n\nIt’s clear that living blocks away, his umbilical cord was never cut & now that he’s moving away, his parents (my guess is mom in particular) is freaking out.\n\nIt’s called leaving the nest & OP should’ve done this years ago. \n\nAdding money to this, makes him an AH, but his parents are AH’s too.", "Dude , you're a fucking prick . Holy fuck the entitlement people have", "ESH - why even make that an option? Yes you do suck for literally telling your parents to pay you the difference. Like why even bring that up?\n\nYou are moving for your job, making your nuclear family’s lives better. Period.  A choice you and your spouse made. End of discussion, there is nothing left to discuss as the ONLY decision makers who’s opinions count (yours and your spouse) has been made. Your parents shouldn’t get any say. It is what it is, families change jobs and move. That’s life, like you said they can visit just like your in-laws do. \n\nYour parents are acting incredibly entitled. You are doing what is best for you and your children, and if they can’t see past their selfish WANTS, that makes them assholes. Especially acting like they are somehow more important than your in-laws. \n\nYou opening this *pay me the difference then* door unfortunate is indeed making you come off also as an asshole too. It’s insulting and unnecessary. Don’t even make that an option, take that off the table. \n\n“I’m sorry I made those comments about the $30K, that was unkind and wasn’t necessary, I wouldn’t feel comfortable accepting your money any way. The fact is spouse and I have made our decision, and it is final. I’m accepting this job and we are moving. It’s unfortunate we won’t be walking distance anymore but this is what is best for *our* family and *our* children. We hope you can eventually learn to understand and accept the decision *we* made for *our family*. It would be nice for you to visit when we move just like in-laws do.”", "I think making the offer was dumb, and came across as such\n\nBut grandparents rights are ridiculous and wildly misunderstood.  They can fly out or not.", "NAH. I get you need to take this opportunity. I’ve made the same decision. But I don’t blame your parents for being upset. They’re going to miss the regular contact they have now and I can tell you from experience that FaceTime and visits every few months isn’t the same.", "[deleted]", ">I told them that I would be willing to change my family's plans so long as they made up the difference between what I currently earn and my new job.\n\nESH  - Why did you go this stupid route? Of course it would be looked at by your parents as wanting money, even if you never intended that! All you had to do is explain to them you have to move as part of your career, and shut down their stupid \"grandparents rights \" talk.", "Thought about this for a bit. YTA. Not because you are taking a new job which will make life better for you, your other half and your kids but because of the way you approached things with your parents. \n\nInstead of trying to be smart/cheeky,  you should simply have told them flat out that they'll still get to see grand children when you visit home and that they'd be welcome to visit you at your new location plus they could video call as often as they like to speak to.the children.\n\nThe way you went about it almost guaranteed some sort of conflict between your parents over the move. \n\nIf it's possible, go back to them and tell them you have had time to think about how you spoke to them and explain that you never actually wanted them to pay you money to stay there and not progress your career so they can see kids more but rather that they should see this as a positive as you'll be able to better provide for your family etc and that you didn't know how to properly communicate that to them at the time.\n\nGood luck with the new job and the move.", "YTA for playing this game. Why engage in nonsense, it just makes the situation worse.", "NTA - But consider the cost of living adjustment in the new state, how much more it might be for housing and food. Also consider how much childcare would run you where the grandparents do it for free. It might be $30,000 a year extra cash but it could be that or more in extra expenses.", "I agree that you need to do what's best for your family. And your parents were wrong to expect you to stay put and not be close so they could see your kids as much as they're used to. But, you are wrong in asking them to come up with the difference in your salary from the job that you would be giving up just so they could see their grandkids. I think that was a bit much to use to address the situation. They should know that when people have children and a new job comes along and it's going to benefit their family and they have to move that's just part of life. When I was a little girl, my grandparents moved with their daughter who was my father's sister and her family and husband about 1500 miles away. I had been used to having all of my grandparents around growing up when we had holidays and birthdays and just in general get together for dinner kind of things. No one ever said anything about my grandparents having to pay my dad to come see as kids because they moved further away or anything like that. So it's definitely not something that your parents would need to do to see their grandkids. If you decide to stay, that would be on your own merit. Your parents will need to learn to either travel by car or plane however it is that they need to get there stay for a week to see the kids and then go home. As far as grandparents rights, I don't know a lot about it but grandparents can't cannot gain custody of the kids unless there's extenuating circumstances in the situation. I do know in some states are a grandparents rights where the grandparents can go to court and ask for visitation of their grandkids just so they do have the chance to see them.", "this question is an asshole\n\nwhat a moronic and contrived way to word something that is simply a fair argument with reasons from both side that need to be measured", "ESH. They reacted poorly, but... of COURSE they did! They live so close they can walk over to see you guys, and now you're going to be states away? You could have chosen empathy. You don't seem to have any.\n\nIn your calculations, you should add occasional  childcare, if your parents ever provide it. Also, the cost of living might be different. Are you buying a house with current interest rates vs. whatever you have now? Make sure your numbers are accurate, as that's what you care about.", "YTA - for demanding money to stick around.  \n\nBUUUUT you a N T A for wanting to move away to better your life. Grandparents rights are not a thing except in EXTREME EXTREME circumstances.  \n\nDo what is your right for you and your family. But drop the asking them to pay you money. Seems odd.", "You are the AH for telling them to make up the difference if they want you to stay, but you are NTA for getting a job with a better opportunity for your family.\n          \nThe extra $30,000 isn't just for this job. It will set the standard for your future job offers. I can understand their disappointment, but if they were truly good people who cared about their children and their grandchildren, they would be helping you with this transition instead of trying to make you miserable.", "NTA\n\nYou'll never give a reason or argument that will get your parents to say \"OP, you're right that your partner and children are your immediate family and making the choices that's best for your household is the right thing to do.\" They are coming from an emotional place. Their easy access to your family ends with this move. They feel like something they have a right to is being taken away. They feel hurt, angry, frustrated and powerless. No amount of JADE (justify, argue, defend, explain) from you will change their emotional response. It will only provide more argument fodder as they try to change your mind by invalidating and attacking any reason you give.\n\nIn establishing boundaries, you need to stop explaining and start maintaining. \"We are moving on (date).\" No further discussion or explanations. That's the decision you and your partner made. It is done.\n\nThe changes in how they can see and visit your family are natural consequences. Not good nor bad in themselves. Maybe video calls once a month. Maybe plan to fly in for a visit for such and such holiday, for a set amount of time, with accommodations clearly defined (with family or a hotel). Sometimes you go to them. Sometimes they come to you. These new practices will take time and effort to learn. Life is change.", "NTA - You are expecting them to pay you. You are making a point about the amount of money you lose out on just because they want to pitch a fit for you to stay. Also that it's a lot cheaper to come visit you than the money that you would be missing out on by staying. And exactly what is there argument for \"is it different\" that one set of grandparents have to pay for flights and stuff?", "NTA", "NTA you offer to compromise and they declined. It's a sad fact of life, but your parents generation created the economy that we are trying to live in so entitled grandparents can just reap what they've sown.", "NTA and your parents understand what a great opportunity this is, they just are really used to have their grandchildren, and children, close to them and they don't want to lose that so don't let them guilt trip you. You are not horrible for living your life and making decisions that benefits your family (husband and kids). Your parents while understandably upset had no business calling you names or blowing this up with your siblings, they eventually get over it and if they don't then probably is a good thing they won't be close by enough to influence your kids in a negative way.", "NTA\n\nTho your suggestion is. \n\nBut live your life. Their rights are to see them, at best, not at the location of their choosing. Funny they think it's anything other", ">They are saying that I'm a horrible son for moving their grandchildren away from them. That they have grandparents rights and all that.\n\nThey don't, unless they were actively primary child care at one point.\n\n> They said that is different. I don't think it is. \n\nBecause it isn't. Not in any legitimate way anyways. It's \"different\" in so far as it's them and not your In-laws who \"suffer\" for this change. They're happy to have things be balanced in their favour of course.\n\nNTA", "NTA, you have a family you need to provide for and an extra 30k per year is great, your parents are weird for thinking more of seeing their grandchild rather than supporting your success.", "NTA - My in-laws know it's not easy for us to come and see them. They offer to pay for flights and hotels in order to help us get to see them. They just want to love their grandchildren, not make it feel like a burden to do so. Love my in-laws, they are literally the best.", ">grandparents rights\n\nIf I were you, the moment this phrase came out of their mouths would be the last time they  ever saw the kids.\n\nNTA", "Why don’t you say you are moving to be 8 blocks away from the in laws, and that your parents will now have to be the ones to fly in to see them, as that’s only fair an all.\n\nNTA", "You're not asking them to pay to see their grandkids. They are welcome to visit after you move, from the sounds of it. Unfortunately, you've now given them something to use to say you're in the wrong. Rescind that offer and let them know they are welcome to visit as long as they can respect your rights and choices. NTA.", "NTA", "NTA. No explanation needed.", "Go no contact", "Nta", "Take the new job and ignore your parents’ complaints.", "NTA you do what is best for YOUR immediate family now. Your parents can travel. If they choose not to that is their problem.  Move quick and go low contact with them. The entitlement!!! Horrible parents.", "Taking out more than I should for taxes you should clear $400 a week or $1600 minimum. That's a car note, insurance and phone bill every month. Definitely NTA. That's a chunk of cash to give up just to be near grandparents.", "NTA - the parents are obvious AHs. Them claiming about \"grandparent's rights\" is laughable. Tell them to call the police that their rights are being violated lol.", ">That they have grandparents rights and all that.\r  \n\r\n\nhttps://www.reddit.com/r/raisedbynarcissists/", "NTA. \n\nYou just gave them a blunt wake-up call to how life works. You do not exist solely for THEIR benefit and convenience. \n\nScrew the noise. Go get that money. \n\nOh, and tell them to plan ahead before just showing up outta nowhere and expecting to be lodged for free. Because that's next.", "NTA", "NTA and your parents are being selfish because they don’t care what’s best for you! Do what’s right and best for your family and remember while it’s nice to see them and live close you certainly don’t OWE them that. Good luck with the new job and remember your parents are probably really sad and not expressing it well! You will never regret putting your family first!", "NTA\n\n\"I'm responsible for doing the best I can for my kids, and that is me taking this new job. I'm sorry that you don't feel your grandkids are important enough to make the effort to see them if they're further away than they are now. I'm sure they'll miss you.\"\n\nThen close the conversation. Guilt trips not allowed.", "NTA. In my experience, anyone who screams “ I/We have grandparents right!” Deserves to be put on low contact. Not only that but the fact your in laws live in a whole ass other state vs. your parent STILL being in the same proximity and your parents are throwing a hissy fit speaks VOLUMES", "I would highly recommend not listening to your parents. \n\nYour parents obviously do not care about you, or your children.  If they did care, they would be positively ecstatic about you getting such a large pay rise.  This will help you, your partner, and your children. This will help for your retirement, your children’s college funds, potential medical bills and much more.\n\nYour parents are demonstrating their incredible selfishness by their unacceptable demands.", "Nta", "YTA, this is one of those stories where everyones responding to how the grandparents act, but the post was asking about OP asking them for payment. This isn't how you should have responded", "NTA tell them they can move too if they really want to lol", "NTA. You are doing what is best to care for your family and they are upset that they might have to make more of an effort for once.", "NTA.  Your job would benefit your family immensely.  If your parents don’t understand that, they are incredibly selfish and thinking only of themselves. If they feel that passionately about seeing their grandchildren, they can sell their home, pack up everything and move closer to where you will be going.", "ESH.  I am not sure why you even entertain any of this nonsense unless you enjoy drama.  A simple, “we are moving, enjoy the kids while you can and you can come visit once we get settled if you want, just make sure to coordinate with us before booking travel.”  If anyone complains, “if I hear any more complaints, you invitation to visit will be revoked and that means ANY complaints by anyone so don’t have others to contact us as that will be a ding against you.”", "For the vast majority of my childhood I never lived closer than about 9000 miles from my grandparents. It took about 24 hrs of air travel and thousands of dollars to visit. What's the big deal?", "Even bringing up \"grandparent's rights\" would have been enough for me to consider going NC. They are almost never brought up in a manner that isn't incredibly selfish.", "I've been hearing this term used more and more on Reddit.", "The obvious solution to the grandparent's convenience issue.", "> It's not the 1950's anymore and we don't have grandparents/parents/kids all living in the same household or even the same town anymore. With the modern economy, the \"nuclear family\" is now the norm and not the exception.\n\nThis doesn't really have any bearing on OP's asshole status, but adults in the US still tend to live pretty close to their parents. See [here](https://www.nytimes.com/interactive/2015/12/24/upshot/24up-family.html), for example. The median adult lives 18 miles from their mother, and \"only 20 percent live more than a couple of hours’ drive from their parents.\"", "Imagine asking your parents to cover your raise just to stay home.  You dont see that as ridiculous? Jesus f christ", "Sounds more like the am I in a cult checklist, but it checks out.", "2.5 Become unpaid, unappreciated, caregiver to entitled aging parents.", "😳😨 it boggles my mind too 😲", "Did those people need their children to help them with daily tasks? That might be one explanation.", "They will probably expect everyone else to fly in to see them and act all hurt and put out when they rarely get to see their kids/grandkids.", "I didn't get the impression that OP considered turning down the job offer at all. Just as he shouldn't.", "It sounds like they think they have the right to dictate where OP lives.", "They're not the AH for threatening grandparents' rights to take her kids from her?", "As soon as they decided to threaten OP, that was the end of any idea that they deserve empathy.  Fuck them.  They should never see the kids unsupervised again.", "Do the grandparents do any free childcare though? I don't see anything in the OP to suggest that's the case.", "HA! You did the thing where you called someone out with advice that would be better suited for yourself! Classic!!!", "that was the whole point.", "\n\n>for demanding money to stick around.\n\nobviously op was not being serious.", "the grandparents are the ones attempting to extort op with their bullshit claim of 'grandparents rights'", "The grandparents can still visit their grandchildren. They'll only live a bit farther away... they don't seem to be willing to make more effort to see them.", "People have really weird ideas when it comes to custody over children. From grandparents rights to divorce, people think just because they *really* want custody, they can get it or its somehow easy to terminate your parental rights.\n\nSaw someone comment one time about the bad deal men get in divorce court and how his buddy went for full custody but didn't get it. He was told unless there was abuse or hard drug use, there was no shot... like that was a bad thing.\n\nNo shit you won't keep one parent away from the kids without things like abuse and hard drug use. What do they think the bar is to take someone's kids away?", "[removed]", "[removed]", "Are you a family lawyer, or do you practice in another area? I've never seen a case argued in Georgia, but whenever I see comments like yours, I caution people not to listen to it. I'm going to say it again, even though you're a lawyer. \n\n***\n\nBe very careful telling people not to worry about GPR. Family courts have guidelines, not rules. And judges have a lot of power to make decisions.\n\nI have a friend who has two children, one by a man who is not in her or her children's lives and one by her husband. According to the laws of our state, technically the parents of her elder child's father have the right to take her to court for GPR. They have never done so.\n\nThe woman who did take her to court for GPR was her narcissistic mother. According to the laws of our state, since it was the grandmother's own daughter refusing to facilitate contact with the children, and especially since the daughter was married to the father of her younger child, who also agreed to cut the grandmother off, there should not have been a case for GPR.\n\nBut the judge awarded it.\n\nHer mother got visitation every other weekend, all major holidays (Christmas, Easter, and Thanksgiving) and the entire week in which her birthday fell. Can you imagine, even if GPR were justified, a judge declaring that the parents cannot celebrate Christmas with their own children, and that the grandmother gets it instead?\n\nThis went on for over two years, and it cost my friend $40,000 in legal fees to get it stopped. When it was over, it came out that grandma was gathering information and planting ideas in the children's heads that would support CPS removing the children from the home. She wanted full custody.\n\nSo unless the laws of your state specifically say that contact with relatives is at the sole discretion of the parents, don't rely on your interpretation of the law. Because you will not be  writing the order.", "[removed]", "[removed]", "I grew up about equidistant from my two sets of grandparents, about 600 miles in each direction. I saw one set every summer and one set every Christmas, plus whenever they came to visit, or a few times they took me on trips. I have tons of fond memories of visiting them and spending time with them, to the point where even as a young adult, I would spend some of my vacation time going to visit them just because I enjoyed their company. \n\nWhile it’s awesome to be next door to your grandkids/grandparents, it’s absolutely not necessary to have a wonderful relationship with them.", "My one set of grandparents was concerned that they could only see us a couple times a year, because we were a 14 hour drive apart. They decided to move closer to us to participate in caregiving for us grandkids. \n\nJust saying, the distance might be a big deal for these grandparents too, but it's not on OP to solve it.", "Yup! My mom's whole family live(d) across the pond (the ocean) from us. Grandparents would visit every 2 years until they got too old and it was too expensive to travel. I've never had the full \"extended family all in one area\" experience and honestly find it strange because... do people just never leave their hometown???", "Which boggles me a bit - I get what OP meant right from the get go of their post.", "😅", "People are just selfish.", "I also didn't get such impression, just tried to make a rhetorical question. Sorry if it's unclear, maybe it's because of the sentence length?", "I think they’re going to say lots of stupid stuff. They’re going to miss their family & they don’t want them to go.\n\neta — I offered to move in to our oldest son’s dorm when he left for college. He was our first to go.\n\neta more — ngl think I threatened to hurt people when our oldest daughter went to college. When the younger 2 left I was pretty chill by then ... lol", "The writing made it had to clear, but it was clear enough.  If that's how your parents act, they'll have no family nearby soon.", "I have no grandchildren, but if I did, I’d never use them for extortion.", "Indeed. And since your in-laws make it work, any attempt by your parents to assert \"grandparents rights\" (of which they have rather the wrong idea) would get laughed out of court. You're not denying them access to the kids - you're just bringing it on a par with their other grandparents. Congrats on the job and have a safe move! You're doing the right thing for your family and your children's future.", "that's the big deal they are going to be inconvenienced and don't want to be.", "[removed]", "[removed]", "I think people hear the outlier stories of what some crazy judge or CPS worker did and assume those stories are typical rather than rare.", "Yeah, men like to take statistics about how often women vs men end up with full/majority custody and pretend it's a misandry thing. When, really, the main reason that women get more custody than men is that men largely don't ask for it.", "Being Black or Indigenous is the bar, our kids get taken away all the time.", "Bot comment, original [here](https://reddit.com/r/AmItheAsshole/s/NQfUmL91Me).", "Don’t entertain Tychabrahe. Their talking out of their derrière.", "I practice family law (among other things). And am licensed in multiple states. Regarding your friend’s situation, were GPR granted for BOTH children or only the older child? It is confusing which it was. Because if it was the older child only, then that is completely consistent with what I said. That child’s father isn’t in her life, therefore GPR come into play. \n\nGPR are governed by statutes, which courts MUST follow. And which state were they in?", "That’s not normal behavior to say that you’re going to hurt people. My only child moved to South Dakota 3 years ago and I’ve been able to not say insane things.", "Honestly, I think once they threatened to take her kids away from her, all bets are off. They should be grateful if she even allows them to see her children anymore.", "I’m not sure you’re in a position to determine what is a normal reaction based on the behavior you describe in that comment. I’m sure you’ve normalized it with your family as a funny story but it really isn’t.", "u/seasonedmind\n\nYou literally have no idea what you are talking about. When 2 parents are alive and together. no grandparents can claim rights.", "lol. the grandparents have no legal grounds to stand on. grandparents right only exist if the parents in question are attempting to ice the grandparents out completely. there is nothing stopping them from visiting their grandchildren.  and no judge on earth would tell parents they have to turn down a better paying job just so the grandparents can visit whenever they want", "you need to learn to read. op tried that and they still complained", "[removed]", "The craziest part to me about that kind of thing are the people that go through a divorce or custody battle and come out still not knowing how any of it works.", "I can attest to that. From personal experience I don't want to go into details but some CPS workers are just not there for the benefit of the children", "That's very different from custody after divorce though, which was the topic.", "Well the disparity in fatherlessness between the Black and let's say Asian community (to avoid the white privilege comments) kind of explains that.", "The older child's father isn't in her life, but it was her **maternal** grandmother who got GPR. The visitation was awarded for both children, despite the younger child's father being a) married to the child's mother, b) present in the home, and c) in agreement with the mother (petitioner's daughter) that the petitioner should not be allowed contact with the children.\n\nThis is in Illinois.", "I also said my kids were so cute I wanted to eat them ....", "You need to brush up on law.", "You think Black and Indigenous people don’t have kids with white people then have custody battles? That is one of the ways it happens. White family is more likely to look good on paper (credit scores etc) so the kid gets placed there even if they are abusers.", "https://www.ilga.gov/legislation/ilcs/documents/075000050K601.2.htm\n\n> b) A proceeding for allocation of parental responsibilities with respect to a child is commenced in the court: \n> 5) when one of the parents is deceased, by a grandparent who is a parent or step-parent of a deceased parent, by filing a petition, if one or more of the following existed at the time of the parent's death:\n            > (A) the surviving parent had been absent from the marital abode for more than one month without the spouse knowing his or her whereabouts;\n            > (B) the surviving parent was in State or federal custody; or\n            > (C) the surviving parent had: (i) received supervision for or been convicted of any violation of Section 11-1.20, 11-1.30, 11-1.40, 11-1.50, 11-1.60, 11-1.70, 12C-5, 12C-10, 12C-35, 12C-40, 12C-45, 18-6, 19-6, or Article 12 of the Criminal Code of 1961 or the Criminal Code of 2012 directed towards the deceased parent or the child; or (ii) received supervision or been convicted of violating an order of protection entered under Section 217, 218, or 219 of the Illinois Domestic Violence Act of 1986 for the protection of the deceased parent or the child.\n\nNot sure why it would take 4 years and $40K to get that judge reversed, because based on the language in the statute, the judge violated Illinois law.", "I know what the law says. Do you? Please provide your evidence that grandparents have infallible rights over their grandkids.\n\n\nHey u/Exotic-mango-2768\n\nYou're a lawyer, Can you explain to this guy he doesn't know anything about grandparents rights", "Fair point.", "I agree somewhat.  OP has every right to move for the job and probably should.  Travel arrangements can solve the visitation issue.  But, suggesting she’d only stay if the grandparents match her pay, is veiled extortion.  Pay me or else granny!  What a piece of work!", "Aren't mom and dad able to sell their home and move to the same new town?\n\nNTA \n\nTime to cut the apron strings from your end.", "The moment they start throwing out \"grandparent rights\" my give a f would be gone.", "There are nicer ways you could of put it but you are not out of line. My mother is the same way with her grandkids. I would just remind you that to grandparents the grandkids are everything to them. Easily more than they loved their own kids. So try to be sensitive.", "Why would you even make that offer?  You have all the rights to move where ever you and your family want for the betterment of you family. As soon as you brought money into this, you started looking like the asshole.  I say looking because you aren’t but would be perceived as one.\n\nWhy not “Hey mom. Hey dad.  We are moving to X. I know this means we will see less of each other but this is the next step in Our lives and help is secure a better future for our kids. You are always welcome in our home and hope you can visit often.”", "NTA. You didn't seriously ask for money, you merely pointed out the consequences of what they were asking through reductio ad absurdum.", "I’ve seen several people ruin their Financial Future by choosing “ Family” over a promotion that required a long distance move.\nIn my experience it’s been one spouse refusing to leave “ Mommy and Dad “. \nI hope your spouse has your back and that you go through with your plan .It’s a tough World right now and $30,000 is serious money .You are NTA.", "YTA, maybe we need more information but that’s a shitty thing to say to your parents.  Try and de escalate the situation, you gave a punch right in the face.", "ESH", "YTA\n\nYour kids need relationships with family. Money is just a number.", "Yes.\nYou're the asshole.", "NTA", "NTA, grandparents rights, sure tell them to take you to court to enforce that. \n\nI totally get where you are coming from.  Where you live isn't there choice. \n\nWe picked up and moved away a few years ago, so I know the family pressure.\n\nIt's not about the money, it's about doing what's best for your nuclear family.", "NTA. \n\nMy brother has kids (I don't). When my brother found a house that was better for his family (bigger, better school district) he moved. My parents wanted to be close to the grandkids. So they sold their house they'd been in for almost 35 years and found a house a few doors down from my brother.", "NTA....", "NTA. I understand what you were trying to get across to your parents.  You were not charging them to see their grandchildren.   In the end, they can't stop you from moving using the flag of \"grandparents rights\".  They have to get over it or move too.", "NTA.  If someone threatened legal action against my family, I would not be near as civil as you are, that is a hard line for me.  Your parents are selfish.  There actions are showing that in many ways.", "NTA you’re not asking them for money to “see your kids” since they are welcome to visit. You’re asking them for money to change your relocation plans", "You have to live your life.  Grown kids move away sometimes and of course your parents will miss them, but this is not their call.  They will have to rely on FaceTime or Zoom called and will have to travel to see the grandkids, or you guys go there.  NTA.", "The phrasing about making up the difference in salary was a bit unfortunate, but NTA. The grandparents are being dramatic", "NTA If your parents had their way, by deduction your sibling would never be allowed to move away because children *might* be in the future someday. Geeze.", "Yeah, you are a terrible parent for wanting to take a job that increases your family's income! How dare you try and improve your family life! /s\n\nNTA, of course!\n\nTake the job. Your parents will just have to adjust their plans and get off their asses to visit you and the kids in future.", "NTA - I get it, you're just trying to show them what YOU will be giving up by staying put.  They need to understand that you need to take this job to improve their grandchildren's lives and it's not to hurt them.   THEY can travel to visit you a couple times a year.  It is NOT required for grandparents to be two blocks away from the grandchildren to be a part of their life.  Heck, thanks to technology today, they can even facetime once a week if they're that needy!", "My in-laws keep passive aggressively nudging us to move close to where they live; and condemn other family members that recently moved away, because \"how could family not be the most important thing in the world. What's wrong with you\". I get the sentiment to want everyone to be close, but damn go find a life. \n\n**NTA**. People need to learn their adult children's lives don't revolve around them. You didn't raise and educate your children so they stay leashed to your belt. Let your kids live their lives.", "NTA but I think they're just very upset at losing the future they envisioned, where they get to watch the kids grow up and have a close bond with them.\n\nOf course you must do what's right for your family but it couldn't hurt to be gentle.", "NTA.  I have been in your shoes and your parents' shoes.  I moved away from home with my kids, and my daughter moved to another state with my grandson.\n\nTBH, things are so different now from when my kids were younger - we kept in touch through letters and once a week, half hour phone calls because overseas calls were so expensive.  \n\nMaybe you can help them brainstorm ways to stay in touch.  A friend of mine had a set zoom schedule with her grandsons when she read stories to them each night.  Ask them about writing letters, even short notes - they can include a few stickers, a stick of gum, a picture they saw that they thought one of the kids would like.  The kids can color pictures for them and put them in the mail.  \n\nI understand their hurt and their sense of loss - but in no way should that ever stand in the way of you living your best life.", "NTA. Your parents are throwing a little bit of a tantrum because they love their grandchildren and don't want to miss time with them, but that doesn't make it okay for them to try and overrule the decision that is best for your family. And depending on the area you're moving to, an additional $30K per year may well be worth it.\n\nGive them a little time and assure them that you're not trying to take them away but that you're making this move for the good of their grandchildren's future. I assume that you're open to allowing your parents to visit few times a year, so they will get used to the new normal.", "NTA.  Wow.  You would think they would be happy for you.", "Nta", "As someone who has had the whole Grandparents Rights thing threatened towards them before, anyone who tries to bully people with it are the assholes.", "Wait till they try to get a lawyer and find out grandparents rights are usually 2 hours once a month! Lol\n\nSeriously though you didn't tell him they couldn't see the kids you're just moving so they'll have to go somewhere else to see the kids. This is a childish fight and it started by parents who are trying to control and manipulate you so I hope you will get as far away as possible. NTA", "NTA. Why don't *they* move to your new location? Oh, right: because that would be an inconvenience to them.", "Most grandparents end up moving themselves closer to the grandchildren. They have no right to guilt you into staying close and passing an opportunity to earn more money.  It’s you and your family’s life, not theirs and they have no right to dictate to you how to live it.", "NTA, I'm shocked that assholes can also be stupid", "Sort of, you should just offer to Let Them come see you instead. That way you're not uprooting the kids routine.\n\nThen it's not you being the a44, it's you giving them the opportunity to come to your place!", "I’m wishy washy, you’re definitely NTA for wanting to make an additional $30k. Telling them to pay you the difference makes YTA. \n\nThink of it like this, your wife and kids are YOUR family. Your parents haze absolutely ZERO say in any of your family decisions.", "NTA", "NTA. They don't have grandparents \"rights,\" and it's really selfish of them to want to deprive your kids of the benefits of that significantly higher income because they (grandparents) don't want to go to the effort of traveling to see them.", "Your parents have just shown you who they really are. NTA and please move to help make you and your family's life better.", "Nta why do your parents think they don't have to make an effort but it's OK for the other grandparents? \n\nYou can move wherever you want, they have no rights that can stop you.", "Nta\n\n\nAre they retired? If so they can move. Meanwhile people who still need to work need to do what they need to do so they too can retire one day.", "NTA.  They have rights. The right to fly out to wherever you are to see your kids. That's about it.   \nAn extra 30k a year to make yours and your family's lives better, and you're the selfish one? Nah. Just nah.", "NTA if you can get a home with a grandparents cottage or where you can attach a trailer/small mobile home. That way all the grandparents can visit for as long as they want.", "NTA but you might not be thinking about this in the right way. It's not just the $30k that you would be losing out on by not taking the new job. Each job you get that levels up your pay and experience means you can leverage those into better jobs and more money. So you're not giving up $30k - you're giving up a whole lot more than that. You're giving up future earnings and opportunities that would arise from the taking this new job. \n\nStill NTA of course, but be wary of if your parents take you up on this (which they probably won't but you never know). You might need to adjust the terms.", "NTA.", "Grandparents rights?  Lol! And just what do they think they have the right to there?  The right to force you not to move further away?   NTA, since you were just trying to make a point when you told them to make  up the difference in salary you would lose if you stayed and not actually expecting them to fork it up.  I went through something similar with my mother when I decided to move my son and I to a different state for a new job.  She was 100% not happy, said a lot of things to try and make me feel guilty for \"leaving\" her and taking away her grandchild and really tried to talk me out of it.  I think she would have offered me money to stay if she thought it would work.  Parents need to understand and respect that their adult children are going to make their own decisions as they think is best for their lives.  To try and stop your children from doing what they think is best for your own wants and needs is selfish and immature.", "NTA.\n\nMost parents are eager to see their kids advance and succeed, how sad that yours are only thinking of themselves. Tell them that they are free to visit frequently but you can not (and will not) allow them to hold you back.", "So they would rather your kids not have parents who can afford to buy them things and take them places and pay for their schooling just so they can see them without making any effort to travel to them NTA", "NTA and you don't need to explain to your parents.  You are adults.  They successfully did their job to raise you to being happy, healthy productive adults.  As an adult, you get to decide your future, not them.  \n\nTell them their welcome to visit and see their grandchildren.  You'll help them find a top-notch hotel to stay in so they can be pampered while traveling.", "This is funny.\n\nNTA", "NTA.\n\nMy ex-MIL is disabled and lives interstate. Once every year and a half or so, she organises to fly in to hangout with her grandkid for a long weekend, bringing her full time carer.\nIn between times she's always writing snail mail and sending little gifts in the post. This lady's got less than no money, because of her medical expenses, but nothing is too much effort to see my kid. She saves and penny pinches all year, and I'm so grateful.\n\nAnd when I'm financially able we'll visit her too, I just can't right now.\n\nI'm sorry your parents are not so generous, and even then I don't think generous is the word I'm looking for.", "Go ahead and make the move,  but what about a 2 week visit to grandma and grandpa each summer at each one of their homes? You get a month of kid free living (it doesn't have to be back to back for the littles) and the grandparents get some quality time. NTA", "Phrasing probably wasn't the best. Nta for choosing to move but maybe your phrasing could have been better.", "NTA\n\nAnd you should tell them to consult a lawyer about their grandparents' right. I think it would be eye opening to them.", "NTA! My mother and father were extremely busy with their lives at the time I was born. My mother decided to ditch me especially on my 1st birthday. She literally said to my grandmother that she had a hair appointment and wouldn't be able to make it. The only one that did really care was my father. My father really cherished me and my mother refuses to do anything with me. So my grandparents literally had no choice but to help us out and literally raised my brother and I because my dad was busy dealing with night school and a full-time job. My mother on the other hand pretty much do whatever the f*k she wanted and never cared about my brother and I. I mean seriously having a child's first birthday is a very important milestone and my father wouldn't miss that for the world.", "NTA i like how you showed them how ridiculous they are being cause im sorry but being able to walk to your house and spend time with their grandchildren does not trump whats best for your family which is your new job and the extra income. Just like your inlaws fly in to visit they can do that as well.", "NTA your parents are just sad.  Watching our children grow up and be their own adult is bittersweet.  We are so proud of you but our heart yearns for those days we were all under one roof. They settled in, 8 blocks away, and thought it wouldn’t end.  Their hearts were full.  Then this. They are panicked.  As they get older can they travel? Will you come back often? How much they will miss.  They are not expressing it right.  Be patient.  It’s hard to watch our kids move away. Good luck in your new job!", "I’d say you need to move where ever is the best situation for you and your family. If they want to see your children then it’s on them for as long as they can travel. If they are older and cannot easily travel, then yes they could pay to fly your children out to them. There’s things like FaceTime and all that in between. Yeah, it’s not the same but at least there’s that. Imagine if there wasn’t? I’m 42 so I know a time when there wasn’t. \n\nAlso, maybe your parents could relocate or maybe even send your children to spend a few weeks there out of the summer break from school.", "Nah you're absolutely right.", "NTA.  Your parents are being ridiculous.  Take the job and move.  They can make an effort to visit or not.", "NTA. Live your life. They can visit once in a while.", "ESH. Your parents, for giving you a hard time about a perfectly understandable situation people encounter in modern life. You, for being facetious and insensitive to their pain at the adjustment.", "Yes.\n\nYou can do everything perfectly and still be the asshole. \n\nIt’s called life.", "NTA, that's a lot o additional money that could go a loooong way towards providing for you and your children. It's unfair of them to ask you to sacrifice an opportunity like that when they don't even seem willing to put in the little extra effort it would take to remain in touch after you move.", "I don’t understand when parents don’t support their children success!", "NTA. Do what is best for your family.\n\nIf you accept money from them, you will regret it.", "NTA. And at the next mention of grandparent's rights, I'd tell them to stop mentioning it unless they want all communications with you to be through a lawyer.", "Your parents are sad about it but are handing it so wrong. \n\nTell them that you made your decision to move and they’ll have to deal with it. And stick with it. No more discussions about it and if they bring it up you tell them to kno ck it off or you’re leaving/hanging up. \n\nIt’s too bad they’re not congratulating you on your promotion but do it for your family. Who knows, maybe your  other sibs will have a kid and they move to be close to them, then what will you and your family be left with?", "ESH\n\nSeriously?! What grandparents want to spend their retirement taking their kids to court for what they think are “grandparent’s rights” to keep them from moving?! And who in the hell thinks that they can use a decision of where to work, that they have the complete free will to make and live with the consequences as a grown ass adult with children, to profit off of their parents?! Y’all are insane. \n\nSupport your kids. \n\nMake a decision and live with the rewards AND consequences of said decision.", "NTA.  And “grandparents rights” only ever come into play when the parents of the grandchildren are either separated or divorced & the primary custodial parent is preventing the grandparents from having any access to the children (which isn’t at all the case here).  And even then, the grandparents typically have to prove that they were a primary caregiver for the grandchildren in question.  Any lawyer worth his salt will educate them on the fantasy they have on that real quick.", "NTA.\n\nIn this situation, I'd acknowledge their understandable frustration at losing grandparent time, and then I'd just repeat that this still doesn't justify the loss in income. A grandparent might not care so much about that, but you're still looking at many years of supporting your kids financially. That extra money's extra opportunity for yourself and them.\n\nThere's no need to bog yourself down in further arguments beyond that. Just look at their behaviour as venting. Maybe, once they've cooled off a bit, you can get them to redirect some of that energy into hanging out with the kids more before the move.", "NTA. Your parents just gave you the best reason to move. They do not have rights over your children. They should be grateful for all the time they had close to their children and grandchildren. They also need to get hobbies and a life. Congratulations on your new job and move.", "Actually it is a thing in NY. My son’s friend was forced to see his grandfather every 2 weeks because he sued the parents.", "Especially since the grandparents can move after retirement without risking anyone’s earning potential.", "NTA.  And “grandparents rights” only ever come into play when the parents of the grandchildren are either separated or divorced & the primary custodial parent is preventing the grandparents from having any access to the children (which isn’t at all the case here).  And even then, the grandparents typically have to prove that they were a primary caregiver for the grandchildren in question.  Any lawyer worth his salt will educate them on the fantasy they have on that real quick.", "[removed]", "[removed]", "[removed]", "That is horrible.  We moved 4 hours away and some family members acted like we moved to the moon. But we reminded these family members that they never saw us anyway so what did it matter where we were.", "As a child I prefer what Ray Barone called the sauce zone. \n\nToo far away to come over uninvited with sauce, but close enough that they don’t have to stay over night.", "Hard agree on this.  When we moved there was a family meeting where my brother in law said...we get a say not a vote.  My response was, no you do not get a say.  Yes you do not get a vote.", "I'm sure they did the first time. But after a certain amount of annoying pushing, they did this to make a point.", "How is the comparison to the in-laws ridiculous? It's a one-to-one comparison.", "Money is the house you live in, the food you eat, the activities your children get to participate in, their college education, helping them to buy a house etc. Family is important but so is not starving", "Because OP is moving away", "Thats not necessarily true. My grandsons other grandparents have court ordered visitation. I have order for my granddaughter. But we just went back to order a week ago & now have 50% custody/shared custody. In Ohio, where they do not legally have grandparents rights. (i have an arrangement for grandson but not court ordered). But in both cases, we had to prove we were a big part of the kids lives & that they benefit from having us around.", "Agree completely!!", "She's not actually asking them for the money.   She's pointing out their hypocrisy.   They expect her to give up 30K to live near family, yet they are unwilling to do the same.", "Because they live out of state.", "I missed that part. Do you mean that they said they had 'grandparent rights?'\n\nI don't think that's a legal thing. If not, or even if so, then they are complete arses themselves. But still, at the end of the day, I see two (jerkface) people that are grieving over losing their grandkids. So I would counsel cutting them some slack. This will all pass.", "The commenter’s buddy didn’t really want full custody, he just wanted no child support order.", "My grandparents sued for custody after my father died and had proof of hard drug use with my mom and still didn’t get it. It’s extremely hard to remove children from the parents even with some actual cause, in my experience anyway", "Seriously. He’s not getting FULL custody? Cry me a river, buddy, take your joint custody with a split time schedule and deal with it.", "But why do the mothers automatically get primary custody and fathers have to fight just to see their kids.  \n\nI've seen plenty of cases where the mothers are abusive and the fathers are awesome yet the kids go to their mothers and the fathers have to have supervised visitations and prove they are \"worthy\" of seeing their kids, meanwhile the kids are being mentally abused and neglected because the courts think kids need their mothers more than their fathers.  The fathers did nothing to warrant them being supervised except for being male and the courts decided they were not fit because of that.\n\nEven if there is no abuse from the mother, why are mothers the default to getting the kids, rather than deciding which place is better for the kid?  Who has the better situation.  Also just because one is more financially stable doesn't mean it's the better place because that parent may never be around, always on a business trip, so make a decision based on what's best for the kid and not, is the mother around, she should have the kids because ***MOTHER.***\n\nJust because someone is a mother, doesn't make them the better choice for getting the kids.  I'm not even talking full custody, just primary.", "That was in response to their telling her she should not leave the area. They want her to forego 30K extra a year, so she said she would do so if they made up for it. She is not expecting or wanting them to do it, but it would be the cost of her choosing to NOT take the job. Completely reasonable.", "That was in response to their telling her she should not leave the area. They want her to forego 30K extra a year, so she said she would do so if they made up for it. She is not expecting or wanting them to do it, but it would be the cost of her choosing to NOT take the job. Completely reasonable.", "It must not be clear from my post, but my statement is based on Georgia law, which is one of the strongest grandparent rights states in the country.", "I grew up in RI and the vast majority of people I grew up with have never moved away or traveled even.I left in 91 and moved across the country to CA with 2 suitcases and my cat due to family abuse. In RI traveling is an an all day  difficult excursion even an hour away. I dont understand it at all.", "Their parents said they are \"a horrible son\"....so I believe they're male.", "Some people also twist and minimise the truth to demonise someone else and make them the victim.", "I think people just hear bullshit manosphere misogyny second and third hand and believe everything they read", "And in the US men do statistically have less custody. It's because they *ask* for less custody (on average), not because courts refuse to grant it to them, but there's true-but-misleading statistics that it's easy to sell to people.", "And when you tell them that the majority of couples don’t have a huge custody battle and work things out more-or-less amicably and that many fathers are happy to let their ex-wives take primary custody…they don’t believe you. Even if you’re a family law attorney.", "Also, in cisgendered heterosexual family it's still the mother who is managing the kids' day-to-day lives while married, so for stability it makes more sense for the kids to be primarily with the mother. Yes, I know there are exceptions.", "My father asked for full custody of me. The judge went, \"You live on your mother's couch. No.\"\n\nThat's the audacity men have tbh.", "My mom went after custody for years after my brother died. Not right away, but when my sil really started getting bad. She ended up even getting custody of my niece who was my brother’s stepdaughter (not her blood so sil always was like good luck) who was thankfully old enough to speak for herself and had been for awhile, but refused to leave her brother behind. I think the fact she didn’t show most of the time to court had a big factor and well lots of other fucked up things. \n\nMy mom tried a few times when my brother was alive and he admitted in court he was a heroin addict and they still didn’t give my mom custody bc their apartment looked alright and there was food (his wife was more together then). \n\nThey are such good kids and safe now. It can be worth it to try and keep trying. Expensive though", "Not being Christian in some areas too.", "Him, not her.  He referred to himself as 'their son'.", "You should have hung up. They're going to forget everything you said besides \"greedy kid wanted payment\"", "See this the frustrating shit right here though. The audacity that man has*. Why do all men get lumped in with bad apples. Generalizing entire races or sexes blows why the fuck do we keep doing it?", "Yeah, my grandparents tried over and over again until I essentially aged out. Once I hit 14/15, I realized I wouldn’t leave my brothers alone with my mom even when she’s doing well because it felt wrong. Different dads so my brothers would have been on their own, and my word was important to the judge. Now as an adult, I see the situation differently obviously and actually took custody of my youngest brother myself at 20. My mother always passed the checks though, clean place and hot running water, food etc. of course they had no idea what was going down", "Or straight. It’s pretty much a “Christian values” thing.", "It doesn't matter how clearly you express yourself, there's always *somebody* who reads half of it or doesn't get it, or simply just wants to start an argument. Its not your fault they cant/won't read.", "Why discuss your family's decisions at all? Yes, they're sad and all, but you're making a decision that's best for your family. This weird money thing has just derailed that simple fact into some kind of grandparent-blackmail scenario that didn't exist until you literally floated it at them.", "Hashtag Not All Men", "I've read the law. I also know what actually happened. This woman is one of my dearest friends, and I was one of the people who talked to the guardian ad litem for the second custody hearing.", "Wow so you wouldn't go to your parents who live close by and say \"hey mum and dad, I got the list great new job that is going to make us more money and won't affect hubby's career but we have to move to (city).\" What would I ou do, just disappear and not tell them until they called from your old  front door asking when you will be home. \n\nOP was having a conversation with their parents told them great news, parents got upset and started chucking a tantrum about how it's not fair they will have to put in effort to see their grandkids. OP eventually said \"fine then, you want me to pass up this great opportunity for my family to make you happy, then you need to make up the difference in money your wanting me to turn down for your convenience.\"", "?", "I'm assuming that's sarcasm for calling you out on sexism but I mean why? It's OK to call out racism or sexism towards women but for some reason men get all this hate and you can't say shit? I don't get it. Obviously everyone gets hate but men arent allowed to fight back. People should be allowed to defend against hate no matter what. This ain't twitter. You said something shitty and I'm just saying it was shitty", "Lol, y'all projecting like crazy.\n\nOf course I'd share the good beds with my parents, with whom theoretical-I have a good relationship. What I wouldn't do is float this hare-brained \"ok fine pay me x tens of thousands of dollars and I won't move\" idea, because that turns the narrative from me doing what's best for my family and maybe for my own career progression, to some kind of twisted pay-to-play grandkid access scheme. Which is now getting OP attacked by the rest of the family. \n\nWhy even make that \"offer\"? Tell me, why? What could ever be gained by verbalizing it, in any reasonable scenario?", "😂", "The parents were asking OP to give up tens of thousands for them, how is that any different to OP getting frustrated and telling them to pay the difference in pay check.", "The parents were throwing a tantrum because something they took for granted was being removed. That's not an invitation to start negotiating ongoing access to your children for cash, ffs, that's the time you tell them \"our mind is made up, we move on x date.\"", "I’m gonna go with ESH. Yes it is stupid that they would want you to give up a promotion, but I think the way you reacted is also sucky. \n\nI would loooove if my parents loved my kids so much that they couldn’t stand to be apart from them. If my parents had such a relationship with my kids I would value it and consider it worth *something,* like maybe not 30k, but the babysitting and being close with at least one set of grandparents as they grow up is SOMETHING, maybe even priceless. Be the bigger person and recognize their reaction is because they are hurt and scared about losing their grandkids. You’ll miss them when they’re gone.", "YTA - who would even come up with a plan to make up the difference? Unless they are super wealthy it makes zero sense. Plus, which adult wants to be “owned” by their parents? For $30k annually they can take some sweet vacations.", "Umm yes you are for asking them to pay u money…lol it sounds like your trying to make money off your kids…smh…your parents sound entitled just by saying the have  rights lol…it doesn’t work like that…and this is gonna sound messed up but at the end of the day they r your kids and ur parents can’t hold you back just cuz of the kids if they love them as they say they do they can always travel or just pay to have them visit…if they can’t make that effort than u can’t expect them to pay you…I’m not sure if that makes sense", "This is absurd.... YTA absolutely.  It's baffling that you or anyone else can't see that.   Demanding money from your parents or in laws, even if you claim you don't really want it, is gross.  \n\nExplain You're doing what you have to do for your family, appologize, yadyada. \n\nTelling them you'd change your plans if they pay you is asshole behavior.", "Nta, but your parents seem very entitled", "NTA\n\nGrandparents rights? Riiiight. Let’s see them preach that when they have full rights and need to spend all their money AND all their time on the kids. They’ll be throwing your kids back at you like hot potatoes.", "Parents are fucked.", "There were definitely other ways to explain this than what you chose. You’re NTA for choosing a job that betters your life, you’re sort of an AH for saying it that way. People think bringing up money is really crass and the phrasing you used like it was an exchange for services (access to kids) was uncalled for. Sensing some feelings being harbored there. I think even being sarcastic and saying, “Pray tell, where would I find that kind of money staying here?” would’ve been better.", "Nta, parents are having a hard time coming to terms and that is a them problem. It sucks but you need to do what is best for your family , meaning you, kids, and husband", "ESH your parents are the assholes for expecting you to abandon your boundaries and you're the asshole for considering it", "Move. NTA if you move. You would be if you took money to stay. \n\nTake the new job. Tell your parents they can come up and visit any time they want. If their hotel has a pool, the kids would love to join them for a swim. (See what I did there?) \n\nYou can't stop your life to suite your parents. 30k now will expand over time, with either raises, or further career progression. Plus, presumably you have future school costs for their grandkids to provide for.", "Nta.\n\nYou are making a large family decision and you are providing alternative solutions.\n\nWhy not ask them to move to the new area too? Are they still working or retired?  \n\nAlso don't ignore the social cost of a move, loosing childcare and the relationships of kids and grandparents. The bond isn't the same when they only see each other a few times a year or less.", "I’m a grandparent and the blackmailing bullshit your parents are doing is absolutely wrong. You and your family go live your life and get on with what suits you. You’re NTA, they are.", "never stop you carrier because your parents want to see your kids for cheap. NTA", "NTA go live your life and if your parents love and care enough they will make an effort to come see their grandchildren.", "NTA- Your priority is you kids and your partner. Taking the job means more money to save for the future and to do other things. Your parents want you to give that up so that they don't have to go the extra mile to see the grandkids. And the fact that they didn't give the whole story to the rest of the family to try to pressure you into staying says a lot. Take the job, move and let the rest of your family figure it out.", "YATA. Grandparents love their grandchildren. And you are asking for money. So ridiculous.", "Your parents are quite entitled, aren’t they? To imagine they have more rights as the grandparents than you do as the the parent, and to then call you a horrible son for wanting to better your life shows just how good it will be for you to be far away from them. I think time and space is just what is needed here.", "NTA  You have to do what is best for your family. You are not stopping your parents from seeing them, they just won't see them anymore than other grandparents do. How much that time is will be up to them.", "I swear, I had never even heard of it before I got into this subreddit a year or so ago.", "I suspect OP is in Australia where FIFO is more common", "We moved 20 minutes away from our parents and my MIL was super upset because she doesn't like to drive on the freeway. 🤦‍♀️", "I think they meant like court mandated visitation rights, which would require the parents to make arrangements for the kids to go visit their grandparents for a certain amount of time out of a month(or something like that)", "It used be the laws favorite women getting custody which Ruth Bader Ginsberg fought against. I would have to do research into of all the laws that favored women have been repealed. \n\nPersonally as a feminist I think it’s extremely important to acknowledge the areas that men do have a rougher time. If it’s about gender equality that’s part of it and it seems like many fellow feminist liberals get incredibly defensive to acknowledge any areas men are disenfranchised. \n\nAnd this is when those\nIssues are brought up\nIn good faith. Not what aboutism. \n\nRacism and sexism still exists when the laws are changed. It\nseems dismissive to say men don’t have a disadvantage with custody and not even mention historically the laws have been against them.", "My Dad didn't even bother to show up on the day that custody was settled. We only saw him for a few hours every other Sunday for quite a while. I think I was 15 before he started taking every other weekend (9 when he left).", "It *used to be* that laws favoured women getting custody, absolutely. But today, that's no longer true in the US overall, and that's the claim I generally see. \n\nThe numbers don't bear out continued bias in the courts overall. It exists in some judisdictions, but the fact is that the majority of custody cases are decided by parents outside of court. Women end up with more custody most of the time. They also do most of the childcare while in relationships. Those things are probably linked. There are societal reasons that men get less custody, and I'm absolutely here to work on them, but it's important to be precise when we're talking about the problem. I think this is a function of trends in heterosexual relationships that men benefit from. It's a great example of why patriarchy hurts everyone and why the early men's rights movement were closely allied with feminists.\n\nIn some states, it may be the court is a meaningful factor. But most of the time it's not, and conflating the statistics of \"total custody time\" with \"custody awarded by the court\" is disingenuous at best and very common.\n\nhttps://www.weinmanfamilylaw.com/blog/2020/06/are-the-courts-gender-biased-in-custody-cases/\n\nThere's a chicago tribune article that's further linked, but it's behind a paywall. I'm like 90 min past bedtime now and work in the morning, so I'm not digging up further sources right now, but you are welcome to do the research you mentioned needing to do.", "Yeah, that’s how my niece was. She had multiple people that would have taken her in. For years, she was doing most of the parenting bc she was 6 years older than my nephew. Your brothers are lucky to have you. The system is really effed. I hope things are going well for all of you now.", "It's okay to call out sexism and racism against minorities because they experience systemic sexism and racism. Someone saying something without nuance is not an attack on you personally. They aren't perpetuating discrimination by lamenting the fact that a large number of men are depraved without making sure to not include the ones who aren't shitty. But similar statements about minorities **do** perpetuate discrimination.\n\nIf you aren't one of the shitty people they were talking about, recognize that not everything is about you and move on."]}