{"id": 26332, "submission_id": "16bmi52", "title": "AITA for Being Annoyed That My Father Will Not Stop Calling Me Fat?", "selftext": "I (29F) have been on the thin side my whole life. At my lowest weight, when I suffered from an undiagnosed medical issue, I was 88 pounds. At my heaviest, I reached 113. I am not overweight. I know this. I have no body dymorphia or self-esteem issues. Even so, my father has called me fat or commented on my supposed weight gain my whole life.\n\n\"You're getting fat.\" \"Have you gained weight? You look like you're getting fat.\" \n\nI get this all the time. He will not stop. \n\nOnce, we were at a party and he kept pestering me to tell him how much I weighed in a room full of people. \"You look like you've gained weight. How much do you weigh?\" Over and over when I didn't answer. Finally, I said, for the first time, \"I don't like it when you make comments on my body and weight. I don't do that to you or anyone else. There's no reason for you to do that to me.\"\n\nHe got offended and said he wasn't making comments on my body, but then he let it drop. I thought I finally got through to him, until this time.\n\nI am a few months post-partum. I'm working on getting rid of the mommy pouch, but even so, I've only gained five pounds from my normal pre-pregnancy weight. The entire family met up (parents, grandparents, aunt, cousins) and in front of all of them he says out of nowhere, \"you've gotten really fat.\"\n\nIt was embarrassing and irritating. I said \"why won't you stop saying stuff like that to me? I told you I don't like comments on my body.\"\n\nHe replied all innocent saying that he didn't mean any harm. That he's my father and he says it because he \"worries\" about me, and it's his job to check up on my health. No one in the room spoke up to defend me, because they never have and never will. Everyone else laughs it off when does it to them. They don't care what he says, and ultimately, I don't care either because I'm comfortable in my body no matter what he says.\n\nI know in his way, this is how he shows care. I don't believe it's his intention to make me feel bad about myself, but I have asked him to stop and he won't. Am I being too sensitive? Should I ignore him like everyone else does?\n\n&#x200B;", "created_utc": 1694012397, "permalink": "/r/AmItheAsshole/comments/16bmi52/aita_for_being_annoyed_that_my_father_will_not/", "score": 151, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I've stopped being silent about my father's comments on my body. I might be being sensitive and could let it go like everyone else does.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\nThis is not showing caring behavior. He knows exactly what he’s doing and unless you completely go off on him to get the point across, he’ll keep making unsolicited comments about your body.", "NTA Your father is a bully, and he tries to control you by commenting on your weight because he thinks it will make you insecure and easier to manipulate. I hate to say this, but you may need to cut your father out of your life for a while for your own physical and mental well-being. That may mean you stop going to family gatherings all together if he’s always present at them. But you have to do what is best for your health. And since his comments are starting to really get to you, it’s just a matter of time until you really explode in his face, and then the whole family will think you are the irrational psychotic one. That’s how bullies work. They push your buttons until you scream at them and then they call you the psycho. You don’t need this in your life. As painful as it may be, cut him out of your life.", "You're doing great. You called him out directly and named what was wrong with what he was doing. Keep doing exactly that. Be boringly repetitive (or pick a number of reminders you will give and then pick up and leave after that.)\n\nDad: You're getting fat. How much do you weight?\n\nYou: Don't comment on my body. I will not discuss it with you.\n\nDad: But I'm your dad and it's my job to stomp all over your boundaries and make you feel terrible\n\nYou: Don't comment on my body. I will not discuss it with you.\n\nDad: Why are you so sensitive? I just care about your health\n\nYou: We can try a get together when you're ready to stop commenting on my body.  (pack your stuff and leave.)", "Your dad is nasty and is gaslighting you. My narcissistic dad told me I was fat so i asked him how his ectopic pregnancy was going? ( his fat gut). He really didn't like that", "NTA\n\nYour father was and is still being unnecessarily cruel to you. If he's going to be like that, then you should go no contact for the sake of yourself and your child.", "Never ask a strange women when she's due, never ask someone their salary, and never ask someone their weight.\n\nNTA", "NTA, he’s being very hurtful and ignoring your feelings. I am sorry your family didn’t defend you, they absolutely should have. Don’t be gaslit, you are 100% justified in feeling hurt and targeted by his comments. Also you just had a fricken BABY (congrats by the way), you don’t have to justify your weight to anyone!!", "NTA he needs to STFU :)", "That isn't caring behavior, NTA but please for your child go NC or LC with your Dad.", "I think now is the time to start telling your dad how OLD he looks.  So old!  Ancient, in fact.  And so TIRED!  Dad did you say you were born in 1932 or 1934?  Dad, are you getting enough sleep?  You look AWFUL.  Have you lost some hair?  I think you've gained some weight.  The bags under your eyes are relentless.  You're starting to repeat yourself dad.  Do you think it could be onset dementia?  \n\nThe next time he mentions your weight I'd take a different route and start saying \"You already said this dad.  I'm becoming extremely concerned for your mental health.  Do you think I should start looking into some alternative care?  They have some good assisted living facilities...well, not NEAR here.  A few hours from here.  But I could probably visit once every few months...\"\n\nTROLL HIM, GIRL.  He knows exactly wtf he is doing by being so ignorant about your weight.  You are NTA and your dad deserves a dose of his own judgey mcjudgerson medicine.", "NTA and he's a bully. Have you tried loudly commenting on his body?", "NTA\n\nStop making excuses for his behavior.  Who cares if it's how he shows he cares? It's a messed up way, you've told him to stop and it doesn't feel like caring to you. So it needs to end. Would you let him talk that way to your child? Because he will. If you won't stand up to him for yourself do it for them.", "NTA\nIt is absolutely his intention to make you feel bad about yourself.  He has a vision of what an attractive woman should look like and he's putting that vision on you. Tell him to fuck off,  or that he's  bald,  or an idiot,  or that he's fat or any other insult you can think of so that every time he says something about your weight be gets an insult in return. He's being an ass ann he needa to stop.", "NTA and if he doesn't stop I would go low or no contact for a while. There is literally no reason for him to comment on your body. Ever. His excuse of being concerned about your health is just that - a bullshit excuse to try to play off his bullying behavior.", "The only asshole here, is your dad.\n\nVery sorry he acts like that. Keep reminding him you will not tolerate his stupid comments. And please don't get insecure over these annoying comments. \n\nNTA", "NTA. He is not showing he cares. He is being toxic. His intention is to make you feel bad about yourself. It is a control technique used by bullies. How do you know he's a bully? He uses the same excuses. \"He's your father.\" \"He worries about you.\" \"It's his job.\" This is called gaslighting. \n\nIt he was truly worried about you, he would respect your wishes. Instead he continues on because he gets a rush out of embarrassing you. He's toxic.", "Nta. Next time just walk out and leave him looking stupid then hang up when he calls unless his first words are \"I'm sorry\". Why do people think this is okay?", "NTA, this is emotional abuse. My top recommendation is to go NC, but I get that's not possible a lot of the time. But if you keep interacting with him, next time turn it around \"Well you aren't looking so skinny yourself. 4 beers a day for 40 years really packs on the pounds!\" Or whatever. \n\nAlso get therapy. I'd bet my left arm (my favorite) that you have a bunch of mental health stuff you could be working on.", "NTA\n\nHe is not showing you he cares in his own way. The exact opposite actually.\n\nYou stated to him that when he comments on your body, it makes you uncomfortable and you asked him to stop and he didn't. \n\nThat sounds like he doesn't care and he's showing you.\n\nTell him anymore comments about your body and he can't hang around his new grandbaby.", ">I know in his way, this is how he shows care. \n\nIf this were true he would talk to you about it in private.\n\nNTA", "NTA, and if you never talked to him again he'd deserve it.   \n\n\nIf I ever spoke to one of my kids like that I'd deserve their ire.", "NTA. do it back. Start commenting on his body non stop. Tell him he’s huge fat obese all of it infront if people too. Then when he gets upset tell him you figured since he’s so out of shape and obsessed with your weight and health that there might be a health issue going on with him and you just want what’s best for him. I can guarantee he isn’t in perfect shape himself. People like this never are. Stones and glass houses and all", "Hahaha.... fight fire with fire....\"I fix my weight when you fix your Testosterone levels\"\n\nWhen he says \"what? \"\n\n\"I'm a female human. You're clearly inadequate in producing enough Testosterone for all male children. When you fix your manliness ma'am; I'll fix my weight\" and walk away", "NTA, he should stop looking at photoshoped adult magazines to see, how real bodies looks like. And I'm sure he's model./s if the last part isn't obvious.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (29F) have been on the thin side my whole life. At my lowest weight, when I suffered from an undiagnosed medical issue, I was 88 pounds. At my heaviest, I reached 113. I am not overweight. I know this. I have no body dymorphia or self-esteem issues. Even so, my father has called me fat or commented on my supposed weight gain my whole life.\n\n\"You're getting fat.\" \"Have you gained weight? You look like you're getting fat.\" \n\nI get this all the time. He will not stop. \n\nOnce, we were at a party and he kept pestering me to tell him how much I weighed in a room full of people. \"You look like you've gained weight. How much do you weigh?\" Over and over when I didn't answer. Finally, I said, for the first time, \"I don't like it when you make comments on my body and weight. I don't do that to you or anyone else. There's no reason for you to do that to me.\"\n\nHe got offended and said he wasn't making comments on my body, but then he let it drop. I thought I finally got through to him, until this time.\n\nI am a few months post-partum. I'm working on getting rid of the mommy pouch, but even so, I've only gained five pounds from my normal pre-pregnancy weight. The entire family met up (parents, grandparents, aunt, cousins) and in front of all of them he says out of nowhere, \"you've gotten really fat.\"\n\nIt was embarrassing and irritating. I said \"why won't you stop saying stuff like that to me? I told you I don't like comments on my body.\"\n\nHe replied all innocent saying that he didn't mean any harm. That he's my father and he says it because he \"worries\" about me, and it's his job to check up on my health. No one in the room spoke up to defend me, because they never have and never will. Everyone else laughs it off when does it to them. They don't care what he says, and ultimately, I don't care either because I'm comfortable in my body no matter what he says.\n\nI know in his way, this is how he shows care. I don't believe it's his intention to make me feel bad about myself, but I have asked him to stop and he won't. Am I being too sensitive? Should I ignore him like everyone else does?\n\n&#x200B;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "If it doesn’t bother you at all because you’re so comfortable why are you even making this post?", "YTA for believing that Fat is a horrible insult and one of the worst things that you can be.", "NTA - Even if you were fat(I know you are not from the post but even so.) it is not his business as you are an adult. You can snap back at him with something wrong with him and just laugh it off if he gets upset and say you are just 'checking in' as his kid... However, that might be a bit petty. Okay, it is petty. I would have stopped being anywhere near him by this point.", "NTA. Can I beat him up for you? Wtf. Who in their right mind would think that’s okay?", "NTA There's a way to ask in concern, by your medical professional who knows the accurate terminology, and he's not a medical professional. Is he literate? I'm sure he understands how to read. So read the room buddy, he's made everyone around him so jaded by his off hand comments, and you're the one who woke up.", "NTA\n\nI'd be getting downright aggressive with him at this point. You need to tell him to shut his fucking mouth. Tell him he is being a bloody arsehole and he needs to quit it or else. The only real power you have over people like this is your presence, and I suggest that you stay away from him until he learns to behave.", "Nta. It's weird that he has a fixation on your body. I'd personally resort to body shaming him and asking him how he feels about it, but I'm petty. You do you and next time he even begins to comment on your body yell STOP IT", "NTA, as someone who has dealt with that exact same situation, absolutely NTA. Also, weight isn't always an indicator of health. Some larger bodied people have perfectly fine hearts and systems, some skinny people are unhealthy. When you age your body fluctuates all the time, be it hormones or whatever. You're also handling the situation very well, telling him directly and in front of people. Keep calling him out, keep telling him how it hurts you, if you have to resort to saying \"if I can't be around you without commenting on my body then maybe I shouldn't,\" then so be it. Considering he has a new grandbaby then maybe THAT will finally get the message across.", "NTA.", "NTA but your dad def is. Do you want him doing this to your children? Because he def will.", "NTA - I've learned over time this is a 'control' mechanism that some people use to try and keep you 'in line'.   I had a parent like this.       Just tell him calmly these comments are not appropriate and you don't want to hear it again.    Then check him on it if he doesn't stay within the boundary you established.", "Stop going around him. NTA", "NTA, your father is a bully.\n\nTell him that any comment about your weight is not appreciated.\nTell him the next time he comments about your body, you will leave. Or if he is at your place, throw him out.\nNo explanation, just stand up and go.", "NTA\n\nNext time he does it, just leave. You have told him that you don't like it when he makes those comments so he should stop. \n\nWhy fat? Based off of the post, you are really skinny. Based off of my understanding, it's because of health reasons and not a choice but if he things your 113lb body is fat, what does he think is a normal weight?", "NTA. Stop excusing his behavior. It is insulting and abusive. Him being concerned is total BS. Every time he says it, you say:  I notice lately that you've gotten really forgetful and am worried you might have Alzheimer's or demntia. Do you want me to get you a doctors appointment dearie?\"", "NTA. But if he’s been doing it for years, it’s a habit that will take time to break. Just keeping directly telling him to stop as you did. Don’t argue just stick with the explanation ‘I don’t like it’ Repeat the same phrase every time.", "NTA. Might be time to withhold some of your time from him. A relationship with his adult daughter is now optional based on his behavior.  When he calls to find out why you haven't visited with the baby, you need to firmly tell him your boundaries and the consequences for him if he chooses to still bully you.  He needs to learn to be a better person.", "NTA. I’m sorry but no, I don’t think this is how he shows he cares. It’s mean.\n\nIt’s also medically wrong according to you. If you continue to interact with him I’d use comments that would make him uncomfortable. \n\n“Why do you keep staring at my body?”\n\n“Actually my doctor said I need to gain weight so I’ll trust the expert”\n\n“Glass houses and rocks dad”\n\n“What part of my body exactly have you been looking at and judged to be unacceptable?”\n\n“What’s your height and weight? Let’s look up your BMI”", "Tell him you look fat how much do you weigh and how much have you gained in front everyone. When he gets offended tell him this is exactly how I feel. Tell him I just had a baby,  what is your excuse? Tell him if he was worried he would approach you privately not try and put you on the spot and shame you in front of your entire family.  Tell him from now on this topic is off limits period. He is your father not your doctor", "Instead offer lbs/inch and boldly offer to compare.  For example 60 inches in height and 113 lbs is 1.88lbs  per inch then ask him to compare…. If his is answer is higher and you’re a nursing mom, unsubtly remind him a portion of yours is nutrients for another human. Ask his excuse.  NTA.", "NTA. Your father on the other hand......", "\"Hey dad, you continually forgetting about my boundaries makes me worried...it seems like you're developing dementia or Alzheimer's. I'm just worried about you and care about your health.\" NTA", "NTA.  Ask him why he's trying to manipulate you into an eating disorder in front of everyone. Tell him his constant comments not only don't help but make you want to avoid him. \n\nOr when you arrive go up to him and say \"Well, are you going to tell me I'm fat? If so can we just get it out of the way so I can actually enjoy myself.\"  Especially if it's in front of a non family member.", "NTA. My father pulled this shit on me when I was young and it leaves scars. We're talking, when I was as young as eight years old he would say things like \"You're too fat, no boy will ever want to date you.\" There's a reason I haven't had contact with my father in 20+ years.", "NTA,  geez, when he grows a human MAYBE he can comment. But honestly, tell him your about to lose 200 lbs. of unwanted weight by never seeing  him again.", "NTA NTA NTA\nYour father is though, 💯. \nI'm not usually an advocate of nuclear options but...yes, go NC. \nHe's been an a$$hole all your life & now you've had a baby, presumably his grandchild, he STILL thinks this is ok.\nYou deserve much better, OP.\nGood luck.", "You really dont think he intends to make you feel bad with those comments?    \n\nThen why is he saying it in front of everyone and not privately?   \n\nMaybe take those rose colored glasses off - all the red flags just look like flags to you.", "Tell him anytime he comments on your body (creepy btw) you will cut communication for a month, he does it again 2 months until he learns. The rest of your family are enabling buttheads, they may need a time out too.", "He's not innocent. He's a controlling jerk. I would be petty and start picking on something about him.  And don't stop! Fight fire with fire.\n\nIt would be interesting how fast the family would jump to defend him. I don't understand where at least your mom is on this. My daughter when she first started puberty put on a bit of a belly. My husband said something to her. I shut him down immediately.", "NTA. This is not care. This is abuse.", "NTA.\n\nJust because someone doesn't ***mean*** any harm doesn't mean they don't ***do*** any harm.  The two are completely separate.\n\nIsn't there anything you can, with a very loud voice and straight face, throw back at him.  I.e. ...\n\n*\"How much hair have you lost? Wow you're really getting bald.\"*  Or something equally embarrassing.\n\n*\"Wow how much nose hair do you have? I'm surprised you can breathe.\"*\n\n*\"Wow what kind of deodorant do you use? Might try something prescription.\"*", "nta. next time just hit him with the \"shut the fuck up about my body\" and refuse to engage further", ">NTA Your father is a bully, and he tries to control you by commenting on your weight because he thinks it will make you insecure and easier to manipulate.\n\nThis! Thank you!", "Lmaooo my ndad loooves to comment on my weight or appearance bc he’s “concerned”\n\nETA: I usually just pretend I can’t hear him until he says something I *want* to respond to", "We Stan a petty king/queen 😂 perfect response", "Seriously, this!! Is he entirely basing his judgement of human bodies on filters, photoshop, porn, models and actresses? 113 pounds at most is not fat on any grown adult. I don’t know OPs height but if anything it’s much more likely she’s underweight than over. I mean I was 111 in HIGH SCHOOL and still considered extremely skinny for a teenager.\n\nI know OP believes he has no ill intent and I hope that’s the case, but I feel like you have to either be delusional or making a purposeful dig to say OP is fat. Regardless of the reasoning, it’s 2023 and every adult should know if you are not directly asked, you don’t comment on other people’s body like that", "It's being used as an insult and way to control OP.  It's inappropriate to continue to comment on someone's weight, whether fat or thin, especially after they asked you not to. I have seen posts from people complaining about the comments made about their height, whether tall or short. Also inappropriate. OP knows dad's intention, so whether it's weight, intelligence,  or any other trait, dad is wrong.", "When he says this to you (every time)I- was going to ask you the same thing! You've gained weight and look fat. Then turn around and walk away", "I've been through this before. Next time he comments about your weight. Ask him if he is feeling OK because he is starting to look really old. LOL If he still doesn't get the message, start setting him up to think he is losing his memory. You know, \"Don't you remember we were supposed to go out to eat tonight?\". If you can't fight'em, join'em.", "NTA- and I don't know if you realized how cringy and you gross all that came out when you posted.\n\nI don't know if he's a bully or if he's sexist and believes you will lose your partner unless you don't lose those few pounds?  \n\nOr when your thinner you look more like his little innocent girl.  And with a little bit more weight you probably look more like a adult woman, and you can't because you're his little girl.\n\nEither way if you can, I suggest going low contact for a period of time unless he can prove that he\nCan stop commenting on other people's appearances.\n\nI don't know if you have a list of things that you can come up with of issues with his appearance, pimple and ingrown hair, bad hair cut, slouching, you name it.\n\nNext time he throws one at you, throw one right back at him.  You're just concerned about his appearance.  Because that seems to be all he cares about.  Not like health or anything like that.\n\nOr talk to your doctor. Find out what your doctor says is a healthy weight for you. Get a note from the doctor.\n\nThen use it to shut them down next time.\nHe comments about your body in front of everyone, Tell doctor says you're good.  So he can let it go now.", "This is abusive behavior from your father. He isn't showing he cares, just being a bully. NTA", "NTA\n\n*every time* you see him, look him in the eyes and say loudly “Are you ok?  Are you confused?? Did you have a stroke?\nBlink twice if you can’t talk!”\n\nTalk loudly and slowly to him, like a very old, deaf person.\n\nMock insult him every time.\nMake him angry.\nMaybe he will get the message or stop blurting out stupid crap", "NTA and this is NOT showing love. He sounds like a gaslighting bully and I suggest you keep your distance, because I guarantee he will treat your child exactly the same and it will destroy their confidence. You don't want that.", "NTA, and he literally is doing this to torment you because he's weirdly getting off on it. There is no way you are fat so clearly he's just doing it to bother you. He is trying to get you to feel bad about yourself. Stand up for yourself and the next time he does it, leave. Remove yourself from that environment and go low contact. Are you really going to subject your children to this too?? I guarantee he isn't going to stop with just you.  He will torment your children into getting eating disorders. Stand up for yourself and stand up for your children.", "NTA! And your should tell your dad to go F himself and go no contact or low contact with him since he won’t stop when you ask him and even go no contact with your family since they won’t defend you.", "NTA.  Put dad on read.  Do not interact or respond to him.  Also, you could stop seeing him altogether, especially since you have a child now.  Imagine him saying something like that to your child.  If he asks why, tell him.  He’s not a good person.", "Do it back. You tried mature. Now he's made it clear this is how he wants to be treated. Or just stay the hell away from him. Stop showing up for it. As soon as he opens his mouth, say, whatever his first name is, Xxx, we spoke about this. Pull a mirror out of your purse, hold it up to him and tell him that's what an asshole looks like.", "NTA\n\nDad: You’re getting fat. \n\nYou:  you’re being an ass. \n\nDad: I’m just worried about your health. \n\nYou: I’m just worried about you continuing to be an ass. \n\nWhich he will continue. And he will start doing to your child, especially if you have a daughter. Even if he doesn’t say it to your child (he will), your child will grow up seeing him say these things to you. Unless he’s never around again to say these things in your presence. If he can’t stop commenting on your body, he should be in the same room as you body.", "NTA, your dad is a dick. I don’t think he’s being caring when he knows how upset his comments make you feel. He continues to say them after you told him to stop multiple times.", "NTA. like you, I have always been naturally slim my whole life, struggling to gain weight can be just as hard as trying to lose it. People commented when I was too skinny, commented when I managed to gain weight, which was an uphill battle and ended up with cholesterol problems. Good on you for standing up for yourself.", "NTA.  And now is the time to shut this shit down HARD.  Because he is going to do the same thing to your child.", "This is how he shows care..?\nI am baffled, NTA, is this really fine for you as a love language??", "NTA\n\nLoudly say, “it’s weird when a relative keeps looking at my body non-stop and commenting on how he’d prefer it to look. That’s really creepy. Especially because you’re my father. Quit being gross.”", "NTA. your father is emotionally abusive. this is not how he shows he cares.", "You are NOT too sensitive. Your father is just TA.\nHe has bullied, demeaned and shamed you your entire life. The only weight you need to lose is whatever your so-called father is.\n\nThe real question is, what will you do if he does it to your child? Do you want your baby to be bullied from infancy? Time for no contact.", "The next time he does it, ask him straight up without batting an eye if the reason he bullies you is because his mom or dad bullied him and it's all he knows? Then tell him because that's the only reason that makes sense and that \"he can break the cycle\".  Say it with the utmost concern and loud enough for others to hear.  A bully always backs down when confronted amf and embarrassed.  He needs to learn this.", "NTA. Is your dad physically flawless like some kind of god- aquiline nose, killer cheekbones chiseled jaw, rock hard abs, bulging biceps, muscular thighs, etc? I doubt it. Even if he was, he still has no right to speak negatively on your body, especially when you've never even been overweight! You could comment on how wrinkled, old, gray, balding, or paunchy he looks, and suggest he dye his hair, get a toupee, \"Botox it Up\" or have plastic surgery if he's so fixated on looks. Say you could start a Go Fund Me page for his much needed makeover. See how he reacts.  Or keep mimicking his questions or comments \"How much do YOU weigh? You look like you're getting fat\".Or just keep stating how you don't want his unwanted criticism on your perfectly normal appearance and just walk away..", "Nope. Don't you do that. Don't you give him an out, make an excuse and soft landing for his terrible behavior. That is not him showing he cares--he does not believe \"you've gotten fat\" is a caring comment. And in a crowded room.\n\nHe's a bully and a narcissistic one at that, and keeps doing it bc everyone let's him. He likes that it bothers you. \n\nYou need to decide how you want to protect your peace and handle this going forward. You know he'll behave this way to your child(ren) too, right? \n\n Personally I'm the type to return energy, so I'd start asking the same type of questions with fake concern. Loudly. In crowded rooms full of people he knows.\" Are you loosing your hair? It looks like you're losing your hair. Have you akwqys had that bald spot? Babe, doesn't it look like Dad's going bald?  What? No, I'm just worried about you.  Don't be silly, that didn't hurt your feelings. It's just like when you tell me I'm fat. Its love\". Pick the pain point of your choice. Rinse and repeat.\n\nThat's just me tho, and probably not the healthiest approach.  But OP, please don't write this off as love and don't just keep taking it.\n\nNTA\n\nEdit:I loathe autocorrect \n\nOther edit: words", "Could you try flipping the script on him?  When he makes comments like that  \"remind\" him that you've talked to him about his bad manners MANY times-- then turn to the others in the room and in a \"stage whisper\" sigh and say \"He keeps forgetting more and more.  We really need to contact his doctor about a screening for Alzheimer's.", "NTA tell him your mother said he has a small wiener.", "You know you're NTA.. this should be in /r/relationship_advice", "This is not the way your father shows care; it's the way he hurts you, insults you, and tries to undermine your sense of self-confidence.\n\nYou have already told your father to stop and why; he refuses.  \n\nI assure you that any adult man on the planet is aware that telling a woman she looks fat is a horrible thing to say to her.  Not a way of showing love.\n\nI would suggest that you go NC.  You don't need to be around someone who keeps criticizing and hurting you.  (Nor does your child.  If this is a girl child, can you even imagine what he's going to say to her and the impact it's going to have?)\n\nNTA", "Worry: Pulls you aside in private and says he wants to make sure everything is fine and that he's there if you're not.  Like actually showing honest concern.\n\nNot worry: abusing you verbally privately and in public about something.    And ignoring your repeated requests to stop.  That's not parental concern.\n\nNTA", "Nta. He seems weirdly fixated on weight. Is he neurodivergent? That kind of behavior is not normal. The only person I know who worries that much about other people's weight has aspergers", "NTA; your dad needs to shut the fuck up. I, a tiny 5-foot-tall twink, am heavier than you. I mean, not by much, but STILL!\nMake sure he knows you will not tolerate any bullshit, especially if he moves on to your kid.\n\nThis behavior is unacceptable, and I guarantee the others are just laughing because they’re too uncomfortable to protest.", "NYA, and if this is how he shows he cares, you should reciprocate to show your love. Ask him how much he weighs, point out that's double/triple your weight and tell him all about the risks of heart disease", "\"You should be just as concerned about my body as I am about whether your dick works\"", "“This is how he shows care” WTAF?!? NTA. \n\nYou’ve asked him to stop. You’ve told him to stop. He knows you hate it. You’re not being too sensitive, he’s being an asshole. \n\nEvery time he says something like that you leave. Hang up the phone. Temp block his number. He gets put on time out. You don’t even have to tell him what you’re doing, just grab your kid and your bag and be elsewhere. You can start small, like go into another room, but gathering the baby and heading home also works. Do it Every Time.  If he cares and wants you at the family gatherings, he will figure out how to handle his own mouth. \n\nIf you don’t have anyone that will kick his ass out of your house, he doesn’t get to come over anymore. This you can be upfront about “Dad, you can come over as long as you do not mention my weight or body size at all. Can you do that or should you stay home?” If (when) he slips up, “Dad, it’s time for you to leave.” Then go into another room with the baby.\n\nHe doesn’t get to say that shit to you. He can say it to the air, but you’re not there for it. He’s not being loving, he’s not showing care, he’s being an asshole.", "Your father is a fucking weirdo and you should refer to him as a weirdo in his presence.", "NTA. My Dad used to do this too he would comment on my weight before even saying hello. I decided if he could do it so could I. He'd make a comment on my body so we d return with gosh looks like you've lost more hair, or has your beer gut gotten bigger? Not surprisingly he replied how hurtful my comments were. I said yeah not a good look to comment on people's bodies huh? I'll stop if you do.", "NTA\n\nDon't know if it would work for you but one time when my dad mentioned me being fat, I told him that he was bald...", "NTA. Good job speaking up for yourself.  Next time, consider walking out (or making him leave) after calling him out for being mean and hurtful.  Might also try turning the tables, I’m sure dad is showing his age.  “Baldy” as a nickname, or “‘my doctor says my weight is fine, what does your doctor say about your spare tire”.  Sometimes the best defense is a good offense.", "NTA.  Next time get even and embarrass the crap out of him.  “Well dad, I’ve asked you to stop making those comments, but I see you have decided to be ugly on the inside and keep making them.”", "Your father will not be happy until he’s given you an eating disorder\n\nNTA", "Tell him his teeth are yellowing and his gums are receding.  Notice his creepy skin.  Mention the dark marks on his face and hands increasing.  kt", "ask your coworkers their salaries to make sure your company isn't fucking you over and underpaying you :p", "This is exactly what domestic violence victims say about the bruises their abusers leave on their bodies.", "It's not about that. He's negging her because he's an asshole that enjoys hurting her. My dad did stuff like this. None of what he said was true, he just enjoyed hurting me.", "\"He's concerned\" - yeah, right. It is not concern if he asks EVERY TIME he sees you. That is not concern, that is bullying. Not that this should matter but I highly doubt that OP's weight fluctuates so much in between seeing her dad that he truly needs to comment on it. Therefore, he is just doing it to do it.", "Dude I know, I’m agreeing w you. That’s why concerned is in quotes??", "Brilliant. Fight fire with fire"]}