{"id": 26398, "submission_id": "16ckpqn", "title": "AITA for saying my husband's friend is at fault for cheating on his gf?", "selftext": "My \\[26F\\] husband A \\[27M\\] and I are friends with 2 people K \\[24 F\\] & J \\[27M\\] who used to be a couple, they broke up over a year ago. Since then, we stayed friends with both sides, separately. \n\nAbout a year ago, J started dating another girl H \\[23F\\], and has been in a committed relationship with her since. Over the weekend J went to pick up furniture from his and K's old place, since she is moving out of state and she offered him anything she cannot take with her. They ended up having sex, after J made a joke about it and then K continued to egg it on. \n\nMy opinion on the matter is that since J is in a committed relationship with someone else, he is at fault and should have been able to resist temptation with K and use his better judgement. My husband, A's stance is that J is not totally at fault because how could he resist of K kept encouraging it. \n\nNow, my husband and I are mad at each other over a situation we have zero direct involvement in and its causing my anxiety to spiral over the thought that he wouldn't be able to resist either.", "created_utc": 1694105153, "permalink": "/r/AmItheAsshole/comments/16ckpqn/aita_for_saying_my_husbands_friend_is_at_fault/", "score": 32, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Action - I stated that husband's friend J was at fault for cheating on his gf with our other friend K, his ex & that he should have been able to walk away from any temption if he really loved his gf H.\n2. I feel like I may be the AH because his ex/our friend K, did offer temptation and minimal convincing for J to have sex with her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Resist the temptation? That's on that guy. Is like I'm saying \"I couldn't resist to cheat on my gf with that girl, she was awesome\". That doesn't sound right at all lmao", "NTA - but I'd have serious doubts about your husband now. He doesn't seem ethical and it sounds like he thinks cheating is acceptable.", "Oops sorry my penis just entered your vagina, I have no idea how it got there. NTA but your bf has made it clear he's a sexist with his argument.", "NTA, guy was def in control of the situation and could have removed himself from it so that he wouldn’t have had sex with her. Seems like it should’ve been easy to say no and then leave if she became pushy, but I’m betting she didn’t have to push much at all. Your husband defending a cheater would make me suspicious about him as well.", "NTA - you’re right. I’m sure if you spun it the other way around and had someone egging *you* on for sex your husband would be singing a different tune than “how could you resist”\n\nJ could have ended the conversation. He could have said the egging on made him uncomfortable. He could have brought a friend with. He could have just left.\n\nLet’s also not forget that *J made a joke about it* He wasn’t exactly trying to prevent anything here", "How could J resist?  Uh, how about by being a decent person.  NTA but your husband is.  No wonder you were triggered.  Hope he doesn't run into one of his ex's.", "Likely you been cheated on already if your husband’s stance is that is okay if you cannot resist", "NTA and I would be just as worried as you are about your husband's response. I don't care if she answered the door completely naked, he cheated.  He made that choice and is responsible for his actions, period.", "NTA - cheating is cheating and once a cheater, always a cheater.  There is never an excuse for cheating.  Your husband just handed you a red flag when he said that J is not totally at fault and that K kept encouraging it.  Ask him, if he was in the same situation as J, would HE have cheated on YOU with K?", "Missing a lot of context here but yeah there’s not many situations where you’re not at fault for cheating lmao. NTA", "NTA - if you're in a committed relationship (J is/was), then have the decency and respect for your partner not to be tempted to stray no matter how strong the temptation. J should have immediately put an end to K's advances, (he shouldn't have even joked about anything sexual with K in the first place to prompt her to make her advances on him), and in failing to stop her advances he should have promptly took his stuff and just left immediately. The fact that he failed to not make the sexual joke(s) in the first place, the fact that he did not reject her advances thoroughly, and the fact that he did not remove himself from the situation until it was already too late shows that some part of him wanted this to happen and he does not care what kind of hurt/pain he causes his current partner H nor have respect enough for her that he would resist any and all temptations. If J has any shred of decency and respect left, he owes it to H to tell her the truth that he cheated on her and to either earn her forgiveness/trust (if she's even willing to give him a second chance) or learn from his failures/mistakes and move on. J sounds like HITA. and your husband sounds kinda HITA for siding with J. Cheating is NOT ever ok, it is extremely disrespectful and hurtful to your current partner.\n\nIf there is something lacking in the current relationship that is resulting in a temptation of either partner to cheat, then it needs to be communicated and worked on as a team effort, maybe even couples therapy or something is needed. If after communication, effort and/or couples therapy is still not fixing the relationship then both persons should understand that the relationship isn't working and they have to split and move on (else it's just toxic).", "They're both at fault. I'm assuming K knew J had a new girlfriend. No matter how tempting, J should have more respect and love for his new girlfriend. Both of them suck.", "NTA I'd be suspicious of my partner if they were supporting someone who cheated, J is at fault as he could've easily told K that it wasn't going to happen he had a girlfriend now and if she persisted removed himself from that situation he didn't have to do it, she didn't force him to do it, he chose to do it.", "INFO Did K know J was in a relationship? If so both K and J are in the wrong.", "NTA. J is in a relationship. He was wrong for opening the door to the subject but K didn’t force him to continue to walk through the door. She should have known better too but it isn’t at all difficult to say no.", "NTA  I take it K is single? So the only cheater here is J. The claim that your bf is trying to make that men cannot control themselves if a woman is interested in sex with them and therefore they have no responsibility of their actions is sexist bullshit. He CHOSE to cheat, no one made him. He's a cheater and I'm surprised your bf isn't doing more to convince you he's different from J.", "NTA, but this would concern me if it was my husband's view of things.  So your husband would not totally be at fault if he cheated on you because the other person was encouraging it?  I would make it clear that if he does that, divorce will be on the table.  Make it clear that is  a line in the sand.", "Your husband is gonna (or has) cheat and blame you.  I'd put money on it.\n\nNTA", "NTA. Anyone who tries to absolve a cheater of blame is automatically an asshole. And, unfortunately, may \"justify\" cheating himself. Both of your friends are at fault.", "J is at fault here", "NTA.  If J can't be blamed for giving in at the end, then it must have been his responsibility to avoid putting himself in a situation that was past the point of no return in the first place.  What's your husband's view on that?", "ESH they both suck. The ex knowingly slept with someone in a relationship. The friend decided to cheat. Stop trying to grand stand when both of your friends suck.", "NTA.\n\nActions have outcomes. Unless K has the ability to control the minds and actions of others, this is entirely on J to have said no. Heck, J shouldn't have even make the joke in the first place so in a sense, \"he started it\".\n\nSeparately though, you are an AH for using initials instead of made up names in your post. In your head, you easily replace those initials with the people you know. To us, they're just single letters and it makes it far more difficult to keep track of who's who.", ">since J is in a committed relationship with someone else, he is at fault and should have been able to resist temptation with K and use his better judgement. My husband, A's stance is that J is not totally at fault because how could he resist of K kept encouraging it.\n\nYou Play ... You Pay ... they are both at fault.\n\nJust make up with your husband, don't let their sillinesss steal your husband's love.", "Ignore stupid moves by your friends and focus on your relationship. You might want to have a discussion about his stance on fidelity within a marriage and outside of it. YA all being TA. Don't fight about something that has nothing to do with you.", "ESH, first I want to clarify the only reason OP sucks because she defending her friend by saying she don't have any fault in this where in reality she just as fault for hitting on a guy while knowing he taking. Now the guy is at fault to for not saying no and not removing himself from the situation which leads to him cheating on his girlfriend. Now your husband sucks just by defending his friend. Truthfully both you and your husband is extremely bias in this whole thing trying put blame on one person and not the other but reality is both is to blame.", "J is definitely TA here. Tell H what he did or ESH.", "Both of you should mind your own damn business and agree to disagree. ESH", "ESH  It sounds like you and husband need to mind your own business.  Get some hobbies.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy \\[26F\\] husband A \\[27M\\] and I are friends with 2 people K \\[24 F\\] & J \\[27M\\] who used to be a couple, they broke up over a year ago. Since then, we stayed friends with both sides, separately. \n\nAbout a year ago, J started dating another girl H \\[23F\\], and has been in a committed relationship with her since. Over the weekend J went to pick up furniture from his and K's old place, since she is moving out of state and she offered him anything she cannot take with her. They ended up having sex, after J made a joke about it and then K continued to egg it on. \n\nMy opinion on the matter is that since J is in a committed relationship with someone else, he is at fault and should have been able to resist temptation with K and use his better judgement. My husband, A's stance is that J is not totally at fault because how could he resist of K kept encouraging it. \n\nNow, my husband and I are mad at each other over a situation we have zero direct involvement in and its causing my anxiety to spiral over the thought that he wouldn't be able to resist either.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. J is and AH and so is your husband. Your husband defending the cheating makes me think your husband would do the exact same thing given the opportunity.", "They're both shitty things to do, but I do think there is atleast a slight moral difference between cheating opportunistically and actively seeking it out. Murder and Manslaughter are separate crimes.", "yep, it doesn't help that I have an anxiety disorder and my husband's reaction to our friend's situation has been triggering for me.", "I'm sure he wouldn't say the same if roles were reversed :/", "Thank you, I woke up in a panic at 1 AM thinking he could be doing the same things to me and I would never know.", "Thank you. Do you think I should tell H myself or tell J to tell her and fess up himself or I will? I feel like its not my place, but I think if it were me I'd want someone to tell me.", "Yes, but K is not at fault and didn't \"force\" J to cheat, he made that decision himself.", "I'm wondering if K & J broke up because he was cheating and this we just some sort of payback.", "Yes she fully knew. When K told me I responded they both were gross for their actions, but she's not the one responsible for the fidelity in J & H's relationship.", "And K ain't? Truthfully both is at fault.", "The fact that J had his truck turned on and was about to pull out of the driveway & made a decision to turn off the truck, exit the vehicle, and re-enter her home. He so easily could have just left.", "valid.", "great advice, thank you - I appreciate it.", "But they're both crimes. Regardless of the minutia, he still cheated. At any point, he could have extracted himself from the situation. (Under a reasonable assumption that there was nothing preventing him from leaving.) It shouldn't matter if he was joking or she encouraged it. He had every opportunity to say \"sorry I'm dating someone else\" and be done with it. NTA", "Except you don’t accidentally stick your dick in another woman. Cheating is a clear and conscious choice you make. No exceptions. No excuses.", "I would be for anyone.  He is saying if any girl want to fuck he will do it.  Not something I'd consider marriage material.", "Exactly, sexist. Women clearly have magic in their genitals that takes away men's free will according to your  bf.", "J really should be the one to tell H (you can try to convince him that it is the right thing to do, if he still has any shred of decency and respect for H), and if he won't then H still needs to know one way or another, because ultimately he disrespected her, he betrayed her trust and if he won't take accountability HITA. H still deserves to know the truth and H deserves someone who will treat her better, or the opportunity to work things out with J, if she still wants to give him a second chance. It is a bit out of your place but H still needs to know. Broach it to her gently and cautiously though, if it has to come to that.", "You should tell H yourself because it will be an opportunity to check YOUR relationship coming on the heels of your husband’s questionable attitude about J’s cheating.\n\nJ is going to be mad H found out. He is going to find out you told and he is going to say something to your husband about it, then it can go several ways.\n\nIf the way it goes is that your husband complains to you that you caused problems by “running” to H and telling her something you should have kept quiet, you have a real problem here.", "She was still aware of his situation. She knew there was another woman. It still makes her just as bad. Both are equally at fault. It's not her responsibility to make sure he doesn't ever cheat, but it is on her to cheat with him knowing.", "They did not, just genuinely not compatible & quite frankly they both have issues that needed to be worked out.", "No she's not responsible for for his fidelity but she is responsible for her own actions. She knew he was in a relationship and that they are supposed to be friends but wanted to mess around anyway. They are both wrong. She never should have suggested it and he shouldn't have have said yes.\n\nThey are both joking about it now. They are both wrong.", "They're both responsible for their actions but HE is responsible for the cheating since HE is the one in the relationship and HE is the one who chose to cheat.", "She did shady shit too IMO but she didn't force him to cheat. Tempt? Yeah, but no forcing was done.", "I just celebrated many years of being with my husband and know that drawing a line in the sand about other people's f ups is not worth it. I appreciate your not getting defensive and truly hope that helped. Good luck!", "I mean we do... kidding of course. Our brains are just a little more disconnected from our sexual organs.", "Yea not saying he was forced I just see it as yes he cheated but she helped him cheat. Like you said shady shit both morally wrong. Truthfully if this was more connected to you like for example if k slept with your husband instead of J this entire post would be less NTA and more burn the witch trials for both of them. Now do believe you should tell j girlfriend and do believe you should put some distance towards K if she truly thinks sleeping with a taking person is ok. Your husband should put some space to J too if J thinks cheating is ok.", "No. Stop that shit, even joking. The only thing different is the audacity"]}