{"id": 26406, "submission_id": "16cmyhj", "title": "AITA for taking back a wedding gift for my sister after she then proceeded to air out my dirty laundry completely unprompted.", "selftext": "I’m 22 and finishing my fourth year of college in the fall. My sister is 28 and recently got engaged with her boyfriend of 2 years and yesterday was her wedding.\n\nFor some context, I really don’t have a great relationship with my sister. Throughout my life she’s essentially taken it upon herself to try to be my third parent and have absolutely zero compassion for my boundaries, the way that I feel, the fact that I am on the spectrum, and what my opinions are, always insinuating that I will never be successful unless I “overcome my symptoms and be high functioning” and calling literally every objection, complaint, and every reaction for being backed into an emotional corner “abusive” pushing my buttons and then playing victim when I snap back. Worst part is my parents completely endorse this behaviour much to my detriment and I just want to cut them all off.\n\nI originally did not want to go but my chad uncle would be there. Wanting to be gracious about it, I bought my sister a copy of BTS’s Proof anthology album as she’s a huge fan and was really happy about it.\n\nHowever, later on during the reception, I had heard my sister telling her friends about the various times that I “abused” and called her nasty names in response to her “trying to talk sense” which really were just thinly veiled character assassinations, saying stuff like “you can’t tell him nothing” and “he’s just not a nice person”. I wasn’t even talking to her, and many of these I had previously apologised for.\n\nI decided to stand up for myself and explain my side of the story, to which she was having none of, only doubling down on the rapid fire airing out of my dirty laundry whilst having the gall to complain about me “not taking accountability” and my “misremembered revisionist history”, I tried to stand up for myself and say that I was but she then cackled like a fucking hyena the moment I said that, and I really felt myself just getting mad, all the while she called me a narcissist, stuck-up, gaslighter, hypocrite, and a “ticking mistake bomb”. \n\nNot wanting to play her little game, I just up and left, picking up that BTS album when she wasn’t looking. I don’t drive yet so I took the bus home, stopping by the store I had gotten the album from to return it, which they swiftly refunded. All the while I was being inundated with texts and calls that I just couldn’t be bothered to answer since I was so mad, only doing so after I had gotten home and calmed down. Not only was it my parents asking where I was, but also my sister and relatives calling me selfish and sensitive for taking back a “gift that was already given” due to “being petty and butthurt” and apparently it’s something that you don’t do, especially at a wedding; their words, not mine. To top it all off, my sister left a voicemail saying that I only “proved her point again.” I feel I really cannot reason with these people so am asking here.\n\nTL;DR: Title.", "created_utc": 1694112839, "permalink": "/r/AmItheAsshole/comments/16cmyhj/aita_for_taking_back_a_wedding_gift_for_my_sister/", "score": 1611, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Because as a response to being talked badly about without prior provocation by my sister at her wedding, I took back the BTS album gift I had given for her and returned it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nWhy even maintain contact with her? Classic emotional abuse.", "Sorry your family suck", "NTA\n\nTaking the gift back was petty.\n\n... but she totally deserved it.", "INFO: I'm confused about the chad uncle thing. What's a chad uncle?", "I don't know about your family dynamics, but why would she waste her wedding reception talking about you.", "These people don't treat you well. Stop being around them. NTA.", "It was her wedding and instead of enjoy it with her new husband she was badmouthing about you ?? Who do that ? \n\nNTA, she doesn't deserve a dime from you. \n\nI would recommend go NC with her.\n\nGood luck!", "NTA. You have this internet stranger's permission to cut your sister off. She brings no positive value to your life. You can be free.", ">”overcome my symptoms and be high functioning”\n\nWhat in the actual…\n\nYou are NTA OP. But your family sure is!!", "I'm so so sorry your family as a whole don't have your back. Being autistic is not a choice but not educating yourself and supporting your son/ brother most certainly is. My 13 year old daughter is autistic and there are plenty of family members who just don't get it. The difference is in my family me and my husband stand in front of her when they exhibit toxic behavior and we always ALWAYS tell her it's their problem not hers. If anyone tried to speak to her like your sister spoke to you they'd be in a world of hurt. Screw the lot of them my friend,you do you.", "NTA.  A person who takes the time at their wedding reception to go out of their way to talk smack on a guest has some serious issues which you don’t need to accommodate. Stay away from her and her incredibly toxic behavior.", "NTA... Your a adult, maybe it's time to draw the line in the sand or blow that bridge up.. There's no reason to allow ppl to disrespect you, just because their family", "Things you don't do at your wedding if you're actually happy\n\n1. Spend the whole time running down your family members completely umprompted.\n\nI can't imagine being so sour a person that THAT is what she chose to do with her special day. Her poor spouse! NTA", "INFO: are your boundaries/opinions/reactions always taking precedent over her boundaries/opinions/reactions? Growing up when there was an issue or argument within the family, did your parents/elders react in a way that favored one of you over the other?\n\nThis is a very defensive post that is missing a lot of information to make a judgement imo.", "I can relate. Try it with 8 brothers and sisters and to top it, have the joy of being the youngest. So naturally I'm NTA!!", "NTA. I would considering going low-contact, if not no-contact. \n\nYour sister is a moron to say the least. Telling you to “become high functioning”, like what the hell? Oh yes, let me just rewire my brain, no problem. SMH. \n\nI’m sorry you’ve been treated so poorly.", "Nta.  Go no contact with everyone who believes her. I went no contact with inlaws for a year ,best year of my life. Still low contact.", "NTA. Go no contact with her. Stop showing up to her events. Any larger family events, stay away from her, do not allow yourself to be alone with her (since she’s manipulative and like to lie) and ignore her-literally don’t speak/respond/look at her. Good luck.", "NTA, tell your parents that your sister is awful, and you have decided in your life you are no longer going to give gifts to horrible people.", "NTA. Block them all. Cut off contact with all of them. See your uncle separately.", "My advise. Succeed. I am not a motivated person and am also on the spectrum but spite is a hell of a drug. Succeed. Prove them all wrong and leave them behind you where they belong.", "NTA.\n\n\"Fuck off\" is an appropriate reaponse to her and your parents.", "NTA. Petty King and I Stan it. Go NC with these people. They clearly do not respect you.", "I'm sorry to say, but it was a mistake to take the gift back. It's not someone does, especially for a gift that is not an enormous one.\n\nIt made you look petty and disconnected, and whether her claims are true or not, everyone will now believe them.", "We ARMY don't recognize her as one of us. Her behavior goes against what BTS represents. Cut them all out of your life. You can go without all of that negativity and gas lighting in your life. - NTA 💜", "ESH. It is clear you were both nasty to each other throughout your lives and both like to play the victim.", "There are way too many missing reasons to render any kind of verdict.", "YTA. C’mon you tell a one-sided story of your petty behavior where you make everyone else out to be worse than you. \n\nAnd even if your sister did behave as you described YTA because you only went to your sister’s wedding because your “chad” uncle would be there. That’s asshole behavior right there. Go see Uncle Chad on your own time not at your sister’s wedding.", "ESH. Your sister was incredibly rude.  I get that you were angry and hurt.  Leaving was the best option.  Taking your gift back made you an AH too.", "I'll be downvoted for this, but ESH. Is she an AH - without a doubt. Cut her off as others have suggested. You're fine for confronting her and leaving. Your AH moment was taking back the gift. Once you give someone a gift, it's theirs unless it was given conditionally. You didn't say you gave it to her with any conditions, so you lost the right to take it back. So I'd say she is 95%AH but you're still 5% AH.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m 22 and finishing my fourth year of college in the fall. My sister is 28 and recently got engaged with her boyfriend of 2 years and yesterday was her wedding.\n\nFor some context, I really don’t have a great relationship with my sister. Throughout my life she’s essentially taken it upon herself to try to be my third parent and have absolutely zero compassion for my boundaries, the way that I feel, the fact that I am on the spectrum, and what my opinions are, always insinuating that I will never be successful unless I “overcome my symptoms and be high functioning” and calling literally every objection, complaint, and every reaction for being backed into an emotional corner “abusive” pushing my buttons and then playing victim when I snap back. Worst part is my parents completely endorse this behaviour much to my detriment and I just want to cut them all off.\n\nI originally did not want to go but my chad uncle would be there. Wanting to be gracious about it, I bought my sister a copy of BTS’s Proof anthology album as she’s a huge fan and was really happy about it.\n\nHowever, later on during the reception, I had heard my sister telling her friends about the various times that I “abused” and called her nasty names in response to her “trying to talk sense” which really were just thinly veiled character assassinations, saying stuff like “you can’t tell him nothing” and “he’s just not a nice person”. I wasn’t even talking to her, and many of these I had previously apologised for.\n\nI decided to stand up for myself and explain my side of the story, to which she was having none of, only doubling down on the rapid fire airing out of my dirty laundry whilst having the gall to complain about me “not taking accountability” and my “misremembered revisionist history”, I tried to stand up for myself and say that I was but she then cackled like a fucking hyena the moment I said that, and I really felt myself just getting mad, all the while she called me a narcissist, stuck-up, gaslighter, hypocrite, and a “ticking mistake bomb”. \n\nNot wanting to play her little game, I just up and left, picking up that BTS album when she wasn’t looking. I don’t drive yet so I took the bus home, stopping by the store I had gotten the album from to return it, which they swiftly refunded. All the while I was being inundated with texts and calls that I just couldn’t be bothered to answer since I was so mad, only doing so after I had gotten home and calmed down. Not only was it my parents asking where I was, but also my sister and relatives calling me selfish and sensitive for taking back a “gift that was already given” due to “being petty and butthurt” and apparently it’s something that you don’t do, especially at a wedding; their words, not mine. To top it all off, my sister left a voicemail saying that I only “proved her point again.” I feel I really cannot reason with these people so am asking here.\n\nTL;DR: Title.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "Nta. So proud of you!!!!", "NTA\n\nYour sister is awful. You deserve better. I feel like going NC will be amazing for your mental health and life in general.", "Nta. Your sister is a bully. A pathetic person actually.", "NTA honestly. Go no contact with her. She’s abused you all your life! Go no contact and you will be happier than ever!!!!", "NTA 100%  I hope that you can find a true family that loves and respects you for who you are.", "You can ignore her. No is a full sentence. You’re NTA.", "0", "NTA\n\nThese people sound abusive. I'm sorry your family sucks. \n\nSounds like you should apply everywhere (including *far* away from where you are) after you graduate college and just see where the world takes you ;) They're not worth sticking around for.", "NTA Cut her off. You don't need that crap. Send everyone this link and tell them to take a long walk off a short pier in shark infested waters.", "nope.\n\nyour sister is abusing you and your family is allowing it.\n\nyou are NTA.", "NTA", "NTA this genuinely made me sad for you. That was a thoughtful gift! I wish you the best op ❤️", "NTA, sorry your family sucks. Time to go NC with all of em. If they pitch a fit. \"Y'all think I'm a horrble person, so there's no need for this dance. I'm removing myself from the situation permanently. I won't trouble y'all with my presence anymore.\"", "Hey OP, do you need a new sister?  You sound like a very thoughtful sibling, I sure as shit wouldn't treat you like your family has.  You're NTA by a longshot, your sister and parent suck ass.  You weren't petty at all to take back your gift, you would've done yourself a disservice to leave it after how she was treating you.  Who has time to badmouth on their wedding day?!", "NTA block all of the toxic people in your life and stay away from them. You don't owe them anything", "I am sorry she is such a dysfunctional person and it seems she gets off on abusing you. Same for the rest of your family. I am a good bit older than you but I was able to network to a better job and moved several states away.\nMy life is so much better now and I would never go back\nHope you can disconnect and take care of yourself too love", "Families tend to appease the loud, selfish, shittiest member because they don't want it aimed at them. They'd rather you take it.  Go no contact when you can. Some people suck. Some families suck!", "Without knowing anything about why your sister doesn't like you, I know she's enough of a bi$#@ to spend her own wedding trashing a sibling. She's bringing that negativity into her marriage, and you're nta", "Yep. The girl's toxic. Work on yourself to be who you want to be and keep her out if your life. If your parents side with her you may need a vacation from them for a while. Strictly speaking one should not remove a gift once given but also strictly speaking one should not insult and demean another guest at ones' party. So I think you're even there.", "NTA - your sister is a bad person, I'm sorry she made you feel like she doesn't even care about you (she probably doesn't), those insults sound more like projections", "NTA As a member of BTS ARMY, I would be offended for someone like her to have that album. She doesn't get a $300 anthology of music about loving yourself, loving and accepting others, dealing with social pressures and mental illness. To then turn around and treat others, especially her brother, so horribly and weaponize therapy terms. It's just disgusting.", "Tell her why would she want a gift from an “abusive, narcissistic and self absorbed” person? Geez at this point i think you are better off", "NTA. I would’ve kept the album for myself. Might as well get some good photocards💁🏽‍♀️. She sounds like a chore.", "I really don’t talk to her all that much and if I do it’s because I’m dragged to an outing where she will be and don’t want to “sour the mood” by ignoring her or so to speak.", "They do", "BTS would not approve of her behavior", "An uncle who is a \"chad\", ie. a great guy. A paragon of a man.", "A chad is essentially an absolute great man to have in one’s life, who’s selfless and whose manliness is a benefit rather than a detriment. This uncle loves to discuss programming since it’s something I’ve done plenty of in uni.", "Imagine the staff working there, the in-laws, everyone privy to the weirdo rant of the bride - seriously, nobody who heard her would have been surprised that a quick escape with a gift happened. And the best gift was left: bride now has a wedding she ruined herself.", "\"Just stop having Down Syndrome, Louise! And you, Mike, get rid of that albinism. Jane, I need you to stop having type 1 diabetes. Just go to the right counselor, eat enough kale, and visualize hard enough.\" 😫 can I start a GoFundMe to launch OP's family into the sun, with sister strapped to the nose?", "Yeah I know it’s super sus and fucked", "If you spend your wedding day saying negative shit about your brother in stead of enjoying your day, that's a pretty big indicator to me about who you are as a person. \n\nIf I am a guest at a wedding and I hear the bride trash talking me, I'm out. I might leave the gift if I'm feeling gracious, but there's no obligation. \n\nNTA OP, you sister should have been more classy.", "No, my boundaries often caved to theirs, and it always tended to sway in favour of my sister.", "Not asking about the dynamics themselves, am asking how I responded to this iteration of it", "... what?", "You must be one of her friends", "Read back what you wrote line by line.", "If OP is talking about the collectors edition proof albums its well over £600! They're well within their right to take back a gift from someone who spent the entire time insulting them. And even if it was the £20 album, they can still do as they like. Is it petty? Yes. But are they an AH? Absolutely not", "Ignore all of them, my guy, not just her. Your entire family is in on it and is equally as complicit because they don't step in and, in fact, seem to approve of the dynamic.", "Don't talk to her anymore. It's amazing to me that this is what she was discussing at her *own wedding.* You'd think she would have better things to think about and talk about at her wedding. I know I did.", "I’m so sorry this is how your family treats you. I hope you find some freedom, and formation of who you are by going NC/LC with them. You deserve better.", "I'd suggest reading up on grey rocking for these occasions. And start Lisa Simpsoning when it gets too bad: buy yourself a stress ball and every time your sister pulls this crap (and your family does nothing about it) just find a quiet corner, squeeze the ball and repeat, \"only X more months, only X more months.\" Then graduate, find a decent job, get your own place and cut them off. \n\nTo put it bluntly (as a fellow autist, I know you'll appreciate that! 🙂) your family has established a deeply, fundamentally unhealthy dynamic surrounding how you and your sister interact. Everything you write indicates they are completely unaware of the toxicity of how you're treated and expected to respond to that treatment. And as such, they're currently (possibly permanently) unable to address it. Tolerating it long enough to establish a solid foundation for your future, then separating yourself from them/the emotionally abusive situation they've immersed you in, is pretty much your best option. It will either force them to recognize what untenable circumstances they forced on you, or at least get you safely away and leave them with no one to vent their spleen on but each other. \n\nGood luck, OP. Never doubt that you DO NOT deserve this treatment, and you can do better. Get yourself some queer friends if you can.  The community as a whole is much more accepting of people who \"act weird\" without hurting anyone. And considering there's as much as a %60 overlap between queer/neurodivergent people a bunch of them will probably have autism/ADHD too! \n\nBig hugs, internet stranger. I'm rooting for you. Update us if you can!", "Sour that mood every chance you get. Let them know ahead of time that you’re going to sour the hell out of the mood every time they try to “force” you to be in her presence. Talk about how you can’t wait for her to start her act so you can get back at her. I’m sure your family will be happy with you not being there after you “sour the mood” a few times. NTA.", "OP, I wouldn't piss on those people even if they were on fire. Just cut those human tumors out and go live your best life and don't even look in the rearview mirror.\n\nNTA", "your whole family is supporting your abuser and complicit in the abuse. please think carefully about whether these people are safe to be around. based on the above story, they are not.", "NTA but go no contact and at least low contact with your parents.\n\nAnswer them the wedding bis also not a place to bash you and insult you it should have been her day to celebrate her union with her husband.", "OP, I spent years not souring the mood and all I got from it was more torment. I felt so guilty even thinking of cutting that cord but once I did it was incredibly liberating and I could finally breathe. Don’t subject yourself any longer than you have to. Family are those who love you, not those who treat you like this.", "You are 22 and she is a classic narasstic person and has everyone fooled. Go no contact. I promise you it's the best thing ever. A hard choice to make but when you do the stress of dealing with them is gone and it's like a weight is gone. I don't miss the people I left behind at all.", "I though Chad was an insult not a complement.", "Call the uncle and meet outside the family op", "You went to the wedding b/c you wanted to see him and I get that, but it didn't go well for you, so i wonder: do you feel very eager to talk to him and don't have enough chances to? If he's as great a guy as you say, he might respond well to a request to keep in touch regularly (especially if you tell him what you appreciate talking with him about), like say a scheduled phone chat every other week or once a month or whatever he has time for. It seems like you need positive family interactions in your life and aren't getting them from your immediate family, and he probably either knows that or at least would care if he did know.", "I know functioning labels are fucked, but I’m appalled that your sister is calling you “low functioning” when you have a university education. Does she define “high functioning” as “completely not autistic at all” or something?\n\nOr is she just an abusive narcissist who would always find something to try to make you feel shit about.", "That’s why we need more info! Yes, the bride should not be focusing on OP during their day, but a lot of posts similar to this conveniently leave out a history of golden-child behavior or inappropriate actions that Big Sis just had to deal with. Did something happen at the wedding? If OP is looking for 0% questions or pushback, r/offmychest is the better sub for this.", "You must be the chad uncle", "It's less petty, and more like being a justified asshole. Sometimes being an AH is justified, but that doesn't mean you're not an AH.", "Yeah definitely go NC with the lot of them. You'll feel so much better.", "Can confirm. This is so similar to my family dynamic. When I finally went no contact with my sibling it was like a weight had been lifted. It’s not an easy thing to do, but it truly did change my life", "It can be, but the more mainstream usage seems to be as a compliment.", "Depends on if the person saying it is a participant in incel culture.", "Chad is only an insult if an incel uses it", "Aita is also a sub where we have to assume the OP is being truthful. Assuming OP was minding his own business, I stand by my point. \n\nEven if just yesterday they were fighting like cats and dogs, a wedding is not the place. As the saying goes: don't start nothing, won't be nothing.", "<Aita is also a sub where we have to assume the OP is being truthful.>\n\nWhen did this happen????", "Common sense? We can try to read between the lines and to point out when things aren't adding up and ask for additional info, but if we don't assume that the OP is at least trying to be honest, there's no point in engaging at all with any of the posts.", "YTA\n\nReading between the lines it sounds like you were abusive, that you refused to work on yourself, and calling your uncle a chad… what is that about?\n\nProbably you would both be better off if you went low or no contact", "NTA play the game back at her my friend.  Anytime she tries to engage them just say “I know how angry and emotional you get whenever we talk so it might be best if we avoid any conversation right now”. When she inevitably tries to respond that you’re the actual problem then you just respond by saying “see you’re already getting over emotional” when you’re parents try to take her side just say “you guys are all acting too sensitive and you need to calm down and control your tempers”.  The real trick in all this is that have to stay completely calm even when they try to say things to make you angry.  When they try to bring up things you’ve done in the past just calmly say “calm down” your being too sensitive” “that was a long time ago” just don’t try to defend against the accusations.  Focus on telling them to calm down and stop trying to cause conflict.  You may want to practice role play this with a friend because they are really going to do their best to get you to go on the defense or something.  You gotta practice and prepare in advance.", "Sister is crazy", "I would just retaliate and be like what would “*insert BTS member* say if they saw your behavior?” Hit her where it hurts. As an ARMY myself I would use her bias 🤧", "NTA. \n\nThey obviously have less than zero interest in hearing your side of things. So don't tell them anymore. \n\n\"We don't do that at weddings\"\n\nWell, we also should not be gossiping about people at weddings either, but hwre we are!", "NTA but go NC with your sister. That way she won’t be exposed to your evil “narcissist gaslighting abuse.” I would use her exact words when you explain to your parents that you are done being around her (explain in a text or email.)", "NTA I think\n\nYour sibling isn’t entitled to the gift. \n\nLook…..I have a sibling dynamic a lot like yours and it sucks. Unfortunately, defending yourself is never going to go well. :( They’ll just use it as further “proof” that you are horrible. \n\nYou really aren’t horrible and you deserve to be happy. \n\nI haven’t really spoken or been around my problem sibling in about a year and I feel so much lighter. I’m not as anxious and I don’t feel constantly judged when I’m around the rest of my family now. If you can find a way to lower your contact with your sister, I think you may find a happier life. \n\nIt’s neither an easy road nor a quick road. I’m still working on healing.", "NTA, and go NC with her, and your parents.", "NTA, and from a fellow person with the tism and an analogous although less publicly intense situation in her past:\n\nYou are not obligated to keep in contact with any of them.\n\nThey are not keeping in contact with you.  They are keeping in contact with the person they want you to become, and treating *you,* the person you actually are, as an annoying obstacle between them and the son or brother or what have you that they really want.\n\nOr some of them may be keeping in contact with you because it's important to their narrative that they always have something around that they can be superior to, and they have decided that your differences from them are the thing they will be superior to.  In that case, they still don't value *you.*\n\nYou can leave all of them behind.  You don't have to tell them you are going.  Just ghost 'em.\n\nAlso, go you for getting your bachelor's early!  Well done!\n\nETA:  On rereading, I am leaning more toward the second explanation I posted above with regard to your sister in particular.  Note that on a day that is supposed to be all about celebrating her *happiness* she had to trot out all of the crap she says about you.  Within earshot of you.  Guess it makes her happy, huh.", "NTA. She is so abusive. Your parents are her enablers. OP you really should think about going NC with them all especially with your toxic sister.", "Your instinct is right! Move one and cut them all off! NTA", "NTA... I have the same relationship and dynamic with my family. I'm surprised how many other families experience this!\n\nGrowing up I thought it was \"normal\" and something I had to live with. As I grew into an independent adult with my own autonomy and observing other truly normal families, I realized how insane the situation was. I went NC with pretty much all of them and life has never been better!\n\nBest of luck to you OP. Keep fighting the good fight. Believe in yourself, break the cycle and live life to the fullest!", "NTA OP.  If they can’t get why you’re so upset, then perhaps it’s time to go completely no contact with the lot of them.", "Cut her out of your life.", "Is it me or 90% of AITA are wedding drama?", "NTA cut them all off", "NTA - I would cut them all off. They obviously care nothing for your boundaries. I cut off my brother years back for abusing my generosity. The only reason I haven't cut off my mother is because if I do I won't be able to see my dad who is currently fighting 3 different cancers. Just because they are family doesn't mean you have to put up with their toxic behaviors. Good luck!", "NTA, cut her out of your life. If she cries about to family, tell them “the bitch liar should be happy. She clearly made problems with me.”", "NTA. Block her completely. And look up the \"grey rock\" method. She's trying to get you upset, that is her goal. She gets off on it. Grey rock will give you strategies to deflate her efforts.\n\nMy SIL is like your sister. Cutting her out and grey rocking her on the rare occasion we do see her has worked really well. Life is so peaceful witout her in it. You can do this.", "ESH, yes, your sister sucks but that just mean that you have to cut her out regardless of what anybody else in your family thinks or says.\n\nBut I agree with your family in that \n\n> taking back a “gift that was already given” \n\nOnce a gift has been given ownership is transferred, in this situation once you put in on the table it was \"given\" and you can never \"take back a gift\" as once you give it, it is no longer yours.", "Man, cut ALL these people off. You deserve better than this!\n\nNTA", "Every time she starts talking at you or about you just let her finish while looking confused and concerned with that awkward silence  moment and the then calmly ask are you ok? And walk away", "NTA. Send out a social media blast pointing out that her supposedly being 'kind' and trying to point out problems and her calling you abusive for simply not agreeing with her decided to spend her wedding party, literally the day focused entirely on her and her best day where everyone is focused on her..... shit talking you to her friends for absolutely no reason. They can figure out who the abusive one is for themselves, but it's never the one who shittalks family behind their back for no reason, it's usually the one that decides to take time out of their own wedding to attack family members unprovoked.", "You are right that you can't reason with her, or them. So you might as well stop trying.  Only have as much contact with your sister as is absolutely necessary since having her in your life adds nothing to your life.  It doesn't add happiness. She doesn't help you. She just seems to live to put you down and make you feel bad... so why would you want to deal with her anymore?\nShe did have a point about not taking back presents... it's generally a rather rude thing to do.  Then again, what she did, and what she always does, is at least as rude as what you did.  NTA", "NTA\n\nYour sister has mastered the art of D.A.R.V.O. and will never take accountability, she will always use you to prop her up, and the family will always believe her story over yours.\n\nMy honest opinion? Throw the whole family out. Tell them that if they're completely ok with her spewing lies about you, framing you as a beast, and mistreating you than you don't need them, you don't need her, and you are checking out on them. I'd recommend switching numbers and moving if you're able.\n\nIt's hard to go it alone, but sometimes to thrive you need to remove the elements dragging you down, and that sounds like everyone with a blood connection at this point.", "NTA. I agree, she doesn’t have better things to do at her wedding ?  I can see where you are coming from.  Block her out of your life.  I’m sorry you don’t have a better sister.", "NTA gl in life", "This feels familiar to what my own family can be like.\n\nI don't know why boundary stompers always end up genuinely thinking they are the victims when someone gets upset about said stomped on boundaries.\n\nMy advice, go LC and they moment the start trying to cross that boundary just let them how you've already told them not too and if they can't be respectful then you'll leave (or don't, I just happen to believe in giving warnings). If that doesn't stop them, don't argue ( that's the trap they use to uno reverse the blame back at you), and just leave.\n\nEither they will learn, or you go from LC to NC.\n\n(I mean there is also always playing their same passive aggressive mind games in public, but most of us on the spectrum aren't really great at those and it tends to backfire)\n\nNTA btw.", "NTA. trash people need to learn not to talk shit about the people that give them shit. you were right in taking it back. i would've too. great job op.", "Does she not like her husband very much that she chose her wedding to s\\*\\*t talk about you than to dance and be with him? Or even just get the positive attention that brides usually get? She just seems awful and BTS would never approve of her behavior! LOL. Seriously though, NTA.", "Do you live with your family? If yes plan to get out as soon as you are able. If not and you do not rely on them for anything, go NC. I'd you are still at home get all your legal documents in order. You do not need to tolerate emotional abuse.", "a narcissist calling someone a narcissit. is that ironic or what? NTA", "ESH \n\nWhen you overhead her talking shit about you, you should have just asked why she would spend her happiest day reminiscing shit about you?\n\nIt's well known that a wedding is high stress and lots of emotions, it's not the greatest moment to try to solve old problems. You just don't pick a fight with the groom.\n\nYou did right by removing yourself from the situation but should have done it sooner. And you don't take back a gift, it's just childish.", "NTA. Move far away and cut everyone off. Your life will be better.", "What brought about all that ranting at her wedding?", "It’s sad, but the truth is you don’t have to like your family or put up with their crap. They won’t change, and so while it might be painful to cut them out, it will free you in the end. You might have regrets, but if staying away\nFrom them will help keep you in place of peace, you must do it to preserve yourself.", "What a sad human you have as a sister.  \n\nOn HER DAY, she engages in a conversation to a friend about you in ugly terms.  Why was she even focused on you? And then is surprised when you took back your gift.  Really, really sad.  \n\nShe obviously has more problems than you ever will.", "NTA\n\nJust post a message on social media about disowning your family and start blocking them everywhere.\n\nThis way, the world knows what happened.", "cut them off", "NTA. Family doesn’t start or end with blood. Cut them out of your life completely.", "I'm torn, N T A for leaving when you're not wanted, but as others pointed out, there's not enough i n f o. You're also not saying that your sister was lying about events.\n\n> whose manliness is a benefit rather than a detriment.\n\nThat statement alone gives me enough ick to think ESH, your sister should refrain from gossiping at her own wedding. But clearly you did enough for her to have plenty to gossip about", "> I only \"proved her point again\"\n\n\"Dear AH sister, that's right. As I now understand will never be good enough in your eyes, I've decided to accept myself for who you say am. I am not a nice person, so no, I don't give gifts. And no, I don't care how that makes me or the rest of the family look, because I don't take accountability for anything. I'll also clearly explain to anyone that asks why I left early and took the gift back, because again, I just don't give a crap.\n\nI look forward to hearing more about exactly what you think about me so that I can lean into that too.\"\n\nThen go and live your best life. Ace college, get a job somewhere not there and find your tribe. They're out there. I found mine when I stopped trying to live up to everyone else's expectations and focused on what I enjoyed doing.", "NTA. I wonder if it would be helpful to go to a counselor with your parents to talk about the situation so that they understand why they aren't being supportive of you.", "This is one of those cases i would love to hear the other side of the story", "nta", "NTA and CUT THESE PEOPLE OUT OF YOUR LIFE. They are not good to you", "NTA, you need to cut contact with your sister and parents.", "Why is taking back the gift petty? Sister certainly doesn’t deserve it. Genuinely asking", "I agree. My first thought was that the sister could resent OP because as the older NT sibling of an ND person they may have been parentified at a very young age.  OP says that their sister acted like she was his third parent. Was that her choice or was that a role forced upon her by their parents?\n\nIt also seems off that the sister just randomly was ranting about OP to anyone who would listen. Something is absolutely missing here.", "No.", "I think an implied condition would be that you aren't personally insulted at the wedding you are just acting as a normal guest at.", "Lol nope.", "Get a new phone number friend. Be kind to yourself.", "Hello fellow scapegoat. Learn your destiny, detach,, live your life and find joy. You need to break bonds, be gracious, don't play or play into their games. You are stronger than you realize.", "Next time you find your self in this position, just keep responding ‘Sure, JAN, whatever you say (add occasional eye roll)’.", "NTA. You aren’t obligated to give a present to someone that is as nasty as your sister. In fact it was an honest reaction. I wouldn’t have contact with any of them. You might want to text that you just didn’t understand how terrible your sister’s life is with you in it. Therefore in the name of brotherly love you will stay out of her life. If your parents or other relatives give you grief they can get the same text. I would like to think that your parents were worried when they didn’t know that you had left and they didn’t know.", "She invited you to her wedding just so she could make fun of you in front of her friends WITH YOU PRESENT. She's an absolute waste of space on this planet and doesn't deserve another second of your time or passing thought given to her miserable existence by you (or anyone else for that matter, but you can't save everyone.)", "Tentative suggestion; deliberately \"sour the mood\" and generally make it as unpleasant for them to drag you to these outings as possible, then they'll hopefully stop making you go. Become the asshole you need to be in order to protect yourself! (Obviously don't do this if you do actually want to maintain relationships tho)", "I think you and I have the same sister …. Your not the narcissist…. Your sister is.  NTA", "Ignoring her is less souring to the mood than talking to her", "But other BTS fans would, because someone else will get the 'gift'.", "Taking back a gift already given is a petty move.\n\nI wasn't saying the sister deserved the gift; I was saying the sister deserved to have the gift taken away.", "> whose manliness is a benefit rather than a detriment. \n\nYeah no, manliness sounds ick.", "I don't think it made him A-H at all but I do think leaving the gift is an easy way to show who is really the bigger person in a debate like that. \n\nI mean, so like if the sister hates OP why is she mad he even left? So I totally get why OP returned the gift but personally I would just eat the loss as an extra fuck you tho really lol", "And get some therapy to figure out why he puts up with the abuse, he’d probably feel a whole lot better about himself if he got away from that and dealt with the abuse.", "The DARVO displayed says complete narcissist to me... from my keyboard eith Google 😉", "OP stated in his post that his parents approve of his sister's abuse.  He is obviously not the golden child.", ">why is she mad he even left?\n\nBecause OP took free stuff when they left. Or because her favourite punching bag was gone.\n\nThat's all I can think of. Either the loss of free stuff, or because she could no longer point to OP and gossip with her friends.", "Actually on this sub it does.  \"Justified AH\" = not in the wrong = NTA here.  Check k the FAQs, I think that's where it's explained.", "She wasn't talking with OP, op decided to drop in on the conversation. OP also mentioned having apologized for things they had done, making one think that they believe as soon as they apologize slights / faux pas/ etc... against others aren't of consequence anymore", "If you think OP is lying you're supposed to report it as a shitpost and do nothing else, eg don't call out the OP for lying.  You can also report it for not portraying the fight in an unbiased manner (I forget which option it is). But again,  no challenging the OP.  Just report and move on."]}