{"id": 26480, "submission_id": "16dhnk3", "title": "AITA for keeping my ex's dog until she pays me.", "selftext": "His name was ridiculous so I renamed him Dog. It was what I called him for three years before my ex left. \n\nMy ex broke up with me but left her dog because her new boyfriend's apartment didn't allow dogs. \n\nDog was okay so I let him stay rather than take him to a shelter. Dog got me up off my ass walking and getting outside. \n\nDog got sick about six months in and needed surgery. I called her to let her know. She said she didn't have the money. I told her if she sold me Dog I would pay. I bought Dog for $1 and spent $2,400 on his surgery.  \n\nDog is healed up now and it's been two years. Ex is living with her parents and wants dog back for $1. I said no problem just pay me for his surgery. I won't even charge you for dog-sitting for two and a half years. \n\nShe says I'm being an asshole and I am only keeping him to hurt her. That's why I didn't just surrender him when he got sick I guess.", "created_utc": 1694196486, "permalink": "/r/AmItheAsshole/comments/16dhnk3/aita_for_keeping_my_exs_dog_until_she_pays_me/", "score": 367, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My ex left her dog with me. I paid when dog got sick. Now she wants dog back. I might be the asshole for expecting to be paid back for expenses regarding Dog.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYou own Dog at this point. You have paid for vet bills, you (I assume) have kept up with his vaccinations. \n\nI wouldn't even offer dog back for payment of the surgery bills. He's your dog.", "NTA \n\nthat's your dog now and you can charge whatever you want", "NTA.  Ex abandoned Dog 2.5 years ago.  It’s not her dog anymore.", "NTA.  This is your dog.  She gave you the dog.  It's that simple.  \n\nIt would be very irresponsible for you to give her your dog because you know she can't afford him.  If she breaks up with her current boyfriend and again has nowhere to live, what is going to happen to Dog?  It's cruel to rehome animals when they're attached to people.\n\nDon't give her Dog.  This is 100% your dog and you have proven very clearly that you are a responsible, loving owner.  Someone who can afford to pay for medical care and is willing to and who is willing to step up and take responsibility like you did when she left is exactly the kind of person who should have a dog.  \n\nStop responding to her messages.  She abandoned Dog and you both agreed that Dog is now yours.", "NTA. It’s your dog and even if she get the money, you shouldn’t sell him to her because clearly she doesn’t know how to take care of her pets.", "Two years?  Dog loves you; Dog is yours, sounds like you also love Dog.  Nice basic name BTW \n\nNTA", "NTA. Everything else aside, like the surgery and the money you paid to care for him, Dog has been in your home and your care all this time. It would be unfair and cruel to Dog for him to suddenly be sent to live with someone else and essentially be abandoned again.", "NTA she made the deal.  Even if she had no other choice but to, its clear she doesn't have the funds to properly care for it anyway.  Pets aren't silly little animals that can be neglected the moment they become unaffordable, they are a chosen responsibility.", "NTA. He’s your dog now. If you don’t have him chipped showing you as his owner, do it in case she tries anything. She has no right to demand you sell him back to her after going above and beyond to take care of him all this time.", "NTA.\n\nSounds like your ex can’t afford a dog and is not responsible enough to own one.", "NTA. Dog is your dog now.", "it's your dog.  NTA", "NTA. A sale is mutual and both parties have to agree to the price, otherwise you're not obligated to sell. Period. Doesn't matter if it's a dog or anything else.", "NTA\n\nShe was selfishly willing to put herself in a situation where she couldn’t keep the dog. And she didn’t make any moves to reunite with her pet for two years? No.", "NTA. That is your dog now.", "NTA \n\nShe doesn’t deserve Dog. She abandoned him.", "NTA but don't ever give Dog back to her, unless you truly think he'd be better off with her. It sure doesn't sound like it!", "*My ex broke up with me but left her dog because her new boyfriend's apartment didn't allow dogs.*\n\n&#x200B;\n\nSounds like a mind made up.God bless.  Bye.  \nYou shouldnt have asked her for money but she still doesnt get the dog.", "She abandoned Dog. You cared for Dog. You paid for Dog's treatment. Dog is yours. Keep him, or don't,  but don't hold him hostage over money. That's the part that makes you TAH.", "NTA... that's your dog now!  And would you really give him up if she happened to come up with the money??", "NTA You are the better dog parent. He's yours now.", "You own the dog.\n\nNta.\n\nIf he has a chip make sure it has your details on it or she may be able to gethold of him again.", "I like the deadpan story telling. Also NTA. I bet Dog Likes you better anyway.", "NTA. This isn't ex's dog, it's yours. Block her and move on.", "NTA. Also, love the name Dog!", "NTA. Obviously you and Dog have bonded at this point. Seems mean to Dog to give him back to someone who isn't committed to keeping him.", "Dog is your dog now Dawg.", "NTA\n\nDog is your fam now.", "NTA. Of course you're not the asshole, unless you do give Dog back to the ex. But she's never going to cough up the $2400. He's your boy.\n\nOh, and you may be a little bit of the asshole if you don't pay the dog tax. It's common Reddit knowledge.", "NTA. Dont give her YOUR dog! \nAlso funny side note in New Zealand there is a famous cartoon called Footrot Flats. One of the main characters is a dog named Dog, he was raised at owners aunts place with cats and is so embarrassed by the name she gives him he will physically stop her from saying it, we never find out what it was. The similarities made me lol", "\"My ex broke up with me but left her dog because her new boyfriend's apartment didn't allow dogs.\"  \nIt's like she's dependend on bfs to be able to take care of her dog.\n\n  \n\"She said she didn't have the money \\[for her dog's surgery\\] .\"  \nMaybe she shouldn't have a pet as that's the second time she couldn't care for him.  \n\n\n  \n\"Ex is living with her parents and wants dog back for $1.\"  \nIt's not her dog. She sold him. It's your dog. Why would you sell your dog?  \n\n\nNTA  \n\n\nStill: Ask yourself if you - maybe just a little bit - are keeping him to hurt her. ;-)", ">She says I'm being an asshole and I am only keeping him to hurt her. That's why I didn't just surrender him when he got sick I guess.\n\nI was pretty confident about N T A until I read this, Dog is yours now and you are not obliged to give Dog back for any price. I don't get the sale for $1 because Dog was yours when your ex left and left her dog behind.\n\nBut this last sentence sounds like you kept Dog out of spite or some vague idea you might get back together, and that is an AH move.  \n\n\nEDIT TO ADD: I didn't read that last sentence as sarcasm, somebody else pointed that out and I see it now, so NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHis name was ridiculous so I renamed him Dog. It was what I called him for three years before my ex left. \n\nMy ex broke up with me but left her dog because her new boyfriend's apartment didn't allow dogs. \n\nDog was okay so I let him stay rather than take him to a shelter. Dog got me up off my ass walking and getting outside. \n\nDog got sick about six months in and needed surgery. I called her to let her know. She said she didn't have the money. I told her if she sold me Dog I would pay. I bought Dog for $1 and spent $2,400 on his surgery.  \n\nDog is healed up now and it's been two years. Ex is living with her parents and wants dog back for $1. I said no problem just pay me for his surgery. I won't even charge you for dog-sitting for two and a half years. \n\nShe says I'm being an asshole and I am only keeping him to hurt her. That's why I didn't just surrender him when he got sick I guess.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA\n\nShe is treating Dog like an object.", "NTA, but guess who is. Not Dog either.", "NTA. Dog is yours after all this time.", "NTA, re-homing an animal too much is really bad for it.", "She sold you the dog. Of course NTA. It is not her dog anymore.", "You will/would be TA if you give her \"your\" dog. Dog is bonded to you, and she's proven she's willing to just leave him behind when the next man comes along. Tell her he is yours, and she can pound sand.", "NTA. She abandoned the dog to your care and you took care of him, paid for his surgery, walked and fed him. Even though you're being a bit flip about it I think you really care for Dog. She doesn't deserve the dog. Dogs aren't a convenience that you only want around when it's easy for you. He's your dog now, regardless of the $1.", "NTA \n\nAnyone who will give up their animal to move in with another person doesn’t deserve that animal. Animals are considered property. You purchased the property and it’s yours. Tbh it concerns me that both you and her are willing to just give the dog up if the money is right. I’d risk my life for my animals but I understand that’s not everyone’s normal.", "NTA\n\n&#x200B;\n\nWhy would you let your ex have YOUR dog?\n\n&#x200B;\n\nTell her the price is the medical costs + support )food, ...) for 2,5 years.", "Yeah, NTA. He's your dog now. Where was all this concern for Dog two years ago?", "NTA. Dog is your dog now, and your ex is too irresponsible to be trusted with custody of a plastic houseplant.", "NTA.", "NTA please don’t give Dog back.", "Dog is yours now.  Period.  Don't give him up... even for $2400.\n\nOr not even for $2400 plus dog-sitting.  Plus food.  And ALL other costs.\n\nShe's demonstrated before that dick was more important than Dog.  She'll do it again. \n\nNTA.", "That’s your dog.  She’s TA for abandoning the dog and expecting it back. That’s how people treat their kids so good thing breaking up. Had she checked in more and asked around the time of surgery and explained she wanted him she just needs to get on her feet and would pay you back I’d understand. Looks like she just sees you both doing better and causing disarray", "NTA\n\nYour ex is a female dog for abandoning Dog, selling him to you for only $1, demanding him back for only $1 without considering medical and caretaking expenses, and guilt tripping you for taking care of Dog. If she already only values Dog’s life as $1, then she is unfit to take care of him.", "NTA.  You saved your dog.", "NTA. Dog is yours now. She obviously cared more about her new boyfriend than Dog. Eff that AH, I wouldn’t give Dog back even if she paid me $5000. Have him microchipped and lost you as his owner", "She sold him to you, NTAH.", "NTA.\n\nDo not give up Dog like she did.", "NTA. in fact, if you give her back dog knowing that she doesn’t have the funds or responsibility to take care of dog, that would make you TA (at least in the eyes of the dogs well-being)", "It's really unkind to take a pet from his home and person after over two years.\n\nI am certain you and Dog have bonded and have a fine time together.\n\nNTA", "YTA only because you even considered selling the dog\n\nThat dog needs you, the person that cares, it's your property now. Close the door, never talk to your Ex again. Be happy you have a furbaby.", "Lol. NTA what are you still talking to that clown?  Honestly, dude. Block her ass!", "Yes, Dog is better off with OP too.\n\nNTA", "He shouldn't be selling the dog back at all at this point. It'd be bonded to him by now.\n\nIn fact selling it would make him TA.", "The quoted text is sarcasm. He *didn't* give the dog up to a shelter, which changes the meaning of the sentence. OP genuinely cares for Dog, and is citing vet bills as evidence of his personal attachment.", "I took Dog to the vet because he was sick. I have not thought of my ex in a year or longer.", "Maybe he’s trying to be concise, but it does read like he wants to spite his ex. Whatever decision is made should be in the best interests of Dog.", "Did not read it that way at all\n\nMakes sense to me so I’ll vote NTA", "NTA, but you would be the AH if you took $2400 in payment for him. He is your dog. Your gf has already demonstrated that she does not take pet ownership seriously.", "NTA for this, but TA for renaming the dog when it was technically hers just because you didn’t like it, and for “dog was okay so I let him stay rather than take him to the shelter”. Three years and he’s just “okay”? I mean, I hope you think he’s “more than okay” now.. Also, why the option of a shelter? Surely, if you DID choose not to keep him, you would rehome him yourself, so as not to traumatise him and make sure he went to a good family? \n\nSo no, NTA for the reasons you think, but kind of an A for others. Just my opinion", "NTA", "NTA. I hope you Continue to be a good owner for dog, your ex clearly isn’t", "Its not fair to Dog--what if Dog becomes ill again ? Will she have saved the money to care for him ? She did not offer to pay the first time--I doubt she would if it recurs ..NTA", "Did you put everything in writing when she sold you Dog? Only asking in case she makes this into an issue and takes it to court. She has no right to this animal. You have done right by Dog and spent your time and money caring for him. What has she done? Nothing....so that's what she gets.....nothing!", "That’s ridiculous. NTA", "It's your dog now dawg. Nta.", "This thread has given me semantic satiation to the nth degree\n\nDog\n\n(Nta Dog is yours)", "NTA! Dog is yours.", "Your \"Dog\" wouldn't be alive if it were up to your ex!   Dog is yours to enjoy and spoil 😀", "Dog is yours now.\n\nYou're not a dog, so you'll keep Dog, and she's a dog for trying to steal Dog away from you, doggone it!\n\n:-D", "NTA, she gave you Dog for a dollar (that had me dying bro, a dollar) so it’s legally your dog now, that’s how money transaction works, she wasn’t renting Dog to you, she was selling Dog to you, that’s how selling something works, so Dog is now rightfully yours. Set a deadline she should pay you by or you won’t sell Dog back to her. You should go to the vet or wherever you have to go to so you can get the papers for Dog if she doesn’t pay you by the deadline you set", "Nta having a pet is making a commitment. You can’t pick and choose when it’s convenient to honor that commitment. Dog is yours because you stepped up.", "NTA and definitely Winston Bishop/Ferguson vibes. IYKYK", "NTA but if you want Dog, you should keep him.", "Plus she only has this option because OP chose to keep the dog instead of taking it to a shelter. Had OP done that there would be no option for ex to come back 2.5 years later and ask for the dog.", "Are you serious about thinking OP just thinks Dog is okay after he spent $2400 on surgery???"]}