{"id": 26578, "submission_id": "16er2f5", "title": "AITA asking for a $1400 refund on my friends Airbnb due to heavy wildfire some?", "selftext": "\nBack in June my friend said to pick a weekend and we could stay at her dads family cabin. She made it sound like it would be free but ended up charging us the nightly rate he charges on air bnb, which I thought was understandable. So we paid $1400.\n\n 4 days before the trip, I was told there was heavy wildfire smoke and with my mil health, she might not be able to go if it continued. That day I texted my friend about what their cancellation policy was. She told me it was to late and I would receive no money back. Luckily the smoke stopped and we continued with our trip. \nHowever, the day I asked my friend for their cancellation policy, I also viewed their house on Airbnb to see the cancellation policy and it said they allowed 5 day cancellation at 100% and 50% until day of. I was honestly hurt and felt lied to about it and started to kind of distance myself to her. \nAbout a week later she asked what was going on and I let her know I was hurt and felt lied to and she admitted that she lied about the cancellation policy because she didn’t want to be out money. \n\nA day later she is furious that I would be mad that she lied to me and feels like she instead had every right to lie and be mad we would ask for a refund because in her words “ if your mil is concerned about natural fire smoke, she shouldn’t travel in the summer at all.” We have been going to this resort the last 3 labor days and never had a problem with smoke. She also said her dad was doing us a favor by allowing us to stay there but in my mind we did him one because he wasn’t charged the air bnb fee.\n\nAITA and out of line to expect to be treated with the same courtesy they give strangers for cancellation? Frankly I would have just booked through air bnb so we could have insurance for situations like this. I didn’t really imagine I would need it when it’s between friends.", "created_utc": 1694321321, "permalink": "/r/AmItheAsshole/comments/16er2f5/aita_asking_for_a_1400_refund_on_my_friends/", "score": 53, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. AITA for asking my friend for a refund on her air bnb due to wildfire? \n2. I might be an asshole because she would lose money\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your friend is being really shady here. When she made the initial offer, she didn't tell you about the fee. Then, she lied about the cancellation policy. On top of that, her dad is skirting Airbnb's policies to take advantage of his daughters' friends. When you confronted her, she tried to turn it around on you. Her dad wasn't doing you a favor at all, and neither was she.", "NTA her dad didn’t do you a favor at all… you just rented his available Airbnb. A favor would’ve been letting you stay there or at the LEAST give you a friends or family discount. The fact that she lied when the policy was right there online is shady af and not what a real friend would do", "I have a feeling she pocketed the money and the dad has no idea", "I have news for you. That is not your friend", "NTA.  If a friend treated me like that, they’d be an ex friend shortly after.", "NTA Put a review on your \"friend's\" bnb about the false cancellation policy.  Mention that you would never stay there again.  You were a guest, and have the right to post a review to warn her other\"friends.\". \n\nAll businesses deserve the review they have earned.", "Surely you mean ex friend? This would be it for me. NTA", "I bet she pocketed the money or at least some of it and said you wouldn’t get any money back because she already spent it. \nAre you able to talk to her dad and ask about the rate?\nNTA and I wouldn’t keep her as a friend.", "Technically since you stayed there I would go on there and write a review about your stay and how you were lied to about the policy because they didn't want to give up the money but they also booked it privately and not through the site so they didn't have to pay the fees to the company. Which could also give them bad marks with Airbnb.\nEdit judgment: NTA but your friend and her dad are. If she was willing to lie to you so she could keep the money and then when you find out and get mad SHE then gets mad about that, can you actually consider her a friend? 'With friends like these, who needs enemies' seems to fit this person", "NTA. Your friend is. First she tricked you into staying at their airbnb by making it seem like it was free. And then continued to act like she was doing you a favor after you paid for your stay. At that point it wasn't a favor it was a business transaction. And she is even more of an AH for lying to you about the cancellation policy. Not to mention her sick attitude about being mad at you for calling out her lie. She is manipulative as hell.", "Friend? Shit. Social media acquaintance, maybe. There was no cancelation policy because, it was straight cash to her. Life is full of people that pretend to like you to get business. Fake ass insurance agents & realtors especially.", "YTA\n\n&#x200B;\n\nWildfires are force majeure, so you are not entitled to a refund.\n\nAnd: You did not book via Airbnb, so THEIR cancelation policies do not apply.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nBack in June my friend said to pick a weekend and we could stay at her dads family cabin. She made it sound like it would be free but ended up charging us the nightly rate he charges on air bnb, which I thought was understandable. So we paid $1400.\n\n 4 days before the trip, I was told there was heavy wildfire smoke and with my mil health, she might not be able to go if it continued. That day I texted my friend about what their cancellation policy was. She told me it was to late and I would receive no money back. Luckily the smoke stopped and we continued with our trip. \nHowever, the day I asked my friend for their cancellation policy, I also viewed their house on Airbnb to see the cancellation policy and it said they allowed 5 day cancellation at 100% and 50% until day of. I was honestly hurt and felt lied to about it and started to kind of distance myself to her. \nAbout a week later she asked what was going on and I let her know I was hurt and felt lied to and she admitted that she lied about the cancellation policy because she didn’t want to be out money. \n\nA day later she is furious that I would be mad that she lied to me and feels like she instead had every right to lie and be mad we would ask for a refund because in her words “ if your mil is concerned about natural fire smoke, she shouldn’t travel in the summer at all.” We have been going to this resort the last 3 labor days and never had a problem with smoke. She also said her dad was doing us a favor by allowing us to stay there but in my mind we did him one because he wasn’t charged the air bnb fee.\n\nAITA and out of line to expect to be treated with the same courtesy they give strangers for cancellation? Frankly I would have just booked through air bnb so we could have insurance for situations like this. I didn’t really imagine I would need it when it’s between friends.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She is not your friend and you're NTA", "I have a feeling he let them stay there for free and the daughter is the one who charged them which is why she lied about the cancellation policy", "Even though they are saying they did us a favor by not making us pay like $400 in fees and taxes from Airbnb.", "Absolutely. Might wanna ask the dad if you can get a discount next year. See how that unfolds.", "Jesus, I wouldn’t want to be friends with you", "Lol", "Ding ding ding! This one OP. Tell her dad what happened and get the real story.", "That was my first thought as well", "Yeah but they didn’t have to pay AirBnB’s commission on the list price, so they also came out ahead.", "Ok well you didn’t mention that, but regardless they offered to do that, you can’t hold a favor over someone’s head. And they wouldn’t have been doing you a favor for treating you less than their ordinary guests in terms of cancellation. She’s turning it around on you because she’s wrong and got caught. She probably didn’t expect you to look at their listing online and call her out", "Trueeee it was probably more beneficial for them to do everything off the website"]}