{"id": 26589, "submission_id": "16f54f2", "title": "AITA for not letting my daughter babysit for our neighbour anymore?", "selftext": "I (F40s) have a daughter Taylor (F16).\n\nDuring Summer holidays (we live in the UK), our neighbour Jenny (F30s) put her kids, (F9, M7) in holiday club. She asked if Taylor could walk them home from holiday club and babysit for 2 hours, 5 days a week, so that she can stay later at work.\n\nTaylor agreed and Jenny has been paying her £40 a week for this. My daughter is just happy to have extra money to fund her Starbucks and Amazon addiction.\n\nIn August, Jenny called me. She explained that a valuable silver bracelet has gone missing from her bedroom. She claimed no one else has been in her house and she thinks Taylor has taken it, and asked if I could search Taylors things. I know I sound like a typical doting parent but I know my daughter and she wouldn't do something like that. I was shocked.\n\nI told Jenny I'd look but that Taylor is not babysitting for her again. She was angry and she said that me and my daughter are screwing her over and she doesn't have other arrangements (shes a single mother), and she called me childish names before hanging up.\n\nI later calmly explained to Taylor what happened and that I don't want her to babysit for our neighbour again, as she might accuse her of stealing other things and demand money. Taylor said I'm being controlling and that she 'needs' the money, and keeps trying to convince me that it's still a good gig.\n\nLast week Jenny texted me profusely apologising and explained that it was actually her sister who stole the bracelet and she pawned it. I left her on read as I don't really know what to say.\n\nI feel crappy that I've managed to upset everyone and I need outside opinions.", "created_utc": 1694364605, "permalink": "/r/AmItheAsshole/comments/16f54f2/aita_for_not_letting_my_daughter_babysit_for_our/", "score": 2354, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1.) I refused to allow my teenage daughter to babysit for our neighbour again\n\n2.) I gave my neighbour very short notice to find other arrangements for childcare and I made this decision on my daughter's behalf even though she's the one doing the babysitting\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your daughter was babysitting for the princely sum of 4 pounds an hour and your neighbor has the balls to accuse her of stealing?  And then she thinks you're going to continue to let her babysit?  C'mon.  You would be the AH if you put your daughter back into that situation. \n\nNow had your neighbor calmly asked you to talk to your daughter and see if she knew anything about the missing item, that would be different.", "NTA. Accusing your daughter of theft is serious. Yes, it sucks for your daughter and the kids - especially now that the neighbor knows she was wrong, but it’s the right decision to avoid any other possible accusations.\n\nEdited to add: if she had just called to ask if your daughter knew what happened to it or had seen it…that would’ve been different.", "NTA\n\nShe accused your daughter of theft before doing a complete investigation of what happened.\n\nI wouldn't let my daughter babysit for that person again.\n\nGood Luck", "NTA \n\nIt’s important that there is trust when working for someone in their home and watching their kids. If Jenny’s first conclusion was that Taylor stole the bracelet, I think you are correct to assume things like this could happen in the future where she blames Taylor for things being out of place.\n\nTaylor might be upset that this gig is over, but it’s also better for her to find work elsewhere for someone who won’t accuse her of stealing.\n\nYou’re instilling values of integrity in your daughter. Your neighbor messed up what could have been a great gig.\n\nDo your best to help your daughter find a new gig though. Ultimately it’s the extra money she’s been earning that she’s bummed about missing out on.", "NTA, the neighbor immediately blamed your daughter instead of thinking of her thief of a sister. What will she get blamed for the next time?", "NTA.  Hopefully Taylor can start babysitting for another neighbor who won't falsely accuse her of stealing.", "NTA but you are in a tough situation with your daughter being 16yrs old.  I would explain to her that this knee-jerk accusation is more than a little mistake.  It was completely disrespectful and could even be harmful.  That neighbour is an adult and should be treating people who work for her with dignity and respect.  Your daughter didn't get that, so the neighbour shouldn't get the care and trustworthy services of your daughter.", "NTA\n\nShe accused your daughter of theft with no proof whatsoever. The moment someone makes an accusation, the entire relationship changes. The idea that she would still want your daughter to babysit if she thought she was a thief either means that she's reckless with her children's safety, or she knew that your daughter hadn't done it but was hoping to get some money out of you in exchange for the bracelet.\n\nYour daughter doesn't realise the full extent of the situation she was in, so all she sees is an overprotective mother depriving her of income. Sit her down and explain that this woman was taking advantage of her by paying her less than even minimum wage, made false accusations without proof that could have tarnished your daughters reputation, especially if she went to the police, and is not a safe person to be around.\n\nCommiserate about the loss of wages. Suggest alternative ways for her to get a weekend job, or offer to help make flyers for babysitting for other people, but also explain that when people take advantage of you and make accusations, there is no going back from that. Ever. It's a valuable lesson that your daughter needs to learn as early as possible in life.", "I don’t think Taylor understand the risk she’s taking if she babysits for the neighbor again.", "NTA. Also, bit confused.  \n'Hey, your daughter stole from me'  \n'Alright, she won't be babysitting for you again.'  \n'What! No!'  \nWhat person would want someone they think is a thief to enter their house again?", "This post does not make sense to me.  Why would your daughter want to return to work for someone who accused her of theft?  And why would your neighbor want to keep a thief as a babysitter?  Either both parties (Taylor & Jennie) are desperate, or some info is missing here.  However, as your post is written you are definitely NTA, and the only adult in the room.", "NTA.  You took your daughter out of a bad situation.  She is lucky she didn’t realize how serious that accusation was and the repercussions that could have come from it.  Your neighbour was taking advantage of your daughter by paying her so little to begin with.", "NTA should have been dealt with so much better by the single mother. However- 16 years or not your daughter is legally allowed to work and is doing some serious work. £40 a week isn’t right. I think 90-100 would have been an absolute bargain, however I get it’s a neighbour so a personal thing. How stupid was that woman to suggest she was a thief omg", "NTA.  Yikes!  I would not work for anyone who accused me of stealing without any evidence to suggest that I had done something wrong.  You really have to be careful about accusing someone.  Your daughter can make far more money sitting for someone else or working in a store.  She was really being taken advantage of by your neighbor.", ">I later calmly explained to Taylor what happened and that I don't want her to babysit for our neighbour again, as she might accuse her of stealing other things and demand money. Taylor said I'm being controlling and that she 'needs' the money, and keeps trying to convince me that it's still a good gig.\n\nYou are correct here. \n\n>Last week Jenny texted me profusely apologising and explained that it was actually her sister who stole the bracelet and she pawned it. I left her on read as I don't really know what to say.\n\nSee?", "NTA. For a start your neighbour is breaking the law. Minimum wage for 16 year olds is £5.28 an hour. She should be getting paid a minimum of £52.80 a week.", "NTA and your daughter needs to understand that you don’t help people who treat you badly. Then neighbor questioned her character and was paying her 4 pounds an hour! I would be outraged.", "Tell her if she wants you daughter to babysit again it will be 60 a week now. Take it or leave it. If she accuses her of stealing again then it goes to 80 a week.", "NTA, your daughter needs to learn not to let employers treat her like a thief even if she needs the money and why would your neighbour want someone babysitting that she thinks would steal from her?", "NTA\n\nYou made a good call. \n\nJenny should have done more sleuthing before she accused yoyr daughter.  I say that as it certainly didn’t take her much longer to find out her own sister stole it.  \n\nSadly your daughter is now old enough to understand that just because someone pays you doesn’t make it a good job.  Especially when they accuse you of being a thief.  \n\nJenny could have asked you if you’d mind checking with your daughter to see if perhaps she’d seen one of Jenny’s own children with the bracelet. But nope jumped right to thief.", "Why is she so excited about this job? Does your daughter not understand that she was grossly underpaid? I made more than that in the ‘80s.", "Nta but you should definitely explain exactly to your daughter why you never give someone a chance to accuse you of stealing from them twice . At the moment you’re the bad guy in her eyes because all she is hearing is YOU don’t want her going back over there . She probably doesn’t understand fully and that’s why she’s mad at you . Shes 16 tell her exactly how the conversation with said neighbor went . Maybe that might click", "NAH. The neighbor handled the situation well by calling you if she thought Taylor was the thief. You also reacted well by thinking that the best solution was to stop babysitting.\n\nOn the other hand, your daughter is old enough to make her own decisions and if she wants to continue working for this neighbor, she can. Don't force her to stop, because that would be controlling. What's more, the neighbor didn't have any bad intentions and has apologized.", "Taylor is 16. Jenny has apologized. Let Taylor decide", "The neighbour falsely accused your daughter of theft. If she had gone to the Police, this would have been traumatising for your daughter. Your parents being told that you stole something, when there is no way to prove your innocence is bad enough. \n\nI cant believe that the neighbour would want your daughter to continue babysitting if she truly thought she was a thief tho. It seems more like an attempt to get someone (your daughter or you) to compensate her for the loss..\n\nNTA for protecting your daughters reputation, whatever your daughter might think.\n\nOnce the true culprit had been discovered, IF there had been an announcement that totally cleared your daughters name, AND your daughter wanted to take up the babysitting again, then that should have been your daughters decision.\n\nI must admit that personally I would refuse to ever again work for someone who had accused me of theft. But that was not your decision to make.", "NTA. But only if you fix the situation (which you can). You need to let your daughter babysit again so that you're not screwing over two people. What your neighbor did was unfortunate. But she apologized. Your daughter is the one being hurt now.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (F40s) have a daughter Taylor (F16).\n\nDuring Summer holidays (we live in the UK), our neighbour Jenny (F30s) put her kids, (F9, M7) in holiday club. She asked if Taylor could walk them home from holiday club and babysit for 2 hours, 5 days a week, so that she can stay later at work.\n\nTaylor agreed and Jenny has been paying her £40 a week for this. My daughter is just happy to have extra money to fund her Starbucks and Amazon addiction.\n\nIn August, Jenny called me. She explained that a valuable silver bracelet has gone missing from her bedroom. She claimed no one else has been in her house and she thinks Taylor has taken it, and asked if I could search Taylors things. I know I sound like a typical doting parent but I know my daughter and she wouldn't do something like that. I was shocked.\n\nI told Jenny I'd look but that Taylor is not babysitting for her again. She was angry and she said that me and my daughter are screwing her over and she doesn't have other arrangements (shes a single mother), and she called me childish names before hanging up.\n\nI later calmly explained to Taylor what happened and that I don't want her to babysit for our neighbour again, as she might accuse her of stealing other things and demand money. Taylor said I'm being controlling and that she 'needs' the money, and keeps trying to convince me that it's still a good gig.\n\nLast week Jenny texted me profusely apologising and explained that it was actually her sister who stole the bracelet and she pawned it. I left her on read as I don't really know what to say.\n\nI feel crappy that I've managed to upset everyone and I need outside opinions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTAY\n\n&#x200B;\n\nYOU did not, your neighbor did.,.", "I understand wanting to protect your daughter but she is 16.  If she's willing to forgive and forget, so should you.  Soft YTA", "Sounds like you & Jenny both had the same knee jerk reaction.\n\nYour daughter is 16. You really should have asked for her input & how she wanted to manage this situation. \n\nESH (except your daughter)\n\neta — the reason you feel crappy is probably because you recognize made a mistake. Jenny admitted her mistake & apologized. Perhaps you owe your daughter an apology.", "YTA because even though she asked you to check your daughters things, you immediately forbid your daughter from babysitting when #1 your daughter could have stolen something and #2 you never discussed it with your daughter.\n\nJudge Judy always say you can tell when teenagers are lying when they open their mouths. You have zero proof your daughter isn’t a thief but still made a power play against your own daughter \n\nYou going to give her the $ she would have made? No? YTa", "NAH. Jenny jumped to conclusions, and brought it to your attention to resolve. You shut her down appropriately. She did apologize once she found the culprit.\n\nI would put her on notice with a warning, and let my daughter make the decision as to whether or not to continue. Your daughter may want to charge a little more as a warning to not be so quick to make accusations.", "Yta for not thinking about your 16 yro daughter as an equal partner when it comes to her job. I totally agree that she shouldn't work for your neighbour anymore but she should have been included in the making of that decision.\nAnd your neighbour is an AH as well. She shouldn't have accused your daughter.", "Yta taylor is 16 and can make her own decisions. I understand you being upset but it seems controlling that you won’t listen to your daughter", "YTA", "NTA. I would not want her to babysit for them either...but she is old enough to make her own decisions for things like this and she does  need to earn an income.", "NTA. Your neighbor was already taking advantage of your daughter, and then she accused her of stealing. I think you were right to protect your daughter from that situation.\n\nYour neighbor's problem with no babysitter is her own doing. She shouldn't have spoken to you that way and she should have paid your daughter more.", "NTA. Your daughter is being grossly underpaid. I made more than that per hour 30 years ago as a babysitter. And after underpaying your daughter she has the audacity to accuse her of stealing?! Hell no! Glad you stood up for your daughter. Daughter might be upset with you now but she will appreciate you later.", "Help your daughter find a job that pays better and she’ll only have to work one day a week to make triple", "NTA\n\nYou took a difficult decision to protect your daughter from a situation where someone insinuated that she stole jewellery", "40 pounds a week? fr?", "I’d leave this one up to Taylor given her age.  She needs to learn how to deal with employers (good and bad).  Sounds like Jenny has attempted to mend fences.  Taylor is old enough to handle this one.", "NTA, you need to have a serious talk with your daughter.  Jenny accused her of stealing a valuable item.  She knew her sister had been in her house but claimed your daughter was the only one.  Your daughter needs to understand that the sister most likely will be in the house again.  She needs to understand that she could be accused of stealing again.  It is not just getting accused but who Jenny tells. Talk to some of the neighbors and as what Jenny has said about your daughter.  Doubt since it took a while for her to figure out her sister took it that she kept quiet about it.", "She liked the gig and was happy with the pay so she’s upset. But you absolutely did the right thing.", "Nah your daughter can get a higher wage doing a few hours in a shop than that! Or even dog walking! She neighbour is rude and has been under paying anyway.", "NTA\n\nShe accused your daughter of being a thief, but still wanted her to babysit for her? You rightly stopped Taylor from going over there, rather she was the theif or not. If HAD stole it, then more things could have dissappeared. Her being innoncent is actually the worse of the options, cause as you said, she was being blamed for something she did not do, and could have been blamed for more stuff. \n\nJenny screwed herself over, mostly with the name calling part. Do not let your kid around her anymore.", "Taylor needs to up her rate... at least £100 per week.\n\nSeems an appropriate apology/compromise", "NTA. You were just protecting your daughter from nasty unthinking comments from someone who jumped to conclusions.\n\nPlus I used to get between £5-10 an hour for babysitting 25 years ago depending on how middle class the family was.", "She's paying £1.28 less than the national minimum wage for 16 Yrs. If daughter has gotten a taste of having more expendable income, OP, sit her down and show her she could be making £200 a month if she worked the same hours elsewhere. I and many others got our first jobs at 16, working the holidays and weekends. And the local supermarket would need real evidence before throwing accusations like theft around. Even if she wants to continue babysitting, enroll her on a St John's pediatric first aid course and make it clear to future clients that she has knowledge and won't accept less than minimum. \n\nShe likes her Starbucks and Amazon jollies now, but sit her down and explain that she is entitled to fair pay and a safe environment. Give her confidence that she deserves to have mutual trust at work. You're not being overbearing and not allowing her to work. You're using your knowledge as someone in the workforce, and as her mother, to say that working THERE is no longer SAFE. And it isn't, because if one of the kids decides to be a brat they can say \"she stole from me,\" or worse \"she hit me\" and that woman will believe them. Or maybe she decides she doesn't want to pay £4 anymore, so some other accusation comes out (she's not doing xyz well enough,) etc. There is no trust anymore, which puts your daughter at risk.\nI had a similar issue when I was 15, and my parents stepped in. Then, when I was 16 they helped me fill out applications and showed me it had nothing to do with wanting to stifle me, they just knew an unsafe situation was brewing. \n\nTeenagers always think they know better, and the best way to get through it is to explain it to her clearly and with respect and understanding. \nYou're doing good, Mama.", "My daughter's back to school now so she does have less free time on her hands, I did mention to her that we have some relatives who'd happily pay her for some babysitting during the next school break but she's still a bit upset about this whole thing and doesn't want to talk about finding something else right now.\n\nThank you for your insight.", "and will the police be involved?", "fr, op saw that coming and pulled the plug. good for op. if taylor wants to make money, she can probably make more of it babysitting for someone else or doing a different job entirely. we don’t work for people who accuse us of stealing, that’s a good life lesson. nta.", "And who will pay her an appropriate wage.", "Hopefully Jenny did not tell this lie to a bunch of the other mothers.", "Daughter is just bummed out at the loss of money, and doesn't understand how serious the accusation of theft is, and how the neighbour can no longer be trusted. Neighbour is annoyed to have lost her cheap babysitter because she falsely accused her of theft.", "If the neighbor didn’t have bad intentions she’d have started by *asking*, not by suggesting OP search T’s belongings.", "I was with you until the second to last paragraph.  This affects OP not just her daughter.  If this neighbor had gone to the police, OP would be the one navigating her daughter through the legal process and incurring the cost of an attorney.  This would have been an emotional and financial nightmare for both of them.  The teen just isn't mature enough to realize it yet.", "This response = perfect!", "I still think you should try to explain to your daughter how it is not in her interests to be in that situation again. If she immediately jumped to accusing your daughter without hesitation and looking into it further, that shows really bad judgment and ethics.  What happens if the one of the kids damages or takes something from the mother and they blame your daughter (happened to me with neighbor's kids)? A parent who immediately jumps to conclusions and makes accusations is not one you want to be around or work for.", "Maybe you could explain to your daughter that she was being criminally underpaid and she could make a lot more with other clients.", "You did the right thing, teenagers often don’t appreciate that the decisions parents make are for their own good. Every adult answering here knows you absolutely did the right thing, because we’re adults and have more life experience. I’m all for letting kids make their own age appropriate decisions, but she’s just going to have to trust you on this one.", "Never in my entire life has a parent quit a job for me. YTA", "Ask her if she want the entire neighborhood thinking she is a thief.  I wonder how many people Jenny told.", "Is a parent allowed to step in if said job is putting the child's health and safety at risk?", "I think an investigation or at least a simple questioning of the daughter would suffice. If Mom had told daughter what was going on, maybe daughter would have reacted different and made the choice on her own to leave the job . Mom effectively took the choice away from her", "Teens can be notoriously bad at understanding consequences. I do think mom should have explained the risk of continuing this job more clearly though. What if the woman decided to call the police? An arrest record could impact the girls whole life.", "NTA. \n\nYour neighbor was her employer.  Her employer accused her of something without any evidence.  What if you had believed the neighbor instead of trusting your daughter or what if the neighbor had gone to the police with her suspicions?    \n\nNot only would that have hurt your daughter but since you are financially responsible it would have hurt you too.  In fact, I'm sure you weren't the only one she voiced her suspicions too.    Just imagine what could have happened if they never found the bracelet?  How many people in the neighborhood and at school would think your daughter was a thief?\n\nA false accusation is not something you just ignore.", "NTA\n\nIgnore your neighbor. She is inconsequential.\n\nTalk to your daughter instead. Explain to her that money is never an excuse to enter a dangerous setting where she might be at risk.", "NTA. She was underpaying your daughter, then she had the gall to accuse her without any proof? \n\nJenny can look for other babysitters. And please explain to Taylor that the gig isn't worth it, because if she accused her once, what stops her from doing it again?", "NTA. Taylor won't be pleased, but its a good idea to learn to step away from someone before trouble brews.", "NTA. Work with your daughter to put out a flyer to your neighbours or a campaign on social media. I know she likes the money, but at her age it’s not a need - it’s a want, and she’ll find other clients.\n\nYou’re doing a good job protecting your daughter from accusations like that. It may be worth sitting down with her and impressing on her that when someone makes baseless accusations like Jenny did, it can ruin reputations, friendships, families, etc. and can injure a person’s liberties. \n\nTell your daughter that her integrity is the most important thing about her character and you’re just glad that she’s had a chance to learn this lesson in a low-stakes way. She will find other babysitting clients - ones that pay better, too. Nothing like a side of insult to injury.", "NTA. lesson number one about accusing your babysitter of stealing: be prepared for them to quit", "NTA\n\nSadly your reasoning is sound that they may eventually accuse her of stealing other things, or maybe just withhold pay next time. Or even worse, get the police involved.\n\nI can understand Taylor being upset because it's an easy gig for her. Unfortunately at 16, her brain's not capable of adult reasoning on Dire Consequences yet so she doesn't understand the bullet that missed her.\n\nThat's what parents are for. It's not the glamorous part.\n\nHowever, since your girl is responsible and wants to have money... perhaps there's a local job that would suit? Something part time in retail for next year?\n\nGood luck!", "If your daughter is in the UK then at 16 she should have received her NI number meaning she can get a job and open a bank account. She'd earn more than £40 a week doing 2 weekend shifts at Tesco or something. And it'd look great on her CV. NTA but have a chat with your daughter because she was getting a little bit ripped off.", "There are so many better ways the neighbor could have handled this.  Asking if the kids played dress-up with her jewelry is a good way to start.  I mean, that is what I would have assumed as a mom.  My kids would have done that and then taken off peices all over the house.  \n\nThe outright, \"did your daughter take it?\" Is an accusation I would have not put up with either.", "I’m going with NTA- it’s hard for your daughter to understand but once an employer wrongfully accuses you of stealing it’s best to cut ties.", "NTA. I have twin girls who are now 20 and I would absolutely have done  the same thing if this had happened to them. You need to explain to your daughter, as so many suggested, that next time it could be worse( something more expensive, or even a kid having a bruise somewhere unexplained) and she would again accuse your daughter and it could end up with police or a record because of her accusations.  So not worth the time and energy for such a crappy amount of money. She is using your daughter. She can do better", "NTA. First thing she did was accuse your daughter. You were looking out for your daughter by telling her she couldn’t babysit any longer.", "NTA.\n\nStay away from this woman.\n\nYou can ask someone if their daughter stole something, you don't accuse, and you don't kick off when the babysitting arrangement is ended. None of that is a super big ticket issue in the grand scheme of things, but Jenny acted like it was. So that's a super huge red flag for me. And we're dealing with kids, so what if one of them happens to trip, as happens, and Taylor gets blamed for it. Then all hell could break loose.\n\nTaylor is understandably annoyed but you are doing the right thing by protecting her despite her being annoyed. You're looking out for her, and alas that doesn't always come with glory!\n\nBut you're absolutely and completely doing the right thing.\n\nI love when people have good boundaries and don't faff around, letting people back into their lives when they've already shown their bad behaviour. You're doing that. Yes, you're on here double checking that you're actions are well chosen, but you cut off the babysitting situation right away, and I love that strength.", "This is just dumb, she's been babysitting for absurdly low pay for however long, she has experience, was trusted with children. She can do what most other babysitters do and offer her services to other families and charge the going rate. She can work less, make more and not deal with someone who accused her of stealing.", "NTA. Her being upset that your daughter wouldn’t be babysitting anymore when she was accusing your daughter of being a thief is a red flag to me.", "The only AH here is Jenny. If she really thought your daughter was a thief, why is she happy for her to continue babysitting?\n\nYour daughter is just acting her age and enjoys earning her own money. She'll realise with time that you made this decision in her best interests. She can find other part-time or seasonal jobs.\n\nIf Jenny escalated her wild accusations to the police, this could've been traumatising for your daughter and even leave her with a record.\n\nNTA.", "NTA.\n\nYou need to talk to your daughter a bit more about drawing the line with people who cast aspersions at your character. She needs to distinguish the income ( albeit small)  and the loss of self- respect that comes from this.\n\nShow her the importance of her worth.\n\nNeighbour sounds like a problematic person. Her  first instinct was to blame your  kid. Her sister  had access to the house and pawned her bracelet... says something about the whole family to be honest.\n\nWhat will she accuse your kid of tomorrow? It will only escalate.\n\nBetter safe than sorry.", "NTA. If your daughter had stolen it, as she thought at the time, no responsible parent would allow a known thief to look after their kids. The fact that she would cause your child in one breast and claim she wanted her in charge of her kid with the other shows what kind of person she truly is. \n\nPlus 40£ for 10 hours plus the time it takes to walk the kids is Way too cheap.", "NTA", "NTA. You are protecting your child.", "NTA", "NTA you kept your kid out of harm’s way", "I would say: NTA.\n\nI can fully understand the reasoning. I cannot understand the neighbors reasoning however. She quite literally accused her of theft. Yet she still wants her to babysit? Wat?\n\nThe fact that she wants your daughter to continue babysitting could imply that she thought it was possibly accidental. However, as by the end of your post it turns out she knows the culprit was someone else. The fact remains, however, that she doesn't trust your daughter.\n\nI think she thinks everything can go to how it was, but trust has been broken.\n\nIt might be worth letting it drop but press on your daughter how serious this could have been for her. She was accused of a crime that could have ended with her with a criminal record and in prison.\n\nIf your daughter is interested in child care/babysitting, it might also be worth looking into an apprenticeship or vocational qualification in that area, with a route to looking at actual childcare employment prospects.", "NTA. This is a situation that could clearly escalate if you let your daughter keep babysitting. I'm also concerned about how the neighbor, who thinks your daughter is a their, expects her to still babysit? You can help your daughter look for another job, this is not worth the potential trouble.", "NTA - your daughter is in danger baby sitting for these people", "You totally did the right thing. NTA", "NTA. You had chosen to not let her babysit because she was being treated unfairly and *you knew it*.\n\nI applaud you for taking your daughter's side and showing your \"mama bear\" to her and your neighbor. \n\nI encourage you to rethink your final decision. Maybe you can require the neighbor to apologize to you and especially to your daughter. \n\nBridges can be burned, but they can also be rebuilt. This could be a valuable lesson to your daughter about working through problems in a relationships - maybe for your neighbor also.", "NTA this lady was SO QUICK to accuse your daughter, but she still wants her to babysit?! TF? I would be telling her I don't give a fat rats ass about her situation after her basically calling your daughter a thief. Your daughter can find another part time job.", "NTA.  However, if your daughter is willing to forgive the accusation and wishes to keep babysitting, let that be her choice.  She is old enough to make that decision on her own.", "NTA. Also, that wasn’t even minimum wage what your daughter was getting paid. You’d be the AH for letting her go back to that situation.", "The A is the neighbour for paying her £4 an hour. This is 2023, not 1995.", "Don’t let her babysit for that woman age. £40 a week for 5 days babysitter is underpaying", "YTA for letting the neighbour take advantage of your daughter with that pay.", "NTA\n\nYou're protecting your daughter. Don't feel crappy about that. You stood up for your daughter. Now you're protecting her. That's being a good mom.\n\nYour neighbor automatically went to your daughter's a thief. She didn't even remember that her sister had been there. Or she didn't bother to count her own sister because she was family.\n\nI might agree to let her babysit again, but only at your house and at double the rate (for the inconvenience of using your home). Then neighbor gets the kids from your house so Taylor never sets foot in neighbor's home again.", "YTA - what was Jenny supposed to do? So awesome Taylor isn’t a thief, but what if she’d had a weird moment or if she’d let a friend in while babysitting and that friend had taken it? Was Jenny not supposed to ask? If she’d sent the police over, that’d be one thing, but she just asked you to check, which feels reasonable.\n\nEdited to add that Taylor could make better money elsewhere.", "NTA for how you're feeling. \n\nIt's a judgement call, but I think Jenny is really trying to make amends and, apart from this incident, your daughter has liked working there.  \n\nIf I were in Jenny's shoes, I'd suspect the babysitter before I suspected my own sister as well.  I can't help thinking it must have been distressing for Jenny to no longer see her bracelet and maybe she panicked. \n\nIf there's no other evidence to support the idea that Jenny's trying to extort you, and if your daughter really likes working with her, I'd personally let them have a second chance to work together. \n\nMy opinion might be coloured by my own experience.  Many years ago, I did home care with senior citizens and, on a couple of occasions, was accused of stealing because they forgot where they had put something. Once they found  he item again, they apologized, and I continued working with them and there was no lasting harm.  \n\nThis could be a good opportunity for Taylor to learn what measures professional carers take to protect themselves from such accusations.  I know this is an informal arrangement, but why not make it a learning opportunity?", "ESH-Your daughter is 16 and she can make her own decisions if she wants to babysit again or not, Jenny has also apologized.", "I’m gonna go against the grain and say YTA because you stepped in on your daughters job. Mommy shouldn’t be stepping in just cuz someone offended her little girl. Chances are that’s going to happen in the future cuz that’s life. And the bosses can’t always be 100% sure of anyone they employ. I think (in best order) you should have:\n\nA) told the lady to TRIPLE check everything BEFORE getting involved. (Then she would have only made herself look bad).\n\nB) If she still insisted, looked to prove your daughters innocence, then told your daughter and let HER make that decision.\n\nC) expect some sort of proper apology TO YOUR DAUGHTER and have her make amends, again, to your daughter. A pay raise, some sort of reconciliation, etc. \n\nYou kinda took it to the extreme right away in my opinion. It’s only natural for someone to think that a “stranger” (aka anyone NOT family) might POSSIBLY steal something from them. She was wrong but you shouldn’t have made that unilateral decision either.", "YTA your daughter is old enough to make up her own mind. You should have told Jenny you would ask about it and leave it at that.\n\nIf your daughter felt uncomfortable to babysit that would be different, but you didn't give her a choice. She's 16 not 10.\n\nShe will encounter difficult people and situations in her life. You can't fix everything for her.", "Whatever happened to forgiveness?  The neighbor apologized and has learned a valuable lesson.  your daughter wants the work and it is an incredibly convenient gig for her.  Tell the neighbor the rates have gone up and allow your daughter to resume work if she wants.\n\nYTA", "Yta\n\nDaughter is almost an adult at 18. Her decision to go back or not.", "Nta.  I am not in any way defending the neighbor.   I would have had to swallow a huge chunk of pride to call and say the bracelet was found.\n\nI would allow her to go back only if a large pay increase was included and a sincere apology was given", "Yeah nta, but since you had to be the bad guy I personally would have given her the difference of what she would have earned the rest of the summer if she hadn’t stopped working, whether on a Starbucks card or in Amazon purchases or cash. It wasn’t a lot of money in the first place, and it wasn’t her fault it went south. I then would have made the calls to family and friends to set up weekend gigs or something once school started. If that’s what DD wanted.", "NTA. But you could allow your daughter to babysit now. The woman apologized and I don’t think she will make an accusation like this again.", "NTA.  That's the most correct response.  If she accuses her once, she'll likely do it again.  At that point you have to protect yourself.  \n\nI do, however, feel like you need to help your daughter find a way to continue making that 40 pounds.  I know the exchange rate isn't exactly 2:1 pounds to dollars, but 40 pounds is closer to 100 American dollars than it is to 50, and for a 16 year old without a car, that's a solid deal for what probably amounted to 10-ish hours of \"work\".  I'd be upset if I was her too.", ">I left her on read as I don't really know what to say.\n\nWhat you say, and you cc: your daughter, is her accusing your daughter of theft without any evidence, combined with the absolutely crap pay rate that your daughter agreed to (as she is young), means 1: APOLOGIZE TO MY DAUGHTER; and 2: She's not babysitting for you again \\*without\\* an industry-standard bump in pay because that's a small protection against the next baseless theft claim.\n\nTaylor doesn't get it. She sees the (paltry) money that, as a teen, gives her a bit of spending freedom. She doesn't see how she's been used at cut-rate prices.\n\nJenny's O Poor Single Mother Me is a classic scam that \\*some\\* do. You shouldn't fall for it, and should help your daughter do the same.\n\nNTA (provisionally)", "I’m with you and would help my daughter find a different job, then again, you can wash your hands off it and just let your daughter choose but let her know that you will not take texts from that lady…and expect your daughter to keep communication open with you. If she’s accused directly…she might feel differently.🤷🏻‍♀️", "Why WOULD your daughter want to babysit who falsely accused her of stealing?  Maybe tell Taylor that your daughter can continue to babysit for double the money...  NTAH.", "NTA\n\nYour neighbour upset everyone - not you.", "NTA. You were right, the neighbor was wrong, but I think that it should be up to your daughter whether she wants to work for this lady. At this point I think that your neighbor might not be so quick to accuse your daughter again of theft. I think your daughter is old enough to make this decision for herself. I wouldn't want to work for a woman like this, but as a teen I remember how much it sucked to be completely broke all the time.", "NTA. Have a conversation with your daughter about the value of her time and efforts. That money might seem like a lost now but her morale isn’t. A working relationship is built on trust. If she’s the 1st person to be accused without any proof, who to say what will happen next time?", "NTA I'd say water under the bridge and let her babysit", "NTA\n\nYour daughter is majorly being ripped off. £40 for 10 hours of work? That’s £4 an hour for two kids - that’s ridiculously cheap. \n\nTell your daughter that if she wants to keep the job, she can, but that you and her will be renegotiating her pay rate so that it is fairer to her. I don’t know what the going rate in England is, but I’m very confident it’s more than that!", "Nta", "You need to explain to you daughter that it was a good thing as she was not being paid enough. £4.81 is minimal wage for her age. \n\nNTA I'd want to protect my child too from false accusations", "If she has a sister that stole and pawned her bracelet I seriously doubt that this is the first interaction with sister of this sort. Most likely she blamed your daughter because she didn't want to blame her sister. I'm gonna guess she must have thought it was the sister anyway or she wouldn't have even found out what happened to it. If she thought your daughter took it she would have never pursued anything else, the fact that she found out her sister took it tells me that her sister might be well known for these things.\n\nMakes it even worse that she would accuse your daughter. You are 100% right, anything else that goes missing she might accuse your daughter! This is not a good gig and I'm glad you found out now before sister pulled something else! We don't know what this person is like! Is she an addict that's stealing and pawning stuff for drugs? How do you know she's not going to show up at the house when your daughter's there watching the kids? NTA keep your daughter away from that situation", "NTA. We’ve been blamed for various random things from a friend and also a family member (and like OP stated, they later found these items) and it forever altered my relationship with them. Because of this, too, I’ll never ask if someone took something from me.", "NTA. Her low pay, accusation & treatment of you are dealbreakers. Kids need to be advocated for even though sometimes they don’t like it.", "Can anybody explain the logic to me? First accusing someone of stealing, then getting upset when that person won't work for you anymore? How does that work?\n\nNTA, obviously. But if Taylor really wants to keep on working for Jenny, maybe let her? Make it clear to Jenny that one more stunt like that means it's over. And Taylor gets a raise, of course. Is that such a bad idea?", "\"She claimed no one else has been in her house and she thinks Taylor has taken it\". \n\nSo this was clearly not the case. How could she have been so certain, that she'd make the request that you search your daughter's things - yet be wrong?", "Nta. When I was 13. And babysat on new years for a good chunk of money, they accused me of taking almost 1000$ cash that was sitting in some jar that they hid somewhere.\nThis was also a weekend where they allowed their nephews from out of town stay there. But still got me to babysit anyways. I was absolutely offended to find out I was the one who was accused of stealing this money even though I have been a LOYAL babysitter for 2 years. I refused to babysit for her anymore after that  and her kids were devastated that their mom got rid of the \" fun\" babysitter. My mother would have notices if a 14 year old girl had 1000 dollars or 1000 dollars of new stuff lying around all of a sudden. \nA half a year later she approached me to try and get me to babysit for her and got enraged because I told her that I charged double \n\nAnd also. \nI was paid 20-40 a day. Good on you to cancel that gig as I believe your daughter was ripped off.", "NTA. Stay well clear.", "NTA. Your neighbour was quick to accuse with no proof. That type of personality does NOT a good boss make.\n\nAs far as your daughter is concerned, she was earning £4 an hour. If she worked at a fast food joint, according to my research, they'd have to pay her £5..28. While the job wasn't excessively underpaid, as many babysitter jobs are, she can probably do better for herself.", "NTA. You were right, if this lady's immediate instincts were to accuse your daughter the trust just isn't there.", "NTA- I suppose when the person who needs the help falsely accuses the people helping them, there are consequences. You do need to do something to help remedy the fact that you just stripped Taylor of easy income, though, even if you did act to protect her from false accusations.", "NTA. And good for you for standing up for your daughter.  She needs to know being accused of a crime (that she didn’t do) is a very serious offense to her character and morals. And if she allows that to happen, she opens the door for those to keep disrespecting her and stomping all over boundaries. Fool me once…", "NTA!                                                                                                                                                 \nYou did not upset everyone ... Jenny and her false accusation upset everyone. Of course you couldn't allow your daughter to continue to sit with that hanging over her head.  \nI'm glad Jenny owned up to her mistake but I would still have a problem allowing my daughter to sit for someone who so easily accused her of stealing a valuable item.  \nI'm a little surprised that Taylor isn't more upset by this attack on her character.", "NTA but not right either. If your daughter doesn't care about the employer being worried you shouldn't. Althiugh that sister is going to prove problematic.", "First of all - 4 pounds an hour?? I bet she’s pissed off at losing her. I think you should have spoken to your daughter first as it is both her honour and income at stake. But as a mother of teens I would have had the same slash and burn reaction. Also there’s something wrong about the neighbour being happy to carry on employing a person she believes is a thief - and therefore dishonest, and one who in that scenario would also be a pretty incompetent thief, therefore also, well, not very bright, to take care of her actual children. (not saying at all that I think your daughter did take it - of course she wouldn’t have, makes no sense) So IMO, awkward, probably not the best handling on your part, daughter has a point re controlling but NTA, fierce mum (also probably salvagable but neighbour owes daughter an apology)", "Jenny is trouble. Let her make other arrangements - maybe her sister?", "NTA\n\nDealing with trash will lead to a stink wherever you go.", "You did this all right.  If this lady is accusing your daughter of stealing while probably criminally lowballing her on pay then it is best to cut her off.  Help her find a better job, advertise for baby sitting but at least 10-12 an hour\n\nThe red flags of thieving sister, single mom, and easily jumps to accusation, and cheap on pay.  The more you engage with this woman the more stacking red flags you seem to find so firing this client is a great life lesson for your daughter.", "In this case, I think it’s just best to be open and honest. Say that you were alarmed at the accusation, hence your refusal to let T babysit more. But now that she has cleared the air and found the real perp, you’ll allow T to babysit again. I mean: why not?", "NTA you’re looking after your daughter and potential future accusations that more than likely will happen and cause discord. Just like another commented show her worth and nurture the growth so she can make some $$ if that’s her goal.", "NTA. If Jenny's first thought is that Taylor took it because \"no one else\" has been in the house and she has no proof but you should search Taylor's things then somehow learns her sister took it and pawned it, she can kick rocks. You didn't ruin Jenny's life, she ruined it herself.\n\nYou're right to be concerned about further accusations even though Jenny said her sister stole it; the fact that she claims nobody else was in her house and Taylor was her first thought means she'd assume it was Taylor the next time.\n\nAre there others Taylor can babysit for?", "Nta. Her excuse is shameful. So she wrongly jumped to the conclusion that your daughter is a thief. \"No one else has been in the house\" is apparently a lie. So now she is going out of her way to lie & change facts to accuse your daughter of something she didnt do. Your daughter needs to post flyers & search ads to find another gig because what will she accuse her of next?! The woman alrdy proved shes willing to lie to make your daughter look more guilty", "NTA - it is understandable that your daughter is upset, she is not old enough to understand the gravity of what just happened. The neighbor is under paying her and taking advantage of her. She should not be going back. It is right to protect your daughter, which is what you did.", "NTA - your neighbor's reaction was ridiculous, and who knows what she's capable of next. It sucks, but hopefully she can find another job.", "NTA.\n\nTime to help Taylor find a different job.", "This always makes me nervous about babysitting or house cleaning or dog walking jobs.  If someone accuses you, you can’t PROVE your innocence.  I’m sure people do this for insurance claims.", "I’m going against the grain here with ESH. Your daughter is old enough to make the decision herself on whether she wants to continue babysitting or not. I would recommend that Jenny also apologizes to Taylor though!! You are trying to control her. You also should let her makes the decision and even mistakes herself. That how she learns. \n\nThe fact that Jenny called and profusely apologized says that she is sorry. I agree that jenny could’ve handled the situation better than she did and for that she’s an asshole. \n\nI think this could be a good teaching moment for your daughter though. For her to realize her self worth and make the decision herself.", "NTA Taylor deserved protection. An accusation was made and Taylor had no other resource to protect herself, so you stepped in. However, now that the situation is resolved, it did sound like a sweet & easy gig. Let Taylor accept an apology & a raise, and keep working.", "NTA I feel like she wanted free babysitting to make up for the stolen bracelet. When you \"shockingly\" told your neighbor your daughter wasn't coming back, she \"discovered\" her sister had taken it. The neighbor is manipulative and you should stay away. I bet there was never a bracelet.", "Nta- Jenny sux rusty nails.  If Taylor needs money, find a substitute like mowing and pay her.", "Sometimes the right decision isn't a popular one, hang in there dad. NTA", "NTA - if Taylor needs pocket cash, I'm sure there are plenty of other families looking for a sitter. Jenny burned a bridge and that's on her. Her childcare woes are not your concern.", "NTA OP\n\nYour daughter should be paid more than 4 pounds imo. If your daughter enjoys babysitting, maybe help her find a new job as a babysitter that will pay more. \n\nHow that would be possible I don't know.", "I can hear the blades from the helicopter (parenting) from here.\n\nYour kid is old enough to fight her own battles. You need to stop butting in all the time.\n\nYTA.", "NTA… I mean, you’ve got to be careful sometimes. If another item goes missing, then she will probably blame it on Taylor again. And who knows how bad it can get? My own grandma accused me of stealing her stuff when they were missing.. you can’t be safe with some people. Had her sister not told her, she would’ve definitely accused Taylor.", "I think the behaviour that concerns me most in this story is the neighbour called Taylor’s mom to ask about her bracelet. She should’ve asked Taylor herself, in the same way you’d do as an adult. Ie, “Hey, Taylor, I can’t seem to find my bracelet. It’s [describes bracelet]. Have you noticed it around the house?” Then, she could’ve gauged Taylor’s response and made a decision on what she thought was likely (ie, if she thought Taylor may be lying, etc).\n\nThe fact that she didn’t involve Taylor at all but went straight to the mother concerns me. The fact that she wanted the mother to search her room concerns me more.\n\nIt makes me wonder what her end game was. Did she pretend the bracelet was missing in the hopes OP would offer to replace it? Was it genuinely missing and she didn’t think of how to best handle it?\n\nTaylor is 16. If you can’t bring your concerns to her, then you’re not treating her like she’s mature. If you don’t think she’s reasonably mature, you shouldn’t be letting her look after your children.\n\nI just don’t get the neighbour.", "NTA", "NTA, your neighbor was out of line by making accusations. Your daughter should be more offended over this.", "NTA. Jenny is a w itch.", "Idk i'd ask for a raise and make her apologize face to face. If she did so then let her keep babysitting. She likes the job and wants the money. People make mistakes and 2nd chances aren't unheard of", "NTA you’re protecting your daughter", "Yeah, NTA\n\nI can't imagine a situation where the accusation of stealing has been made and both parties involved still want to continue their arrangement.  Just doesn't make much sense to me. But then again, not much makes sense anymore nowadays.", "NTA but if your daughter is mad at you then you are failing at teaching her that she should have a sense of self-worth and that she should demand respect when it is due. She should have been offended and angry as you were, but she wasn’t. Use this moment as a jumping point for practice before she starts letting other people and boys decide her worth for her.", "Your last paragraph is spot on. My daughter had a friend come to sleepover and the next day my daughter’s favorite sweater is nowhere to be found.     \n\nI’m not going to accuse a child, so I politely asked the mom via text if my daughter’s sweater accidentally got packed in her daughter’s things stating *I* was the one who packed the bag.    \nOf course the sweater wasn’t with my daughter’s friend and after buying her a second one, we found the original: it had fallen between my daughter’s bed and wall.    \n\nSo it was a good thing I didn’t go around pointing fingers lol", "I’d explain to Taylor that her reputation and future is more important than babysitting money from the neighbor. Next time she could get the cops involved. NTA", "NTA.", "My nieces get $35US/hr… daughter is being taken advantage of.", "More importantly, beyond the money, which is a ripoff: once neighbor accuses kid of theft, that kid must never be in that neighbor's house again, let alone, well, alone.  That ship sailed and now OP needs to keep the police and accusations of theft out of her daughter's life.", "Many years ago, I had the wife of the couple I babysat regularly for call me in hysterics, screaming I had stolen $400 from them. (1978, so a ton of money back then). My parents believed me that I’d never seen the envelope the money was in. 6pm, the husband gets home, his wife screams about me to him, and he walked over to his dresser and pulled out the envelope. He’d asked her to put the money away while he picked me up the night before and was pissed when we got there that she hadn’t. So he hid it.\n\nHe’d forgotten to tell her, and I never did learn why she called me before talking to him. But my parents refused to ever let me sit for them again.", "Hopefully she hadn't also spread the accusations around the neighbourhood but I wouldn't want to take chances in case she lost something else. \n\nEven if she cleared it up later, people would remember and it would tank the daughter's future babysitting chances elsewhere.", "There probably is no bracelet or sister. Jenny just wanted free babysitting and would get it through \"working off the stolen bracelet.\" Like why would you want a thief back in your house looking after the children?", "Not only that, she lied that no-one else has been in the house. Either she let the sister in herself or she gave her access (via a key) at some point.", "One that knows, deep down, that the person they accused, didn't do it....", "One that knows that evrn if the girl actually took the bracelet, her Babysitting Services would still be underpaid.", "The neighbour found out her own sister was the thief. She falsely accused OP's daughter.\nPlus the neighbour is underpaying her anyways.. So she knows that if she gets a new babysitter she will have to pay more.\n\nOP's daughter doesn't seem to understand the gravity of the accusation. Probably do to her age.", "She’s probably better off working at McDonald’s. I earned £3.05 as a 16 year old in 1995… (no minimum wage back then)… £7.30’ish today.", "Does the law apply to a person paying a babysitter? In the US it doesn’t.", "Minimum wage doesn't usually apply to baby-sitters tbh.", "And the neighbor called OP names.", "A 16 year old is a child, she really should not be expected to know the proper way of dealing with defamation and issues with minimum wage law", "I hope you don't have children, because you are exactly the sort of traitor who would never have their back. If somebody accuses you, wrongly of a criminal offence, then the proper course of action is to sue them for defamation.\n\nWhy would you think it is appropriate to blame a stranger, and simultanously invite that stranger into your home to perform work, even after accusing them?\n\nPeople generally should not go through life having to bat away false accusations and people who falsly accuse others should be getting sued for 5 figure sums in civil courts, not apologising for getting it wrong. You seem to have absolutely no idea just how serious this is.", ">Jenny's O Poor Single Mother Me is a classic scam that \\*some\\* do. You shouldn't fall for it, and should help your daughter do the same.\n\nI don't mean to be prejudiced, but as soon as I read single mother, I thought, I bet it was someone else in her family who stole from her.", "Also teach her to put aside a portion of her income,  and not spend it all on things that have no long term benefit. Sitting down with her and going through her spending, looking at what proportion of it goes on what, and getting her to record this for a whole year, can really help sink in how easily money can disappear.", "Most babysitters even teens in US are $15 -20 an hour. I’m in high cost of living so I’d expect to pay $200 a week minimum for this service!", "This. I started my first job aged 16 in 2006 and my hourly wage was £5.35. Don't let your daughter be ok with being woefully underpaid.", "This !!\n\nNTA", "Perfect answer; wish I had scrolled down and seen this before I posted mine. <award to u/SomeCallMeBunny\\>!", "You always find what you're looking for after you buy the replacement. 🙃", "Exactly, the neighbour’s blundering rudeness is also unacceptable. She could have asked the daughter politely if she’d seen it around", "That’s genius framing. I’m gonna need to remember that.", "And also OP’s daughter needs to be taught that her time has value and she should be compensated fairly for it. This is a teaching moment that will empower to advocate for fair pay as she moves through life. The neighbor FA and FO. Now she will be forced to pay a fair market rate next summer. 🤷🏻‍♀️🤷🏻‍♀️", "That's what it is here in Cali too", "OP maybe show your daughter this post? \n\nShe might think any reason you give is just you being 'Mum'ish(I mean no offense by this but I hope you understand what I mean).  Strangers saying the same thing might make your reasons more real to her.", "Explain to her that these people were ripping her off with how low they were paying her.", "Explain that a situation like this can quickly get put of hand. That neighbor accusing her of stealing means she doesn't trust her and she could've been arrested and though u understand that she cares about these kids its your job to help keep her safe and this neighbor has shown she is not a safe person for her to be around .", "In the UK yes", "My parents paid that per hour for both me and my sister in the late 1980s!", "Bruh. You need to chill. It’s not defamation of character unless she’s blathering about it to everyone before hand. She asked cuz she was concerned. And you are 100% RIGHT! No one should have to go through that. But they do. Like so many other things in life, people deserve better. I have been accused of theft both as a babysitter and as a cashier. I didn’t blame anyone for it. They didn’t know better until afterwards. I understood their point of view and was proven innocent both times. Reparations were made and I was given better positions of authority and respect for handling it with grace. Instead of blowing up and storming off. It happens. That’s all I’m saying.", "YES! Teach the importance of savings!\n\nAlso OP is NTA", "Cool, and ultimately irrelevant as OP's in the UK.", "I was under 18 when the minimum wage first came in, working 6 hours a week in a pub kitchen. Back then, it applied to over 18s only, and the bastards actually dropped my hourly wage from £3.12 to £2.88 an hour. Their explanation was that they had to make up for having to pay some of the older staff more. I'm sure that extra £1.44 went a long way!\n\nI quit on principle within a couple of weeks, but not before stealing more from the till than I usually made in a month. And I got away with it--the old landlord is dead and the head chef was in prison last I heard.", "Or falsely accuse someone😲", "Tri-state area", "<<criminally underpaid>>  I think daughter should be aware that she could have been criminally accused or even criminally charged.", "I'm so sorry that happened to you.\n\nWhen I was a teen, not understanding the Big Picture that was Happening at a care job cuz I thought it  All Was #Woo and #Good \\*despite\\* what parents and others in the family were trying to get me to see? My parents stepped in and Hard Quit a job for me.\n\nAt the time I was \\*so\\* pissed. But not long after I realized OMG. They were right. \n\nI'm so sorry you had no one at your back to help you learn not to be a doormat, unlike OP's Warrior Stance Parent who threw down on behalf of her daughter in this situation. \n\nOP has, by action, modeled for her daughter \\*layers\\* of critical thinking/stand up for yourself/know when to walk/figure out her own Baseline Integrity/how to resist b.s. emotional manipulation.", "Damn y'all are lucky", "Yeah. The neighbor is cheap, rude and callow.", "Repeating an accusation to any third party is slander.", "yes, NTA.", "Average cost of a sitter in the UK is £9.31 an hour. ($11.62 USD) So, for 10 hours a week, she should be making £93.00.\n\n[https://www.babysits.uk/community-resources/1964/the-average-babysitting-cost-in-the-united-kingdom-2023-edition/](https://www.babysits.uk/community-resources/1964/the-average-babysitting-cost-in-the-united-kingdom-2023-edition/)\n\nClose enough tbh.", "r/unexpectedphineasandferb", "Ok boss", "How do you simultaneously accuse someone of being a thief while also expecting them to continue working for  you? I'm missing the logic there.\n\nNTA", "NTA \n\nAs a mom to a headstrong little girl I feel you 😅 they don’t always know that we’re looking out for them. You made the right decision and she as a grown woman will thank you when she understands what you did.", "NTA. Jenny accuses her of being a thief but still wants her to babysit? And she still wants to babysit?  No.", "I am floored that she has the gall to be upset to the lose the babysitting thief!  With the accusations and then her anger and embarrassment she might be looking for more things to complain/accuse; not a good situation for your daughter to go back into. Its hard not to feel her apology is primarily motivated by her need for a cheap babysitter   and it didnt come until she had another culprit.  All of the above advice about speaking to your daughter; I am sure there are other babysitting opportunities with a consistent, responsible and now experienced young woman.", "NTA but your daughters reaction is odd\n\nMaybe explain to her she can always find better jobs", "NTA OP please sit down and have a talk with your daughter, and tell her how much more babysitters make, and tell her that this is one incident & it could’ve escalated.", "NTA. Your neighbour is the asshole. Your daughter is a teenager and therefore an asshole, but she's much less to blame.", "NTA,\n\nI'd  go she can babysit for you if you pay appropriately 10 an hour, and you'll have to back pay her for all the hours you've taken advantage of her by underpaying.", "NTA, sit your daughter down and explain how little she’s getting for helping out and that Jenny didn’t ask you if you’d seen a new bracelet on or around Taylor’s things. She went to immediately violating Taylor’s privacy and accusing her of stealing it.\n\nDid Jenny even ask your daughter about it? Or did she come running to you? \n\nSee if Taylor can find jobs where she’s paid what she’s worth.", "NTA - Keep protecting your daughter from Jenny, whose first instinct was to accuse your daughter for stealing. You are not screwing over Jenny, Jenny is screwing herself. \n\nAs for your daughter, you should help her find a new babysitting gig, she has proven she can do it and built up experience, she can get paid more now as well because of that. Look with her together and explain to her again she deserves better treatment, and you still support her having a babysitting job for extra cash.", "You did the right thing.  Jenny is sorry until her klepto sister grabs something else to pawn and your daughter gets blamed..again.  I’m sure there are other jobs for your daughter to make a little spending money, that don’t include a boss that will accuse of her theft whenever sis decides to visit.", "ESH\n\nOP for continuing to assume the neighbors are scam artists after a genuine attempt to apologize, and the neighbors for not having enough sense to ask questions before making an accusation against someone who has not previously shown any signs of dishonesty.", "NTA. She's being underpaid. And once someone has the balls to make serious accusations without any evidence that person instantly becomes a toxic disease, and you should never go near them again.", "i mean this sucks all around. but if taylor wants to and jenny wants to, then let them. but make sure to all parties that any more accusations lead to terminating of contract indefinitly. NTA either way.", "NTA. Protect your daughter at all costs. People like your neighbor only gets worse with time. She will definitely escalate.", "> valuable silver bracelet\n\nThe first two words are mutually exclusive in the world of today.", "NTA. Good parenting here.", "YTA the bracelet went missing and she asked if your could check, sure save the convo in case she would try something in the future. But if your daughter still wants to do it you should allow her.", "nta", "It's like an athlete who wants to keep playing while hurt and the coach takes them out. It's the voice of reason even though it's taken as being a buzzkill", "But then she'd have to pay taxes and get to keep less.", "Tax free... mind you, the daughter is likely below the taxable threshold anyway.", "This x 1,000,000\n\nGreat response\n\nNTA", "That's.. 10 dollars more than I make as a mechanic. Christ, I gotta go back to school.", "Fuck me, that's more than 10 dollars an hour more than substitute teachers make.\n\nAnyone hiring?", "To be fair, I’d be horrified if I was accused of stealing something. I’d think it was me giving off an air of untrustworthiness. Maybe your daughter is trying to overcome that. Maybe she’s concerned that it will happen again. That must’ve been really tough for her. Even when we’re in the right and a relationship is toxic and we’re being used we can still feel like it’s our fault. \n\nI bet Taylor was great for those kids and did her best. Hoping she can dust herself off again and know what she’s worth as a child care provider (which is NOT forty pounds a week)", "Only if they are under 16 or live in. I mean you likely would never be caught out but legally minimum wage has very few exceptions, detailed below \n\nYou’re not entitled to the minimum wage if you’re any of the following:\n\nunder 16\n\nliving and working with a family as an au pair or nanny, and not paying towards your accommodation or meals\n\nin the armed forces\n\na volunteer or doing work experience\n\na prisoner\n\nsome trainees and interns (however, the eligibility rules are complicated so you should get advice)\n\nsome farm workers (check if minimum wage applies to you on GOV.UK)", "The first £12,570 a year have a 0% income tax rate. I doubt the average 16 year old is going to make that.", "And isn't that just disgraceful!", "Many sitters are substitute teachers or teachers' aids stringing together night and weekend gigs because they make so little from their school jobs.", "I was a qualified high school teacher earning good money in Australia when I met and married my American husband and moved to the US back in the early 1980's.  At that time, I had the choice of using my 4-year science degree and diploma to teach, or work in a laboratory, for $500 a month, or work as an unqualified, inexperienced medical receptionist for $800 a month.  Since the rent was $400 a month, guess which one I chose?  As teachers in Australia, we were also given a reasonable budget to spend on resources for our students - no need for us to spend our own money doing that.  I don't understand why anyone would work as a teacher in the US.", "Depending where you live… 185 days, starting salary $45 k, excellent benefits…"]}