{"id": 26598, "submission_id": "16eyru1", "title": "AITA for punishing my daughter for comments she made?", "selftext": "My husband (38M) and I (38F) have 2 children, our twins, Brexton (13M) and Braelyn (13F) turned 13 in February. Because of their milestone birthday of becoming teens, we told them they could each choose a vacation some time this year.\n\nFor about 2.5 weeks this summer, we went to various different baseball themed spots for Brexton, we went to a baseball bat museum and factory, Babe Ruth’s grave, and various other baseball museums etc. Brexton’s girlfriend also went to some of these places with us.\n\nBraelyn wanted to spend some time in France, going to places like the Eiffel Tower and to do a tour of a perfume factory. We have a trip planned for November. We asked both Brexton’s girlfriend’s parents and Braelyn’s boyfriend’s parents if they could join us and that we would pay for them and their kids. Braelyn’s boyfriend didn’t go with us to any of the baseball places, he’s a theater kid and that’s not really his thing. Brexton’s girlfriend went to his places to support him.\n\nThe issue is that Braelyn has recently been complaining about this arraignment to her friends, including in front of us. One of the comments her and her friends made was that Brexton’s girlfriend shouldn’t wear anything “weird”. For some context, Brexton’s girlfriend is the daughter of Ghanan immigrants. Her parents moved here a few years before she was born. Brexton’s girlfriend often wears traditional Ghanan clothes and is all about empowering herself. Her parents dress more traditionally Western, but will sometimes wear clothes from their culture. Brexton has even recently got some clothes as a gift from his girlfriend, which he has worn before. Brexton is very supportive of this, and even when it’s just my husband and him in a room and we are asking about his relationship, he will say stuff about how she looks pretty in whatever she wears.\n\nWhen we pressed Braelyn about this, her and her friends continued to make comments about how she should dress more “American”, suggested she get some crop tops and go to the mall and find some clothes.\n\nMy husband and I told her this wasn’t right, but she kept insisting she was just telling “the truth”, we told her if she continued to make these comments, she’d lose her phone until further notice. She went on, so we took her phone and then made her friends leave. We also contacted her friend’s parents and luckily, most of them were equally as horrified. Her friends are now mad at her for “getting them in trouble”, but she just shifted the blame on Brexton and we’ve heard she’s been saying stuff at school, so now we’re looking for a therapist as this has become a pattern.\n\nBraelyn keeps saying we’re making her life miserable and how we’re too mean, and when we went to a family BBQ last night, she shared what was happening and we had some family tell us we were being too harsh. AITA?", "created_utc": 1694347965, "permalink": "/r/AmItheAsshole/comments/16eyru1/aita_for_punishing_my_daughter_for_comments_she/", "score": 108, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My husband and I grounded our daughter after she made some mean comments about how our son's gf dresses, she dresses in traditional clothes from Ghana where her parents were born. The grounding included losing her phone and having her friend's parents called as her friends were also involved in these comments.\n\nOur daughter keeps saying how we are being too hard on her and is calling us mean and when we were at a family BBQ last night, we had some of our other family come and agree and tell us to consider reducing the punishment.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, your daughter's being racist, you're helping her unlearn that", "NTA - your daughter definitely sounds entitled and needs consequences for her actions and words. \n\nBut I have trouble believing this is real. Just giving a 13 year old a birthday present of a trip to Paris is incredibly expensive and extravagant. But I’ve seen it done before and is not super uncommon. But what is baffling me is adding two additional families to your trip and covering the cost of those entire families! These kids are 13, most 13 year olds are not even dating. And at 13, these kids can’t have been dating very long. I get including a long time boyfriend/girlfriend on a family trip. But how long have these kids even been dating for you to include two separate entire families on this trip? That’s got to be around $50k for just one of the kids birthdays (on top of what was spent on the son’s multiple birthday trips). Maybe I’m naive, but I struggle to believe that people sitting on Reddit have this much extra money burning a hole in their pockets.", "NTA\n\nI’m Nigerian immigrant (next to Ghana) moved to the UK as a kid in the early naughties and gave up my culture because of the kind of comments your daughter made. As an adult I’m constantly trying to find my identity again. The one a gave up for a culture that still sees me as not one of their own. Your son sounds awesome, wish I knew supportive humans like him growing up.\n\nAs I adult I learnt that girls like your daughter taunted me because I chose to be myself, I didn’t let society dictate that for me. Until I did.\n\nWell done for sticking up for your son’s gf and a black woman. Well done for parenting your child. Well done for asking questions and well done for instilling those values into Brexton hopefully Braelyn learns to better and gains understanding of intersectionality.\n\nP.S. people from Ghana are Ghanaian. 🙌🏾", "Lmao, Brexton and Braelynn", "I can’t get past those names..", "NTA. I’d even take her vacation away until she’s able to understand why her comments are hurtful and wrong.", "Why is everything on this sub badly written fiction now? It’s boring.", "ESH. Maybe explain more about why this is wrong. Like try and get her to emphasize with what it’s like to be a stranger in another country. What she and her friends said was shitty but they’re also 13 year old girls and 13 year old girls talk shit about other 13 year old girls clothes no matter where they’re from. \n\nAm I old and out of touch or is 13 kind of young to have serious, family trip takin boyfriends and girlfriends?\n\nEdited for judgment", "NTA but those names are atrocious", "NTA, seems like you're trying to teach her the right things, but she has clearly been getting a very different perspective of the world from her friends, etc. You need to figure out how to make her see things your way. Maybe exposure to other cultures via travel may help give her some perspective?", "NTA, as her parent it’s pretty much your job to rein in these things before they get out of hand, you’d be TA if you just let her freely talk shit about your sons girlfriend. Hopefully she grows out of this and looks back on it ashamed", "YTA what did you expect when you named your kids that??", "Yta... why do 13 years have boyfriends/ girlfriends? Wth", "NTA - She and her friends are being racist/xenophobic, you're stopping her, which you are right to do.", "Hopefully this story is fiction because it sounds completely made up.", "Your daughter learned a lesson is FAFO... NTA", "NTA\n\nIt sounds like you two are parenting, while not always popular, it is a battle worth having. Kudos.", " NTA I’m proud of you for addressing this head on. This is his generational racism is broken", "NTA, but if my parents named me Brexton, or Braelyn, I would be an unruly teenager too.  Do you hang out a lot on r/namenerds ?", "NTA thank you for calling them out", "Nta.", "NTA - but wtf with 13 year olds having serious relationships, so fucking weird.  Let them be kids, they have time for that later.", "NTA\n\nYou only took her phone and informed other parents of their children's atrocious behaviour. \nThis is actually quite mild.\nSince she's now started telling lies I do think that therapy is a good next step. \nDo not take away the vacation though, like someone else suggested. A present given should not be taken, especially since her twin already \"cashed in\" his present. Taking her vacation will only cause her to resent her brother.\n\nBut she needs to understand that her boyfriend not wanting to come on the summer holiday was not on her brother. He's allowed to pick a vacation that matches his interest and vice versa.", "NTA- i would have been even harsher than you guys", "YTA for inviting your son's girlfriend on your daughter's trip when you didn't invite your daughter's boyfriend on your son's trip.\n\nThe comments are because you obviously favor your son and your daughter is upset. Then you compound it by punishing her because you're a jerk.", "Nta", "NTA. Your daughter is a bully and she needs to learn a hard lesson.", "YTA for giving ur kids tragedeigh names", "NTA, your racist daughter is but both of the names that you inflicted on your children are a r/tragedeigh.", "Dumb kid names\n\nHave one called braydon as well to complete the set", "Lol a girl named Braelyn has racist tendencies? Color me shocked, nominative determination is real. You did the right thing though, nip that shit in the bud. NTA.", "ESH.\n\nYour daughter is 13. For many 13 year old girls, everything is about fashion, clothes & makeup. You’re in the right to tell her she can’t police what other people choose to wear & you’re in the right to not allow her to bully others & letting her know that not everyone has to look or dress like her.\n\nThat said, I think it’s wrong that you’ve essentially told her she can’t hold a specific *opinion*. That’s my problem with all of this. Kids can ask questions & they can have their own opinions/beliefs that something someone is wearing is ugly or not their style. I understand that it’s traditional clothing & it isn’t a western style. It doesn’t mean your daughter can’t have an opinion on how something looks. She doesn’t have the right to police it, but punishing her for acting like a fashion critic is like punishing a 13 year old for existing.\n\nKids don’t always see things in the same way as their parents. They’re learning & growing & yes, it’s your job to guide them, but the more you try to force her to think like you, the more she’s going to push back.", "[deleted]", "ESH\nCongratulations, you've raised a spoiled racist bully. I'm quite curious if the Paris trip is still happening, considering she's doubled down and playing victim to family", "NTA.  I'm sorry, but I don't understand why you haven't taken away her trip to France.  Your daughter is a mean girl in the making.  Why reward that?\n\nWhen I was 13, I got a cake, a card, some cash, and some books I wanted.  Strip life down to the basics for a while to rid your daughter of her sense of entitlement.  She's not going to get any better than what she is now if you don't.", "OP seems to have more money than God, maybe they should invest in some therapy.", "NTA. Your daughter sounds clickish and Zenophobic. Forcing her compliance isn’t going to help her see the bigger picture that exists outside of her defined perspective. Plan some family trips around other cultures to expose her to a wider range of people. She needs experiences where her defined world view can receive more challenges with regards to what is normal.", "This is little more than ragebait and just taking shit away isn’t going to solve the problem of your fictional racist to begin with. Maybe try being an actual parent and teach them instead of being so passive.", "YTA. This girl is just trying to help someone become un-brainwashed and you punish her for it?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband (38M) and I (38F) have 2 children, our twins, Brexton (13M) and Braelyn (13F) turned 13 in February. Because of their milestone birthday of becoming teens, we told them they could each choose a vacation some time this year.\r  \n\r  \nFor about 2.5 weeks this summer, we went to various different baseball themed spots for Brexton, we went to a baseball bat museum and factory, Babe Ruth’s grave, and various other baseball museums etc. Brexton’s girlfriend also went to some of these places with us. \r  \n\r  \nBraelyn wanted to spend some time in France, going to places like the Eiffel Tower and to do a tour of a perfume factory. We have a trip planned for November. We asked both Brexton’s girlfriend’s parents and Braelyn’s boyfriend’s parents if they could join us and that we would pay for them and their kids. Braelyn’s boyfriend didn’t go with us to any of the baseball places, he’s a theater kid and that’s not really his thing. Brexton’s girlfriend went to his places to support him. \r  \n\r  \nThe issue is that Braelyn has recently been complaining about this arraignment to her friends, including in front of us. One of the comments her and her friends made was that Brexton’s girlfriend shouldn’t wear anything “weird”. For some context, Brexton’s girlfriend is the daughter of Ghanan immigrants. Her parents moved here a few years before she was born. Brexton’s girlfriend often wears traditional Ghanan clothes and is all about empowering herself. Her parents dress more traditionally Western, but will sometimes wear clothes from their culture. Brexton has even recently got some clothes as a gift from his girlfriend, which he has worn before. Brexton is very supportive of this, and even when it’s just my husband and him in a room and we are asking about his relationship, he will say stuff about how she looks pretty in whatever she wears. \r  \n\r  \nWhen we pressed Braelyn about this, her and her friends continued to make comments about how she should dress more “American”, suggested she get some crop tops and go to the mall and find some clothes.\r  \n\r  \nMy husband and I told her this wasn’t right, but she kept insisting she was just telling “the truth”, we told her if she continued to make these comments, she’d lose her phone until further notice. She went on, so we took her phone and then made her friends leave. We also contacted her friend’s parents and luckily, most of them were equally as horrified. Her friends are now mad at her for “getting them in trouble”, but she just shifted the blame on Brexton and we’ve heard she’s been saying stuff at school, so now we’re looking for a therapist as this has become a pattern.\r  \n\r  \nBraelyn keeps saying we’re making her life miserable and how we’re too mean, and when we went to a family BBQ last night, she shared wheat was happening and we had some family tell us we were being too harsh. AITA?\r  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "nta, your daughter is racist :(", "NTA and your daughter will be in for a shock when she gets to Paris. The cultural diversity, especially where clothes are concerned, is going to blow her mind if she is used to the entire world dressing like a basic American.", "I read your post 3 times just to be sure I wasn't seeing it properly. Why on earth do you even allow your 13 year olds to have boyfriends/girlfriends that are steady enough for you to take them on holiday. Surely this is a spoof", "NTA.  Her comments are questionable at best, racist at worst.  Also, why does she imagine it's her business how someone else dresses?  She isn't paying for the other person's clothes or anything.", "Hi! Explain to her WHY she shouldn’t say that. Not just that it’s not nice or that she shouldn’t say it. Help her understand. \n\nDefinitely NTA.", "My guess is they changed the ages for anonymity and these kids are 15/16.", "Yeah but did anyone but me notice that the boy's trip was limited to family and his gf. Sister's bf wasn't invited but for her trip everyone's invited?", "Thank you, I literally only scrolled for this. The daughter shouldn’t get the trip period if any of this real.", "r/tragedeigh", "Right?! \n\nIf those names are real, OP is TA for that alone.  Lol!!", "Lolllll came here for that and you did not disappoint!!!", "Breqstynn & Brehylhynn", "For my own peace of mind I’m going to assume they’re fake. This whole post reads like it’s fake so it’s not a stretch.", "Right? It’s getting worse", "And weeks-long trips all over the country AND to Europe just for what these kids want. Like, I was taken to Europe as a child on a family trip, but I did not get to choose the itinerary. It was not all about me. These kids sound spoiled rotten. It's no wonder they're racist and awful.", "It wasn’t uncommon when I was 13 that my peers dated, but I never heard of any of them going on couples trips overseas or across the country together. Maybe I’m just old.", "🙄🙄 christ, dude calm the fuck down. 13 year olds have bf/gf's all the time. it's literally not a big deal", "\n\n>The comments are because you obviously favor your son and your daughter is upset\n\njust because you make up a scenario to justify your verdict, doesn't make it true, and even if that *were* the case, the daughter doesn't get make borderline racist comments without being punished.", "Read the post mate she said her daughters bf was invited and didn't want to go because his a theater kid", "we did invite him, he didn't want to go", "Its a racist opinion", "It's a racist opinion dude, pretty obvious", "Ah yes. Wearing piece of clothing that helps someone be more confident in their identity be proud of their heritage is brainwashing. Don't wear too many jeans, you're just being americanly brainwashed!", "Found the racist", "your racism is showing.", "Sisters bf was invited. He didn’t go because he’s not interested", "I think the boyfriend chose not to go.  It's referenced that he's a \"theatre kid\" and that the girlfriend only went to support her boyfriend.", "Agree! Why did the girlfriends family get invited on this trip? There seemed to be no need for it. It does not sound like the kids are close or the families are close. So why would the entire family of the girlfriends of the birthday girls sibling get invited to an extravagant international trip? It’s just so odd.", "My head started spinning after the first paragraph. Only kept read because I wanted to make this exact comment 😂😂", "I get the impression that they’re older and OP changed the ages for anonymity.", "Onlh the daughter is awful", "I mean I’m 23 and find this so bizarre", "What does it even mean - they don’t have jobs so unless parents are shovelling then a bunch of money - are they going on dates to McDonald’s with their pocket money?", "Yah my kids did, but I certainly never took them to on European vacations. I'd drop them off at the mall", "Doesn’t mean she can’t hold it, that’s what freedom of thought and speech means.", "They favor the boy.\n\nI think this is why the girl is acting out.", "I don’t think the family’s are invited. Just the bf and gf", "good for you", "I didn't have any money when my current wife and I started dating at 17. \n\nWe were happy just going to parks, hanging out after school, watching movies at home with popcorn we made ourselves.", "Freedom kf speach doesn't mean freedom from consequences example \n\nI could call you a long list of insults - freedom kf speach but the mods would ban me thats thr consequences of free speach", "you seem to have forgotten that freedom of speech is not freedom of consequences", "One's own freedom stops where the other's begin...", "Well tell that to the mods when I say this is a [Removed by Reddit] take", "This is not true, we invited her boyfriend on the trip, he didn't want to go because he does not like any of the baseball stuff, as I said, he's a theater kid.", "Actually, they are invited. Read the initial post. It said “we will pay for them and their kids”. So yes the families are invited.", "Maybe I live in a parallel universe but 13 year olds having boyfriends and girlfriends to the point where you’d invite their parents on a trip and pay for it is bizarre.", "Apparently we live in the same universe.", "Personally, I have seen that happening before. So, it's not that far out tbh. \nParents are invited too because the age of the teens age. \n(OP could have changed the age for anonymity)"]}