{"id": 2663, "submission_id": "yys33k", "title": "WIBTA if I opt out of Thanksgiving with my parents because my brother and new wife (who left me out of their wedding) will be there?", "selftext": "**TL;DR My brother left me out of his wedding, I was really hurt and I set a boundary for the relationship. Thanksgiving is coming and it's too soon after the conflict for me to be comfortable around him. WIBTA for opting out this year, or offering to celebrate with just my parents on another day?**\n\nMy brother and I are 8 years apart, I’m older.  Since he was about 12 I have lived in another state.  We aren’t close, but we hang out a few times a year and it’s easy and fun.  I recently moved to the same city as he and my parents.  I envisioned us getting closer but it never really happened.  He’s the king of “I’ll call you tomorrow” with zero follow-up.  It hurts my feelings, but I’ve accepted it and take what I can get.    \n\nHe got married this past September.  I was told that there was no wedding party because his wife’s family is too big for her to make a choice and she didn’t want to leave people out.  I was given instructions to get a gray suit and that I’d be given a blue tie for pictures. \n\nThe day of the wedding I was hanging out in the mens’ dressing room and I saw that my brother has a gold tie.  And that his best friend has a gold tie.  And that his old bandmate has a gold tie.  Odd, but I didn’t think too much of it.  \n\nThe ceremony started and I was sitting in the audience.  Lo and behold, the music starts and there’s a procession.  My brother’s two gold-tie friends walk in and line up on stage left, and his wife’s sister and her husband walk in and line up on stage right.  The nonexistent wedding party.  At this point I have an almost out-of-body experience.  The ceremony was a blur.  After the ceremony we “took pictures” which means I took one picture with my brother and that was it.  I spent the cocktail hour in a stall in the bathroom, embarrassed and hurt.  \n\nI made it through dinner ok, and instead of cake my brother had made a ton of his specialty cookies for dessert.  I’m allergic to the recipe as-is, but with a simple tweak I can have them.  He didn’t make any for me, or even warn me this was happening so I could bring my own dessert.  Anyways, I left the second dancing started.  And a week later sent the newlyweds a letter saying basically “I thought things would improve once I moved here, but this wedding has shown me that we don’t have a relationship outside holidays at mom and dad’s house, so let’s just keep it real and I will see you there, being disappointed all the time isn’t healthy for either of us”.  \n\nThe problem is that Thanksgiving is upon us, and not only will they be at my parents’ house but they are bringing a couple of friends with them, so I will be really outnumbered and uncomfortable.  \n\n**WIBTA if I opt out for this one year, stating it’s too fresh of a wound for me and I’ll see y’all at Christmas?**", "created_utc": 1668798972, "permalink": "/r/AmItheAsshole/comments/yys33k/wibta_if_i_opt_out_of_thanksgiving_with_my/", "score": 122, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) Not going to Thanksgiving because of the guest list.\n\n(2) I'd be cancelling plans with my parents also, who did nothing wrong and will likely be upset that there's conflict between siblings.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "ESH\n\nBrother shouldn’t have lied about there not being a wedding party.\n\nOP needs to stop trying to force a relationship with brother that they don’t have.  Brother didn’t want you in the wedding party because you’re not close.  He didn’t make you your own special cookies at his wedding because his wedding doesn’t revolve around making sure you have a dessert.\n\nThe letter to the newlyweds was pettiness overkill, but hopefully you mean it and you finally accept that you can’t force a close relationship just because you want it.", "Why do grown adults insist upon acting like children? ESH. He should have told you.  And don't act like you're being all mature saying you \"set a boundary.\" You made a sulking ultimatum because your brother didn't give you the fancy gold tie at the wedding.", "Nah\n\nYou don't need to go.\n\nBut your brother did nothing wrong. You do not need to put siblings in the wedding party just because. Je had the desserts je wanted for his wedding. Your allergies are bad for you but don't effect wedding deserts", "Eh, I say do what makes you comfortable, but I'm also a little surprised, not by the hurt, but by the level of it.\n\nI can see your being hurt and I definitely think your brother could have taken you into consideration more, but by your own account you aren't that close. Not in age or in experiences. You didn't grow up together, you don't have a very close bond, so I'm a little confused about why your quite this upset about it. I kind of agree on the wedding party, not really about you not being a part of it, but on them saying they weren't having one and then having one. That feels like an AH move. HOWEVER, I've definitely seen more than one wedding expand almost against all wills. They go from \"no wedding party, small ceremony, 20 ppl wedding breakfast\" to \"wedding party of a dozen, three flower girls, twin ring-dog-walkers wear the ring is on the doggie collar, 300 person ceremony and reception. In Maui.\" It happens. And sometimes one sibling is basically the wedding planner and another is just a guest. It happens. It doesn't necessarily mean your brother doesn't love you, it just might mean you're not close enough for him to know these things would matter to you at his wedding, so he doesn't/didn't think to keep you apprised of any changes. It's a shame he didn't make cookies for you, but again, if you're not close, that just may not have been a priority on his mind. Maybe he didn't think dessert was a big deal. Maybe there were candies or fruit that you can have and he figured you'd eat that if you wanted something sweet after dinner.\n\nI sympathize with your feelings, but I'm not sure sending the note and then bowing out of big family gatherings is going to help exactly. It certainly doesn't seem to have lessened your hurt or anger yet. It might help more to schedule a one-on-one outing with him and work your way around to explaining how/why you were hurt at the wedding and that you would appreciate being taken more into consideration in the future.", "Yta- I’m sorry but you need to get a grip.\n I would understand if you and your brother were super close and he did this but you’re not.\n\nYou guys don’t have a close relationship.\n\nYou moved out of state during your brother’s  formative years. He didn’t grow up with you,plus there’s an almost ten year age gap between you .  And again , you guys aren’t close .\n\nI don’t understand why you expected to be made part of the wedding party and get so upset about it that you threw a tantrum and sulked in the bathroom . \n\nAnd now another tantrum for Thanksgiving.  \n\n“ but they are bringing a couple of friends with them, so I will be really outnumbered and uncomfortable.”   \n\nOutnumbered ? From what ? Are you going into battle??  Now your brother isn’t allowed to bring friends because it hurts your feeling too so you’re going to not go.  The world doesn’t revolve around you .\n\nGet some therapy dude .", "I'm going with NTA. \n\nIt sounds like you've made an effort, but he's not interested. It's sad, but you can't force something that isn't there. \n\nWhere it really sucks is that he deliberately lied to you and misled you about the wedding. And telling you what color suit and tie to wear just for photos is weird.\n\nUntil you can accept he doesn't want the same kind of relationship with you as you'd like, then you need to do what you need to do.", "NAH, I think you just really over think things at times and try too hard with your brother.", "Very soft YTA.\n\nYou moved away when he was 12 and you were 20. You're not close and just because you  moved back doesn't mean that is going to change overnight.\n\nBeing close is a two way street and it seems that you aren't willing to put the time in either unless you get immediate reward for it (in terms of being asked to be in a very small wedding party for a family member you admit you aren't close with yet)", "ESH. Your brother lied but you admit you aren’t that close.", "Yta", "Seems like it's a you problem. I'm not sure your brother is even aware there is a problem. \n\nYou want a closer relationship with your brother but it sounds like you expect him to make all the effort. It's up to you to not be so offended when it doesn't happen.", "Esh\n\nI know your much older and were buzy living your life but your brother is doing to you what you did to him all those yeard ago\n\nA d now its too late for him to care\n\nYou were invited to show he could care but his lies say otherwise\n\nAlso you have a hand in this too by not trying harder to foster a relationship earlier\n\nIts all i. The effort", "YTA.\n\nI read the title and assumed he hadn’t invited you. He didn’t leave you out of the wedding. He just didn’t make you a groomsman. You’re going to decide to not see your parents for an important holiday, damaging your relationship with them, because a brother who you aren’t close to invited you to his wedding but didn’t give you a special role?\n\nIf you’ve decided it’s past the point of trying to make this an important relationship, why give it so much of your attention? Why give up thanksgiving with your parents because of him?", "ESH -  Your brother sucks for lying about not having a wedding party. IDK why he thought he would get away with that one.  You suck for thinking that magically a relationship is going to develop because you suddenly move closer.  \n\nFirst, just because you want a relationship, doesn’t mean he does.  Second, in your email, which I have a problem with, you state your relationship is done except for holidays at your parents and now you’re skipping out of holidays with your parents?  Sounds like your relationship with your brother has been constant for over a decade and now you’re upset about it.   \n\nI wonder how much your brother looked up to you growing up and how much you ignored him.", "I'm struggling to see what the issue is here.  You already stated that you and your brother aren't really close, so the gold tie/blue tie... maybe not so surprising?  \"I envisioned us getting closer but it never really happened\" does sum that up.\n\nYou've both never been close so the gold tie/blue tie... you're not in the \"inner circle\" per se with a brother you've never really been close too.\n\nGranted, that can still hurt when you're family by blood, but if you don't really have a solid relationship it might not be that much of an issue...at least to your brother.\n\nWhether you turn up to thanksgiving or not is really up to you. You're not an AH either way.  If something like this has effected you then might be worth bringing it up with your brother... yet if you already admit that you're not that close then perhaps it's not as big an issue that it needs to be.", "YTA and I'd suggest therapy to deal with your issues. Yall aren't close, have never been close as adults or even as kids, lived away from the family and you expected to be in his small wedding party. Yeah he should have been upfront about it with you but man you have some major overreactions. Stay away from thanksgiving if you want but man get help.", "Going against the grain here with NTA. He lied about no wedding party. Why? If you two are not that close, you did not expect to be asked did you? Lots of people don't have their siblings in the wedding party but it's just strange to flat-out lie about it. Did he think you wouldn't notice? He told you a specific color suit to wear and that you would be given a tie for pictures. Again why? If you're not in the wedding party why does the color suit and tie you are wearing matter? \n\nAlso, he didn't make sure there was a dessert you could eat. I know \"it's his wedding day\" blah, blah but he wasn't making the cookies the day of and he could have made a couple for his brother. \n\nI think part of this is simply you were not a part of his life for awhile so a close, brotherly bond did not form or some siblings are fine with each other but not close. If going to Thanksgiving would upset you, then don't go. You do not have to put yourself in optional situations that will cause you distress. He has not  shown that he wants to a closer relationship. He LIED to you about his wedding. I'd skip Thanksgiving, try Christmas and just start making friends and having a life. You'll find your people.", "Christ in a cracker, what did I just read?! \n\nYou seem to have convinced yourself that moving to the same town as your brother entitles you to a close relationship with him. It does not. \n\n> this wedding has shown me that we don’t have a relationship outside holidays at mom and dad’s house\n\nYou already knew the type of relationship you and your brother have. You moved away when you were 20 and he was 12. He may not want a close relationship with you, and while that sucks, you have to respect that. \n\nYou had a temper tantrum because you weren’t in a very small wedding party. Which are usually reserved for those we are closest with. That wouldn’t be you. It sucks they lied, but that’s the only thing your brother did wrong. \n\n> He didn’t even make any for me\n\nAs much as I hate to say it, there is not one single person on this planet who is entitled to dessert. Y’all aren’t close, maybe he forgot about your allergy. He made the dessert for his wedding himself. Maybe he had a lot going on and totally forgot in his busyness. \n\nSurely your mom and dad knew about the cookies. They could have given you a heads up, so you might want to be upset with them as well. \n\nThe long and short of it is, it was your brother’s wedding. You were included, just not as much as you believe you deserve for some reason. Nothing on that day was about you. \n\nYTA and from the sound of it, an exhausting one.", "NTA, their wedding isn’t about you, but the number of lies/miscommunication to sideline you is wild. I feel like we’re missing some other details about your relationship with your brother, but still going with not an AH. The letter to them after the wedding was an aggressive unnecessary move, tbh", "NTA, you don't have to go if you don't want to and you don't have to force yourself to have a good relationship with \"family\" who don't want to put the effort in. Maybe he just doesn't like you and it's a none personal thing, you've just grown up out of his life.", "YTA. Your brother wasn’t obligated to have you in his wedding, period. He should have been straight with you about having groomsmen but he was likely afraid you’d react badly, which you did. You “established a boundary” because you didn’t get to be in his wedding? That’s ridiculous, especially since you aren’t close and didn’t really grow up with him.", "I’m sorry but yeah YTA. You admit that you’ve not lived in the same state as your brother since he was 12, and now you’ve moved back you expected to what be best man at his wedding. You be his best friend and want to hang all the time? He has his own life and own friends.", "NTA for not going but YTA for your behavior surrounding the wedding.  You locked yourself on the bathroom stall for an hour?!   \n\nSiblings do not equal auto best friends and it sounds like you moved back into town and expected him to center you in his life.  This isn’t reasonable or particularly mature.", "It seems like you have hurt feelings which is fine but I think your actions are closing in on AH territory. You moved away when he was 12 and you aren't going to magically be close overnight. Wanting a close relationship with your brother isn't wrong it's just going to work. You're practically strangers at the moment. And you're acting like you've been alighted by a close friend. \n\nDoes your brother know you have allergies? Did you mention it to him any time between when he got engaged and the wedding?\n\n>I was told that there was no wedding party because his wife’s family is too big for her to make a choice and she didn’t want to leave people out. I was given instructions to get a gray suit and that I’d be given a blue tie for pictures. \n\nNow this is odd. Did you expect to be a groomsman? Again you're not close and while some people would include siblings out of obligation many people only have people actually close to them in their wedding party. It's also possible that the wedding party planned changed but since you aren't close you weren't on the short list for groomsman.", "Yta he didn’t need to include you in the wedding party. You are making their wedding about you and acting like a petulant child who didn’t get his way so you throw a temper tantrum", "<<so let’s just keep it real and I will see you there>>\n \nESH, you and your brother both suck here. \n\nYou said you were willing to see each other at family holidays, and now you're instead choosing to skip the event altogether, which punishes your parents and is frankly just childish.\n\nYour brother doesn't owe you a place in his wedding party. But he should have been honest about it.", "NAH.  You don't want to go,  don't go.  You were at the wedding,  just didn't have the role you expected, so I don't think brother is AH either.", "YTA. it sounds like their \"wedding party\" was just a few people who are very close to them. it's completely unreasonable for you to hold a grudge over this. learn to let the little things go.", "Nta. \nEven though you are not close with a sibling, you should at least include them in major events in life. That's what i believe. Op tried to form a relationship with him btw was treated like a complete stranger. Thats why op is hurt. And he has the right to be hurt. About the Allergy thing op's brother should have notice it. Siblings are related by blood even though they live far btw we do have memories with them.Everyone will give judgments based on their experience. If my brother acted this way i would be hurt. And about the thanksgiving day op if you want to see your parents you should go. You will be visiting your parents not your brother just act civil. No need to try to get to know them or want a apology. Just act they are invisible. You can take a friend if you want to. Or you can visit them other day. Don't give your brother so much attention op cz in the end they Won't care about your feelings", "NTA. Your feelings are real. You get to decide if it's too painful for you.\n\nBut.... it's not unusual for people to choose friends to be in their wedding party, especially if they aren't close (physically or geographically) to family members. I can't believe anyone was looking at you and thinking \"what a loser, his brother didn't ask him to be in the wedding party\". \n\nYes, you get to opt out if you really think it's too painful. But be aware that this will probably be seen as you trying to create drama. I doubt if the your brother or anyone else will think \"wow, I didn't realize how badly he was hurt, I was really terrible to him\". They'll just think you need to get over it. Which is what I think: I'm sorry this hurt you, but it will be better for you if you can try to let this go. Maybe you and your brother can be closer in the future, maybe not, but making an issue out of this isn't going to endear you to him.", "ESH, but a little heavier toward the YTA. \n\nHe doesn’t owe you a place in the wedding.  You said yourself that you’ve never been close. \n\nHowever, he’s a little bit TA for lying about it instead of telling you the truth from the beginning so you would have time to process the hurt before the wedding.", "INFO. What was your brother's reaction to your letter? And what was your parents' reaction?\n\nWith current info, I'd say a soft ESH. You shouldn't expect to be a part of his wedding party, he shouldn't have lied. Yes, he and his bride could have made something you could eat, but he may not have been involved in the catering, and it honestly doesn't sound like you guys are close. You are not obligated to go to Thanksgiving, but this is something you should have considered a while ago. I'd suggest going, but having a ready made excuse. Think of them as cousins you are visiting, worthy of polite conversation, but not a lot of effort.", "NTA you don’t have to hang out with people that lie to you.", "NTA - You would not be the AH for skipping Thanksgiving. However, your brother is only the AH in this situation because he lied about the wedding party. He didn’t do anything wrong by only including the people he was close to in the wedding party.", "YTA. You were the adult when he was the child, and didn’t make an effort to be close to him. You moved back recently and still weren’t close. Of course he would want people he’s close to in his wedding party, not a sibling with whom he has no relationship. I understand that you we hurt, but that’s no reason to make drama or take it out on him. You want to declare that you’re “wounded?” That’s foolish. You wanted to be close but now you want to cut him off? It sounds like you’ve never been willing to put in the work to have an actual relationship with your brother. And now you want to make it awkward for the rest of your family. This very much sounds like a case of you having a very fragile ego.", "YTA - the title made it sound like you weren’t invited to the wedding at all but you just weren’t in the bridal party? Y’all aren’t close, since he was 12 you have lived away from him, you weren’t there for his big life milestones! It sounds like their bridal party was very small. You are making a mountain out of nothing!!", "YTA- It wasn't your big day, it was your brothers and its their choice of who they want in their wedding.  I wasn't in my brothers wedding, but his wife's family was and he was more active in mine (we literally only had a maid of honor and best man), sometimes you just have to let things go move on.  There is no reason to be embarrassed by it though,  that is confusing to me as to why you were", "YTA. And here’s why:\n\nDid you express that you would like to use the opportunity of moving closer to your brother as a way to get closer? Was he aware that you were upset about the wedding situation outside of your passive aggressive letter? \n\nBy your own admission you said you weren’t close….so it’s odd you’d be shocked you weren’t chosen for the wedding party - however informal it may be. \n\nI get that having allergies at events sucks but the groom made the dessert for his own wedding…. If this was your wedding, fair enough but the day isn’t really about you. \n\nIt’s fine if you are too hurt to attend Thanksgiving but I think you could use it as an opportunity to rekindle the relationship and start fresh.", "YTA. \n\nYou admitted that you’re not close to your brother because you moved away when he was a kid. You don’t have a close relationship now. He shouldn’t have lied that there was no wedding party, but adding you to the party might have been what would have caused the issue with her having to choose from her family. Ultimately, you are not entitled to being in the wedding party just because you share parents. You’re the only one with an issue here, and you’re turning a non-conflict into an ordeal that includes missing out on family events where you could potentially become closer. That’s on you. \n\nTherapy is a great place to process your hurt feelings.", "A little bit YTA. I understand your feelings are hurt but there is quite a large gap in your ages and being far away for so long means the two of you don't actually know each other all that well. It's very unrealistic of you to expect to have the kind of relationship with him that does in fact take years to develop, as soon as you return. Skipping Thanksgiving is not going to help develop that either. Spending time together is how that happens. You were at the wedding, in that respect you may be acting a bit melodramatic.", "NTA. Seems your brother lied to you about the big day and didn't have an ounce of remorse. If you're still trying to calm down from that and go it'll just turn your parents' house into a battleground. I don't think you'd want to subject your parents to outright aggression. Maybe visit sometime before or after Thanksgiving when your brother isn't there.", "NTA, do what makes you comfortable", "INFO: How did they respond to your letter?\n\nAs someone with ADHD who really struggles with RSD sometimes, you’re not an AH for being upset but you might want to look into therapy or other ways to help when things feel really hurtful.\n\nIf you and your brother aren’t close and they decided to keep the wedding party super small then it’s not surprising he went with two close friends.  Idk if he purposely lied about it, but it’s possible that they just changed their minds.  Planning a wedding is usually hectic and stressful.  It’s supposed to be about the couple getting married, but there’s often hundreds of outside opinions/expectations that you have to deal with too.  I highly doubt your brother was purposely slighting you.  It was his wedding, not yours, so of course he prioritized himself instead of you.  You can be hurt, but it’s unreasonable for you to hold it against him.", "YTA, it sounds like you wanted the wedding about you and the attention of being the groom’s brother? You’re admittedly not close and were not around for at least a third of his life. It sounds like you had a major overreaction. A lot of people don’t even care about desert at a wedding, but you expected special desert just for you. Weird thing to get upset about, when they probably spent lots of money, planning, and stress on organizing a wedding to be expected to cater to a brother who the groom didn’t have a relationship with for years. And then while they should be living the newlywed life, you sent them a passive aggressive letter. You chose to move away. You don’t get to have a brotherly relationship by declaring you want one. And if it is truly important to you, you’re not going about it the right way to make it happen.", "You don't have to go. But your brother did  othing wrong. Just in case you weren't aware, it was his wedding day, he could have whoever he wanted up front with him, and he could serve whatever he wanted as dessert. You sound like a petulant child. Hiding  in the bathroom  was silly, no one would have thought anything of it that he chose two best friends as groomsmen. People need to stop expecting siblings to include them in their wedding party purely because they are siblings", "Soft YTA. By your own admission you're not close, don't see each other often, and there's an age gap so I assume you didn't overlap at home for very long. Should he have been upfront with you about the wedding party? Yes. But he was under no obligation to include you.", "ESH\n\nYour brother should have handled the wedding better with regards to the wedding party.  All he had to say was \"We're keeping it very small and not really doing a traditional wedding \"party\".  I'm only going to have my two best men, and she's only going to have her sister and husband as her matron/man of honor.\"  Why lie?  \n\nBut man, you took it WAY too personally for a day that is ultimately *not about you*.  Y'all are not close, never have been, but you're having a meltdown over not being in the wedding party?  Sibling or not, you should never expect to be in a wedding party of someone you're not close to.  I understand why his lie hurt, but hiding in a stall in the bathroom because you, a grown man, can't handle not being in the wedding party of a sibling you aren't close to? Come on.  And you are ONE GUEST.  They aren't going to make a special dessert just for you.  It's dessert.  It's not essential.  You were not harmed by not having dessert for one night.  It's not like you were not fed.  And again, this night is NOT ABOUT YOU, so perhaps forgive them for not giving you a heads up to bring your own cookies.  It was understandably probably quite low on their priority list.  \n\nAnd then the letter.  You ever think the reason your brother isn't super interested in a deeper relationship with you is because you handle problems like a middle schooler instead of having a conversation about it like an adult?  I don't have time for adults who write me petty letters either.  Invite me over for coffee and talk to me like an adult, call me on the phone, whatever is possible, but give me a chance to talk it out and give my side.    \n\nLook, your brother isn't obligated to give you the relationship you want with him.  This is the relationship he is interested in having.  You need to come to terms with that and move forward, one way or another.  And you need to do it in an adult manner, so stop with the middle school meltdowns every time other people don't give you what you want from them.  Their lives aren't about you.\n\nDon't go to Thanksgiving if you don't want to, that's your call, but don't expect anyone to side with you on it.", "YTA, you are overthinking and seeing \"insults\" coming your way that are not. This day isn't about you, it's about your brother celebrating with the family and close friends he's known. You are also over reacting as these \"slights\" are happening. Relationships are built over time so give yourself the time to build a closer relationship with your brother that you haven't known since he was 12.", "ESH.\n\nIt’s really hard to maintain sibling relationships across state borders. It’s not at all surprising that he doesn’t feel close or connected to you. I do really understand this because when I was 16 my 9 year old brother went to another state to live with his fathers family. We saw each other on occasion, and loved each other, but that relationship of siblings was permanently broken by distance (this was before smartphones etc).\n\nWe’ve gotten a little bit closer with many modes of communication at our disposal, but I would never expect that he would ask me to be a part of his wedding party. \n\nI’m going to assume most of this hurt is coming from a feeling of being lied to, which is why your brother sucks too, he should of sucked it up and just told you—\n\n— but for you to have this expectation to be in his party when you made it clear you’re basically pen pals is unrealistic. I’m sorry reality was so disappointing but you’ve got to come to terms with the fact that you’re simply not that close to your brother.\n\nETA and now you’re putting your parents in the middle. Completely unfair.", "Ehhh... NAH? \n\nYour brother doesn't owe you a relationship. He doesn't owe you a spot in his wedding. You left when he was...what, 12? I don't think you say current ages or how long you lived elsewhere, but it's at least 6 years if he got married. \n\nSo...a third or better of his life you weren't around. Now that you've decided you want to be close, he's not interested. It happens. \n\nYou seem to regret this. Again, it happens. \n\nYall are siblings, not friends. He shouldn't have lied about not having a wedding party, you shouldn't have sent him a letter that reads as an attempted guilt trip, but meh. \n\nDoes seem like there may be some relevant backstory missing, but I don't think it'd really change my opinion. Yall are siblings, not friends, and from what's presented nothing screams AH, just uninterested (him) and vaguely hurt because of it (you).\n\nEdit: oh, I forgot to specify why the NAH re: Thanksgiving- so long as you aren't pouty or make drama for your parents, going to a family event is your choice. I'd personally suggest you just go and get it over with if this is really all the 'problem' with it tho. Otherwise you may find it's still fresh come Christmas, and the summer holidays you may as well spend with friends anyway, they aren't really 'family' days, and man... this is awkward, we're back at Thanksgiving again and everyone is going to think I've spent the past year sulking.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTL;DR My brother left me out of his wedding, I was really hurt and I set a boundary for the relationship. Thanksgiving is coming and it's too soon after the conflict for me to be comfortable around him. WIBTA for opting out this year, or offering to celebrate with just my parents on another day?\n\nMy brother and I are 8 years apart, I’m older.  Since he was about 12 I have lived in another state.  We aren’t close, but we hang out a few times a year and it’s easy and fun.  I recently moved to the same city as he and my parents.  I envisioned us getting closer but it never really happened.  He’s the king of “I’ll call you tomorrow” with zero follow-up.  It hurts my feelings, but I’ve accepted it and take what I can get.    \n\nHe got married this past September.  I was told that there was no wedding party because his wife’s family is too big for her to make a choice and she didn’t want to leave people out.  I was given instructions to get a gray suit and that I’d be given a blue tie for pictures. \n\nThe day of the wedding I was hanging out in the mens’ dressing room and I saw that my brother has a gold tie.  And that his best friend has a gold tie.  And that his old bandmate has a gold tie.  Odd, but I didn’t think too much of it.  \n\nThe ceremony started and I was sitting in the audience.  Lo and behold, the music starts and there’s a procession.  My brother’s two gold-tie friends walk in and line up on stage left, and his wife’s sister and her husband walk in and line up on stage right.  The nonexistent wedding party.  At this point I have an almost out-of-body experience.  The ceremony was a blur.  After the ceremony we “took pictures” which means I took one picture with my brother and that was it.  I spent the cocktail hour in a stall in the bathroom, embarrassed and hurt.  \n\nI made it through dinner ok, and instead of cake my brother had made a ton of his specialty cookies for dessert.  I’m allergic to the recipe as-is, but with a simple tweak I can have them.  He didn’t make any for me, or even warn me this was happening so I could bring my own dessert.  Anyways, I left the second dancing started.  And a week later sent the newlyweds a letter saying basically “I thought things would improve once I moved here, but this wedding has shown me that we don’t have a relationship outside holidays at mom and dad’s house, so let’s just keep it real and I will see you there, being disappointed all the time isn’t healthy for either of us”.  \n\nThe problem is that Thanksgiving is upon us, and not only will they be at my parents’ house but they are bringing a couple of friends with them, so I will be really outnumbered and uncomfortable.  \n\n**WIBTA if I opt out for this one year, stating it’s too fresh of a wound for me and I’ll see y’all at Christmas?**\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "info: do you plan hangs with your brother?", "Regarding families and holiday dinners.  Seems as if there are more families with dissensions than otherwise. The word “family”. Not everyone in every family is close or (due to their particular circumstances) want to be close. Unfortunately, just being born into a family does not guarantee familial love or anything close.  If people don’t want to go to a family member’s house for a holiday dinner for whatever reason, don’t go.  Sometimes trying to love or care about a family member just isn’t in the cards - for whatever reason.  Please do what is in your comfort zone.", "I am 8 years older than my brother. He was in 5th grade when I left for college. We do not have a close relationship and with our age difference I would never expect to have one. I wouldn’t expect to be part of the wedding party when he gets married. \n\nWe are acquaintances by blood, at best. \n\nDo what you need to do in regards to Thanksgiving, but know that he’s just not that in to you.", "I mean don't go if you can't go and be happy and have a good time. Your brother did nothing wrong though. His wedding isn't about you, to make it about you is selfish. Not sure how many other people were a the wedding but I am sure many had reasons they couldn't eat the dessert.   \n\n\nI am torn between ESH and YTA   \n\n\nI have a feeling he lied because of how dramatic you are currently being.", "NTA (possible N A H)  \ny'all just aren't close, you had a recent let down and feel like skipping. I understand. However.... the thing that I haven't seen any comments on in a quick skim is that your brother is bringing some friends as well?!  \nOkay now that changes the equation. If it was just a small family thing I'd encourage you to go (though I wouldn't judge you if you didn't) but him having some random friends there to reinforce his side of it all.... yeah no I'd nope out as well in this situation just on that. I don't know if your brother is the \"type\" to get bolder with friends around but I just wouldn't chance it.", "NTA if you don’t attend, because I don’t think it’s in your best interests to go break bread with them.  Your expectations and reactions are so extreme that I think perhaps your brother knew best not to put you in the wedding party. His wedding was about him and his bride and the bridal couple having the people they are closest to in their wedding party, not adding you because you expected it as a family member.  A blue tie and no special cookies was not an attack. Do not attend,  because you will choose to be “outnumbered” and will take great umbrage at every perceived slight.", "You wouldn’t be the asshole for skipping out", "I don't have a judgment but please opt out of the holidays and just make yourself happy. Trust me I have been in a similar situation.", "NAH - you are hurt, but he isn't 'wrong'. You have the right to not go home for THX, and your letter was just a statement of your feelings. Feelings aren't right or wrong, they just are. \nHe didn't owe you a spot in the wedding, and it's possible that - to them - the processional was not really a true 'wedding party'. Definitions differ. But, if you are being polite and forthcoming about your plan to miss the holiday at your parents, you aren't doing anything AH-ish. \nHowever: you guys need to talk this out and work on getting closer, because life is short.", " NTA - just find some friends that are doing a friendship giving and stay away from the toxic family.\nLook how easily they lied to you about the wedding.", "Nta my dude and wow at all the comments blaming you. He was inconsiderate, your feelings are justified. It would have taken him no time to explain to you that the wedding party is limited or anything else etc (I assume it was limited to two and two on each side for symmetry reasons and the bride couldn't pick a third). To the comments saying that they don't understand why you're upset if yall weren't close or that the day wasn't about you: OP is still his brother and was his older brother in the house for twelve whole years. \n\nSkip Thanksgiving or make a brief appearance but I wouldn't bring up the wedding again.", "NTA. I've been in a similar situation. I think these things just happen, especially when there is a huge age gap in siblings. If it's going to bother you, you don't have to go. Your happiness matters too.", "YWNBTA\n\nHowever, you said that you would see them there only for holidays, and now you are upset because they will be there?\n\nI think you really need to examine why you feel the way you do in an overall sense. You're right to be hurt about the wedding,  and it's weird that they thought it was ok to lie in such a big way. There's a lot more going on than just a wedding and some cookies.\n\nFind somewhere else where your presence is appreciated and spend holidays there. Don't make a big stink about it, but politely decline and have a better time elsewhere.", "The only issue here I have is your brother lied about there not being a wedding party at all. He should have been honest that he didnt choose you to be in it. \n\nHe obviously doesnt feel close to you or care the way you care about him. Thats ok. He doesnt have to. Being related by blood doesnt mean he has to be close to you.\n\nHe doesnt have to have you in the wedding party.\n\nHe doesnt have to cater to your dietary restrictions at his own wedding. Sure it would have been nice. But he has just shown you once again that you are not as important to him as you believe he is to you. \n\nYou are also ok not to go to thanksgiving because you have suddenly realised this and do not want to hang out with him anymore. IMO the letter was unnecessary.", "NAH, but you are doing it wrong if you want a relationship with your brother. First you show up and be happy to see him. \n\nYeah,  it does sound like he mislead you about the wedding party,  when he should have told you up front that they were keeping the groomsman count down. You already knew that you were not his closest friend, even though you seem to crave a closer bond. \n\nPhones and invitations work both ways: instead of waiting for him to call you,  you can call him and invite him and his bride,  or just him,  out to a thing you'll both enjoy: be that fishing,  a game,  a movie, paint ball.. whatever. He will turn you down sometimes..I don't know his schedule and he has a new bride and extra family now, but keep asking,  keep the conversation going, call. Just to chat,  even without making plans. Stop putting up boundries when you are craving closeness. (Boundries are sometimes good and needed in toxic relationships,  but your brother doesn't sound toxic. Don't add a barrier when what you should be doing is tearing them down. )", "Sweetheart I’m so sorry. It’s hard to let go of a sibling relationship especially when their friends appear to take priority over you. Why not try Thanksgiving with an open mind? Then no one can say that you didn’t try.", "NTA. I honestly don't understand the YTA posts; OP's brother was under no obligation to include him in the wedding party but lying to him about whether there was one was an unnecessary lie told for no other reason than to be hurtful. That behavior is so cruel and inexcusable that it's shocking to me that so many people are completely ignoring it.", "NTA. Your brother isn't required to have OP in his wedding party, but lying to OP about there being no wedding party instead of admitting he didn't feel close enough was a shitty move. I think that is the main thing that hurt. \n\nAnd to people saying the couple aren't required to cater to dietary restrictions, every RSVP I've ever received had a section for dietary restrictions, so maybe it's a cultural or being considerate thing? I fet accidently missing a random attendee's allergy, but not accommodating his own brother sucks.", "NTA. If you’d rather not go, don’t go. It’s not like you’re giving your parents an ultimatum re: you or your brother (as I’ve read in other posts). Your brother lied to you about the wedding party and didn’t think about your dietary restrictions, so I can see why you’d be hurt. Nothing wrong with taking a little time to cool off before seeing him at family functions again.", "you WNBTA for passing on Thanksgiving with your brother.  In fact, I say skip it and do something really amazing that they'll all be talking about in your absence. \n\nYour brother sounds selfish, maybe self absorbed. Stop looking for a relationship with him and I get it, it hurts.  But the bottom line is he doesn't appreciate you. Move on and surround yourself with people who do!", "NTA self care isn’t selfish. If this is what’s best for your mental health, don’t go.", "NTA and won’t be if you decide to miss Christmas too. In the meantime, join the gym, find groups with hobbies or pastimes that you enjoy. Make friends into family and start living your best life. Don’t dwell on what didn’t materialize, it’s futile.", "NTA, although skipping Tgiving may take any chance of semi comfortable relationship so think about it. \n\nCookies. Weddings involve hundreds of details. If brother knew of OPs issue, it is dead simple to make a single different batch OR easier to say bring a dessert. Geez. OP, maybe just pocket pack a dessert bc even a cake might not have worked. In our family we say \"Be smarter than your food\". That is, both pick an effective utensil and more broadly, work the problem. This you could do.\n\nWedding party... said not wedding party. Was wedding party. Slap in face. AH family. \n\nAdvice: Go for T dinner right at mealtime, and have friends to go to for dessert, real or otherwise. You show your FO face, take wind from their sails and keep self respect. \n\nLiving happy without them is the best revenge.", "That makes sense, me trying to force it.  I guess it's hard to take that your brother doesn't actually care.  The letter was more about the last two years of him repeatedly and blatantly blowing me off.  It wasn't mean, it was just acknowledging that we have no friendship and the wedding made it evident to me, and let's not pretend to be friends because getting blown off all the time is taking a toll on me emotionally.  Not for nothing, my entire family feels him pulling away and acting frankly like someone we don't recognize.  He used to be sweet and considerate, now he's angry and selfish all the time.  It's bad enough that we've had serious conversations about him maybe having a brain tumor...the personality flip over the last 5 years has been overt and concerning.", "I honestly don’t think the brother lied I think they had there witnesses walk with them and didn’t have a wedding party, it makes sense that it’s that way because of the way they stood at the alter, possibly two of them were there to sign the wedding certificate and they other two where the witnesses plus ones that’s why the BIL was there", "He never said op was in wedding party, just to wear a grey suit.", "I can see that perspective. It wasn't so much an ultimatum as \"ok, I get it now, I'll stop trying to be a friend-brother and let's just run onto each other at holidays\".  Nothing mean or aggressive or even weepy.  Just \"I'll stop knocking since you're not answering\".", ">But your brother did nothing wrong\n\nHe flat out lied to OP about there not being a wedding party. His brother didn't have to put him in it, obviously. But, to outright lie and say that they weren't having one, rather than saying, we aren't close enough for you to be in the party, is a total dick move. Especially, since he knew his brother was going to be at the wedding and see that he intentionally lied. Of course OP felt humiliated, his brother didn't even have the decency to tell the truth.", "No, lying about that shit is straight up weird and impolite. \n\nBrother isn’t an asshole for not having him in the wedding party, but he’s still an asshole.", "I absolutely get it, but we're talking about a two-second \"maybe I won't put cream on two of these two hundred cookies so my brother can have a couple\".  My measuring stick is that I'd do that for him without even thinking about it.", "Meat forks at 7pm on the driveway!\n\nCompetitor, you will go on my first  whistle, challenger you'll go on my second whistle!\n\nFIGGGGHHHHHTTTTTTT", "You're 100% right about both things there.  Most of my friends would say the same thing.", "Naw. At worst this is an E-S-H. The brother straight up lied to OP knowing OP would be present to see the truth revealed and would probably be hurt. I actually think NTA is the best fit though.", "I second the seek therapy suggestion, not so much YTA though, more ESH", "I completely disagree. I am in the same situation with my little brother as OP( moved away early, 8 years apart, didn't really ever get to be close as adults as I'm in another country) and yet we still care about each other a lot. We remember each other's preferences, allergies, he was at my small wedding and helped organise a lot of it. \n\nIt's all about the kind of person OP's brother grew up to be. I wouldn't call him an A, but he definitely sounds unpleasant and uncaring. \nThen again, we only have one side of the story. Maybe OP ignored his brother all his life but now laments that he is being treated with disregard.", "Have you ever planned a wedding? It is super common to change wedding party plans throughout the process. It sounds like the brother never intended to invite OP to be a part of the wedding party, which is fine. They’re not close. It makes no sense to tell someone “we’re not planning on having a wedding party at this exact moment we’re talking, but even if we change our minds you won’t be invited for it”. \n\nBaking your own dessert for the reception is a huge undertaking. Yes, ideally some alternatives should have been offered, but I can’t really blame the groom for not wanting to spend extra hour(s) making small batch versions. I doubt it was a pointed insult to OP unless the groom did go out of his way to make other versions.\n\nOP is hurt and that is valid. But he is also blowing this out of proportion.", "YTA and looking for trouble everywhere.\n\nI missed the rule that says siblings are automatically part of the wedding party, even if they are realistically estranged.\n\nWith basically no relationship, does your brother even know, or remember, that you have a food issue?\n\nOP, you were invited to the wedding cuz you're family but in reality you're just an acquaintance.  You don't really have much of a relationship with your brother.  If you want one, put in the effort and maybe he will accept and reciprocate.  And maybe he won't but you don't know if you don't try.", ">I saw that my brother has a gold tie.  And that his best friend has a gold tie.  And that his old bandmate has a gold tie.\n\nWhere did you read best man?", "Ok, it sounds hilariously melodramatic but no one noticed I was gone, and I just wasn't going to be able to fake smiley conversations with anyone.  \n\nI expected him to follow up with basic plans, he almost never did.  The wedding was just the final \"dude I don't care about you, figure it out\" gesture.", "One of the groomsmen is a friend he seems once a year max and who is wife literally hates.  I hang out with them at my parents house multiple times per year and we always have a good time.  And no one in my family forgets allergies, I promise that.", "No, he didn’t need to include him—but lying about it does make brother an asshole.", "I think not being included in the wedding party is  not at all the same as being told there isn’t a wedding party and then seeing that there was a wedding party, but your brother lied to you about it are two very very different things.  One would be the brother’s choice, the other is juts cruel. I would not want to be around someone who acts like that.  Is there a more clear sign of utter disrespect and disregard.  NTA", "Agreed. Brother didn't have to lie about no real ceremony, but OP's taking it too personal that someone he doesn't have a close relationship with didn't include him in the ceremony, especially since the people that were weren't siblings but friends.\n\nNAH.", "I almost wonder if he misunderstood and his brother was trying to explain they weren't having a traditional wedding party (since it sounds like close family members were also not included on her side) or his brother was trying to communicate that she was also not having family members in her party.", "YTA\n\nOP seems to be making his brother’s wedding about him \n\nOP wasn’t a part of the wedding party (when they aren’t even close)\nOP was barely in the photos. \nOP couldn’t eat the cookies. \n\nOp is 8 years older and loved out of state for at least 8 years (assuming brother is at least 20). What did OP expect? TBH, even asking if you are in the wedding party is abbot presumptive. And maybe they changed their minds later on. But OP is being very very odd here.", "His reaction was to send the letter to my parents.  I have no idea what would make him do that.  \nHe made the cookies by hand himself.  The more I talk about the cookies the stupider it sounds.  It was the point behind them lol.", "I’m thinking OP and his brother have a different definition of wedding party just because they are wearing the same color tie.  This reminds me of a movie tv show, forget which one, where the one character (OP) is very upset with the other (the brother) and the brother causally says ‘I don’t think about you at all’", "I mean, I only got 3000 characters.  It's been *years* of him blowing me off and me repeatedly forgiving him and trying again.  And him acting like we're buddies.  The wedding, his friends knowing nothing about me, just drove it all home.", "i think it's less that OP wasn't in the wedding party so much as he was lied to about there being one at all. because it wasn't a frank 'hey, we're not as close as we could be and i want other guys to stand up with me, sorry' - dude found out at the wedding, there was a concentrated effort to shut this guy out.", "I think the lie about having no wedding party was what really stuck and why OP was shocked.", "Why lie about it though? Wouldn't the brother at least also be an asshole? Liars are assholes\n\nIt's at least ESH", "It’s possible they changed their mind after he asked, TBH.", "Another thing I didn't have room for: Meeting his friends and bandmates I slowly realized they know nothing about me.  All my friends know *everything* about him.", "Yes, over and over he says he will call me in the morning tomorrow and we will hang...and then blows me off.  Like, a dozen times a year.", "Dude, he's just not that into you.", "I mean, it is possible the tumor caused his personality change. Brain tumors can do that", "Yeah but he did say there was **no** wedding party.", "To send that letter at all is mean, aggressive and weepy.", "I'm leaning towards NTA, but really, why send the letter? Why not just stop knocking?", "I feel like there's something missing here. We recently planned our wedding and we never had to tell our siblings that they weren't in the wedding party. If we didn't invite them to be a part of it, then their assumption was that they weren't in the party. I feel like a good reason for a bride/groom to explicitly tell someone that they aren't in the wedding party or if there is no wedding party is because that person is asking about being part of the wedding party. If OP asked his brother about it and couldn't take no for an answer, then I can see why the bride/groom would tell him there is no wedding party.\n\nWhy would the OP feel humiliated? It's not like the bride/groom announced to everyone that there is no wedding party and that's why the OP is not in it, and then when there was a wedding party, everyone was like HA HA OP you're not in the wedding party.", "Coming from someone who has dietary restrictions, you cannot expect others to accommodate you, especially at large events. I have been to events (yes, even weddings) where I was not able to eat much of anything.  One time, all I could eat were some raw veggies. And I am never able to have dessert.  That is a \"me\" problem, not a \"them\" problem.  \n\nI can see where you are coming from. I always accommodate people's allergies, intolerances, and preferences.  But, I do not do it because it is required.  I do it because I want to.  And, even with that, I never expect others to accommodate me.", "Like other commenters have stated, you and your brother aren’t particularly close at all. What makes you think he remembers you have a dietary restriction, and on top of that, with how much detail goes into planning a wedding, even if he did remember, why do you treat it as an intentional slight against you instead of “my brother has been busy and it slipped his mind when he was preparing desserts for 100 people”?", "You just need to remember that not everything is about you. He had a lot on his mind for his wedding and trying to make sure everyone is taken care of as much as possible. But it’s his special day not yours. I was pretty shocked that you expected a desert that he made have a different batch just for you. That’s a ridiculous thing to be mad at him for. Also getting upset over the symbolism of what color of tie to be worn isn’t about you either. He probably could have done better there but again no reason to make it about you. \nI’m not sure how old you are but hopefully not that old yet. \n\nYou could slim thanksgiving but you shouldn’t. It’s just petty and really you’re hurting yourself to some extent. Think about all the good food. Thank about spending time with your family. All of my family that I had thanksgiving with have either died or in a nursing home like my mom. But I don’t have to look back and wish I would have spent time with them during thanksgiving because I always did. So it’s mostly happy times I reflect on. \n\nIf you really feel strongly about your brother’s actions at his wedding, the best revenge is to live your best life. Go there and avoid him but still have a good time and a good meal. Show him you’re fine with or without him.", "I'm sorry but you sound super entitled. We planned our wedding and while we collected dietary restrictions, we did not adhere to all of them for every single thing we served. My husband's best man is allergic to dairy but we served cheesecake for our dessert, not to slight him, but because we LOVE cheesecake. Their wedding isn't about you.\n\nIf they started doing what you said, like not putting dairy on two of these cookies, then other people are going to expect that they accommodate their dietary restrictions for some dishes and then it becomes a logistical nightmare to deal with, not to mention the additional costs from the caterer.", "200 cookies, so I assume it’s a big wedding.  He probably has bigger things to think about other than if you want a cookie, get over yourself, sounds like your brother won’t even notice if you show up to thanksgiving", "Is the cream in a topping?  If so, that's a reasonable request.\n\nBut if this is an ingredient in the dough, then what you're actually asking for is for him to make you a special BATCH.  That's more likely 12 ish cookies, and since when people make cookies in bulk they generally prep the dough all at once and then just bake, you're also asking him to double his prep time and space needs.  Not only that, you can't just remove an ingredient from a recipe without ruining it.  He would need to *sub* something in place of that cream, and substitutions are trickier than you think.  It's very understandable why a person baking 200 cookies for their own wedding wouldn't have the time, space, or inclination to accommodate a single guest's dietary restrictions. When you don't have a commercial kitchen, a bulk bake is challenging enough and a special batch may just be outside your capabilities. Plus if you don't have a ready substitution for a particular ingredient, you'll probably need a bake or two to get the substitution right.  That's a lot.  And for something like dessert, which not everyone eats anyway, I wouldn't say they're really required to.", "Yeah maybe that would be better but probably figured if told in advance there would have been a massive hissy fit all the way to the wedding", "I don’t think he read this at all.  The brother lied to OP and said there was no wedding party.  That’s messed up.  This isn’t about whether or not he was in the bridal party.  It would be expected to be in your brother’s wedding party.  But it is the brothers choice.  Lying and gaslighting about there not being a wedding party is just cruel and disrespectful.", "He was insuating that the matching ties made them a wedding party so I said best man as an analogy of that", "So do you plan to sit out every holiday?  What are you expecting to happen here?  \n\nI get you are upset but even the comment that no one noticed you were gone is dramatic, too.  Were you expecting people to ask where you were or to notice you were upset?  People may have noticed but chose to not bring it up. You seem like a lot.", "Wtf does your brother owe you for his wedding plans? You say follow up with basic plans as though he was supposed to be planning things for your wedding.", "You expect your brother to be a friend but you are 8 years older and have been absent his adult life.  This isn’t a reasonable expectation.  He’s acting appropriately for your existing relationship.  If you want a better relationship, you (you not him\nbecause you are the one who wants it) need to work at this.  And throwing a tantrum over your not getting enough attention as a part of the wedding party or via cookie focus is not the way.  \n\nWas he in your wedding? Did you have a close friendship as adults before you moved back?", "Even if you spend time together it won't automatically get you in the wedding party. If you don't want to to see brother and are prepared to deal with the possible consequences that is your decision.", "What did he lie about? I was given instructions to get a gray suit and that I’d be given a blue tie for pictures.“ it says nothing about him being in wedding party", "Absolutely this!!", "The bride's sister and brother in law were included. I don't think he misunderstood, they just didn't want to tell OP he wasn't in the wedding party.", "that's what i would assume as well. i've experienced fewer and fewer weddings where they have the huge bridal parties with all the matchy-matchy outfits. it seems to be more like a best friend or two stand with the bride and groom and that's it.", "Agreed. That’s why I didn’t vote NTA.  I think OP is more in the wrong than his brother, but his brother is still wrong for lying.", "It's Mad Men the TV show, Don Draper says it to some underling.", "Forgiving him?\n\nI understand that it hurts. Pain doesn’t mean the other person did something wrong. He hasn’t wronged you by not wanting a relationship.", "Well, judging how offended Op gets at things , I have a feeling younger brother wanted to avoid his drama .", "Then do not take him at his words but look at his actions. He does not care for you. Let him go. Focus on being happy on your own. Find what makes you happy.", "i understand, and will probably go with ESH. you said you’d see em, so see em. and while they lied you’re the older one here and should just move on. family is not always the people we share blood with.", "Did you read it?  :)  Its complimentary, respectful, and matter of fact.  \n\nBasically: You don't want me in your life as a friend, I will stop trying.  I'll be very glad to see you at mom and dads but lets call it what it is.  A relationship that happens at mom and dads.", "My brother-in-law (sister's husband) has quite severe celiac disease.  Our wedding reception didn't have a meal, only hot cocoa,  cupcakes,  cookies and veggie trays. But we had a luncheon after the ceremony (the ceremony was immediate family only). I specifically ordered a gluten-free meal from the caterer for the luncheon for him.  When we start distributing the meals,  I pull out his (they're in boxes) and I say to my sister, \"Where's [husband]?\" She tells me that he left to go get something for himself,  because they hadn't assumed that I'd have something for him.  And this was when it was the luncheon for family only.  This wasn't one of the reception treats for literally hundreds of people.", "Trust me, no on in our family forgets food restrictions.  It's a thing.", "The brother flat out lied to him about the wedding party. The brother took the time to think about a lie instead of just being honest about the wedding party.", "The thing is I'd never leave him out of anything.  He's my brother.", "It is not expected to be in a siblings wedding party.  Especially when the siblings aren't close.", "Ah okay", "About there not being a wedding party because the bride's family is too big.", ">his wife’s family is too big for her to make a choice\n\nFrom the post, she picked two (only one that was blood related).", "But lying wouldn't help since he would see the wedding.", "So you say you \"be very glad to see you at mom and dads\" but now want to make Thanksgiving ultimatums that you won't be there if he is. That is deliberately going back on your word. Also if you aren't close why would you be in his wedding? None of my siblings were because we aren't close. One niece was because I'm close to her. Nobody threw a tantrum or even expected it.", ">Its complimentary, respectful, and matter of fact.\n\nNot really.  It could be worse, yes, but... You don't need to tell someone you're going to stop making efforts to be friends. Sending that kind of letter reads like a passive-aggressive attempt at getting him to go \"oh no I want you in my life after all\" or a guilt trip.", "I read what you wrote in the original post.  If that isn't the original letter, then cool.  But your summary is an unnecessary and whiny letter. If you don't want a relationship with him,  you don't need to announce that. \n\n To say,  \"I wanted a relationship,  but you clearly don't,  so I'll honor your wishes and when we only see each other at mom and dads, it will be your fault!\"? Really,  dude.  Even writing that. I can't imagine you as an adult.  I can only picture a nine-year-child writing a letter under their door to their parents after they've been punished.", "Then show up at mom and dad’s. He shouldn’t have lied to you but you are way over sensitive. If it was that hurtful to you, be the bigger person. I know that sounds trite, but this is a situation where it applies. If you don’t go, all that will happen is this situation will fester and become a much bigger deal than it should be.", "But you’re not happy to do that plus sending that letter right after there wedding, I mean come on", "No it is not. Your message doesn't get through.\n\nIf people outside of your brain say they convey a bad message, it conveys a bad message, maybe you're not articulate enough to understand your own letter.", "Maybe the OP asked about being part of the wedding party and couldn't take no for an answer, or hinted about wanting to be part of the wedding party but the brother didn't want him in the wedding party. I can't see someone just randomly saying out of the blue \"we aren't going to have a wedding party\" with zero context.", "Didn’t you say in your post that you lived out of state from the time he was 12 until presumably this year?", "You cannot expect people to treat you, to the standard you hold yourself to. Let it go and start adjusting your expectations to the reality of your relationship. Don't go to Thanksgiving if it is going to make you feel like crap, but also don't make your parents feel like they have to choose. You are the one with the issue.", "You kind of did, though? Like you left him out of your entire life from the time he was a small child? You left when he was 12, which means you were 20–totally, and very definitively, the only adult in the relationship for the six years after you left. Children don’t have the financial or emotional resources or the life experience to manage a long-distance relationship—when someone leaves you as a child, they’re gone, unless they make a point of coming back. It sounds like you missed basically all of his most formative years, you don’t mention if you were close before (presumably not, since you were a teenager and he was a small child), and that is pretty much on you. Yes, he’s an adult *now*, but I think you owe him a debt of effort here. You knew you didn’t have a real relationship outside of your familial connection and you seem to see it as equally your shared responsibility to build one. I bet he doesn’t; I bet he feels like you had a long time to build a relationship with him and you chose to go live your own life instead, so now he’s going off to live his. You have an opportunity, instead of acting out at Thanksgiving that you weren’t lauded for your minimum effort, to build an honest relationship with your brother from scratch. What if you showed up and instead of sulking that you’re “outnumbered” made an effort to get to know his wife and his friends? Used this as an opportunity to show him why he should want a relationship with you? The mere fact of your existence clearly isn’t enough motivation, so offer more if you want more.", "I mentioned it in another comment but I truly think this was probably a miscommunication or understanding. They had 3 guys and 1 girl come stand by them. \n\nBy their definition, this might not have been a \"wedding party\" that included multiple friends and relatives. Obviously, close relatives of the bride were also not included so OP wasn't being singled out.", "Or maybe it was a last minute decision ? The bride was the one having second thoughts about it since her family is so big , she probably changed her mind and picked her people . Same as the brother .  OP isn’t owed any explanations on decisions his brother makes for his own wedding .\n\nI get feeling left out sucks , but by OP’s own admittance, they are not close.", "Shoot.  I was trying to avoid passive-aggressive, which to me would have been just stopping communication.  I figured explaining the shift in my behavior and why it's happening felt like the healthy thing to do.  Not pointing fingers, just saying \"I get it now\".", "I'm going more with the brother is completely indifferent to the OP and didn't care.", "For some reason my gut is telling me there is a reason the brother lied about the existence of the wedding party. I think it was a play to avoid drama; Like bro knew OP would be whiny about it and would beg/demand to be included. \n\nProbably would’ve ended in the OP not even going to the wedding after ‘being insulted’.\n\nEither way I don’t think bro could’ve avoided souring his relationship with OP, so chose the path that resulted in OP coming to the wedding and shifted all the drama to after as much as possible.\n\nNot saying that’s a good choice, but I get why the bro might have gone down that path.", "Yeah I do too. OP is coming across as incredibly needy and self centred. They didn’t foster a relationship when they weren’t living close by and now that they have moved back, they seem to have expected way too much. Life rarely works like that and the importance they placed on themselves and their expectations are frankly draining to read. I have to say ESH because of the cookie oversight, but I’m definitely leaning to the OP being the asshole suffering from a major case of main character syndrome. A lie about a wedding party, so as the brother didn’t have to deal with the neediness and expectations of a brother they had never been close to, whilst planning their wedding, not the greatest choice, but I can certainly understand it.", "Exactly what I was thinking."]}