{"id": 26700, "submission_id": "16giu5w", "title": "AITA for refusing to pay for my dentist appointment because they were late?", "selftext": "I made a dentist appointment for 5.30pm. I arrived early, got registered and waited. At about 6.15pm I told them I couldn't wait any longer and I had to leave.\n\nI had a dinner reservation at 7.00pm. I had planned this bearing in mind they could be running late, so I gave myself 30 extra minutes in the appointment (30 minutes waiting, 30 minutes in the appointment and arriving 10 minutes early to register and 30 minutes to travel to the restaurant).\n\nWhen I told them I had to leave, they looked shocked and told me I had to pay a cancellation fee. I told them no - my appointment was 45 minutes ago, I showed up and they did not. If I had missed the appointment by 45 minutes, they could refuse to see me and still charge me.\n\nThey offered to 'squeeze me in' right away and let me jump the queue, but I again refused because it would give me only 15 minutes of an appointment - I noticed the people before me were being seen within about 10 minutes each, and this guy was above market prices so I didn't want a quick and rushed job.\n\nI left without paying and the waiting room full of people seemed to be judging me pretty hard. It was extremely uncomfortable but objectively I feel they were holding me hostage.\n\nAm I the asshole here? Should I have anticipated the dentist would be more than 45 minutes late and just turned down dinner plans?", "created_utc": 1694496964, "permalink": "/r/AmItheAsshole/comments/16giu5w/aita_for_refusing_to_pay_for_my_dentist/", "score": 291, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) I refused to pay the dentist's cancelation fee.\n\n(2) It might make me the asshole because that was their clear policy and no one else in the dentist office was complaining about the wait or refusing to pay the cancellation fee.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA You have every right to leave and not pay for cancelling given they failed to attend to you in a reasonable time. If only you could invoice them for failing to provide the promised service at the agreed time.", "NTA.  While I get that sometimes patient visits can go longer than the scheduled allotment time, this seems excessive. I've had this issue many times with optometrists as well as dr visits.  Sometimes things can't be helped on their end, which means they need to be equally understanding when you have a place to be.  If they still try to charge you a cancellation fee, I would definitely bring that up.  It has to go both ways.", "Definitely NTA and possibly a public hero. More of us need to do this. Delays are all too commonplace in medical businesses. \n\nAt a recent doctors appointment, his name was listed as a 3 hour delay. I rescheduled on the spot. A quick call from his office would’ve prevented my struggle to get there and back. He’s not an ER/ED or surgical physician. Completely unacceptable.", "NTA. I wish I could have been in the waiting room to applaud you. It’s all fine and dandy for them to try this trick but they have no common sense that it’s actually their problem. You should have insisted they pay you tbh!", "NTA. You patiently waited. Your time is important too. \n\nThough I’m not sure who schedules a dinner that close to a dentist appointment since you often can’t eat or drink for a minimum of 30 minutes after. But whatever.  Still NTA", "Nta. Once they're late, you have no obligation.", "NTA\n\nThere's no reason why patients before you were being seen within 10 minutes while you're waiting for 45 minutes.", "NTA.  I had this with a dentist many years ago.  The practice was notorious for keeping you waiting way beyond what was acceptable.  \nOn this particular occasion, I entered my dentist's waiting room and noticed a shiny new poster over the mantlepiece with a list of fines that would be imposed upon patients according to how late they were attending their appointment - the later you were, the higher the fine.  Not a problem for me as I am.always early for my appointments.  \nI sat and waited and half an hour after my scheduled appointment, I went to reception to ask how much longer I would have to wait?  Not long now, I was told with no apology.  I returned to the waiting room and waited a further half an hour.  At this point I was becoming rather angry as had business elsewhere and was now likely to be late.  At forty minutes (one hour and ten minutes total past my appointment time), I returned to reception and let them.know that I could not wait any longer to keep my appointment and, in view of the new notice about fines for lateness, I expect a similar amount to be deducted from my bill when I did eventually see the dentist.  They were visibly shocked and apologetic but I could wait no longer and left.\nI eventually saw my dentist a few weeks later.   His first words to me were an apology for the previous visit.  I told him I still expected a discount on the bill in view of the new notice in the waiting room.  He laughed but saw that I was serious. He had the good grace to only charge me half the usual check-up fee.\nI can't say it was related but the next time I went, the notice had disappeared and shortly after that, he set up a new practice with a colleague completely separate from the old practice.  I stayed with him another twenty-plus years until he retired.", "NTA. Fight it all the way to the supreme Court if they try to charge you", "NTA. Things happen is healthcare to delay care all the time, it's life. However, dentists schedule their appointment based on production, so they cram people in to make as much money as possible. Good job for reminding them your time is more valuable than their profit.", "NTA\n\nYou were right", "NTA\n\nYour time matters too.", "You are a hero. Morenpeople should do this.", "NTA \n\nYou didn’t cancel - they did", "NTA, it's true if you were 45minutes late they would give your place to someone else, I've seen it happen in a Dentist before, they cancelled this woman's appointment because she was 20 minutes late and I'm sitting there in the waiting room 30minutes after my appointment time!", "One thing to remember is that the later your appointment is, the greater chance that they will be running late.", "NTA. \n\nThis is every doctor now. Your appointment time is actually time that a 30 minute period of waiting in the waiting room begins. This interval resets upon entering the examination room.", "NTA.  You were plenty patient until you no longer had the time to be so.  In this busy world we live in, we all often have multiple time commitments.  In no way could you be expected to just wait and wait.  They should have informed you upon check in how far behind they were running and offered you the option of rescheduling.  This was on them.  No need to pay them for an appointment they clearly didn't have the time to give you.", "NTA you paid for a scheduled service, you were on time, and you did not receive the service even after waiting quite a while. There is nothing for you to pay them for.", "NTA you made an appointment because the Drs time is valuable and must be scheduled.  This doesn’t mean your time is not!  They missed your appointment and not by just 15 minutes, but closer to an hour.", "NTA at all and I wish more people would do this. It's gotten out of control and doctors will just let you sit around for ages like your time doesn't matter at all.", "NTA. Go find a new dentist who doesn't double or triple book.", "Nta", "I am mostly curious about ehy you have a dinner after dentist, unless it was just to check? Eating can be a bit of a risk with your mouth numb.  \n\nMaybe maybe not t a. Is a bit difficult as doctors are busy too and have tighte schedule, i wouldnt be surprised of you got a bill home for unpaid visit.  Depends ofcourse how things work over there", "NTA - I think you should get a discount of $1 for every 5 mins doctors are over the appointment time.  \nThey might start actually being on time.  \nI understand some patients need a few minutes when others need longer but doctors should account for this.", "NTA but why would you schedule dinner right after a dentist appointment. You’re not supposed to eat or drink for like an hour after", "NTA but I would be wary of booking dinner so soon after a dental appointment as certain treatments can require 30mins or an hour before food and water. \n\nYou gave them time and waited a reasonable ammount. It could be they had to squeeze in an emergency appointment and that messed up the schedule but they should have told you if that were the case. If you are going to that dentist again I'd make sure to leave extra time but that's only because you know what you now know. \n\nYou left a reasonable ammount of time and you didn't cancel so no cancellation fee should be applicable. Hope you weren't stressed about it and had a lovely dinner.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI made a dentist appointment for 5.30pm. I arrived early, got registered and waited. At about 6.15pm I told them I couldn't wait any longer and I had to leave.\n\nI had a dinner reservation at 7.00pm. I had planned this bearing in mind they could be running late, so I gave myself 30 extra minutes in the appointment (30 minutes waiting, 30 minutes in the appointment and arriving 10 minutes early to register and 30 minutes to travel to the restaurant).\n\nWhen I told them I had to leave, they looked shocked and told me I had to pay a cancellation fee. I told them no - my appointment was 45 minutes ago, I showed up and they did not. If I had missed the appointment by 45 minutes, they could refuse to see me and still charge me.\n\nThey offered to 'squeeze me in' right away and let me jump the queue, but I again refused because it would give me only 15 minutes of an appointment - I noticed the people before me were being seen within about 10 minutes each, and this guy was above market prices so I didn't want a quick and rushed job.\n\nI left without paying and the waiting room full of people seemed to be judging me pretty hard. It was extremely uncomfortable but objectively I feel they were holding me hostage.\n\nAm I the asshole here? Should I have anticipated the dentist would be more than 45 minutes late and just turned down dinner plans?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I would have done the exact same thing", "NTA\n\nYour time is valuable too.\n\nI remember I went to see a doctor at a clinic I was normally attending at the time.  Generally at this clinic, they tended not to run any more than about 30 mins late.  Sometimes they were even on time!  This wasn't my usual GP but I'd seen a few GP's there and the wait times were similar for all of them.\n\nSo one day I had an after noon shift and booked a time to see the GP that would've given me 45 mins leeway of wait time (and then + the appointment time) and still get to work on time.  Anyhow, 40 mins past the time, I started to get antsy, 45 mins past the appointment, more antsy.  About 50 mins past the appointment time I got really antsy and thought that if I don't get called in within the next 5 mins then I actually don't have time for my appointment.  Well 5 mins later... still didn't get called up.  So I went to the desk and said I've been waiting almost an hour, I now have to go because I don't have time for the appointment and I have to get to work (I was in uniform).  The receptionist said it was fine.  Then a couple of weeks later I get a letter in the mail... because you were a no show to your appointment, this was your one chance and next time we'll take you off our patient list.  WTH... I was in you fricking waiting room for almost an hour... I should've billed you for MY time.  I think I did ring them and reminded them and when I saw my usual doctor, she wasn't impressed either and said it was an admin thing and they have no idea.  I think she took the 'no show' off my file.\n\nThere are some occupations where you are guaranteed a wait and a general doctor is one of them.  Specialists tend to be a lot better and they don't run anywhere near as late (but still can) as these often only do clinics and are there rather than on call for emergencies and doing two jobs on the one day (an exception is an OB).  But psychologists tend to be on time, physios etc.  I get why doctors run late ie patient brings in the family instead of just the one appointment they made for themselves and just wants the doctor to run over the kids... Many doctors might do one and then tell the patient they need to make an appt for each kid or book a longer time.  And emergencies happen... and things that may have looked easy are actually more complicated ie patient comes in for a repeat prescription but on talking to them the GP realises that their mental health is suffering because something has happened between this appt and the last and next thing they know they are doing a mental health screen and referring them for more help... when it was meant to be a quick repeat prescription for their anti cholesterol drugs.", "Nta", "nta", "NTA. in the past 35 years, only once have I had to wait more than 5-10 minutes for a doctor or dentist. The one time I did, I was about 24 years old taking my toddler for a check up and they misplaced his file so I didn’t get called back until at 30 minutes I checked with reception to see what the hold up was. My pediatrician told me to never wait more than 5 minutes, they don’t allow overbooking. I hope that you didn’t sign anything that allows them to collect a cancellation fee even if they’re running significantly behind.", "NTA.   \nMy dentist‘s receptionist rings me when he’s running 10mins late and lets me know.   \n\n\nEnd of the day appts are often running over time (pro tip: get first or first after lunch appts, they run on time), but to expect you to hang around and ‘jump the queue’ (ie you weren’t even the next scheduled person - someone else was in front of you!) after 45mins late is … crappy service. To expect you to pay then isn’t going to happen.   \n\n\nBut… you’ll need to find a new dentist now. You can’t really trust them again right?", "NTA.", "NTA they also said you could jump the queue so how long would you have been sitting there?", "NTA.  I had an appointment with a specialist for a follow up scheduled over my lunch hour.  We were extremely swamped at work and I had responsible for a huge project and working long hours into the night, every night.  I went to the appointment and sat in the waiting room for 2 hours, finally I am moved to an exam room.  Waited there for 30 more min. I finally came out and told the desk I could not wait any longer and needed to reschedule.  They seemed shocked, and told me that they would send him in right then.  He flung the door open and said that he heard that I was in an extreme hurry and what was the issue.  I responded that I wasn’t in a “hurry” but that it had been 2 and 1/2 hours of waiting and I needed to get back to work.  He was very peeved with me.", "NTA I work in dentistry and they handled this situation really badly. You waited a long time, weren’t able to wait longer, they should’ve rebooked you at your earliest convenience. That is standard practice in private dentistry.", "Nta.", "NTA - Good for you. I’ve done this as well. It’s not my fault you over book every day. Plan accordingly. The only business that gets away with this is the medical industry. This needs to not be normalized.", "A dentist open in the evening? Never heard of such a thing.", "\"shocked pikachu face\". NTA\n\nits like you make a reservation at a restaurant, get there, get your table, make your order and leave after 3.5h of waiting for your meal. that happened to me once. they said i had to pay my meal, i asked them what i ate, she gave me the receipt and i told her to fuck off to the kitchen and ask when its ready and call me when its done. \\*shocked pikachu face\\* i havent recieved a call till this date. seems like some rather long cooking process for a simple noodle dish. moral of the story, you dont pay for service that didnt happen", "NTA. While I understand that medical/dental services often run over or run late, I do find it disrespectful of the patient's time!  45 minutes is a long time to wait (when you likely would have been done the appointment in that time). It sounds like you didn't cause a scene, but rather, quite rightly IMO, left to be on time for your next appointment.  That's on the dentist's for a poor or opportunistic booking system!", "NTA. They should be paying you", "NTA. If there was already a queue, they knew when you checked in the dentist was behind schedule. You should have been informed and given the option to wait or reschedule.", "NTA\n\nI understand when you visit a GP and have to wait up to an hour, especially later in day due to very different issues people come to MDs and allowed usual 15 mins scheduling/insurance or public healthcare constraints, or if it's a special Dr that can in on call in hospital.\n\nFor dentists? Completely unacceptable. My mum is dentist, she knows with what issues people come to her, what time frame is needed and when to simply schedule second appointment. Of course extreme cases happen, but there was no tooth fairy prison break emergency in your case.", "Nobody judged you. They were just happy to have one person less in front of them in the line.\n\nBut in any case, NTA.", "Were they judging you or were they jealous? Lol. You're absolutely NTA.  You didn't cancel, they were a no-show.  I've done this before, myself. If they get bouncy I always remind them my time is valuable too, and if I'd shown up 10 minutes late they'd have told me I had to reschedule and pay a cancelation fee.\n\nI understand the nature of a doctor's job means sometimes they're running late, an emergency came up, an appt took longer than expected, etc.  But have the courtesy to inform patients so they can make their own call to reschedule or wait. \n\nAlso, how disrespectful to all the other people who have also been waiting so long, to arbitrarily tell you that since you're fed up and leaving you can now skip them in line?", "NTA\n\nThat's outrageous.", "NTA. If you have an appointment you show up to and they don't that's on them. The idea they'd charge you is the asshole move.\n\nProblem with this isn't that you did it. It's that it won't happen in large enough numbers to impact their bottom line and make them stop overbooking. And their egos are inflated so you'll get an excuse depending on the profession. Dental staff will make something up about helping someone in pain or blame insurance. Medical? \"The doctor was busy saving lives.\" No, the doctor was busy at his golf game most likely.\n\nIt's a nice fantasy though. That everyone with an appointment tells them they're too late after a 15 minute wait and walks out without paying. They'd probably get some things together if it happened for a while.", "> the waiting room full of people seemed to be judging me pretty hard.\n\nWhy would they care? Wouldn't they be happy that there's one less person in line", "I went to an ophthalmologist back in May. As I was filling out my new patient forms, people kept coming up to the reception desk asking how much longer. The receptionists were getting peeved. So finally after about 15 minutes of people asking, one receptionist stands up and says the doctor is running over an hour behind (on top of the hour long appt process). They gave us the option to reschedule without a fee. Most of us did, but had to wait another two months for an appointment. Who has time for a two hour appointment plus drive time?", "If you were 45 minutes they would have charged you and refused to see you.\n\nBut you not paying is completely reasonable. They did not provide a service at the time they said they would.\n\nNTA", "This sounds like the same dentist office my son goes to. They are so aggravating with their wait times. Sadly they are one of the few who sees autism patients", "NTA They overbook so they can rake in the money and have no appreciation for anyone's time.  30 minutes is the absolute limit that anyone should have to wait, barring some real emergency in the office.\n\nI was waiting for a doctor's appointment once when they were really backed up.  The man sitting next to me took out a piece of paper, wrote something on it and took it to the front desk.  It was a bill for his time!  I thought he was a boss.", "NTA. \n\nI did this at Apsen dental after they made me wait for 1 hour 45 minutes for my appointment.\n\nI walked up and asked them what the problem was.\n\nThey forgot I was waiting there.\n\nI thanked them for the service, left and wrote pages and pages of yelp, Google and everywhere reviews.\n\nYes, I leave reviews for businesses on Yelp, you know why? Because they will then blackmail the company to buy their service and show mostly negative reviews until they pay up.\n\nSo yeah, Yelp is bad, for businesses.\n\nI never review good places on Yelp unless they asks me to.", "NTA.You go, girl!", "NTA your appointment was 5.30 p.m and you were on time for your appointment period.", "Not only are you NTA - I personally believe that you are a shining example 'of how to act in this situation.  Far too many people would just take all of that lying down, but you put them in their place.", "NTA.  I've done this at a doctor's office.  That's why I try to get early morning appointments...the doctor is less likely to be running late at 8 in the morning.", "NTA, this one's pretty open and shut to be honest. \n\nBy that logic they could have been delayed all day yet still demanded a cancellation fee. If the dentist is running that late you not being there anymore might actually give them some time back to catch up! Nah sod that.\n\nAlso no, you shouldn't have sacrificed your night, I had complications with my teeth for upwards of five years and the most we were EVER late was 10 mins, 45 is a joke I'd have walked out long before then!", "NTA \n\nWhile I always expect to wait at any doctor or dentist, 45 min is too long, and being asked to pay a cancellation fee in that situation is silly.", "And why would the remaining patients be judging her?\n\nI'd be happy as heck that means one less person on the queue in line for the dentist.", "Well actually it can be helped by NOT overbooking.  DRs are notorious for never being on time.  There is a clear solution, however that means they would \"lose money\" by not being able to charge the patient or the insurance company. Its on them for not having better time management skills.\n\nDRs think that because a patient is sick and needs to see them that they can do what ever they want and take as long as they want.  What they dont seem to realize is that word of mouth can make or break their practice.  Leave a review and find a new doctor/dentist", "Yes and the when the patient is 10 minutes late, they cancel your appointment and charge a late fee.  Even when the Dr. Is an hour behind.", "Same here in the UK. If I'd made doctors/dentists wait the length of time they've made me wait (several times), I'd be getting a warning about being chucked off the books. \n\nAnd alas, patients don't get the luxury of a 'zero tolerance' policy, either. NHS surgeries (rightly) have warnings pinned up on the wall, re: how their staff won't tolerate any abuse. \nHowever, I've witnessed that policy being thoroughly exploited. Certain staff apply it to patients, who are merely expressing unhappiness (often over a long wait). \n\nI've also lost count of the number of times I've encountered snippy or rude staff (often when they are time-pressured). However, there's no zero tolerance policy for patients, when that happens!\n\nThe NHS is a complex organisation, full of pros and cons. But patients are often held hostage here, as the NHS is the only option they have for medical treatment. Sure, you can complain. But it's generally only the nice staff, who genuinely consider complaints. And the nice staff don't exploit the zero tolerance policy (nor be rude to you), in the first place.", "Thanks! The appointment was marked only as a check up and consultation because I need to get dental implants, no procedures were actually scheduled to be done.", "OP doesn’t say they were having any actual work done, so they probably wouldn’t have a numb mouth and would be fine having a meal out.\n\nNTA OP, they were the ones who were late, not you. If they charge you for a missed appointment you should contest it.", "It was a routine examination and also to get x-rays and discuss dental implants and bone grafts. So no actual procedures but a big, expensive decision.\n\nAside from running late, a big concern was that he was really speeding through everyone. When I arrived there were already 4 people waiting to be seen and he was racing through them giving them each only about 10 minutes in the chair. He seemed to be short on admin staff because he was also himself processing some payments and paperwork for the patients.\n\nIt's one thing if the appointment is late, but it's an even bigger issue if the appointment is rushed and half-assed. I really may as well not have an appointment at that stage.", "An hour? If you have a root canal, maybe. More like 30 mins usually.", "Edit: NTA at all", "Judging her because she has the intestinal fortitude to walk out without paying when the dentist is so far behind schedule - something they wish they had!   My dentist has me in the chair within five minutes of my appointment time; if he didn't, I would find a new dentist who had respect for my time as well as his.", "They were probably a little jealous and a lot happy that you left so they wouldn’t have to wait as long.", "Actually in the case of doctors it's mostly not their fault. \n\nThe insurance companies set the time limit for the appointments. They cap them at 15 minutes.  \n\nMost doctors are reasonable people and realize issues can't be fixed in 15 minutes and still give patients the time they need which results in long wait times. \n\nMy ortho clinic schedules appointments every 5 minutes. \n\nIt's insane. \n\nMy issues are often weird and uncommon and take a lot longer than 5 minutes.", "I agree 100% with you!  However, in capitalistic societies such as the one i live in (USA), that will never happen.  Sad state of affairs.", "> Well actually it can be helped by NOT overbooking.\n\nHelped yes but not totally avoided. Emergencies happen, some medical problems are more urgent than others and might require more time than anticipated. Now, if a doctor is *always* late then that's obviously not what's causing it, but even with the best scheduling it can happen sometimes.", "So basically since you werent bringing in the big bucks on a procedure that day, you werent a priority to the dentist, therefore you can just wait until he is ready for you.", "Makes sense then. That was more just a curiosity thing as I only go for cleanings and get stuck with the whole “wait 30 mins.” Lol\n\nI’ve worked as a medical and dental secretary. I would’ve never thought to charge you a cancellation fee when we were the ones behind schedule.", "Yeah as someone who works patient facing Healthcare (pharmacy), this is all on the doctor. He either isn't paying fair enough wages to generate interest in his administration vacancies, or he's a terrible/incompetent boss and his turnover rate is thru the roof. \n\nEither way, it's his fault, and it makes me wonder about his quality of work.", "Starting a private practice now and competing is incredibly difficult. I got Doc Friends to watch it because of this exact problem. They hate seeing so many patients every day. But they have no choice but to start their own practice", "Yes, and that is fine, but they should not be allow to charge a cancellation fee if you appointment time has passed.", "We have public healthcare in my country so insurance companies have no say in the time doctors spend with their patients and guess what... they're still late 90% of the time.", ">Actually in the case of doctors it's mostly not their fault.\n\nnah, its there fault, they know how long appointments take and can schedule appropriatly.", "There's plenty of things to like about the healthcare systems elsewhere over the US one, but I don't think wait times are often lower...", "I live in a country that has both public and private, working as a doctor. \n\nI have worked in the public system while doing my medical residency. I still have war memories of the \"wounds clinic\" (a room were I would control, clean and take care of all wounds, newer surgical ones and old cronical patients). I remember being booked up to 30 patients (normal was 1 spreadsheat of 15) to see in the 2 hours I had in between doing other daily things.\n\nDo you know how you see a person in 4 minutes?\n\nYou don't. \n\nYou can't welcome the person, wait for them to undress, check the wound, clean it, pack it again, make new recipes for medicine or other treatments if the patient needs it, and complete the spreadsheet in 4 - 8 minutes. That even less if talking about a mobility impaired person, or an older fellow that will take more time getting dressed/undressed (and that's undertandable and fine!)\n\nI was \"lucky\" to have a trained nurse along me to help me doing it...or having a residence workmate helping a few times.\n\nPublic system is no better. In both public and private you have a boss (the state or the insurance company/the owner of the clinic) that WILL overwork you as much as they can.\n\n\nHowever I don't see the point in still asking money for a thing that hasn't been done because of private overbooking (and I work privately now). OP should go up to the clinic and complain about the dentist only having 10 minutes for the consult and having to rush patients.", "What country is that? German here and especially psychologists seem to get shafted harder by our governmental health care than I would have thought possible.", "Totally agree.  Fact office has 6 exam rooms, schedule 6 patients every 15 minutes, single Dr can’t do it all, but will bill line mad.  NTA", "Nope. I'm a soon to be graduating medical student and I've learned the tough fact that doctors don't get to choose. Their corporations require them to perform a certain amount of RVU's a quarter, meaning they have to see a certain amount of patients. If they fail to meet the required RVU amount then they could get fired.", "They have nothing to do with scheduling", "Let me guess - when you're in a restaurant, you blame the server and give them a crap tip when it takes longer than expected for your food to come out.", "It's absolutely the case in Australia, they never run on time", "of course they do, they choose how many patients they will see in a day.\n\nif they need 20 minute per paitent they can choose to only schedule as many as they can see eith that in mind.", "Maybe in a private practice. \n\nMost practices are groups now. The office manager chooses how many patients doctors sees a day based off information from insurance.  \n\nTrust me my general practice doctor wishes he could see less patients a day. He combats it by taking the time patients need. He's worth the wait. I combat it back by only booking the first appointment of the day. I easily make at least 3 people late for their appointments because we take our time. \n\nHe often stays way later than scheduled as well to make sure the patients get their time \n\nTheir hands are tied.", "And these practice groups purchase the doctors at a slave market is Tulsa?\n \nOr did they freely enter into this agreement willingly as free men?\n \nYou know who else willingly decided to join an enterprise that screws people? Pirates. Did we let them off scott free for willingly joining the whims of the ~~office manager~~ ships captain? Nope, hanged by the neck until dead.", "Well pirates didn’t treat people for medical issues as a part of their job, did they? If we hang the doctors that work in high volume locations where this is more of an issue, all that does is make less doctors food the same number of patients who need to be seen, so you’re either waiting months (and likely over a year) for an appointment or you’re shit outta luck and can’t get one. You want more doctors going to those high volume locations so that the amount of time you wait goes down, not up.", "It's incredibly difficult to start a private practice now and compete. I've had doc friends look into this because of this exact issue. They hate seeing that many patients per day. But they don't have a choice if they can't start their own practice", "The 1717 Act of Grace signed by George I gave them amnesty, provided they surrendered before the deadline.", "The ship’s surgeon and the surgeon’s mate did, just fyi."]}