{"id": 26736, "submission_id": "16gzihy", "title": "AITA For not immediately driving to bail my stepdaughter out of jail", "selftext": "My wife (40F) has a 19-year-old daughter (Meg) that is starting her second year of college.  Meg attends a state school that is about a 4-hour drive from where we live.  She started classes about 2 weeks ago.  Meg has taken out loans to pay for her college and lives on campus so she has no rent and has access to food on campus.  She worked all summer so she has a fair amount of her own money, but we still provide her with $100/month to help her out.  \n\nThis past weekend, my wife got a call from Meg at 3am.  Every parents' worst nightmare because no call at that time is good news.  Thankfully, Meg was OK, but she had gotten arrested.  Apparently, she had been at a party with friends and gotten drunk.  She walked home with a group, but split off with a couple other friends at some point.  This smaller group walked up to what they thought was one of their houses, but it wasn't.  \n\nThe people who lived there did not appreciate the door bell ringing at 2am and called the police instead of opening the door.  When the cops showed up, Meg and the others ran.  Meg got caught and arrested.  She called us from jail and wanted us to come bail her out.  \n\nMy wife practically jumped out of bed and started to get ready.  I asked her WTF she was doing and she said we have to go get Meg right now.  I told her it's 3am and a 4-hour drive, if I'm going to be driving that far I need to get some more sleep first.  My wife ripped the blankets off the bed and told me we need to leave \"NOW!\"  \n\nI got up and reminded her that there are 2 other kids in the house (Stepson 16 and our son 9) that we need to talk to before we leave and I don't want to wake them up at 4am to tell them we're leaving.  I also reminded her that due to her astigmatism, I'm guessing she wants me to drive since it's dark out.  I told her she either lets me sleep until at least 7am, or she leaves now and drives herself.  I told her that Meg is safe even though she's probably scared and uncomfortable but that maybe she needs to feel that way right now.  \n\nShe tried to argue with me but I told her that I am not going to fight about this so she either leaves now or lets me sleep.  Thankfully, she let me get some sleep but woke me up right at 7am and told me to get in the car.  She apparently hadn't slept and had already told the other kids what happened and that we have to leave but would be back later that day.  \n\nThe entire drive my wife made comments about how scared Meg must be and how we should have left earlier, etc.  I kept trying to tell her that Meg will be fine even if she's a little shaken up by this.  Then, my wife told me that if this was my son instead of Meg, I would have jumped out of bed just like she did.  \n\nThat pissed me off because I would be doing the same for my son that I'm doing for Meg.  You get arrested at 3am and want us to bail you out, you're waiting until I'm damn well ready to come get you. But my wife thinks that me sleeping instead of leaving right away was an AH move.   ", "created_utc": 1694544539, "permalink": "/r/AmItheAsshole/comments/16gzihy/aita_for_not_immediately_driving_to_bail_my/", "score": 1712, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My stepdaughter got arrested this past weekend and called my wife at 3am to come bail her out.  My wife wanted to leave right away but it's a 4-hour drive and my wife doesn't drive at night due to an eye issue.  I told her I either get more sleep so I can drive rested, or she leaves right now and drives herself.  She ended up letting me sleep but accused me of treating her daughter differently than our son and that it was an asshole move to not get her right away.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. \n\nActions have consequences and stepdaughter is learning that now. \n\nYou did the right thing.", "NTA\n\nStaying couple extra hours in jail while she sobers up might be a good wake up call for her, and it might prevent future instances of getting drunk and doing stupid things.", "Where do you live where an accidental house and doorbell ringing ends in jail and bail? And why’d they run if they weren’t doing anything wrong?", "nta!!!!! \nshe is 19, old enough to know better.\nif you're going to drink underage, you need to be light on your feet. \nshe will be Fine in custody.. she'll just feel like a sausage. \nwhich she is, because she called you at 3am arrested. \nMolly coddling her will do absolutely nothing positive for her. \nlife isn't fair, it doesn't play to rules, and mummy can't always make it better", "NTA. While it's understandable that your wife was panicking and upset about her daughter being in jail, it's also reasonable for you to want to be rested before making a long drive. Safety should always come first. It sounds like you did consider Meg's wellbeing by stating she was safe, even if she was uncomfortable. Getting arrested is a serious matter, and maybe it is a good life lesson for her about making better choices and understanding consequences. \n\nHowever, your wife's emotions were high, and it's natural for her to be protective and worried. Communication is crucial in these situations, and you both could benefit from discussing it calmly now that the situation has settled. But no, you weren't an AH for wanting to be safe and alert on the road, especially when Meg was not in immediate danger.", "I can see both sides. I can see myself jumping out of bed and reflexively getting dressed. But I can also see myself thinking it's okay for the kid to stew a while, while I finish getting my sleep. I just don't think I'd be able to get back to sleep after such a heart-pounding awakening!", "Reminds me of the story my Dad told me about a cousin once removed. Seems Dad's Uncle has a few  Grandchildren he doted upon. It was well known in town that Curtis doted over his grandchildren. So when Number 1 Grandson goes rogue one night stealing gas by siphoning out of a homeowners auto gastank and gets caught by the local police, they haul the bugger into the local jail. Police Chief gets a call that a juvenile has been picked up and per protocol the desk sergeant notifies the Police Chief at around 12:30 AM. The officer rattles off the juvenile's name and Police Chief recognizng Curtis' name tells, the desk sergeant to hold him while he calls my Dad's Uncle to come in and take him home.\n\nSo, Grandpa's, not Mommy and Daddy's phone, ringy-dingys at 1 AM. Chief of Police explains the situation and tells Grandpa if he will go down and pick him up, the matter can be cleared up by paying for the gas and avoid all the Imperial Entanglements.\n\nGrandpa's response, \"I don't have a grandson that steals gas, let the little bastard rot in jail.\" Ow!  Click-up!", "Well for starters, they won't let you bail your drunk kid out until they sober up.  - coming from a mom of a 2 time zero-tolerance offender \n\nThe best thing I ever did was let my kid sit in jail the second time.  Instead of bailing her out at 9am sharp, I let her sit there until afternoon.  After that experience, she decided she didn't want to ever go back and straightened up her act.", "Wanting to drive on enough sleep isn't \"being an asshole\".\n\nYou are also correct with regards to her needing to experience discomfort - that is the consequence of her own decision.\n\nThe your wife believes \"not being scared\" is more important than \"experiencing the consequences of criminal activity\" is unfortunate - it's a *much* deeper act of love to want your child to learn from their mistakes than it is to shield them from their mistakes.", "If your wife was worried why didn't she call a bail bondsman and secure her daughter's bail with a credit card given the late hour and you live four hours away?", "I’m not going to call you the AH but if I were your wife I would feel the same way she does. That had to be an agonizing 3 hour wait.  Especially if this is the first time Meg has been in trouble.  If it were the 2nd or 3rd time, I would feel differently.", "Yeah I certainly don't think she did anything that falls outside of \"dumb college kid\" territory. And I think a written citation or warning would probably have been enough to scare her from the cops. \n\nThat said, hell yeah I wouldn't leave at 4am.", "Im confused about what warranted an arrest. She was drunk, accidentally rang the wrong doorbell. And then her drunk self ran when cops showed up? The Midwest sounds like a wasteland. CA cops would have just sent their Butts home since no crime was committed. Arresting her for all of that seems like such overkill.", "Obligatory \"I did not read all the replies\" but the last time I had to bail out a buddy many years ago there was a mandatory cooling off/sobering period for drunkards before they can be released. The arresting officer told me to not even try for 8 hours. That may no longer be a thing but keep it in mind for your next argument.", "INFO\n\nDid Meg know that you WOULD be coming to bail her out at some point, even if it was delayed?", "NTA.  If she was 14, I could understand, but she is facing the consequences of adult fun run amok.  She can sit for several hours and contemplate her mistake.  Your wife needs to gain some significant perspective and chill.", "NTA. It's part of the lesson. She's so concerned about getting her out asap but isn't talking a bit about *why* she is in jail. Underage drinking and running from the cops.", "NTA\n\nTired driving can be just as dangerous as drunk driving, especially for four hours on an unfamiliar route at night.", "NTA. Meg wouldn’t even be able to bail out at 7am where I am. Your wife was overzealous instead of using critical thinking, & how awful of her to disregard your health and safety for a DRUNK PERSON. It was wise not to drive tired in the dark when the point was probably moot.", "AITA, yes,  For being a dick to your partner. Her daughter is in jail, scared, your partner is totally freaking out and you need your beauty sleep?", "NTA, it's just a difference of a few hours, not days. Yes it probably sucked for Meg but hopefully it gave more time for the lesson to sink in. You wouldn't be able to go bail her out if you crashed the car on the way there. I get your wife's sense of urgency as I'm a mom of a teen also, but perspective is important here; her and your safety were on the line since a four hour drive is more dangerous when driving tired.", "ESH - unpopular opinion but 19 is still young and a night in jail for something so foolish seems extreme and if you've seen a jail, you have no idea who else will be in there.", "NTA\n\nSafety first. And spending some time in holding after breaking the law can be character building.", "NTA. A 4 hour drive is not easy when you are tired. Plus maybe next time she will make better choices.", "My dad told us growing up that if we ever get arrested to plan on staying the night and he would post bail one time only. My brother tested it and found out he wasn’t joking. He sat for three days waiting for an arraignment.", "The mother's reaction was correct. Being in a jail — for any length of time — is no joke. If it's someone you care about (assuming they're not a career criminal) you get them the hell out of there immediately.", "NTA\n\nIf she wants to do something that causes her to get arrested, she can spend a few hours in timeout. She was safe, she had supervision, and it was safer for the two of you to wait. \n\nHer charge may have been a dumb one, but so is trying to get into a house that doesn't belong to you then running from the cops instead of explaining what happened.", "NTA, but I'd like to know what the charges are? Running?  Seems like LE out of control, as always.", "NTA Your stepdaughter got herself locked up by being drunk. Maybe if she sits in jail for a while, it will be an eye-opener. Your wife was wrong wanting to wake the other kids up at 3AM!!!", "nta \nActions have consequences. She chose to get drunk, act disorderly, and get arrested. I'd have left her for 24 hours to really get it through her head not to do that again. It's sad her mother can't see that by immediately jumping to go there won't do her any favors and she will never learn.", "NTA absolutely. Teaching children responsibility is good parenting. Not only that but there have been multiple instances of college students specifically getting shot after turning up drunk to the wrong house and scaring the occupants. Crazy", "Wasn’t this a Modern Family episode?", "NTA. Play stupid games, win stupid prizes. She got herself into the mess, and she can get herself out of it. She’s an adult.", "NTA\n\nYou didn’t do anything wrong. She was likely arrested for running and then kept for being drunk. I doubt she’s in any serious trouble other than an MIP for being drunk. She can sit for a bit. And the fact your wife could say that you’d help your son, the son you share with her is crazy. She sounds like she’s projecting her own favoritism on you. She’s willing to leave 2 underage children home alone to help an adult who should know better. She’s the real asshole.", "NTA I wouldn’t have bailed her out at all. I’ve told my kids that if they get arrested, I won’t bail them out and their actions have consequences.", "What’s that helicopter noise I keep hearing when I read this post?", "Sucks for her.  Consider it a learning process for her.  NTAH.", "It's called tough love. She made a mistake, now she has to deal with it. A parent shouldn't jump to the crying of their kid for anything more than that, she os safe and scared, thats it. \n\nShe will learn real quick her actions. \n\nNTA", "NTA.  You would have taken a lot longer than 4 hours to get there if you were in an accident.", "YTA. She got drunk and rang a doorbell. Do you even care about the kid? Like, honestly. If she did something bad, I'd understand making her wait, but that's a bullshit arrest. I'd bail out a cousin I'm not close to faster than that. The fact that you made your wife wait is unconscionable.", "NTA  \nAt 3AM, you might as well leave her there (given the long car ride) and wait for her to be taken to the district court for her arraignment. Depending on what she was charged with (I'm assuming it would have been her being drunk and under age and running from the cops), it's likely that it also wouldn't have been worth forking over the money to bail her out. \n\nMy mother always had a rule.... \"You get arrested, don't you dare call me to bail you out. Especially if it involves drinking.\" You were right. She was safe and there's no reason for both of you to drive all the way out there at that hour just to sit there and wait for her to see a judge. \n\nI'd vote that they (wife and step daughter) are ah's. Obvious why step daughter is... You don't get drunk and run from the cops. It just isn't usually going to end well. Wife is for demanding you jump out of bed and drive four hours to bail her out. She's especially in the wrong for \"ripping the blankets off the bed\" and insinuating that you'd treat your other children differently in the same situation with zero proof.", "NTA. My son knows if he ever gets arrested he would need to call his Nan in Ireland as she would get there before I would. \n\nWhat your wife needs to realise is your stepdaughter is not sick or in danger. But rushing to her half asleep driving would put you both in danger.", "YTA. She didn't do anything to deserve getting arrested. Jail is very dangerous for young women. You show absolutely no empathy for her. AND you made a creepy comment about what she was wearing.", "NTA I dont think either of you were way out of line, but a very light asshole to your wife for implying you dont care for your stepdaughter. Maybe you and your wife should talk about the situation once it's all over.\n\n You and your wife both had valid reactions to this. I've been in a similar situation with picking up family from the drunk tank hours away, and it's not a fun time for anybody. Your wife woke up to the news which probably put her in a state of panic, and your reaction wasn't what she wanted to hear. However, you know your limitations, and so your choice was for the best. \n\nComparing your dedication to your kids wasn't fair, but, again, she was in a panic and your reaction was to ask for sleep first. She felt hurt and lashed out, but hopefully you can forgive that.", "Omg apparently no person on reddit drank underage before,  yes YTA , your kid was in jail,  wake up and drive your scared wife to pick up your scared kid from jail.  My underage cousin was in the drunk tank and ended up with 4 broken ribs in a small town , you never know who's in the tank with them !! Could be another sorority girl could be someone out of their mind on coke with a bunch of cops who could care less about your well being.  Jesus,  everyone on their high horse about teaching her a lesson  why not teach her a lesson by explaining the terror your wife felt when she received the call. This doesn't sound like a pattern for her,  maybe show some compassion.", "NTA\n\nBeen arrested as a kid, wouldn't have expected you out the door at 4am to save me.", "NTA - Step daughter made the mistake and it's a teachable moment for her. She should suffer a little bit and staying locked up for a day or so is going to be helpful as long as she's not stuck with dangerous people. On a side note, it seems weird to me that you guys had to go there to get her out, what if instead of 4 hours away it was 12 hours away, or multiple flights? Was there no option to just pay the money over the phone? Admittedly I know nothing about how that system works as I've never been bailed out nor have I bailed anyone else out, but it sounds like a primitive system to me if that's the only option.", "NTA. I just dropped my son off at college for his freshman year. I wasn’t fortunate enough to go to college the way he’s going, so long story short I joined the military and got my degree via online. But I bring this up to say, as a mother, I already told my son that if he got himself put in jail, not to ask me to bail him out. Some adult activities come with adult consequences. I’ve had young soldiers in my time and I’ve been one. I know the amount of dumb stuff that just needs to be learned the hard way.", "Actually your wife needs a lesson on driving and life. Driving at night for 4 hours without enough sleep and turning back for another 4 hours can be very dangerous. Life doesn't give a shit on our priorities and doesn't say \"oh! You have an emergency, then you can drive sleepless without risk of accident\". NTA", "NTA, but I totally respect your wifes fear as well. If it were my daughter, I just might have slammed down an energy drink or two and gone right away. I don't trust cops, especially around young women. But still, you are NTA.", "NTA", "Oh good grief. They probably would have let her out when she sobered up, especially if it's a college town, with a ticket or misdemeanor court date. NTA", "The thing you missed:  Meg wasn’t the scared one in this situation.", "Shit my kid would have sat for at least 24 hours.", "NTA.   My kid would sit in the can until morning too.  A little time to sit and think about how you got there won't hurt.\n\nEdit.  Why didn't she call her friends who got away instead?", "NTA, she got arrested for being drunk but she was safe where she was. It would be completely different story if she had been injured and was sitting in the hospital. She’s 19 and made some bad decisions making her sit and think about it for a couple extra hours is not the worst thing in the world. It may actually prevent her from doing something that dumb again.", "Not the asshole.\nKids that get arrested need to learn a lesson if that means them sitting in jail for a while, or overnight so be it.\n\nDriving while sleepy's a lot more dangerous than that kid sitting in jail", "NTA Meg was fine. A few more hours didn't make a lot of difference.", "Yta. Women are at high risk of abuse when they're jailed or detained, even for short periods. You risked her physical and mental safety so you could take a nap.", "NTA - a few hours more in jail won't kill her, but it could teach her a lesson", "YTA   because I think you were arrogant and dismissive to your wife.   She was scared.  She has probably broken down in tears with worry.   Meg is working hard.  She isn't depending on the two of you for financial support.   Sure your wife had a right to think you'd not let your son sit in the drunk tank.  If you had a daughter who called you at 3:00 am from jail I don't think you would have let her sit in jail.   Daddy please come and get me I've been arrested and Daddy I'm so scared.  I'm sorry Daddy!!    I think your wife would have been up and ready to be at your side for a four hour drive to get your daughter from jail.\n\nShe'd made arrangements for the boys.   Had a pot of coffee brewing.   And she would have offered you support and comfort along the way.\n\nIt's about being a team.   This is going to cause problems in your marriage.   You made this about control.", "YTA. Meg went to a party and got drunk, which are completely acceptable things in American colleges even if illegal. She seemingly wasn’t belligerent, but was mistaken in the location she was at. She’s at a transitional period in her life, she’s “friends” with people she met two weeks ago. She’s scared, probably feels some amount of shame, and barely did anything that would necessitate being arrested. \n\nYou are correct that she was physically safe, but think about how traumatizing it is for her to be in a new situation and be arrested and then not supported. Likewise, if you did that to your son I would think that you’re an asshole. \n\nThat being said, if you felt like it was unsafe for you to drive that’s a different thing. In this case it seems like you were saying you simply couldn’t be bothered", "You are NOT the asshole. I mean this respectfully, but your wife seems to have been using her emotions to drive her decision making instead of logic.", "NTA you can’t get her out until she gets bail determined.  Earliest would be 8:00. Realistic release time is 10:00.  Bail bondsman aren’t open until 9:00.  You can’t do anything for her until 9:00 earliest .  An extra hour will do her good.", "Nope. Your wife needs to understand that another adult's poor decisions (her daughter's) have consequences. That's what being an adult is.", "NTA\n\nGood job keeping a level head in the middle of the night, you are absolutely correct, she was in a safe place no harm was going to come to her.\n\nMaybe let your wife's adrenaline wear out and at some point in the future have a conversation with her, reassure her that if Meg was in any sort of danger that you would have reacted the same for all three children to rush to be there immediately.\n\nThis is not about whether you love her daughter or your son more or even differently, this was about evaluating the situation and making the correct decision. \n\nDriving four hours at 3:00 in the morning then turning around same day for another 4-hour drive home without proper rest is a recipe for disaster and quite frankly put the safety of your family and a much higher risk. There are horror stories about accidents when drivers are sleepy, both killing themselves and other innocent drivers on the road. Quite frankly I very much appreciate your level-headedness in the situation.\n\nWell done", "NTA\n\nMy parents told me if I ever got arrested to count on spending the night.", "No", "Play stupid games, win stupid prizes. \n\nYou are NTA. Kids an adult and needs to understand actions have consequences. She was safe and sound, just didn’t like where she ended up. \n\nMaybe she will do differently the next time an underage drinking opportunity presents itself to her.", "NAH. I have 3 kids, and they're far too young to end up in jail but if the time ever comes that I get a 3am phone call, I'm getting more sleep first. Even if they're just down the road, as you said, they're safe and maybe being scared and shaken is what they need in that moment.\n\nHowever, I can't blame your wife for wanting to go get her right away. It's her kid, and it's just instinct to take care of them.", "Your wife is unreasonable here. Helicopter and enabling. Yikes.", "Maybe if she had done a better job of raising her daughter she wouldn't be running around underage drunk in the middle of the night.", "Lol love how OP was so unfazed, had an argument and just went right on back to sleep. As he rightly said, nothing can happen to her where she is, what’s the point of blasting out the door for a 4 hour drive and possibly die in a car crash on the way.", "YTA", "YTA. You don’t know what you would have done if it was your son. Your wife has a point. You should have left at 3 am to alleviate your wife’s anxiety rather than leaving her awake and anxious for 4 hours.", "“I told her Meg is safe”. \n\nYou sure about that?", "YTA. Coming from someone who's been to jail, those couple hours are the difference between her leaving safely from holding or being assaulted in general pop because she doesn't know not to brush her teeth in the sink. Seen it happen plenty of times, the most dangerous time in jail is your first time in gen pop.", "YTA. If it were the second time you received this sort of call, or any number of times after that, I would agree with the desire to sleep in. It’s a dumb mistake that she made but dang, spending the night in jail for ringing a doorbell is pretty over the top. Getting arrested is already way over the top for ringing a goddamn doorbell. It’s dumb and inconsiderate but not arrestable!!! Trigger happy n t as up in this thread. \n\nSiding with the wife big time. This is gonna be a blow to your trust and relationship, over a measly few hours of sleep. I hope your wife can recoup that damage with her daughter. You’re kindof a jerk for this one.", "YTA. Meg sounds like a good kid with her head on straight. She went to a party and got drunk,  Im guessing you did that at your age. Nothing wrong with that. They MISTAKENLY knocked on the wrong house.... and got arrested for running? If want her fault, she really didn't do anything bad. I don't trust cops, I don't trust the cells they would have placed her in, or the people around her. Geez.", "NTA. My guess is your wife has a pattern of shielding Meg from the consequences of her actions.", "NTA. Whatsoever. I get your wife was upset by the news and possibly unable to sleep after getting it, but she went wrong when she decided to take it out on you.", "YTA leaving your kid in jail longer than you have to is a shitty thing to do. She's 19 and got busted for underage drinking, the thing that everybody on earth does. She isn't becoming a criminal, she doesn't need to be left in jail to learn a lesson. Also you said she could wake you up at 7 and then when she wakes you up at 7 your like \"wow I can't believe she woke me up right at 7\"", "LMAO NTA I wouldn’t have jumped out of bed for that at such an hour either.", "NTA - As far as her being scared in jail, she probably fell asleep/passed out. Years ago when I worked on a small framing (construction) crew, my boss called me around 3am from jail (drunk) asking me to hurry up and come bail him out. I did that but he was so passed out I had to wait hours before they could wake him enough to walk out.", "NTA. She was safe, and it was good thinking to make sure you made that trip safely.  If you had fallen asleep at the wheel, what would have happened then?  \n\nNo matter how you try to defend your actions, she is always going to paint it as if you didn't care about her daughter. Instead of fighting this battle, improve your relationship with your stepdaughter.  Make sure she knows you will always be there for her, but you also have to make sure you can get there safely.  Then get her a small gift.", "Nta", "NTA. But your wife is. An adult got arrested for breaking multiple laws. She can spent 12 hrs in jail. If my kiddo did that I’d be sleeping in that morning and driving after I was well well well rested. Getting to spend the night in jail might just scare them straight.", "NTA- I wonder how old Meg was before her mom stopped wiping her ass for her?", "YTA/ I mean, do what you want, but if my son called me at 3am to be bailed out, no one would stop me from leaving the house immediately.", "YTA. I would have jumped up and driven 4 hours for the son of any of our neighbours, or for anyone in my extended family. For my (step)kid, I would have tried to break the sound barrier while doing it. Kids in the hands of cops are no joke.", "NAH. You, understandably, wanted Meg to learn a lesson. Your wife, understandably, was worried about Meg. Just two different takes on the same situation. Hopefully you two see eye to eye most of the time…you just didn’t this time.", "NTA. It's late at night and she's fine in jail. Sucks but like 4 hours wasn't going to change much for her.\n\nTwo of my friends group are basically family.  One got arrested on Friday night.  The other one decided he would have to wait till Monday since the bail peolem weren't open and he didn't feel like driving 2 hours that night to pick him up. You are at the whim of other people at that point.", "NTA\n\nBut also?\nYou don't get arrested for ringing the wrong doorbell.\nYou get scolded, maybe given a ride home.\n\nOP, remind mom to find out the *real* story. It might be a misunderstanding,  but they didn't arrest kids for illegal doorbell pressing.", "NTA\n\nThose few hours waiting in jail would give her the clarity she needs to stop doing stupid shit!", "YTA....\n\nThe message you sent your stepdaughter was that she can't count on your help... that you value your son's sleep more than her distress.  I don't believe you that you would treat your son's the same way.\n\nOver and over we tell our kids that if they need us because they're drunk, we will be there.  Just don't drive.  We won't be happy with their actions, but we will be there.\n\nWell, she and her friends didn't drive.  They walked.  What crime did they commit?\n\nYeah,  YTA and I don't care if I get down-voted.", "https://m.youtube.com/watch?v=zHon8E0H9B8", "NTA. Although I don't understand what the arrest charge was. She didn't actually do anything illegal, did she?", "Your step daughter is an AH. And I’m an AH, but you’re NTA.", "NTA  \n\n\nNope. You get arrested and want me to bail you out its on MY TIME. Not yours. \n\nAt 3 am? I am going back to sleep and then having a nice leisurely breakfast. \n\nAnd... while I understand teenage drinking is illegal... its not like they were driving drunk. They were WALKING and got confused by what house it was. This is hardly a jailable offense in my mind. Maybe if they had been driving or committing serious crimes.", "NTA- my kids all know not to call me if they FAFO and end up in jail because I won’t come at any time. They’ve said, “ My Mom would leave me there to learn a lesson!” And they would be correct. You were nice to even consider driving- I would’ve let her handle her kid and say home and do something fun with the other two. You’re a good guy.", "NTA, he had time to think of her actions, and getting her parents dead in a car accident bc they went right away to get her wouldn't have helped, you were right in not wanting to do such a long drive without sleep", "NTA. She needs to learn to not get that drunk in public. That's stupid and fucking dangerous. \n\nAlso driving tired is the same as driving drunk. Driving 8 hours round trip on 4 hours of sleep is a recipe for disaster. You shouldn't want to follow up a decision for one of your kids with a decision that ends your life. I could see making the trip if she was in the hospital, which public drunkeness will lead to hospital trips.", "NTA I always told my kids not to call me I won’t bail them out. Actions have consequences.", "NTA. It's called living with the consequences of doing something really stupid. They are lucky they got arrested and not shot. You did not owe her anything more than what you did.", "NTA driving while 'tired' is a traffic violation in Sweden, you did the right thing.", "You absolutely did the right thing.  It's not even debatable.  If it was a hospital / injury situation - leave.  But jail?  Naw - lessons need to be learned.", "NTA. She SHOULD be scared. That's damn near the point. Maybe it will sink in not to drink underage and to be responsible about it when she does hit 21.", "I’m a big believer in allowing my children to enjoy the consequences of their actions. Some are positive, some are negative, some neutral. However, there is always a consequence. \n\nIt was sooooo much harder to allow them to experience their natural consequences, then scoop them up & protect them. \n\nIt took 1 out of 3 a bit longer to figure it out. But, by the end of first year of college-totally got it. Even thanked me (totally shocking!). \n\nSounds like Miss Meg has not been fortunate to experience her consequences. It’s never too late. Much better now, than at 35!!", "YTA. She's your kid too, you should be protecting her. If she got a DUI or assaulted someone, i would have more sympathy, because that's serious and she obviously has major issues. This is not that. It's a completely innocent mistake that should not be allowed to endanger her future and yes, potentially LIFE in jail. If you'd treat your biological son the same, that's nothing to be proud of. \n\nShe literally only committed a crime because of where she has thr misfortune of living. Almost everywhere in the world she could drink legally and cops don't arrest you for knocking on the wrong door.", "Last time, you had drank alcohol and chose not to pick up your step daughter who was arrested at a party until the morning. \n\nhttps://www.reddit.com/r/AmItheAsshole/comments/108kad6/comment/j3sqnt5/", "YTA your wife was that upset and you just ignored it? You could have let her drive and slept in the car.", "arrest her for ringing someone doorbell at 2am? sure it's ah move, but i don't get why it's a crime. \n\ni think she was arrested mainly to make her sleep off her drunkenness, which is what she should do. NTA for waiting to wait until morning.", "Can’t believe you give her a whole $100 dollars a month. You do get that campus accommodation and food cost money right? I’m confused by those comments. \n\nAnyway, I would 100% feel the same way as your wife and would want to be there as soon as possible. At 3am I’d guess you you’ve already had a few hours sleep and would be perfectly ok driving.\n\nBut on the other hand she wasn’t in any danger and was probably passed out drunk napping. You could have been kinder to your wife.", "YTA and from what I'm reading in other comments, I don't want to know you or most anyone here.", "YTA. Not for not driving, but for clearly not attempting to communicate with your wife. You decided to dictate. Of course your wife didn’t sleep, her child was in jail and scared.\n\nAnd fyi, jail is not safe. You have any idea how many people are injured in jails each year? I’ve worked with someone who spent a week in the hospital because of their night in jail. Schizophrenic cellmate decided to beat the crap out of them for an hour before any guards intervened. So, you’re YTA for that too.", "YTA especially to your wife who was beside herself with worry. Meg was probably fine but you just put a giant wall between you and her and more importantly you and your wife.", "Your reasoning was sound but upsetting your wife in the process was not good she will never forget what you did", "ESH You don’t have to show in person to pay a bond.", "YTAH.  You would have gone if it were your boys.  Admit it.", "Low-key AH\n\nIf I am picking up what you’re putting down, you had 2 options. Common sense approach vs emotional response. \nI’m just guessing here, but I get the feeling Meg is probably a good kid and away from home for the first time….Your wife was panicked and worried, not to mention in the first 2 weeks her/your kiddo moves out, she ends up in jail…ya Bro, getting up and doing it your wife’s way probably would have been rough, you’d probably be exhausted and maybe even pissed off…but your wife would be happy, your step-daughter grateful and you’d probably be taking a nap instead of asking Reddit AITAH?", "YTA.\n\nDid you ever stop to consider that it wasn’t about what your step daughter could handle? It was about what your wife could? \n\nYour wife was worried out of her mind for her daughter, probably coming up with worst case scenarios on what was happening. Instead of sucking it up and arranging to get to your step daughter as soon as possible, you decided sleep was more important (because if the situation was what you considered an emergency, I guarantee you would have found the adrenaline/energy to drive 4 hours somehow).\n\nNot only did you refuse to get your wife to her daughter as soon as possible; you apparently did nothing to comfort her/put her at ease. You simply went to bed and let her stay up the rest of the evening getting more anxious as she sat and worried and beat herself up for not doing what she thought at the time was the only thing she could do to help.\n\nPerhaps, as the one thinking logically in this situation, if you had taken some time to comfort her, look up what time the police station/courts opened for business, find lawyers you could contact, or anything to showed you cared about her daughter’s wellbeing; she would have been able to calm down/not be furious with you.\n\nAlso, your step daughter did not commit some violent crime or other serious offense; that would warrant the need for her to sit in jail longer to think about what she did. As far as we know from your story, she got drunk underage; they walked to their destination and did not put anyone in harm by getting behind the wheel. Had they not ended up at he wrong house an ran in a panic; it’s likely she would not have encountered the police; or, if she had, her being drunk would have just resulted in a citation (serious consequences, but not formally arrested/taken to jail).\n\nDoes she have a history of making major mistakes? An alcohol problem? Your reaction just seems callous otherwise.", "Jail is not safe.  YTA", "YTA.  Not for the way you treated Meg.  You completely ignored your wife’s anxiety.  She must have been going crazy while you slept as if the problem wasn’t yours,", "How much do you despise your stepdaughter? Because you’d have to seriously hate her and have no respect for your wife to not having second thoughts about taking a nap instead of immediately going to get her drunk teenage daughter out jail. And now you look for reddit validation for your actions. Lol.", "I’m sorry but yta. You support your own, especially your concerned wife.", "YTA", "YTA.  You may be living in some repressive shithole where the cops can haul people off to jail for ringing the wrong doorbell but you don't have to betray your own daughter to those thugs.", "YTA\n\nI've had to spend time in hold up through no fault of my own. It sucks. I did it as an adult, and let me tell you how much I value the people who dropped everything to help me and did what they could to get me out as fast as possible.\n\nYou just showed your wife and stepdaughter that she isn't worth that to you.\n\nYour argument about the other kids... valid. The whole I need the sleep? I call bullshit. You should be able to go with little sleep for one night. (You didn't mention any medical reasons otherwise.)", "Did you AI script this off modern family episode?", "Drink tank sucks but sure as shit won't kill her lol. All she's doing is sitting somewhere uncomfortable with nothing to do for a few hours.", "It would be one thing if the stepdaughter was injured, in the hospital, stuck on the side of the road, or in some other perilous situation. This wasn’t it.", "And hopefully there's someone there who would've taught consequences before she had to learn them the hard way but gauging by the complaining that she must be 'uncomfortable' and immediate jump to 'OP's kid' and 'stepkid', I'm not seeing that in the leaves. I do however see the son and 9 year old looking askance at OP's wife after the 4 hour car ride of divisive statements and pity for the young woman who is old enough to drink underage and wake up a rando at 2am.", "I’m willing to bet if she didn’t run off and explained what was going on, the cops wouldn’t have arrested her. Instead some drunk college kids caused some problems for the cops, they got pissy and arrested them.", "I mean, what she did wasn't actually wrong, so its more like, be in the wrong place at the wrong time and you will get screwed over by life", "what actions ? how in the world ringing the wrong door = being  arrested thats only in america type of shit .....", "To add on to this, its also dangerous to drive if you’re not actually awake and its dark out. He made good points and its not like he said no.\n\nNTA", "Edit for Verdict:  NTA\n\nMost likely they would have let her go once she slept it off anyway - I'm sure she passed out right after that phone call so anytime the next day would have been fine.  If not, what a great lesson she learned, don't get sh\\*t faced drunk in public!\n\nShe's an adult, I would have been too embarrassed to call my parents to bail me out and they definitely would NOT have driven 4 hours in the middle of the night to do so for such a stupid reason.\n\nThere's a reason the police don't appreciate underage people running around **drunk in public** (especially in college towns) - they annoy the f\\*ck out of people in the middle of the night by ringing the bell, peeing our puking in the front yards, hoping fences to jump in pools, some of the frat guys think it's funny to TP houses or knock down mailboxes, kids run up and down the street when some adults need to get up in the morning and go to work, etc.  *If you want to be drunk, be drunk in a bar then go home in an Uber or with a DD.  If you're underage and want to be drunk, do it at home like the rest of us did.*", "The kids made the mistake of going to the wrong house. They didn’t fucking steal, break in or murder someone. Sheesh. At least she only got arrested and not gunned down by the homeowners.\n\nUnderstand his reasoning of not being able to drive safely at that time and without more sleep but thinking the kid is safe in custody isn’t the first thing that springs to mind.", "Moreover, Mommy needs a hard conversation with her precious daughter.  Bootsie was damn lucky the only consequence was an arrest; hopefully she’s smart enough to never, ever, do something that stupid again. \nhttps://abcnews.go.com/US/college-student-fatally-shot-south-carolina-after-enter/story?id=102601998", "Actually, I don't think consequences have anything to do with it.  That WAS the story I was expecting, based on the title.  But the OP's reasoning for not leaving immediately had to do with safety and attending to the welfare of their other kids.  Leaving a few hours later was a reasonable balancing of competing constraints.  That's why their NTA.", "Exactly, a few hours to sit there and think about what she did while she sobers up. Let her sweat it out. She'll be fine, sitting in your discomfort is a great way to finally get your head out of your arse, mummy racing to her rescue is interfering with an important life lesson.", "Yeah if they didn’t wait and rushed to bail her out right away, she really wouldn’t have learned any real lessons. Making her stew for a couple hours was a harmless way to show her that actions have consequences, even if what she did was an accident.", "NTA\n\nBut why can't one parent go and the other parent stay with the other two kids?", "I probably wouldn't have helped. She needs to learn how to bail herself out of jail if she does something so blatantly illegal as drinking underage, and you didn't identify yourself as the sitting president which would be the only situation that would make this allowable.", "I’m not American so I am really struggling here to understand what she did that warranted jail: she just rung the wrong home’s bell at 3 am? How’s that a crime that merits running away from the cops?", "They rang a doorbell lmao not exactly a hard crime.", "We live in the Midwest US.  I talked with the police when we were picking Meg up.  The house they walked up to was an elderly couple who thought their house was being broken into because of the banging on the door.  Not sure that any burglars ring the doorbell too, but that's beside the point.  \n\nMeg ran because she's underage and drunk and panicked.  Police tend to arrest people who run from them while performing what the police thought was a breaking and entering.  \n\nThankfully, they only charged Meg with drinking underage and disorderly conduct.  They could have charged her with much more and if we want to fight the disorderly conduct we probably can.", "In the US, ringing the wrong doorbell at night can get you killed.  Especially if your skin color is darker than toast.", "Honestly, it has nothing to do with the accidental house and ringing of a doorbell. It's all about the underage drinking and running from police. \n\nWhen they get a call for someone \"breaking into my house\", they're gonna want to question the people involved. Hell, OP's kid might have gotten away with the under age drinking if she had just NOT run away. Cause I can tell you one thing is for certain.... Every single cop I know HATES when people run. \n\nEvery keg party I went to in high school was busted by the cops... None of us never got arrested. At worst, we were brought home so they could tell our parents. Usually, it was \"get the f outta here\" and they kept our beer.", "Unfortunately, here in the US (especially Midwest) they were lucky that even approaching a wrong house in late night/early morning didn't result in gunfire and dead bodies.\n\nOP, NTA. She was in custody and not in any further danger, whereas trying to drive at that hour sleep deprived would have been you two in danger and possibly orphaned some kids.", "Maybe public intoxication?", "It is not just an accidental doorbell ringing. Calling the cops then cops arrival would have let plenty of time for the stepdaughter and her friends to leave. They were playing to harass the people living in the house.", ">. if you're going to drink underage, you need to be light on your feet.\n\nI've never personally ran from the police, but I know enough that the outfit and shoes Meg was wearing when we picked her up were not conducive to high-level athletics.", "Or, if you were taught early, only drink/have fun in a safe place with at least one dd/sober walker to help keep you out of situations... why would she be ringing her own doorbell? Does she live with others?\n\nETA- Dd / sober walker or in a safe place where you can be safe staying the night until you sober up enough to return home safely.", "My husband is the only one of his friends who didn't get arrested for underage drinking in high school. He drank as much as they did, but he was also on the track team, so he ran faster than all of them.", "Yes, but you sound like you might care about your children.", "Maybe your kids were rambunctious but reading OPs story it doesnt sound like his daughter did anything destructive, was smart enough to walk home not drive. All they did was ring a wrong doorbell.", "And that's why children need decent fathers in their lives. They need to learn their lessons before the lessons become unredeemable. A night in jail is better than whatever next shanagin they would do next time too. Also for the mother, people are allowed and supposed to feel discomfort and consequences of their actions. If they don't they turn into narcissists which honestly sounds like the mother too.", "This is our first direct involvement with the American justice system.  Neither of us are well-versed in how these things work.  That thought never crossed either of our minds.", "A bail bondsman is likely to not even bother with cases like this. Underage drinking... Likely no police record.... You're looking at bail that is less than $100. Not anywhere near worth their time. \n\nNow, if OP had any contact information for one of her sober friends, that's a different story.", "Might not be legal where they are. Bail bondsmen are illegal in my state.", "Drinking underage, public disturbance but honestly it’s most likely because she tried to flee", "Spoken like someone who hasn't lived in a college town where the population doubles during the school year. Those drunken little dummies wreak all sorts of havoc.", "My wife told her we would be leaving right away before they ended the call.  She did call the police station back afterwards to ask them to tell Meg we would be leaving at sunrise instead.  I never asked Meg if they actually told her that or not.", "Sure lets put the taxpayers on the hook to teach this kid a lesson. This should've been a citation at most.", "She a woman they're only allowed to fell happy, no other emotions. At the expense of everyone else. Like sleep deprived hubby and startled siblings. But that's okay because she can't feel discomfort from her bad decisions.", "My ex's dad told all 3 of his sons that too. Eldest son got arrested at 18 mouthing off to a cop drunk at a house party, threatened to kick the cop's ass or something stupid. Dad bailed him out. Couple years later all 3 of them got arrested together when they got pulled over with pot in the car and nobody would claim it. They called their dad, he came and bailed out the younger two but left the oldest in there. He was upset, dad reminded him he already used up his \"I'll bail you out one time\" card.", "Why did I have to scroll down long to find this? I think he was a major AH. Just the fact that his wife was upset and wanted to leave NOW should have been enough, even if she was fine and he wasn't worried about her. How in the world did he manage to go back to sleep?", "People can be killed in jail!  Sometimes that tough love BS is just BS", "The police were called to the house for a suspected breaking and entering.  Meg ran from the scene of a suspected crime.  She's lucky she only got charged with what she did.  No trespassing, no attempted breaking and entering, no resisting arrest, etc.  They let her off easy and we can probably get the disorderly charge dropped if we try and pay the underage ticket.", "finally someone sane in this comment section", "Definitely TA. She's 19 and made a fairly minor mistake. Thank god my parents were decent enough to be there for me and my kids know I'll always be there for them.\n\nWhat a failure of a husband and father. I suppose it's best the daughter learns now that she's on her own so she knows to never rely on them again if something more serious happens in the future.", "you miss the running from police part?", "Finally, sanity.", "Underage drinking and Running from cops aren’t bad things?\n\nIdeal Parent of the year over here 😂\n\nGlad you’re in the minority. Also cops don’t let drunk people out til they’re sober so even if they could teleport there, they wouldn’t let her out Lmfao\n\nAlso you do know tired driving is the second cause of fatal accidents. 4 hour drive in the middle of the night to get to someone who won’t even be released till noon is some dumb fuckery shit haha", "I don’t care what I did, if my parents didn’t have my back immediately I would never forgive them, what the actual fuck?! And because she got drunk in college? Please spare me the high horse “actions have consequences” bullshit and turn your brains on people, fuck.", "Who are these parents who think jail is a good place to learn a lesson.  Do they not realize people who have done worse are sitting in there with her too?? Why cant she get her lesson at home?", "AGREED", "average braindead redditor", "Wow, i can't believe you're the first comment like this! I know most Mama Bears I know would take off on their own to get their kid out of jail - especially for this silly thing. And if the husband was smart, he would get a move on.", "Yeah, how's Meg going to get out of jail if mom and dad are in a car accident because he fell asleep behind the wheel?  Unexpectedly waking at 3am to begin a 4 hour drive is a good way to orphan all the kids.", "She was underage drinking, publicly intoxicated, trespassing, and resisted arrest at 3 AM.  She deserved to spend the night in jail.  Sure she might be a little scared and shameful, but I'd argue that's a good thing.  Stupid decisions have consequences and spending the night in jail isn't going to traumatize her.", "Yeah much safer to drive 4 hours tired and potentially fall asleep at the wheel while at the same time leaving two underage children home alone in the middle of the night. Glad you thought this one through", "average braindead redditor", ">She's 19 and got busted for underage drinking, the thing that everybody on earth does.\n\nI live on Earth, I never drank underage.  But I also don't drink now.  So, does that mean I don't live on Earth?  Am I in the Matrix?  Was that black cat this morning real?  What about the lady in the red dress I saw on my lunch break?", ">the thing that everybody on earth does\n\nAdding on that I certainly never drank underage, and I left my house at 17. I literally waited until my 21st birthday.\n\nAnd yes, I live on Earth.", "I voted that his wife was an ah. She \"ripped the covers off the bed\" AND implied that OP cares about Meg less than he does his bio kid. That's ALWAYS an ah move. Especially when you have zero proof.", "You're right, I wasn't there so I'm going solely off information I've been given.  But also, Meg is 19 and not a kid.  She was drunk and attempting to enter a house that wasn't hers at 2am and ran from police when confronted.  Those are facts that everyone agrees on.", "OP said they live in the US Midwest. Underage drinking is the crime, and it’s possible the cops there take it seriously.", "The police were called to the house for suspected breaking and entering at 2am.  Meg ran from the police as soon as she saw them.  She's lucky to only get an underage drinking and disorderly conduct charge.  They could have charged her with more.", "Well, if we lived in Australia she could legally drink and our toilet would flush in the opposite direction.  However, we live where we live and we have to abide by both the laws of the legal system and physics of where we live.", "Would it have stopped there?  If the girls thought they lived there, would they have tried to break in?  People have been killed for going into the wrong house.", "I can see some similarities, but I don't drink.  My father, however, drank a lot, which led him to take his issues out on the rest of his family.  I'm trying very hard to break that cycle.", "Umm. These aren't the same people?", "My wife has astigmatism.  Driving at night is very hard for her and causes her to get pretty bad headaches, it's honestly unsafe for her to drive in the dark.  Both her and I knew that if we were leaving at 3am, I would be the one driving.", "She was arrested for running from the cops.", "She has a food plan as part of her room and board.  She has access to all the food at the food court.", "Yeah because waking somebody up at 3am is the perfect time to expect perfect communication", "Dude not everyone can nor should drive if they're tired. He didn't say when he got to sleep that night or if he'd had a long and more exhausting day. I don't get the feeling he cared about getting a beauty sleep, but that he needed enough rest to function behind the wheel of a two ton vehicle.", "What a biased anwser.  You appreciate they dropped everything for you but than hold it as an expectation? So which is it?  Do you appreciate them going above and beyond for you or is this an actual expectation of what someone has to do for you.\n\nShe was fine, driving without sleep is just as dangerous as dui. as confident as you talk about it you should know that.\n\n\n.", "> he whole I need the sleep? I call bullshit. You should be able to go with little sleep for one night. \n\nYeah, and then when he kills someone / causes an accident due to lack of sleep, are you floating the liability ?", "She wasn't in lock up through no fault of her own though. I think it's a part of her consequences that if she needs picked up from jail because she decided to get drunk at 19, you wait until it's at least dawn before I get my ass out of bed to make a 4 hour drive. Shrugs shoulders", "She could called one of her local friends to bail her out if time was such a critical factor.  Maybe the ones who got away.", "I 100% agree with you.  This guy isn't a good parent and he's proven to be a bad spouse when the cards are on the table.  His wife could have driven.  The 16-year old could have taken care of the 9-year old.", "Believe it or not, teenagers get arrested for doing stupid sh!t in real life too.", "College town drunk tank on a football weekend?  It’s not Riker’s.  NTA.", "How hammered do you have to be to confuse someone's regular house with uni housing?", ">And hopefully there's someone there who would've taught consequences before she had to learn them the hard way\n\nRight here.  In this day and age of people getting shot for turning around in a driveway, there are soooo  many ways that this could have gone much worse.  Meg will take more precautions in the future - before getting drunk enough to not be able to find her way home.  \n\n\nETA - NTA", ">...I'm not seeing that in the leaves.  \n\nI've never heard this expression before, but I love it, and I'm going to use it.", "Maybe. Public intoxication when she’s not old enough to drink might get you arrested in some places. I imagine most it’s just a ticket and a ride home from the cops. Obviously the latter makes sense so not likely what would happen. Haha", "lmao you actually have no idea if that wouldve been the case. Probably would've been arrested either way.", "Haha. You clearly have never dealt with cops in American college towns. Those fuckers LIVE for locking up students over any little thing - race and/or gender be damned haha!", "She was busted for drinking underage.", "Except for being drunk underage, trespassing, and running from the police, she did nothing wrong!", "Ringing the doorbell got the cops there. Running from the cops got her arrested.", "They were still there at the house when the cops actually arrived and I can't imagine they hurry to calls about rung doorbells. Who knows what they were doing in that time. Meg may not have done anything bad but if they were all hammered and she was the one who got caught, who knows what the others did.", "If she were black, she very easily could have been shot and killed. NTA. I believe they call this the Find Out phase.", "Did you not read the post ?", ">you didn't identify yourself as the sitting president which would be the only situation that would make this allowable.\n\n😂😂😂 truth", "This is what I thought too. Like they got arrested for trying to run away maybe?", "In some places, public intoxication is a crime.  Where it’s not a crime, it may still get you thrown in jail under the guise of “protective custody” so you won’t hurt yourself or others.  \n\nNTA", "A kids was killed by a homeowner doing something very similar.", "Normal people don't call the cops on someone ringing a doorbell. I'm guessing Meg and Friends were banging and yelling.\n\n\nNow I am going with a \"reasonable man\" standard. There are weirdos on Nextdoor who will call the cops on someone just coming up to the house. (One called the cops on Jehovah's witnesses, LMAO.) But hopefully those people are rare. I'm guessing that Meg gave a cleaned up version instead of the truth. (Which is understandable when you're a) drunk and b) 19.", "You run from cops when they show up and odds are you’re getting arrested when they catch up, cause you just gave them reason to think you did something since innocent people don’t instantly start running away from cops. But really, it sounds like Meg needs to start exercising more if she can’t run away from cops…. Or she needs some fatter friends", "Username does not check out.", "Yeah but that's how the stepdaughter is telling it. If you're ringing a door bell and someone calls the cops it's going to be at least a few minutes before the cops show up. If they were too drunk to notice that this (obviously) wasn't the right house in this time, then it's likely they were ringing the door bell multiple times or calling out loudly. That's basically best case. Worst case they were ding dong ditching or lawnshopping/swapping.", "They rang a stranger’s bell at 2AM.  They’re lucky they didn't get shot by someone with a hard-on for the Castle Doctrine.\n\nThey didn’t get arrested for ringing the doorbell.  They got arrested for being so drunk in public they were a nuisance and/or risk to themselves and others, and more importantly- for Running.  I don’t care what you did or didn’t do, the fastest way to get arrested is to see a cop and run away.  In the US anyway.  Most (sober) people know that.\n\nThey hiked while drunk to a house that was not Any of theirs and rang the doorbell because Everyone was too intoxicated to realize they were nowhere near wherever they were supposed to be going.\n\nWhen all of them had a tiny pocket computer to direct them to any places they wanted to go.\n\nThere’s a whole long string of bad decisions she made before ringing that doorbell.", "Thank you for the response. Makes sense now.", "America is such a weird place. You can drive at 15, fuck anyone you want at 16,  vote and join the military at 18, but do not let alcohol touch your lips until 21.", "Yeah that’s a bullshit arrest", "Knowing this was in the USA it’s even more NTA . She could have gotten shot . Ppl are too trigger happy and better she learn her lesson in jail than dead.", "Same", "Yup. Probably minutes if not a half hour of banging hard on the door, windows, shouting \"let me in\" and stuff thinking that their friends are being assholes and keeping them out/or pranking them.\n\nMeanwhile they're terrorizing elderly people who don't know wtf is going on. lol.", "I learnt how to run in heels! Not because I had to, because I wanted to. If you’re determined enough you can run in anything", "well .. I have. I promise you, being light of foot and wearing appropriate attire is an absolute must. \nI can imagine she wasn't dressed appropriately for a footrace.. not unless she masters the quick removal of heels, and a high pain tolerance for stone on toes. \nall that being said,\nmy point still stands.. if you choose to break the law, you have to accept the consequences like an adult. \nlike everyone else.\nyou're an adult at 18 here(UK) \nMolly coddling her will do nothing positive for her.", "😂", "Ew this comment is disgusting", "Only two weeks into the term at uni, I'm guessing the girl who lived in the house got the wrong house and rang the bell when her key didn't work. Easy done when you're drunk in the dark and have just moved in, I suppose!", "And then run from the cops 🤦‍♀️", "Which is dumb, here you get shot for doing a u-turn on a private driveway. \n\nWaiting wasn’t the end of the world.", ">And that's why children need decent fathers in their lives\n\nWell a decent anyone - any person who allows their child to face consequences confers the benefit: no additional education is granted if that person has a penis.", "Bail isn't set until you go before a judge, most areas will not have a judge available 24/7 so in all likelihood bail wasnt even set when your daughter called. You are NTA but as a mom I do understand your wife panicking. Get her a lawyer who can reduce the charges down as much as possible so a stupid college mistake doesn't follow her for life.", "Fair enough.", "So you have no idea how the American police force operates (poorly, victimise and abuse those in their care or that they encounter) but you were perfectly comfortable sleeping like a baby while leaving her in their care?", "NTA", "As a former Midwesterner, one of three things happen in this instance:\n\nYou run, get caught, the Good Ole Boy Network kicks in. For example you're a college sports player, you get the boys will boys, a slap on the shoulder and a ride home.\n\nYou run, get caught, and are just an everyday individual.  Cuffed and hauled off.\n\nYou run, get caught, and aren't pale or a college jock, you end up,with luck, in the hospital and not the morgue.\n\nCops give no fucks about the tax payers in the Midwest.", "Seems reasonable that they would arrest her. If she was belligerent enough to be ringing doorbells at 2 am, do you actually think the cop is going to allow them to leave  with a ticket?", "The drunk tank in a college town is absolutely not the same thing as a federal prison filled with violent offenders...", "> No trespassing, no attempted breaking and entering, no resisting arrest, etc.\n\nWhy do you think she is lucky for not getting charged with things she didn't do?", "If she was ringing the doorbell like you claimed then those trespassing, B&E charges wouldnt have stuck anyway. Absurd charges in the first place lmao.", "You are way too trusting of what the police tell you.", "Good luck!", "As far as teenaged shenanigans go, this is pretty mild. The arrest is more than enough punishment. I hope they support her in fighting the charges/ keeping it off her record. I'd be disappointed, but she was just trying to get somewhere safe while inebriated. That's more of a \"we need to talk about binge drinking and when you call a cab/choosing a designated sober friend\" than a \"ha! let her rot\" situation.", "Nobody makes good choices when drunk. She didn't drive, she didn't hurt anyone, she didn't cause property damage. I'd say the worst part of this was the binge drinking. I'd approach this with more concern than anger, you know? I might make helping to pay for her lawyer dependent on her getting counseling for binge drinking, but what she did wasn't terrible. It was stupid. Nobody got hurt, and she didn't put anyone in harm's way", "So her husband should listen to his hysterical wife and potentially get both of them killed by driving when he is too tired? Driving when you are tired is just as bad as driving drunk… when you or someone else end up dead does it matter whether you had a few too many drinks or you didn’t get enough sleep?", "The situation escalated because of a mistake and other people choosing not to just say “hey, you have the wrong house”. There shouldn’t have even been an opportunity to resist arrest because it’s ridiculous to consider that trespassing. Regardless of what the law is, morally it shouldn’t have happened.", "I bet the contents of Hunter Bidens laptop consume your thoughts 🤔", "I live on earth and i never did this either. It wont help if you're in a car accident coming to help her or going home afterwards. She probably spent a lot of time while waiting sleeping anyway. NTA", "And when you were a kid you didn't know anyone your age who had drunk before? Regardless, most people do try alcohol before they are legally allowed to. The point I'm making by that tho is that this is fairly normal 19 year old behavior. Your daughter is a victim of bad luck in this situation. (The bad luck being accidentally going to the wrong house and the homeowners calling the cops instead of telling them they were at the wrong house) While she did do something illegal, she didn't do anything morally wrong. She doesn't deserve to be left in a place where she is not safe, and a 19 year old girl alone in police lockup is not necessarily safe. Do you think your feelings about this situation are being influenced by your feelings about alcohol and drinking in general?", "I feel like you all know that I was being figurative, but yes fine, not everyone drinks underage but a lot of people do to the point that having had drunk underage is not remarkable or noteworthy.", "Oh, absolutely, I'm just wondering what's going to appear in the police blotter or the arrest report.\n\nI mean, it could also be protective custody if she was that drunk. \n\nI'm a compassionate softie. But I would have told her to hang in there and we would come in the morning.", "I live in the Midwest.  Believe me, drunk walking teens are the very least of the problems out here.", "Oh fuck off with that. She isn't lucky and the cops are on a power trip.", "Do you think that it's good that the police arrested and traumatized your child for doing something everyone that age does? You think you should go to jail for knocking on the wrong door? \n\nYou're an awful parent. Just take that boy and leave if you resent your wife and daughter that much.", "So she should be jailed to prevent some old psycho from committing murder? There is ZERO evidence of an attempted break in, just an insane thing to say.", "And yet you told her to leave or wait?  Im still leaning to YTA. Doing stuff will effect your relationship going forward.", "Running from the cops is illegal???", "But it’s not like it’s free. She’s getting into a shit tonne of debt to pay for it. Regardless, I don’t understand the relevance or why you included that information.", "~~That's like your opinion, man.~~\n\nDid OP mention being up late? no. Did he mention a health condition? no.\n\nHis wife was certainly able to get right up and was raring to go. It's not unreasonable to assume a similar bed time, especially since he did not mention anything different.\n\nWe could say that it's an adrenalin thing. She's his wife's biological child, hence adrenalin for her, but not him. Well guess what, that still shows his step-daughter exactly how important she is.\n\nI'm still sticking to my guns.\n\nI know that in that situation, I'd be out the door. I'd pound coffee if I had to. And even if it wasn't for my step-child, it would be for my wife.", "Assuming he is a healthy human being, waking up 4 hours early should not make him a danger while driving. OP did not mention anything to suggest there is a sleep related medical issue.\n\nI'm sticking to my guns.\n\nHis stepdaughter just isn't worth it.", "She is lock up for doing something stupid.\n\nOut of curiosity, how old were you when you had alcohol? Got drunk? You've never done something stupid that isn't a crime?\n\nThe legal hassle she's going to have to through is more than punishment enough. OP doesn't have to pile on it. He can also have her back while still holding her accountable.", "Did you miss the part about the wife having astigmatism and would want  him to drive because it’s dark. Funny how you overlooked that trying to put blame on OP and make him out to be a bad parent.", "If you could actually read you’d realise the wife couldn’t drive at night, and if she could why the need to wake OP at all", "That's a basic Tuesday in Wisconsin", "It might not have been a regular house or it’s such a generic looking building that it was easily mistakable.", "So my first weekend in my townhouse my junior year of college, I got turned around in the on-campus complex and ended up at our nuclear reactor.  The security guard was kind enough to point me in the correct direction.  Apparently it happens quite often early in the year as all the townhouses look the same.", "Not all college students live in dorms or college apartments.", "I agree with all the comments below when I was in my college town people did this regularly.", "It doesn't say it was uni housing. It says that *she* lives in uni housing but was walking with a group of friends to what they thought was one of *their* houses.", "A kid was murdered recently for doing that. Went to the wrong house to pickup his brothers. Homeowner shot him through the door. Wasn’t drinking, just the wrong house. Owner was charged with murder.  She needs to be careful. Some people shoot first, ask questions later.", ">  In this day and age of people getting shot for turning around in a driveway,\n\nOr getting shot for walking up to the wrong house thinking that was the house he was supposed to pick his baby brother up at.", "Admittedly, been .... a couple of decades for me.\n\nNTA.  Youngster and mom need to learn.  What on earth are they gonna do when a REAL emergency comes up???", "Honestly depends on the college town. It's the beginning of the school year, a bunch of new students partying getting drunk, the cops are used to this every year. Either it's a slap on the wrist because they know it's just a bunch of drunk students or they decide to make an example of them because they're sick of dealing with drunk students.", "Or hey if this is in the USA, they may have been shot through the door.", "Of course, they have no idea.  It’s called “speculation”.", "Meg made a long series of really bad choices that led to getting arrested, starting with drinking in the first place.  I'm also guessing that no matter what story Meg told her parents, it's leaving out some critical details.  I'm sure she claimed \"we rang the doorbell once and they called the cops.\" when it was probably more like \"we rang the doorbell multiple times and when the very angry voice through the door told us to fuck off, we proceeded to bang on the door and windows.\"", "Cops and being tools, name a more iconic duo.", "People don't get arrested just for ringing a door bell, even if it is the middle of the night.", "Running just makes you more guilty. You left the police no choice but to arrest. Staying put the police might have gone a little easier.", "The implication that drinking underage is wrong is absurd, in my opinion. And she's 19, which is legal drinking age in most sane places. \n\nDo police actually care about underage drinking in America? Where I am it's simply ignored unless connected with criminal activity.", "Calling being on someone's porch to ring their doorbell \"trespassing\" is a pretty nutty definition of the word.", "And public drunkenness, and undeaged drinking depending on state. \n\nAlso are \"drunk tanks\" not normal? If I ever got arrested for it I knew full well I'd be sleeping it off in holding and then Mom and Dad would get me when convenient.", "Likely arrested for underage drinking and public intoxication. I think drinking age in the States is 21 (don't quote me on that. I'm in Ontario, Canada and we can drink at 19). Windsor has a huge bar scene from all the cross-border partiers who can't go to a bar in MI.", "They got arrested for drinking underage, 100%. OP’s daughter is only 19, and OP confirmed he is in the states.", "Its cops trying to teach kids a lesson. Give them a court date ticket and let their parents lawyers work it out rather than have them spend some time on the taxpayer dime but what do i know?", "Also the legal drinking age in the US is 21.", "They were doing even less. It was during the day and they weren’t even drinking. And much younger", "good god, man - and that is relevant....how exactly?", "I mean, she hung around a strangers house/porch with no response long enough for the stranger to call the police, and for the police to travel there and detain her. Not a stretch at all to assume they were drunk enough to be slow, stupid, and loud.", "I would rather they call the cops than shoot blindly like some...", "Guess all you want, all we have is what OP told us and thats that they were ringing the doorbell. Everything else is supposition. Also, cops would have no reason to cover for Meg and probably would've mentioned those facts to her parents.", "Why's that, Farrando? Expand on your thoughts and why you disagree with me. I know theres a critical thinker behind those witty quips, go on then.", "It still doesn't make sense. \nUSA laws are bonkers. People who sell it give drinks to people to young to drink should be held liable, not the drinker.", "Not nationally a true statement.", "Honestly can't say I've ever met a person who ran from the cops while drunk, got caught, and then was just allowed to go on their merry way.", "That’s a college town arrest. It’s a major part of the town’s economy.", "Yup. Their crime being \"running away\" is fucked up. Police are way too self-important. Literally zero evidence of intent to break in but sure, let's throw em under arrest anyway.", "At 19 rocks didn’t hurt this small town girls feet also managed to freak out many urban people when you can stand still on asphalt barefooted in 80° (f) temps for long periods of time", "I mean I think it means that she was wearing heels and a skirt. Very much not conducive to feats of athleticism.", "Completely fair, I've never lived on campus or gotten that drunk so I wouldn't know... but I'm curious if she lives with other people or if she lives on her own.", "I bet it was more than 1 polite ring too. Something got those folks to call cops rather than answering their door. Little miss 19 is lucky to get a little time in the pokey rather than someone who has home security via Smith & Wesson", "Ah yes a perfectly reasonable reaction", "Both underage drinking and disorderly conduct are misdemeanors. With a good lawyer that’ll get expunged in a year or 2 tops.", "It's weird to frame it as \"sleeping like a baby\" when it's clear he was waiting to get adequate enough sleep to safely make an unexpected four hour drive. If neither of them were in a state to safely drive when they got that call and there was no emergency necessitating they risk it, being cautious was a reasonable call.", "Yes, once he saw it was a group of kids in mini skirts and high heels and especially bc its clear this is not a case worth prosecuting anyone over. Give the kids a notice to appear court summons and have them call their parents in front of you, call it a day.", "\"If\" is a big word in things like this.", "like honesty I can’t even imagine being able to go back to sleep knowing my daughter is in jail", "“nobody makes good choices when drunk” is not a free pass you hand out to drunk people making dumb decisions lol, being drunk should never be an excuse for any action you make in your life.", "Wow, whos the drama queen/king?", "If a group of strangers are trying to enter your house at 3 AM you wouldn't call the cops?", ">Your daughter is a victim of bad luck in this situation\n\nI'm gonna stop you right there.  Meg is an adult who made choices.  Some of those choices were bad and they resulted in her finding herself in a situation that involved the police.  Now, she is facing consequences of those choices.  She is NOT a victim.  The only victims are the poor elderly couple who were woken up at 2am by a group of drunk college students.", "please never parent a child", ">but a lot of people do to the point that having had drunk underage is not remarkable or noteworthy.\n\nAgain, I'm going to have to hard disagree with you there.\n\nI think you've mentally normalized something that's... not great, tbh.", "In my opinion, she's healthy, no one got hurt, no property was broken, and the only thing damaged is her ego.  She's lucky.", "She probably did not get arrested for ringing the wrong doorbell. More likely underage drinking, drunk and disorderly, possibly resisting arrest, etc.", ">You're an awful parent.\n\nAn awful parent would have left Meg there without going to bail her out at all.  I'd say I'm more average.", "Traumatized by the consequences of her own actions?? \n\nShe was charged with underage drinking and disorderly conduct…Play stupid games, win stupid prizes.", ">And yet you told her to leave or wait?\n\nYes, those were our 2 best available options at the time.  I suppose the 3rd option could have been waking up the 16-year-old and have him drive my wife there, but that seems irresponsible.", "When they are called to a house at 2am for a suspected breaking and entering, and you run from them on sight?  Yes.", "The daughter's life wasn't on the line, she wasn't in danger. I'm sure if that were the case, the OP here would have summoned the needed adrenaline. Unlike you, who according to your post were jailed through no fault of your own, the daughter made bad choices and got consequences. The circumstances are quite different, thus the different reactions. It doesn't stem from a lack of love or care.", "Read the first word of your comment and stop projecting.", "I feel like it’s happened a lot in multiple college towns the last few years. At least the stepdaughter wasn’t shot.", "Tailgated at Lambeau last year. Saw this first hand lol", "Why is there a nuclear reactor in a townhouse?", ">ended up at our nuvlear reactor\n\nWhat a wild turn lmfao", "This is a legit concern. Especially with loud people out side banging on your door in the middle of the night. I had a similar case working for the public defenders this last summer and the man who shot was found not guilty. Not identical, but similar.\n\nAs I’ve said elsewhere being drunk at night and walking around is among the most stupid decisions you can possibly make. Kids being kids, yes, but these kinds of things are usually wake up calls.\n\nTake an Uber home. Have someone stay sober to be a DD. Etc.", "That's what happened to a young man in my neighborhood in Columbia SC a couple of weeks ago. He was drunk and tried getting into the wrong house.", "Just a few weeks ago a drunken college kid get shot for this exact thing. He’d just started college and confused which house he lived in. Getting a few hours in jail could stop this poor girl from dealing with much harsher consequences. I wish we didn’t have to worry about guns, but we do.", "Cops might have worried that one of them would pull their pants up so as not to moon them and shot them for it.", "Thats raicist old farts...cops shoot you in the back or beat you to death", "If you’re drunk and underage maybe you do", "In the US people have gotten arrested and sometimes shot for less…", "Yes, the cops often care about it, but most often when tied to other things… like public intoxication.", "Granted, this was like 2005, but I was on a field school with a (mexican American, probably relevant) girl.  She told me how she got arrested for sitting and cracking a beer on a curb outside a house party. The cops busted up the party I guess, she was 19, and she had just showed up, found out her bf cheated on her, and went to crack a beer alone. She got thrown in the drunk tank or something to that effect completely sober.", "In a college town? Very much yes.\n\nMy hometown has a major US university. When there are 15-20k underage students wandering around, you really don't want them doing so absolutely trashed. A bar tender will cut you off when you get sloppy, but you can't get in until you're 21. Frat houses will just pour more whatever down your throat, and some of them don't check who they're serving. So it becomes a recipe for alcohol poisoning, SA, and drunk and disorderly. Especially during the fall Rush, which is coming up quickly.\n\nSo, if you go out and get trashed underage and come to the attention of the cops, you get arrested and charged with underage drinking. Depending on what else is going on, you might get something for being that intoxicated in public or a drunk and disorderly charge as well. And taken to the drunk tank to sober up where you can be supervised.", "Depends where and the situation. Sounds like a small college town so situations like this are pretty common. If the kids had stayed and (slurringly lol) explained what was going on, they probably would've just gotten a ticket and sent home. \n\nInstead, they tried to run and got caught. Just a guess, but the cops probably arrested them for being drunk in public and took them to jail to sober up. Once they were sober, they probably get released with a summons to go to court (essentially a ticket).", "This is the US  and drinking age is 21.  You can vote, you can serve your country at 18, but god forbid you’re allowed to drink until 21.", "The American Federal Government extorts the states by telling them they will not give them federal funding to build the roads if they don't make legal drinking age 21.", "She can go to war but tiny the wrong doorbell drunk and jail for you!", "By an ar 15....no problem....buy a 6 pack and knock on a door...arrested! Cops showed up quute fast too", "> Do police actually care about underage drinking in America?\n\nWhatever they tell you, in many places the police really do have a quota of tickets they're supposed to issue.", "This is the United States.\n\nYou can rape, steal and murder at will; but God help you if you break any of the alcohol laws.", "Police care about quotas and arresting drunk kids counts towards those", "Yes, they do care, and if you care about not getting arrested you don’t run around drunk in public underage in a college town", "Public drunkenness? Going to a bar and drinking and then walking home drunk is a crime now?", "Yes, the drinking age in the U.S. is 21. I used to go to B.C. to drink when i was in college because the drinking age was lower. \n\nThis was how i got kicked out of a bar in Surrey B.C. by the RCMP. I didn't start the fight. I swear.", "You are correct, the legal drinking age in the US is 21.\n\nBeyond that, she's actually lucky, there's some recent high profile cases in the US where people have been shot through the door by people.  Sure, the people who shot the unsuspecting people were arrested, but that's cold comfort if you're dead.", "And 18 here in AB", "Yep, definitely charged with underage drinking. Cops in college towns have nothing better to do than harass college kids just being college kids. And then boomers living in college towns suck too. Should have just answered the door and said they were at the wrong house. I love boomers that live in college towns and then complain about college kids being college kids.", "I'd love an update from OP on charges.\n\nShe can be looking at:\nUnderage drinking \nPublic Intoxication \nFleeing from a Police Officer\nResisting Arrest\n\nDepends on how the cops felt that night. Maybe she was in drunk tank and was gonna get released in the afternoon anyway. \n\nActions have consequences and today it was getting drunk, knocking on the wrong house and getting arrested. Hopefully lesson learned and next time it's not getting drunk and wrapping your car around a telephone pole. Only two ways forward, she learns her limits and this doesn't happen again or she doesn't and the consequences will escalate commensurate to her actions.", "Right.  But she wasn’t arrested for possession of alcohol by an underage person.", "Bingo. If they were drunk enough to think it was one of their houses they were probably drunk enough to be acting like asses when nobody opened the door for them. Shit hammered drunk, thinking the roommates aren't letting you in, and you belong in the house...I doubt it was just one or two rings of the doorbell lol.\n\nSo she spent a few hours in the drunk tank, not a big deal. My parents would've done the same thing as OP if I dared call them at 3am to bail me out. I'd rather spend the morning in the holding cell and wait to be released than call my parents and have to explain myself.", "We know the police had time to arrive and arrest them, so they stuck around at the \"wrong house\" for a good while", "It's about the underage drinking and running from the cops not about ringing a doorbell.", "In some cases, they are. Gotta be able to prove they did it.", "A legal drinking age of 21 is bonkers, too. They can buy guns legally at 18, but have to wait 3 more years to drink? What sort of backwards fucking pageantry is that?", "Drunk 18 yr old girl and the police don't arrest her but send her home? Who's responsible for her safety then? The safest place for her probably was to spend a few hours locked up.  \n\n\nYes in the US police often go after the place selling the alcohol but that doesn't let the underage drinkers off the hook.", "what's bonkers is they'd actually book someone and put them in jail for a victimless crime; what a waste of $ and time; just drive them home and fine them ffs", "And how exactly do you prove that the store has the knowledge that the person legally purchasing the alcohol is illegally giving it to the person underage", "So ypu are saying that underage drinkers shouldn't be held responsible for thier actions? Do you want to rethink that?", "I think in UK our police services are so chronically underfunded we just can’t imagine police having the time to follow through on such a minor crime.", "< sheepishly raises hand >  Happened to me in High School. They took my name, confiscated my beer, (and that of the others at the park that night) and told us to be out of the park before midnight. No charges, no calls to parents, nothing but taking our beer.", "It happened to me and my brother and his friend when we were kids. It was basically right out front of my house. we thought it would be a good idea to try and meet the women who lived across the street from us at night, and they just called the cops instead. We were really drunk and ran but my brother was caught while me and his friend got away. I made it back to the house and noticed they had my brother cuffed and sitting on the curb, so I went out to tell the police what happened, and after a few hours, they eventually let us go. I was probably 19, so they were 16.", "Knocking on a door is not trespassing or breaking an entering. You keep saying she was lucky she wasn’t charged with worse. She was a drunk teenager, you come across as someone who thinks she deserves worse and that you don’t give a shit about her", "I'm from Florida living in Ohio and that still wigs random people out. They knock on my door in the middle of the summer, I have to come around from the back because my front door doesn't open. I'm all barefoot on asphalt in 90 degree weather. They're all \"isn't that hot?\" \"No, now what did you want?\"", "The fact that's it's not a reasonable response doesn't mean it doesn't happen", "\"adequate enough sleep\"? Nah, all OP cared was their own comfort. They slept without a care in the world about how their loved ones were feeling.\n\nMaybe he was just calling her bluff, but he literally told his wife he'd rather her drive unsafely and put her life in danger than not get his own way.\n\nAny parent who thinks the police have useful life lessons to teach, rather than being capable of teaching them themselves, isn't doing very well at said parenting.", ">Sure lets put the taxpayers on the hook to teach this kid a lesson. This should've been a citation at most.\n\nYou do realize that \"giving them a notice to appear in court\" would result in them having to show up, and thus spending tax payer money?", "His wife couldn't! She couldn't even drive herself because of vision issues. OP is a heartless, no-good, selfish b@st@rd", "I'd say it doesn't excuse you from harm you cause. If you break something when drunk, you pay to fix it, if you cheat, the relationship is over. She was trying to find her friend's house to go to sleep, not start a bar fight. She got scared and ran, she didn't hurt anyone or anything.", "Not if it’s a group of drunk college kids in the beginning weeks of college being back in and they rang the doorbell. I’d say, “hi, what do you need?” Cause that’s what I do when people ring my doorbell. I’d be annoyed that I got woken up and probably be angry that they made the mistake. Sounds like we have different levels of feeling safe in our homes and might just not see eye to eye on this", "It's bad luck to get in legal trouble for underage drinking because most people never see any consequences. I didn't say she made all good choices, but most 19 year olds who get drunk usually get a bad hangover, not actual legal trouble. And I'm not necessarily saying that the couple is wrong for calling the cops, I'm just saying that it was bad luck for your daughter that they did. Have you never broken any law? You've never jaywalked? Never accidently run a red light because you thought you could make the yellow? Also I like how you \"stopped me right there\" before the part where I point out that your daughter is not necessarily safe in police lockup.", "Yeah it is bad luck. All kids drink and this almost never happens\nShe ran into power-tripping pigsp\n\nHow are they a victim? Because someone knocked on their door? The molly coddling of terrified suburban homeowners has to stop. Those old geezers can drop dead as far as I'm concerned lol", "I think that you shouldn't leave your teenage daughter in jail overnight so I shouldn't have kids?", "I don't think I've normalized anything, my lived experience is that most people don't wait till 21 to have their first drink. Perhaps we are from very different parts of the world, but I've lived in a handful of very different places and in all of those places at least half the kids started drinking before 21.", "Except depending on the state she has a high class misdeamor punishable by any where from 8 to 11 months in jail. Cops usually just give a ticket and a trip to the drunk tank/ hospital for some underage drinking.", "There is no resisting charge. Read the thread. The disorderly charge is absolutely for ringing the bell.", "God I hope your wife leaves and daughter never speaks to you again.", "You never drank until you were 21?\n\nYes, imprisoning people with rapists and killers over childhood mistakes is traumatizing.", "No you could have seen you wife was visibly upset and helped her out. I feel her frustration.", "You could’ve driven and left your wife with the children", "How is ringing a door bell is a suspected breaking and entering", "Unfortunately, that very scenario happened at the Univ of South Carolina 2 weeks ago.  A student stumbled up to the wrong house at 2 am, and he was shot/killed.  Very sad situation for both the homeowner, who was scared and thought he was being burglarized and the intoxicated college kid/family.", "It was across the street.", "Yeah, it's a definite concern especially in the USA. And it's unfortunate that you have to be afraid thst you can get shot by knocking on someone's door. Obviously in this case they were just being loud and scaring this couple.  But yes, have a DD, or even one/two person staying sober to try to corral the drunk ones. \n\nAs for the Uber, if you are female, it's also a concern to take one alone.", "That’s super fucked up that someone can get off a murder charge like that.  Forget drunk idiots, imagine someone is in danger and knocks on a door at night for help.  Guess you can’t do that in the US because some jackass will murder you.  IMO, if you are so pants shittingly terrified of the world that someone knocking on a locked door is threatening to you, then you shouldn’t be allowed guns.", "21 years old KIDS?", "Oh no..", "That’s what happened to a young man in my neighborhood in Kansas City. Black man shot by white homeowner.", "And if you run when the cops show up", "Honestly, lowering the drinking age means that kids are used to alcohol and don't go on huge binges until they are catalytic (unless you are British, that's just a national sport)", "This is crazy that the police would waste time charging, holding, and releasing someone for drinking alcohol. Do they have nothing else to do?\n\nHow does it benefit society to have a bunch of teenagers start out life with a criminal record?\n\nLike, the problems you are describing would still happen no matter what the legal drinking age. Except now there's a criminal record. Charge people for assault, drinking and driving, sure. Those things actually hurt people. Drinking? Who does that hurt, except one's own liver and kidneys. And in that case, it's a health care issue, not criminal.", "Never never never run from the popo! One might still get in trouble, but it'll be a lot worse if one runs", "Hell, in the US these days you might get shot for that, so jail isn't even the worst thing that could happen. Seems like there's a story at least every other day about someone getting shot for knocking on the wrong door or turning into the wrong driveway. \n\nThe wild thing is that parents will fucking tear down the school board for daring to teach sex ed, but are totally fine with mass shooter drills and will argue against any gun restrictions. My European parents were always *completely* flummoxed by the way that, from real life to movies, the US is totally fine with violence and carnage, but heaven help you if you show a nipple.", "Public intoxication is a crime in many jurisdictions. Not a commonly charged offence, mind, but still a valid basis to arrest.", "Banging on some random person's door at 3 AM is a pretty good reason for an officer to exercise their discretion to arrest for this. A disorderly conduct charge would also be reasonable even if sober.", "It is.  Especially if you’re annoying or endangering other people while you hike home.\n\nWalk four blocks along the sidewalk alone minding your own business listing at a twelve degree angle?  Whatever.\n\nShout obscene slurs at passresby, hit on people, piss in a doorway, pound on an apartment and demand to use their bathroom, puke on someone’s car, stagger into a crosswalk against the walk signal,  or sing your favorite team fight song to the outside world at 3AM?  Much more likely you’ll get cited.", "wait, you got kicked out for not being the legal drinking age in the us? in a canadian bar?", "Lmfao “actions have consequences” like this person drove drunk and killed a person. If you live in a college town, especially close to campus, you should expect stuff like this to happen from time to time. Most kids to different homes every year, and if they don’t live in the college town over the summer, it’s normal for them to get turned around and not know where they are at in town.\n\nThe kid is 19 and in college, they are gonna party, drink, and overdue it sometimes. A hangover should be the only thing they have to deal with, not power hungry college town cops that are bored so they harass kids for being kids.", "You don’t need to possess alcohol (Minor in Possession), you can also get busted for MIC/ minor in consumption", "Doesn’t matter that she didn’t have alcohol on her, she was drunk", "Public intoxication, I presume.", "Eh, not necessarily. Yes, they were obviously probably hammered, but it sounds like she’s in a college town. Cops in college towns are absolutely itching to arrest you for underage drinking. They cruise around all night literally waiting. I watched a kid walk out of a house party one time with a red solo cup and immediately get grabbed. Don’t think OP is TA at all, nor do I blame the owners of the house for calling the cops, but she could have genuinely just been drunk and confused. She may not be TA either.", "I was thinking the same thing!!  It would had to have been HUGE for me to have called my parents at 3 am, asking to be bailed out of jail!!!", "Yeah I’m not a fan of the law (edit: as in drinking age), but I obeyed it, mainly to avoid situations like above.\n\nAnd man the punishments for selling drinks to a minor are ALOT more than drinking as a minor/under 21. One of my first jobs was a store clerk and the sheer amount of punishment I could receive… let’s just say I followed policy and even carded people who looked over 50.", "They can also drive (or pilot a plane) at 16. 18, can kill people in the military service(alternatively, they can be trusted not to). And are considered to be adults for almost everything else, including criminal responsibility. \n\nBut no, can only drink at 21.", "Particularly when she clearly couldn't remember where she lived 🙃", "It's a whole bunch of stuff that shouldn't be crimes. Adults should be able to drink legally, you should be able to ring a person's doorbell when you're lost without getting arrested (or shot) etc. \n\nIt's no wonder the US has one of the highest incarceration rates in the world.", "A lot of police departments are going to at least put you in a cell overnight if you’re drunk in public due to liability. If they interact with you and let you go while shitfaced and you hurt yourself or get hurt, their department can get sued. They’re not going to take that chance.", "'Murica!!!", "I certainly don’t think it’s commensurate w/ arson or murder, however-I can’t imagine the elderly couple thinking their house was being invaded/burgled would NOT agree it’s a ‘victimless’ crime!", "Probably but not the way it’s currently handled by the law. Not all punishments need to be so absolute.", "Yeah, these are bored, well-funded college town cops. What constitutes an arrestable and prosecutable offense in the US really does vary town-by-town, county by county, state-by-state.\n\nThat said, running away from cops, no matter the context, is pretty much the only universal law in the US despite what the Bill of Rights says. The amount of power cops have is insane.", "I'm just very grateful that she is healthy and unhurt.  The legal issues don't matter nearly as much as the fact that she's OK.  We will get a lawyer and figure out what options are available to us in terms of legal action.", "It’s disorderly conduct and public intoxication. It’s absolutely a crime and she could have been charged for more. \n\nShould she have been charged with more? No. But could she have? Yes. \n\n“But it’s victimless!”\n\nWhat if she walked in a street because she was drunk and was hit? There is a reason for all… well most… laws whether we agree with them or not.\n\nWhat if the homeowner responded to pounding on his/her door with a loaded gun being scared at night? \n\nWalking around drunk is among the stupidest things you can do and frankly it’s a good lesson for a kid. Not fun. Not nice. But a good lesson.\n\nThe things I’ve seen happen to people who had a bit to drink and thought they were fine to interact with others, etc. Lowered perceptions/faculties are EXTREMELY bad.", "Evading/resisting is most def worse, and she was 100% guilty.", "bruh chill, no need to lash out... That's crap, expecting him to drive 4h in the middle of the night for a relatively minor incident", "and if she had been a responsible adult and not drank as much shed have been sober enough to go to the correct house and not run from the police, i see what you are trying to get at but this is not some silly little college thing, she made multiple bad decisions that led to her sitting in a cell and cried to mommy to come fix it….", "My god.  Are you ok?  I mean, truly and honestly, are you ok?", "I'm sure we can get a lawyer and fight and hopefully get it reduced or even dropped.  A quick google search of the charge in our state says that a conviction brings a sentence of no more than 180 days and/or a fine of no more than $1,000.  Given this is Meg's first offence, I'm hoping that a reduction or dropping of the charge is a good possibility.", "Better than getting shot or tazed and charged with resisting arrest.\n\nOP lives in America, what happened to OP's step daughter IS lucky. Especially if she's any kind of minority.", "Honestly, after talking with the cops while picking her up, they could have charged her with more.  They were called to the house for an attempted breaking and entering.  Meg ran from the scene of a suspected crime.  She's lucky she didn't get charged with more than she did, they let her off easy.", "You must be a child who does this because not everyone gets so drunk they don’t know where they live. Not everyone gets so drunk the fled from cops which is honestly probably why she got arrested. Not everyone gets arrested at 19 for underage drinking. She’s luck if the school doesn’t hear of this and deem it inappropriate. I’ve seen people get kicked out for less. I hope this girl learned her lesson in the drunk tank which is most likely where she was placed. She not traumatized and if she is she should now know that her actions have consequences. Op is also not wrong in not wanting to leave his 2 minor children alone at 4am with no explanation and he shouldn’t have to mess with their sleep because their other child was acting completely selfish. Ops wife is enabling this girl it’s why she acts that way and it’s crazy. She’s old enough to know her actions have consequences and spending time in the drunk tank for being intoxicated underage, and fleeing from cops is the consequences for her actions she’s lucky this didn’t end terribly for her. What if they live in a state where it’s legal to protect your family by any means necessary. This girl could have had her life ended if she showed up on the wrong door. Hell what if it was the door of a serial killer and they just let her in. Hell she’s 19 and a drunk woman so she endangered herself. There are so many horrible endings that could have happened she better realize this and be thankful op didn’t wait until his work day was over to drive and get her.", "De-clutch your pearls.\n\nWorst case scenario, she was in jail, not prison. It’s more likely that it was a holding cell at the local PD.\n\nAnyone who drinks underage does so knowing that there are consequences if you are stupid enough (or unlucky enough) to get busted by the cops. It’s a gamble. \n\nMeg gambled and lost…that’s 100% on her. Being detained for four more hours wasn’t traumatizing or dangerous, it’s learning a lesson.", "Op said in a comment that the police said the elderly couple who lived at the house they were at called them there because they heard commotion and thought there house was being broken into.", "Thieves often ring doorbells at night before trying to break in to see if any lights turn on. If yes, move on to the next place. If no, maybe don't.", "The same thing happened in Boulder a few years ago.", "You don’t only have to worry about getting shit from knocking on a door, you also have to worry about getting killed from opening the door when someone knocks. It goes both ways these days.", "So as I said similar case. If you reasonably believe you are in danger then yes you have some limited force you can use.\n\nIt gets alot more complicated but let me be clear- it was not a person in terror. It was multiple drunk and disorderly people, like this, which were incoherent, and made someone truly fear for their lives. Even then I assume it was very close.\n\nEdit- as I said we got them found not guilty but they didn’t kill anyone. Heavily wound, yes. Kill, no.", "In most cases, such as the most recent one, the guy was drunk and pounding on the door and kicking it in the middle of the night.  Do that at my house at 2AM and you probably would be shot.  No one pounding on your door at 2AM is there to say hi.", "OPs daughter is 19. I consider that a kid, yes.\n\nHowever, despite being a kid they still have adult rules and responsibilities and they have to grow up.", "He was shot and killed. Homeowners weren't charged. [dead](https://www.postandcourier.com/columbia/fatal-shooting-of-usc-student-deemed-justifiable-by-columbia-police/article_61a6df78-476d-11ee-ba6e-ef094cb92287.html)", "I went to school in a city where the university (and student off-campus housing) is smack dab in the middle of an \"old money\" neighborhood.... and the longtime residents HATE the college brats with unbridled passion and patrol the rental houses with the venom of 100 HOA Presidents.  \n\nIf this story happened here in town, I wouldn't doubt for a second that it escalated quicker than necessary.", "The earlier you start drinking the more likely it is for it to become a problem.\n\nNIH: “Drinking at an early age. A recent national survey found that among people ages 26 and older, those who began drinking before age 15 were more than three times as likely to report having AUD (alcohol use disorder) in the past year as those who waited until age 21 or later to begin drinking.The risk for females in this group is higher than that of males.”", "Drunk college kids are not known for making the best decisions lol.", "As far as I've seen it enforced, it has been \"Hey, this person is drunk and a potential danger to themselves and/or others. Lets put them in jail overnight and let them out in the morning, potentially with a fine.\" but yeah, it's been a crime all my life.", "That one has always baffled me as well.  Like, \"I'm of legal drinking age, I arranged for a ride so that I wouldn't drive, I paid for my drinks and tipped generously, got loaded, but it was a crime for me to stand outside in front of the bar waiting for my friend to pick me up.\"\n\nI have a feeling that \"public intoxication\" is less about walking home quietly with your friends after a long night of doing shots, and more about the three of you stomping down the sidewalk at 3:30am laughing like banshees trying to remember the third verse to \"Barnacle Bill the Sailor.\"", "No. I got kicked out because i was dancing with a guy, and he bought me a drink. Then this chick followed me into the bathroom to yell at me that he was her boyfriend. She pushed me, so i pushed her back. A fight ensued. Someone called the cops. My friends and i were told to go.\n\nThank God one of my roommates wasn't drinking, so we made it home just fine.", "Agreed.  This thread is unbelievable.", "The consequence could've been a Stand Your Ground nut that opened them full of holes.\n\nKids ARE gonna do stupid shit, this wasn't a moral discussion on underage drinking or law enforcement. She knows she not 'old enough' to drink, but did it anyways and then got caught.\n\nThe people who she and her friends woke up at 3am are probably sick and tired of that shit happening from dumb college kids, so they just called the cops. \n\nThat's it. Actions > Consequences. Play stupid games, win stupid prizes. Did the cops go too far? Who knows, we don't have all the information. Maybe if they didn't run away they would've just been cited. Maybe the cops find that shit funny and would've drove them home. All we know is and underage person drank and got caught for it.", "Oh yeah it can get pretty heavy quick", "well; we allow people to profit from incarcerating people which is a morally and socially bankrupt practice; but not sure that will change in our lifetimes... I consider myself lucky to live in a rural area that doesn't concern itself with how many people it can shove into jail for however much $", "Private prisons exist, when they should be illegal. Of course our idiotic legal system think this is perfectly fine. Also stupid ass quotas. They keep saying the rich and famous don't get away with anything but that is a big fat lie. Only when they can't keep hiding their lies anymore and when it has happened to other rich and famous people does the legal system catch up.", "She’s drunk underaged and disorderly in a college town. Will be a slap on the wrist. She’s not spending another night in jail, and this won’t affect her future.", "Victimless?  Two old people woken up with a disturbance on their porch?  They called the police because they didn't feel able to protect themselves and felt attacked, because it sounded like an attack and they believed they were being attacked.  \n\nI'm betting they are going to be stressed out and have issues sleeping for a while, because of this.  It's not victimless.  The victims are just silent.  \n\nWhat if one of them has major health issues, like a heart condition?   Just because we aren't hearing about how this affected the home owners doesn't mean they didn't suffer.", "His teenage daughter was in a jail cell. His wife was beside herself with worry. I don't see how that's not an asshole move. She was dumb, but hardly deserved to be in jail.", "But nobody was hurt. To me, this was something that should be addressed with counseling/ serious talks about binge drinking and making safe choices, not jail. He'd be inclined to avoid minimizing what she did to not sound like an AH, but instead he made it clear that they were on foot and didn't cause harm to anyone or anything beyond scaring the old couple. I think she should have to pay for a nice bouquet with a hand-written apology and possibly get counseling for her binge drinking, but this doesn't merit anything legal IMO. I filled out my paperwork for jury duty a few days ago, and I'd push for jury nullification if I was on that trial. Just refuse to vote guilty and push others to do the same.", "[removed]", "It's basically guaranteed that she sees no jail time unless she gets even more unlucky with a judge or ada looking to make a name for themselves. Given all that she is still not lucky.", "Let's see, seeing as I am not only an American living in the midwest, who went to college in the midwest, who is a minority, who is a practicing attorney, and who got caught drinking underage in college I think I can make a pretty informed call and say that she was not lucky in this situation.", "Cops will say a lot and are not the DA. there's literally no way. If there was an attempted b&e, don't you think the people who called would press charges? Do you really think cops arrest people for *burglary* then just let them off with a warning. Could they have arrested her for more? Yes. Would the DA actually prosecute? Maybe. Would they just let someone walk away from this specific thing? Almost certainly no. They just told you this to seem tough/dona a scared straight thing.", "No, they didn’t charge her because they didn’t think they could get a conviction. People who break and enter don’t knock on the door first.", "No evidence she was too drunk to know what house it was. People make this mistake sober all the time. A 9 year old fot shot for it in my city. And guess what happened? They arrested the shooter, not the child because you don't arrest people to \"protect\" them from someone else hypothetically killing rhem.\n\nI did do this. Black out drunk at 18, passing out in dorm hallway, paramedics called. Never apologized and never will. Have a high paying job in the government and a graduate degree. Let kids be kids. \n\nNo public school is going to punish a student for off campus underage drinking if it's not part of a school function. Literally not allowed to.", "I didn't say she was in prison. I said \"imprisoned,\" which is an entirely applicable definition to being held in a cage at gunpoint. And yes, that would be traumatizing and is *objectively* dangerous. Do you know how many people die without trial in US *jails*, not prison? This didn't teach any lesson. She will not stop drinking, nor should she. All she learned is that her dad's an asshole and she's lucky he wasn't the SA kind of stepdad. \n\nYes, it is a risk. But good parents should support their kid if they make a mistake. OP clearly has something against this girl based on the way he talks about her. \n\nYou aren't answering my question. Did you drink underage?", "My Canadian ass reading this, remembering the time late at night when a drunk teen girl knocked on my porch door because her boyfriend left her stranded and I brought her in, made her tea, let her phone her dad and gave her an extra hoodie: America is a fucking dystopian hellscape.", "She ceased being a child at 18.", "That's horrible.", "This is true.\n\nI was never a drunk college kid, so I'll have to concede the point to you", "So because a some nutjob might abuse stand your ground laws to murder her, she deserves to stay in jail?  Makes sense", "You haven’t even come close to justifying the arrest. I know there are a lot of people who get off on people being jailed but it’s not a respectable position.\n\nDemanding consequences regardless of the harm of the action is psychotic behaviour", "Yeah, the kind of slavery still allowed in the USA: prison slavery.", "I wasn’t saying it was victimless I was quoting someone else that I thought had a stupid idea. I 100% agree.", "They feel attacked by having their doorbell rung and porch walked onto? That's crazy. You know people can just walk wherever there is no fence right?\n\nThey could literally have shouted \"go away or I'm calling the police\" and been done with it", "Also she's 19. Old enough to know what gets you in trouble.", "She ran away, nothing else to expect from that situation. He was reasonable. Parents are no superhumans.", "[removed]", "[removed]", "I dunno.  Could have been worse.  Homeowner could have gone vigilante instead of picking up the phone.  She could have fallen and injured herself while trying to run away.  She could have lost her phone and had no way to contact us (I honestly don't think she has either of our numbers memorized).  So yes, she's lucky.", "[removed]", "Ohh I see you were a terrible kid so it’s ok for all kids to be terrible kids. I personally believe your parents failed you if you see no wrong in what you did. It takes one google search to read the story of Ralph Yarl a 16 year old boy has sadly passed due to him knocking on the wrong door. You know what happened to the shooter nothing. It’s sad you don’t realize she put herself in danger of multiple things not just cop. In my opinion that is probably the safest of the things that could have happened to her. And obviously she was to drunk if she ran from the cops op even says she ran because she was drunk and underage. I hope you mature and realize that she messed up and she needs to be thankful that op didn’t just refuse to get her all together between both her and her mothers horrible actions. And once again a quick google search will tell you they can kick you out for underage drinking as it tends to fall on the school if there are any legal repercussions.", "Well, \n\n\n1) I wasn’t referring to you using the term ‘imprisoned’ when I stated the worst case scenario. I was referring to your panicked concern over Meg being held with convicted rapists and killers. Those criminals tend to be in prison, not jail. \n\n\n2) Given your deep concern over proper terminology, it’s a cell, not a cage. Cells are small, locked rooms where individuals who are in police custody are housed. Cages are for animals. I don’t think it’s nice for you to imply that Meg is an animal. \n\n\n3) Cops don’t typically place arrested individuals into the cells at gun point. It creates more paperwork…and they don’t usually like paperwork. \n\n\n4) There were around 600 federal in-custody deaths in FY2020, but I couldn’t tell you how many of them were pre-trial. \n\n\n5) It was a lesson on consequences for Meg. She chose to get drunk while underage, and she chose to run from the cops when her friends drunkenly banged on the wrong front door. Getting arrested is the consequence of her own actions. \n\n\n6) OP went and bailed her out within 7 hours of getting the call (and three of those hours was spent driving to her location). That IS supporting a child who made a mistake…while also not treating Meg like a victim. An AH move would be denying her bail or any financial assistance through the legal process. \n\n\n7) OP does not ‘clearly [have] something against’ Meg…you’re making absurd assumptions, likely based off of your own issues. \n\n\nAnd finally, my actions, or lack thereof, while underage are not germane. However, had I been arrested for underage drinking, I would have had to face the consequences…just like Meg. \n\n\nIf she finds the whole scenario ‘traumatizing’ and ‘dangerous’, then Meg only has herself to blame. \n\n\n Hopefully Meg accepts responsibility for her actions and doesn’t attempt your argument of ‘well, it’s not a crime because everyone does it’…bc the judge won’t find that amusing and that could result in a harsher punishment.", "Yes her brain magically changed to that of a fully developed adult brain on her 18th birthday.", "I’ve made a lot of mistakes in my life but not drinking til 21 was definitely one of my smartest decisions.\n\nThe amount of people I saw get in trouble because of drinking too much too young…\n\nYes it’d be better if it was legalized and moderated but getting hammered at 18/19 is just stupid.\n\nKids will be kids but kids will have to deal with consequences.", "I’m guessing the area you live in & where the arrest was made are wildly different. M\nIn the US, the property belongs to the property OWNERS. So….no. You can’t just walk anywhere there isn’t a fence.", "But young enough that her brain isn't done developing. I'd be all for leaving her there if she drove or was destructive, but this isn't terrible. She didn't deserve to spend the night in jail, imo. I'm all for consequences, but he's overly harsh.", "[removed]", "Oh look I have the mostly nonfatal cancer I'm so lucky it's not one of the fatal ones vs not having any type of cancer.\n\nI got lucky that I only popped one tire not two vs getting home without issue. \n\nI got lucky that my portfolio grew by 5% vs i got lucky that my one meme stock actually went to the moon.", "[removed]", "How does getting drunk make someone a \"terrible\" person in and of itself? \n\nNo public school has ever expelled a student for underage drinking that was not on school property or linked to school activities. Find me a single example of that.\n\nI live in Kansas City dumbass, that's what I'm talking about. Under your argument, Ralph should have been arrested to protect him. No, that's absurd. Fortunately, the criminal would have been arrwsted.", "That's how it's supposed to work. One of the jobs parents and schools had was to inform the under 18s was that you are, in fact, fully responsible for all of your actions on your 18th birthday, so you should start thinking that way now. Today, they're still acting like children at 25.", "I mean physically you can. People do get the wrong house all the time. The idea that you wouldn't even communicate from your position of safety is wild to me.\n\nDoes your mailman or the JW ask for permission before getting on YOUR PROPERTY?\n\nPS they didn't criminally trespass according to US law.", "Any jurisdiction in the US, it’s fine to walk up to a door and ring the bell, and it’s not trespassing unless you hop a fence or you’re told to leave and then don’t. You can’t be trespassing if you have permission to be on the land, and the existence of a doorbell and/or walkway is implied permission unless you have a good reason to think otherwise.", "[removed]", "[removed]", "[removed]", "It’s the lack of remorse that makes it horrible the fact that it didn’t just effect you but others.\n\nJust google what happens when you are arrested of campus I’m sure you will be able to find them. But if you to lazy to it depends on what charges she gets. You know like if they had actually charged her for fleeing from the police. \n\nAnd no I’m not saying he should have been arrested I’m saying she put herself in danger. If you reread my first response I said she was most likely arrested because she ran from the cops, and underage drinking neither of those things have to do with Ralph as he did not do that. So let me re-alliterate it for you she put herself in danger in many ways. She is a young woman who was drunk and didn’t know her way home. She could have had a worse outcome than the one she currently has. She should be thankful that her parents care enough to come bail her out. Because not all parents are like that. She should take this as a learning experience and hopefully get better at her balance in how to have fun. She is still learning and I hope she grows from this."]}