{"id": 26780, "submission_id": "16htfo5", "title": "AITA for telling “step siblings” dad off for criticizing me for not doing chores", "selftext": "I (f15) got diagnosed with Cancer (Leukemia) 2 months ago. It has been rough I’m constantly feeling sick and tired for about a week after chemo. \n\nI live with my dad, dad’s GF,  and her 2 kids (m10) & (f12). My dad and his girlfriend have been dating for 3 years now and started living with us about a year ago. Her kids visit with their dad every other weekend but during the week sometimes he does stuff like take them out to eat or something. \n\nBoth the kids and I usually have a few chores we have to do Daily. But since starting chemo some days I barely have the energy to watch TV let alone do chores so usually I don’t do them on days like that. \n\nWell, yesterday the kid’s dad came over to take them to the movies, Dad’s girlfriend wanted them to finish putting the dishes away and I was 2  days post chemo and laying on the couch barely keeping my eyes open enough to watch TV. The kid’s dad saw him and asked why his kids had to do all the chores and I just got to lay around. He knows I have cancer too. Before my dad or his gf could reply I said I just finished a round of chemo 2 days ago that’s why… would you make your kids do chores after having toxins go in their body… if so then your a big asshole. He got mad and called me a brat. \n\nMy dad and his girlfriend aren’t mad at me but said I should have worded it differently since the kids were around and that’s their dad. I feel like I was in the wrong now… so I’m asking for Reddit's opinion Was I an AH?", "created_utc": 1694626739, "permalink": "/r/AmItheAsshole/comments/16htfo5/aita_for_telling_step_siblings_dad_off_for/", "score": 1123, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I'm the asshole for telling my step siblings dad he is an asshole after he criticizes me\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I'm sure you would rather be doing chores than chemo.", "NTA. He should keep his mouth shut about you. What you are or are not doing is none of his business. He can express his opinion when one of his kids are going through chemo.", "Nta.  Insulting a kid with cancer is way worse than insulting an ah.", "Well. You now know one reason your stepmom is not with her ex anymore. Lack of empathy and inability to apologize when proven wrong.\n\n\"Imagine your kids had cancer\" is not the worst answer to give to a \"Why isn't the cancer kid doing chores?\", so I think your dad and stepmom are trying too much to placate the ex, probably to keep the peace. But it's not a hill they should choose to die on.\n\nNTA", "I'm so sorry to hear of your diagnosis. NTA - chemo = fatigue.", "Definitely NTA....could it have been worded differently, sure. But at the same time, he could've worded his comments differently and been more understanding of the circumstances.", "First. \n\n Fuck cancer\n\n\n You are NTA\n\n\n The other dad is..", "NTA, but I casting a hard side-eye at your dad. People who don't live there shouldn't be coming in your house unnecessarily while you're more susceptible to infection, and certainly not with all the crap going around. Add in that this other guy can't even behave reasonably well, and he should never be in your house. Your dad is not doing his job as a parent here.", "NTA - not his circus and not his elephants. I hope you feel better soon.", "NTA Your Dad and GF are right you could have worded things differently. That being said, you're allowed some slack at 15. Diplomacy is something which is learnt over time and the other Dad was being an AH.\n\nGood Luck with your treatment and I wish you well.", "NTA and your dad and his girlfriend should have defended you. Good luck with your treatment OP", "NTA", "NTA. \n\nCould you have handled it with more tact? Sure. But I feel like your response was firmly in the category of \"entirely reasonable,\" and well short of being enough to make you the asshole. \n\nHe was acting like a dick and you called him on it.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f15) got diagnosed with Cancer (Leukemia) 2 months ago. It has been rough I’m constantly feeling sick and tired for about a week after chemo. \n\nI live with my dad, dad’s GF,  and her 2 kids (m10) & (f12). My dad and his girlfriend have been dating for 3 years now and started living with us about a year ago. Her kids visit with their dad every other weekend but during the week sometimes he does stuff like take them out to eat or something. \n\nBoth the kids and I usually have a few chores we have to do Daily. But since starting chemo some days I barely have the energy to watch TV let alone do chores so usually I don’t do them on days like that. \n\nWell, yesterday the kid’s dad came over to take them to the movies, Dad’s girlfriend wanted them to finish putting the dishes away and I was 2  days post chemo and laying on the couch barely keeping my eyes open enough to watch TV. The kid’s dad saw him and asked why his kids had to do all the chores and I just got to lay around. He knows I have cancer too. Before my dad or his gf could reply I said I just finished a round of chemo 2 days ago that’s why… would you make your kids do chores after having toxins go in their body… if so then your a big asshole. He got mad and called me a brat. \n\nMy dad and his girlfriend aren’t mad at me but said I should have worded it differently since the kids were around and that’s their dad. I feel like I was in the wrong now… so I’m asking for Reddit's opinion Was I an AH?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "NTA\n\nYou will kick Cancer's A$$\n\nSleep all you need.", "Nta. You are fighting for your life and some part time dad is going to give you sh¡T for it? No chance. Your dad and his missis should have been faster off the mark if they didn't want you to say something like that. Best of luck open in your fight.", "Your only chore right now is to fight the biggest AH (cancer) and get yourself better. NTA and good luck!", "NTA.  He's just butthurt that he got called out and embarrassed in front of his kids.", "NTA. You literally have cancer and went through chemotherapy. You have enough going on besides chores and it helps the kids to see their dad is not perfect\nYou did nothing wrong OP, nothing at all", "NTA and this man should not be allowed to enter your home again.", "All the best with your journey to recovery❤️ you are honestly a better person than me for not cursing him out. I wish you healing, Joy and peace- you’ve got this. Cancer sucks balls by itself, you are not required to also tolerate assholes who see their kids every 2nd weekend.\nNta", "NTA, you just showed the kids how to stand up to a bully, always a useful skill.", "Nta and your dad needs to do better at protecting you from him. Your dad gf should also have ground rules where he isn’t allowed to comment and you.", "NTA\n\nThat guy is such an insensitive jerk. Take the time you need to rest. Chemo and cancer is no joke.", "NTA - because he was out of line asking that question in front of you and the other kids.  had he asked it quietly of the adults in the house, and not where any of the kids could here, he would have been fine to ask.  He may not necessarily know your chemo schedule or how you react to chemo. \n\nBest of luck to you.  My partner has recently finished immunotherapy following chemo, and I know just how draining chemo can be.  Rest and take care of yourself.", "NTA. All things considered, that was pretty polite!! I would have been way more rude if someone had said that shit to me. Congratulations on your mature and measured response, OP. Next time, be worse. You deserve it.", "If I could do chores over chemo I would chemo is wayyyyy worse than a few chores", "For all he knew, OP had already done her chores and his kids were being slow. He should butt out of situations when he doesn't have all the information.", "I'm so tired/fatigued because of chemo Usually I sleep for like 14ish hours the day after a round of chemo which is 3 days of in-patient chemo then for a few days after that I'm just super tired and end up taking lots of naps during the day… I wish I didn't feel so tired it honestly makes me feel unproductive but I know it's what my body needs", "I can't believe I had to scroll down so far to find this. The dad and the girlfriend telling the OP she has to keep sweet, instead of tearing that dude a new asshole and then arranging pick-up/drop-off elsewhere, show that they need to up their parenting games.", "...Somehow I don't think the teenager recovering from chemo had the patience to be tactful with the grown stranger rudely asking why they weren't doing chores. Crazy, I know.", "Do you know what chemo does to ones brain? And a teenager no less. I watched my mom go through it twice. Hush your mouth.", "I think it's more trying to “keep the peace” for the kid's sake", "NTA.  He is an asshole, I'm sure his kids know it.  It's not his business in the first place.  Why do your dad and his gf care more about some asshole's feelings than yours?  You're a child, & he's supposedly an adult.", "[deleted]", "I don't think they care about the adults' feelings. They care for the younger kids' feelings because OP said it in front of the kids, and it's about their dad. But still, NTA.", "You are literally a child fighting cancer. How dare he come into your home and say anything to you!!! The fact your dad and his girlfriend said anything to you about defending yourself against an entire grown ass man, instead of putting him in his place is not something I can even begin to wrap my head around. \n\nNTA. Not even a little bit. The dude who thought he could say anything to you is the ass in this situation. Your dad and his girlfriend get the suck factor for not kicking that guy out instantly for saying anything to you for defending yourself. You just keep fighting and kick some cancer butt. Sending warm thoughts and a big grandma hug your way.", "That is so rude and insensitive! He knows you have cancer, How hard is it to see that you are completely drained and barely able to keep your eyes open? How does he expect you to do the chores?!\n\nNTA!", "NTA, and I don’t think your dad and dads gf want you to feel like you’re in the wrong. I think they were trying to encourage you, as a person still learning about the world and relationships, to consider the feelings of the younger kids, with the (appropriate) intention of not ruining their relationship with their father. They have to learn on their own that he’s a dick lol. I don’t think you, a 15yo dealing with chemo, did anything wrong, and the only thing wrong imo your dad and dads gf did was use the word “should” instead of “could”. This presuming they had a conversation with their dad about how he addressed that situation was highly inappropriate.", "NTA. And feel free to tell you dad/stepmom that next time a step-sibling exchange is occurring you would prefer the trash stay outside on the porch where it belongs.", "mom should keep ex husband out of the house", "NTA. He knows your struggle and decided to go there anyway.  Good that you knocked him down a peg", "no way NTA….", "NTA\n\nThe kids should know their dad is an AH for asking, right off the bat. If they didn't hear it, I wouldn't put it past him to try to convince them to complain about it.", "Chemo is so tough. I am very sorry you have to go through this! Sending you lots of ❤️ ❤️ ❤️", "nope. you’re good. and if he thinks it’s okay to finish that off with calling you a brat his kids have bigger problems than watching him get called out. wishing you a speedy recovery and all the rest you need. nta.", "NTA His kids have every right to know what kind of asshole their father is and if he doesn't want them to know then he shouldn't say something he can get called out for in front of them", "Nah. Fuck that guy. NTA", "Sweetie, I'm so so sorry. We are here for you if you need us at r/MomForAMinute\n\nNTA", "From another person experiencing cancer, her sucks. Say what you need to say. NTA.", "NTA.\n\nYou were far more polite than I'd have been.  You could have told him to fuck right off and you'd still not be an AH.", "NTA!! You called it correctly and he can GTFO if he doesn't like it. I sincerely hope you beat this and soon.", "NTA. Why aren't they upset about him calling you a brat in front of the other kids? Kindness goes both ways. Though he deserved what you said. Sorry you're dealing with cancer, hope the treatment goes well.", "NTA. The sooner the kids realize their dad is a massive prick, the better.", "Nta", "NTA. And your dad and his gf kind of suck too. You’re the 15 year old with cancer having to go through chemo. You don’t have a responsibility to protect anyone’s fragile ego. \n\nEven if you’d said “I’m sure your kids would much rather be doing chores than getting chemo” you’d not be the the AH. You’re a kid with cancer. You get a pass for being angry and lashing out at someone who clearly has no sense of kindness or common decency", "Your parents (dad and step-mom, but it should probably be step-mom) need to take that AH aside and tell him he is absolutely not to parent kids that aren't his in their house and to keep his bitter, snot nosed juvenile commentary to himself or shove it up his own ass. But nicely.", "Yes, you could have worded it VERY differently. You are 15 years old. You aren't an adult, and you could have been a bit nicer. Just because he was an ass doesn't give you the right at 15 to be an ass back, Cancer or not. All you had to say was, \"I just got done with Chemo, I don't feel good.\" Closed your eyes and tuned him out. Let your Dad and his GF take care of anything else he has to say. That was it. \n\nMy daughter does some of the same treatments, and I do NOT allow her to be an ass towards people no matter how crappy the meds make her feel. (She does Immunotherapy through her Oncologist). Trust me, between the steroids, and the medicine she feels like CRAP! But that is NOT a license to treat other people like shit. Even when she is also on her period. \n\nBe a nice human being. Get through this. They are ALL supporting you. Sometimes it might not seem like it, but they are.", "Well, you were kind of rude but I'm not sure that makes you an AH. He deserved it. This guy had absolutely no business offering his input on the division of labor. For all he knew you were resting after cleaning the bathroom.", "It wasn't your place, you should have let her deal with  her ex...", "NTA! You channel that strength ❤️ well done for calling some AH out for being a AH", "NTA. You were literally doing what your body could handle in the moment. He’s a big AH.", "NTA\n\nim surprised that's all you said", "You are a very sick child, who is listening to her body and giving it the rest it needs to repair itself. He's a grown up AH with entitlement issues and no empathy (apparently). Don't you worry yourself **one more second** about this situation. NTA. Sending you love and light for your ongoing battle!", "NTA\n\nYou treated the jerk the way he should have been treated.", "No. NTA. Tell him whatever you want.  Can you imagine being an adult trying to smack talk a child with cancer?", "I wish you peace, joy and a speedy recovery. NTA.   He's an idiot.", "NTA\n\nI hope your treatments are successful and you get better. Cancer therapies are no joke, and you've got to be commended for doing what you can when you're feeling better. \n\nIf you had been feeling stronger, your response might have been more than your step-siblings' dad could have handled.", "NTA. You are an amazing person dealing with.a horrible regime of chemotherapy. You need to rest. You need to put yourself and your health first.... But your step siblings' dad is such a large asshole he is viewable from other universes. In fact he's a supermassive black hole with his own event horizon. Ignore this fuck witted being. He's worth less than the nasty stains found in scummy  toilet bowls.Worthy only of being bleached away.", "NTA. Your dad's GF's ex-husband has absolutely no right to make any comment about you. He has zero say in what goes on in the home your father owns. You put that jerk in his place. My hope is that you are able to go through the rest of your chemo without that kind of stress, but instead only love and support.", "NTA. If he went through chemo, I doubt he would be doing much more than you are. Stay strong I believe in you. 💪", "Not only are you NTA, you are a freaking hero.  Stay strong. Much love from an internet stranger ❤️", "First I’m sorry you’re going through this. And screw that guy. Chemo is the worst and to speak to a child having to deal with it like that is unconscionable. If I were your mother I would have verbally ripped him apart for that. I’m a cancer momma and I don’t play with self-absorbed idiots.", "NTA. That AH needs to be told that he is one, and his kids should understand that he is as well so they think twice about possibly emulating him.", "If their dad isn’t respected by others it’s good for them to learn early to distance themselves from him", "So yea NTA and I have to say for what sounds like you being exhausted you certainly gave him the energy he was putting out in your roast to him", "NTA.  If he doesn’t want to be called an asshole than he shouldn’t act like an asshole. Only a scummy asshole calls a child with cancer a brat.  Your dad needs to check him.  Either he acts like adult or has to wait outside to get his kids.", "NTA but your dad and the GF def are. As a parent I would have tossed him out so fast for that garbage and informed him he could now text from the curb when he comes to get the kids but he was no longer allowed in the house.", "NTA! Good for you standing up for yourself like that!\n\nNow go kick cancer’s ass!", "NTA. So what if you could have said it the nice way, you feel crappy so understandably you answered in the words that came to mind to express your thoughts. Hang in there because everyone is rooting for you.🫶🤟", "NTA. Not at all.\nI've been through chemo, the aftermath is brutal. So what if his kids were present, they should see an asshole be put in his place for being an asshole.", "NTA. He's not your family, he's just some dude who picked up kids to whom you are unrelated. After you're 18 you don't ever have to see him again. Why put up with his shit now? Say whatever you want.", "NTA! He should’ve minded his business. You ask smartass questions be prepared to get a smart ass response", "NTA. I’m sorry you’re going through chemo, that is incredibly tough and brave. I hope the next person in dads gfs ex husbands life who has cancer isn’t given a similar stupid comment like the one he gave you. Also, your delivery was amazing", "NTA, but I'm side-eyeing your dad and girlfriend for not throwing that asshole the fuck out of their house.", "He asked. You answered.\nNta", "NTA\n\n\nBut your father had better have words with that &&##%^^$$, before he even drives by the house much less sets foot in it.  This is not a step mom talk to your ex situation this is a your dad have a discussion situation.", "Not in the wrong. Some people think adults have every right to say awful things and kids should just take it because he is an adult. Nope. He was I sulti g you and you defended yourself.", "Chemo does a number on people no matter what the age is. Your reason for not doing chores is 200% valid.\nDad is TA. \n\nJust in case he pulls another dick move like this- do you have someone that can advocate for you?", "NTA, have your dad and his partner talk to a lawyer.  In most states you do not have to let him in the house when he picks up his kids for visitation.  For him to verbally assault you is uncalled for.", "NTA. Why is he entering someone else's home and commenting on what they do in their home with their child? Unless it has tondo with the safety and wellbeing of his kids, he's out of line. Tell him to wait in his car next time.\n\nI hope you're feeling better soon.", "Honey, NTA and you do you.\n\nKick cancer's ass!!! Wooo!!!", "NTA. Stepsiblings dad is a gaping AH, expecting ANYONE post chemo to do anything. He is either woefully ignorant or just an AH.don’t worry about it. Good for you for standing up for yourself!", "NTA!!!! I bet he wouldn't have said anything if it was his kids laying around", "Nta, you advocated for yourself and do not owe him respect.", "NTA I've been on chemo and it is *horrific*.", "I've had cancer. For me the worst days were the second days after treatment. I was pretty much dead to the world those days.  \n\n\nFor cancer patients there are good days and there are sick days. People need to understand that on a sick day, you need to let them be sick because that's all they can do.   \n\n\nNTA.", "You have bigger things to spend your energy on. Don’t sweat over it. NTA", "NTA, good for you for defending yourself. You shouldn’t have worded it differently.", "NTA, 100%. I would have added a few choice words, so you did a great job!! I wish you all the best in your treatment.", "NTA fuck him I would have gone nuclear if someone said that to my kid whose going through chemo", "NTA. But you should have worded it differently. To be meaner.", "Nta your dad should have whooped him too imo. Concentrate on your health and leave petty ah to there sad lives. Get better xxx", "Damn kid, I’m really sorry. NTA. I can see why dads gf isn’t with the father of her kids. He is a big asshole.", "NTA. If *my* kid had cancer, they wouldn't be forced to do ANY chores.", "Nta who mocks a kid with cancer?", "NTA- you need to show your dad this thread. He needs to stick up for you not let some asshole come into his family home and pick on his sick kid. Ask your dad why the care so much about keeping the peace when the jerk who made the comment obviously doesn’t care about keeping the peace in a home he doesn’t even belong in. Sorry you are having to go through sickness, keep your spirits up and stay positive and I’m proud of you for sticking up for yourself!!", "NTA. Next time throw shit at him.", "NTA", "NTA. I think he should not be allowed in the house anymore. You don't need outside toxins as well as toxins inside your body. One set is bad enough.", "Yeah, NTA. He ought to be ashamed rather than doubling down on the rudeness to you. Even if you weren't sick he has no business accusing you of being lazy right at that moment - you could've simply been done with your chores for the day, or you and a stepsibling might have agreed to swap or something.", "NTA. Good luck with your treatments.", "You worded it cynically and sardonically... oh wait. You have no control of cynicism cause of cancer. You can just hide behind cancer to appeal  to our compassion and we are automatically your allies, so you don't have to take accountability for the real context you're scratching out. You are just innocent of all faults of lacking civility. cause of cancer. \n\nSee that? See how I worded it? You did it like that. But you do have chemo, so we can't hold you to certain standards and we can only say NTA by default. Get it?", "NTA. Your dad and his girlfriend should have handled this for you. Your step siblings are old enough to voice this, too.", "I would cuss all 3 of them out.They kids are old enough to understand", "NTA he simply effed around and found out. Get well soon Op", "NTA, and he can mind his business.  \n\n\nI'm wishing you the best! <3", "Exactly and I would argue OP's cancer/chemo is irrelevant. The dad is NOT a member of the household and has no say over what happens there and definitely NO say over OP. So why was he saying anything? \n\nAnd, as others have pointed out, OP could've been watching TV because they already completed their assigned chores. The dad can't simply walk into the house and assume he knows everything that is going on.", "Let us not always put the onus on the insulted to be the bigger person. Screw that AH", "They are not right. OP said it perfectly", "It's funny you say that because I heard the kids say “ but (my name) isn't a brat”", "How the hell is the shitty dad “supporting” OP by calling him lazy FOR HAVING CANCER?! And you seem like a shit parent if you let anyone talk to your kid like the dad did and not let her defend herself, cancer or not. Way to prepare your kid for a life of being a door mat.", "So you're excusing someone who is not a parent to OP talking down to them about the aftereffects of their chemo. While proclaiming you have a child in similar circumstances and yet you still try to admonish OP for defending themself from someone who knew better as a parent and an adult.\n\nMan the lack of self awareness must make your life so much interesting. /s", "Also not his kid to try to boss around.", "Why phrase things politely to an asshole who’s being an asshole?", "It's always your place to defend yourself when someone is unjustly criticizing you within earshot.", "They were in another room and couldn't say something fast enough my dad ended up telling him off when he came back with the kids", "Hey, my friend. I’m sorry you’re going through this right now. CANCER. IS. A. LOT.\n\nNot only are you NTA, even if you were TA you would totally get a pass from me because cancer.\n\nIf the kids’ dad doesn’t want to look like an AH in front of his kids maybe he shouldn’t… I dunno… act like an AH?\n\nYes, maybe it would’ve been kinder not to point out his AHness but that’s not really a you problem. You have enough on your plate.\n\nPlease take care of yourself. And (if you feel up to it) please come back and update us on how things are going?\n\nI lost my partner to cancer and my mom is treatment now. It can take over your whole world, I know.\n\nI will keep you in my prayers.", "Sorry but your dad is an asshole. Imagine not siding your child that has cancer and caring more about the stepdad feelings towards how you word your sentence.\n\nWhat a disappointment for a dad.", "i know you probably have gotten many comments like this (on the post or irl) but i do hope you get well soon!", "Exactly. If he doesn’t know what goes on in their house, he shouldn’t comment on it.", ">I would argue OP's cancer/chemo is irrelevant. The dad is NOT a member of the household and has no say over what happens there and definitely NO say over OP. So why was he saying anything?\n\nWell, the dad's kids live in the household.  It is his job to advocate for them.  We get enough stories here about divorced or widowed parents starting a new relationship, and marginalizing their kids while favoring the step-kids.  \n\nWithout the illness, it would be massively unfair if the 15 year old was allowed to skip chores while the other two were expected to do their chores.\n\nHowever, if the dad was concerned his kids were being treated unfairly with chores, that should be addressed with the kids' mother, perhaps with OP's dad in the discussion as well.  He shouldn't have brought it up with OP.\n\nHave the younger two kids been complaining to their dad about being treated unfairly?  Has the situation with the cancer and chemo been explained to them clearly, in ways that are age-appropriate  so they understand?  The kids are young enough that they probably have no previous experience of living closely with someone who has severe illness and treatments that leave them weak and unable to do their share.  Teaching them how to handle this politely is going to have to be an ongoing task, not a matter of just one or two conversations. \n\nAlso, how do the girlfriend's kids, in general, feel about moving in with mom's boyfriend and his child?  \n\nNone of those things are OP's problem or responsibility.  But if OP's dad and his girlfriend are reading this, some gentle exploration of how the younger two kids are feeling about the situation, and working to create a peaceful home that respects the feelings and needs of all three children seem to be something that needs to be attended to.", "All of us in this sub are 100000% on your side. So sorry you are going through this. And you are being productive by resting. Fighting cancer is hard work and your body needs all the rest it can get.", "Hey, listen to me, please listen.\n\nYour body needs the rest.  You are poisoning your body to save yourself, hoping the poison will kill the cancer faster than it harms you.    Talk to your doctor, I bet they will tell you to rest, that they would be willing to talk to your parents about what is normal to be able to do or not do after chemo.\n\nThere is no shame in the rest, you are being very productive.  You are surviving cancer, surviving a brutal treatment that hopefully will give you a long, healthy life in the end.  \n\nI sympathize with hating the tiredness.  \n\nBut I am oldster these days, I am coming up on 50.  \n\nAnd I deeply regret all the times I didn't rest and coddle my body.  I walked on sprains because I wanted to be productive and now my knees and ankles are constant source of pain.  I had mono and didn't take the rest the doctors wanted me to and it took far, far longer to heal and I have issues today from being \"productive\" despite what my body needed.\n\nListen to your body, listen to your doctors and give yourself the space to recover and to eventually heal.  \n\nYou are worth more than that which your produce.", "I thought it was the kids that said something.  It was a whole grown adult? \n\nOh heck no. Not pull verbal punches for that a-h. If he hasn’t grown a brain by now, he needs to be shamed by a teenager. \n\nFuck cancer! Keep fighting and don’t give this another thought. NTA", "I'm so sorry for what you are going through. Screw cancer. You got this! I will send many good vibes your way. I wish you well. NTA\n\nEdit:add a sentence", "Rest is not unproductive. It's an essential maintenance and repair activity, so it's okay to try to get good at it. I'm talking duvet, soft music if you like but mostly just close your eyes and think about nice things.", "[deleted]", "Your job, your productivity is to do what you can to heal your body.", "But the kids need to see we stand up against wrong, even in our own family. One of the worst things we can do to kids is make them believe that \"older equates automatically being deserving of respect\" and to not call out crap behaviour in adults. \n\nIf he didn't want to get a very obvious answer to his stupid comment, he should have kept his trap shut. He literally belittled a cancer fighter in front of his kids, he is trying to breed bullies. You taught kids what should happen when you see bullying, even sick with chemo, you're being a great sibling at guiding them. ❤️ You are a great role model", "Nope. YOU are who matters her OP. \"Keeping the Peace\" is a bullshit excuse to let others abuse you. Hell no. Your Dad failed here big time.", "Fight in your spirit keeps the immune system going (or at least, it can't hurt to stand up for yourself). Hope you stomp cancer hard and take no shit from anyone. Don't even worry about people chiding your wording, girls are always being told to be soft and gentle to everyone at all times and this is frankly not the kind of world where that's even in their best interest. Maybe the kids learned something useful thanks to you", "haha maybe the kids will give their dad more shit for it", "I’m sorry. You are definitely NTA.", "It's more about keeping the peace my dad was about to tell him off but he called me a brat and told his kid he's waiting outside I just reacted be for my dad could say anything", "OP said that Dad was going to tell off the other kids' dad. Dad was being caring, OP just spoke up before her dad did", "> Well, the dad's kids live in the household. It is his job to advocate for them. \n\nQuite seriously, if you think your kids are being taken advantage of in your ex's household, the thing to do is to see about getting more custody. If you live close enough to visit but you're not willing to advocate for your child by having them stay with you 50/50, then whatever.", "Thank you Ive always been a person who can't sit still  I know I need to rest I just hate feeling unproductive and like I've done nothing the whole day I once told my nurse that and she basically told me the same thing you just wrote", "Leukemia (ALL) and that's great", "I think they did because he got mad and texted my dads girlfriend that his kids shouldn't side with a person who isn't even related to them more than him... Plus my dad told him off when he came back to drop the kids off", "The username checks out.", "Blessings to you love. I pray for your strength while you fight this battle. NTA", "I think you did great, you stuck up for yourself. That man may have an adult body, but clearly not mentality, and calling someone an asshole is, in my opinion, pretty darn mild in this context. I understand if you want to be considerate around the kids, that’s kind and respectful of you, but they will survive this just fine and you shouldn’t be expected to be anything but human. NTA", "Good for you, you stuck up for yourself! NTA. That guy was way out of line. \nI'm wishing you all the best as you kick cancer's ass! ❤️", "Your dad needed to do his damn job and care for his kid, how dare he imply you were wrong!", "Oh hell no.  It's not your job to keep the piece.  This guy has no business coming into YOUR home and try to assert any sort of dominance there.  It undermines both your Dad and the mother of his kids.  This guy would never be permitted to enter my home, again.", "I was always on the move if a book wasn't in my hands.  I understand.  But you got dealt a bad hand, and your body needs you to respect it and get your rest.  \n\nRight now, living is being productive.  Seriously, chemo is awful, just better than alternative.", "I can definitely say that the sooner you learn to put your health and rest first, the better off you'll be. Probably live a hell of a lot longer and happier than us older generations who bought the \"work through any illness or you're lazy\" propaganda. You've got a whole lot of people here rooting for you, keep kicking cancer's ass and get the rest you deserve. NTA, either, it was really inappropriate for the guy to address his concerns in front of you and even worse that he didn't back off.", "Damn I’m sorry I misread your post in my post work haze! \n\nAnyways what I said about my cousin being five years cancer free etc. I still mean. And my ruling stands NTA!!!", "It is very awful I didn't think it would be as hard as it is honestly but it's rough especially the first few days after my round of chemo finishes"]}