{"id": 26804, "submission_id": "16hylll", "title": "WIBTA if I don't wait until my great grandmother dies to start transitioning?", "selftext": "I'm a 21 year old transmasc, and I finally started arranging gender affirming care with my doctor which I am very excited about! I've wanted this since I was a kid, it feels surreal that it might actually be happening soon.\n\nMy mother tries to be supportive of me, but she really wants to hide that I'm trans from my older family. She asked me to wait until my great grandma dies to start HRT, and I told her absolutely not. I understand that it might make her uncomfortable, but it's not about her. I'm an adult and this is my decision. I waited 9 years to do this, I waited until I was positive— I'm not going to put it off any longer.\n\nNow she's angry with me. I tried to explain that if grandma has a problem with it, I don't mind. She's old, they have their prejudices, I'm prepared for it. But I'm not just going to hide who I am until she dies. I love my grandma, and I want her to know who I am even if she won't like it.\n\nThe way I see it, it's my transition— it's personal, for my comfort, not for the comfort of others. I don't think my mom sees it that way. I get her point, but... I dunno. I'm not budging on this. Does that make me the asshole?\n\nEDIT: Please don't sent me that \"reddit cares\" thing, I'm trans, not suicidal.", "created_utc": 1694638638, "permalink": "/r/AmItheAsshole/comments/16hylll/wibta_if_i_dont_wait_until_my_great_grandmother/", "score": 119, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my mom that I'm not waiting until my grandma dies to start taking testosterone. I might be the asshole because it will probably make my grandmother uncomfortable to see me transition, being her age.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Transman here, so take this advice as you wish. \n\n1.  She is unlikely to even notice. Transitioning takes years to fully occur, similar to puberty. \n2. This is about your emotional and physical health. \n3. You were not put on this earth for the sole comfort of your elders, you are not beholden to their whims. \n4. Your mom is only supporting you when it doesn’t make waves. This isn’t full support. Be prepared for her reaction, but also know that she may come around. \n5. Live your best life.", "NTA\n\nIt's selfish of your mother to ask you to put your wellbeing (and basically your life) on pause not to hurt someone else's feeling. Grandma maybe won't understand, maybe yes, but I won't postpone a surgery just because someone in my family doesn't believe in medicine.", "NTA.  I'm a grandma - please don't use age as an excuse for prejudices.  I'm guessing your great grandma is as least as old as me (65), and likely another generation older - and that generation lived through the civil rights movement, stonewall, Title IX, etc.  Your grandma knows all about the importance of acceptance, and if she is still apt to react badly to you being your true self, that's her actual character, not her age.  Age is no excuse for bigotry - we are all capable of learning and growing.", "NTA you don't have to live your life to make other people comfortable. do what's going to make you happy, and who knows, maybe grandma will suprise you. plus waiting for her die in order to do something that will make you happy is so morbid", "NTA. I thought my grandparents on my dads side would be weird about me being queer but they're just happy I have a loving partner. Plus if you do wait til she dies then it'll be \"Well not yet it's too soon after her death\". So don't put your life on hold waiting for someone to die", "NTA. You know your grandma might not react positively, and you're prepared for that. If you know it's what you want to do, then do it. You're an adult, and you should live your life as your most authentic self, even if that self is upsetting to older generations. Besides, your grandma might still surprise you, and you'd be taking that chance away from her.", "YWNBTA. You can't put off your life for every bigot just because they are related to you. There would be people who would be forced to put it off forever if that was the case. As long as you are sure, it's time to live your life. Congratulations on being ready to start your transition, and congrats on your new body and new life. I am happy and so proud of you.", "NTA but make sure you are fully prepared for the worse case situation.\n\nYou shouldn't feel any guilt and should be able to be honest about who you are but that doesn't mean you *won't* feel guilty.\n\nMaybe simply transition and be yourself but don't explicitly tell her or deny it. Just be you.", "NTA and honestly it doesn't sound like your mom is that supportive. My guess is that she is hoping for you to delay it, and that maybe you will change your mind. When you're great grandmother dies, then she'll want you to wait for your grandparents, and then it will be some distant great uncle or whatever. Have a conversation with great grandma and talk to her about your life and where you are. Let her know what is going on. It can go either way, but I think you have a right to know where she stands. The news isn't going to kill her. Further, you don't know when she's going to die, so how long exactly would this moratorium on HRT be. It could be a month, a year, ten years, or maybe even longer. That's not a fair request on your mom's part.", "NTA", "NTA. Didnt even have to go past the title. \n\nTrans guy here. Been out for almost a decade. And I can tell you right now that once your  great grandmother dies the goals posts will just move to something else. Like oh can you wait till youre 26? Oh can you have kids first? Can you graduate uni first? It will never end because its not actually about your great grandmother, your mother just doesn't want anyone to know, period. The elderly have seen and experienced many things, and trans people arent new. \n\nDo this only on your own time, nobody elses. No matter how you do this, someone is going to have a problem. Make sure that someone isnt you, because its your body.", "NTA\n\nDo what is best for YOU.", "It seems awful that your happiness depends on someone you love having to die. That seems really f****d up. So when great gran shuffles off this mortal coil, your mum is going to glare at you and say, \"Well, I suppose you're happy now \"\n\nYWNBTA", "NTA\n\nYou have to live authentically. At the end of the day we only have that.\n\nIs it really your grandma with the problem? I mean, I know some grandmas are actually more progressive than moms.\n\nBest of everything on your Grand Adventure.", "NTA. My wishes for you are to live a very happy life and be surrounded by much love.", "Excuse my language, but.. fuck them. \n\nThey've lived their lives. Now go live yours.", "NtA. It's true that sometimes older people have a tough time with change. But sometimes they also don't. \n\nIt's a deeply personal thing you are doing and nobody has a say in it but you and your educated doctor (in terms of how to transition healthily and safely). \n\nWhen I said I didn't want kids, and my brother in law came out as bi/dating a man, my mother in law said to just not say anything to family. \n\nSo my brother in law just stopped going to family things.  He said he knew he wasn't welcome, so why be there?", "NTA !!!!!  \nIt's your life, and it's YOUR identity, and you should embrace it.   \nI want to congratulate you and wish you all the love in the world.", "NTA.  Your well being is more important than your mother having what she considers to be a difficult conversation with your great grandmother.", "NTA. Your mom is using your great grandma as an excuse. I guarantee that when great grandma dies, your mom is going to ask you to wait until your grandma or grandpa dies.", "Nta. You're right. It is about you and your happiness and wanting to wait till your grandma dies is very selfish of your mom. You're prepared for the possible reaction and want to share who you are. You should be able to do that. And and congrats on finally being able to take these steps in this process!", "NTA Your great grandmother is the excuse. Your mother understands your last point, but she's prioritizing her comfort (it's really not about great grandmother), which is unfair to you. You deserve to transition now and to start living as you feel comfortable and want to. Great-Grandma will probably be more fine with it than you suspect.", "NTA\nYou do you honey. Congrats on moving to the next step!\nYou can not please everyone, especially in a family.\n\nLive your life as you want to be happy.", "NTA You should never hide who you truly are to make others feel better!\nI hope all will go well with your transition! ❤🧡💛💚💙💜🤎🖤🤍💙🩷", "You shouldn’t have to wait to live your life honestly for anyone else. YWNBTA", "NTA, it's your transition, it's for your comfort. If you needed knee surgery she wouldn't ask you to wait until your great grandma dies to get it.", "You don’t get to live until grandma dies? What kind of nonsense is that? NTA.", "NTA. Your mother will likely just move the goalposts anyways even if you did wait", "NTA. even if you did wait, which you have absolutely no obligation to do, your mother would probably not care. she would be just as unsupportive afterward and find another excuse. unsupportive parents will always find a way to justify themselves", "NTA. Nana can pound sand in her last days if she has an issue with it.", "Fellow transmasc/non binary. My parents know but my own grandma does not. She’d worry. She’d worry about my mental health in general. It depends on how you think they’ll react ig", "You owe exactly NOTHING to ANYONE. You do you! Let them feel however they need to feel about it. Make sure YOU are ok. That’s all that matters here.\n\nYou are NOT the asshole. You are a brave and well meaning individual. I appreciate that you’re worried about other’s feelings. But at some point, you need to take care of you and not worry about their archaic expectations. \n\nDon’t EVER let ANYONE make you feel less than for being yourself. \n\nYou are mighty \nYour are gracious \nYou are lauded \n-Aesop Rock.", "No you don't owe anyone putting your life on hold", "I don’t know her age but my FIL has lived over 10 years past his prognosis", "Yeah fuck that noise, that \"can you just wait to be yourself until _____ ?\" shit never stops, there'll always be a reason. Don't put your life on hold just to make someone else a little more comfortable.\n\nNTA", "our transitions are literally never about other people and they need to realize that. or fuck around and find out i guess? dear transphobes: the world doesn't revolve around you. uncomfortable or bothered because someone you know is trans(itioning)? kindly get over it", "NTA.\n\nYour mom isn’t supportive if she asked you to do that.", "NTA... and it seems like a grim kind of ask TBH. You don't want to be just waiting around for your grandmother to die to live your life, and there's no reason to. It sounds like you are not afraid of how she'll react. Your mom needs to be brave with you.", "NTA. It's up to you to decide what is best for you, and you shouldn't let others stop you from living your truest life. \n\nI transitioned while my great grandmother was alive. She never really got it because she was in the late stages of dementia. At one point, it was both affirming and sad to go out to lunch with her and my grandma, have a great time, and the next day have her tell my grandma \"That was a great lunch, but who was that nice young man?\" \n\nI'm glad I didn't wait until she passed, though, because I wouldn't have known how long she had left, and could have missed out on years more. (She lived to be 100, but who knows if she could have lived to 110 out of sheer spite) \n\nEven if your great grandmother doesn't understand or approve, honestly sometimes family isn't all it's meant to be, and if she's going to treat you poorly or be rude because you're being yourself, that's her own problem, not yours.", "Your transition has nothing to do with anyone else but you. It’s about being who you are, not who other people think or want you to be. For anyone to suggest that you wait for someone to die is not really showing they understand the situation. You really aren’t “changing” anything, you are still you, you just are making your outside match your inside. Go for it.", "NTA. \n\nWhen I came out as a lesbian, my mom was *really* worried about how my grandparents would react, and asked if she could be the one to tell them, which I was fine with. My grandpa was totally unphased and reacted to meeting my first girlfriend like it was totally normal, which of course it *is,* but you know what I mean. My grandma was so excited for me, and *so* kind and welcoming to my then-girlfriend. They were in their 80s at the time-- age isn't an excuse, and older people aren't all bigots, nor do they need to be coddled and have things hidden from them. \n\nYou know your grandma might not react well, and you're prepared for that. You shouldn't have to wait or hide just in case she might get upset or feel uncomfortable--to do that would make *you* upset, and much more than uncomfortable. And like you say, you want her to know who you are, even if she doesn't react well. My other set of grandparents died before I even knew I was queer, and I wonder a lot of about how they would have felt about it, so I get that, and if that's how you feel, I think it's much better to know than to wonder-- in addition, of course, to all the other reasons why you absolutely should not feel obliged to wait any longer to start HRT and transition in the way *you* want to.", "You are living your life making decisions to make yourself happy. life is short. Don't obey people who can't understand the freedom people have now to be who they want. She made her decisions about her life. This is yours. Don't let anybody make you feel guilty", "NTA. Your life and your experience should not be dictated by somebody else’s personal preferences or comfort. Nothing about your transition actually impacts other people and should not be considered a thing to postpone for others who ARE impacting you based on their preferences.", "NTA. You have to live your life in a way that’s right for you.", "YWNBTA You have body autonomy , so do what is right for you, when it's right for you.", "NTA, and what an awful person your mother is to want you to await a beloved person's death.", "Absolutely and emphatically NTA. You have the right to transition however is best for you, when and how you choose. Being told that you have to deny yourself to protect someone else from knowing you as you really are is an unfair imposition your on you. You’ll have to decide whether and how you choose to come out to relatives who might have a hard time understanding why you’re doing what you’re doing but you don’t have any obligation to deny yourself to save them from something they might find challenging.", "NTA. Is your mom suggesting you kill grandma or...?", "NTA. Do whatever you think is best. This is your grandmother and you can obviously on your own decide if you think you would be one for transitioning or not if they're still alive. It could also be your mother's own prejudice coming through if she's worried about what your grandmother would think. I know she's been supportive but it's the vibe I get.", "NTA, so what's your moms next excuse gonna be for you not to medically transition? Your dog won't recognize you? Don't wait and find out!", "NTA.  There will always be another excuse to delay that people will come up with.   This is about you being true to who you are.", "Your grandmother got to liver HER life and now it is YOUR turn.  Do not delay.", "NTA how about all your older relatives and grandma put their trans hate on hold instead of you putting your life on hold in case you cause them a little discomfort ?? I’d start your social and medical trans immediately and tell everyone to use your new name and pronouns. Your mother isn’t supportive if you wants you to hide who you are and you need to tell her that . She needs to be in no doubt !", "NTA. No, your life should not be put on hold until your great grandmother dies. No one knows how she'd react anyway.  I wonder if your mom is projecting her feelings onto her grandmother and wants you to wait - hoping you'll change your mind.", "NTA. Your well-being is more important than someone else's comfort about something that doesn't directly affect them.  \n\n\nI would also note, from personal experience, that she may not even notice if you don't tell her. Changes from testosterone are gradual, and depending on how \"with it\" your great-grandmother is, she might not notice especially if you shave right before you see her. People tend to see what they expect to see.", "NTA, it’s not your mom’s decision or right to restrict you from being happy like that, and I’m sorry she’s trying to accept you in the way that makes *her* and everyone else most comfortable at the expense of *your* comfort.", "NTA, life is too short to put off your happiness for anything\n\nbesides it is not exactly loving toward Grandma to assume the worst of her. Maybe she'll be accepting.", "NTA. I doubt everyone else in the family adjusted their life decisions to suit one woman,  and you shouldn't either. Besides, whose to say your mom doesn't find another relative to make the scapegoat so she can ask you to wait just a couple more years after your great grandmother passes?", "NTA. \n\nTransition isn't about other people. It's about yourself. Don't care about what the older members of your family think (or any of them for that matter)", "Nta.", "Nta. You do what is best for yourself but do consider(as I've seen other similar posts here) If you transition and she's one of those people who's really against that sort of thing and changes her will and you get nothing.  You can't complain.  That's her choice just as it's your choice to do what you need (not being mean just again I've seen many a post on here where thats happened/maybe that's what your mom is thinking about idk)", "NTA. Your mother is trying to avoid anything unpleasant with your great grandmother but that's her issue not yours. Transition away.", "Nta. I asked my kid not to mention being gay to my dads Uber catholic family while my grandparents were still alive, but they were in middle school so it wasn’t a big deal. This is asking you to put your whole life on hold for an indeterminate length of time.", "NTA. You deserve to live your life.", "NTA. Your mother has no right to make such demands on you. You're an adult now, you get to make your own choices. And frankly, she has absolutely no right to speak for your older relatives. You cannot be expected to always put everyone else ahead of you; it's your turn to put yourself first.", "NTA\n\nFellow transmasc here.\nI came out nearly 10yrs ago and was talked out of medically/physically/legally transitioning back then by my dad and other members of my family as to not upset my catholic paternal grandparents (who helped raised me since birth), and other older family members.\nMy grandfather died without knowing who I really am, so will my grandmother.\nNot to mention that I'm now in a place in life where I'm going to have to wait many more years until I'm able to immigrate to my girlfriends country to start transitioning, and figure out how to do that in a foreign country. At this point I'll be nearly 40 before I can even get started.\n\nYour life is yours, your body is yours. You have to live for yourself, and do whatever is going to make *you* the happiest, most fulfilled version of yourself.", "NTA, send grandma off with a big reveal.", "Is it possible your mom is projecting her discomfort? As in, maybe grandma won't even care?\n\nEdit: I say that because that happened to me. I came out as trans to some older family who said \"*We* support you much so-and-so you shouldn't tell them.\" Well I came out to so-and-so and they were wildly supportive.", "Ok please don’t blow up on me but if I was trans and my grandmother was about to die and would be uncomfortable I would not hesitate in the slightest to wait a year or two for her because she Is one of the people that I love most in the world and wouldn’t want her to be uncomfortable around me for the last few years of her life(not trying to start an argument, this is my opinion).", "[removed]", "You are a woman. You can never be a man even if you mulilate yourself. ESH except your great grandmother. She actually seems to care about you and she realizes you can never be the opposite sex. Your mom is an asshole for thinking it would be okay even after your great grandmother dies. Your doctor is an asshole for agreeing to mulilate a sexually confused woman. If you do receive this genitalia mulitlation, you won't get any of the good parts of being a man. You won't even be a man. You will just be a mulilated woman.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm a 21 year old transmasc, and I finally started arranging gender affirming care with my doctor which I am very excited about! I've wanted this since I was a kid, it feels surreal that it might actually be happening soon.\n\nMy mother tries to be supportive of me, but she really wants to hide that I'm trans from my older family. She asked me to wait until my great grandma dies to start HRT, and I told her absolutely not. I understand that it might make her uncomfortable, but it's not about her. I'm an adult and this is my decision. I waited 9 years to do this, I waited until I was positive— I'm not going to put it off any longer.\n\nNow she's angry with me. I tried to explain that if grandma has a problem with it, I don't mind. She's old, they have their prejudices, I'm prepared for it. But I'm not just going to hide who I am until she dies. I love my grandma, and I want her to know who I am even if she won't like it.\n\nThe way I see it, it's my transition— it's personal, for my comfort, not for the comfort of others. I don't think my mom sees it that way. I get her point, but... I dunno. I'm not budging on this. Does that make me the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. I waited until my grandmother died to come out of the closet and those years were a waste of time I could have spent being happier. It catches up with you.", "You are now aware of just how unsupportive your mother is. You should use this information to protect yourself from such revolting people.", "Nta, but silly question are any inheritage pendding?", "NTA. We assume older people have prejudices but honestly once you get past a certain age, you stop giving a fuck. Your great grandma has lived a long life and probably seen and heard a lot of interesting ish. She probably just wants you to be happy.", "I'm sorry you're having to deal with this. I have a short fuze with bigotry, so my reaction would be to tell Mom to tell Great Grandma to die sooner. \n\nLive your life on YOUR schedule. Anyone who can't/won't be supportive can die mad about it.", "Your identity isn't based on character.", "I thought this was going to be like, she has dementia and a radical change in appearance and a new name would confuse her or something. Even then you'd be NTA, but I could at least see where your mom would have had good intentions. But because your mom thinks she'd have a problem with it? No, absolutely no.", "Your mental health is important too. Unless your grandmother is about to die, like, next week - no. Don't delay. (If she *is* legitimately about to die then I only suggest you wait so you can maximize your time with her rather than spending it at appointments.)\n\nNTA.", "But won't he start dressing masculine and maybe there's a name change?", "Very good point, thank you.", "Love this response! Also a grandmother, and I would have no problem with this! Good luck OP!", "You sound like an awesome grandma", "oh ive been out w a name and pronouns fir ages! since i was 12 or so! its just a matter of starting hrt :]", "i haven't changed my mind for 9 years i have to wonder how she could think im changing my mind anytime soon", "That is a good point, but I don't really think I'm gonna get inheritance. She's got lots of grandkids.", "? for what, being trans? lol", "nobody wants to hear your transphobic opinion", "Seek mental health?? How do you seek mental health? Can you let me know cause I'm in need of some mental health. Or are you just an idiot that meant to say seek mental help? Lmao", "Ahh, so you are a bigot. Got it. 🙄", "LMAO you drive a F150, seek penis enlargement surgery", "cope harder", "Most trans men start presenting masculinely and going by a different name long before starting hrt", "I dress masculine and my own grandma doesn’t notice", "Dressing masculine is given a lot of leeway. Dressing feminine is not. He is going in the direction that makes much of his transition invisible. \n\nLook at the bathroom laws. They are all afraid of having men in the women’s bathroom. Totally not realizing that such laws would make me, very visibly a man, have to use the women’s bathroom.", "If if he's going to be dressing masculinely and using a new name socially, he definitely started a long time ago. Whether great grandma knows that is another question. Changing clothes and name is relatively easy and impermanent and usually happens long before any changes to the body.", "My grandnephew is transmasc. He came out 8 years ago. No one in the family, including his late 60's grandparents, had a problem with it. In fact, his grandmother wasn't totally surprised because he had been wearing his hair very short for awhile. \n\nDon't put your life on hold to keep from *maybe* stressing someone out. \n\nFirst, it isn't likely to be enough to affect their health or put them in their grave even a day earlier. \n\nSecond, who cares how a transphobe (which you don't know she is) reacts? \n\nThird, by asking you to delay, your mother is also being transphobic, and you need to call her out on it!\n\nNTA and best of luck with your transition!", "Well good for you ! So go for the next step!! You need to do this ! Your mother should put you before the crustys !!", "Don't you know you're just going through a \"phase\"? \n/s", "Ignore the transphobe there’s sadly at least one in every post about a trans person/trans rights. \n\nYour NTA and congrats on getting on hrt.", "And you take it up the bum. Your parents must be proud. Stay in the uk you sicko", "For better or worse, the transphobes DGAF at all about trans men"]}