{"id": 26876, "submission_id": "16istni", "title": "AITA if I didn’t respond to a man trying to talk to me?", "selftext": "I (21F) and my sister (25F) bumped into each other in town and went for a beer before heading to our homes. \n\nWe were sat outside chilling casually and no one else was outside, then a very clearly drunk man comes over and sets his drink on our table asking “do you mind if I join you?” despite already setting his drink down before he sat. \n\nI go completely silent as I have social anxiety and get especially anxious around drunk men. My sister is the opposite of me and could chat to anyone really. The man starts rambling on about computer wires and how he wanted cheaper ones than were available and I just put my head down and scroll on my phone as I really didn’t want to give him the impression I wanted to talk to him. \n\nHowever my sister responds to him and he comes closer and starts asking where we are from, our names, where abouts do we live, and she’s replying truthful answers. At this point I text her asking can we please leave and she reads it and carries on talking to him for ten more minutes. He rambled on incessantly and genuinely was making zero sense but I was frightened and really didn’t want to be near this man at all. \n\nI finally convince her to leave over text and we do ten minutes later. I help her carry her shopping home and she tells me I was extremely rude as I didn’t even say hello to him and just stared at my phone the entire interaction. I’m shocked and tell her I don’t have to entertain a man if I don’t want to and he wasn’t invited to our table, then she says because I’m a lesbian I would’ve reacted differently if a woman had sat with us which is not true. I’m not against meeting people in pubs but if I feel uncomfortable I will just shut down and ignore the person. She thinks I should have just went along with what he was saying as he was harmless but how are we to know that? \n\nI understand it is rude to not acknowledge people when they speak to you but I felt so uncomfortable and anxious I just really didn’t want to. AITA?", "created_utc": 1694722978, "permalink": "/r/AmItheAsshole/comments/16istni/aita_if_i_didnt_respond_to_a_man_trying_to_talk/", "score": 117, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) It was rude of me to not even say hello to the man or respond when he tried speaking to me instead of my sister. \n\n2) I completely ignored him and acted as though he was not there in hopes he would leave us alone.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nDrunk oblivious strangers inserting themselves into your life are obnoxious people whether they are men or women.", "NTA\n\nYour sister sounds like an enabler at best.  I'm being kind in  that word choice.", "NTA, you do not owe a stranger your time, energy, or attention. That goes double for belligerently drunk men. You have every right to be afraid of this dude, I would be too.", "NTA your sister is dumb and I can tell from the details you included that she gave out, that she is not really too concerned with safety. She probably likes the attention and feeling of power that comes from dealing with low-lifes who dole out compliments.\n\nEven if he's harmless, I would be bored talking to this stranger. I don't really care about peoples' lives or stories unless I have a reason to, like knowing them. \n\nYou should have spoken up when he asked to sit down. Even if she said \"yes\" your \"no\" would have also been heard. By ignoring this direct yes/no question, you made it seem like you didn't care either way. \n\n\"Nope, I don't want you to join us actually\"\n\nIf your sister disrespects your feelings to the point of jeopardizing your safety I would reconsider socializing with her in potentially dangerous places like bars. It's all fun and games to her, but you don't want strangers to have your personal information and that's fine. \n\nI would make it clear that if that happens again you will remove yourself from the situation. If you fear for her safety you can stay close, but I'd be finishing my beer up by the bar if a stinky drunk man joined my table.", "NTA, at all. This guy invaded your space. You don't owe him anything. If anything, your sister owes you an apology for calling you rude.", "NTA- when you are out with someone else, ONE does not get to decide if a total stranger can stay and talk.   Both should ok that type of thing especially if they know of your social anxiety.\n\nAnd it sounds more like he was talking at you both, not carrying on a conversation.", "NTA at all. Maybe a bit rude, but who cares about being polite to a drunk stranger.\n\nI would’ve said the guy was rude to expect the 2 of you to talk to him, but your sister engaged so that was all good. Her point about you being a lesbian is likely projection as she probably talked to him because she was attracted to him.\n\nThat said, I would argue that you would’ve likely reacted - or at least felt - quite differently if it were a drunk woman as uninvited drunk men approaching you are far scarier and potentially dangerous.", "NTA.  You do not owe random strangers, or anyone really, your time or attention.\n\nHarmless or not is irrelevant.  He intruded on your personal space and expected you to interact with him when you didn't want to.", "It isn't rude to ignore drunks who impose themselves on two young women's conversation. Your sister was ill advised to talk to him and you probably should have just left if you were uncomfortable. Most women I know would have told him to piss off and I would still not class that as rude.\n\nNTA", "ESH. She's unreasonable to be upset with you for not wanting to talk to a stranger. But you're unreasonable for making her responsible for your behavior - if you wanted to leave, why didn't you leave/", "You don’t have to talk to anyone you don’t want to. Doesn’t matter the reason. \n\nEnd of story. \n\nNTA.", "NTA. No one is required to put up with that. He was obnoxious. Asking you to put up with him was also obnoxious.  It can also be dangerous if he decided to follow you, so I am glad you two were together.", "Since when do you need to be polite to stranger drunk men? I think your sister needs to wake up and realize the world is a scary place, which means safety over manners always NTA", "NTA. You're not required to entertain a drunken stranger. And it's the expectation that women will politely put up with men's behavior that gets women beaten, raped and done in.", "NTA no one is entitled to your time and attention. The notion that being polite is more important than boundaries or safety is so outdated and toxic", "NTA. Sister should not entertain a drunk person when you are clearly uncomfortable. She should not reveal personal information about you to strangers. She should also not make comments like \"You are a lesbian so you would have liked if it was a woman.\" Random drunk people joining you is awkward and scary.   \nSoft YTA for not immediately speaking up and/or leaving yourself, but I understand you were anxious and probably did not want to leave your sister alone.", "ESH.\n1. You suck for hanging your issues on her. Making her responsible for your comfort & behaviour was unnecessary. Next time, remove yourself from a situation you hate - get up & leave.\n2. She’s sucks for not understanding that many people simply don’t wish to engage in small talk with strangers. When there are only 2 people, it’s not unreasonable to decline a third wheel.\n3. He sucks for assuming the answer was yes.", "ESH, Everybody Sucks Here,\n\nYour sister clearly was the one willing to entertain him, that's her choice. It's fine if you didn't want to---get up and leave.  You're not glued to her.", "NTA. is your sister all there in the head?", "NTA - also your sister is an idiot. never EVER tell a random person your personal information like WHERE YOU FKING LIVE, she needs to care more about her safety rather then wither or not a random drunk man thinks she's rude.", "YTA. Unless you have a compelling argument for why this wasn’t just cockblocking your sister. \n\nEverything you describe says she was either interested in the guy or at least enjoying flirting.\n\nWouldn’t be that hard to bow out. You’re an adult, don’t make her your caretaker.", "You are weak. It doesn’t sound like he was being creepy, just drunk and wanted conversation. Your sister clearly was interested in talking, you could’ve removed yourself from the situation.", "YTA.  he wasn’t rude or insulting, but you were.  how do you, OP, pick up woman at a bar?", "NTA \n\nMen aren't people so it's ok to ignore them", "You will never get over your social anxiety if you don't start somewhere. Yta", "ETA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (21F) and my sister (25F) bumped into each other in town and went for a beer before heading to our homes. \n\nWe were sat outside chilling casually and no one else was outside, then a very clearly drunk man comes over and sets his drink on our table asking “do you mind if I join you?” despite already setting his drink down before he sat. \n\nI go completely silent as I have social anxiety and get especially anxious around drunk men. My sister is the opposite of me and could chat to anyone really. The man starts rambling on about computer wires and how he wanted cheaper ones than were available and I just put my head down and scroll on my phone as I really didn’t want to give him the impression I wanted to talk to him. \n\nHowever my sister responds to him and he comes closer and starts asking where we are from, our names, where abouts do we live, and she’s replying truthful answers. At this point I text her asking can we please leave and she reads it and carries on talking to him for ten more minutes. He rambled on incessantly and genuinely was making zero sense but I was frightened and really didn’t want to be near this man at all. \n\nI finally convince her to leave over text and we do ten minutes later. I help her carry her shopping home and she tells me I was extremely rude as I didn’t even say hello to him and just stared at my phone the entire interaction. I’m shocked and tell her I don’t have to entertain a man if I don’t want to and he wasn’t invited to our table, then she says because I’m a lesbian I would’ve reacted differently if a woman had sat with us which is not true. I’m not against meeting people in pubs but if I feel uncomfortable I will just shut down and ignore the person. She thinks I should have just went along with what he was saying as he was harmless but how are we to know that? \n\nI understand it is rude to not acknowledge people when they speak to you but I felt so uncomfortable and anxious I just really didn’t want to. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Nta you don't need to feel any obligation to strange drunks who insert themselves.", "NTA you could have technically handled it more gracefully but I am of the opinion that women do not owe men conversation even if they are rude about it. Sometimes to protect yourself you have to be an AH and that is ok. \n\nAnyone telling you to leave is technically correct but personally, I'd want to watch out for my sister/friend when she was with some random dude. Trust your gut tbh and if someone makes you feel off just don't worry about being rude. I see too many women ignore their gut and end up in bad situations to give you any other advice. \n\nAs you get older you will gain more experience with balancing the conflicting desires of not wanting to be social and not wanting to be rude.", "INFO: the only really asshole behavior here in my mind would be if your sister was telling him personal information about you. It sounds like you live in different places, was your sister telling him where YOU live? If she was just telling him her own information, that's her right, but I do think she'd be an asshole for giving out yours when you weren't comfortable. \n\nI personally find it strange that the drunk guy approached you, but I find it hard to call him an asshole for the conversation if your sister was actively discussing things and showing interest in what he's saying. Some people just find drunk rambling entertaining, sounds like you and your sister just wanted different things. I wouldn't call what you did rude for that same reason.", "NTA I do not respond to people in public. I work a very customer focused job and have to be “on” for hours. When I’m out and about I owe no one anything and am very introverted by nature. If someone chooses to be offended by me ignoring or not responding to them that’s on them. \nOf course there are exceptions to this rule. I am never outwardly rude just disconnected and unless I think it’s necessary I don’t talk much to anyone I don’t know.", "NTA. You decide who is worth your energy and time. If he was drunk and making zero sense, chances are he wasn’t worth the energy of putting on a fake smile and pretending to be nice.", "NTA.  You were under absolutely no obligation to speak to this man.", "You are fine. You don't owe a stranger, especially a drunk man, anything. Your sister could have just as easily said \"sorry, we are having a private conversation\" and left it at that. That's not being rude, that's just making it clear he's not welcome.\n\nI also deal with anxiety so I can understand freezing in that situation. It might be worth looking into therapy to help you learn to deal with such situations in a way that you can manage so that you're not feeling stuck for so long.", "NTA. Your sister is being ridiculous. A drunk guy sits down with you and starts babbling at you and you're rude because you didn't entertain him? And then she blamed your \"rudeness\" on you being a lesbian?\n\nShe has some straaaange thoughts knocking around in her head.", "NTA who cares about that guy? Drunk men are scary. And she was reckless telling him the truth.", "Nta\nWho wants a creepy drunk stranger bothering you\n\nHonestly I'd be mad at someone who decided it was best to put me in that situation, and even entertained them", "NTA, but just fyi:\n\n\"Thank you. I don’t know why she’d even bring in me being a lesbian into the equation as I’d be equally as uncomfortable with someone doing this regardless of their sex. Social anxiety doesn’t discriminate haha.\"\n\nExcept:\n\n\"I go completely silent as I have social anxiety and get especially anxious around drunk men.\"\n\nUmm...maybe because you said it?", "NTA\n\nyou were a third wheel", "NTA. EEWWWwwww you are not required to be polite to someone who imposes themself on you... especially if they're tipsy/drunk.\n\nWhen in college, I (f) met up with a friend (also f) at a bar and we were chatting away and very happy. A tall, sort of handsome man comes over, leans next to me and says \"Hello beautiful. I am feeling amorous tonight.\" and winks at me.\n\nI turn to him and give him the emptiest, most wide-eyed smile I can manage and say \"Oh, \"amorous\"! What does that mean???\" He was obviously disgusted and quickly left. Yea, score for me!  \n\nBy the way I have been a voracious reader since 3rd grade and a college graduate. Yep, totally a tactic and it worked! My friend and I went on to have a wonderful evening!\n\nSocial interactions can be awkward. Your sister needs a social re-adjustment.", "Nta, you don’t owe people your time", "NTA. social norms or expectations don't matter but especially when dealing with someone inebriated.", "NTA, what the F is wrong with her.  Telling a drunk man that is a stranger her name and where she lives?", "Something like this just happened to me I was cleaning up in the front yard and I saw this girl that comes to pick up her kids from the school In front of my house all I asked her was for her name.", "NTA\n\nThis how a serial killer gets to make a lamp out of your skin.", "So, as a preface, I just want to say that this is based on what I read here, so it's entirely possible that things like body language and whatnot would conflict with my assumption, but I don't have that information, so please forgive me for making said assumptions without it.\n\nI'd say nobody was an asshole, here, there were just conflicting interests at play. You had no obligation to talk to him or be a part of their conversation, but your sister quite plainly wanted to talk to him. You informed her you were uncomfortable, and she complied with your request to leave.\n\nI would say the bit about \"if you weren't a lesbian you would have been fine with it\" wasn't quite assholish. She was interested in the dude, and assumed had the two of you been approached by someone who aligned with your tastes instead of hers, that you would have acted as she did. Being wrong doesn't automatically make her an asshole.", "Uninvited guests don’t deserve much at all. NTA.", "Why even ask. Like me asking if i didn't respond to women, because i was married at the time. Be the asshole, be the bitch, be happy and let life sort it out. Let me guess... Gen Z's or millennial? I'm Gen X and nothing offends us however others and other things like Reddit, Instagram, Facebook, and other sites like to get or act offended. Fuck if i know why.", "Now, if i were to insert myself into said situation, Dale Carnegie, before you talk, compliment. It breaks the ice and usually brings smiles. Smiles are good. To any generation.", "I am not lesbian and would have told him in no uncertain terms to leave me and. My sister alone! To his face! And gotten the bartender involved! You didn’t go out to drink with a drunk stranger, you went out with your sister, to talk with your sister, to be with your sister. I HATE when people butt in, thinking it’s fine. NTA.", "Nope NTA never. I almost daily don’t respond to a man trying to talk me and it doesn’t make me TAH. Not you either. Don’t bother ever trying to be polite or friendly.", "You weren't rude.  The drunk was.  There are few things more boring than trying to converse with a drunk when you are sober.  Nor should a woman have to put up with a drunken man imposing himself on her.\n\nAs for your sister, she was not only wrong, but she was behaving recklessly.  Never give out so much information to strange men, drunk or sober.\n\nIn the future, don't hesitate to ask management to escort someone like that away from you.  You shouldn't put up with it. If you are with companions who won\"t agree to chase the man off, take a cab home or to where you parked your car.", "It is not rude. No one should expect to have your attention because they feel like it.", "NTA and wtf is wrong with your sister? Does she not know stranger danger? He was drunk, asking questions he has no business knowing the answers to, and she is ok with that?!? I get being social, I'm social and friendly, but if some random drunk person comes up to me I am asking them to leave or walking away myself. I grew up in a quiet town but no town is crime free and one of my friends was raped by some drunk guy asking questions like that. He followed her home, broke in, and raped her. Now that's not saying it will always happen but the chances are higher when you engage with people like that. You don't know his intentions or anything about him, so you leave to mitigate the risks.", "NTA. I understand where you're coming from, I'm sure many people with social anxiety do too. Being a girl/woman is horrifying, especially around a rando drunk man. I don't know why your sister would bring up you being a lesbian, sexuality has nothing to do with this.", "I don’t even know her, but I’m disappointed your sister considered this random drunk man’s feelings (which were probably not even hurt, because he was drunk) over her own damn sister’s. \n\nAnd even more shocking is when you said he was asking personal details, she just … answered? And entertained them? The fuck? Not to be dramatic, but this is literally like Girl Rule #1 that when a strange (drunk) man comes up to you and starts asking you personal details, you either make some shit up or tell him to back the fuck off. You don’t know that man, you didn’t ask him to sit with you, and you sure as hell don’t owe him anything. \n\nI don’t know how she can be so oblivious that 1. It’s never safe to disclose things about yourself to random drunk guys, and 2. (MOST IMPORTANTLY!) you, her own damn sister, was begging to leave because the situation was uncomfortable and stressful. \n\nGoing forward btw, you don’t owe anyone a conversation. “I don’t want to” is good enough reason. \n\nAbso-fuckin-lutely NTA.", "I do not typically interact with drunk strangers either. As an adult with social anxiety for some things, my real friends and family know that it will be a pass for me. Help th.u deratand your needs.", "I would say NTA. You didn't invite him, and he was clearly enjoying talking to your sister", "NTA not wanting to talk to that guy. But you're hella naive if you go into a bar knowing you don't like to be around drunk men.", "Thank you. I don’t know why she’d even bring in me being a lesbian into the equation as I’d be equally as uncomfortable with someone doing this regardless of their sex. Social anxiety doesn’t discriminate haha.", "She’s very social and doesn’t get anxious or panicky speaking to strangers like me.", "I wish I’d have just upped and left but  i froze in my chair from anxiety I didn’t want to make a scene or draw any attention to me. I should’ve just left or spoken up.", "Thank you! I’ve been worrying all day that maybe I’m rude but my sister knows very well I’m socially anxious and struggle when strangers talk to me. You describing it as talking AT us is definitely correct. When she pointed at the block of flats she lives in when he asked I felt ill like why would she point out where she lived to him, what if he followed us or came back another time?", "Leaving her sister with a drunk stranger isn’t a great move. Sister seems to have all the self-protective instincts of a newborn rabbit.", ">Sister should not entertain a drunk person when you are clearly uncomfortable\n\nWhat happened to \"Its not your job to regulate others feelings\".\n\nThis sub is all over the place.", "Thank you", "I dont know about bulletpoint 3 here. Sounds like he GOT a yes from her sister.", "The conversation doesn't sound flirtatious at all from OP's description?", "Honestly it's not even your social anxiety. That makes it worse but no one owes anyone else their time and attention- especially a drunk stranger interrupting a conversation he was not invited to join. Is your sister a people pleaser or just naive? It's a little worrisome to me that she thinks you were \"rude.\" NTA", "you never know what a person’s intentions are. a drunk person approached yall, immediately started complaining/talking about something random, then asked questions about you and your sister. Id be a thrown off too\n\nAnd she shouldnt be telling strangers tons of info about her. He knows her name and the general area she lives, my mom can find someones address on that info alone, and run a background check for more info after. Worst case scenerio, this strange man could know where your sister lives and do something because he sees her as a trusting person. a lot could go wrong letting a stranger know where you live, work, etc. She can be friendly without endangering herself/you.", "it kind of implies that your sister is into sloppy drunks, tbh. which, uh. no judgement, but that is in no way universal. nta.", "Thats weird!  And nothing more annoying than some drunk dude inserting himself in conversation. Fuck him\nNTA", "For your sister's own safety, she really needs to stop telling strangers her personal information.", "Being anxious doesn't make you TA.  Neither does having what I would consider to be normal boundaries.   \n\nBeing overly welcoming to a drunken stranger is potentially dangerous.   Extending that welcome after someone close complains about it is AH behavior.", "I don’t get anxious but I also hate talking to people who insert themselves into my conversations. It’s frustrating when strangers think it’s okay to force themselves into a conversation.", "You'll do great next time! Now that you know this sort of thing makes you uncomfortable you'll feel more confident shutting it down in the future.\n\nI forgot that you were texting your sister to end it, so you really did speak up and she just ignored you. That's really hurtful. \n\nAgain, if she doesn't care about your comfort then just don't hang out, life is short. She cared more about the stranger's feelings than yours.", "Keep in mind, if you leave even if people notice, then within a minute theyll be back to their conversations/drinks.\n\nYour sister may get upset at you for leaving, but you can tell her you did not want to talk to that man, he made you uncomfortable, and you are not risking your safety to entertain a drunkard.", "It’s not about regulating OP’s feelings.\n\nI believe the person you’re responding to meant that if you’re in someone’s company and they are clearly uncomfortable you should communicate with them to find out why. Not because you have to bend over backwards to accommodate them, but there could be a good reason why they are uncomfortable. \n\nIn this case, that some stranger has inserted themselves into their conversation and is asking personal questions, such as where they live (WTF?) and OP’s sister was giving that info freely. Not a wise move, and bot that guy’s business", "Especially when sis is providing personal identifying info. Yikes. NTA.", "It was about 4pm on a Thursday afternoon too so most people aren’t usually drunk at that hour. The man frightened me with his ramblings and at one point he started making goo goo ga ga sounds at a kid walking past which made me feel sick. I even texted her saying please don’t say another word to him otherwise it’ll make him think he’s welcome to talk to us. I just felt so so uncomfortable and should’ve left without her but she needed me to help her carry her shopping and I would’ve been too anxious to leave abruptly alone.", "Abandoning your sister with the drunkard would have been a bad move.  It drives home how much of an AH your sister was for putting you in such an awkward position.", "I think OP would have been fine with leaving if she felt uncomfortable, let the sister know it, and maybe give her a warning that she wanted to leave bc she wasn't feeling safe. OP shouldn't have to subject herself to a possibly unsafe situation just bc her sister won't listen to her."]}