{"id": 26911, "submission_id": "16j3vss", "title": "AITA for asking my boyfriend to \"suck up\" to my parents if he wants gifts from them?", "selftext": "My boyfriend (\"Tim\") and I have similar financial backgrounds, but different cultures. His family is relatively hands off, and he's grown up with a lot of freedom make his own decisions with plenty of room to \"learn\" and make mistakes. My family on the other hand is fairly strict, and has a lot of high expectations when it comes to performance, decorum, and success. Our culture also places a heavy emphasis on respect, especially to our elders.\n\nTim and I are happy together, but our only point of major conflict is how he deals with my family. \n\nHere's the thing: my parents are super generous to my sibling's partners but not so much with Tim (one of my siblings also has a partner from the same culture as Tim, so I don't believe it's a race issue). Tim constantly complains and is offended that my parents don't spend as much money on him. \n\nI told Tim that I support him if he doesn't want to \"suck up to my parents\" (his words), but he shouldn't expect preferential treatment. But he says that gifts should be generously given, and fairly spread out if other partners are receiving them. I say that gifts from my parents aren't something we're entitled to. \n\nI'm especially frustrated because I feel like Tim doesn't have to do much to show respect to my parents. For example, we recently went to their home for dinner with my family, and I suggested that Tim bring some wine or fruit as a gift to show we were thankful for their hospitality (since my mother was cooking). He said that if they shouldn't invite people over if they expected a gift. My brother and sister's partners each brought something (one a cake, and the other some flowers), and I could tell my mother was touched and my father slightly irritated at Tim.\n\nTim says I'm an AH for not fighting for him more, and for trying to force him to conform to my family's values. I can kind of see where he's coming from, but I also know where my parents are coming from too. \n\nOh! And here's an example from Tim of their unfairness in case it helps with context: For each partner's birthdays, my parents take everyone out to dinner. For the other two we went to really high end and exclusive restaurants. For Tim, they still took us out and paid everything plus got Tim a gift, but his meal was less fancy (but still nice IMO. Each entree cost about $40-$50). ", "created_utc": 1694753100, "permalink": "/r/AmItheAsshole/comments/16j3vss/aita_for_asking_my_boyfriend_to_suck_up_to_my/", "score": 50, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I'd like my boyfriend to treat my parents nicer (\"sucking up\" in his words) if he'd like nicer gifts from him. My boyfriend doesn't want to participate in that kind of behavior, so I could be an AH for asking him to act against his values.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nIt's clear that it's not so much a matter of \"sucking up,\" but rather of basic decency. You tell him exactly what he needs to do to please your parents and when he refuses, he turns around and gets mad at you? If he doesn't care about making your parents happy, that's a bit assholish, but okay. The problem really comes from the fact he expects treatment that he refuses to give. This behavior is just entitled. Also, what culture are you from and what is he from? How does he treat his own parents?", "NTA. \n\n> He said that if they shouldn't invite people over if they expected a gift.\n\nI am really curious what cultural here is from where this is the not the norm.", "NTA at all.  Tim sounds awful though, why re you with him?  He sounds like he is going out of his way to disrespect your parents because of your culture instead of just doing basic respectful things.  Also, he has 0 right to complain.  As a BF they don't have to spend any money on him", "'He said they shouldn't invite people over if they expect a gift,' but he expects a gift from them for doing absolutely nothing. Does he not understand the hypocrisy of his statement.", "NTA. What values does Tim think you’re trying to get him to conform to? Good manners?\n\nGetting a hostess gift isn’t sucking up, it’s a common courtesy. And to treat the family to a dinner for a boyfriend of your adult child, not husband, is already generous at baseline. \n\nTim is entitled to respect and acceptance as the partner of their child. What Tim is not entitled to, is your parents’ money. He needs to take so many seats so you can see the other men in line.", "NTA. I was ready to be on your boyfriend's side, but bringing flowers or a bottle of wine or something sweet isn't sucking up, it's just basic manners. He sounds spoilt and entitled.", "I don't think *suck up* is the correct term. It's about being thoughtful and respectful, which your BF is not.\n\n>Tim constantly complains and is offended that my parents don't spend as much money on him. \n\nHe's a spoiled brat. Whining because you don't get gifts - no, because *your gifts aren't expensive enough* - is unbelievably entitled behaviour.\n\n>he's grown up with a lot of freedom make his own decisions with plenty of room to \"learn\" and make mistakes\n\nMaybe he needed a bit more guidance because he still hasn't learned the basics of how to treat other people.\n\nNTA.", "NTA. As mentioned, it is common courtesy to bring a small hostess gift when someone invites you to their home for dinner. Tell him to ask Miss Manners. And he isn't \"entitled\" to anything from your parents, they are extending themselves by including him in things with their family as your SO.", "NTA.\n\nI think Tim is just immature. I agree that he shouldn't force relationship he doesn't want, but things like you mentioned are just basic polite behaviour and all I can see are his excuses. Plus comments about quality of gifts he is \"entitled\" to are just cherry on top of him big A-hole. It would be different if your parents were disrespecting him, because of his job,race etc. \n\nSince my IL brought to the the world someone special as my spouse, then they deserve same level of respect as my own parents and some small tokens of appreciation would never hurt. If he can't respect your parents, what do you think will happen once you get married and takes you as granted. Might not be the case, but I would be careful if he is \"husband\" material.", "NTA. Your boyfriend is an entitled whiner. If he wants a gift he has to suck up to your parents and earn it like everybody else.", "NTA, tim wants to receive gifts but doesn’t want to give gifts. And he’s got the cheek to say your parents aren’t treating him fairly, tell him your parents are treating him fairly, as he treats them. You should get a better boyfriend.", "NTA", "NTA the only person who signed up to love and respect him is you. Your parents have no such obligation and can treat him as he treats them and to be fair they are a lot nicer to him than he is to them. So he needs to sack it up and realise he is the problem here.", "NTA / I know it’s a short AITA but from this Tim doesn’t seem to have much going for him personality wise", "NTA\n\nHe is acting a little mean towards your parents, of course they won't shower him with gifts.", "Your boyfriend is a jerk. What culture doesn't bring a hostess gift? It is clear that it means something to your mother and he should do it for that reason alone. And, while insulting your mother, he expects expensive gifts? You aren't even married. It sounds like you can do better.", "NTA. If he can't do some small nice gestures for your family he shouldn't expect receiving big grand gestures.", "NTA. You're not trying to force him to conform. You've told him how it is and if he doesn't like then that's on him.", "NTA. You obviously love and respect your parents, why stay with someone who obviously doesn’t?", "NTA. \n\nTim sounds rude and entitled. I've lived in many countries and deal with people from many cultures (all across Asia, the Americas, Europe). I would say, that based on my experience, 98% of all people, regardless of ethnicity, take a little gift to someone's house when they are invited for dinner. Could be wine or dessert or flowers or even another non-edible gift, if they know the person. I've had a person over for dinner and they gave me a book they knew I would like. It's just basic courtesy. \n\nIt seems Tim can't understand the difference between \"sucking up\" and being a polite and pleasant human to be around.", "Tim wants stuff from your parents, but isn’t willing to reciprocate. Don’t know which culture you’re from, but in mine we call people like that “freeloaders.”\n\nIt sounds like his attitude toward your parents isn’t going to get better until they start lavishing him with gifts. You need to start asking yourself whether this is someone you can actually have a future with.", "NTA. I think you should rephrase your post to say you had a normal upbringing and Tim’s parents were grossly neglectful. So Tim doesn’t know how to have a healthy relationship with family", "NTA - bringing something for the host is just basic politeness, not sucking up.  If he can't even bother to show that kind of respect when you tell him that's a norm for your family why should they bother with him?", "NTA- what you described isn't anything extreme but honestly super common.\n\nYou said you're different cultures.  Is he from a culture where the guest is treated like a king or something?\n\nBecause it from what you've described it feels more like he is expecting that kind of treatment like he comes and means treated like an honored to guest, versus a guest in your parents' home.", "Tim is not crossing the cultural divide. Tim is stuck in the mud on the side of the riverbank. Tim is dragging himself down into the mud. Tim is not going to be a fun guy to be married to. Let Tim fly and be free. Let him be Tim. By himself. \n\nNTA.", "ESH - for me its a non existent issue of people who meassure their sympathy with other people in the monetary amount they give and receive in return....\n\nthe only thing that rubbed me wrong was this:\n\n\" **I** suggested that **Tim** bring some wine or fruit as a gift to show **we** were thankful for their hospitality \"\n\nok so where are you in this picture? why couldnt you buy some wine or fruits and give it in the name of you two?", "> He said that if they shouldn't invite people over if they expected a gift\n\nOh the hypocrisy! \n\nNTA", "I think it is culturally universal that showing up empty handed to someone else’s home is rude. You are NTA but Tim sure is. It’s ironic that he has so many opinions about what is right and wrong when he criticizes your parents for favoring your siblings partners with nice gifts and dinners but he is completely blind to his own poor behavior. I don’t think you’re asking him to suck up, you are simply asking him to show respect for your family the same way you do. If he does eventually start being polite he should know that he is not entitled to or owed gifts for his civility.", "Although tim sounds awful your parents do as well. They clearly have a distaste for him you made that clear and he has one for them. I'd have to say ETA you for not asking your parents to treat him equal them for differential treatment and him for lack of effort.", "ESH. \nTim could suck up to your parents all he wants, but that doesn't guarantee 'better gifts' and he might never be satisfied. I think its bad advice. If he doesn't want to 'conform',  he should lower his expectations.", "ETA if it was me, I wouldn’t even care or know what my in-laws spent on anyone else! Unless it was deliberately flaunted. And if that is the case you should say something.\n\nI do find Tim’s behaviour somewhat contradictory as he’s saying he doesn’t have to suck up, but at the same time he doesn’t want to conform to common curtesy. \n\nDoes he expect preferential treatment or just fair treatment? Why did your parents take him to a cheaper restaurant. And why were you okay with that?\n\nThey are the elders so they should not be so petty.", "YTA\n\nHe shouldn't have to suck up to be treated equally. Your explanations on \"cultures\" are a moot point, you don't have to adhere to them, they don't have to mould your life. \n\nYour parents are assholes flat out and I just wouldn't go anymore if being treated equally means brown nosing.\n\nYou want Tim to date your parents. If I was Tim I'd tell all of you to go to hell.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy boyfriend (\"Tim\") and I have similar financial backgrounds, but different cultures. His family is relatively hands off, and he's grown up with a lot of freedom make his own decisions with plenty of room to \"learn\" and make mistakes. My family on the other hand is fairly strict, and has a lot of high expectations when it comes to performance, decorum, and success. Our culture also places a heavy emphasis on respect, especially to our elders.\n\nTim and I are happy together, but our only point of major conflict is how he deals with my family. \n\nHere's the thing: my parents are super generous to my sibling's partners but not so much with Tim (one of my siblings also has a partner from the same culture as Tim, so I don't believe it's a race issue). Tim constantly complains and is offended that my parents don't spend as much money on him. \n\nI told Tim that I support him if he doesn't want to \"suck up to my parents\" (his words), but he shouldn't expect preferential treatment. But he says that gifts should be generously given, and fairly spread out if other partners are receiving them. I say that gifts from my parents aren't something we're entitled to. \n\nI'm especially frustrated because I feel like Tim doesn't have to do much to show respect to my parents. For example, we recently went to their home for dinner with my family, and I suggested that Tim bring some wine or fruit as a gift to show we were thankful for their hospitality (since my mother was cooking). He said that if they shouldn't invite people over if they expected a gift. My brother and sister's partners each brought something (one a cake, and the other some flowers), and I could tell my mother was touched and my father slightly irritated at Tim.\n\nTim says I'm an AH for not fighting for him more, and for trying to force him to conform to my family's values. I can kind of see where he's coming from, but I also know where my parents are coming from too. \n\nOh! And here's an example from Tim of their unfairness in case it helps with context: For each partner's birthdays, my parents take everyone out to dinner. For the other two we went to really high end and exclusive restaurants. For Tim, they still took us out and paid everything plus got Tim a gift, but his meal was less fancy (but still nice IMO. Each entree cost about $40-$50). \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Tell him to try not to worry about gifts. It’s embarrassing.", "All these comments saying Tim is the asshole, can you show me where in the initial post this woman says that her parents began treating Tim this way because he did something wrong or wasn’t courteous or generous enough? It’s actually worded as if Tim is acting in response to her parents playing favorites. Interesting how so many of you are so willing to fill in the blanks with your assumptions.", "[removed]", ">Tim constantly complains and is offended that my parents don't spend as much money on him\n\nSound's like Tim is still a child", "The culture of having no manners is what it's called.", "Well, bringing a gift is not custom in the west. US and Canada are 2 quick ones.\n\nEdit: Okay apparently even within the US and Canada there are differences. Eastern states I've visited have never had this tradition same for visits to eastern Canada.", "The irony. \nTim expects big expensive gifts. \nBut when OP's family hosts a dinner, they shouldn't expect a hostess/host gift? \n\nHis math is not mathing here.", "😂", "The fact that a $2 bottle of wine or a $1 card probably would have been enough. He'll if it was about money he probably didnt actually need to bring anything, just thank op's mom for the invite and ask if she needed any help. Thats usually enough for my family", "I definitely get where you’re coming from. But if the guy has been unfairly treated for quite some time with no backup from his wife, why would he want to do any kind gesture for these people? Just wondering why the husband has to be the bigger person in this situation.\nThe phrasing about wanting gifts makes Tim look like a dick, but if it’s been years of getting crap while the others get great stuff, I’d be really a selfish jerk?I think this is one of those posts where we can’t really speak to\nit because it seems like the wife is purposely downplaying the mistreatment of her man so she doesn’t look like the asshole.", "I definitely get where you’re coming and after to a point. But the fact that the wife hasn’t given any reason why her man should be given less seems like the parents are playing favorites and the wife is gaslighting her husband in an effort to excuse it. He very well may immature and entitled but something is off about this post. I get this feeling that where nit getting the whole picture. If there is no reason for the other significant others to get much better gifts, shouldn’t the wife ask the parents about it? Or at the very least not make her husband think it’s a him problem?", "Yeah I think this post is a bit misleading. Tim definitely seems like an entitled jerk. But does he seem that way because of the way this post was created? It’s so easy to omit obvious info in an effort to make yourself look better. The fact that the wife takes absolutely zero responsibility for any of this is a bit of a red flag for me. This guy could very well be the immature clown that he’s being painted as. But if the parents really do treat him less than for no real reason, why should he have to be the bigger man and do this little niceties that aren’t reciprocated? He could be a dick or he could be getting gaslit to the point of being over it. Something doesn’t add up.\n\nIt seems like this wife actually enjoys the fact that they think less of her man. Maybe it makes her feel superior?", "Why should they treat him equally. He isn't delivering respect, consideration and courtesy equal to that of the siblings' partners, and so he shouldn't expect equal treatment back.", "But they do treat him equally. All of them get the \"we treat you as you treat as\" treatment", "Best comment I’ve read so far! I think everyone in this post is immature and a bit pathetic. Your comment is the most logical response I’ve read and of course it’s been downvoted. People on Reddit love to shit on men.", "I don't think they're being petty; they're reciprocating the level of effort that the boyfriend is putting into the relationship. If he doesn't want to be close with them (or \"suck up\" to them, as he put it), then that's fine, but he can't expect anything in return. They still took him out to dinner, which I think is more than generous!", "I would find Tim extremely rude if he doesn’t bring any kind of gift to the dinner host, if he doesn’t want to do it when he knows it’s expected then he doesn’t get to complain about gifts.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Or maybe it's the \"your the rich relatives/friends.. you shout us\".", "I am Canadian and have always done that and my family does it too. We don't drink but have a wine rack specifically for the purpose of gifting for dinners. Grandparents host people regularly and they nearly always bring something. \n\nMaybe I am unusual, but we seem to do it here. Idk. Interested to hear opinions.", "Native New Yorker here. Hostess gifts were normal and expected, but usually nothing expensive.", "Poster claims an American tradition isn't an American tradition.\n\nWaiting for it.\n\nThe moment the poster realises that they have been rude all their life.", "It is in Italy.", "It is custom in the u.s. to bring a gift when you visit someone’s home for dinner—in some cultures.  A bottle of wine, a desert dish, something….\n\nObviously it’s part of OP’s culture in any case.", "UK here - if I'm popping over for a quick chat, sure. If someone invites me to their house for dinner (aside from very close, casual friends, and even then I still might), I'm absolutely bringing a bottle of wine or similar. It shows appreciation for the effort they've put into making dinner!", "Uk here i take wine if they have kids sweets for them pets etc etc", "Where in eastern Canada? Newfoundland and Labrador its pretty standard, same with new Brunswick, PEI, Nova Scotia, maybe not Quebec but definitely Ontario.\n\nMaybe you just didn't realize you should have brought something?", "US here, this is very normal", "It absolutely is.", "It's definitely normal where I'm from. I'm Belgian, so I'm pretty sure that qualifies as \"the west\".\nPlease refrain from making generalised statements like this.", "Notice how the wife never mentions anything specific about why he’s treated less than? I’m guessing it’s because there absolutely no real reason for it. Why should he give them respect and everything that goes with it if he never got if first? Your take is assuming a lot that isn’t said in the post.", "That’s actually not true at all. The wife acknowledges that her man gets tested less than but never actually says when or why it started. You’re assuming they’re treating him like this because he was a jerk first. I’m not sure how so many of you are making that assumption when the wife literally doesn’t speak to it.", "Yeah im with Tim on that one in ireland it would be considered a dick move to ask for someone to bring a gift when invited into their home unleas its a birthday/Christmas", "Buying a 10 $ wine bottle when invited to a family dinner or bringing a home cooked appetizer/salad is hardly a trait reserved for my rich friends as you call them. My monthly salary is 1000$ after taxes and that's above average for the country. \n\nIn this case, it's not even a matter of upbringing since she literally told him he should do this.", "\"American tradition\" your funny. In no way is it American tradition to give a gift when invited over. It didn't even start in the states but claim what you like. Il give a gift to whomever brings one but in 30 years not 1 has been given or received. Can't even count the number of parties hosted not 1 wine bottle or candy box or w/e. So yeah its not \"American tradition\" it may be in some states but not them all.", "Oh my Québécois family are always gonna bring wine! They love wine. We invited family friends over last week and they brought soup, baguette, and wine. The soup is an outlier for the norm, but baguette and wine is normal.", "I can't even have a takeout night with my friends without them bringing over a bottle of wine. I usually bring 2 if it's a legit event (one for now, one for gift)"]}