{"id": 2705, "submission_id": "yz9veg", "title": "AITA for accepting my family's Christmas invitation despite my husband being upset?", "selftext": "\n\n\nI [F32] I met this wonderful man 'Philip\" [M36] 2 years ago. We got married 4 months ago. For context, I have a 10 yo son \"Billy\" from my previous relationship and my ex isn't in the picture.\n\n\nI have to admit that Philip's relationship with my family isn't so great. They would disagree on a lot of things. For example, he had an argument with my dad when he said that he was keeping their grandson away from them but Philip stated he wasn't and that he couldn't visit with Billy because he had work (I was sick at the time).\n\n\nThe latest argument was what made things worse. My mom and sister were discussing natural remedies (they're into this stuff) for my niece and Philip (he's a pediatrician) called both of them \"ignorant\" for not using meds instead which caused a huge argument and Philip being no longer welcome at my parents house.\n\n\nNow they'd sent me and Billy an invitation for Christmas but did not include Philip which, I expected given how strained their relationship has become. I called my mom to confirm that I'll attend but the minute Philip found out, he went off saying he could not believe I was fine with my family excluding him and then agree to go and leave him behind. I told him it's their celebration and I don't get to decide their guestlist for them. And also, I'm not leaving him behind because we did not have any plans for Christmas. He said he thought that we'd \"automatically\" celebrate together the 3 of us but now I'm taking Billy away from him as well. I thought that was a bit melodramatic because it's literally just few hours at my parents home but he insisted it was about principle and respect. We had a big argument and I said that he basically alienated himself by continually picking arguments with my family, but he started ranting saying it wasn't about the fact that they didn't invite him, but the fact that I was willing to let him spend Christmas alone without me and Billy.\n\n\nWe went back and forth on the issue but do not seem to reach a solution. My parents are used to spending every major holiday with Billy. So you can see how much pressure I'm getting from both sides here.", "created_utc": 1668857597, "permalink": "/r/AmItheAsshole/comments/yz9veg/aita_for_accepting_my_familys_christmas/", "score": 7857, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think that I may be the asshole hear for not seeing where he's coming from and for immediately accepting the invitation without talking to him first.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "How are you not outraged that your parents left YOUR HUSBAND out of the invitation to spend Christmas with them?\n\nAnd how could you possibly contemplate leaving your husband alone at Christmas?  Do you actually \\*want\\* to be married to him?  You accepted an invitation which excludes him and you think this is reasonable?\n\nYTA.", "You are so the AH. Flip it around and have his family accuse you off not bringing their grandson around when you are working. Then try to lecture HIM on how to treat a kid when he's a freaking pediatrician!\n\nIf Billy gets sick, don't bother your husband with it. Have your sister and mom treat him with KFC's 11 herbs and spices cause you know, they know better 🤦🏻", "YTA. \n\nThe first ‘infraction’ has set the tone for the rest of their relationship. You were sick, your husband had to work and your parents said this meant he was keeping their grandson away?  You should have nipped this in the bud right there and then. Then for your hippy dippy sister and mother to talk about natural remedies in front of a pediatrician who, I guarantee, has seen kids DIE because of ‘natural remedy’ parents, I’m surprised he didn’t say more than that they were ignorant. \n\nWhen you marry, you become a team. Your husband has been banned, therefore you don’t go either. It’s that simple. You have shown your (in your own words) ‘wonderful man’ where he lies on your list of priorities. Get your head out of your ass, or you’ll be needing to find a divorce lawyer. I sure as hell wouldn’t put up with a spouse like you.", "YTA. You're right - you don't get to decide their guestlist for them. However, you do get to decide whether or not to spend Christmas with your husband. Every married couple I know would \"automatically\" expect to spend Christmas together.", "YTA 100%\n\nYou have no ground to stand on. You are supposed to stand up for your husband. He has been poorly treated by your parents, and shame on you for not standing by his side. Your parents exclusion of him at Christmas is an opportunity to spend a holiday as a new family. Not leave your husband all alone.", "YTA 100%\r  \n\r  \nYou just prove to him the he matters less to you, this wil snowball because now your parents know that is ok to exclude him and you won't do nothing, this won't end well.", "yta\n\nhes your husband and he has done nothing wrong\n\n1 your dad picked a fight because he had to work and you didnt defend him\n\n2 you are encouraging your mum to be an idiot and not be knowledgeable on medications and wanting to do natural healing and when your husband as a medical professional stated the facts you let them be terrible to him\n\n&#x200B;\n\nyou think its okay to leave your husband alone on Christmas because they are being horrible to him and id be upset to you are not doing anything to defend him when he has done nothing wrong\n\n&#x200B;\n\nyou taking there side and in doing so shows you dont care for your husband \n\nkeep this up and he will leave", "YTA, you said yes without discussing it and are leaving him all by himself on Christmas Day. Either you get invited as a family or not at all. Your parents are also AHs.", "YTA you spend Christmas with your son and husband. You're a couple. If he's not invited you don't go. \n\nThis isn't rocket science, it's relationship 101. Let's be really clear here, if you do this you're relationship is forever damaged. This sort of betrayal is huge.", "YTA \n\n\nI have a hard time believing that you don't understand that your husband and child don't need to \"make plans\" with you to be understood that all holidays are spent as a family. You are supposed to want that, otherwise why did you get married?\n\n\nYour parents are assholes too for the whole \"trying to take their grandson away from them\" and then don't inviting him.", "YTA to me… \n\nThis will be your first Xmas as a married couple and officially Phillip’s first with the family- that is to say you and Billy. How is it ok to ignore that? That Phillips first Xmas as a true bonafide stepdad gets wrecked bc his stepson won’t be there because according to you and your parents, Billy’s grandparents are more important than your husband and coparent. \n\nYour parents can choose to include Phillip or not, but your compliance also shows Phillip that you choose them over him. They aren’t your only family now. It is not fair to your husband to leave him for any amount of time, much less a ‘few hours’, to give into your parents pressure and demands. \n\nLet me ask you this- roles reversed and your MIL demanded Phillip and Billy be at her house, but not you- how the hell would you feel not only for the exclusion by in-laws, but your spouse leaving you alone? Truly think about that and tell me that anyone who would do this, or even ask their spouse to be ok with it, isn’t being a jerk…", "YTA. \nListen to yourself. “I’m not leaving him behind because we did not have any plans for Christmas.” \n\nHow is going to your parents’ house without him not leaving him behind? He shouldn’t care about being alone for Christmas because you hadn’t made special plans? Plenty of families spend Christmas as a nuclear family unit, opening gifts and spending the day together.", "YTA. You’re excluding your husband and not even sticking up for him, just going along with the disrespect. That messed up and sad. And to do this in front of the stepson who will certainly remember it’s okay to do this will just further make it harder for them to get along. Are you into the weird alternative medicine too? Why is it right they exclude him for that and you’re okay with it if you might disagree as well? Your family is almost trying to tear you two apart and you’re going along with it. Shame.", "YTA. You didn't even speak with him, you just automatically accepted the invitation. By doing that you literally showed Philip exactly where he stands in your marriage. You should have stood up for your husband and declined the invitation.", "INFO: Did your parents alienate you from your ex-husband as well?", "I did a study on evidence-based practice using pediatricians and naturopaths for my Master's. Much data, but in short, naturopaths do not follow evidence based practice.\n\nWhile I think your husband could have been more tactful (although if they were discussing something harmful, then good for him), natural remedies are usually garbage, naturopaths are quacks, and your husband is a damn pediatrician. I have a feeling your family disliked him for that reason alone. \n\nAs for the Christmas thing, YTA. As are your family.", "YTA.\n\nYour family sound like they have a grudge against your husband. As he is a pediatrician I can understand why he would defend his discipline. And him not taking your child to see them because he has work is a valid reason. What exactly is their problem with him? \nAnd you’re not standing by him while he’s being shunned and bullied by your family. \nShame.", "YTA\n\nUnless there’s a better reason than “Philip didn’t bring Billy to us because he has to WoRk” and Philip the pediatrician harshly denounced some natural remedies for niece’s ailment (and I want you to REALLY think about if what they were doing was putting your niece in danger), then I’m inclined to believe your family sucks and you do too. \n\nWho spends their first Christmas after marriage away from their new spouse? Did Philip the pediatrician get off for Christmas (something that may have been hard to come by given healthcare worker and increasing RSV) just so that his new wife and stepson could leave him by himself to go to people who dislike him? If you have kids together, do your parents get dibs on all of their Christmases too? Where are you drawing the line?\n\nYour family dynamic has changed. It’s not just you and Billy. Get the adults together and talk this out. Unless Philip goes out of his way to be an asshole, which these tidbits don’t tell me he is, I think you should re-evaluate the situation. Because this a fast way to add another ex who isn’t involved.", "YTA, how can you even consider leaving your husband alone at Christmas?  He was in the right in both instances that you mentioned. He’s a doctor, he can’t just take off work to take your son to your parents.  Also on the second instance, he’s a doctor! I get natural remedies when it’s an option, but sometimes they don’t work. You are a team now and you should definitely have his back here.  Do you plan to leave him on every major holiday?", "YTA. And so is your family. Philip and Billy are the only people who don’t suck here.\n\nI would also like to know how it made sense to you and Philip to not discuss the holidays and how to deal with the fallout from your family. You’re married. Communicate with each other.", "YTA. The minute you married the man, you formed a nuclear family. That means you are a unit that operates all or nothing. The \"new normal\" is going to look different than all the years before, including how Billy spends his time for holidays.  By letting your witch doctor family dictate that for you, you are betraying your marriage vows.", "YTA. Everything your husband has said in this post is correct. If he was working, he wasn’t keeping their grandkid from them, that’s totally out of pocket. He’s a doctor, he’s right. They should be using medicine. And as for you - I would be crushed if my spouse left me totally alone and couldn’t even stick up for me when I am the right. Hope he sees from this you will always choose your family first even when they are wrong. You are not a good partner.", "Woah! This guy is probably thinking why on earth he married you. YTA in a big way. When you’re married, you’re family. No one else (other than children) matters half as much.", "Huge YTA\n\nYou and Philip are married!!! This is no longer a \"boyfriend\" scenario, you choose to start a family together.\n\nLeaving your husband alone for Christmas is an asshole move. Wow. You expect to \"make plans\" in order to spend Christmas with your husband and son?? Really, you need plans for that?? It's normal and expected for a family to spend holidays together. You don't need plans..  \n\nAs soon as you got an invitation from your parents with only you and Billy, you should have called to reject it. You either go as a family, or you don't go at all. \n\nThere is also the other option - you don't really want a family with Philip (he has his flaws, he disrespects your parents). In which case divorce the guy, stop wasting his time (and yours).", "YTA.  Your nuclear family should come first, which means your husband and son should come first.   How could you even consider going to your parents when they didn't invite your husband?   You should be mad at them and made plans for you, your husband, and son.", "YTA. The comments here have spoken how I felt towards it. Shame u don’t see it yourself.", "YTA. Why did you get married if you weren't ready to treat you and hubby like a team?\n\nLook, you need a reality check. Your parents are wrong in excluding him. You choosing them over hubby = no hubby. He will leave if he has any sense. Is this what you want?", "YTA your family is your husband and son, and then others.\n\nAnd I'm with him I would assume I would be spending my first Christmas as a married couple of a few months with my spouse not on my own, but well done on telling your husband where he ranks in your life.\n\nNo you can't influence their guest list but you can say I understand your stance but I'll be spending it with my HUSBAND!!!!\n\nYou didn't give him the respect of discussing it before confirming your attendance. \n\nI don't see your marriage lasting very long.", "Wow just wow, YTA, sure excluded my husband from Christmas, I have no problem with that.", "YTA Your husband is family now. I can’t believe you are so shocked that he has presumed you would spend Christmas together.\n\nETA that a paediatrician knows what he is talking about when it comes to treating a child’s illness.", "YTA --- If you were a decent person you would have had your partner's back and told your parents if my partner isn't invited there I'm not coming either.", "YTA,I would literally divorce my husband over this.I can take a lot of shit,but this kind of disrespect hell no", "YTA and you obviously don’t have a clue. You’re supposed to be a “married “ couple which means that you discuss things and don’t randomly make decisions without discussion. You don’t recognize any of your family’s roles in these disagreements and just say it is your husband’s fault. It takes two to tango. You’re being a selfish jerk. Time for Phillip to reevaluate if he’s smart.", "YTA. You’re not going to be married to Phillip for long.", "YTA. You chose to spend Christmas somewhere other than where your husband is. He’s entitled to feel angry about that. Bad move by you.", "YTA\n\nHe is your partner and you made this decision without even talking to him. That's so disrespectful.", "YTA. Is your husband a member of your family or not? If he is, you don’t go to events where he is explicitly excluded. You don’t determine the guest list at your parents’ house, but you do determine if you go. You are clearly indicating that you don’t consider this “wonderful” man a member of your family.", "YTA  \n\nYou're now a married couple. For family gatherings and the like, you should be considered *one* unit.  \nThey either invite you, as a family, or not at all.", "YTA. I think your expectation here is that you should not have any consideration for your husband and act as if you are a solo. I don’t fully know the dynamics between him and your parents and who is at fault but that’s a separate issue. Just automatically accepting the invite, without even talking it out with your husband is like saying that he is not part of your life at all. You may want to consider if you really want to have a husband because you act as if you are a single person who only considers herself.", "YTA. You need to be supportive of your husband not your parents. Pull your head outta your ass op. And now you are making your husband spend Christmas alone....what a wonderful wife you are", "YTA, do u even want to be married?", "YTA \nStart communicating with your spouse and stop unilaterally making decisions", "YTA big time. OP, the first story sounds like your dad was TA, like he was lookkng for a bad guy when it was just an unfortunate situation. And the second example is also super bizzare, why would they talk about this in front of a pediatrician and not ask his advice? Honestly it sounds like they were being ignorant of your husband. I mean nobody would've forced them to do what he says, so not asking seems like a major disrespect. And then they just announce that there will be no contact but invite you? Like they couldn't wait to jump at the chance! You need to get your priorities straight and stand up for your husband if you want your marriage to work. Seriously, it sounds like he has had to put up with a bunch of stuff your family threw his way and not only did you not protect him, you threw him under the bus. \nHow does he have to make clear you spend the holidays together, you are married? You could have at least asked him before responding. \nI get that you want your son to see his grandparents on Christmas, but they made the decision to exclude his dad. They knew that this would cause a rift in your family and apparently they also could not suck it up for a few hours a year for your and your son's sake. \nAgain, unless there is a bunch of other stuff where your hubby royally screwed up, you and your family are TA.", "YTA - you don't allow your husband to be excluded or you don't go. Your marriage is now your first family, and your parents are second.", "YTA. You’re leaving your husband all alone on Christmas. You’re not acting as a wife at all, perhaps you’ve been single for so long that you’ve forgotten what it’s like to work in a partnership and that’s okay, but you need to realize how terrible this really is. You’re leaving your HUSBAND alone on CHRISTMAS.", "Naturalist at heart here. I still disagree with OP.  If you loved him enough to marry him, then you should value his thoughts and feelings. I would have talked with him before accepting the invite. You are automatically the TA by not doing that. Maybe you two could have worked something out but now you’ve just created a divide. Good luck. YTA", "YTA. Good start to your first Christmas together. You don’t seem bothered with him being excluded. Your family sound like a bunch of winners", "YTA big time. Seems like you have no intention of backing your husband up against your controlling family. Your first holiday and you exclude him? Why exactly did you marry someone you don’t seem to respect?", "YTA. You should have told your parents that you wouldn’t attend if your husband was excluded. At 4 months into the marriage, you are causing some pretty major damage to your relationship.", "YTA\n\nAre you married or are you not? HE is your family now. \n\nSolution: invite them all to YOUR place. Do NOT allow them to separate you from your husband.", "YTA. You realize you're married right? It seems you don't.", "YTA\n\nWhy are you not defending your husband? Of course a doctor is going to tell people that medicine is a better choice then a fair amount of home remedies. I've seen kids end up in the ER because parents chose a home remedy or some bs they read off the internet. Doctors are over that. \n\nAnd why can't your parents drive down to see the child. If you are sick and your husband has to work then next option is your parents putting in effort.", "YTA\nWhen you married Phillip he (and your son of course) formally became your primary family. Your mother, father, siblings, are now your secondary family. And you let them insult, disrespect, and ostracize him for being... correct???\n\nYou didn't stand up for him in any scenario, and he was never in the wrong in any of them!\n\n I'm sorry to have to say this but Phillip deserves much better in laws and he deserves a much better wife.", "YTA. It's all the family, the tree of you, or not at all.", "YTA. I agree with Philip.", "YTA. Don't worry, you'll be back to being a single mother soon enough and will be able to attend all the family gatherings you want without bothering to think about your partner.", "YTA\n\n How awful that you take a stand against your husband and take an invitation where he isn't welcome. \n\nSeriously does he mean SO LITTLE to you that you let him sit alone at home for Christmas while celebrating with your family who has been zero welcoming towards him!?\n\nDo you even like this man a little bit? Don't you realize how much you HURT him? You are calling him melodramatic while your family is disinviting him for Christmas over an argument about alternative medicine - who is being melodramatic here? And you just call your parents to verify he isn't invited and don't even try to find a solution?\n\nI hope you are aware that if go though with your plans it's going to put an unmendable rift into your relationship. I know I'd serve you divorce papers as a Christmas gift.\n\nEdit: Also he is a doctor, of course he knows what's best for a sick child!\nHe isn't alienating himself, he is standing his ground - without his wife having his back.", "YTA. If my husband did this to me, it would be the first of many days spent alone while I hired a divorce attorney.", "YTA: Poor Philip and Billy.", "YTA, i don't need to elaborate", "The way you describe this makes me think you really need either : marriage and personal therapy or your going to need a divorce lawyer. You are wrong about so much here. YTA.", "YTA. Did you call your dad out for trying to make your husband the bad guy about visiting?  Do you respect that your husband, an actual doctor, may know more than your likely internet educated mom and sister about you know health things?  Will this be an every holiday thing since your parents are “used to” seeing billy every holiday?  You are setting a horrible precedent which may not matter much if your current husband isn’t around for future holidays, then you can do what you want.", "YTA why make him part of your family by getting married, then not treat him like part of the family?\n\nNext time keep your relationship at booty call level, if thats how you're going to treat them", "YTA - your family definitely sucks here and they were the ones to exclude your husband. But guess what, Christmas is the celebration of your family and Philipp and Billy are your closest family. This is the point where you take a stand against your parents and stand with your husband. I wouldn't even consider taking your son there without his step father. Celebrating Christmas just the three of you is the only reasonable option.", "YTA. Your mad at your husband, a doctor, for calling out your ignorant parents?\n\nNo wonder poor Billy's father is no longer in the picture.", "YTA, why would you confirm without even discussing with him considering it would affect him in the holidays? Sounds like your family trying to alienate him if all he did was work and offer (professional) medical advice for a family member. Bad wife!", "YTA. I would not be going anywhere at CHRISTMAS that my husband isn’t invited. Your husband is your family and you should be a team. Do you really expect him to sit home alone on Christmas Day while you go off to see your parents?", "YTA. How are you having a hard time seeing that? You’re leaving your husband alone at Christmas to spend time with people who openly dislike him. This is when you start making your own traditions as a family. So what if your parents are used to seeing your son on major holidays. They are the ones who didn’t invite your husband. Tell them you’re a team now. All 3 of you, or none of you. Not that your husband will want to go now anyway, I certainly wouldn’t!", "YTA \n\nYour husband called them out on their nonsense. Now you bend to ignorance and abandon your husband?", "I'm in shock you think your not TA here!!!", "YTA", "YTA Last year I (50) didn’t go to my parents for Thanksgiving for the first time in my life. My stepdaughter was at her mom’s. My husband had fallen a few weeks before and couldn’t handle the three hour drive. I’m not leaving him at home alone on a holiday.", "YTA. You are married to Phillip. You are supposed to be a team. He is 100% correct. And why is it all his fault?", "How do you think that you are not the ah here?\n\nMy god you are the biggest ah ive seen in this sub for a while\n\nYTA", "YTA & so are your parents.", "YTA\n\nThe fact that you're okay with your family deliberately excluding your husband for a 'family' holiday is offensive. Did you really think it was acceptable that you leave your SO alone on Christmas nonetheless and thought he'd be okay with this🙄 Not to mention, you didn't even ask him on the matter. \n\nOP is seriously tone deaf.", "Although your husband may be dramatic and have issues to work out, he’s still your husband. You, him and Phillip are a family and should celebrate Christmas with each other no matter what. As long as you’re together, if your mother doesn’t include him, you should decline. You are ditching him and making him celebrate Christmas alone.\n\nYTA.", "YTA  \nYour married. Celebrating holidays together. Or at least discuss things before accepting an invitation.", "YTA. A bigger one because you don't have a clue what's wrong with this or you wouldn't be on Reddit asking. Good grief put your husband at the top of your list.", "YTA, in neither of the examples you've given is your husband in the wrong", "YTA. This is your first Christmas together as a married couple, of course he assumed you would spend it with him.\n\nIf they don't invite him for Christmas, then you shouldn't attend until they do. I'm not saying you have to cut off your family, you could take your son over to see them on xmas eve or boxing day instead. But for major holidays like this you can't let them just exclude him. \n\nI understand you've perhaps had a difficult past with relationships, and are clearly wary of being cut off from your family. \n\nIt also seems like you are used to seeing yourself and your son as the main unit in your life. But marrying someone means they become part of that unit. You should no more consider leaving your son alone on Christmas day than leaving your son.", "YTA - I have wonder why the father of your child isn't in the picture. I suspect it's because of you and your family. In this situation you've just hung your husband out to dry twice rather than either trying to mend bridges between him and your family you've started to damage a bridge between you and him.", "YTA \n\n\n\n\nIt doesn't matter that your family doesn't like him. The second you married him the three of you became a family unit. Your family doesn't get to decide to exclude him on major holidays. If it's important to them you can celebrate with them on a different day. \n\n\n\n\n\nAlso FYI: A pediatrician hearing people talk about alternate medicine instead of using real medicine when I child is sick would have had every right to call child services on them depending on the severity of the illness. It can be considered medical neglect. By talking about it in front of him THEY started it. Not him. Every reason you've given that they don't like him is ENTIRELY your family's fault. Your punishing him for being in the right. YTA doubbly for that", "YTA. Yikes. I woulda been on my husbands side regarding the use of medication over natural remedies for children too, that’s just common sense. You guys are married, they can accept both of you (husband and wife) or none of you.", "Major AH you are.  Your husband and your son are your family. How could you be ok with doing what your doing \nYour husband needs to have a serious think about what he's married .", "YTA In the examples you gave, your family was picking arguments, not your husband. Your husband is simply standing up for himself. Something you should support him with.", "YTA. You make your son spend christmas without his dad.", "YTA, come on. Your family is purposely isolating him on a family holiday and you are complicit. He’s a pediatrician, any conversations  about wholistic treatments could’ve been avoided. It almost sounds like they are baiting him. Back him up by refusing the invitation and perhaps you’ll find they’ll be on their best behavior if they want their grandchild around for visits.", "YTA and the fact that you’re trying to rationalize it makes it worse.", "-You made a big decision without involving your partner\n-You are abandoning your partner (who you chose as your family) for your family\n-You allow your family to bully your partner (mainly when your father accused him and what they are currently doing by purposely excluding him from a significant family holiday)\n\n\nYou can't decide your parent's guest list but you can decide whether to go or not\n\nYTA", "Oh course your the AH.   You don’t get to decide who they invite but you don’t have to go.", "Blended families are hard!  \nWhat we do at my house - you \\*agree\\*, as a couple, what is happening and where.  \nYAH, because you accepted this invitation without prior discussion. Hubby might have been fine with it, but he won't be now because you did it without talking about it as a family first. Acknowledge his feelings, make plans as a couple, and THEN you can talk to your mom about seeing her grandchild for the holidays.", "**YTA** for abandoning your husband at Christmas.", "I'm wondering how long the husband's threshold is for being talked down to by his wife's own family and not having the wife's support. Even supporting what her parents are doing to him. \n\nYou seriously need to think very hard of your actions. Put yourself in your husband's shoes and ask if he did this to you, what would be your reaction. How would you feel if you are not getting the support that you need from your husband against his family who has a problem with you.\n\nYTA, btw.", "Huge YTA,", "YTA \nEven though your husband may have issues with your family it doesn’t make it fair to leave him alone on the holidays while you and your son have a good time at your parents.", "YTA - Spouse over parents and siblings, every time. If you can’t put them first, or don’t want to, divorce. Because that’s not a marriage. Absolutely pathetic to put your parents first. Really makes a lot of sense why your ex isn’t in the picture, probably couldn’t wait to get away from someone as toxic as you and your family. (BTW your mom and sister are ignorant, and should listen to the PEDIATRICIAN. Ffs)", "Yta.", "Your behavior is so, so hurtful and I'm honestly shocked that you don't see it, but then you also don't seem to see that your family's behavior has been unacceptable, either. You describe it as him picking fights with them, but as your example you show them saying that their opinions are as valid as the decade of school and all of his experience as a doctor. On top of that, you're excusing the middle school tactic of deliberately leaving him out of a culturally major holiday, and even participate in their antics and defending their right to do it because they've never had Christmas without your child. \n\nYou married this man but refuse to stand up for him against your awful family and think it's acceptable to abandon him at home while you celebrate without him. It sounds like this might not be the only Christmas you spend with your parents; twelve months is plenty of time to have a bad wedding annulled. YTA.", "YTA. a huge one.", "YTA.", "YTA. How is this not obvious?", "So is more important for you that your child spend Christmas with the grandparents than with his father? You are terrible and this smell to divorce", "Listen, I have a very difficult SIL.  However, I would NEVER invite inly my daughter and grandchildren over for a Holiday.   My daughter told me early on, you don’t have to like my Husband, you just have to love me enough to put up with him.  It was the best piece of advice that I have ever gotten and change for the better my relationship with my daughters family.  He is not who I would have chosen for her, but that is her decision to make and she is happy with it.  I love her enough to hold my tongue and be civil to him.  Honestly, once I got over myself, I’ve actually started to appreciate the good qualities that my Daughter sees in him.\n\nA gentle YTA", "Well, the apple did not fall far from the tree. You come from a family of Ahs. No wonder you are one.", "YTA That is your husband. Your family is horrible. There can be differing opinions but cutting your spouse out of a holiday for your family who treats him like that is horrible. You should acknowledge that you have just told your husband he is less important than your family. If I was in his position I would be thinking about leaving the whole issue behind by also becoming your ex.", "Yta\n\nI get it, it is strained.  But you need to tell your family you won't be at Christmas or any other major celebrations if your husband isn't invited.\n\nAlso you need to tell your husband he needs to not argue with people, and you need him to reach out and help the relationship.\n\nBut if you do this you are setting yourself up for divorce.", "YTA. Your headed down the road of having a baby daddy and an ex husband. Good luck getting a third to touch that mess.", "YTA\nI guess your husband doesn't matter to you.\nHe needs to find a wife that care for him.", "Your parents are the assholes in this situation", "YTA!!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\n\nI [F32] I met this wonderful man 'Philip\" [M36] 2 years ago. We got married 4 months ago. For context, I have a 10 yo son \"Billy\" from my previous relationship and my ex isn't in the picture.\n\n\nI have to admit that Philip's relationship with my family isn't so great. They would disagree on a lot of things. For example, he had an argument with my dad when he said that he was keeping their grandson away from them but Philip stated he wasn't and that he couldn't visit with Billy because he had work (I was sick at the time).\n\n\nThe latest argument was what made things worse. My mom and sister were discussing natural remedies (they're into this stuff) for my niece and Philip (he's a pediatrician) called both of them \"ignorant\" for not using meds instead which caused a huge argument and Philip being no longer welcome at my parents house.\n\n\nNow they'd sent me and Billy an invitation for Christmas but did not include Philip which, I expected given how strained their relationship has become. I called my mom to confirm that I'll attend but the minute Philip found out, he went off saying he could not believe I was fine with my family excluding him and then agree to go and leave him behind. I told him it's their celebration and I don't get to decide their guestlist for them. And also, I'm not leaving him behind because we did not have any plans for Christmas. He said he thought that we'd \"automatically\" celebrate together the 3 of us but now I'm taking Billy away from him as well. I thought that was a bit melodramatic because it's literally just few hours at my parents home but he insisted it was about principle and respect. We had a big argument and I said that he basically alienated himself by continually picking arguments with my family, but he started ranting saying it wasn't about the fact that they didn't invite him, but the fact that I was willing to let him spend Christmas alone without me and Billy.\n\n\nWe went back and forth on the issue but do not seem to reach a solution. My parents are used to spending every major holiday with Billy. So you can see how much pressure I'm getting from both sides here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Not only are you wrong about leaving to go spend time with them on Christmas, it sounds like Phillip was in the right with the things he said to them. Your family was being unreasonable/ignorant, Phillip responded accordingly. \n\nYou really need to decide who is more important to you and if you want to have a husband or an ex come next Christmas.", "YTA - Why are you allowing your parents to boundary stomp your husband? And why would you think it’s perfectly okay to leave your partner alone on Christmas? They literally make sad love songs about this. YTA", "Yta\n\nInvite them round to your house, they'll come if they are that desperate to see you and Billy.\n\nIt is rotten of you to leave one person out at Christmas.\n\nHe seems to have taken Billy on as his son too.\n\nThey may be your mum and sister, but they are being dumb with their 'remedies'.  Did they really think a doc would sit and nod to their bs", "“We did not have plans for Christmas” \n\nBoy I’m glad I don’t have to very specifically ask my partner if we’ll be spending the holidays together. \n\nYTA you chose your husband, now he and your son are your immediately family. The rest either accept him or you don’t go. Alternatively, you and your son go on a different day or a different week if it’s so important to you. That’s how 2-household families do it, I think you’d really be okay.", "YTA. Are you seriously considering abandoning your husband to spend Christmas by himself?", "YTA why did you even get married? If this is how you and your family treat him,  I wouldn't make plans for your 1 year anniversary.", "YTA - Watch them divorce papers come through real soon", "YTA Ifeel sorry for Phil and Bill.", "Did you marry your husband or your parents?\nYTA", "YTA- he's a PEDIATRICIAN. He believes in SCIENCE. Especially now the crap medical professionals have had to deal with during covid, and all the people who denounced science in favor of conspiracy theories. While there's nothing wrong with alternative medicines for some things, I can see why an actual Doctor would just have enough and not be able to listen to uneducated, misguided babble which no doubt has made his job much more difficult in the last few years. \nThe fact youre allowing your family to treat him this way is a major 🚩 for him. If I was Billy, I'd run!", "YTA - I don’t agree with your husband being against natural remedies (at least for the non-serious stuff, obviously you can’t cure a broken arm with yarrow), but he really hasn’t done anything wrong here and you’re essentially siding with your family against him. By agreeing to an invite that doesn’t include him, you’re saying that you don’t care if he’s there. Do better with your spouse.", "YTA\n\nYou’re a Family. With your husband. And you decided it’s fair game to spend Christmas with your parents and he can chill on his own?\n\nThe first story sounds like your husband had to work and therefore couldn’t take Billy to them. And the second one is an educated physician telling two “natural remedies” nut jobs that that’s not the right way. And you classify this as him picking fights and not - like it should be - your family being inconsiderate and weird. \n\nNot sure why the guy married you because he has to endure this for the rest of his life now.", "YTA. Well we can all see where your priorities lie and so can Philip evidently. \n\n>I'm taking Billy away from him as well\n\n>For example, he had an argument with my dad when he said that he was keeping their grandson away from them but Philip stated he wasn't and that he couldn't visit with Billy because he had work (I was sick at the time).\n\nAlso weird that you accuse him of being \"melodramatic\", but didn't use the same words to describe your father who stated Philip was \"keeping their grandson away from them\" even though he offered an appropriate compromise for them to see him.\n\nAlso I find it hard to believe that Philip is the only one that \"picks arguements\" but I do believe it is more convenient to blame him in your eyes.", "I see a divorce in the future. YTA", "YTA and so is your family\nSo your father accused Philip of keeping his grandson away when in reality Philip was working and you were sick, then your mother and sister were discussing using natural remedies on a sick child instead of medicine and putting that child at risk or even death (depending on the child sickness) and Philip again gets the hate for speaking up and having common sense.\n\nI hope Philip runs for the hills before he is in to deep.", "Info: Do you even like your husband OP?", "Are you - blind? Like, can you really not see how much of an AH you are? \n\nFirst of, your husband seems to actually and really care and love your child - and you want him to spent Christmas without him and you don’t see a problem with that? \n\nSecond - your dad picked a fight with him about nothing and you didn’t stand up for your husband which makes me think that was normal behavior in your household und you just accepted it as normal. \nIt isn’t. \n\nThird - your mother and sister are not idiots per se depending about what natural remedies we are talking. I give my kids tea when they don’t feel great, but they are getting their vaccines and antibiotics as needed. I never met a ped who was against the way I do it so I guess your mother and SIL are kind of extreme in that case and deserved a wake up call from an actual healthcare professional. \n\nHe is not dramatic, he is a 100% right. I cannot believe you would just say yes to such a legitimately insulting invitation. Of course you have no hand in their guest list - but you have the choice to attend or not if they decide to be hostile. \nAnd you didn’t even think twice about your partner who seems to love you two a lot. Man deserves better and you should do better or I don’t see you being married to him for too long. \nChristmas should be about love and I don’t see that happening here. \n\nYTA if that ain’t clear.", "My widowed mom, who was a very controlling person, did this to my husband once (because she didn't like how he would stand up to her and defend his position on various subjects) and she forbade his presence at all family events at her house, especially Christmas Eve and New Year's Day. How did we handle it? Neither of us went to her house. However, since our kids were tweens and young teens at the time, we allowed them to go. It was their choice and sometimes they went, sometimes they didn't. They loved their Omi but also knew why hubby and I weren't going. It took three years until she relented because I stood with my husband. I knew at the time that I'd be spending the rest of my life with him, not her, so hubby and I stood united and things worked themselves out.\n\nUntil you do the same thing, OP, YTA. And so is your dad.", "I’m sorry you don’t like your husband, but YTA", "YTA \nIt's your first Christmas as a married couple.  Your parents can see Billy either before or after Christmas, but you need to spend Christmas with your spouse.  Period. End of discussion.", "YTA", "YTA\n\nYou're not single anymore, you're married. To Philip. Maybe you forgot?", "Ofc YAH, how does anyone write these things out and think someone will side with them? 🙄", "you chose to start a family with this man. i don’t know why you decided to if you don’t seem to see or treat him as such. i don’t know how you view christmas or even family, but “plans” for christmas are traditionally spending time with your family; first your parents and siblings, and then, when you choose to MARRY someone, with them and your children. it’s pretty simple and self explanatory; it is quite baffling that you seem to be missing this glaringly huge component of what is wrong with your own decision here. additionally, why would you not stick up for your husband, and fight to have him attend? he’s not some boyfriend or even good friend. he’s your husband. the fact that you seemingly shrugged and accepted your family excluding him without saying so much as a word to them about it is bizarre. YTA big time.", "Honestly, everyone but Billy sucks here. Your parents seem to be using him as a pawn, and you’re complicit with their exaggeration of the facts in order to paint your husband as a bad person. Philip could have held his tongue and not called mom and sister “ignorant,” but then again, I also don’t know how long he’s been putting up with this natural remedy crap from them. They seem to be actively trying to bait him, in this scenario, rather than include him by asking something simple like “is there any scientific basis in this?” And now you’re sticking by the people who are, for whatever reason, trying to make him look like an ass. Of course he’s upset. Wouldn’t you be, if his family humiliated you at every opportunity, then acted like you were the problem and squeezed you out of the picture?", "I'm not sure about this one, if you were spending the whole day with them I would understand but visiting for a few hours seems ok. But the examples you've given of why they don't like him definitely make you family seem ignorant maybe you should be standing up more for him.", "Honestly everyone is the AH here\n\n1) your mom is the AH for excluding your husband knowing what a position this puts you in\n2) your husband is AH for picking fights with your family and not understand that you and your son already have well established traditions that are going to take time to change if needed and so yes of course you are going to take your son to your parents for Christmas as that is all he knows\n3) you are the AH for letting it go this far, you shouldn’t be letting your husband picking fights but also shouldn’t be letting them push him aside either\n\n\nHonestly just sounds like everyone needs to grow up in this situation especially if you plan on having kids together", "ESH. Your husband needs to learn how to tone it down a bit, but you’re parents are equally to blame. \n\nYou need to figure out where your priority is in terms of your family, and it sounds like it’s not so much with your husband.", "I’m gonna say NTA. Your husband sounds very arrogant. He can disagree with people but not call them ignorant and start fights. However, I think everyone  should do more to repair the relationship rather than make it worse by alienating your husband.", "ESH.", "ESH. You for not discussing this with your husband, and husband for creating animosity with your family for calling them ignorant.", "Sounds like a peach of a guy. \n\nESH.", "Is this bigger than Christmas? Do you agree with your family regarding these arguments? Are you realizing that your husband is a controlling, argumentative asshole and maybe you shouldn’t have married him? If so you’re still TA. Tell him and move out. If not, you’re definitely TA, for all the reasons others have already have mentioned.", "YTA", "YTA.", "You’re well on your way to being single again lol YTA", "YTA. Your newly formed family comes first. Your relatives brought this on themselves.\n\nHow can you even think of doing this?", "YTA they do not know about a child's health better than a pediatrician, they were being ignorant, he had the child's best interest at heart. Do you even like your husband? I don't think I've ever seen a bio parent complain that the child's stepparent, the bio parent's partner, wants to spend time with the child.", "YTA\nYou are literally choosing your family over your husband for Christmas and you wonder why he's upset?", "Just scrolling down and all I can see is YTA, even though you are. Can't really understand wanting to leave  your husband alone on Christmas.", "YTA you allow your family to treat Phillip like crap. Accepting that invitation means you accept the way they treat him. You are a shitty partner.", "OP. YTA. Your husband couldn’t bring Billy to your folks because husband had to work. Did your folks offer to collect Billy?\n\nIf your husband received an invitation for just him to spend part of Thanksgiving elsewhere and he accepted and let you in your own how would you feel?\n\nWhen you become man and wife you become a duet, a team, a unit. \n\nYour job: put it back to your parents that either all three of you are coming or none of you are.\n\nApologise to husband and let him know you understand your actions were wrong.\n\nTell your parents that they need to be respectful towards your husband for the sake of their grandchild.", "So many ah's in this story I think everyone but Billy", "YTA. Maybe nobody told you, but when you marry somebody, you are choosing them over literally everybody else in your life, forever. The good times and the bad times. You probably took actual vows to this effect (forsaking all others, for better or for worse).\n\nYou have a new family now. It's you, your son, and your husband. You keep using the word \"family\" like your husband isn't in it. If your parents exclude your husband, they should know that they are excluding you too.\n\nWhat do you think would happen if you invited your mom to Christmas but not your dad?\n\nETA: it takes a really special kind of person to turn Christmas into a weapon", "YTA.  He is your husband.  He is your first priority (after your child).  He was understandable appalled at your parents ignorance as far as medicine.  Your parents are excluding your husband and you're ok with this?  It doesn't matter if you don't have any plans. You're enabling your parents and telling your husband that he's not important.  How can you think this is ok?  Do this and I predict you'll be setting a pattern because next year you'll probably be celebrating without him again too...because he won't be there.  Why be with someone who allows others to treat you like shit (and by doing so is acting the exact same way)?", "YT. I can’t believe this man married you and I feel really bad for him", "YTA \n\nYou say your husband is a wonderful man and yet you’ve insulted him and refuse to stand by him basically every damn chance you get. \n\nActions speak louder than words \n\nI see divorce in your future if you don’t get your shut together and out your family in their place", "YTA. You aren’t spending time with your family for Christmas- you are choosing extended family over your nuclear family. You formed a family with Philip when you married him. He comes first.  Not your family of origin.", "YTA. You didn't actually want a partner in life did you? Just a financial security blanket.", "YTA. When you get married, you are supposed to support your spouse and put the first, not in fourth place behind your parents and sister. From what you have said, your family picks arguments with your husband then they, and you blame him. Parents are rude enough to invite you to come but exclude your husband and you are rude enough to accept and defend this arrangement. If you want this marriage to last, you need to start supporting your husband and stop being your parents baby girl.", "Yta\n\nHe's your husband so he's either on your team or you're a crappy wife.\n\nI agree your mom and sister are dumb for not trusting medicine. Did you get the dumb family trait too??\n\nIf your parents can't get over themselves and invite your entire family then you should stay home. If they claim you are keeping your son away from them explain that your son is also part of your family and if they welcome your entire family you'd be happy to spend Christmas with them, otherwise you'll have to visit on a different day since you'll obviously be spending Christmas with your husband....or keep being a bad wife, us on the internet won't care when your husband leaves.", "You already know you're the AH.\nYou didn't need us to tell you.\nYou don't deserve your husband.", "YTA, why did you marry someone you're not going to side with? Did you not have that shit in your vows? I hope he leaves you. I'm sure your family will find a natural remedy for the hurt.", "YTA. Sounds like you’re gonna find divorce papers under the tree this year.", "Sounds like your Dad and Husband are very much alike. To be honest. Also your parents don’t fully see you as a married adult but still as an adult child.  \n\nFirst your husband needs to apologize for the ignorant comment NOW!!  Homeopathic remedies can worth with Western medicine (I am the daughter of a Pediatrician who knew that there can be benefits).  Just because he is a MD doesn’t mean he knows it all …. As my Dad would say “We may have our degree but we PRACTICE every day to learn new things”\n\nSecond YOU need to flat out tell your parents that if you are work and DH is working (or even on call) neither of you can’t just drop things to bring DS to them for a visit. If they “need” the visit so bad, they can call you and ask you if they can pick up DS. They need to realize that your household/family dynamics have changed and therefore they will need to adjust to them without acting like spoiled children. Which is what your Dad did. You also need to tell them DH is not keeping their GS from them so they need to stop with this childish behavior and apologize for that comment. \n\n Now for Christmas if you want your marriage to survive you do have to show solidarity.  This is also your first Christmas together.  You need to start some traditions and be your own little family.  With that said you two need to sit down now and figure out Holidays, especially since your son is older and deserves to continue traditions that bring him comfort/consistency as well.  \n\nYou also need to tell your parents that your family now includes DH so if he isn’t welcomed at a family event then you will be declining the invite this year.  If they bring up the ignorant comment - remind them that your father disrespected your husband previously as well and that  two wrongs don’t make a right.  \nAlso let them know that you are a married couple and you will not allow people to be disrespectful to your husband.  \n\nGood luck", "YTA, They knew you would choose to bail on your hubby for them and you did.", "YTA.\n\nWhy you married him or are staying with him when you obviously don't want that is beyond me. Oh, and your family suck too for excluding him and putting you in this situation. I can bet you they did that on purpose hoping to create a crisis in your relationship as they know you don't support him. \nAnd them using a child as a pawn? Shame on those evil AHs. Shame on them!", "YTA - assumed you have no plans for Christmas? Is that how little of a ‘family’ you see your husband? Your family ARE ignorant and petty but somehow you pin it on your husband instead of holding them responsible? And you call him melodramatic but let’s see how you’ll be once he realises he can do better and find an actual supportive partner.", "Assuming this is real you are absolutely TA.  Absolutely.  You are going to leave your husband alone on Christmas and you allowed your family to exclude him in the first place.  Enjoy your next divorce because that’s where this is heading.", "YTA- did you even go back and read what you wrote before you submitted this post? Put yourself in your husband’s place and think about how you would feel? Add to the fact the abuse that medical professionals dealt with all the idiots during Covid and now your family spouting off woohoo healing remedies and holding his educated response against him. It’s sad that you thought not spending the holiday with him would be okay.", "YTA. \n\nOf course they are entitled to invite, and not invite, who they want. BUT in this case you don't go either. He is your family now, so act like it. \n\nAnd you're accusing HIM of being melodramatic when your whole family is pulling a hissy fit. And the interpretation of him keeping their grandchild away from them, when in fact he was working?? \n\nThat poor man.", "YTA - All you had to  do was 1) discuss the situation with him first to get his input into the decision and, if he was rightly offended, 2) decline the invitation because he is your family now and family shouldn’t be excluded at Christmas. Keep treating your partner like this and he will get the message and leave. I fear your son will be the most negatively impacted if your behaviour continues.", "YTA. Philip and Billy are your primary family now, not your parents. \n\nAnd your parents are driving a wedge in your marriage, while you hang back and play innocent. \n\nYou are on the express route to divorce. \n\nPhilip is a grown adult, he's not going to play second fiddle to your mommy and daddy.", "YTA no need to elaborate as everyone else has done a pretty good job of pointing out the reasons why.", "YTA.  Don’t worry about future Christmases.  You won’t be married long enough to worry about it.  Feel sorry for the kid though.  Sounds like he has a good man in his life.  He’ll be devastated to lose him.", "YTA.\n\nI hope \"Philip\" realizes this marriage is Doomed and gets out fast.", "YTA\n\nYour whole family is so dramatic your husband is spending Christmas alone?", "Stay home for Christmas. Exclude your dad and watch the fallout. You'll  have your answer.", "YTA - Your husband has been right about everything with your family, including this situation. Your family is toxic and you’re putting them above Philip, your husband that you claim to love so much.", "YTA for saying yes to the invitation knowing full well that your husband is excluded. You’re also condoning their views of him.", "YTA.\n\nYour husband has been treated so poorly by your father, mother and sister.  Perhaps if you had his back the first time it would have sent a clear message to your family not to disrespect him. \n\nNot only has he become a husband but has taken on the role of father to your son.  What a great man to do that. \n\nIt's your first married Christmas together.  The fact you would consider leaving him alone whilst you go to your parents house speaks volumes and I don't hold out much hope in your marriage surviving long term.  \n\nTo reiterate,  your most definitely are the a hole.", "YTA. In your examples your husband did literally nothing wrong. He couldn’t take your son due to work - a perfectly understandable reason (for sane people) - and he a medically trained doctor, who specialises in children’s health, is hardly going to standby and not say something to anyone suggesting essential oils and all that shite is going to help an illness that modern medicine can help. \n\nThe fact you’re letting your parents shit on him, and you’re perfectly fine with leaving him behind says an awful lot about you. I don’t think this marriage is going to last.", "YTA you’re too concerned with your parents spending the holidays with your son instead of your husband. Good job being a shitty wife.", "YTA. You didn't even talk through it with him or Acomb to any compromise. You are selfish and self centered. Your family is also crazy and you are just enabling them. If the roles were reversed, what would you do? Would you agave liked to be left alone at Xmas while he goes to see his family with his child? You married this man and he needs to come first, before your mom and dad and sister.", "YTA big time. You should be with your husband, you know, your family. And mad at your mom& dad for being divisive. I can't believe you have to be told this. Look out single motherhood her you come", "Your husband was busy with work, as he’s a paediatrician, and that upset your family. Your husband, the paediatrician, advocated for the use of meds because he studied for plenty of years about this stuff and that upset your family. Now he’s being left out of your family’s Christmas celebration and you were cool with that. If I were him, I’d be second guessing being married to you. Sounds like you haven’t once stood up for him. You just let your family treat him however they want. YTA", "Yta. You married this man and took a vow to spend your life with him, not your family. How would you feel if this was reversed ? How would you feel if his parents got everyone presents but your son? Bet they don't do that, your parents shouldn't either. \"It's just a few hours at their house it shouldn't be a big deal\" then it shouldn't be a big deal to invite YOUR HUSBAND.", "YTA. It's always a shame when someone has to choose who means more to them, spouse or parents. Ideally you don't let that happen. But you just let your husband know in no uncertain terms that your relationship with your parents is more important to you than your relationship with him. What he does with that knowledge is up to him.", "YTA. Do you even like the man you married?", "YTA. Your husband is right on ALL fronts and your family picked those fights, not him. Natural remedy, not keeping his step-son from them and you being an ass with xmass. How do you feel leaving the love of your life at home alone at xmass \"cause you did not have any plans.\" keep it up and you wont have to worry about this once he kicks your ass to the curb.", "YTA \nAll of these examples of why they hate him are off the chart.\nHe had valid reasons. VALID!", "YTA- my husband and I have no kids together, first Christmas together my father got all the grandkids gifts except my stepson, there were gifts from both my parents together, told my mother we wouldn't be back next year if that was going to be the case the next year he got all the kids a box of sticks and he looked dead at my husband while handing them to my stepson guess where we didn't go for Christmas the next year. You are a family now. Two become one. A family. A unit. Everything done for each other.", "YTA, the 2 arguments you decided to pick are actually incredibly reasonable. You were sick, he was the only one able to drive the kid and i guess hour parents are on too high of a horse to drive over to see their precious grandchild. Then you have your mom and sister go one about what, essential oils and herbs? In front of a literal doctor? That stuff can work for maybe mild stuff, like a cold, vut your hubs was right i it was anything more serious. \n\nYou're choosing to alienate your husband because at the end of the day, he was objectively in the right on a couple of arguments and you're parents are just pouty children. I lost an argument, let me ban my daughter's spouse! I don't see this marriage lasting long if you never back your spouse or think about them for the holidays.", "YTA Your family dynamic changed when you got married. It's no longer just you and your son, free to spend every holiday with your family. Once you got married, you, your husband and son became a new family unit. Your parents can no longer expect to have their grandson every holiday especially if your family excluded your husband. \n\nYou owe your husband an apology and you need to tell your parents you are no longer coming over for Christmas. Married couples need to present an united front.", "YTA", "YTA. After the way they've behaved, why is it you care what your parents are used to or want? Of course families (as in parents and young kids) automatically expect to spend Christmas together.  What do you mean you \"had no plans\"? So mental.", "Yta!", "YTA and I hope your husband sees the light and gets some divorce papers ready.", "Notice how op is silent through all of this. I hope your listening. Have some empathy for your husband. You choose him when you married him.", "YTA- Your husband comes first. \n\nYour parents arent happy that you have someone else in your life that has a major role. If hubby isn’t invited I wouldn’t go. If you start ignoring what he has to say and leave him on a major holiday your marriage will be over.", "YTA. Your husband is right. If your husband doesn't go, you don't go.", "YTA", "YTA. \n\nThe first argument was due to your husband working and your dad being overly sensitive. \n\nThe second argument was something that your husband has to deal with on a daily basis and has most likely seen some horrific illness caused by parents thinking natural remedies are better than medically prescribed medications. \n\nNow your parents are alienating HIM and you’re siding with them. I’m not sure if you’re scared of your family or just plain blind to them pushing him away but they are getting everything they want and he’s the one missing out because of you.", "Your husband is your next of kin. Why you not only did not take his side, but actually undermined him in front of the rest of your family is inexplicable.", "YTA", "YTA. Apparently the apple didn't fall far from the tree.", "YTA, why marry him if your parents are always the priority? If you can’t see plainly how wrong you are in this situation there’s nothing Reddit can do to fix you.", "Yta. Jfc I can't see why he stays with you. If your parents were so desperate to see your son when you were ill, why didn't they come to your house with their lotions and potions to make you better? I truly can't work out why you think spending Christmas with your parents comes before your husband. Are they so controlling you no longer have a mind of your own?", "YTA you are newly wed, to man willing to take on and support your child and you are going to make him spend Christmas alone.  Do not be surprised when he files for annulment, not just divorce!", "YTA. You accepted an invitation to Christmas at your parents that did not include your husband. You didn't bat an eye about him not being there. Your husband did not even know about the invitation before you accepted.  How did you expect him to feel? \n\nYour parents expect you to be there. Pretty sure your husband expects you to be there for him too! And he's your family now.", "No. I don't see the pressure you are under. You are being a horrible wife and setting a nasty example for your child in the process. \n\nHe is your husband, you should be spending Christmas together. And if *your parents* want to keep picking petty fights and alienating your husband, then it is your responsibility to put your food down and stand with him. \n\nThey don't want your whole *family* at their *family celebration*, then you don't go. \n\nWho cares if they don't get to see your son. That was their own choice by not inviting his stepfather, too.\n\n YTA do better.", "yta but my question is do you love your husband at all or were you just looking for a secure dad for your kid?", "YTA \n\nYour dad acted immaturely and you didn't defend husband. \n\nYour mother's \"natural remedies\" probably are hogwash. If they worked, modern medicine wouldn't need to exist, would it? Your husband is a medical professional for crying out loud. \nDid he name call them to their face? If so, that was a bit rude, but still... someone who knows what they're talking about can usually only handle SO much ignorance before they snap. \n\nAnd yeah, he was 100% in the right to just assume you 3 would be spending Christmas together. You're a family now. It's a family holiday. Did you need a formal invite from your husband? Sheesh. \n\nTell your family your husband is coming, or nobody is coming.", "INFO: Who does Billy want to spend Christmas with?", "Yta your husband was right in an argument about the care of a child so your parents are mad. You then decide to take your parents side instead of saying I’m sorry we won’t be coming for Christmas because we are a family unit and you didn’t include my husband. That would be the correct response.", "Shame on you, you let your family bully your husband be a better wife. YTA", "YTA for reasons that all the other YTA judgements have stated.", "Omg the worst part is you’re completely oblivious to how awful you are. Your husband has done nothing wrong. Your family sounds crazy and you should be defending your husband. YTA, obviously.", "YTA. Why did you marry this man if you are already married to your parents?", "Yta.  Although I am super curious to know what the home remedy was?  That could (but doubtly) make a slight difference. Not ALL home remedies are evil.  For example, honey for a sore throat is a home remedy.  I think we all agree, if the child is older than 1, this is safe.  But something like cannabis for anxiety for a child is obviously worth arguing.", "YTA and maybe be prepared to be without a husband sooner than later if you keep this up.", "YTA.  I'm going to go out on a limb here and say being married to someone means Christmas together is implied.\n\nYour family sound like petulant children.  To invite you and your child but not your spouse in the absence of a legitimatly serious reason is ridiculous. \n\nIt's hard to know from what you've written what's actually going on.  But if you are married to someone, you don't leave them out of family stuff -- it's kind of what being married means. \n\nAsk yourself - is it only your family he has so much trouble getting along with?  Might give you a clue.", "YTA and I guarantee this will be first and last Christmas with husband.  Your family are AHs and to exclude him is just confirming that.  For you to join them and leave your husband shows you clearly don’t deserve him and you’re a lousy wife and partner", "YTA. You’re going to end up the AH and divorced if you keep it up.", "YTA. Nuclear family has to stick together. If husband not invited, no one goes.", "Massive AH, you are choosing your rude parents over your husband. \nShame on you", "YTA go apologize to your husband and make him feel respected and loved. Otherwise, you run the risk of him serving divorce papers on Christmas.", "YTA", "And because everyone is calling her out, I bet OP won’t come back and comment. YTA x 1000", "YTA. But hey 4 months is no that much, I'm sure the divorce will be painless.", "Yta", "Seems like you married another wrong dude. Reevaluate your taste in men and what you really want in a relationship.", "INFO - Why did your dad expect his new son in law to take off work to bring his daughter's (your) son to visit?  Why didn't you take him? If you didn't take him then because you couldn't go as a family, why is it ok now?\n\nDoes your family know he is a pediatrician?  Why are you standing there while they clearly bate him?", "YTA. You can’t choose the family you’re born into, but you can choose the one you make with a partner. He has every reason to expect you’d be spending the holidays together as a new family of three, not to mention that you’d stand up for him, when you chose him. What your family thinks of him is their problem - how he feels is yours. \n\n\nDon’t call him a “wonderful man” and treat him like shit. He sounds like a better husband and father than you do a wife and mother (seriously, that natural remedy stuff is dangerous and they need to be called out, and they aren’t entitled to time with your son). Apologize before he realizes this or your parents will be your only Christmas option.", "INFO: the one example you gave about I'm assuming he's your dad, why couldn't your dad see your son while your husband was at work? I agree with others that you should stand by your husband and not go to your parents house without him, but I'm honestly getting the impression that you agree with your family about your husband.", "YTA!", "ESH you should have talked to your family about getting over grudges for the holidays as he is your husband and you should be spending the holidays as a family, you seem very used to it being just you and your son and need to understand there is a whole other person there you need to talk to. Your parents and your husband are AH for picking the fights they have and not being adult enough to put them aside. Your husband doesn’t have to like that your mom and sis are in to natural remedies but he didn’t have to call them idiots. Your dad didn’t need to pick a fight with your husband while you were sick and he had to work. Your family also seem used to things being just you and your son and they need to register there is another adult not them that is now in your sons life", "You married him. HE is your immediate family now. Your parents are extended family. The fact that you are choosing extended family over immediate shows that you are not even mature enough to be married in the first place. AND you let your parent treat your husband like shit, then abandon him on Christmas to he with these people. You are a MAJOR AH", "YTA. Why do you think it is perfectly acceptable for YOUR husband and in your own words \"wonderful man\" to be excluded from the celebrations simply because he had an argument with your parents about a topic he has more knowledge in? You have just shown where he lies in your priorities and once you do return from the house I hope you see divorce papers waiting for you as a Christmas present.", "YTA and your family is nuts", "YTA - You decline invitations that exclude family members or at least talk with the excluded person before giving an answer.", "YTA he and billy are your family. Your parents sound awful. Grow a spine.", "YTA. You let your parents continually treat your new husband poorly. Keep this up and I doubt he'll be an issue for you next year.", "YTA. So your family - who I’m certain are not even in the ballpark of being pediatricians - are trying to act like experts in the field of medicating children. They think they’re smarter than an. actual. Pediatrician. \n\nI’ve learned so much from your post. I guess this is how cycles (alcoholism, abuse, in this case bonkers-ism) go through generations. Daughter finds someone sensible, family drives them away because they aren’t bonkers like them so don’t fit in. Leaving the only person a daughter can find that fits is someone exactly like them. \n\nFor goodness sake go apologize to your husband and spend Christmas with him.", "Complicated. Philip couldnt make time for them and belittles their beliefs. Pick your battles. Basil isnt going to hurt. And you will get over a cold without cough medicine. But i would also assume my wife and child are celebrating christmas with me regardless of plans. However if your say, going to their house for a few hours to exchange gifts. It is what it is that hes not invited. Personally id be bringing him along in an assumed manner. But i feel like i can empathize on how thats clearly just asking for a fight one way or the other. Realistically to me. Christmas is for children. In the way that my focus is on making sure they have good memories. I think your family and philip should put their shit aside for one freaking day of the year atleast.", "Are you sure Philip is the problem? Your Dad was angry your husband, who is a pediatrician during an ongoing pandemic, didn't have the time to drop Billy over while you were ill because he was working. Why couldn't your Dad pick up Billy? Maybe he shouldn't have called them ignorant, but is Philip an AH for getting exasperated at your Mum & sister when his day job involves watching babies get severely ill from preventable illnesses? From parents who take the holistic over medicine mindset way too far? Is Philip the AH for assuming his wife would want to spend her 1st Christmas as a married couple with him? Is he the AH in being shocked & hurt you made separate plans for you & your child like he's a boyfriend who hasn't yet moved in? Doesn't marriage make your husband your immediate family, not your parents?\n\nIt sounds like you have normalised a dynamic where your family says 'jump' you say 'how high'. Your Husband has provided the most minimal pushback to this dynamic - refusing to leave work to drive Billy over when they say, not blindly agreeing with them - and your family is freezing him out. And you are more than happy to help by leaving your husband alone on Christmas instead of sending Billy over by himself or spending Christmas as a family of 3 and visiting them on Christmas Eve/Boxing Day. I recommend you read the post Don't Rock the Boat. For some reason you seem scared of saying No to your parents even jeopardising your marriage for them. YTA\n\n\n  [Don't Rock the Boat](\nhttps://www.reddit.com/r/JUSTNOMIL/comments/77pxpo/dont_rock_the_boat/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)", "Honestly op divorce him immediately for the way he spoke to your mom and sister, they’re entitled to believe in natural remedies rather than big pharma medication. Doctors are paid to push their crap and people stupidly accept it", "YTA. And a less than great wife. Why bother getting married when you’re basically married to your family?", "I have nothing really to add to all the other comments here but I couldn’t scroll on by without telling you that YTA. I’m so sorry for Philip and for Billy.", "YTA. Everyone else explained why.", "Yta \n\nYour husband isn’t picking fights your parents are. How would you feel if your husband went somewhere you were excluded and left you home alone on Christmas?", "YTA\n\nThere’s always stuff left out of these.  But “your family” losing arguments they started and then being petty about it?  Both sides are not the same as you’ve described them.\n\nYour hubby is right.  Again.  Married couples spend the holidays together by default, and he should be involved in any discussion that changes that.  Your parents are now extended family and while important, should take a back seat.\n\nThe real AH move here, is you not standing up for your hubby.  Once you agreed to go without him without discussing it, it’s not THEM excluding him, it’s you.\n\nGet a spine.", "Oh major YTA.\n\n\"A couple of hours of the day\", uh, would you be okay if, say, your best friend didn't invite you to their wedding? Or your sibling didn't invite you to their birthday celebration? Or coworkers didn't invite you to an afterwork get together? I mean they are just a couple of hours out of your day! Philip is right, it is about respect, and you have shown that you have very little of that for him.\n\nYour parents sound kind of wacky. I respect Philip for giving them honest advice as a doctor, maybe he didn't put it as diplomatically as could be, at least he cares. Sorry, \"cared\".", "YTA \n\nI can’t believe you see nothing wrong with wanting to skip Christmas with your husband.  This is your husband!  You need to defend him to your family instead of picking their side when he’s clearly done NOTHING wrong. \nHe’s a medical professional with a doctorate degree, you don’t think he’s going to educate on medicine that actually works?  \nYou’re family is jealous of him & that’s why they pick arguments with him. If you don’t defend your husband to your super shallow family I wouldn’t be surprised if you get divorce papers for Christmas.", "Yta", "YTA.\n\nAnd you better straighten up before your husband leaves you. Your family sound like assholes.", "YTA. I smell divorce in the near future", "yEs bUT tHEy aRe fAMiLy...\nYou are definitely the AH", "YTA. This wonderful man should divorce you and find a partner who isn’t so terrible.", "NTA he should chill out and stop picking fights with your family nobody ever changes anyone’s mind by calling somebody ignorant.", "You’re absolutely TA! You have no backbone to defend you husband from you family’s BS. You didn’t stick up for him when they accused him of keeping your son away from them because you were sick and he had to Work; then he spent time get a degree as a pediatrician and instead of defending or at least acknowledging that he knows that he’s talking about in the conversation about your niece, you did absolutely nothing. Even worse, you see nothing wrong with leaving him alone in Christmas and going to your parents, who don’t like him for really no reason at all other than being outspoken. Why’d you even get married?? You should be defending him against your parents stupidity, and putting your foot down that if he is not welcome, then you’re not coming either. Your husband has done nothing wrong but disagree with them and you’re perfectly ok with ditching him on Christmas. That’s pretty fucked up! Don’t be surprised when you’re divorced soon and living back with your parents", "You started with Philip being a wonderful man, but then you decided to not defend him.\n\n1: No one should skip work to take a child to see grandparents.\n\n2: He is a pediatrician. I’m sure he saw what ‘natural remedies’ can do to a sick person. Yes, your mother and sister are ignorant, and so are you for not supporting your husband.\n\n3: You got married 4 months ago, yet you managed to dismiss Philip and his feelings.\n\nWhere were you during these arguments? If you stayed silent, you were supporting your parents.\n\nApologize to your husband. Tell your parents that you and Billy are not coming to Christmas since your husband is not invited. \n\nYour parents need to back off out of your marriage. Don’t allow them to draw a wedge between you and your husband… assuming you want to stay married.\n\nYTA", "YTA", "YTA.  I imagine you've been single for a long time and your family has been your sole support system.  It seems that you don't have the faintest idea of what it means to be a partner and spouse.  It seems that your parents and family don't like this man for no other reason then how dare he marry you and make you less dependent on them.\n\nHE didn't start the argument with your father.  Your father was a moron.  Your family discussing \"natural\" remedies for a child in front of a pediatrician are completely ignorant for both doing so, and for thinking they know better than educated and trained doctors.  You don't make \"plans\" with your spouse for Christmas and for not having your husband's back EVER you are a Supreme AH.\n\nAs others have said, smarten up and do it fast or you'll be back to being a single mom very very quickly because no one is putting up with that crap.", "I-N-F-O: because of this part \n\n“I called my mom to confirm that I’ll attend but the minute Philip found out…”\n\nWhen exactly were you planning to spring this on your husband? Before Christmas? Christmas morning? \n\nI mean, totally YTA, but I mean, you didn’t even talk about what you as a couple were doing for Christmas before you made plans without him?", "YTA\n\nYou decided to abound your husband at Christmas to visit family who disrespect your marriage and expect you to chose between them and him. Your husband deserves apology from your family and you.\n\nBTW, you should think why are you in this relationship and are you ready for such a big commitment as marriage. So far you are actively sabotaging it and your family is very supportive of your destructive actions.", "YTA. Sorry, but if it was the other way round I’m sure you would be offended about the exclusion - *couple hours* or not! It’s Christmas Day for goodness sake, what’s he going to do? Twiddle his thumbs at home **on his own** whilst you’re jollying it up? \n\nDon’t let this be the beginning of the end of your marriage because all these supposedly small things **do** add up and am sure he’s reevaluating his position in your life (i.e. last place). If you press ahead, I’m sure he can get a nice shift at work instead, then more and more shifts so he doesn’t have to see you both much either.", "Yes YTA.  Ummm the default is to spend Christmas with your family - in your case that's your husband and your child, which trumps your childhood family.  That's the normal default. And then as a family you and your husband are supposed to agree what you'll do on the day - whether you'll have lunch with some relatives, or a catch up later in the day with other relatives... You haven't been married very long to already be wanting to do Christmas separately!", "STAND UP FOR YOUR HUSBAND!  How would you feel if the roles were reversed?  You are an ass.  But you got it honestly.  Look at your parents.", "YTA. I hoped you like being a single mum because you are doing everything you can be put right back there. You better get on team husband, who has done nothing wrong and start sticking up for him or you’ll be getting divorced for Christmas.", "This relationship sounds doomed", "OP, now read it and think someone else wrote it and you will see you are 10000000% TA!", "I'm going to flip this around because I can't understand why everyone is saying YTA. I think NTA because he wouldn't want to go to your parents anyways and they love to see their grandson. I think in such an early relationship and he's already fighting with your family rather than keeping opinions to himself or wording them in a way he doesn't come across pig headed or arrogant. Now that he's not welcome does that mean your son not his is not allowed to see his grandparents ever again? He sounds like he is trying to alienate you so just keep an eye on that.", "YTA. Your father expected your husband to skip work to bring hisn grandson for a visit? Your anti-vaxxer mother and sister got corrected by a pediatrician, and now the pediatrician is no longer welcome at their house? Then only you and your son were invited to Christmas, which you expected because your mother is crazy, and you're OK with that? I'm sensing a pattern here and wondering if that's the reason your ex isn't in the picture anymore.", "So, basically you don’t want to spend Christmas with your husband. \nHe has every right to be upset, I’d be fuming if my partner was just like, no your going to be alone for Christmas, I’m leaving. \nYou are a bad wife.", "YTA. Not for accepting their invitation but for not discussing it with your husband first. I mean, it was uncalled for for your husband to call your mom and sister \"ignorant\" (unless there's more to that particular exchange than you detailed), but if I recently married someone and they made social plans for a major holiday without consulting me first I would 100% feel slighted and offended. I would also have assumed, like he did, that we were automatically going to spend it together in some shape or form. If you had brought up the issue with him when you received the invite, do you think he would have been open to the idea of you and your son spending part of the holiday with him and part of it with your folks?", "YTA. You found someone who loves your son, is a good provider, is smart and sane but you’re willing to throw that away because your mom and sister are into “healing remedies” and because your dad has a big ego. You’re an idiot for not standing up for your family", "YES! You are…\n\nFirst, you should stick up for your husband with your parents.  Why didn’t YOU explain that you guys couldn’t visit because you were sick?\n\nAnd the moment your family said that he wasn’t welcome and wasn’t invited to Christmas, then you should have declined and said that if they cannot accept your HUSBAND then they cannot accept you either. \n\nThem not getting to see Billy in on THEM for not getting along with your husband. To keep him from family stuff over a silly disagreement seems radically unreasonable. Why is it just on HIM to keep the peace?  \n\nYour husband is spot on. You are leaving him ALONE on Christmas Day. You didn’t even DISCUSS it with him when you accepted, which again, is dumbfounding that you would even CONSIDER going if your husband isn’t invited. \n\nSeriously, WTH, woman?", "YTA\n\nIf they are excluding him, you should have his back. ESPECIALLY since he hasn't done anything wrong.", "Why did he marry you?   \nWhat does he get out of his relationship with you?  \n\nWhy would you not automatically spend Christmas together? \n\nDo you care for him and his feelings in any way at all?  \nYTA", "Let's recap.\n\n1) Your dad gives Philip shit for not visiting with Billy at a time Philip was working\n\n2) Your family gets offended when Philip, who only spent like a decade of his life and tens of thousands of dollars becoming an expert, tries to educate them about proper medical care for your niece\n\nHow are either of these things Philip's fault?\n\nAnd now you're ditching him at Christmas? What, is he just going to spend Christmas by himself at home, and he's supposed to be OK with that? What the hell kind of person chooses to alienate their husband on a major family holiday? Do you even like this man?\n\nYTA.", "YTA - I bet your poor husband is wondering why the hell he married you. And if he is if no importance to you, as you don’t think leaving him home alone on Christmas like a bad puppy isn’t a problem, why did you marry him? Do you view him as a husband or a wallet? How can you even ask? You are a major AH don’t be surprised if you start the New Year with a divorce.", "YTA - you don’t have your husband’s back.  Why did you even marry him?", "YTA.. I’m in shock your HUSBAND has to make official plans with you so you will spend Christmas with him. I understand your parents are used to seeing your son on all major holidays but you are married now. Your husband and son comes before your parents. You are are supposed to be a team, have his back and just be a family in every sense of the word. \nIf you truly leave your husband at home on Christmas alone you will be divorced by next Christmas.", "So your 1st Christmas with your husband of less than 6 months, \n\nyour husbands 1st Christmas with his stepson of less than 6 months,\n\nAnd you can't see why leaving him on his own to go and see your horrible and quite frankly ignorant family might be upsetting?\n\nIt might only be for a few hours but why not at least tell them if your whole family is not welcome on Christmas day then they need to remind themselves what the spirit of Christmas is about.\n\nYTA btw", "Unequivocally YTA", "NTA, your husband is melodramatic", "I'm gonna be in the minority here but NTA. Phillip made his bed when he kept picking fights. Did he expect you wouldn't  see your parents at Christmas? If it really is just for a few hours, that seems reasonable", "I’m going against the grain here .. NTA\nSounds to me like your family and your husband are mutually shitty to each other so it’s understandable that they don’t want to spend the holidays together. However it’s your family, and Billy’s family, and why should you two not get to spend your holidays as you normally do because the other adults in your life can’t learn to get along. \n\nAnd as mentioned, it’s only a few hours. Tell Philip to take a nap and you’ll be be back later. \n\nWhile you’re at Christmas feel free to remind your family that you’re married and Philip is here to stay so out of respect for you they should try to at least be civil with him.", "ESH but your husband is probably the least AH of anyone. He's a 36 year old doctor and he is getting into arguments with your family which he shouldn't do but it sounds like they are trying to bait him into it. They then go a step further and banish him from family holiday celebrations. Your family sucks.\n\nYou then don't communicate with him at all and make plans that don't include him. That sounds a lot like abandoning someone. You also blame him for your family winding him up but at no point have you mentioned trying to stand up for him. As best I can tell you've just left him and sided with your family.", "Kinda difficult your dad shouldn’t have picked a fight and your husband shouldn’t have called your mom and sister ignorant and butted into their convo. \n\nYea i’ll admit your a bit of an AH for going to spend christmas with your side but your parents are used to spending holidays with you and your son. Your husband should apologize and respect everyones views instead of shoving the use of meds down your mom and sisters throats. I’m a medical assistant and i don’t push meds if certain things work to heal the body by all means use them. \n\nDoesn’t he have family he can spend christmas with? Spouses need time apart but if he really wants to attend christmas at your parents he need to apologize to your family or tell him your just going for dinner. He’s a big boy and can fend for himself can’t he?", "Looks like Ops getting divorce papers for xmas, I know I wouldn’t stand for this, I can’t imagine her husband will", "OP is soon going to have two exes that \"aren't in the picture.\"", "Perhaps it's a marriage of (financial) convenience. They've only been married for 4 months and she's accepted Christmas plans without discussing it with her husband. If her husband isn't working that day then it's normal to assume they'd spend the day together as a family.", "KFC's 11 herbs and spices?!!  Classic!!  😂😄🤣", "Lmaooo not herbs and spices", "I was gonna say oregano oil and garlic lol\n\n\n\n\nI had a friend who was into these ridiculous natural remedies and it was honestly embarrassing for her.", "I agree. Most \"naturalists\" really are ignorant, YTA.", "Love that we get what the husband said \"ignorant\" but not what the mother / sister said. I'm a nurse and Ive had many of these conversations and it takes a LOT to lose your cool to get to that point - especially a pediatrician. \n\nYTA ten times over. I actually feel bad for your husband, as you seem to have zero empathy for him. This 'wonderful man' (as you say) deserves better.", "Maybe mum can calm the situation down with some lavender oil", "I literally could not agree more!", "This! How can she not see that she’s choosing her family over him and leaving him alone on Christmas??? Your family sucks and I hope you come to your senses and start taking Philip’s side before your crap family is all you have left. YTA", "Watch the family asking for help when one of them gets seriously sick. Bet husband is good enough then.", "[deleted]", "It depends what they mean by natural healing. If it’s essential oils & that crap then it’s mostly garbage but if they mean like not over medicating & using more natural methods like a cool cloth on a fever over medication than they have a point. IMO, mild illnesses don’t always need meds & common sense home remedies can be more effective.", "I hope he leaves. What does his having to work have to do with a 10-year-old seeing his grandfather.? Isolation red flags all over the place. NTA", "He’s the asshole for the way he spoke to her mom and sister. just because he’s a doctor does NOT give him the right to criticize their beliefs, I know doctors who recommend natural remedies first not everyone has to support big pharma", "Exactly, if they don’t explicitly “make plans” for Mother’s Day or her birthday, I say he completely ignores it", "Let’s be real, it’s probably the last Christmas as a married couple as well..\n\nAlso why tf wasn’t OP backing up her husband over the medicinal argument?", "I totally missed the part about this being their first Christmas together.  Wow, poor Phillip for being stuck in this mess.", "Asking the real questions here! Edit: yta", "I mean every common cold doesn’t need medicine. He’s literally going out of his way to start shit when there’s no need", "Let’s state the obvious: OP’s family hates her husband because he’s not a doormat, and they are purposely trying to exclude him. That’s classic bullying behavior. OP is perpetuating the bullying.", "To be fair, Christmas is still over a month away so I do understand them not having talked about it quite yet. In my family it was usually right after Thanksgiving that we’d all start talking about Christmas plans. Plus, why didn’t she open up a conversation about it? I’d like to know why she just decided that bc he didn’t say anything that obviously meant he didn’t have any plans? Her receiving her mom’s invitation was the perfect time for her to say to her husband “hey what are we doing for Christmas this year?”.\n\nI can excuse her for calling her mom right after getting the invite to Christmas to verify that her husband was not included, but that is where my understanding stops. \n\nThe fact that she didn’t even have a conversation with her husband before accepting the invitation just flabbergasted me. Personally I would’ve either flat out declined it or told mom that it’s either all 3 of us or none of us are coming & if it’s all 3 of us I expect you, dad & sis to be on your best behavior bc if I hear 1 snide comment or see 1 rude look we are leaving right then & there. \n\nYTA.", "‘Witch doctor family’ 😂", "Right. I have never “made plans” with my nuclear family for holidays. We spend holidays together. That is the automatic implied plans for every holiday.", "Because it’s literally his fault he can’t go. He’s deliberately gone out of his way to start shit. Who thinks it’s okay to call son ignorant in their own home. Philip sounds like an ass so no one wants to be around him. Maybe he should try apologizing for being an ass", "I could not have said it better myself. It’s their first Christmas together and she is going to just leave her husband alone for the holiday. \nWhen you marry the family you created comes first period.", "I'm kinda wondering if it wasn't a matter of a single mom bagging doctor. He seems to treat her and Billy great so why else would you want to not spend a major holiday with your husband especially your first one as a family.", "It doesn't bother them at all.  Hasn't realized or doesn't care that her family is driving a wedge between them, and is now actively participating in their scheme.  Doesn't take his side when the father picks a b.s. reason to start an argument.  Again, doesn't take his side when mom and sister decide that bringing up natural remedies in front of him was a reasonable conversation.  (Probably, they knew that what they were doing, disrespecting his profession.)  Now, they've invited all but him to celebrate Christmas and OP has accepted, and pretends like it's no big deal.  Being excluded for any reason sucks.  Being excluded on a major holiday is a sure sign that OP cares nothing for the husband.  Yeah, she may claim that she loves him, but he's no where near the top of her priority list, and she has no problem allowing others and no herself treating him like a door mat.   Hopefully, he comes to his senses and walks away from all of them.  If he's a pediatrician, he could find a partner that showed him more respect at a gold digger's convention.  OP, YTA", "First and probably last.", "Exactly this. It's their first holiday together and she's willing to cave to her parents already??", "💵💵💵💰💰💰", "this made me chuckle.", "Unbelievable the lack of self awareness OP seems to possess. She has no respect or care for her husband. Honestly he should divorce her. YTA OP", "All of this.", "Right?!? How could she have typed this and then read it over before posting, without stopping and saying “oh waaaaait a minute…”\n\nYTA, OP.", "Well if this is how she treats their relationship she might not be for much longer. Op YTA", "Phillip is not his father...", "Bullshit. If someone wants to talk about home remedies in front of a doctor, and gets mad the doctor with more training is calling them out, he doesn’t need to repair the relationship.   “Natural remedies” can be anything. And if a doctor is calling it out, sounds like it’s parents committed neglect on the niece.", "It’s meant to be a partnership. I agree with YTA - but a wife isn’t required to ‘look after’ a man. I’d hope that he’s capable of looking after himself.", "Whatever happens to standing up for the husband? I’ve seen so many aiya where a guy is blasted when his wife is not invited. She should have nipped it in the bud", "the husband has not picked fights read hes done nothing wrong but defend himself", "Tone it down? \n\nIt was her idiot dad that started an argument with a doctor for not bringing his grandson over because Billy is busy treating sick kids. What he’s meant to just be a lapdog? \n\nOh yeah let him shut up and watch a sick kid, continually get sick because as a doctor he knows less than her parents.", "Her husband was defending medicine. Her family IS ignorant.", "Thata my take, surprised more people aren't saying the same thing. Husband and her parents are being childish and rude and she is being completely inconsiderate by siding with them.", "Yeah this doctor who is saving kids lives and is trying to stop someone getting medically neglected.", "By talking about it in front of him, if the disease was serious enough, he is LEGALLY required to call CPS if they refuse to get a child legitimate medical help as it IS considered medical neglect. They shouldn't be undermining his job type in front of him either. \n\n\n\nEvery reason op gave that they don't like him is THEIR fault not his", "[deleted]", "Really? He wasn’t invited to an important family holiday celebration.", "Are you the mother/father here?", "Did he keep picking fights or was he speaking up and advocating for a child as a doctor? ....OP is definitely TA .", "By virtue of his job he's legally required to report this...the fact that he's not speaks volumes to his restraint. I think he's slightly TA for not reporting this to CPS. OP is definitely TA for allowing her family to put her husband in this position and for accepting that invitation without discussion. Btw as a pediatrician he's a mandated reporter, seems they've shared their natural remedies around him enough for him to have enough evidence to report them to CPS.", "That's what I said too.\n\nI would wrap them nicely in Christmas paper for when she returns home from her wonderful family.", "This is probably the wake up call OP's husband needed", "This is an episode of EastEnders (UK soap) from the 1980s. Den gives his wife divorce papers for Xmas. It's brutal.", "Now I want chicken and it’s not even 6am…", "I mean, if KFC made chicken soup with those 11 herbs and spices, it might actually do something. (Chicken soup actually being useful against colds and such.)", "My dad was a fetal and pediatric radiologist - even 30 years ago when ‘natural remedies’ weren’t the in thing, he saw many fatalities from lack of proper medical care for babies. He finally had enough when the Andrew Wakefield bullshit happened. He was old enough to remember kids in iron lungs because of polio and now idiot parents were refusing vaccines because some quack made up a story to become famous. That was when he knew he was done. He cried over those kids.", "And now my drink is wasted!", "Your comment is just so perfect.", "OP’s next post will ask if she’s the AH if she skips her son’s vaccinations because her mom has some new essential oils.", "you need to report that doctor it goes against medical laws in place", ">Also why tf wasn’t OP backing up her husband over the medicinal argument?\n\nIn my country there's a saying: \"It's a sin to think badly but usually it gets right\" and the vibes I get from OP's post is that she didn't marry him for romantic reasons exactly.", "I guess the thing for me is that if everyone is getting along in your family and there are no big blowout fights/people getting banned from homes/etc., it makes sense to wait to talk about it. But if you /know/ there’s going to be a major familial issue, why wouldn’t you start trying to figure it out as soon as possible?", "Giving \"natural remedies\" to a sick child while ignoring the advice of an actual pediatrician IS ignorant.", "How has he gone out of his way? By not taking a day off to take his son to them instead of working?  Why did they not come to the grandson? Because they think that their natural remedies will be acceptable to a real life doctor? And he called them out on that?", "If they believe in \"natural remedies\" of medicine, they are ignorant. The only ass in this scenario idls the OP and her family.", "Neither of the incidents she mentioned were him ‘starting shit’. Being at work is a legitimate reason for why you can’t take a kid somewhere. Not using actual medication on a sick child is ignorant.", "And the fact that OP isn’t responding to any comments? Very sus", "🙌🏻🙌🏻", "I can't imagine being okay with my family not inviting my spouse to a holiday celebration. Like wtf?", " he is his step dad. Isn't he?", "Why did I read that in Maury's voice?", "Not to mention the “keeping the grandchild from them” comment. Like ew\n\nThe guy was working and OP was sick  ! If they wanted to see the child so badly they could have put in the effort to go see him themselves", "I don't know many people who think calling others ignorant won't automatically unlock fight mode but okay", "He could have asked why they thought those things given his side and joined the conversation made it a debate but he started a fight instead making him AH in that situation doesn’t change the face she and her parents are also AHs", "She out and out said he picked a fight with the mom and sister over alternative to just taking meds… aka picking a fight.\n\nI read the post twice before commenting", "The kid wasn’t sick, the mom was. And there’s nothing wrong with that, but OP says he argues with her family a lot. \n\nAlso, even if the husband thinks their belief in natural remedies is dumb, to verbally call them ignorant is unnecessary and hurtful. There are other ways the husband could voice this.", "I'm sure they are but an ounce of emotional intelligence would make him capable of choosing his words more wisely. I'm sure he is capable of doing do with parents at work.", "How is it childish of the husband, who is a doctor, to say that her mom and sis are ignorant for believing in natural remedies? Do you have any idea how horribly wrong this can go? Children have literally died because instead of using a real medication some bullshit natural remedies.\n\nSo for a medical professional to want to nip that in the bud, because it is dangerous, is not a childish behaviour. And given the other argument her dad picked with him, I belive they want him out of her life.", "There are better ways of achieving that goal than calling these people ignorant.", "You mean like the part where they accused the husband of keeping Billy away from them when it was because he was working and Op was sick? For the whole “ignorant” comment, we may need context. However, the husband is a medical professional and if the “natural remedies” were being used instead of actual necessary treatment then ya, they would be ignorant.", "I might marry this person purely so I can do that....", "That's certainly what she deserves", "Extra crispy??", "It is almost 2pm here. Take my time zone, I will take a nap until you are done,", "Don't worry, I'm sure OP's mum can spare one of her herbal brews for you", "Why would I report him for not pushing big pharma crap, in Australia doctors are entitled to have their own opinions", "Yes yes, let me call my MIL if it in her own home, because I feel I know better. That’s a great way to get along. Some of y’all need to learn it’s not what you say, it’s how you say it. You can disagree all you want to, but calling someone ignorant isn’t really cool when you’re in their house. If he really wanted to give advice, he shouldn’t have started out with an insult, because whether or not you believe it’s true, calling someone ignorant is an insult, that’s butting someone on defensive mode, instead of them actually hearing what you have to say. So yes, he went out of his way to start shit. \n\nAnd depending on what it is, it probably doesn’t always need medicine. My dad used to give me little brother and sister cod liver because they were always getting sick, and getting everyone in the house sick. When I have a slight cold, I’ll drink a hot tottie and got to sleep. I take cranberry supplements because they’re good for you’re woohah. If feel nauseous on my period I’ll drink some tea, and maybe smoke a little weed. Those are more so on the naturalistic side of things, but they do work. Home remedies, have been around for centuries. The little girl probably just had a cold, some kids can’t handle medicine. My little cousin literally breaks out from a 200ml ibuprofen and that one little pill will make her break out and she’ll be knocked for the whole day, so we don’t give her medicine like that, so sometimes we HAVE to come up with an alternative for her or else she’ll just be sick. The only medicine she can have is her diabetes medicine. Hell, I only take medicine if my symptoms don’t go get any better after three days, and even then it’s a small does.\n\nAs long as they’re not using cocaine to for a toothache, and take her to the doctor when she actually needs it, and follows HER pediatrician’s advice, Philip needs to chill. If he wanted to give advice, starting off by calling her ignorant was definitely not the damn way.", "Calling someone ignorant right off the bat, is a good way to make sure they don’t hear shit you say after that. Have y’all never heard the saying “it’s not what you say, but how you say it.” He can disagree all he wants to, but you catch more bees with honey. If he had worded it a different way, or hadn’t started off insulting them, an argument probably wouldn’t have happened. But once he called them ignorant, which is an insult no matter how you spin it, they went in defensive mode instead of being open to hearing anything he had to say.", "Billy is 10, OP has only known her husband for 2 years, legally he may be a step parent, but it doesn't mean he is a father figure, that's for Billy to decide and OP hasn't disclosed how close there relationship is with one another.", "Well, assuming the niece is sick and them discussing giving her natural \"remedies\" instead of actual medicine is ignorant, and I'm happy to read that Philip did his job as a doctor and called them out for it.", "Well, to be fair, science deniers are very annoying. Especially for a doctor", "Agreed everyone’s jumping cause he’s a pediatrician but like it or not holistic medicine is credible and has advanced use in non-westernized countries. He had to work, very fair, you don’t get to bring your professional opinion when no one asks for it. It’s unwelcome, it’s rude, leave your white coat on at home", "The husband was just being honest, they are ignorant.\nNTA", "The niece was sick, not the mom. We don't know the age of niece but would guess that she's a kid given the ages of OP and their child. And OP has only given two instances of arguments, one of which OPs dad was being unreasonable, and the second, we don't know the context for. Philip might be argumentative but I'm not even a paediatrician and I would have something to say about natural remedies being used when it has real world impacts for a living child.", "Based on the \"arguments\" discussed I would say what she meant to say is, my family hates his logical medical opinion so they start arguments with him and I don't shut it down.", "Weeeellllll, here is where I may possibly be an A H myself. If they are anti-vaxxers I agree with him, but would not tell them they are ignorant in a group setting. Im all for natural remedies but certain things need medical intervention.", "Maybe they shouldn’t be so stupid", "[deleted]", "😂", "He doesn't *feel* he knows better, he literally knows better.", "I mean I generally agree (although \"actual medicine\" and natural medicine aren't black and white. Penicilline is originally from a natural occurring fungus for example, and the Kava plant is used to combat anxiety, depression and other symptoms, backed up by studies.) but 1) calling them ignorant probably won't help them be deterred from natural medicine and 2) it most certainly won't help family relationships. He knows this, for he has lived on earth more than a decade.", "Actually yes. You do. As a pediatrician if he has concerns about the medicine or methods they are using and if they are refusing to seek medical help for a child, it is considered medical neglect (depending on the severity of the issue and age of the child which isn't disclosed). He is LEGALLY required to report that to CPS if he sees it go to far so it makes sense that if it's being discussed in front of him that he'd object. \n\n\n\n\nOp is also a biased and unreliable narrator so I'd take them saying he started with a fight with a grain of salt. It likely started as a disagreement when he pointed it out and escalated to being loud.", "Exactly. I’m not saying I agree with them, but to call your in-laws ignorant to their faces is a bit much. There’s a certain level of tact that you need to apply.", "Well, as I said, it depends on the situation. If people are using “natural” remedies on their children over professional help then they deserved to be called out.", "And he is still a medic, i mean he said nothing but the truth, even calling them ignorant was the truth.", "Probably could've used different words. Ebglish is not my first language, and sometimes my brain just stop. ;) \n\nFrom what I've understood, since he is a doctor he is obligated by law to say/do something when he is witnessing medical neglect. Not sure if that's what happened here, but if it was I'm glad he said something even if that ment calling the ignorant. A child health should always come first even if it does make family relationships worse.", "I think those depend on if they are talking natural remedies for like eczema or mild constipation or an actual illness.", "You do not deserve your husband.  Wake up, reset, plan Christmas with YOUR family(husband and child), preferably out of town, and plan a Facetime for you and your son to wish your parents a merry Christmas.  This is the ONLY option to hope that it is not your last Christmas with Phillip.\nYTA until you change the current plan.", "“Natural herbs and remedies” yeah those literally have killed children, I don’t blame your husband for being upset. I am not a doctor and if my significant others family tried to say that about my kid I would absolutely not stand for it as I’d rather have an alive kid then a dead one. YTA", "YTA. \n\nYour husband was right. \"NaTuRaL\" remedies are generally bs and waste of money.  But what would your husband know? Just some dude who happened to go to med school, pssht big deal s/ .\n\nYou don't make plans with your husband for Christmas, it's an automatic you spend it together, unless you spoke about it otherwise. \n\nYou don't stick up for him? You are def TA. Go have fun with your family. Leave your kid with him though. On fact stay eith your family for a couple weeks.", "There was a news story not too long ago in my country where parents treated their child with ‘natural remedies’. The kid had meningitis because they didn’t believe in vaccines. They tried to treat him with dandelion tea and essential oils and he died a horribly painful death. The parents have lost custody of their other children and are now facing prison. Philip is a trained medical professional. What would have happened if he said nothing and OP’s idiot family went ahead with their ‘natural remedies’ and something serious happened to the child? I’m sure they would’ve blamed him for not speaking up. \n\nOP what was stopping your dad from getting off his ass and visiting his grandson? Why is it Philips job to facilitate visits with the grandparents when your not available?  Your family sounds awful. Stay on your current path and you may be gifted with divorce papers for Christmas. Your the AH 100% for not backing your husband and abandoning him on Christmas.  \n\nYTA", "YTA. It sounds like your dad started a fight, and then like Phillip spoke up to butt in on your moms conversation about a thing he knows very well because it’s his job. He wasn’t wrong, but maybe a bit rude. But it sounds like your parents are responsible for at least half of the fights you’ve listed here. \n\nYour parents can bar him all they want, but by you agreeing to still go, you’re picking them over your husband. You are ditching him on Christmas. It sends a clear message: “you’re not really family.” You should either fix this, or save yourself the time and talk to lawyers now. Because this is the kind of thing that deep resentment grows around.", "Do you want to be married to your husband or your parents?? Usually I'm anti in-laws, but your husband has been 100% on point with the disagreements you stated. Do you see him as your husband and equal partner, or just easy income? You and your husbands needs should come before your parents! Even if your parents were paying your mortgage and bills, you and your husband are supposed to be a team.", "YTA. You’re leaving your husband ON CHRISTMAS? What I’m hearing is your family likes to bully Phillip and you allow it 🤷🏻‍♀️ girl, smarten up or you’ll be getting divorce papers real soon.", "Isn’t this the first Christmas together married too? Damn.", "YTA. Girl you are 36 years old. Time to put on your big girl pants and stand up to your family. Your dad was a huge arse for having a go at your husband for \"keeping your son away from him\" when he had work. What was he supposed to do. Take that day off so that he could visit? You should have shut this down so fast.\nEach to their own when it comes to holistic medicine but especially as a physician he was well within his right to his opinion.\nLastly, you and your family are major AH for excluding him from a family Christmas. Especially you. You're his wife and you're meant to have his back and instead you made plans on Christmas without him, without even consulting him. I would straight up need time to contemplate my relationship if my partner pulled this shit.", "YTA.\n\nYou don't think he's a wonderful man. You seem to hate his fucking guts--you won't defend him to your horrifying family, you discount his expertise and knowledge, you delightedly abandon him on an important holiday because you like your miserable family better.\n\nWhat's wonderful about him that you like so much but won't stick up for him over? His paycheck?", "yta. woah op that is a little delusional from you. he is your HUSBAND. you're willing to leave him alone on christmas day for the sake of your family being stupid and delusional as well (natural medicine is a fucking hoax) and you didnt stand up for your husband. seems like you're not willing to do any work to keep the relationship going. cancel those family plans right now or at least try to solve  things between husband and family. think this  through please as you're gonna potentially lose a relationship for the sake of your families petiness.", "YTA. Why would you marry someone your values don’t align with? Better yet, why wouldn’t you marry someone you actually liked?\n\nYou married a doctor into your homeopathic family and your only concerns have been Phillip trying to be a good father to your son. You don’t even have the spine to stand up to your parents for your new family.\n\nYou neglect to mention Phillip’s relationship with your son, or how your son feels about his grandparents feel about excluding his step-dad, but being that the only feelings you care for are your parents’, I’m not surprised.", "YTA - he’s a pediatrician so i’m pretty sure he’s seen the effects of natural remedies vs actual medicine. plus, even if he didn’t, the arguments listed are so minor. obviously, your parents wanted you to marry someone more passive who will just go along with they say; but since that isn’t the case they’re just going to have to accept phillip or accept that you and billy can’t attend because missing your first christmas together is ridiculous.", "YTA. \"My tradition is that I don't spend Christmas with a spouse. I don't see why that should change now that I'm married.\"", "YTA. If you're going to make your husband spend Christmas without you, you better not accept a single gift from him, for you or Billy. And use your own money to buy gifts for your family. \n\nIf you truly love this man, you will spend Christmas with him. He is your husband. Your parents were rude to him and you didn't back him up. Now they're excluding him and you're fine with it. Stand by your man, or go back to being a single mom. Because from this seat it looks like you are very clearly using him for stability and ok with him being the family punching bag. Grow a spine and a heart or this marriage is doomed.", "Why did you marry someone you don’t want to spend Christmas with? YTA", "So, your husband couldn't drive your kid to your parents because he was working and your dad got mad and picked a fight. Question, why couldn't your parents come and get the kid? Second, your husband is a licensed medical physician who's entitled to an opinion around people who believe things are better with \"natural medicine\", there's no evidence to support most of them and then your mom and sister picked a fight. In both scenarios you decided to side with your parents instead of seeing things from your husband's perspective. And now you are purposefully excluding your husband from a perfectly reasonable assumption that he'd be spending Christmas with his wife and step kid (who is very much lucky his mom married a guy who cares about him) by claiming \"I can't force you to be in my parent's guest list\"? I fail to see where in writing all of that you are so blind to think you are not the a**hole. \nAnother case of OP getting married and not cutting the umbilical cord to their parents beforehand. \nIn case it wasn't clear OP, YTA.", "Info: Do you have a job? Or is husband just your pocketbook? Seems like you don't actually like your husband.\n\nYTA", "YTA. Philip is your husband and you need to be on his side. If he’s instigating arguments with your family then you need to talk to him, but it’s not acceptable for your family to pretend you don’t have a husband.", "The title and the first sentence immediately clashed for me. I was honestly expecting an incoherent or incomplete story. Sounds more or less complete though and not all that complicated.\n\nSeriously though, her family seems like they were being asses to Philip. And yes, he’d be disappointed if you left him alone during Christmas. It about the fact you’re abandoning him on Christmas.\n\nThat’s not how you get a wonderful man to stay with you. YTA", "YTA and a terrible wife.  You are showing your husband you absolutely do not have his back when it matters.  Good luck on your inevitable divorce.", "yta. your husband is right and your family is ignorant. i can see the apple didn’t fall far from the tree with you.", "Have fun being a single mum again.\nYTA", "YTA. You’re leaving your husband home alone on Christmas to go to your parents? The parents that accused him without any proof of keeping his grandson from them? The parents that obviously have a problem with YOUR HUSBAND? Dude, wake up and have a look at this situation. You’re being walked all over by your parents.", "Are you that ignorant or straight up stupid. He is your husbend. \n\nI will not be surprised if your next post is about my husband is divorcing me", "YTA.\n\nCouldn't drop off Billy due to work, you said you couldn't as you were sick? Why couldn't your parents collect him?\n\nSecondly, what? I just can't even address this without vitriol. You seem absolutely clueless.", "YTA.  Your husband is a PEDIATRICIAN!  An actual professional who uses data backed practices in his career.  Your mom & sister are getting their “expert” advice from Facebook, YouTube, & Google.  He’s trying to stop misinformation from affecting his patients who are CHILDREN!  And you’re siding with your mom, who’s “advice” could lead to serious & irreparable harm, by NOT standing with your husband, who, again, is a PROFESSIONAL!\n\nHe wants to spend Christmas with you & his stepson, not have you leave him not even ONE YEAR into your marriage because your bio-family is too into unproven & often dangerous treatments (which, I’m guessing, your husband sees the consequences of far to frequently in his profession) to even accept your husband whom you chose to marry!\n\nI mean, it’s honestly a really, really horrible way to spend your first Christmas as a married couple.  I.e. not together.", "Look, I understand that you have been a single mom for a long time. You have made all the decisions for you and Billy. You never had to run anything by anyone. You are also one to probably stay out of disagreements between family members, let them work out their own relationships. \n\nHOWEVER, you decided to bring another person into your life and share that life with him. You chose team Philip. You really need to decide if that was really what you wanted, because I guarantee you he is rethinking this relationship as well. You need to respect your husband, you are a team now. Any slight to him, is a slight to you. Any snub to him, is a snub to you.\n\nSince you made that choice, you need to treat Philip similarly as you would treat Billy in these situations. I hope that you would not accept an holiday invitation from your parents where Billy was excluded. That would be mad!\n\nDid you marry Philip to be Billy’s personal pediatrician? You are very calm and nonchalant about this entire matter. YTA most definitely and Philip needs a wife that will respect him and put him above all others. If someone in my family slighted my husband, I would be Hell on wheels.  I’m  pretty sure what you’re getting for Christmas if you do not straighten out your attitude and expectations for a marital relationship.", "YTA. You are fully prepared to let your husband spend Christmas alone rather than challenging your parents. Stop and think how you made him feel.", "YTA big time\n\ncut the apron strings already……he’s your HUSBAND! The three of you should be spending the holiday together. \n\nwhat message are you sending to your husband? Oh my family can disrespect you but i’ll choose their company over yours?", "YTA if my husband isn’t invited I’m not going. You chose your family over your husband. I don’t see this marriage working out.\n\nEdit: I read the post again you are definitely the asshole. You don’t defend your husband against your family. As a doctor he has things to follow. Again I see a divorce in your future I hope you get your head out of your behind.", "YTA your family hate your husband for some reason and your not standing up for him poor guy", "What are you thinking?  Seriously...what the hell are you thinking?   \n\nI bet your husband re-thinking this marriage.  Yta", "YTA", "YTA \n\nI hope Phillip gets out of this relationship quickly. You don’t back him and if your parents really wanted to see their grandson there are Ubers and taxis. \n\nIt’s some bill shit. Move back home since you picked them over your nice new husband. As a pediatrician he should have no problems finding someone who treats him better.", "YTA. \n\nYou‘re married. You’re a new family. Your folks sound like the AHs - “ He doesn’t agree with our beliefs even though he’s educated enough to disagree with me AND explain why - therefore he’s not part of our family and we’re not inviting him to gatherings anymore“ . Yup! You and your folks seem like AHs to me.", "I’m sure others have chimed in with thoughtful responses on why YTA, so all I have to say is\n\nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA \nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA \nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA \nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA \nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA \nYTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA YTA\n\nIs it very clear to you that YTA?", "YTA. You, Phillip, and Billy are now a separate family unit. \"We had no plans for Christmas.\" Are you for real? You think there needs to be a plan to spend the holidays with your HUSBAND? Just... No. And it doesn't matter whose \"fault\" it is that he and your parents don't get along. You. Spend. The. Holidays. With. Your. Spouse.\n\nBTW, I can see a lot of manipulation from your parents. Your dad says Phillip keeps Billy away from them. Classic grandparent manipulation. Your mother only invites you and Billy, and not your husband, because of, frankly, pretty silly arguments.\n\nAnd your husband is right to tell them they're wrong for not treating the niece with actual medicine. In this instance he actually does know better than them - he's a freaking doctor.", "Oh, it’s only a few hours on Christmas? Are you going to leave the TV on for him and give him a pig ear before you leave as well?\n\nYour husband is your partner who apparently loves your kid and you’re treating him like shit and allowing your family to do the same. YTA.", "Put the shoe on the other foot and think about how you'd feel if he did this to you. Your family is kooky and awful and YTA for picking them over your husband", "YTA Why aren’t you defending him here? This man is getting banned from a Christmas celebration because 1: someone wanted to pick a fight with him and 2: he called out the harm of natural remedies. He’s getting banned from a family gathering for 2 ridiculous reasons and you aren’t standing by him?", "When you marry, you are committing to standing by your husband. Notwithstanding the fact that he is probably in the right as far as the medical debate goes, you should have told your family that it is all or none. \n\nOtherwise you might just lose this doctor you caught and be left once again as a single mother with nobody to father your child.\n\nPerhaps if they won't accept him as a guest, you could make arrangements to go before or after the actual holiday. But if I were your husband, I would book an expensive trip for myself while you were off visiting the relatives and say tough luck, you made your choice.", "YTA… I don’t see a reason as to where your husband is wrong. He was busy and your dad picked a fight because he would not cater to his wish. Secondly he defended science and what is true. What is shocking that you are not defending him. From the post it seems he loves your son as his own. Keep up with this attitude and he will soon be your ex.", "YTA. Hopefully he realizes sooner rather than later that you’re just as terrible as your family and cuts his losses. I hope he finds a partner that will actually value him and have his back. You’re honestly terrible.", "YTA. Your husband has done nothing wrong. You should let him go so he can find someone with a better family. How can you not see your family are in the wrong here", "YTA. If they don’t invite him, they aren’t inviting you. You’re one. A couple. If they want to see Billy they better learn how to get along.", "YTA.  You've been married for 4 months and you are fine with your family purposely excluding your husband from Christmas.  You don't have your husbands back here at all but you should.   \n I will be surprised if your marriage makes it to the 1-year mark.", "ESH. I think all sides have earned some blame here as everyone sounds a little intransigent and like they could all be better about talking to each other and doing so respectfully.\n\nIt sounds like your dad blew the Billy-visit situation way out of proportion. It's an overreaction to consider it \"keeping them away from their grandson\" just because they have to reschedule one visit or even a few closely scheduled visits because people are busy/sick.\n\nCalling people ignorant because they consider other treatments isn't a way to endear them to you. I'm a big believer in science and he's a doctor so I would probably agree with him, but, depending on the context, it sounds like he could have blown that way out of proportion too. You didn't say what the niece was dealing with, but I'm going to assume it wasn't something as simple as a cold or using crystals as deodorant. But if the conversation was about something like changing her diet to manage a rheumatoid issue or acid reflux instead of taking steroids or proton pump inhibitors, then I don't think your husband needed to handle it in quite that fashion. If it was more along the lines of a dangerous significantly contagious disease that could result in death if contracted, I can see why he might be more aggressive, but in most cases insulting people isn't usually a good way to convince them to listen to you.\n\nAs for Christmas: you say you aren't surprised by the split invitation while Philip assumed you'd be spending the holiday together with Billy. That sounds like something you should have talked about with him. I can see how you're not surprised and to some extent, maybe he shouldn't have been surprised either since the last time he saw your family they kicked him out of their house. But if you were the one expecting this and it's your family, why didn't you bring this up as a possibility before? Even if you were planning to spend the holiday with your husband, if you expected to even take Billy to his grandparents so he could see them without Phillip there, those are plans you would think you would mention to your husband since they impact his holiday schedule as well.\n\nI do think he could chill a bit though too. There are plenty of families who put emphasis on different elements of the holidays and those things evolve as families grow and change. When my extended family lived largely together in two homes, Christmas was a largely communal, two-day event, with different family members sometimes coming to stay for several days. As people grew up and started their only families, that has developed into (usually) Christmas Eve dinner (and sometimes gift exchange) while Christmas Day is spent within individual households. My dad is big on Christmas breakfast with immediate family; my mom is big on the extended family dinner, which dad sometimes skips. (INFO: I think we need to know how you and Philip have spent the past two Christmases to get a better sense of if your going to your parents for a few hours is not a big deal as you say or a huge deal as he says.)\n\n**But honestly, for all of the adults involved across the board:** ***Learn to communicate and compromise.***\n\nMaybe you figured a few hours with your parents wouldn't be a huge deal for him. And maybe it wouldn't be if it was moved to Christmas Eve or something. And maybe he should have had enough foresight to know that after significant fights with your family throughout the year, they might be willing to not include him in their holiday celebration. But maybe they would have thought twice if you had spoken up. And maybe both your husband and your family could apologize for their roles in making what could have been minor disagreements into a full fledged family war and everyone could spend Christmas together and acknowledge that being in a family means not always getting your way or being \"right\" on every single thing.", "YTA you’re going to leave your husband alone on Christmas??? That’s cold.", "He should leave you. Invitations are extended to the couple not to one. Stick up for your husband.", "INFO: Do you even understand what a marriage is?", "Info:why are you married to this man if you’re going to disrespect him?", "YTA I wouldn’t even entertain this thought of not spending Christmas with my husband, your family will get the picture that you don’t tolerate disrespect to your husband when they can’t see their grandchild. That should clear it up, unless you like them being mean to your husband", "YTA. He's your wonderful husband and yet you allow your family to disrespect him. The guy studied for \"only\" what? 12 years while your sister and mother read 2 articles on the internet and you treat his intervention as if it was a petty argument. You allow your family not to include him because they choose their ignorance. You actually leave him alone on xmas after being married 4 months. You are horrible, honestly.", "YTA. But (I know I will be downvoted for this is predominately western sub) I do disagree with the blanket bashing of all natural remedies. For *some*, non life-threatening things, there’s nothing wrong with natural remedies. Like ginger tea for a sore throat over mucinex seems reasonable to me. For big issues like cancer or mental health etc. of course natural remedies don’t work. So I do think being entirely dismissive of it seems over the top, but to ban him from Christmas for it is straight up melodrama.\n\nIn all of this, OP remains TA. How she can accept an invitation that categorically excludes her husband is beyond me. It also sounds like she only gets on Philip for the arguments and is punishing him while her parents aren’t losing anything. In fact she is enabling their behavior.", "Your father's claim against your husband was unwarranted, as was your husband's \"ignorant\" remark... regardless of whether you believe natural remedies are \"ignorant\" or not. That's why *you* play the role of mediator. It's not like you're some helpless onlooker in this situation. This is your business: they all are *your family*. Time for you to put on big girl pants and let your parents know that Phillip/Billy/you are a package deal, and time to let Phillip know that he can stand to be a bit more polite.\n\nYTA for being too passive in your circumstances.", "ESH, except your child. Your husband and family seem to not get along bc they're too similar in all the wrong ways: they lack tact, emotional regulation, and conflict resolution skills. And they seem to be contributing equally to the issue. By accepting your parents' invitation before mentioning it to your husband, it appears you have taken a side.\n\nThis won't just be about a holiday dinner. You and your poor kid will be trapped in this childish tug of war unless you set boundaries of what behavior you will accept from their interactions with each other. Tell your husband that your parents are your family and it's a package deal. Tell your parents that your husband is your family and it's a package deal. They are all adults and can absolutely be civil with people they don't enthusiastically like. Anyone who can't behave gets left out, period.", "There’s a lot that’s hard to understand here. When you say your father accused Philip of keeping Billy away from your parents because you were sick and “he” had to work, who is “he?”  Did your husband have to work?  Did your dad have to work?  They live a few hours away. Did they offer to come get Billy?  It’s pretty vague so it’s tough to tell who is the AH there. Also, when you say that Philip, your pediatrician husband, called your mom and sister ignorant, that needs context. We’re your kin talking about treating something potentially fatal with tree bark or was it a homeopathic remedy that actually helps?  Did he call them ignorant as in your both ignorant twats or did he say that’s ignorant information. \nThat being said, Phillip is your husband. For your parents to exclude him at Christmas definitely makes your family the AH(s). I don’t envy your situation but you need to realize that your choice will have long term repercussions and ramifications. I suggest you try to get your parents to reconsider Philip’s invitation and ask your husband to refrain from controversy. Best luck to you.", "Info:  \nWas Philip actually working and could not facilitate Billy and your parents getting together (or preventing your parents from seeing Billy even though it would not have impacted Billy) or was it really more of an \"excuse\"?  \n\n\nWhat was the context of the natural remedy discussion?  Was this a \"let's do Vitamin C and echinacea for a cold\" situation or \"kid has pneumonia and let's lay hands\" situation?  Honestly I have known way to many self-righteous pediatrician who have no respect for parents and unless someone is actually at risk calling someone \"ignorant\" is not exactly a great way to build family harmony, even if you don't agree with them.   \n\n\nAt this point I'm leaning towards ESH because I can see Philip being rather condescending and controlling, but there is a huge gap where you need to be the go-between between your parent and your spouse.  Plus it is marriage 101 (as Philip stated) to expect someone to be upset to not spend Christmas as a married couple/family and that would take a lot of prior discussion/agreement to make that okay and it sounds like you just announced it without consideration for Philip's feelings.", "I forgot to add in my last comment that you don't deserve him and i hope he leaves you!", "ESH\nCommunication is key. Why didn't you discuss this with your husband? Why would your mom be such an arse hole to invite you without your husband? Why is it your husband business if your mom is into natural remedies? \nYour family is sabotaging your marriage. Ask yourself why", "ESH   \nBut you're the a-hole for not discussing the decision with your husband before informing your parents.   \nYour husband was a jerk for the WAY he handled the conversation about alternative vs western medicine. There is room for a holistic approach, and the pediatricians in my area who are holistic and embrace both realms are the ones who have waiting lists for new patients. I fired a pediatrician who was dismissive and did not accept that he might have been wrong or that a natural remedy could be effective. He was not respecting the rights of patients (not even his patients) to choose a course of care. Your parents are jerks for excluding your new spouse and shoving their beliefs at him that they know doesn't reconcile with his training. Your parents are expecting your son to be there, but want to exclude your husband. Why are you not defending your marriage, or at least having open communication with both sides of the disagreement you've been pushed into the middle of here? \n\nAs a grandmother, I want my grandbabies to wake up in their own beds on Christmas morning. I spent the first 15 years of my marriage traveling to my in-laws' houses every. single. holiday. to the point that I grew to loathe any holiday. My husband refused to see the stress it left me with the entire time surrounding and during the occasion. The year my now 13 year old was born, she was exclusively breastfed and refused bottles of anything. The debate became nurse the baby while he drove on the interstate or we stopped every hour and a half to nurse the baby which would extend the drive from 6 hours to 8 or 9 hours depending on how hungry the child got. I absolutely refused to nurse while he drove for obvious reasons. I told him I would rather just not go at all and let him take the older kids to his mom's house. That was another lead balloon. He refused to stop when we needed to feed her and extend the drive time. So he decided we would not go at all. I was 10000% fine with that as I'd been begging him for years to allow me to be home for at least some of the holidays. I cooked Thanksgiving, invited my parents to our house, and we had a very relaxing day. I fully expected my husband to want to travel for Christmas, and I was willing to compromise. By that point the baby would have been nursing a little less frequently and we could time things to only need to stop once. However, he decided we would not travel. We have not traveled for holidays nearly as much since then. We now always host Thanksgiving because we have such a large family of our own. But for Christmas, if I don't see my grandbabies because they are at another loved one's house or their own house, it will not be the end of my world. I do not want my kids or their partners to experience the same insanity and stress I did because of the expectations of other people.", "YTA, OP.\n\nJust to be safe, I texted my spouse and asked if he wanted to hang out for Christmas with our kid. He's sitting on the couch next to me drinking coffee. He looked up and asked if I was reading the AITA about the terrible wife who was going to let her new doctor husband stay home alone at Christmas after he was banned from her family's for having opinions about idiot parents who host chicken pox parties and cure RSV by putting onions in socks. \n\nHe didn't answer my text about Christmas though, so I'm not sure what my plans are.", "This might end up being the greatest gift OP could give her husband. The clarity to see how terrible and selfish OP is. Sounds like in OP’s family the apple does fall far from the tree.", "If I were OP's husband I wouldn't even want to expend Christmas with OP anymore (if she ever comes to her senses), this is just so disrespectful. \n\nI hope OP's husband run fast after this.\n\nYTA, OP.", "This. \n\n>I'm not leaving him behind because we had no plans for Christmas. He said that he'd assumed we'd \"automatically\" celebrate Christmas together the three of us\" \n\nNot sure why OP put automatically in quotations like it's some weird concept she's never heard of, but it's perfectly reasonable and normal for a spouse to expect to automatically spend Christmas with their spouse and stepchild without having to put plans in place!! \n\n\nOP, YTA. Sounds like your family have felt unnecessarily threatened by your husband being in the picture (as you said, they're used to having Billy at every holiday, so your husband threatens that) so they've made mountains out of molehills and pushed him out to the point where he's not even welcome to spend Christmas with his wife and stepchild. It's also sad that you think your family's right to spend Christmas with their extended family comes before your husbands right to spend Christmas with his IMMEDIATE family. \n\n\nYou ARE leaving your husband behind and you ARE forcing him to spend Christmas alone without you and Billy. Yes, he's not welcome at your parents, and that's your parents choice. But you don't HAVE to go to your parents and leave your husband alone on Christmas, that's YOUR choice.", "I only know one married couple that didn't spend their first Christmas as newly weds together (because both sets of parents laid massive guilt trips on them) - that couple was divorced by the next time Christmas came around.", "Also super sad you can’t imagine making a new family tradition with your husband and letting your idiot family experience the consequences of their behavior, your absence on a holiday. YTA.", "Yes, YTA. And your family are AHs too for excluding your husband. You don’t try to divide up a married couple during the holidays.", "Within 4 months of the marriage at that...", ">Do you actually *want* to be married to him?\n\nI asked the same thing! Calling him dramatic for being upset, and then acting like he was out of line for assuming it's a given that they'd spend Christmas together proves that she doesn't respect him, and honesty makes it seek like she doesn't even like him. Like, I can't imagine taking our kids to my parents house and making my husband spend Christmas alone.\n\nThe fights her family picks are stupid, and how she can't see that it's them doing it is crazy to me! I mean, if her dad wanted to see her son so bad, why couldn't he drive to their house and see him? Why did Phillip have to take the kid to them? Then to discuss natural remedies in front of a pediatrician? How much do you bet they knew his stance on it and did this in order to cause an argument? Here's to hoping Phillip gets her divorce papers for Christmas.", "OMG not the herbs and the spices!🤣🤣", "Look dude. Say whatever you want to about this situation but DONT BRING KFC INTO THIS. In the states kfc sucks but in some other countries their chicken is awesome.", "So many of these AITA problems would be solved it they did this. Just thought about it from someone else’s or even just a new perspective. It’s like they are incapable of empathy so they have to go on Reddit and have everyone point out the blatantly obvious for them. Sad.", "Exactly. I'm also curious how serious the child's illness is and if the family was trying to treat them with stuff like essential oils. The man is a pediatrician, and depending on the situation, he would be an AH not to say something/try to help a child in need.\n\nIf this couple has only been together for 2 years, this is only OP's second or third Christmas together, and OP is showing her husband that she will let her family mistreat him, and will ditch him without thought.", "And the husband is a doctor, of course he can't just call off for his in-laws' convenience!", "She’s about to put the ex in Xmas.", "I’d wager there’s an anti vaxxer among the bunch OP is keeping concealed- possible mom or sister but someone because that would further OP so much further into the wrong because AV’s are so obviously terrors to public health. YTA no question but does OP even like her husband?", "Exactly what I was thinking, but you definitely worded it a lot nicer than I would've. \n\nPoor bloke can't get a break. He stepped up (unlike a lot of step parents on here) & looked after your son while you were ill & got berated for being unable to do more. I'd NEVER leave my husband alone on Christmas (& I hate Christmas) ESPECIALLY NOT OUR 1ST AS A MARRIED COUPLE 🤦‍♀️ \n\nIf you're not careful 'Mr Wonderful' will soon become 'Mr Gone'\n\nYTA", "Yes! And to add, if your mom is used to seeing your son on holidays she needs to be civil with your husband!", "This is you and your spouse's first Christmas together and you are leaving him to go spend Christmas with your family - huh?  Very disrespectful OP.  If my husband is not welcome, then I'm not going.", "If I were the husband I'd be singing \"It's beginning to look a lot like F*ck This\" while packing my sht.", "THIS! Not to mention the fact that the op got the invitation and just accepted it, without even telling the husband that she was invited, \"he had to find out\"( op's words) that they are spending Christmas at her family\nwithout him. \n\nEven if is just a few hours away it's still leaving him behind, then going with the excuse that we didn't have anything planned.... So apparently it's ok for you to remain alone\n\nMajor YTA", "Will? They have been married for 4 months, dating for 2 years. He is going to leave now if he has any senses at all.", "99.9% agree. I am trying to give OP's parents a little wiggle room and wondering how husband presented himself in the arguments. Regardless of if he is right or wrong (and medicine over homeopathy 100%), if he's the one instigating arguments and the first to hurl insults, he is a big contributor.\n\nThat said, Christmas Day with husband and son. Give the grands the Eve or the next day (Boxing Day for the Canadians). As a grandparent myself, it is a tough transition but husband is right.\n\nYTA", "She also said her ex isn’t involved either- with a horrible family like hers I can see why. \n\nYTA OP btw", "OP: “wonderful man”\n\nAlso OP: “fuck that guy”\n\nBilly and Philip aren’t AH, but your family and you sure are. \n\nDivorce incoming!", "I’m also wondering why Billy’s biological dad is no longer in the picture at all. I bet her family ran him off too and are used to alienating OP from men. The sister may also be a single parent since she was discussing natural remedies for the niece with mom and not her own partner. It sounds like this family’s energy is negative and they want to isolate the daughters.", "YTA for all the reasons in this comment", "Ya plus you are newly married. At 4 months don't you feel like celebrating the holidays with your hubby this year ? I feel you are still newly wed so you both should be together for this celebration. You can visit your family in the evening. At that time you should have his back and explain why they owe him some basic respect as he is your partner.", ">you think its okay to leave your husband alone on Christmas because they are being horrible to him and id be upset to you are not doing anything to defend him when he has done nothing wrong\n\n>​\n\n this is the most troubling part for me its their first Christmas as a married couple. The fighting with inlaws her not sticking up for him would be all things I could forgive and work on regardless of who was right or wrong if my partner abandoned me on our first Christmas together i could never forgive her", "Absolutely this! OP you are big time YTA.\n\nWho leaves their husband alone in Christmas? Why did you even marry this poor man if he is 5th place in your life and only one of those ahead of him is your kid?", "Also, these 'natural remedies' have actually killed children in some instances.", "THIS!\n\nI'm stunned how callous OP is toward to her brand new husband. I'm disgusted.\n\nTo OP\n\nYTA for not getting YOUR BRAND NEW HUSBAND'S BACK!  You'll end up losing him if you keep doing that same shit because you're a walking red flag.\n\nAnd what's more is you don't care about your FIRST Christmas with him as a married couple.  Ugh...", ">you are encouraging your mum to be an idiot and not be knowledgeable on medications and wanting to do natural healing and when your husband as a medical professional stated the facts you let them be terrible to him\n\nThis is the only thing I disagree with you on. Hubby needed to stay out of it or his approach was all wrong. He was a bit of an AH here. But wife needs to defend him. Letting him spend Christmas alone is wrong", "And, if OP doesn't nip this in the bud, then parents will have a success and continue to exclude husband. Billy's birthday? Shouldn't celebrate that at home, because at home OP's parents can't exclude Philip. And so on.  \n\n\nThe only way you can put an end to manipulative bs is by standing your ground. They want to see their grandchild? Philip is his stepdad now and part of the package.", "With the marriage being this new, I don’t think it will survive this blow.", "Because paediatricians earn lots of money", "exactly. unless you’re leaving the house and going out, staying home and opening presents together is a given.", "I'm in a similar situation, not over Christmas but dealing with a very toxic, controlling FIL.\n\nUnfortunately, to the person being controlled,  it's their security blanket \" they are being taken of\" rather than controlled and the sad reality is that they don't see it, and when the \"outsider\" brings it up the FIL can easily convinced the people that you are in fact controlling... If you're a kid and someone tries to take away your security blanket, it wouldn't be too hard to convince you that they are a bad person, eventhough  that blanket is covered in mold and really dangerous for you.", "I really hope op replies to this because I was also wondering why the parents couldn’t drive down to see their grandson.", "Her “wonderful husband” just has “wonderful security” and a “wonderful salary” for her and her child whose biological father isn’t in the picture (so I’m guessing no child’s support)", "He was actively baited into it, said nothing vulgar but admittedly mildly abrasive, and based it on fact. Philip sucks...why?", "It's the husband's business because he is a paediatrician, and the 'natural remedies' being discussed were intended for a child.", "The topic of natural remedies for the niece can be more than just the husband's business.  He may be legally required to report if medical neglect is suspected.", "This was terrific! I hope you can iron out your plans soon!", "Sorry this is abusive, hes gaslighting and manipulating you by giving you the silent treatment PLEASE sign the divorce papers from the womans shelter! \n\n/s if it wasnt obvious lol, love how your husband k n e w, wish my mans would give up and get reddit already haha", "I think I love you. Thank you for the lol.", "🤣", "Oh no!  If he didnt answer for christmas then thata a red flag!!!  Lol. Jk.", "“Cure RSV by putting onions in socks” 😆😆😆", "OMFG. 🤌🏻🤣", "I'm crying!!! 🤣", "This comment had me rolling! Hahaha!", "Last line was a spit-take. Thank you lol", "Man wonder why the last guy went MIA 👀", "Hell no. I would be moved out by the time she got back. I feel badly for her son.", "They sell divorce papers at Walmart in New Mexico, maybe they do where OP’s future ex husband lives. He can pick them up on Boxing Day.", "It makes me wonder if she was married in the previous relationship. She certainly doesn't seem to understand how it works. And the way she's behaving, she won't need to for long...", "😂😂", "He possibly doesn't even know if he's working that day if schedules haven't been set as it's more than a month away.  Or he possibly took the day/week off to spend their first Christmas together as a family.  No one will ever know as she went ahead and made plans without him.  \n\nWow!  That might be the shortest honeymoon period in history.\n\nEdited to add, YTA", "Maybe convenience for her. It sounds like her husband is fond of her kid.", "The Colonel’s 11 Herbs and Spices^tm can cure anything, with my current hunger pains being the most importantly and urgently needed problem in need of said cure! 😋", "Oh and union slices in his socks (where do they get this nonsense?!)", "Do you know what they call alternative medicine that works?\n\nMedicine.", "Yeah…. An MD spouse who wants to spend Christmas with me?! Where do I get in line for that…?", "Plus, \"ignorant\" literally just means uninformed or not knowing. We give it an undeserved negative connotation, but it's a fairly neutral word if you think about it.", "I was just thinking the same thing. Poor billy :/", "They just got married 4 months ago.", "LOL, goddamn why isn't this commented upvoted more", "Bra effin vo \nMy favorite by far but I had no coins to award so here’s a cookie 🍪", "Genius comment  🥇  🏆", "And I spit out my coffee!!", "OP’s family has been in control of her life up until now. She’s perfectly comfortable letting them make the important decisions in her life. Dealing with that is exhausting, and it makes the spouse feel unimportant. That’s true even if the in laws like the spouse, but in this case, they decided that he was the enemy.", "DoTerra, here we come!", "They can just go to [homeopathic a&e](https://youtu.be/HMGIbOGu8q0)", "Omg I snorted tea out my nose . Take my upvote !", "Actually, it's peppermint oil... it cures everything!", "How about some Vicks vapor rub? As the comedian Jokoy said, his mother uses it as a cure-it-all.", "Gonna need extra strength valerian to deal with this family.", "Or turmeric. Turmeric cures everything.", "Or breast milk. Is anyone lactating?", "Or burn some sage to get rid of negative energy. Lol", "Or a spoonful of Ivermectin and bleach", "They'll come expecting free medical advice because he's family.", "Or financial help. Ask me how I know.", "We don’t actually know that the niece isn’t seriously sick now. They could be trying to treat cancer with essential oils and silver.", "Omg! I'll be imagining those words everytime I hear that song now😂", "And not just on Christmas, but on their first Christmas as husband and wife -- they just got married four months ago!\n\nYTA, OP.", "These people tend to lack self awareness.", "This! YTA OP. He is not melodramatic AT ALL.Your husband has done nothing wrong. He is right in his opinions. If that were me I won't accept that invitation, either invite my husband or we don't go at all. You literally chose to spend time with your crappy family who have no respect towards your husband than being with him. He is your family too.", "Is it just me, or does OP's post read like a between the lines explanation for why they have an ex who is not in the picture?", "That's probably why the son's father isn't in the picture anymore. He got tired of being left behind for her family.", "On their first Christmas! What the hell!", "Can I just quickly raise my hand and ask what kind of fuckin family *sends written invitations for Christmas*?! And if a person isn't specifically mentioned in the invitation, they're not welcome, like they have a bouncer at the door checking the cards? \n\nMaybe my family is weird, but isn't that just a quick mention in a phone call of what time the food will be ready?", "Right? \"We didn't have plans for Christmas\" okay well my husband and I didn't have plans for Christmas until last week and I'd still have been pissed if he made plans I wasn't invited to because we're *married* and it's *Christmas*.", "And it’s their first Christmas! They’ve only been married 4-months.", ">Not to mention the fact that the op got the invitation and just accepted it, without even telling the husband that she was invited,\n\nAnd- OP wasn't even offended that her family excluded her husband! I hope her \"wonderful\" husband is planning divorce papers for a Christmas gift. OP doesn't seem to value her relationship at all. OP YTA", "I don't think they do. She made her choice and it's the toxic family. She'll be divorced soon", "Billy isn't Phillips kid. Billy's dad isn't in the picture. If Phillip leaves, it will have no bearing on how often the grandparents see Billy.", "Don’t put it on on her family. OP herself is pretty good at making her partner feel unimportant and unsupported.", "Or op just makes a lot of dopey decisions.", "This seems like a lot. People separate for a lot of reasons and from the wording in the post it could be literally anything. And the sister might be a single parent...or might just be having a conversation with her mom?", "That family is sounding rather suspect...", "What? You want him to quit his job to take his stepson to his grandparents for a few hours? How is that isolation?", "If he’s in an office or at a hospital (you know, being a pediatrician) is he supposed to tell his patients tough luck, I have to take off to run my stepson to his grandparents as my wife is sick and can’t. But you won’t die or anything from my patient abandonment, so don’t sue me or anything? \n\nHow is that “isolation” or any kind of “red flag”?", "there could be multiple reasons. maybe the grandparents don't drive and expected her husband to drop the kid off even though he had to work? don't just assume someone is a shitty person without any real context into the situation smh.", "That's exactly what I was thinking! Herbal tea with honey and lemon will help soothe a sore throat, but it won't cure cancer. More context is needed for me to pass judgment on that specific part. I know plenty of doctors are quick to jump to medication when it really isn't needed, but I also know plenty of people who boarded the woo-woo ship and think stuff like essential oils are a panacea.", "Exactly. It’s the default behavior. There’s only a need to “make plans” if something is going to interfere with that.", "Still makes OP a huge asshole. Needs to make a choice", "Kids bio Dad isn't in the picture. Kids mom is married to Phillip. \n\n**Phillip is his father.**", "Me too! I'm full of angst now, I've always just assumed I would spend Christmas with my husband. And it's worked out that way since our first post-engagement Christmas in 2001, with no planning. But now I'm worried he will make other plans because apparently I've been doing it wrong THIS WHOLE TIME.", "He lurks, and he's going to find this hysterical when he comes across it.", "Marinara!", "Have a package delivered to her  on Xmas when she's at her parents'. \n\nLet her unwrap the divorce papers and add some weight to the 'present' by including a stone inscribed 'your heart'. And add a letter explaining why her family are morons. \n\nNot the mature option, but the fun, petty one.\n\nBonus immaturity points: add a glitter bomb so they have to vaccum every nook and cranny in the living room.", "Lucky her, she might get some alimony out of the deal too", "He can definitely do better.", "A pediatrician, hmm? We know she didn't marry him because she loves him and respects him. But he's pulling in doctor money. I wonder if he's thinking the same things?", "Lol, Den was such a piece of work.  I had forgotten about that.", "I want to see this now", "She's only four months into this marriage, and her family has already given her an ultimatum: \"your husband or us.\" And she's too blind to even see it. Not hard to guess what went wrong in the previous relationship.", "Yeah, the argument suggests he's more emotionally invested in the family unit", "Gosh, I had to go through that one as a kid. I'd go take a shower as soon as I woke up because the last thing I wanted was to go to school with my feet smelling like onion.", "The Middle Ages. Because you know they dealt so well with the plague.", "These parents are also responsible for vaccine-preventable disease epidemics that make schools dangerous for disabled kids, disable more kids, and kill their younger siblings and older relatives.", "He wanted to sell his own measles vaccine, there's pdfs of (his attempt) to get a patent for it. He wanted to drag competitors through the mud first.", "My kids are in their early twenties and were the only ones vaccinated amongst their peers. Kinda frightening. For me, it is a numbers game.\n\nOn the other hand, some natural remedies do have their uses. Homeopathic medicines are an ideal placebo - its pharmaceutical grade chalk lol", "OMG. thank you for that laugh. Not just an MD spouse...a pediatrician! Every pediatrician I've met is amazing with kids. The OP has an MD husband who is likely GREAT with kids AND has the holiday off from call AND wants to celebrate together! Wow...if I wasn't married, I'd slip into his DMs. LoL. \n\nHappy Holidays, u/BeatrixFarrand", "I wonder if OP would have found him so marriage worthy if he wasn’t a paediatrician (and presumably very well paid)", "This is such a good point, I was confused why OP seemingly non-maliciously is not defending her spouse against them (and not even asking about xmas plans) but seems like maybe a little bit of naivety combined with being used to her parents dominating her personal life for a decade.", "I can give you some of mine. But I kinda had the same reaction so you might want to pass.", "Same, I just snorted it, fun!", "Or am I the a hole for putting my son in the hospital because I let my mom try one her “ natural remedies” his illness now it’s worse", "Was I the only one who automatically assumed that's what the the issue was between the mom/sister and the husband. That they were discussing \"natural\" vaccination alternatives and he wasn't having it?", "My whole family is unvaccinated and our doctor says we are the healthiest family he has ever seen, and I mean the entire family 20+ people. Never even had a single flu or disease or anything barely a cold. No autism, no allergies, no glasses, asthma, Alzheimer’s or heart issues or cancer. So what’s your point?", "ha ha ha ha Thank you!  I have never seen that, it is perfect!", "Oh I knew that would come out!", "How do you know?", "Exactly. The fact that it’s Christmas is a plan in itself", "Yeah. “We didn’t have plans” = Christmas with the people IN YOUR HOUSE to most married families. What a weird excuse to try to justify her AH behavior.", "And probably their last. Seems she married him for his 💰 . Single mom with a 10 yo marries a doctor but does want ro be with him their first Chistmas and doesn't stand with him over her parents? Hope there was a prenup.", "I see what you’re saying & I’ve actually seen it & done it this way from both perspectives. \n\nSo while growing up my family talked about it after Thanksgiving bc they wanted to focus on 1 holiday at a time bc of all of the preparations involved in each, it just made it easier on them. \n\nThen as an adult, my husband & I waited bc we just didn’t want to talk about it bc we knew whatever we decided that one of our families would be upset/angry & we’d be miserable bc it was a lose-lose situation & just beyond stressful. So we wanted to just enjoy our Thanksgiving which bc of our work schedules we had set plans for every year so it was very easy to plan & it was a fun day we looked forward to. Christmas was a whole other monster that we dreaded & put off talking about until we had to….usually when one of our families asked if we had any plans yet. That was our cue to be like ok what are we doing this year. But when asked we’d just be like I’m not sure I need to talk to him/her about it, then we’d talk about it & go from there with letting everyone know our plans.", "It certainly does.\n\n I would go a step further and say, it makes OP a coward", "And he shows that being angry she will take Billy from him!", "I mean, he is a medical professional, and by definition, they are ignorant of how actual medication works. \n\nI have an MBA, but I'm also ignorant about a lot of fields of study.", "He is a medic, if you talk about something like that with a medic you better be prepared for him to completely disagree with your beliefs since he spent years of his life studying this and literally knows better than you.", "Disagreeing with someone does not equal starting a fight. You don't know what was said by the mother/sister.", "I think it’s weird how many people are offended by the word “ignorant” it’s not really an insult. It just means you don’t know something. I don’t speak French so I’m ignorant on the language but I do know a lot of other useful information so I’m not an idiot.", "Or maybe the family argues with him I can see why her ex did a runner", "You're killing me this morning!! Thank goodness I've already asked my partner of 36 years what are Christmas plans are. Of course, I did *start* with the assumption that we'd be together and went from there...", "How could you have been so foolish! Theres still time to rectify this!", "I would further put a package of ibuprofen to the parcel...you know, in case someone gets sick 🥺🤫", "Thanks! I’ve always liked koalas", "Of course!", "KFC Jamaica...Barbecue 🍗", "Curious how your classmates would smell your feet if you were wearing shoes and socks?", "Hahah - happily holidays to you as well, u/d0mini0nicco !! I mean for real. If I came home with that dude, my mom would throw a ticker tape parade!", "I love herbal healing, it connects me to my roots. I also have epilepsy and NEED prescription meds!!! Both are not mutually exclusive but some people think they have to be?", "if that doesn't work, I have a shiny rock that I found in my back yard, that can maybe, perhaps align energies or something.", "As long as it's not hemlock.   So much that is \"natural\" isn't good, or is ineffective.", "Potatoes on the feet? Onions all over the house? Literally drinking some essential oils? I bet OP’s mom would be smitten with all of the above.", "This is the impression I get as well. \n\n“Natural remedies” can mean a lot of things, like eating more ginger/garlic when you’ve got a cold or taking ginger ale/peppermint tea for an upset stomach. \n\nIn my experience at least, most doctors don’t get fussed over those sorts of things and will even encourage them (as long as whatever the problem is is mild and you’re willing to take medication when you need it, like paracetamol or antibiotics). But my immediate assumption was something related to vaccines or not using medication, which, yeah, he SHOULD be angry and upset about that.", "What about the mental retardation, though", "You’d think that, but since “it’s just a few hours away” apparently it pretty much equals a family Sunday dinner. /s", "That's what I was thinking! Like, my husband and I haven't formally sat down and \"the plan for Christmas is to be together with our children and open presents and eat and lay around all day\" but that is, in fact, the plan. There is no way I would accept another invite without talking to him first, and no way in 7 hells I would even entertain an invite that didn't include him.", "Yep. This would be a deal breaker for me. OP would come home to divorce papers", "Probably did marry for $$ because she sure doesn’t care about him apparently.", "He's angry *because* she's taking Billy. Dude has integrated little man into his life & she's alienating him on X-mas for toxic grandparents.\n\nNot smart & Billy is old enough to see what's going on.", "My partner of 6 years is going to her sisters to support her after a very, very difficult year. Which leaves me alone on Christmas, but based on the responses, imma hulk smash and destroy things that are important.", "So do I, but I am german. I love Malzbier.", "I agree. I use ginger tea for a sore throat, and Tylenol for a fever. I have prescription meds I need too, and no herbal remedies will replace them!", "St. John’s wort kept me alive when I couldn’t afford to get treatment for my depression", "I think there is a balance needed, and I also think that more research should be done with the more promising herbal/natural remedies.  Garlic, krill oil, and calcium are all natural", "I had to deal with anti-vaxer/natural remedy woman I when was a cashier at a grocery store she was trying tell that using essential oils was the best way to prevent you from getting Covid and COVID vax had trackers in it and that is how the government would keep tabs on people and it was going to give children autism. I took a big offense to that as I do have autism and not from being Vaxed", "Exactly I'm pretty sure that is what he was upset about. I'd also be upset and I'm not a doctor.", "yep... most doctor friends I know have zero problems with things like using lavender oil to relax or putting rosehip oil on skin... they DO HOWEVER have problems with people claiming that if they eat a lot of garlic they won't get covid lol", "Exactly...that's the sad part. What is she teaching him?", "I'm sorry your family is struggling this year. I wish you all peace and love in the dark times, and light and joy to come in the following months, kind redditor.", "My husband has to work and didn’t invite me so…same.", "It sounds as if you had a conversation with your partner about this, though. Your partner didn't unilaterally decide to go without talking to you about it, and seems to have a valid reason to go (to support family going through a rough time) rather than \"I prioritize spending time with my parents/siblings over spending time with my spouse\"", "I’m so sorry you had to deal with that. People are just terrible and don’t think before they speak.", "I can assure you he would never say that to a patient because a decent doctor understands that insulting others personal belief isn,t a good way to spread information. A smarter way would be to suggest following medical advice and ask their provider what kind of supplements they think are safe to take", "Some people just like to talk outta their ass  because their seems to stuck there", "Their asses become jealous of the amount of shit that comes out of their mouths.", "Omg rofl I love that!!", "YTA. Your husband is right to expect Christmas Day is first & foremost for the 3 of you. I’d never accept an invitation on Christmas Day that excluded my husband, it’s a really odd thing to do. Plus he’s a paediatrician, his knowledge of medicine trumps your mum’s, he would be negligent if he didn’t point out the risks. 🙄", "Taking your antivaxx family's side over your medical professional husband is a really terrible look - yta", "Your family is unreasonable. \n\nYou were ill. Your husband was accused of keeping your son away from his grandparents, but it was due to your husband's work schedule that the boy couldn't visit. And it really begs the question of why your son couldn't be picked up for a weekend overnight and returned home at the end of the weekend. \n\nYour husband is a pediatrician and you say your family is into natural remedies. \n\nNow, there's nothing wrong with soothing a stomachache with peppermint tea. \n\nIt's a totally different matter, for instance, to forego prescribed Tamiflu to treat a child's flu symptoms and instead, put potatoes in his socks and rub lavender oil on him. That's what some silly woman in Colorado, USA did after listening to her daffy Facebook friends. Her son is now dead. \n\nIf that's the level of use your family is engaged in, they *are* ignorant. (Your husband could have been more diplomatic if you were quoting him verbatim, but what else would you expect from a *pediatrician*?)\n\nNow, your family invites you and your son to Christmas dinner while explicitly barring your husband from the holiday celebration--and that's okay with you? \n\nSome wife you are. YTA", "YTA. \n\nYou don't defend your husband in any situation then ditch him on Christmas to be with the people that treat him horribly. \n\nWOW", "YTA", "Not only are YTA, but you’re dumb as well. This whole post was just you dragging your husband even when he was clearly in the right in every situation and you did nothing to stand up for him. Why did you even get married? Do you even like your husband?", "YTA\n\nYou husband is your most important family member now. Unless he did/does something TRULY aggregious you should be on his side and by his side.  \n\nHow can a decent person even consider leaving a loved one alone on Christmas? That's truly awful and cold hearted. Especially when he didn't do anything wrong.\n\nI'm shocked you even need to ask this.\n\nHonestly I'd advise counseling together and be open to learning healthy boundaries with your family. Your husband deserves better.", "YTA and so are your parents. Phillip did nothing wrong. You should have discussed this with him. You could have told him you wanted Billy to have time with your family (or whatever your reason is). Instead you went behind his back and sided with these assholes who don't respect Phillip's time or SCIENCE.", "*I told him it's their celebration and I don't get to decide their guestlist for them.*\n\nHow about you celebrate Christmas with your family - which includes your husband. He probably went overboard calling them ignorant (he  could've said it nicer), but it sounds like they were not nice to him before all this happened. So why aren't you on his side? Why aren't you supporting him? Why would you think it's ok to go spend Christmas anywhere except your own home if your husband is not invited? What happened to till death us part - oh except for Christmas or anytime my parents invite me. What is wrong with you?\n\nYTA\n\nOh and \"your parents being used to spending every major holiday with Billy\" - why haven't you explained to them that Billy needs to be with his parents during those holidays so it's all or none?", "YTA. Just get the divorce papers ready now and save all of you the hassle.", "Good luck on your 2md divorce. Apparently third time's the charm. YTA", "Why’d you marry a guy you will choose to pick your family over for major holidays? What’s he supposed to be doing in the house alone at Christmas with his wife and stepson somewhere else voluntarily? Cleave from your parents and cleave to your spouse or don’t have a spouse. YTA", "Were you born without a brain and a spine? Fascinating how you’re still able to function. YTA", " YTA for leaving your husband alone on Christmas, a time for FAMILY and he is your chosen family now. How would you feel if it was reversed? \n\nYour husband really did nothing wrong except being undiplomatic, since we don't have the full story on what condition they were trying to \"cure\" with natural remedies I'm going to assume it was a big one if it lead to your husband being a bit feisty. \n\nAnd finally, it sounds like your fam liked the ex more. And quite frankly you should make it clear that if they want Holidays with Billy, then they need to accept your husband too because he is part of Billy's life now, even more so because he's there 24/7 and Billy needs to know that stepdad is worthy of respect from your family.", "YTA. Your husband has to come before your parents now! It’s totally unacceptable for them to not invite him to the holidays.", "YTA x100\n\nHe's your husband. How are you not more concerned about your family alienating him? Also, the arguments you listed are silly. Your dad accusing your husband of \"keeping their grandson from them\" because your husband was working and couldn't visit? \n\nYo, you should be defending your husband against your family's incredibly idiotic reasons for not liking him.", "My ex and I managed to pull off an amicable divorce, which means we still do holidays together for the kids, including going to my parents’ house for a big Christmas dinner. I met my current partner several years ago, and he and my ex get along great. After he and I were serious, my parents decided that my ex couldn’t come to family Christmas anymore, which really upset the kids. I told my parents that if my ex wasn’t coming, I wasn’t coming. They realized the kids’ need to have their father there far outweighed their own discomfort with me bringing two guys to the party. If I can go to bat for my *ex*, you should certainly be going to bat for your *husband*. \n\nYTA", "Right? If we are a familial unit, you can damn well expect we are spending holidays together. That should be a given.", "I'll bet you she wouldn't go if her family told her that her son wasn't invited for Christmas. Poor husband is a second-class family member.", "I love how she tries to rationalize Christmas : it’s just a few hours away at my parents. \n\n\nYes, so is her wedding, just a few hours at a location. \n\n\nAnd so will be her marriage, a few months living with a roommate.", "I’m just jumping on here to say that I agree but I’m also thinking that the mother and sister were picking a fight as well, having a conversation about homeopathic remedies for a child in front of a pediatrician, when they are well aware of his personal stance on the subject.", "This. And you didn't even discuss it with him before accepting this invitation. YTA, OP.", "Calling them ignorant is going too far.  Some natural remedies are fine.  A lot of doctors are believers in natural remedies and partner with people.  Medicine like everything else is not black and white.", "I was so scared I would scroll down and the top comment wouldn’t be YTA. The “fights” were OP’s family getting mad when Phillip did absolutely nothing wrong. And damn, the fact he’s upset that both his wife and step child are going off and leaving him alone on Christmas? Valid to be upset and honestly just struck me as I read it like he’s probably a really good stepdad and for some reason the family is mad about that???? \n\nAlso I AM LOST ON THE CONFUSION HERE! I’m part of an interfaith family but like… it’s ASSUMED that my younger sister and I will be at the appropriate family member’s homes for Christmas Eve and Christmas and then my family actually comes to my place for a night of Hanukkah (I’m a convert, my parents are divorced, so Christmas Eve with mom, Christmas with dad, one night of Hanukkah with me) because FAMILIES SPEND HOLIDAYS TOGETHER!!!!! How the hell is OP going to abandon her husband on Christmas and say it’s not fair to her parents to not see Billy on Christmas? They can see Billy Christmas Eve, or they can invite Phillip and suck up whatever stupid shit they’re mad about.", "I literally scared the hell out of my dog when I busted out laughing at this.\n\nHope your husband gets back to you on those plans though", "I was married to a man where all the adult children and grandchildren stayed overnight at the parent's/grandparent's house on Christmas Eve and had Christmas morning there. After 5 years of this, I insisted we have Christmas morning at our own house, just us and our 2 children, and then join his family later that morning. He was so upset that night he threw a glass of water at me. Marriage didn't last long after that. No, OP really didn't get the concept of spending Christmas at home with her family (husband and son). She has probably spent every Christmas at her parent's house and sees this as normal. OP sounds like she has never cut the apron strings and her parents are fine with that.\nIf husband wants to stay married to her, he should stop wasting his breath arguing with her family, just stop!, and accept them as they are. BUT, he should also work on helping his wife cut the strings, even if that includes marriage counseling.", "Because she doesn't see her family as idiots, she's viewing the whole situation as consequences of her husband's behavior. He's being punished by her absence so he is forced to apologize and make nice with the family or be exiled forever.", "Kinda sounds like OP is an anti-vaxxer herself and takes her family’s side against an actual physician.", "I'm going to jump on this and ask; I'm kinda picking up on low-key anti-vax vibes from the mother and sister there. I can't be the only one there, am i?", "I mean I’m not “it cures cancer” crunchy but I am, “humans like to smell pleasant things so if you smell them you will probably at least mentally feel better” crunchy and this shit is just hilarious", "Lavender oil all around to sedate everyone; rose oil to \"encourage patience and love\\*\" and maybe burn some sage?\n\n(\\*from *Complete Aromatherapy Handbook* by Susanne Fischer-Rizzi.)\n\nI appreciate essential oils 'cuz they smell pretty.  But when I'm sick, I'll take medication.  When really sick, I will go to the medical doctor!", "☝🏼UNDER RATED COMMENT OF THE THREAD RIGHT HERE!!!", "I totally just sang that out loud to see how it sounds, and it's perfect. Now, to make this into a sound to use on TikTok. Thanks!", "I read it to the tune too 🤣", "That’s a riot. Bravo!", "> \"It's beginning to look a lot like F*ck This\"\n\nYou should change your flair to this. It's beautiful.", "I am sorry I dont have an award for this comment, please take my poor enby upvote. I did sing along in my head when I read it", "Take my Silver! Just take it!", "Even the definition of family in OP's post is part of the problem. She's not choosing her family over him - she's choosing her parents over her family.", "I thought maybe the husband presented himself poorly but then I think about what Healthcare professionals have been dealing with the last two years and I can imagine that many of them just have fucking no patience left. Seeing natural remedy, medicine objecting people causing more covid spread and more deaths when these professionals put in every bit of themselves to treat them has to just be beyond exhausting. \n\nOn top of that, if he's a pediatrician and depending on location, he is seeing children hospitalized, losing weight and strength from a massive RSV and flu spike and then seeing people be like \"a little essential oil will do it.\" \n\nI don't know, anything short of full on cussing them out seems fine when you think of the trauma medical professionals have dealt with in the past two years.", "Yeah, I feel like a judgment would be easier to make if we heard more about the initial argument re: stepdad \"keeping kid away\" from grandparents", "OP isn't blameless. I bet she never stood up for her ex either, the same way she's not standing up for her husband. OP should just stay single and dedicate herself to her family, as clearly nothing in her world is more important than mom and dad's Christmas, not even her husband.", "Exactly.  I notice that in OP's post there is almost nothing about their **own** opinion, only the wants of their birth family and their spouse.  That just shouts out Emotional Abuse since childhood, that they don't see their own wants and needs and opinions are also important.", "I had a screaming match with my SIL last year because I had the AUDACITY to say we wouldn't be coming to my husband's parents' house until after my kids' afternoon naps on Christmas Day. Apparently THEIR traditions were more important than my kids getting the naps they very much need.", "Why wait? I’d have them sent for Christmas morning…", "It sucks, at least it happened now. He can portably get an annulment depending on where they are. He and that poor kid deserve better", "Chicken and waffles is a thing, so eat as much chicken to your heart’s content.", "Its never the wrong time for Chicken", "Yeah. I’m not married but my SO has a rocky relationship with his family and he got invited to his mom’s for Christmas (spoilers: it went badly) but he ran it by me first. I didn’t want to go because of the stuff his family has done and I met his dad (that went VERY badly). Also whenever I have plans with family I run it by him too. Except the Christmas mentioned above we show up together or don’t go at all. Exceptions are made if we BOTH agree.", "THIS!!! As terrible as it is the family is not the issue (which is what OP's husband has said - she has chosen to ignore him). It's that she just assumed that he would be fine to spend their 1st Christmas as a married couple apart without even a discussion.\n\nThis is not a marriage that will last", "OP's husband must have a lot of \"buyer's regret\" at this point.  He's married into a family of loons.\n\nYTA, OP.  \n\nI think you married \"up\" too high for your ladder to reach.", "Husband should pick up some extra shifts over Christmas. Will pay for divorce attorney. He should just run", "That was my thought too! Like WTF.", "Right!!! We get a phone call from the matriarchs letting us know whose house and what time. Written invitations would be a totally alien idea for my family.", "Great question. We just get a phone call. Not even all of us. It would usually be the parents then they’d tell us as adults. And it was assumed that boyfriends/husbands and girlfriends/wives were invited", "I think that's exactly why they sent a written invitation. It's their passive-aggressive way of driving home the point that only OP and Billy are invited and Phillip is excluded.", "I thought it was probably an email, but now I’m picturing engraved invitations with a “save the date” and and RSVP. Which is hilarious.", "They hate him because he’s a paediatrician so he believes in science.", "Literally my first thought was “I think I know why the ex is no longer in the picture.”", "He’s free to refuse service if he believes there’s risk of a bad outcome or malpractice (people are sue happy and wouldn’t put it past OP’s family). My dad was a surgeon and would refuse service for those two reasons. Usually a patient won’t be happy regardless of what he does so he says no or something medical means the outcome would be bad (too much scar tissue in the affected area will impact how it heals for example). OP’s husband will likely refuse service because OP’s family already hates him and would likely not be happy with the treatment outcome.", "As an ex Healthcare professional, thank you! This is exactly it; patience ran out a long time ago and sometimes it's hard to bite one's tongue and keep quiet.", "Maybe, but the information we have to work with is that dad wanted to see the kid and husband was too busy with a bunch of other things to make time for a visit. Which is absolutely not a crazy thing at all. It sounds like it was a one time thing, not a recurring issue where he just never lets the grandparents visit.", "Benefit of the doubt: maybe she is abjectly apologizing to her husband right now. If she came to her senses.\n\nHa ha, right.", "I’ve been with my husband about the same amount of time as you and I’m literally kicking myself for assuming I had to spend all my Christmases with him.  So much time wasted spending a major holiday with the person I chose to live my life with!  Ugh, I feel like such an idiot!", "I too have assumed me and my partner will be spending Christmas together. He is hosting his family at our house which does make it a little awkward if I'm not invited....", "He lurks? Marinara flag, throw the whole man away, he's gaslighting your divorce papers \n\n😂", "Stone Heart! Love it! 🤣", "Absolutely fucking savage.\n\nI love it.", "And the actor was a convicted murderer ..... fact.", "I don't think he was objecting to peppermint tea for a stomachache. \n\nIn my own post, I cited a case in Colorado in which a mother listened to a Facebook antivaccination group that urged her to ditch prescribed Tamiflu and treat her son with potatoes in his socks and lavender oil. \n\nThe kid's now dead thanks to his mother listening to a bunch of wacky people. \n\nIf that's what's going on with this family, I don't blame a doctor for objecting to foregoing prescribed meds and using some \"natural\" remedy.", "Omg I was thinking the same thing. Why wouldn’t she choose him? Why is she defending her mean family?", "It’s only been four months, he can probably get it annulled if lucky. But that is definitely grounds for someone to divorce. That’s a YTA from me dawg.", "My family has a group chat, we're discussing pie flavors as I type this.", "My family makes Facebook events", "We don't even get a call anymore lol. It's a group text at this point.", "Exactly this. Especially with the last two years, quack herbalists and \"natural remedies\" should absolutely not be tolerated as an alternative to *actual medicine* that works.", "Lol, same. We’ve only spent 25 Christmases together, but we definitely begin with the assumption that we’ll be together wherever. And it’s complicated! Three families in different states. Many schedules to coordinate. But our conversations are what-day-are-we-celebrating-with-whom, not so-what-are-YOU-doing-for-Christmas-this-year?", "Bold of you to assume. I hope you don’t get let down!", "My brother is a doc and my mom wanted him to set me up with one of his single friends in med school despite us having NOTHING in common and my having absolutely NO background or knowledge about his culture (which was important to him, dude only wanted another Nigerian and my mom thinks he's gonna go for some frumpy white single mother?). When she learned he got a new gf she looked at me with a sad face and I was like, \"Lady you are literally delusional. And I already told you I only date women now.\"", "This is the important bit. So many people don't believe that they can coexist. I run every supplement or tincture by my doctor before I start them to make sure they won't interfere with my medication. She fully supports my dives into herbalism because it was the original medicine and has helped me. It's the antivax, antiscience, crunchy to the point of being crispy folks who give us a bad name.", "Exactly. My daughter had a fever last night. I gave her some Tylenol because it’s 2022, and there’s no need for her to chew on willow bark, but i also put a drop of lavender oil and a drop of eucalyptus on a damp cloth and gently wiped her face and neck while she slept to help cool her a bit while the Tylenol kicked in. The lavender soothed her a bit and the eucalyptus opened up her sinuses, and she was able to rest a little better, but it was an extra, not a substitute.", "There are people who push natural remedies even over trained medical professionals, usually making the problem, worse, and often interfering in the treatment of someone who could feel better if they just kept their mouth shut.\n\nI am seeing it happen with someone I know right now. Diabetes, kidney failure, amputation, and they’re trying “natural remedies” that are making the problem worse. \n\nIf you see vitriol in the comments against people who go overboard with natural remedies, it’s probably coming from people who’ve had to deal with familial idiots who have literally killed a loved one.  by not getting them proper medical attention.", "I like to use both, as well", "It’s the difference between using natural remedies as a complimentary treatment (with western medicine) or alternative (solely to replace western medicine). I use herbal and homeopathic remedies for many things, but they do not replace things like antibiotics or my other medication.", "Currently have a cold and am taking cold meds but also using honey sticks to help my sore throat so I won't cough so much.", "Exactly!  My family doctor thought it was great when I told him about the essential oil mixture I put in those little roller ball bottles for my kids to use on their mosquito bites (less itching and swelling). But I also make sure we're all up to date on our vaccines and get actual prescription meds when needed.\n\nIn some situations natural remedies are great, in some situations they're not.  And a doctor will usually know the difference.  I am sure OP's husband wasn't picking a fight over nothing.", "Of course, people should still talk to their doctors about their alternative medicine. I found out that antioxidants, like kale, cause nausea to be significantly worse during chemo. So all those healthy smoothies? They are why your anti-nausea drugs don't work!", "Gift wrapped?", "How much extra do you have to pay to get a locksmith to come over on Christmas?", "It does seem that way and if I had a partner that did this, papers would be front and center when she got back. It seems like she tried to hide it as well and got caught. If that’s the case it makes things so much worse. \n 4 months and your already doing things behind his back? Smh", "We also have a group chat, and a spreadsheet because we're a big family and spread all over the country. We put the days we're planning to visit in the spreadsheet so mom can see where we overlap and plan the best night for the Christmas dinner. No one is ever uninvited.", "I’m sorry you’re spending Christmas alone but thankful your partners sister will have company. I spent it alone one year and watched Christmas movies and made peppermint hot cocoa and ate Christmas treats, it was delightful. I got to see my family and partner a couple days later though.", "He's rarely let me down, and never, ever on the holidays. A perk for marrying an only child.", "Don't worry, it's only a meter of time till your mom realizes your brother must have some _lady_ doctor friends and then she'll try to set you up with them.", "It’s amazing the way moms… are.\n\nI was a spooky goth kid, right through my twenties. Mom was like “you know, so-and-so’s son is a professional baseball player!! I thought it might be nice for you to meet him; he would be such a good match with you!” (You see, his mom was Catholic and so was mine, so… perfect!!)\n\nI was like “mom a pro baseball player is not in the market for me, and I am 100% certain I am not interested in discussing baseball ever.”\n\n“Well, I just thought it would be nice” \n\nMmmhmmm.", "> I run every supplement or tincture by my doctor before I start them to make sure they won't interfere with my medication.  \n\nThis is the key point others are missing.   You may get relief from alternative medicine, but the interactions with western medicine can be dangerous.  \n\nI actually would run them past my doc as well as the pharmacist.   Not all docs are all that well schooled in all  interactions and a pharmacist deals with that stuff on a daily basis.", "My daughters pediatrician prescribed an inhaler for a cough and warm honey water for the sore throat it was causing. It sad that so many people think it needs to be one way or another when the meds can often treat the illness while the herbal remedies can treat the symptoms. When I was pregnant I also ate a lot of ginger hard candies for my morning sickness", "You can totally use modern medicine and herbal remedies. I take allergy and cold meds, antibiotics and ibuprofen when I need to. But, a warm cup of tea with honey, ginger, cinnamon, turmeric and red pepper flakes is so comforting when I'm sick or have cramps. And valerian root really helps me sleep. You just have be realistic.", "This. Ginger tea for throat can be really great, it helped me a lot. However, the prescription meds are also needed. It's the balance that brings the best results.", "If natural remedies worked, we wouldn’t have doctors and natural remedies would be a lot more expensive than they currently are. Pharmaceutical companies would charge the hell out of that stuff if it were a cure all for every ailment out there. Sure, some things may help soothe mild symptoms or may be a preventative but we have doctors for a reason and mom needs to respect her son in laws opinion. I have a friend who’s mother had cancer that was treatable. Her husband insisted holistic remedies would cure her. She died because the holistic remedies obviously didn’t cure the cancer and it was too late for chemo and radiation. My friend is very upset at her father for it.", "The same. Ginger tea is the only thing that helps my nausea when I have a migraine. Lavender oil helps too. But you can bet your mortgage I’m also taking pain killers at the same time.", "St Johns works better for my anxiety and depression and general malaise than prescription ssris and doesn't bother my stomache like ssris do. Love that stuff. No side effects, no general dampening effect.\n\nYou would have to take my prescription anti-migraine drugs away from me over my dead body though, no amount of natural or herbal treatments did crap. No reason to not use both.", "Ugh I missed my garlic quota ONCE and ended up with Covid. I’ve now doubled my intake and it has had the added bonus of keeping people away, PLUS I’ve never been bitten by a vampire, so there’s that.", "I know the garlic for Covid is a lie. I looooove garlic and I've still gotten Covid twice. 😅", "I eat a lot of garlic because I love garlic.  It’s just pure happenstance I haven’t been attacked by the plague yet.", "Ooh, what's your mozzie recipe?", "We use eucalyptus oil spray for mozzie bites too. \n\nSomeone once told me that eucalyptus is actually an effective insect repellent and while I can’t say if that’s actually true or not (Im apparently very delicious and seem to get bitten regardless), at the very least, aside from antibacterial/anti-inflammatory properties, just smelling the eucalyptus helps me feel better about being attacked by mozzies.\n\nWhen I used to get bad panic attacks, I used eucalyptus oil for that too. I’d spray a bit on my wrist, and sniff it to give my brain something else to focus on and help calm me down.", "100%. It’s important to remember how medications and natural remedies can act and react to each other, as well as just your bodies own rhythms. \n\nI take adhd medication, and anything with vitamin c (Like the orange juice I was drinking every morning) actually reduces the effectiveness of it. Same when you get your periods, your adhd medication often reduces in effectiveness.", "I love the idea that the government invested a bunch of secret money to create a fake/new disease so they could have an excuse to create a \"vaccine\" that was really just a way to get super tiny (and probably very fucking expensive) microchips into people to track us..... And that people will discuss this conspiracy theory *online* through their phones and computers, which people voluntarily paid for and already contain all the tech needed to track anything, *and* it's well-known how much data a person online generates and that that is then sold off to third party companies regularly.\n\nYes Susan, it's the *vaccines* that are gonna getcha.", "Holy shit.. the government is trying to track us?!! /s\n\nThis lady is obviously unaware of birth certificates, social security numbers or driver's licenses. (Or vehicle registration, mortgages, bank accounts or any of the million sites she signs up for online that track her every friggin' click on doterra or revive )", "As an older adult with ADHD who has to jump through stupid hoops to get medication, and has too many people suggesting that I try harder or try some sort of woo-woo instead, I sympathize with how so many people’s ignorance about autism makes your life less pleasant than it should be.", "Pharmacist always.  I have had major interactions because I have several different doctors prescribing stuff and even when I hand them my three ring binder full of every Med I am on, they don’t know who doesn’t play well together.  But the pharmacist does..or can check on the computer easily.", "That's a very good idea!", "Same, I learned how to make the ginger salad dressing and ate salad alllll the time!!!", "Ginger is the best! I have a history of chronic nausea from IBS, and really struggled with it earlier this year due to a medication side effect. I was extremely reliant on Zofran, but it has a potential interaction with 2 of my other meds (long QT interval, specifically) so I wanted to take it as little as possible. I started using ginger a few months ago, and was soon able to stop taking Zofran completely! I also technically use sodium and potassium salts as a prescribed “natural remedy” for POTS, along with medication.\n\nGinger is a great natural remedy for nausea (and a few other things), but I still need my other medications for narcolepsy, ADHD, inappropriate sinus tachycardia + POTS, hypothyroidism, GERD, heavy menstrual bleeding, allergies, etc. Ginger helped with the side effects of one of my narcolepsy meds, but it can’t treat any of the underlying conditions, and that’s ok.", "Yes! The world does not have to be seen as black and white", "Can't argue with facts!", "Yup, nearly every meal I eat is with garlic and covid still hit me like a train. 😭", "I can't find the exact amounts right now but basically \n\nLavender Oil\nPeppermint Oil \nand any carrier oil \n(extra virgin olive oil is usually in my cupboard already so I just use that)\n\nMy kids love it and it's natural & inexpensive so they can just apply it themselves throughout the day.", "People who know nothing about autism or ADHD automatically assume it means we are less intelligent then “normal” people and as I said I have autism but I have done college and got both my masters and bachelors degrees and I am still in school getting a certificate in project management.", "Wait..ginger salad dressing?!  Share please!", "You can't just say that and not share the recipe! Lol", "Your degrees are definitely nothing to sneeze at! They are obvious evidence that your intelligence is above average.  I hope your career matches your potential.", "Seconded! Recipppeeeee 😁", "I hope/bet husband is looking at an annulment. I would too, I can't believe he's suffered her this long tbh. He deserves better, full offense OP.", "Ya and to give you an idea of why your sister and your mom made you husband so upset. Just google the story about the couple from Calgary who are now facing jail time because their son died when they tried to treat him with home remedies. He had meningitis by the time they took him to the hospital it was too late. There are many more like \nYour husband is mad because “home remedies” can result in a preventable death. \nAlso I could not imagine leaving my spouse alone on Christmas. Even for a few hours. You are right you can’t control who your parents invite. But you can decided not to go.\nYour poor husband probably feels so rejected and unloved.", "YTA\nRemove yourself from the situation and see it from an outsiders perspective. You’re a family now. \n\n\nI’m getting odd Oregon trail vibes….\nCholera, diphtheria, measles, polio- smear some herbs on it", "Yeah, OP's whole story is a whole lotta crazy, but the point I keep coming back to is the one that I think is most telling about OP's lack of understanding about how a relationship is supposed to work--she made plans without consulting her husband because they didn't  have any plans for Christmas. She made plans *without talking to him*. She made plans for her and their son (because Philip seems to rightfully consider Billy his now) to spend Christmas *without him*. And she didn't think he'd mind because *they hadn't made any plans for Christmas.* This is just bizarre.", "I totally agree with the above. There are a lot of people that are offended to be called ignorant, but that is NOT the same as calling someone stupid. Ignorance is curable with knowledge, willful ignorance on the other hand  is a sign of stupidity.  He was being polite by not calling them stupid. \n\nOP clearly doesn't want this marriage to last, probably because she was used to being a single parent and is now unable to think in terms of being part of a married couple.\n\nOP, YTA.", "100% agree with this one. To me, everything else could have been ironed out with communication, even going to OP's parents' house for Christmas and leaving the husband behind, but only if they'd talked about it beforehand and agreed that that was the plan. It sounds like the spouse only found out after the fact, and that's not okay.", "🎶 It’s beginning to look a lot like divorce, sign the dotted line 🎶", "Others have said that Philip was rude to use the word “ignorant”,  but I bet Philip has seen the consequences of this kind of parent too often to suffer these fools politely.  \n\nInconsequential ignorance (not knowing that tomatoes are fruits) should be politely ignored or gently corrected. This is not that.", "Lavender oil, and thoughts and prayers ought to help. (Snicker)", "Look, if Philip wanted to celebrate Christmas with her he should have sent her a paper invitation so she'd know that he *had plans to spend a holiday with his wife.*", "And any normal person should be sad about someone spending the holiday alone (unless that person wants to). OP seems thoughtless. Not to mention he's a doctor and may not get every Christmas off", "She probably thinks she a prize and he’ll never leave her. She snagged a paediatrician!! She’s so hot (in her opinion) so she can treat him badly", "Yeah, I thought this myself and didn’t have the heart to say it", "Maybe he went on vacation and OP didn't know if she was supposed to go with him?", "Good old Den & Angie…well before my time but everyone in the UK regardless of age knows that storyline…", "If Philip is a pediatrician, it’s likely he’s spent the last few years seeing children die or become disabled from Covid because their parents decided to treat them with horse paste and vitamin overdoses instead of bringing their children in for medical treatment when they couldn’t breathe. After seeing the effects of that firsthand, I’d be enraged at people who believe that crystals and fancy water can cure RSV.", "If i knew how to give a reward for an exceptional good addition to a conversation/argumentation i would give it to you. I did give you an upvote thoug", "lol 'we didn't have any plans for Christmas'? uhhh spend it with your husband and kid goes pretty much unsaid id think too.", "Poor guy, he can do so much better than someone who not only doesn't stand by him but call him \"melodramatic\". And poor Billy, thanks to his mother's foolishness he's probably going back to be raised by a single mom soon.", "Our family used to rotate hosting duties, so I think all the women basically made a series of phone calls to determine whose turn it was (or who really wanted or had capacity to host) and what everybody was going to bring.  I always kinda liked that these things were determined as a collective.  Not…whatever these people have going on.", "My sister literally texted me last night to see what we're doing for Thanksgiving 😂. We had no plans so now the kids and I will be going to her house about 2hrs away. My husband has to work so he's not going, but we're doing Friendsgiving with his sister tomorrow.", "In my extended family you don't need invitations, not even a call, just show up at anytime during Christmas and there will be a seat and food for you. Many Christmases ago we used to do a Christmas tour visiting all my uncle's and aunts from my father and mother's sides, we eat a lot... \n\nSadly since then a lot of them passed away and family tours have gotten shorter because those large family gatherings are not so common now, but still we do a couple visits each Christmas ⛄", ">And if a person isn't specifically mentioned in the invitation, they're not welcome, like they have a bouncer at the door checking the cards?\n\nNahh.. 99 % of the time, as long as the carriages check out, the manservants will just let them in.", "yup...i've never seen anything like that from my family.  the weirdest i've seen was when my SIL wanted us to call her and ask for permission to show up... my brother was very mad at her.", "pretty much what i thought.  dude needs to get out of there for his own sake.", "It doesn’t absolve OP, but I think such a family culture may be highly relevant to her learned behaviors", "You mean he’s spying on you on Al Gore’s public internet?!?! Well now you’re definitely justified in spending Xmas doing a homeopathic ritual with people who hate him because he has a job.", "Holy shit, this is their FIRST Christmas together??!  I missed that part, I assumed they'd been married for a while. She's merrily skipping their first Christmas as husband and wife.\n\nSomeone's getting divorce papers for the holidays.", "Yeah, and I don't think OP realizes that if her husband divorces her this quickly, she's not entitled to alimony.", "Oh no not the alkaline water. Don’t even get me started on that nonsense.", "I appreciate the upvote!  Don’t waste money on virtual awards.", "Phone call? We get a text!", "We get a group text from my aunt who usually arranges things, and it always devolves into everyone sending crass gifs back and forth. It's basically tradition at this point.", "They hate him because he doesn’t jump when they tell him too. They can’t control him and he speaks his mind. He doesn’t let them bully him.", "Lol🤣🤣🤣", "My lurker spouse pulls up my old comments and reads them to me sometimes. \n\nI *did* think it was sweet, but now...\n\n*side-eye*", "My Nana still brewed tea from willow bark when I was a kid and it worked better than Tylenol- but that’s just bc willow is high in Salicylic acid. Herbalism shouldn’t be approached by lay people. If you’re not a botanist, contact your medical professional *before* rubbing your kids down with something from the garden. EDIT to add that lavender and chamomile make a great night time rub for babies. The smell’s relaxing- but J&J sells the stuff. No need to break out the gardening gloves.", "Honey and lemon for sore throats, vaccines for whooping cough", "Omg we have the same plans! Guess I better go write up an invite so my husband and kids know we have plans and don't try to ditch me!", "I called my mom yesterday just to ask about how deep their pie plates are and what ingredients they already had lol. Apparently I'm the only one making apple pies for Thanksgiving for at least 30 people.", "Just put sweet potato in the chat and then put it on ignore", "I like to make a pumpkin cheesecake topped with a pumpkin chiffon. Guaranteed crowd pleaser.", "A phone call is definitely the preferred option over trying to decipher my grandmother’s texting attempts lol", "This gave me a chuckle. Just for future reference though, being from a different culture isn't usually a big issue if the parties are open and interested in learning about each others cultures. I say this as an African who also really cherishes some aspects of my culture and who's dated people from other countries without issues :) so if your brother has a Nigerian lady doctor coworker and you hit it off, I say go for it! You'll learn some awesome recipes at the very least lol", "I had a doctor that would prescribe meds when need, alternatives when needed. Great doctor.", "Try peppermint herbal tea with honey and lemon for sore throat. The peppermint has menthol that will help open your airways, the honey soothes the throat, and the lemon reduces the swelling.\n\nAnd it tastes nice, and none of it will interfere with whatever actual meds you may be taking for strep throat or whatever.", "I always use St Johns Wort as an example when doctors say herbal medicine does nothing. The list of interactions with that stuff is huge.", "I’ll go change his locks for free. My SO would come with me.", "Not gonna lie, it's already on mute, they were giving me away too often at work. Chatty Kathys the lot of them.", "Well, that’s just rude.  How dare he?!", "My wife just experienced a nasty side-effect from combining meds. Pharmacist tried to warn us, but the doctor said “it should be ok.”  Big nope on that one. From here on out, we’re giving a little more weight to the pharmacist’s notes.", "A great example of this being St John's Wort, and hormonal birth control. St John's can significantly reduce the effectiveness of hormonal contraceptives.", "Here to second this! I have a long list of chronic illnesses (stemming from a genetic disorder) and therefore, an even longer list of long-term medications. Any time I start something new, for any reason, I ask my regular pharmacist to go through the list for me and make sure it's not going to interact with anything. Several times in just the past year, she's saved me from potentially serious harm and sent me back to my GP or specialist for an alternative medication. Always has recommendations, too.\n\nPharmacists are the experts on meds, supplements, herbal remedies, etc. and how they can interact.", "Take my poor woman's award 🏆 This is so true. The pharmaceutical science as we know it today literally has its roots in ancient natural medicine, so the two very much go hand-in-hand. It's just wild to me how people treat doctors like they're witches in Salem or something.", "Same, I never understood the all or nothing approach. There is absolutely a  way to have a healthy balance between herbal remedies and medications when necessary.  Sore throat: lemon ginger tea with honey. Cough with cold: hot tottie and some Tylenol. Sinus infection : prednisone. \nI have bad anxiety related to hospitals. Needed a procedure and while they were getting me anti anxiety meds for IV a nurse put a lavender oil patch on me ‘ to help calm my nerves’. \n\nI said no thanks but she’d already attached to me. It did nothing but now make me associate lavender scented stuff with suffering and anxiety🙃", "Or the fact that they get a sample of blood and finger and hand prints at birth?!", "I had a manager tell me the virus wasn't real and it was all political propaganda. (my mom's an elective surgery surgical nurse and was bounced from unit to unit during the worst of the pandemic, and saw it all) I lost it, told him what my m does, how she sees hundreds of patients die on ventilators and their families not be able to be with them. Only to say good bye via video chats.\nThose who never believed and still don't drive me insane, especially the anti-vaxers!", "Like the government would EVER be that efficient…", "i literally work in a doctor’s office and one of my doctors does exactly this for patients with complicated medicine regimens who are seeing multiple specialists. the moment you feel you feel overwhelmed or unsure about the safety of something, always double check with your pharmacy team.", "I once asked my doctor about a potential side effect of a medication. It was a rarer one, not a well known one. He looked it up right in front of me to double check. I respected that. A lot of doctors would be too prideful. He can’t remember every single potential side effect of every medication. I was very happy that he did that.", "In what form do you take ginger? One of my kids gets nausea from IBS, and I would love to share this with them.", "If you aren't limiting sugar, try crystallized ginger."]}