{"id": 27133, "submission_id": "16lwplc", "title": "AITA for being honest with my friend about what I deemed to be poor behavior on vacation?", "selftext": "TLDR at the bottom\n\nI 24F just went on a trip with my 24F best friend. We have been best friends for 6+ years with minimal but normal conflict along the way. We are generally both really good at communicating and resolving things. We have also traveled together previously with minimal issues. \n\nMy friend is on the autism spectrum which sometimes presents sensory and social issues for her. She has improved dramatically over the years but still sometimes struggles. \n\nOn this trip, she was rigid and inflexible, and when things didn't go according to plan she would pout and whine like a child. It really threw me off and I felt like I had to be ten steps ahead to make sure things didn't go wrong or she would get upset. More than a few times this was blamed on her autism. When we returned and her mom picked us up from the airport, the whining intensified and she even started yelling at her mom in the car, which is really odd for her and I was appaled. I knew we were both tired but her mom was really helping us out and she was treating her so poorly.\n\nI really tried to accommodate her (doing what she wanted, eating where she wanted, taking middle seats on planes so she wouldn't be close to a stranger, etc.) But it never seemed like enough and she seemed pretty unhappy for most of the trip. \n\nAfter we got home, I took SIX DAYS to write a message to her, to make sure I was gentle and concise. I commended her on how she has improved on these things over the years, but stated that it really took away from the trip for me. I reassured her that I still wanted to be friends and travel together, but I was hopeful that she would work on being more flexible, positive, and appreciative of the people in her life. \n\nShe got extremely upset, told me the criticism was unfair and I basically called her a mean, inflexible child (I was so careful to be kind and focus on behavior, not making it about her overall character) she didn't want to travel together anymore, canceled on upcoming plans to see a concert, and has ghosted me since. \n\nAm I the asshole for giving her potentially unfair criticism? Should I have left it unsaid and just not traveled with her again? \n\nTLDR: traveled with a friend who behaved very poorly imo. Spoke to her about it afterwards and now she doesn't want to be friends. Am I the asshole for criticizing my friend?", "created_utc": 1695046428, "permalink": "/r/AmItheAsshole/comments/16lwplc/aita_for_being_honest_with_my_friend_about_what_i/", "score": 129, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I criticized my friend for behaviors rooted in her autism and I might be the asshole for criticizing her instead of just letting it go.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", ">Should I have left it unsaid and just not traveled with her again?\n\nNTA. If you really value this relationship then it might be have been better to either 1) let it go and not travel again; or 2) have the discussion when/if a future trip is being considered.\n\nSome people just aren't great travelling companions, autistic or not.  There's no assholery in deciding that someone just isn't a good fit to share leisure time with.", "NTA,\n\nI’m not autistic but I have ADHD and I can get very stressed when travelling doesn’t go to plan and can sometimes snap at my husband. \n\nThat being said, I always apologise for snapping if it’s not his fault something didn’t go to plan and work on not snapping at him when I get stressed over something that it out of his control.", "NTA its always the right thing to communicate your feelings, with words chosen carefully of course, and also potentially give feedback/criticism on how she can improve in interacting with others! Totally the right thing to do OP", "NTA,\n\nyou did your best to comfort her while on the trip, but it’s also right to stay true to yourself and towards your friend. \nDon’t hate me, but imo being autistic isn’t a excuse for this kind of poor behavior (ghosting).", "NTA. I wouldn’t put up with this behavior on my holiday, not from any of my neurodivergent friends.", "NTA\n\nYou were walking on egg shells on your holiday because of her. Respectful and honest conversations are a hallmark for a healthy friendship imo. You were patient with her, tried to accommodate her and did your best to keep a positive attitude and you have the right to share how her behavior affected your experience. \n\nShe may be more sensitive to criticism than NT’s, but that doesn’t mean you have to do all the work in this friendship and that you just have to just accept her moods. It sucks, but ND’s sometimes have to work harder than the average Joe to compensate (also ND here). \n\nI hope she comes around and realizes that. If she does, I hope you can forgive her for needing some extra time te process and reacting poorly. Maybe something’s going on in her life that she hasn’t told you about, because you’ve never had this issue before?\n\nIf not: Maybe this was never going to be an equal relationship and it’s best that it ended here.", "NTA.\n\nSince many people on the spectrum are bad at getting social clues, maybe try the direct approach. Tell her exactly, with examples, how her behaviour soured your vacation.\n\nIf she doesn't want to be your friend anymore because of critismn, it's only her loss.", "You are NTA, but I think just offering these things for context (as a person on the spectrum and with a kid on the spectrum)-- \n\nFirst, you went above and beyond to accommodate your friend's needs. Not her wants or her whims, but what she needed in order to attempt to feel safe at any given moment. You really went above and beyond to try to understand the behavior and adjust to make situations better. \n\nSecond, autistic people mask. That means they use an enormous amount of energy to try and present as socially acceptable in situations where they know others demand it. They hold so much back. What you saw when your friend was finally with her mom wasn't tantruming with her mom. She was just finally able to unmask and exhale and her mom, as her safe person, took the brunt of that. She's probably used to it. School is also a high masking time. Like when people go home and take their bra off or change into their comfy pants and let it hang out? That's what unmasking is like. Ironically when my kid is being the meanest to me, it's because I know he feels the safest with me. \n\nThird, your friend probably needs more time to figure out how she responds to traveling and how she might be better able to proactively ask for her own accommodations or your support in traveling, should you decide you want to do that again. It wasn't until I met my wife and we started traveling together that I realized that, although I loved it, I was so off baseline, even just from the moment of packing my suitcase. I often didn't realize the anxiety I was sending out to her through my pores. Compassionate observation of my behavior helped me realize what I was doing and gave me a lot more insight into my behavior, and also empowered me to plan better for myself. I'm 42, by the way. \n\nYou are an amazing friend, especially at your ages. I imagine this was blindsiding for you and you rolled with it so well. I just want to say-- you don't HAVE to travel with this person because they're your great friend and you feel guilty not to because they're on the spectrum. The truth is that your friend's needs have real life implications and impact your ability to enjoy the trip you planned and paid for. Putting a pin in traveling with your friend doesn't make you TA, AT ALL. \n\nEveryone should be so lucky to have a communicative, open, thoughtful and accommodating friend. My guess is she's still a little burned out from traveling and is deflecting in her response to your communication with her. I think she will come around. \n\nKeep being awesome.", "NAH.\n\nBeing autistic doesn't excuse her from the necessary process of resolving conflict between friends. It has to happen or people aren't really friends, IMHO.", "NTA. You tried to tell her and she's being a jerk about it. I would never travel with her again if she was my friend. Things happen when you travel. Plans change and if she can't roll with it who needs the stress of her whining and complaining. You can find plenty of chill people to travel with.", "NTA You went above and beyond while on the vacation to keep the peace then took the time to carefully word a letter addressing your concerns. Had you not cared you could have just written off the friendship. If this were me I would choose not to travel with her again, having learned that some people are just not great travel companions but can still be good friends.", "NTA... despite her response, giving this feedback was essential.  Bonus is that you wont need to travel with her anymore.", "NTA. \n\nI'm also on the Spectrum, and traveling is incredibly overstimulating for me, so I can understand her needing certain accommodations while traveling to avoid a meltdown, but that doesn't excuse her behavior and she's in for an incredibly rude awakening if she pouts that badly over life not working out the way she wants. I don't want to assume this was her behavior 24/7, but if she has a meltdown over you calling her on bad behavior and giving some constructive criticism, she sounds like a toxic af \"friend\" who you'd do better without. \n\nP.S. Kudos to you for having more tact than I would and waiting until after you and her got home from vacation. 👏🏻👏🏻", "Obviously NTA, she's the A H here. It's hard to say whether communicating this to her was the totally right decision - I think I would have been inclined to not say anything to her but also never travel with her again - but as you've been friends a long time and approached it with a lot of gentleness and consideration, deciding to handle it this way does not make you T A.", "NTA. Inflexibility to adapt to change is one of the biggest symptoms that autistic people must learn to cope with. I’m autistic—spontaneity stresses me out and too much change from established plans can be upsetting. But it’s MY job to deal with it because there will always be circumstances outside of anyone’s control. She needs to be better. Autism is an explanation, but not an excuse\n\nEdit: and I will say, that accommodations are good! But there’s a limit. There’s only so much someone can accommodate for, so compromise is necessary.", "ESH\n\nHer behavior, especially yelling at her Mom, seems particularly inappropriate. \n\nHowever, there is no wording you can use that will make your statements come across as anything other than a giant pile of criticisms about her personality. Of course she's upset. Of course she doesn't want to be around you.  \n\nEven if you are right in all your assessments you just don't travel with her anymore.  That's the answer.", "NAH\n\nYou did the best you could but it sounds like it might be best to not consider her a good travel companion anymore, assuming she cools down and you guys can talk this through.", "ESH - but gently.\n\nFirst, I have to do all of those things when I travel with my husband. He doesn't get whiny - he's a very big man and he appears hulk-like and threatening even when he is minding his own business. And he HATES imposing on strangers and is SUPER DUPER introverted. So I have to sort of run interference. He's also very bad at recognizing that he needs to eat, drink water, etc. so when we travel he will do things like decide to skip lunch - and then we are both very tired, hungry, cranky, and unable to make decisions. I have to \"be the bad guy\" and insist we stop, rest, drink water, etc. He's totally worth it and 20+ years in I am finally figuring out the best way to deal with things.\n\nBack to you: I am not a fan of offering people negative feedback. Your friend is an adult and probably WELL aware of being a total pill. And she may also be HIGHLY susceptible to internalizing criticism and making EVERYTHING personal. Let your actions speak for you. Go to the concert but sit where YOU are most comfortable. If she whines, tell her RIGHT THEN that she is being unfair/difficult/mean, etc. Decline future travel plans or if you do travel with a difficult travel partner either accept that you have to accommodate them to keep the peace or speak up and refuse the middle seat, refuse the bland meal, refuse sleeping in until noon, refuse to get dehydrated because they are too cranky to stop. Basically, insist on YOUR needs being met in the moment and stop being so accommodating if it makes you upset to the point of calling someone out later.", "YTA because your list of criticisms is literally a list of fairly typical autistic behaviors.", "YTA Ah, what we all long to receive: a letter from our friend delineating all of our bad behavior.\n\nSeriously, couldn’t you have just, you know, *talked* to her?", "[deleted]", "YTA, your last comment was exactly what you should have done", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTLDR at the bottom\n\nI 24F just went on a trip with my 24F best friend. We have been best friends for 6+ years with minimal but normal conflict along the way. We are generally both really good at communicating and resolving things. We have also traveled together previously with minimal issues. \n\nMy friend is on the autism spectrum which sometimes presents sensory and social issues for her. She has improved dramatically over the years but still sometimes struggles. \n\nOn this trip, she was rigid and inflexible, and when things didn't go according to plan she would pout and whine like a child. It really threw me off and I felt like I had to be ten steps ahead to make sure things didn't go wrong or she would get upset. More than a few times this was blamed on her autism. When we returned and her mom picked us up from the airport, the whining intensified and she even started yelling at her mom in the car, which is really odd for her and I was appaled. I knew we were both tired but her mom was really helping us out and she was treating her so poorly.\n\nI really tried to accommodate her (doing what she wanted, eating where she wanted, taking middle seats on planes so she wouldn't be close to a stranger, etc.) But it never seemed like enough and she seemed pretty unhappy for most of the trip. \n\nAfter we got home, I took SIX DAYS to write a message to her, to make sure I was gentle and concise. I commended her on how she has improved on these things over the years, but stated that it really took away from the trip for me. I reassured her that I still wanted to be friends and travel together, but I was hopeful that she would work on being more flexible, positive, and appreciative of the people in her life. \n\nShe got extremely upset, told me the criticism was unfair and I basically called her a mean, inflexible child (I was so careful to be kind and focus on behavior, not making it about her overall character) she didn't want to travel together anymore, canceled on upcoming plans to see a concert, and has ghosted me since. \n\nAm I the asshole for giving her potentially unfair criticism? Should I have left it unsaid and just not traveled with her again? \n\nTLDR: traveled with a friend who behaved very poorly imo. Spoke to her about it afterwards and now she doesn't want to be friends. Am I the asshole for criticizing my friend?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA It is very difficult to find the perfect travelling companion. Your friend is not it. You can't change people so tht you have a better time travelling together. So knowing that she is drag on a trip, it would be foolish to ever plan another one with her. Not that you can't remain friends, but just know she will never click w you while travelling.", "Is it really so bad not being around her?", "NTA, but:\n\n> She got extremely upset, told me the criticism was unfair and I basically called her a mean, inflexible child (I was so careful to be kind and focus on behavior, not making it about her overall character) she didn't want to travel together anymore, canceled on upcoming plans to see a concert, and has ghosted me since.\n\nProblem solved, and you should really think hard on why you felt the need to tiptoe on eggshells.  You clearly know you can't trust her to be reasonable or rational, so why bother expending the energy?\n\nSomebody can be a) a good person, and b) a bad friend, at the same time.  Somebody can be a bad friend for reasons that are out of their control, though I'm sure this person could control her own behaviour if she wanted.\n\n> Am I the asshole for giving her potentially unfair criticism? Should I have left it unsaid and just not traveled with her again?\n\nA real friend values the opinions of their friends, and listens to them, even if they don't agree.\n\nNow, that all said, you've pointed out in your submission that the behavior was very out of normal for her, so I do question why you're not exploring that angle.", "NTA.\n\nBut DON'T travel with her in the future. You can be best friends with someone, that doesn't mean you have to go on trips with them. You're obviously not enjoying the traveling one little bit, and it doesn't sound like she is either... so why do it?\n\nJust enjoy whatever good qualities she must have. Obviously there must be some that you haven't mentioned, because she sounds perfectly miserable to be around otherwise.", "NTA\n\nYou needed to let her know how you felt about her behavior. Clearly, she was not ready or mature enough for that trip", "NTA you did the right thing. Good friends call us on our shit.", "NTA. It’s likely her misplaced anger and subsequent ghosting is a product of shame. Hopefully her humility will eventually bring her to her senses and she’ll apologize.", "NTA. It sounds like it was a really stressful trip for both of you. I just want to clarify: being neurodivergent does not justify her ghosting you. It just makes it seem like she doesn’t have the same level of care for you that you had for her while traveling.", "NTA - But - the kind of person who would take your criticism and not get mad but change their behavior? That kind of person wouldn't have acted like such a jerk on your vacation. Your \"friend\" is self-centered, but not self-aware of her behavior.", "How was it potentially unfair criticism?  The trip sounds like a nightmare & she needs to understand, autism or not- she can't have everything her way...  The world doesn't care about her issue...  NTA", "NTA. but as you dont know this from before from her, the question is, is she in a weird phase that will end at some point, or has something shifted permamently?  \n\n\nit might even be something medical, like wonky micronutrient-levels or something organic with the brain. also if the kidneys are impaired, this can lead to a decrease in stress-resistance and nervous episodes. not saying it would be any of this, just adding possibilities.", "NTA If you have issues with how she acts when traveling and it is ruining your trip it is reasonable to tell her exactly what the issues are. Like you have a few bad options like sucking it up and just not enjoying these trips which are expensive and time consuming which will eventually build resentment and the friendship will end, or you could blindside her and not accommodate her but that will build up resentment on her end and she will have a larger freak out. Personally I think you chose the best option typing out what you think in a neutral manner. Though the only step I would have taken before sending it to her is sending it to her mother and asking her to check it over and make sure it is worded in a way which she will understand (Edit: I dont mean like understand from a word perspective but every person has their own quirks and different things they find offensive (especially so with people on the spectrum) and etc so knowing how to word things when trying to be neutral can be hard).\n\nBut at the end of the day being a travel companion takes work and if you and her have different expectations and needs it might be better to not be traveling buddies and just be in town friends. Like I have a few friends I would never go on vacation with again we are still friends but we have entirely different expectations when traveling and there is nothing wrong with that. Like me personally I am more of an adventurous eater so I love going to hole in the walls and street food vendors and trying anything which sounds interesting whilst another of my friends only likes going to fancy restaurants and etc. But I am more comfortable going around new cities solo whilst my friend was not so I didnt mind splitting up and just meeting up for certain things he wanted to do everything together and yeah we just were not a good travel match and there is nothing wrong with that. Setting up expectations and boundaries is important in any relationship otherwise it will be just breed resentment in the long run.", "NTA. It sounds like you were gentle with your feedback. It was also important feedback to give, because it could enable you to continue traveling together. She reacted poorly, and that's not on you.\n\nI definitely would just have not traveled with her again. You gave her a chance to accommodate you by changing her behavior. That was a great friendship move. It's too bad she's in a place right now apparently where she's not able to receive that kind of feedback with grace.", "NTA but I wouldn’t go on a trip with her ever again anyway, it sounds like you have to act as her parent instead of friend and be constantly be working to make sure she doesn’t have the slightest inconvenience. That sounds like a job not vacation.", "NTA\n\nYou shouldn't have to walk on eggshells to have a \"good\" time.", "The problem took care of itself. Cool. \n\nNTA and enjoy your newfound freedom.", "NAH - the way she acted wasn't great, but I don't think you understand just how uncomfortable it can be for autistic ppl to be completely out of their routine. when there's a plan, there's a routine an autistic person can hold onto bc her entire typical daily routine is gone. it's for stability. she's also allowed to express when she is uncomfortable, just like you're allowed to express that.\n\nyour friend has a disability, and can only act within her capabilities in handling that disability. she will never be allistic, she will never act like an allistic person, she will always be autistic and will always have autistic symptoms. if you can't handle being friends with someone who has a disability that impacts her life and yours by extension, don't be friends with them. all you're doing is asking her to ask her symptoms for your comfort, something that takes a massive amount of energy on the autistic person's part just to make you comfortable. you want your friend to put aside her needs to make you comfortable, and that's not acceptable to expect in friendships.", "Came here to say this. There are friends I love to travel with, and friends I would rather not. You really get to see another side of someone when they're out of familiar surroundings, and travel certainly does that.\n\nOP is NTA, but might have to call it quits on this friendship, if the friend cannot work past being criticized.", "This. I have a friend who I love, but I will not travel with her - she runs late to everything and can be very rigid and uncompromising with plans. She has great qualities as well but due to these issues I prefer to keep our outings more local. OP should consider putting her friend in that same category.", "I would bet something else was going on with her.  If they have traveled together before without issue, and yelling at her mom - something else is bothering her and she's taking it out on everyone else.  Really there is nothing to do until she figures herself out and apologizes or she burns all the bridges that she has.  Its possible she'll have to destroy all her relationships before she realizes she can't act this way.", "I love your comment. I have an anxiety disorder. \n\n\nSo travelling especially can increase feelings of dysregulation, overstimulation etc. And that sucks and can cause me to be snippy. \n\nBut I always apologise & try to minimise the impact, and most importantly try to do better next time, either by regulating myself better, planning more effectively or changing the situations.", "Thank you for such a thoughtful response. I will add that I am actually a social worker and I think that has really helped our friendship thrive. I can tell when she's masking and when she's not and I try to accomodate her simply just because I care for her. I am neurodivergent myself (depression) and she is generally understanding of my off days as well. \n\nHowever, I know she can do better and I do expect that of her. I was just as exhausted as she was, and likely equally as stressed, and remained cheerful, optimistic, and accomodating. I felt like this was taken advantage of and underappreciated.", "This is a great response.", "So shouldn’t it be NTA then?", "Thank you for your input, I really value hearing from someone else who is also on the spectrum. Most areas of her life are in her complete control, so she does tend to act out when she's outside of her comfort zone. For example, she lives in a trailer on her parent's property so she has a lot of independence and space from others while still getting things like home cooked meals. She is someone I really love and value but this is one of her weaker areas for sure.", "Thank you for this, I really value the comments from others on the spectrum.", "Exactly what I was going to say. I don't know how much of her behavior and needs in travel situations are going to change-- for everybody, neurotypical or not, that can be a high stress experience and often brings up unexpected issues. Asking her to handle herself differently may just not be realistic,which makes the message kind of cruel. \n\nFinding friends you can travel well with is rare, IMO, and now you can each cross each other off your lists.", "> I am not a fan of offering people negative feedback. \n\nSo instead of giving someone time to adjust and have room for improvement and decide if they want to travel with you for fear of hurting their feelings. You want to blindside them at an event and let her melt down? Like even if we are not dealing with an autistic person. That is not something which you do especially if you traveling with someone. But especially when dealing with autistic people preparing them is generally better and giving them the option of opting out. Otherwise they are going to have a meltdown and not have the proper support structure to help her deal with it.\n\nAlso negative feed back is not entirely negative the OP stated she waited 6 days whilst trying to word her message. So we can assume it was not just direct criticism of her and was applied in a lighter way. Never telling people anything bad and being passive aggressive is not being a good person. Yes there are times to be tactful but that is generally before you automatically jump to lets ruin this for everyone.", "just because you have autism does not mean you are allowed to be a dick and plenty of people have autism and still behave like an adult .", "We live really far apart and I know she prefers written communication so that's why I chose to message. The six days wasn't intentional and I made sure she knew it wasn't because I was stewing, I was just being really careful about my word choice.", "She is a really great person when she's in her element, which is most of the time because she's built a life that is almost entirely within her own control. But I actually think this has contributed to her inflexibility. She's absolutely brilliant and we have great conversations. We share similar interests and have the same sense of humor. She has been a really great friend for the most part but yeah the behavior on vacation was less than stellar", "Thanks for this. I actually spoke with her mom a few days beforehand letting her know that there were some issues on vacation that I wanted to bring up but was still thinking of the right words to say. I let her mom know that I still absolutely wanted to be friends but I did not want to see the poor behavior continue. And that I was telling her since she is her main support person and I was worried about how upset she might be. Her mom is a DSW and totally undertstood. So I hope that amidst this my friend has been getting support.", "Thank you for your input. I definitely think after six years of very meaningful friendship we can continue to be friends but maybe not travel buddies. I know masking takes a lot out of her and she was pretty depleted. I think my main thing was that I still expected her to be kind even if she was unhappy and she wasn't treating me or others very well.", "Yup- that’s what I wondered. Something else is going on.", "I have ADHD and anxiety and often get stressed while traveling. Worse yet, I have a very hard time hiding my feelings. So even strangers are aware that I am struggling. I have coping strategies but I definitely have to work hard at them. I accept that most people aren’t gonna want to travel with me, sadly.", "Totally get this as a social worker and a person in an 2xND marriage.\n\nIt totally sucks when one person is just expected to put on a happy face and be the more accommodating one or the take charge one. I feel like my wife and I alternate this, but we have been together 14 years and married 10 and have 2 kids and it's taken *a lot of practice* and we still fight about it all the time.\n\nI think sometimes we are in a war of central nervous systems. It seems almost instinctual that one of us manages to step up when the other needs to be able to step down: and we do end up taking turns. It's a dance we've learned over a long time.\n\nMaybe that's the piece here that's missing for you, is that you did what needed to be done for the good of your duo and your friend is not really able to say-- \"thank you. I know that must have been hard on you. I was having a hard time and you pulled up the rear. I appreciated that.\" We don't always realize what a long way that would go.\n\nI would add as a social worker: you deserve to recreate off the clock. If this friend is not your travel friend, so be it. Don't burn out because you're trying to social work every corner of your life. Occupational hazard, I get it.\n\nAdding a PS: depression comes and goes but autism is all the time. I don't know if it's fair to say you were as burned out as her because you've never been in her body, and I also don't know it's necessary to rank in this way. You did all you could do and then some to make this trip as successful as you could. Your friend was not a pleasurable travel companion and I'm sure you didn't feel like if you needed to have a bad moment that she could have taken the lead. It makes sense that was a really stressful experience for you. It's not your job to overfunction at your expense.", "Ah ok. It's starting to sound like an RSD-related issue, which is common in ND people, and not behavior. \n\nDon't hesitate to reach out if you have questions. I'm a walking encyclopedia on coping strategies, as well as trigger/overstimulation management and prevention, as I was diagnosed 20 years ago when doctors didn't know very much about Neurodivergence, and doctors supported ABA therapy, and the puzzle piece logo was a commonality in the Autism community.", "(I realized my comment may have been a little harsh so I added an addendum btw!)", "Oh if you spoke with her mother first then I think you did everything I think perfectly. Like it is exactly how I would have acted as well. I understand it is a situation where you are probably still feeling bad for how she took your letter. But I think part of that was just her kneejerk reaction to the letter and thinking the friendship is over. But you can kind of reassure her by giving her some time to process the letter and how she is feeling and then setting up a hang out somewhere she is comfortable (like a coffee date or a day at the library or just hanging out on a porch. To let her know you still are friends it is just a difference in expectations. But it kind of depends on how severe her Autism is (and in which factors) I just mention this because I only really have experience with people with milder Autism (level 1).", "Thank you for taking the time to write this out, it is much appreciated. I am hopeful that the friendship can recover from this as I do really value her and had the overall benefit of the friendship in mind when I talked to her. She might not be in a place to be my travel buddy at this point in her life and that's okay, I just hope we can continue to do other things together.", "Thanks so much, I really appreciate it!", "I think she just needs her space right now so I'm giving that to her but yes, her reaction did have me wondering if I was out of line. And of course I didn't want to hurt her so I feel bad about that", "Either way, you're in a great spot in life to be a friend/ lover/ parent/ casual acquaintance to someone. If only everyone thought this deeply about their relationships!\n\nI have been the pigheaded receiver of the email. I hope your friend comes around. XX", "Time to travel with my ADHD/depressed boyfriend instead is what I'm hearing lol! I love the ND people in my life and wouldn't trade em. Here's hoping she talks to me soon and thank you again"]}