{"id": 27138, "submission_id": "16m0ef9", "title": "AITA for lying to my bf about not being able to smell?", "selftext": "This is a throwaway account.\nI (25F) met my boyfriend (24M) at a party right after the pandemic. He was a friend of a friend and he immediately caught my eye. I walked up to him to introduce myself and tried to shake his hand. He immediately got uncomfortable and told me he had hyperhidrosis (an excessive sweating condition) so he couldn't shake my hand, apart from that he was friendly and so funny, we immediately clicked and I even got his number.\n\nLater that night the friend in common told me he was super self-concious about his condition and about how he smelled because of it.\nWe started chatting and went on a few dates, it was amazing, I had never met a guy like him and we always had so much fun together, he was kind, considerate and the kind of guy who my parents would love.\n\nI could tell he was always nervous about his sweat and insisted on not getting to close to me. One day I asked him why he acted like that and he basically confessed to me he was scared I wouldn't like him because of his smell. That was completely false, I couldn't care less about how he smells, he's an amazing guy and at that point I already had feelings for him, his smell wouldn't change anything between us.\nI don't know what came over me but I completely lied and told him I had COVID earlier that year and I permanently lost all sense of smell, he immediately seemed to calm down and relax, I could tell that in the next dates he wasn't as nervous or self-concious.\n\nWhen we became official I thought about telling him, but since I didn't mind AT ALL his smell (it isn't even that bad, it's mostly an insecurity he created in his own head) and he seemed comfortable I made an impulse decision to expand this lie to my whole family and friends. Now everyone thinks I can't smell at all, honestly life is the same because you don't even use smell that much, except my boyfriend isn't self-concious around me.\nI feel bad for not telling him, but I don't want him to go back to how he was before.\n\nSo, AITA for not telling my boyfriend of 3 years I haven't actually lost the ability to smell?", "created_utc": 1695055152, "permalink": "/r/AmItheAsshole/comments/16m0ef9/aita_for_lying_to_my_bf_about_not_being_able_to/", "score": 36, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I made a decision to hide something to my boyfriend because I thought that was what was best for him, but some people might disagree and say I should be honest with him and tell him the truth.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Light YTA, I think you lied to make him comfortable which is sweet, but ultimately you could have just said exactly what you said in this post to him and he would have had the same relief reaction. \n\nI think you should tell him and say exactly what you said on this post.", "YTA \n\nWhat a stupid lie that you'll have to keep up with for the duration of your relationship to multiple people. And, you're wrong. Loss of smell definitely affects and changes peoples' lives.", "nta, it was a white lie.", "YTA\n\nThat's such an absurd lie to run with. You're inevitably going to slip up. (Nevermind that a few more years down the road and you'll be pretending to be the only person in whom COVID caused *permanent* loss of smell).\n\nNow, it's not as bad as doing something like cheating and then lying about it. But really...it's a lie, even if its motive was good, and now you've got to maintain that lie in front of anyone.", "I think you spontaneously offered a well-intentioned white lie to assuage your boyfriend's insecurities. But now, three years later, I think it might be the time to tell the truth (but package it very nicely, so it's not about him, but about you). For example, you could say: \"You know how I told you when we first met that Covid permanently destroyed my sense of smell? Well, turns out it wasn't permanent. I can smell. And I actually find your particular scent very sexy. I'm hot for you and everything about you. I'm sorry I didn't tell you this sooner. I know I was wrong, and I hope you'll forgive me.\" You're NTA, but you can't keep up this lie forever.", "NTA, but you shouldn't have lied. Resolve it now.", "I would have a smellerific miracle. I can smell! Thank the heavens. Then tell Stan he smells fine.", "YTA I think you should just say that your sense of smell has returned so you aren’t living a lie.", "I mean, I guess you just identify as someone who can’t smell now. So what", "NTA, but you will be if you keep it up. Eventually you'll forget, slip up, and it'll all come crashing down. \n\nThe kindest way out of this is to gradually get your sense of smell back. Start to notice the strongest smells, then add others. The further down the list he is, they better he'll feel about it. When you DO smell him, make sure you gush over how great he smells, and you're SO glad you aren't missing out any longer.", "How has this not come up before?", "This is kind of hard. You’re the AH for lying bc starting off a relationship with lies is never a good thing. However, you lied to make him comfortable so it’s not completely terrible. I’d tell him you lied to him and everyone else. It’s been 3 years and you know his smell so what is he going to do about it. Honestly telling him you could smell this whole time might make him less insecure around other people as well. If you do tell him ( and you really should) don’t say “I can barely smell you,” or anything of that nature bc it makes it sound like he does stink a little lol.", "Yes YTA, but a G rated one, so let’s go with “you’re the silly pants” Say you slowly got it back. No one ever has to know. You’re likely to mess up eventually otherwise.", "NTA but a little silly. I can relate", "Didn’t this happen to Dr. Zoidberg on Futurama?\n\nYTA, but this is totally fixable, if totally awkward.", "This isn't really an AITA question because there is no interpersonal conflict and no other person who \"could be\" the AH.\n\nI do believe that you can't maintain a relationship that's based on a lie.  And it's wrong to involve your family etc. in the lie.  \n\nPeople who really have no sense of smell can't really enjoy food, because tastebuds only tell you sweet, sour, salty and bitter--smell provides the rest.  So you are compounding and covering for the lie with every meal you share.  \n\nThis won't end well, and the longer it goes on the worse it's going to be.", "yta, you built a relationship with him based off of a lie.  dont do that.", "Tell him you maaaaybbe starting to get your sense of smell back. And you think he smells delicious. (I had a friend that said her husband smelled like vanilla. To her.)\n\nI really don’t know, but I have a theory that people smell each other on some subconscious level to find if they are a good “mating pair” - if they each think the other one “smells good”. Yes, like animals. Because we are animals. NTA", "Tell him you can smell, but can't smell him. Can you smell him for real?", "I mean, it's been 3 years. I'm kind of finding it hilarious that he hasn't figured it out yet. But I digress.\n\nYes, YTA for lying and then expanding the lie to everyone. I think you could have made it clear to him that you didn't smell *him* having a bad odor and over time would he hopefully accept that.", "NTA. Tell him you're starting to regain your sense of smell and tell him he doesn't smell to you. There's an easy way out of this", "My sister has this. She started getting Botox injections in her armpits to paralyze the sweat glands. No more armpit sweat.", "ITT a woman found a guy who has NEVER ripped a SBD in her presence.  Marry that dude!", "NTA but that white lie will come to bite you sooner or later, say that its gradually recovering (and keep telling your bf that he smells fine)", "Hahaha nta I think it's actually an awesome way to get someone to not feel self conscious... I'd just slowly go.. omg what is that smell?! It smells wonderful... and sniff out something that smells really good .. maybe him right out of the shower, candle food whatever... and say maybe you're getting you're smell back.. say they smell good.. etc \nMy oldest is a sweater too and doesn't smell unless he had a hard workout or hadn't had a shower in a few days. Just cuz you sweat doesn't mean you stink. I live in az... everyone sweats lol", "NAH. It probably wasn't a smart move to expand the scope of the lie, but also if you think your sense of smell isn't that important it might be less of a lie than you thought. Honestly, it's not that bad because this came from a place of caring, but this is very much going to be something that is hard to maintain for a really long time unless you actually do have something wrong with your sniffer, so it might be prudent to have your sense of smell come back at some point and just tell him you don't think he smells bad. Very much avoid phrases like \"it's not that bad\", because that still means it is bad.", "YTA\n\n>honestly life is the same because you don't even use smell that much\n\nThis isn't accurate if you actually talked with people who can't smell. It totally changed the experience of basically all foods and people experience major problems of either loss of desire to eat or overeating trying to satisfy the craving for prior experiences. It can lead some people to become depressed.\n\nAnd yeah, lying for 3 years is sketchy as fuck.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThis is a throwaway account.\nI (25F) met my boyfriend (24M) at a party right after the pandemic. He was a friend of a friend and he immediately caught my eye. I walked up to him to introduce myself and tried to shake his hand. He immediately got uncomfortable and told me he had hyperhidrosis (an excessive sweating condition) so he couldn't shake my hand, apart from that he was friendly and so funny, we immediately clicked and I even got his number.\n\nLater that night the friend in common told me he was super self-concious about his condition and about how he smelled because of it.\nWe started chatting and went on a few dates, it was amazing, I had never met a guy like him and we always had so much fun together, he was kind, considerate and the kind of guy who my parents would love.\n\nI could tell he was always nervous about his sweat and insisted on not getting to close to me. One day I asked him why he acted like that and he basically confessed to me he was scared I wouldn't like him because of his smell. That was completely false, I couldn't care less about how he smells, he's an amazing guy and at that point I already had feelings for him, his smell wouldn't change anything between us.\nI don't know what came over me but I completely lied and told him I had COVID earlier that year and I permanently lost all sense of smell, he immediately seemed to calm down and relax, I could tell that in the next dates he wasn't as nervous or self-concious.\n\nWhen we became official I thought about telling him, but since I didn't mind AT ALL his smell (it isn't even that bad, it's mostly an insecurity he created in his own head) and he seemed comfortable I made an impulse decision to expand this lie to my whole family and friends. Now everyone thinks I can't smell at all, honestly life is the same because you don't even use smell that much, except my boyfriend isn't self-concious around me.\nI feel bad for not telling him, but I don't want him to go back to how he was before.\n\nSo, AITA for not telling my boyfriend of 3 years I haven't actually lost the ability to smell?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA—one day your lie is going to bite you in the ass. hope you don’t want kids bc pregnancy nose is no joke.", "Verrrry light YTA. Like another guy said, that's just silly. If my partner told me that (we've been together for 5 years) I'd probably just think it was funny and tease her about it every once in a while. Wouldnt be a big deal to me.", "I don't think you're an asshole but it's time to tell the truth. At some point it's going to happen anyway. What happens if you smell smoke in the apartment or something?", "YTA\n\nIt was sweet initially, but it got out of control. I would to tell him that you can smell again. Maybe say something like it has been slowly coming back, and you wanted to be sure before sharing this with him. Then quickly reassure him that you’ve smelled him as well, and he smells good to you.", "At this point, YTA.  What started as a little white lie has gotten out of hand.\n\nWhat happens if you marry?  Will you still be lying about this when you both are in your 80s? Will you never give any indication that you like a perfume? What about eating, when more than half of what we taste come from smell?\n\nAt this point, get this sorted, so you can move ahead without having to maintain a lie forever.", "I’d say there is no real AH here, but if I were you, I’d start unraveling the lie by saying you’re noticing scents again. Not all Covid-related loss of smell is permanent. Why keep living the lie? As another mentioned, one day your likely going slip up and comment on a smell and everyone will be like, WTF??", "NTA.\n\nSeems like it was a harmless lie that has helped your relationship foster.\n\nMaybe tell him at some point though", "No, a white lie to spare someones feelings does not make you TAH, however I hope you are a good actor because if this relationship ends in marriage or goes on for years, you are going to need to keep up the act forever, also when out socializing you can never let your guard down. If I were you, I would slowly pretend you got your sense of smell back, but insist you still cant smell your BF.", "It definitely does. I've had an issue with my ability to smell since I was a kid (not sure what as I never really talk about it). I can't taste a lot of things unless it's a very strong flavor. Usually have my food seasoned with salt or garlic because I can taste those very easily.", "This is the way 🏅", "upvote for zoidberg", "That would be pheromones :)", "Indeed, we do use smell to find partners, although it has more to do with health and detecting if someone has issues. I got so good at detecting stuff that i can tell if my wife has a fever and if its mild or strong (fevers have a slight vinegar undertone)", "This!\n\nAlso fun fact; if you find someone insanely attractive, their smell becomes attractive. So they could honestly smell like literal poop but if you’re attracted to them; they could smell like fresh baked bread", "If they'd met once at a party and never again, it would have been no big deal.\n\n\"Don't worry, I can't smell a thing!\"  And a week later, you've both forgotten the statement, and each other. \n\nA lengthier conversation about the matter would probably be inappropriate for a casual conversation with a stranger at a party.  The poor fellow's already self-conscious about how he smells, he's not going to want to have a longer conversation about the matter with an acquaintance he just met at a party. \n\nThe problem, if it is one, is that it wasn't just an off-hand comment to a stranger at a party, it was a statement to someone OP went on to have a relationship with about a very personal issue they're sensitive about.  \n\nAnd the longer it goes on, the more awkward it gets to sort the matter out.", "How has she managed to never say \"mm that smells so good!\" even once around him!!? Does this mean he also just farts willy nilly and she can't complain? 🤣🤣", "This is a good way out of your mess.  Lying to someone sucks, unspin your web.  NTA if you fix it.", "This is very interesting! My mum has had anosmia since she was in her 20s (I don’t know exactly when but before I was born and she’s 60 now) and she is adamant that nothing has changed for her taste-wise and all food still tastes the same. I’m not convinced. I reckon things have dulled considerably but she’s so used to it after 40 years that she’s convinced herself its all the same.\n\n\nIt works out well for her as she’s a cleaner, so smells that would normally make me feel sick are no trouble for her. Obviously she hates that she can’t smell flowers, perfume or even the food she bakes, but when it comes to food she’ll eat whatever and has no issues. She’ll eat anything, never heard her say ‘I don’t like that’ other than Brussels sprouts and rhubarb - although she’ll still eat rhubarb regardless sometimes!\n\n\nShe’s the only person I know with anosmia so I don’t have any other points of reference, but interesting to know how it impacts other people so badly. I guess my mum is very lucky.\n\n\nNone of this is said to validate OP btw, I think it’s a white lie that got out of hand but it wasn’t malicious, maybe NAH. I don’t know it’s a weird situation. I would say it’s best to come clean and just say you have no problems with the way he smells as it’s been 3 years and hope he forgives you.", "This is my husband. He lost his sense of smell as a teen. Because of that his sense of taste is extremely limited (as witnessed by the fact he picked me. Kidding). His relationship with food is complicated because so much of it is related to texture and he needs to kick up the flavor a lot to get some taste. \n\nI sent him this post and his response was not very nice. Heh.", "Pregnancy nose?", "I love watching my boyfriend react to my pheromones after I get done working out. It's so fun, and I love his smell too!!!", "Exactly. It's just so normal to comment about smells in general. Like, get home and tell my kid to take out the trash because it stinks. Or complementing someone's perfume. Either he's oblivious or he knows and just hasn't said anything.", "your sense of smell is heightened and many people experience their partner smelling disgusting to them while pregnant (i did and it was the worst) can’t hide that shit you’ll be puking/gagging.", "I couldn’t eat hot wings with in a 10 mile radius of my wife when she was pregnant.", "Full disclosure and fully exposing myself here but i go FERAL for the smell of my bf 😅 i have been known to request a pit to sniff 🫣 He never smells bad to me!"]}