{"id": 27132, "submission_id": "16m00ew", "title": "AITA for not wanting to offer my friend food when she stays over", "selftext": "A friend of mine comes over to mine to stay from time to time (probably every month or so) before leaving the next day for a flight in my city. I didn’t mind hosting her before but now that she’s staying over more often, I also notice that she usually arrives hungry. Out of courtesy, I ask if she wants food and she always says yes and proceeds to eat quite a bit. \n\nMy culture always prioritizes making sure the guest is well taken care of and isn’t hungry, so I feel morally obligated to ask her if she wants food. However, it’s starting to get annoying because she doesn’t ever bring anything in return and almost seems like she expects it, because the other week she blurted “I love that I can rely on you for food because the other friends don’t always have food in their fridge”. \n\nThat really bothered me so I almost wanted to tell her that I don’t want to offer her food anymore since I’m already offering accommodation out of kindness. What should I do?", "created_utc": 1695054215, "permalink": "/r/AmItheAsshole/comments/16m00ew/aita_for_not_wanting_to_offer_my_friend_food_when/", "score": 98, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might not feed my friend anymore and it makes me the asshole because she’ll leave hungry\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "My passive aggressive ass would cook something that she hates and make sure the cupboards are empty. She wants something she can buy it.", "NTA\nIf I were you, I'd empty both fridge and pantry in the days prior of her arrival. The day of, I'd send her a text:\n\"Dear friend, I'm so sorry, this comes at very short notice. We've got an emergency to deal with a work and I honestly don't know if I'll make it back home before 10 pm. And what's more, I've run totally out of groceries and don't know if I'll manage to get to the shops before they close for the night. \nI'm so terribly sorry. There's a cute little restaurant around the corner, maybe you could go there while you wait for me to come home? That way you'd get dinner at least. Sorry again, see you tonight! xoxo\"\nBut then, I'm petty as fuck...\n\nEdit: typo", "NTA, but you need to communicate with her immediately. Let her know you don’t mind offering her a place to stay but the additional expectation of feeding her is becoming an issue.", "Is she flying for work? They are probably giving her a per diem if she is and she should definitely be thanking you for your hospitality.Sounds like the other friends had enough of her mooching. If you enjoy her visits your could ask her to bring something next time, otherwise say you are busy or are tired of hosting.NTA", "NTA\n\nIf she appreciates it so much, she can start switching off paying to take you both out to dinner.", "NTA, but it's time for a p\\[en conversation.  It's amazing how many problems here are questions before someone's even attempted to solve it.  \"I love having you here every now and then while you're waiting for a flight, but providing a meal each time is getting costly.  How about we split it?  I will spring for dinner one month, and you can the next.  If you want to bring groceries and cook, that's fine, or we could do take out on your turn.  Shoot, if that's too much to work in your schedule, let me know how much you want to spend and I'll take care of getting the stuff first.  In that case, do you want my venmo so you can send me the money in advance?\"\n\nIf she's not really a friend but is just using you for the advantages of saving on a meal and a hotel, you're better off knowing now.  if she really is a friend, she'll understand and this will make sense to her.  \n\nI'd pay double the cost of groceries for someone to cook a meal for me - I hate cooking.", "NTA\n\nSad to say you are being used.  The next couple of visits you should be unavailable and have her get a hotel.", "NTA. Tell her next time you don't have the energy to cook and ask if she can bring food to you both before arriving", "NTA Many cultures take pride in being a good host. In this case, you are not inviting her as a visitor. She is imposing herself on you and she is not grateful for your efforts. She can be told to return the favour of your hospitality by treating your to a meal out, having a hostess gift, etc. An empty fridge is a copout.", "You should just tell her how you feel. I give my friends food when they stay with me. They usually offer to get me lunch or dinner next time we hang out. Let her know you feel taken advantage of because of the comment she made.", "NTA - Does this person ever do anything for you? Like invite you to stay at their place? Pick up the check for a meal or even coffee? I can just guess that the answer is no, and they are just using you.", "NTA\n\nIf I invited you over expect to be offered food. for a 40 year old male I have become a Midwestern grandmother. I asked my 70 year old aunt if she is hungry can we make her something last weekend. \n\nI get she is flying around but I wonder if she has food insecurity at home. Flying could be covered by work but she cannot afford to feed herself that well the rest of the time.", "NTA. Sounds like she’s taking advantage of your kindness and friendship.\n\nHas she ever offered to cook or take you out to dinner for your generosity?", "It sounds like you don't really want to be hosting this person, which is fine. Just man up and tell them you are no longer interested in hosting them.", "I once had a friend who used to drink gallons of my best coffee but when I visited her she never had any coffee at all. I asked her why once and she said \"Too fuckin expensive!\".\n\nI then bought chicory and hid my posh coffee. Her visits diminished.", "I think most (all?) cultures prioritize making sure guests are well taken care of and not hungry. I’m American, and it’s standard to offer someone food and drink when they come to your house. It is also customary for them to bring something small for the host, unless you’re very close. \n\nIf you’re struggling financially that’s a different story, in that case I’d only offer what you can afford.", "Give her the number for the local pizza delivery service next time", "NTA...The only way to avoid animosity is to communicate directly.  Tell her exactly how you feel. If she takes offense, then she need not come anymore.", "NTA\n\nif you want her to keep staying at your place, tell her she needs to provide funds or food", "NTA\n\n\"I'm looking forward to your visit. It's your turn to treat us to dinner. I have suggestions if you're stuck.\"\n\nAnd don't have a full fridge. She is taking advantage of your generosity. She could be paying for a hotel and meals. \n\nIf she pushes you, offer a list of local hotels.", "Cultures that believe in treating guests very hospitably also have a code for the guests : treat your host with respect, take something for them, and above all, don't be greedy.", "NTA.  I am from a culture where it is required to offer food to all guests, but we don't enforce that on others.", "Stop letting her crash at your place.\n\n “I love that I can rely on you for food because the other friends don’t always have food in their fridge”.\n\nShe literally just told you that she uses you for free food.  When someone tells you who they really are, believe  them.  NTA to tell her to find somewhere else to crash, to be honest.  Or tell her to bring food for you both.  Or to offer to take turns feeding each other.", "NTA and next time just tell her your are busy and she can't come over.\n\nIn my culture it has always been a tradition to feed people no matter how many times they visit. If some of these guests start taking advantage we just tell them we're not home or we're busy.", "To be a good host is to supply the basic needs.\nYou are going above and beyond, and they are taking that for advantage.\nIs this a good friend, one you spend often with or one that is just kinda... there.\n\nIf so I think ya know the answer. NTA", "Rely on you?? Nah, smh", "NTA.  Next time hide your food and ask her if she'd like to go halves on a takeaway", "NTA. You should actually stop offering accomodation. One time you'll have a flu, then a busy work week where you'll have to wake up early and/or work all night etc. She probably prefers to eat home made and it's understandable (I do too, I love my friend's cooking), but it wouldn't kill her to bring a cake", "NTA\n\nYou are basically saving her a lot of money every month as she doesn't have to pay for a hotel for the night.  The least she can do is offer to take you out for a meal or even a takeaway both of which would still be cheaper than the hotel.\n\nShe is taking you for granted so be up front with her and tell her it has to stop as it's not fair for her to take advantage of you like that.", "NTA.   Clear the air.  Next time she visits, tell her that you are happy to host her, but you cannot continue to pay for her meals.", "Tell her to show her appreciation she can buy you dinner a few times during her stay", "NTA... \"Now that you mention it.... I would prefer you bring food or stop for a meal befor you come because I wont always have food in the house or the energy to cook when you arrive. I'd rather just offer you a bed.\"", "Tell her that you just happened to have enough food to share the last couple of times, but that it’s not a given and she needs to bring her own if she wants to be sure of a meal. \n\nYou are letting her know because of what she said the other day and you would hate it if you didn’t have enough for the both of you. \n\nThat should make her understand that her dinner is her responsibility and not yours.", "NTA but if you want to keep the friendship intact, you want a softer approach (not that you're not entitled to be blunt with her, but it sounds like you do want to stay friends). \n\nNext time, tell her she can crash at your place *but* you already have dinner plans, so she should plan to eat before she comes. Don't stock the fridge or buy anything extra to accomodate her. Alternatively, text her the morning of and say you've got a super busy day ahead, so would she mind picking up dinner for both of you? If she refuses, then say that you'll just grab your own dinner on your way home from work/school. \n\nYou just need to break the habit/expectation that she gets a full, free meal every time she visits. You're already being more than generous to provide a place to stay; it's honestly wild that she's never offered to buy you dinner or anything in return.", "NTA I’d probably respond the next time she asks to stay by saying something about it like “Sure, you are welcome to stay here instead of getting a hotel but as this is becoming more frequent, I’d appreciate it if you could bring your own groceries and supplies from now on if you are crashing here before a flight. I won’t be able to host like I would if you were staying to visit with me.”", "NTA but you are if you go with anything that’s passive aggressive. Just shoot it straight.", "Ask if she's hungry,  she'll say yes. Ask her where she's taking you,  it's gotta be her turn by now.", "Seriously if they are a good friend, just ask them to bring some takeout next time they come or to stop by the supermarket and buy some food for you both to cook together. If they are a reasonable person they will obviously agree, if they don't then your friend is just taking advantage of you.\n\nThings like this are usually best solved by you suggesting something alternative as opposed to being combative because you never said anything.", ">the other week she blurted “I love that I can rely on you for food because the other friends don’t always have food in their fridge”. \n\nI would have just said \"yeah,  they probably got tired of being your personal caterers for free. Maybe show some gratitude instead of entitlement next time and probably more people will do it.\n\nNTA. And please realize she's basically using you like her personal hotel/butcher so she can save money while still getting all the perks.", "NTA - Your home, your food, your choice.", "I don't understand why feeding a friend 5-6 times a year is too much.  Do you ever travel to see her?", "NTA. İ come from a similar culture and while i like the idea, I also like reciprocation of some sort, otherwise the receiving party is little better an a parasite.", "Nta. Staying nta will have a little difficulty when you address your concerns. Just make sure her inconsideration doesn't become your excuse to be an ah back. You seem kind and reasonable and you will be able to communicate appropriately even if your friend gets defensive and reacts poorly.", "Next time, ask her to pick up some takeout on her way (for both of you). If she doesn't do it, she's the asshole. Until then, it's not blatantly obvious.", "INFO - what does the rest of your friendship look like? Do you ever visit her / what's the dynamic there? When you go out together, do you alternate paying for each other? Just wondering if there's another aspect of your friendship that she thinks balances it out in some way.", "i’d say YTA for this one ig but partially because if you’d communicate this to her instead of expect her to know then it would probably be sorted out", "I would be entirely unavailable for these one sided visits. Please tell her you can’t make the date work next time, even if it’s just because you want to put your feet up or something. \n\nIf you do like her company but don’t want to feed her either meal prep a small portion or let her order in on her dime. Enough is enough NTA", "NTA… I recommend setting that boundary with your friend now before it deeply manifests and tarnished the friendship. Have that conversation with your friend and set yourself free dear. Good luck", "NTA. Next time she asks to stay at your place say \"Sure! Can you pick us up some dinner on your way here, I know I'll be starving by then and don't feel like going shopping.\"", "NTA\n\nSounds like she's a traveling mooch", "Next time, tell her that you're going to order yourself some food and she should do the same. NTA.", "NTA.\n\nYour “friend” is taking advantage of you. She needs to get a hotel room and pay for her own food. Seriously, who does that?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA friend of mine comes over to mine to stay from time to time (probably every month or so) before leaving the next day for a flight in my city. I didn’t mind hosting her before but now that she’s staying over more often, I also notice that she usually arrives hungry. Out of courtesy, I ask if she wants food and she always says yes and proceeds to eat quite a bit. \n\nMy culture always prioritizes making sure the guest is well taken care of and isn’t hungry, so I feel morally obligated to ask her if she wants food. However, it’s starting to get annoying because she doesn’t ever bring anything in return and almost seems like she expects it, because the other week she blurted “I love that I can rely on you for food because the other friends don’t always have food in their fridge”. \n\nThat really bothered me so I almost wanted to tell her that I don’t want to offer her food anymore since I’m already offering accommodation out of kindness. What should I do?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I have a colleague who generally stays at our house when she’s in town. She always pays for dinner and generally stops at the grocery store on her way over to get some things to have on hand & always texts to ask what she can pick up for us. I usually say “nothing” but it is considerate of her to ask. Your friend should be doing something similar.", "NTA, but you'll need to come clean with this person. She's, let's say, abusing your hospitality, and I've seen a lot of cases where this escalates quickly to something almost like invasion.\n\nSet boundaries and come clean, this will be the fastest and best way to settle the matte.r", "Nta and hosting on a monthly  basis is excessive. If its a job requirement to travel she probably gets a travel stipend and is pocketting it. Tell.her you cant host anymore. Shes definitely using you", "NTA but.... \n\nwhy not ask her to pick something up? Or bring you something back from where she is going? esp if she goes through duty-free? \n\nBe clear that it's in lieu of paying for a hotel or what have you, don't just assume she won't ask you to pay her back. \n\nI mean tbh I host friends all the time and I really don't expect anything but agree that a nice small gesture is appreciated. It's not about the expense it's just acknowledging the effort. \n\nBut recognize that she may not be offering bc she's never hosted/ received a host gift or thought to and it's in no way to offend you. She sounds genuinely grateful that you do feed her and just thinks of it as generosity on your part that she appreciates and doesn't presume you want repayment for.", "NTA. \n\nI live in a city so I host people a lot, and always plan food for them based on when they are arriving (snacks versus a meal). BUT, those people also offer to pay for a meal, bring a gift, or return my hosting in some other form. \n\nShe is staying with you purely for HER convenience, and you are already dealing with ensuring you are home, cleaning up, giving her a space, and cleaning up after her, and now she has made it clear she EXPECTS you to feed her. No way. \n\nNext time, tell her there are a number of takeout places she can order food from if she is hungry. I'd also consider declining her requests to stay with you, maybe not every time, but if you value the friendship, it might be worth putting in some passive boundaries. What I mean by that is just saying no a few times so she knows she can't rely on you each time, and when you do host her, tell her she can order in her own food. \n\nOf course if she doesn't get the hint or you feel up for a full on conversation, you can tell her how you feel, but I like to take a passive approach first mostly just to see if the problem resolves itself.", "NTA, but just talk to her about it.  \"Hey, it would be nice if you brought dinner half the time, too.  I love having you over, but I don't always feel like cooking.\"", "Don't pull this sort of passive aggressive bullshit.  Just talk like an adult.  Worst comes to worst, turns out your friend isn't your friend, and the problem solves itself.", "No she hasn’t. I don’t know if maybe she’s just not aware that it’s been a one-way street but her comment about how my fridge has food does make me feel taken advantage of now", "This. NTA.", "“The other friends don’t always have food in their fridge”. Because they cottoned on to her mooching and that she doesn’t reciprocate.  Time for your fridge to be empty.", "I think this is a great solution", "The \"too much\" is the visitor **expecting** food, not OP asking if they've bought enough food to feed all visitors at all times.", "Yes, this. “I haven’t had time to go shopping, could you pick us up some dinner?”", "Well I’m asking here to find a solution, not just for the sake of complaining haha. I’m not a confrontational person so I need to think things through before communicating. However, I do think certain things like give and take should be unspoken rules for any relationships", "Okay maybe it’s more like every 6 weeks or 2 months, but at this point I’ve hosted her like 4-5 times and she still hasn’t made the offer to treat me anything so I feel like it’s a very one-way street. I was raised to be generous so I keep telling myself it’s no big deal because each time it’s just like one meal, but it’s really bothering me now", "You’re being fleeced. Stop hosting her.", "My husband’s friend stays over at our house maybe 1-3x month when he has to be in his office in our city- he ALWAYS brings over desserts etc. & occasionally orders take out for us when we haven’t cooked as gesture of thanks. Your friend is taking advantage & has little manners.", "I like this.", "This is the best response.. especially if, like me, you hate confrontation.", "i agree, it is a bit of a tricky situation lol. hope things get sorted out soon", "The problem with unspoken rules is that there's no mutual understanding of what the rules are, so people can easily hurt each other completely unknowingly. It doesn't have to be a big deal, just bring it up with her and say that you'd appreciate it if sometimes she brought some food along to share because it's feeling a bit one-sided.", "I would maybe just be busy the next time she asks to stay. She doesn't sound grateful if she isn't even treating you to dinner to say thank you!", "This does feel like a one-way street. And her \"I love that I can rely on you for food\" comment is definitely suspicious.", "Does she arrive at dinnertime, or does she want food at strange times of the day?\n\nBeing European, I don’t really get why providing a meal once a month is so hard? Unless you have money issues? Or is it just that she gets food and accommodations and doesn’t even bring a gift? Because that would be kind of expected here in Europe, that you bring something for your host.", "I meaaaaan….it doesn’t take that much to know that it would probably be cool to treat your host at least once….adulting", "Yeah she usually arrives dinner time and hasn’t brought grocery/ offers to treat me in return. A gift has never been brought", "In other cultures, it's expected that a guest bring a gift for their host. That's not to say she should be bringing you a gift every time, but don't let culture let you be taken advantage of. She can fend for herself, but you should talk to her first and give her a chance to change", "You could phrase it as *I can't afford to host you anymore with the rising price of food*, then she can do the right thing & offer you money for groceries or take you out to dinner or wine or dessert. If this is your only issue with her, I'd say this first."]}