{"id": 27163, "submission_id": "16mgi6t", "title": "AITA for selling our house without informing my wife?", "selftext": "My wife and I have been married for many years, but before we got married, I had built up a substantial wealth. When we got married, I opted for a prenuptial agreement and complete separation of assets. She also had a significant pre-marital wealth.  \n\n\n  \nBesides the house we currently live in, I still own a beautiful apartment in the same city that I usually rent out, but it's currently vacant.  \n\n\n  \nOver the past two years, we've had many discussions about moving to a smaller town and getting a house near the beach. Two months ago, we bought the house for our upcoming move. We've already made the renovations we wanted, bought furniture, and will be moving into the new house soon.  \n\n\n  \nSince we won't be living in this city anymore, I didn't see a reason to keep the house we currently live in and sold it without notifying my wife. Considering it's solely my asset, I didn't see the need to inform her in advance. Plus, selling and buying property is always a stressful process.  \n\n\n  \nOn the day I finalized the sale, I told her that I had sold the house, and she was furious with me for not letting her know. She mentioned that she still needs a residence in this city and intends to come here frequently. I explained to her that I still have the apartment, which we can use whenever we need to be in the city, so there shouldn't be an issue.  \n\n\n  \nShe remains upset with me, claiming that I didn't treat her like a wife by not involving her in such an important decision. On the other hand, I believe I didn't leave her without an address in the city, and the house was always exclusively my asset, just as she has her own wealth. She argues that it's a completely different situation because it's the house we've been living in, and we're moving in the next few days.  \n\n\n  \nAITA?", "created_utc": 1695095151, "permalink": "/r/AmItheAsshole/comments/16mgi6t/aita_for_selling_our_house_without_informing_my/", "score": 92, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1)I sold the house which I have been living with my wife without told her. (2) She still needs an address in the city, and she loves the house, so she would like to made this decision with me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Sounds like this house was your main residence. It seems reasonable to me that you would've discussed what would happen to it after your move. That would've been the time to make the case that the apartment you also own could serve as her residence when she's in town. It does seem that you didn't care what she thought about selling the place. You should've involved her, even if you think it is \"your asset.\"", "YTA. It's definitely weird and a dick move to sell the house out from under her without even mentioning it or discussing it. I get that it was \"yours\" but you lived in it together, she was living in it at the time, so it's just really, really strange that you didn't even inform her that this was happening.", "YTA. This isn't a money thing, or even a house thing. It's a communication thing. She's lived in that house for years. She has memories, associations, and probably had plans for the future involving it. Just snatching that away from her is an AH move.", "YTA cool its your money but damn is she your partner or what? If you can't talk through life deicsions with your life partner and treat her like an equal why did you get married? I couldn't imagine doing something like that to my bf.  Not to mention she was living there and its a big deal to have your house sold out from under you, whether  you owned it or not. Ultimately this is not about the money but about your wife feeling like an accessory.", "Wtf is your marriage. It sounds more like a business deal than a relationship..", "YTA\n\nPlease post an update on whether she actually moves with you after this. Thanks!", "YTA. what’s wrong with people’s communication? Of course you have to talk about these kind of things.", "YTA. She’s your wife not a roommate. Your wife shouldn’t be finding out what’s going on in your life after the fact. And this isn’t something small like a tattoo, which most couples also discuss btw. It is a huge deal and will affect you both regardless of prenup or solo assets.", "YTA. Do you see your wife as your partner in life or just a business arrangement? Even if the house was yours like you said, it was the home you both lived in. Not communicating that you would be selling it to her comes across as you don’t care about her enough to even tell her you were going to sell it. You need to share with your wife.", "OP is definitely hiding the reason why they didn't tell their wife. Nobody can be this obtuse.", "YTA.\n\nIt is your place to do what you want with. But, if you care about your wife you would have involved her in the decision.", "She’s right.  You sold the house you’re currently living in without saying a word until you were able to present it as a fait accompli.  Even when a thing belongs wholly to you, if selling it affects your partner - like, say, forcing them to move - part of being a *partner* is at least talking about it first.  That gives your partner the ability to have a conversation with you about their priorities and needs and how not having their current living space will work.  It gives them more time to make alternative arrangements if your ideas about how their needs will be met don’t suit them.  The whole point of being married is that you’re choosing to become a team, theoretically for the rest of your life.  So act like one! YTA", "YTA- Sir you may be great with finances, but you apparently fail at relationships. To your partner, that house is more than a simple dwelling, it was a place filled with shared memories. A Prenump has nothing to do with the martial emotional betrayel you just pulled. This is an emotional/relational mess you made, not a financial one.\n\nChances are you two will still stay married and everything, but I hope you take some onus and apologize to her for not consulting her about this decision. Bonus points if you can validate her conflicting feelings of anger, sadness, and grief with moving out of a home where likely so many amazing memories have been made without time for closure. Failure to do so could lead to building resentment that could impact your relationship long term.", "YTA\n\nIt is weird to not communicate that you’d be selling the home. Yes, you own it. Are you not capable of disclosing major decisions to your wife, or would you rather blindside her? There is a disconnect that you don’t see. You should’ve told her.", "Yta it's a lot of extra work moves to a different aparment she should know before it happens.", "YTA…seems like you’d have to do a lot of lying and sneaking to pull this off. Why so shady?", "YTA. It may have been your asset, but it was also her home. You didn't need her permission, but it wasn't okay to not even tell her.", "YTA. If you had a dog before you got married, then both lived with the dog for years, then you had the dog put down while she was gone and don’t tell her, then tried to say - it was my dog first she shouldn’t care, you’d be Captain of the Assholes. In this case, you’re the lieutenant.", "YTA. \n\nWtf is wrong with you?", "YTA. It was home to both of you even if it was your property. Though you defend yourself using logic, this reeks of underlying malice or resentment. I would say you've got some big problems in this marriage. Your poor communication is the tip of the iceberg. You need to be honest with yourself about what motivated you to do this.", "It's common courtesy to discuss major things like this with your spouse, regardless of whose asset it is.  She lives there now, so it affects her, whether or not you realize that.  YTA", "YTA. Whether you own it or not, this is the house she lives in.\n\nAnyone with the tiniest shred of decency would have clued her in. You did it this way to assert control.", "YTA. A heads-up would've been the right thing to do.", "YTA\n\n\\-read your own post. It is clear that you are...", "YTA", "YTA. Common decency and respect dictates saying something to your wife prior to selling the house. Yes. Even if it was solely yours. What you did was a dick move.", "That seems like a pretty big decision to not at the very least inform her about your plans. Had it been the apartment, I would understand but the main residence? That makes Yta. \n\nShe lived there. She should have been informed.", "YTA. Yes, it was your property. Ultimately the decision is yours. But how do you not think this is something you should talk to your wife about. Even though your assets are separated you are still a team.", "Uh, people in transactional marriages.. it may have been solely yours but she lived there too. \n\nYTA", "Major YTA, how could you not tell your wife you sold the place you were living in?", "YTA so much that I'm not even sure this is real.\n\nYou guys talked so much about this move over **years,** but you drop selling the house you were both living in as a last minute piece of info?...\n\nDoesn't sound like you see her as much of a \"business\" (OP's language, not mine) **or** \"romantic/emotional\" partner. Not even sure why you'd be married. **This screams \"I know best and didn't want to worry your pretty little simple mind, so I took care of it\"** which is extremely condescending.", "Yta", "Big YTA. Do not be surprised if your wife leaves you. In some states, no matter who owned it first, the spouse has some interest in the primary residence in not getting forcibly displaced from it.  This is something someone does when they want to dump someone", "YTA and with communication skills like yours don't be surprised if that pre-nup swings into action sooner rather than later. \n\nWhy the heck wouldn't you mention it? You could have let her know what you were planning to do, but that you weren't expecting her to deal with any of the legalities or paperwork as she's busy with the other house. That way she would have had a heads up and be able to consider where she'll stay when she comes back to the area.", "YTA, please post an update when she divorces you", "You could have told her. I mean, why not??? Its just weird.", "It's not about the money, it's about respect your partner. Like your kidney is yours but if you want to donate or sell it at least talk to your family first.", "It’s not the point of leaving her with the apartment or not. Nor does it matter if it’s your asset or not. You did it and did not have a general conversation about it to be a dick and act like you can do as you wish with no consideration of her. I’m sure she wouldn’t have cared about the sale but it’s more about including her in the decision within the marriage.", "Whatever.  It’s not a partnership marriage. It’s the other kind. Now at least his wife knows.", "YTA \n\nHoly hell YTA. \n\nYou don’t sell the home someone lives in, regardless of who they are, without at least informing them. \n\nYou sold her home, regardless of whose name is on it (and prenup or not, asset or not, a marital home that she’s lived in for years is still her home too.) \n\nWho think it’s okay to sell a house that you both live in without mentioning it first?", "It's like you're not even married. You're business partners who live together. YTA", "YTA. As she said, you haven't treated her as your wife. You're looking at it as just an asset however that asset also has a lot of memories in it. If you had made your mind to sell it as 'your asset' you could have given her the option to buy it. Sounds like you need a little more communication bud...", "YTA", "YTA.\n\n&#x200B;\n\nIn what world would you not even casually mention it before selling?\n\n&#x200B;\n\nAlso how did you do any showings without her knowing?", "YTA-Communicate with your wife. You guys aren’t divorced yet.", "I mean is it that hard to tell your wife so you could avoid this situation? OP is hiding something.", "YTA. It may be your asset but it’s her home. You should have discussed it with her.", "Without even informing her? Absolutely YTA. You didn't have to ask or get permission, but you could have let her fucking know.", "YTA. It doesn’t really matter if the house is solely yours, she’s still your spouse. Spouses need to be informed of these things.", "YTA. Had a school friend who's parents divorced because his step-dad bought a house without informing his wife, forcing her to sell her inherited childhood home they had lived in before then to get through the payments because they had merged all accounts at marriage. So yeah, who would've have thought making life changing decisions on your own, which also involves your partners life, without communication would leave to arguments and a possibly strained relationship. That apartment of yours don't matter in this case", "You keep saying ‘solely MY asset’ as if being legally in the clear absolves you from all other responsibilities. \n\nYou have a responsibility towards your wife to discuss major decisions. That’s part of being in a relationship. I don’t understand how you managed to sell your home behind her back without her knowing. Don’t you talk? At all? \n\nYTA. There has to have been a conscious decision on your part to not tell her.", "I am so confused… how do you communicate in your marriage that you managed to sell a whole house without once mentioning it to your spouse? This is a process that takes time and effort so, even ignoring that you did not consider it necessary to inform the person that you share your life with about such an important step, how has it not even once been mentioned just casually during one of those “how was your day” talks? YTA 🙄", "YTA.\n\nYou don't respect your wife. If you did, you would communicate major decisions with her.", "I’d leave you, not gonna lie YTA, you are supposed to be partners but you are a dictator", "YTA\n\nI struggle to believe you can go through the whole process of preparing, showing, and selling a house without your wife knowing unless you were actively trying to hide it. You didn't mention at any moment a meeting with an estate agent? You didn't mention someone coming to view the property? You didn't mention the logistics of moving out all of your furniture into the new property? You waited until it was all completely done before you told her anything at all", "YTA. It's both of your's current residence. You seem to attach way too much weight to property ownership over and above consensus-baded decision-making in a marriage. (This is not to say that you don't have the ultimate say about the house. Just that you didn't even give her any chance to give input, possibly change your mind. Also, you made no effort to change hers and come around to your attitude.)", "YTA, it's not about who has what assets, or reducing stress, or even asking permission. You basically evicted your woman. You didn't even think of any sentimental value the home may have to her. The prenuptial was to protect assets in case of failure, right? It wasn't supposed to be a carte Blanche to live as if you have no responsibilities to anyone", "Yta", "YTA \nSo your money - your business. Maybe it would make sense for your wife to look for HER OWN apartment in the city. Of course, without informing you beforehand, because she would have been paid by HER money, so not your business. She wouldn't want to stress you with it...", "YTA -  So the house that has been HOME to you both was simply discardable without so much as a discussion?  No heads up?  No anything? \n\nIf your marriage is good, then there are likely \"many years\" of loving memories in that house ... and you just tossed them away without much of a thought.  Are you really that lacking in sentiment?  Because clearly your wife isn't.\n\nWhile it may be technically yours, it was HER HOME too.  And you totally discounted that.\n\nYour screen name is sadly ironic.", "YTA. Yes,  it was \"your house\" but it was her home. What you took from her was the benefit of her input. You can justify the reasons all that you want, \"we talked about it being too big\", but ultimately this was a decision that should have been reached mutually.\n\nYou seriously disrespected your partner.", "You were intentional about keeping it from her. You had plenty of opportunity to mention it but you chose not to. So yes YTA.", "Um, is this actually a question? Of course you should have discussed it with her and if you knew you definitely were planning on selling it the discussion would have been more of a letting her know in advance kind of thing which is only right as she's your wife. Good grief. You are married and live together. Why would it have been so hard to have a conversation?", "YTA, but only slightly. I consider a prenuptial agreement as something to document how you’d split assets if you divorce. While you’re married my understanding is it would be still be yours together. Anyway I don’t think you meant to be an asshole but you should’ve ran it by her at least.", "INFO did the real estate agent and/or the prospective buyers look around the property?", "NTA for selling the house but you are one for not talking to her about it. Your reason for selling are more than reasonable the upkeep of the house, you will no longer be there full time, it’s too big for just two people and you have an apartment that you can stay at in the city. The only thing you didn’t factor is the emotional connection that your wife has with the house and yes it isn’t her property which I understand but you should of at least spoken to her and told her your plans before selling up.", "I'm gonna say NTA but you could have given your wife the courtesy of a heads up.  \n\nYou already bought a new place and you still had the apartment.  The house was your property and it was your right to do with as you wished.  Unless you were going to give her the option to buy it, the fact that it *was* her home doesn't entitle her to a veto in case she objected to you selling it.  \n\nMy husband purchased the house we live in before we got married.  We didn't sign any pre-nup and my name is not on the deed, but a platform has been set-up for me to inherit the home and his assets should anything happen to him God forbid.  I was visiting my grandfather (Parkinson's) for what will likely be the last time when this house went up for sale and he pulled the trigger while I was away.  After losing 4 separate opportunities (very aggressive housing market at the time), I don't blame him for not including me.  \n\nI also understand that if he decided to sell this place it's on him.  Your wife is not wrong to feel excluded on a big decision, but the decision was never hers to make.  I won't say that means it doesn't matter ultimately, but in the end, it doesn't matter: it was your asset to manage as you see fit.  Unless she was going to buy (or rent from you) her opinion on what you should do with your stuff is just that, an opinion.", "NTA, A testament that there is always varying degrees of wealth. \n\nBut, the wife is the boss.. you know that…", "First world problems.\n\nAnyway if it was in the prenup it's mostly a decorum/general communication breech rather than a morally bad one. NTA", "Marriages with prenups aren’t real partnerships anyway.", "NTA. You sold an asset you owned. It didn’t impact your wife or her quality of life. If your marital understanding is that you manage your assets separately, you didn’t need to consult her before acting in your best interests. I understand she would be disappointed that you didn’t discuss it with her, but I don’t think YTA because of that.", "Yes. As the man, it is your duty to always roll over and eat shit in favour of your wife.", "ESH \n\nYou should have informed her.\n\nShe shouldnt have been upset for so long.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy wife and I have been married for many years, but before we got married, I had built up a substantial wealth. When we got married, I opted for a prenuptial agreement and complete separation of assets. She also had a significant pre-marital wealth.  \n\n\n  \nBesides the house we currently live in, I still own a beautiful apartment in the same city that I usually rent out, but it's currently vacant.  \n\n\n  \nOver the past two years, we've had many discussions about moving to a smaller town and getting a house near the beach. Two months ago, we bought the house for our upcoming move. We've already made the renovations we wanted, bought furniture, and will be moving into the new house soon.  \n\n\n  \nSince we won't be living in this city anymore, I didn't see a reason to keep the house we currently live in and sold it without notifying my wife. Considering it's solely my asset, I didn't see the need to inform her in advance. Plus, selling and buying property is always a stressful process.  \n\n\n  \nOn the day I finalized the sale, I told her that I had sold the house, and she was furious with me for not letting her know. She mentioned that she still needs a residence in this city and intends to come here frequently. I explained to her that I still have the apartment, which we can use whenever we need to be in the city, so there shouldn't be an issue.  \n\n\n  \nShe remains upset with me, claiming that I didn't treat her like a wife by not involving her in such an important decision. On the other hand, I believe I didn't leave her without an address in the city, and the house was always exclusively my asset, just as she has her own wealth. She argues that it's a completely different situation because it's the house we've been living in, and we're moving in the next few days.  \n\n\n  \nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Rich people problems lol", "YTA. I'm honestly a little shocked at how little consideration you gave your wife's feelings and input, it's a marriage not a business arrangement. It doesn't matter that that house belonged to you, you should have at least communicated your thoughts on the matter and at the very least at least mentioned it as an FYI.  Selling a house doesn't happen overnight, there was plenty of time to let your wife know about this. \n\n  \nPlus, given that you two were living in that house, you should have mentioned your plans to sell it. There is a lot of sentimental attachment with homes, even if it only had your name on it, the memories there were both of yours. At least she would have had time to process this.", "YTA \n\nShe’s your wife. Not your employee!", "There is financial ownership and emotional ownership. You may have had the deeds to the property but she had invested her life and love into that HOME. She deserved a heads up if nothing more. She wasn't after your cash,  she just wanted your consideration.", "C’mon man, you know that’s still the kind of decision couples make together. If yall have a true partnership, who owns the asset is immaterial. \n\nYTA and I think you’re being willfully obtuse in acting like you can’t understand how you done gone and fucked up.", "What on earth‽\nIt takes months for the sale of a house to go through, and you didn't mention it once?\nYou are a clueless buffoon. \nYTA.", "YTA, it may have been in your name, your asset, but she had lived there with you all your married life. It was just a cold move by you.", "Like this is your wife, whom you live with and presumably have for years, and you basically just pulled the rug out from under her. Living arrangements changing should not be a unilateral decision like this and they certainly shouldn’t be sprung on someone out of nowhere.", "We had talked about how the house was too big just for the two of us and how it required a lot of upkeep, so I thought it was a given that we would sell the house after we moved.", "She was very involved with the other house. She was overseeing the renovations, buying furniture, and so on...  \n\n\nTo avoid causing her more stress, I handled the sale on my own. One of the reasons we decided to move was because the current house was too large for just the two of us. I figured it was obvious that we would sell the house soon.", "Do you think he should have offered to sell the house to her?\n\nBecause memories are all fine and well, but you don’t hold onto a house you’re not living in for nostalgia\n\nYTA for not communicating with your wife", "Man, I even discuss with my husband how I’m investing my fathers inheritance. I cannot imagine making such a big decision on my own. How?", "Even in a business relationship there’d be better communication than this…", "Every marriage is a business deal, every marriage is a contract that people sign. The only difference here is that we made it clear that our union wasn't a merging of our assets.  \n\n\nIt is an excellent solution to avoid problems from future divorce.", "This is a stupid answer that has nothing to do with the question at hand.", "Why not?", "> It didn’t impact your wife\n\n&#x200B;\n\nAre you dense? She lives there.", "And clearly it wasn’t. So now that you know that, why not just admit you made a mistake and apologize to her?", "It wasn’t just a house. It was her home. So not just an investment for her.", "Obviously it wasn't a given. For you maybe but you have to open your eyes that she is involved also even if you own it outright. AND you have to move in the next few days????? YTA\n\nPeople need time to decide where they will send their stuff, who will pack and ship it, now it's the 11th hour and she didn't even have hours 1-10 to get a plan going. That was a total dick move on your part and you know it. Why are you married then? Are you trying to show her she doesn't matter?", "if it was a given, your wife wouldn’t have reacted the way she did.\n\nso now you need to own up to your mistake, apologize and fix it instead of doubling down. YTA", "YTA. You’re reasoning for selling the house isn’t in question. Communicate. She’s your wife for crying out loud. We get it, it’s your house. You own it fully, she has no stakes in it. None of that matters. You need to discuss things like this in a marriage. You’re suppose to be in a partnership, but you’re just thinking of yourself. Even if you’re selling it regardless of what her opinion is, you still need to communicate with her. Communication in a relationship is huge.", "while its your sole asset and not your wifes thats fine but as a common curtesy as respect for your wife you could have let her know your selling the house etc so she can feel like she is your wife and not some random person as an afterthought to tell them", "Sounds like the only thing you agreed on was that it required a lot of upkeep. Not that you agreed to sell it.", "Thought it was?  Based on which… never mind.  She doesn’t factor into your business dealings. No need to discuss.", "and that explains why you thought it was appropriate to not even tell her you sold it until after the sale was done because....?", "\"Hey babe, I'm thinking we should sell the house. I've already contacted all of the correct people and have everything handled, I just wanted to let you know. You don't have to do or worry about anything. Does this all sound okay to you?\"", "SHE LIVES THERE THOUGH", "It is not that difficult to just give a heads up.", "If this was really your reason than it has already been prove beyond doubt that you were wrong. Her preference was for her to be involved, and your action caused stress. \n\nIf this had been your rationale you wouldn't have to ask here, but instead would know that you were wrong.", "She's literally living in the house right now.", "Maybe that what she wanted? But absolutely she should have being in the discussion", "op knew what they were doing. \n\ndidnt say a word about it until the sale had gone through and there was no chance to backtrack the decision. says it all really", "Okay well... that's something \n\nMy marriage was a union of families and an oath. Not all contracts are business deals. Some are just promises that you make to another person that matters to you.", "It’s a good thing you are so prepared for a future divorce. Treating your wife as an afterthought like you are and not communicating with her will her you that divorce eventually.", "You certainly seem to be heading to that future divorce", "What a sad marriage you have", "Except this kind if thing,  selling the house you are currently living in, without talking to your spouse about it, is precisely the kind if thing that breaks up marriages.\n\nThis is your wife. Your partner. And you don't even think about it.  This is the problem.", "Why are you even married to someone you don’t like?", "You shouldnt have gotten married if you see marriage this way. Just dont bother. Whats the point? \n\nMarriage is for when you love someone enough to make them your family. \n\nIf youre not into that kind of vulnerability, just have a girlfriend and live separately. Dont play house if youre not ready for what comes with that.", "Except you're headed down the path towards divorce because of your lack of communication.\n\nMaybe this time won't be the final straw for her, but you sound so insensitive and callous that she'll hit her breaking point eventually.", "YTA. You cause completely unnecessary problems in your relationship by thinking this way.", "Well. At least now your wife knows where she stands in your ‘business deal marriage’. \n\nAlthough I would think in a business deal with partners that are even the tiny bit amicable towards each other (let alone intimate) you give each other a heads up before selling each other’s homes.\n\nI hope there’s more warmth between you two than indicated in this post, because the temperature seems barely above zero.", "What a sad man you are.", "Show your wife your comment and let’s see how she feels about that.", "You seem to be missing some key aspects of a marriage that come way ahead of the contractual relationship in the minds of many.", "You know what solves problems better? Communication. Apparently you see that as an asset not to be shared with your wife. Given it’s value, it’s not surprising. YTA", "Wow, uhh, that's very sad. That you think that way. Depressing even.", "Sounds like you guys should live in separate properties because why would she live in your house rent free, am I right? You should charge her rent for the years she had live in your house.", "Yeah, you are probably gonna need that!", "Wow you sound like fun", "Yeah, something like this, just a simple heads up.  Gives her a chance to voice any concerns.\n\nI'm also curious how a house can be sold with someone who is living in it not knowing - weren't there open houses, agents coming by, etc?", "Now now.  Op needed to swing his big wallet and remind her-  his asset. Not hers.", "Like how does marry someone and not realize they want to be included in major life decisions", "Depends on the location. Some housing markets are crazy. If it is for sale, people will buy sight unseen."]}