{"id": 27174, "submission_id": "16mlqy4", "title": "AITA for telling my sister she needs therapy for her unrealistic expectations?", "selftext": "My sister Norah (40f) married Aidan (42m) five years ago. Aidan was a widower with two kids when they met. His daughter is now 14 and his son is now 13. Norah and Aiden had their daughter five months ago.\r\n\nAidan and his late wife were childhood sweethearts and their families were very close friends. This did not change after his late wife's death. They often get together and celebrate holidays or just to spend time together. Norah was made aware of this when she started dating Aidan. She was also told that would never change. Aidan said the families have became almost like one big family over the years and they would never exclude the others.\r\n\nNorah confided in me when she married Aidan that it was awkward seeing photos of his late wife at different ILs houses. Aidan's parents have a couple from when Aidan and his late wife were kids and some from when they were married and had the kids. Aidan's sister has childhood photos and adult photos of her and her late SIL, because they were best friends as kids. Norah said it felt like a message they were sending to her. I said they clearly loved Aidan's late wife and it was likely nothing to do with her. But some people keep photos of late loved ones up and some others will take them down. I suggested to her then that she should speak to a therapist because they were unlikely to remove traces of Aidan's late wife from their homes and lives and she might need some professional help learning to accept that.\r\n\nShe mentioned a few times over the five year marriage that she felt like Aidan's ILs (late wife's parents) did not embrace her as much as Aidan's family did and how much it bothered her. She brought up a lot that the kids always referred to her as step and shot her down hard when she suggested they could call her mom.\r\n\nIt was after Norah's daughter was born that she left me shocked. She and Aidan decorated the baby's room very late (last month actually) and I had wondered why because she was looking at all the inspo boards while pregnant. It was two weeks ago when she came over and started complaining that Aidan's ILs had gifted the nursery decorations for their grandchildren and she had held out waiting for them to do the same with her daughter's. She then complained that they were not treating her daughter like their grandchild and how they shouldn't all be one big happy family if that does not include her and her daughter fully. She said if they want to stick around they should treat her daughter the very same as they did/do their grandchildren. She said it must be their lack of treating her the same that has her stepkids saying she's a half sister and not just saying she's a sister.\r\n\nIt was after this I suggested my sister needed therapy because her expectations were so unrealistic that she had left me stunned. My sister said I should be on her side and telling her she needs therapy is saying she's wrong. AITA?", "created_utc": 1695113511, "permalink": "/r/AmItheAsshole/comments/16mlqy4/aita_for_telling_my_sister_she_needs_therapy_for/", "score": 4016, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I suggested to my sister that she needs therapy because of her unrealistic expectations and struggles with excepting the reality of what she married into. My sister might be totally right for feeling as she does and I might be some kind of asshole for not supporting her more and agreeing. Saying she needs therapy implies that she doesn't have the correct outlook/is wrong and as her sister maybe I should not see it that way, or as a person. Maybe I should have let her vent and said nothing.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Wait wait wait.... Did I read that right? His IL's, like his late wife's parents? Your sister wants HIS LATE WIFE'S PARENTS to pay for HER child!?\n\nWhile she can absolutely feel her feelings (not about being called step mom), especially being married for five years, but absolutely that is too far! And to make it out like blackmail, hell no.\n\n\nAnd hell no they don't need to embrace her as much as they embrace THEIR OWN DAUGHTER. wtf is wrong with her for that. \n\nYou are NTA, she definitely is after that last bit.", ">She brought up a lot that the kids always referred to her as step and shot her down hard when she suggested they could call her mom.\n\nShe is their step mum and trying to get them to call her otherwise is a horrible move\n\n>Aidan's ILs had gifted the nursery decorations for their grandchildren and she had held out waiting for them to do the same with her daughter's.\n\nSo she expected them to decorate a room for a child that isn't even their grandchild?\n\nNever mind sorting out unrealistic expectations if she doesn't sort herself out her marriage won't last. \n\nNTA", "NTA. Your BIL’s first wife didn’t leave because she no longer loved her husband and family. She died. To expect her husband’s first wife’s parents and children to treat her as a replacement is so unrealistic it’s mind boggling. \n\nIt sounds like the former in-laws welcomed her into their home. Your sister’s pushiness is also more likely to push the kids away. They have to come to your sister on their terms. I hope the kids are allowed to have pictures of their mother in their house. Her expectations are bound to make her and everyone around her unhappy.", "NTA she needs a realist check asap. \n\nThe parents of the late wife aren’t going to pay for the new wife’s child! That is so ridiculous to even expect. Your sister does need therapy because her child is not their grandchild in any way.", "NTA\n\nShe can't expect the parents of the deceased's wife to decorate her child's bedroom.  That is insane.\n\nAlso it probably never crossed their mind because they would think that Norah's family would like to do that and they don't want to take away things from Norah's family.", "NTA. I can't stand the entitlement behind someone saying you should just take their side no matter what, especially after saying things that she did. Yikes! She knew going in what the story was and was told very bluntly that it would never change. She went forward with it and now wants it to change... Why do people do this???", "As her sister, you should be the first person to tell Norah the unvarnished truth, as you did.  She is being illogical and unreasonable.  \n\nNTA\n\nThis makes me think that Norah and Aidan did not do any pre-marital counseling.  That would absolutely been the time for Norah to share her expectations about her now-step children, in-laws, and Aidan's late wife's family.  In addition to Norah seeking therapy, she and Aidan should likely seek couples counseling so that they can have a neutral, knowledgeable referee to discuss this issues.", "NTA. \n> She then complained that they were not treating her daughter like their grandchild and how they shouldn’t all be one big happy family if that does not include her and her daughter fully\n\nThis really shows how she’s TA because they aren’t even related and have not known her for long so why does she expect so much from them??", "NTA. Sounds like she's attempted to force a relationship with her step children and it's not going well for her. She's the reason their half siblings, not the grandparents. If she removes those grandparents from those kids lives A: it'd probably qualify as one of the rare scenarios grandparents rights actually exist, especially consider how old her step children are. So she's not going to get her way anyway. B: She's guaranteeing those children will never ever accept her as a parent by tearing her living family apart. \n\nIf anything you didn't say enough here. Your doing the right thing OP.", ">She mentioned a few times over the five year marriage that she felt like Aidan's ILs (late wife's parents) did not embrace her as much as Aidan's family did and how much it bothered her.\n\nSo, she's expecting a stranger to be treated as their daughter was. What was she expecting :D Yeah, NTA, she does have very unrealistic expectations. She doesn't understand why the pictures are where they are. They're not going to unperson their daughter because he got a new wife.", "You're NTA, in fact I think you did your sister (and her husband / dgter / steps etc) a big favour by puncturing her thought process. She desperately needed the reality check. \n\nWhen this occurs in my life and the other person seems to be in denial I tell myself it's like a message in a bottle, and they might think of it later when they can be more receptive. Good for you.", "You’re NTA, but in some ways your sister is right. Not about the nursery, but if his in laws are always around, involved in all family gatherings, including the ones at her husband’s family, they SHOULD treat the baby the same. Or they should visit their grandchildren separately. It’s just basic kindness.", "NTA, and you are on her side by pointing out that she's not being realistic or fair. \n\nHer daughter isn't their granddaughter, and their grandchildren will be her half siblings. I can see why the constant reminders of deceased wife would be stressful, and there needs to be a discussion about that separately, but your sister is being unreasonable with the nursery.\n\nSadly OP, I have a feeling that you're going to lose no matter what you say because I think your sister wants someone to vent to and carte blanche support her views, not actually someone who will offer advice and solutions.", "NTA. I understand feeling insecure about a partner’s deceased spouse, but expecting anything from her parents is absolutely bonkers. They lost their daughter, their grandchildren are their connection to her. Of course they’re not going to treat your sister’s child the same way, that’s totally delusional. I’m actually shocked at the expectation, like OP is.\n\nAlso, just a note from my own experience. Everyone has baggage to deal with, that’s what you sign up for in a partnership. Being jealous, expecting unreasonable stuff, being generally hostile is going to get you left. That isn’t to say you should just accept everything, but if you know the score beforehand, you really have no right to complain. Steer into the skid, or drive off, you can’t have it both ways", "NTA - I can't even begin to imagine why she would think these people would have to treat her as if she is transplanted into the exact same role as her husband's late wife. She is a separate person and should relate to her family with the full knowledge and understanding of this. Pushing to take over the late wife's position is weird and will probably alienate everyone she tries it with.\n\nSomeone marrying someone who has had a life with a previous partner should be prepared to own that reality and relate to it with maturity and healthy boundaries. Her husband's late wife *is not her competition*, she's a previous chapter in his life and an important person to him and his family. Now that he has remarried, that doesn't erase this other person, that means he's ready to start a new chapter and expand his family.\n\nYour sister should be looking to the family she's directly related to if she wants favours, gifts and special treatment. Her own parents and her husband's parents are much more likely to be invested in her child than her husbands late wife's parents... who have grandchildren of their own as well as grief over their lost daughter that they need to navigate in their lives. Your sister should definitely talk to someone, therapy, or even counselling about how to maturely and healthily relate to blended families with respect and good boundaries.", "Going to therapy is not about being wrong or right. It about dealing with yourself and your feelings and issues. NTA", "You’re absolutely correct. Her child already has two sets of grandparents, just as her step children have theirs. The claim that the families keep pictures of the late wife as a “message” to her is ridiculous and absolutely should be talked about with a therapist. It’s not like she suddenly got blindsided and ambushed. She knew what she signed up for and made up those expectations herself. NTA", "Oh wow NTA.  I'm in the same boat as Norah.  My wife's late husband's family is still very involved in her and my step daughters lives.  I've never expected anything from any of them when it comes to doing or giving things with/to my childern.  They have at time and I'm extremely grateful for it, but to expect it is insane.", "NTA\n\nShe really should have done therapy before.", "NTA She is being ridiculous. On what planet would his dead wife’s parents pay for HER baby items???? It doesn’t make sense. This isn’t their grandchild", "Nta yeah your sister has some serious issues his late wife family should not be involved in your sister child they have nothing to do with her", "NTA. \n\n\nBut maybe Aiden should be inviting people over instead of going over", "Info\nAre your parents alive? Are they involved in your sister's life? \nHas she been making them embrace her step D's over the past five years and make then the centre of your family?\n\nShe sounds a bit delusional, you might want to talk to her husband and talk to her kids privately.  She sounds like the type who is nasty and cruel to the stepkids in private while being sugary sweet in public.", "Nta she's not their daughter and her child isn't their grandchild. It amazes me that this theme comes up so often in reddit.", "Not everyone is a good match for a widow/widower precisely because you have to be ok with the memories of the deceased.\n\nIt sounds like the sister is one of these people and shouldn't have married him.\n\nSince that horse is out of the barn she should get some therapy, and maybe some couples counseling so she can communicate in a healthy way with her husband.  Maybe he can help her with her insecurities, and there might even be compromises that can be reached.  Telling someone to suck it up rarely works well even if it's warranted.\n\nI know that my ex hb was close to his ex in laws (divorced,  ex was alive) but the boundaries were poor and I never really felt included.  I never wanted him to cut them off and never would have dreamed of asking then to spend money on my kids, but there were things he could have done to make the boundaries a little better and to include me in things.  He still would have been able to have a relationship with them.\n\nHe refused and it's one reason we divorced.  The other was his cheating, but I digress. \n\n A counselor could help both of these two.", "I can kind of understand where the sister is coming from (kind of). It seems like a double standard that they want to be/act like one big happy family that includes everyone except when it comes to new wife and baby. The husband wants the ILs at the baby shower like a grandparent but then no one treats mum and bub like family.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister Norah (40f) married Aidan (42m) five years ago. Aidan was a widower with two kids when they met. His daughter is now 14 and his son is now 13. Norah and Aiden had their daughter five months ago.\r\n\nAidan and his late wife were childhood sweethearts and their families were very close friends. This did not change after his late wife's death. They often get together and celebrate holidays or just to spend time together. Norah was made aware of this when she started dating Aidan. She was also told that would never change. Aidan said the families have became almost like one big family over the years and they would never exclude the others.\r\n\nNorah confided in me when she married Aidan that it was awkward seeing photos of his late wife at different ILs houses. Aidan's parents have a couple from when Aidan and his late wife were kids and some from when they were married and had the kids. Aidan's sister has childhood photos and adult photos of her and her late SIL, because they were best friends as kids. Norah said it felt like a message they were sending to her. I said they clearly loved Aidan's late wife and it was likely nothing to do with her. But some people keep photos of late loved ones up and some others will take them down. I suggested to her then that she should speak to a therapist because they were unlikely to remove traces of Aidan's late wife from their homes and lives and she might need some professional help learning to accept that.\r\n\nShe mentioned a few times over the five year marriage that she felt like Aidan's ILs (late wife's parents) did not embrace her as much as Aidan's family did and how much it bothered her. She brought up a lot that the kids always referred to her as step and shot her down hard when she suggested they could call her mom.\r\n\nIt was after Norah's daughter was born that she left me shocked. She and Aidan decorated the baby's room very late (last month actually) and I had wondered why because she was looking at all the inspo boards while pregnant. It was two weeks ago when she came over and started complaining that Aidan's ILs had gifted the nursery decorations for their grandchildren and she had held out waiting for them to do the same with her daughter's. She then complained that they were not treating her daughter like their grandchild and how they shouldn't all be one big happy family if that does not include her and her daughter fully. She said if they want to stick around they should treat her daughter the very same as they did/do their grandchildren. She said it must be their lack of treating her the same that has her stepkids saying she's a half sister and not just saying she's a sister.\r\n\nIt was after this I suggested my sister needed therapy because her expectations were so unrealistic that she had left me stunned. My sister said I should be on her side and telling her she needs therapy is saying she's wrong. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYou are on her side, trying to stop her from saying/doing something she'll regret.\n\nDoes Aiden know how his wife feels?", "NTA. And yes: a therapist is a sensible step for someone lacking insight to this degree.", "I understand when she expected her mil and fil to pay ( if they did before ) but for late wife's family?The audacity!And entitlement!", "NTA\n\nThat family owes your sister nothing. But I think your words may have been too harsh.", "Norah needs to realise that it’s not all about her. Aidan’s late wife was special to all the people in her life and they are not going to ‘file her away’ just because Aidan has remarried. Also, she has no right to expect that the parents of her husband’s late wife will see her child as their grandchild. She is being delusional. You are NTA.", "Don’t marry a widower if you can’t handle it.\n\nAnd her expectations are high for is Exinlaws.", "Yeah no shit telling her she needs therapy is telling her that she's wrong... because she's wrong!\n\nNTA", "NTA. Her expectations are nuts. She feels threatened by a dead woman and wants everything to just be normal, but it won’t be. Blended families are complicated. She really needs to pursue therapy to sort out these feelings and set herself up for realistic expectations.", "Could you have approached it better? Probably. But, at the end of the day your sister does have some unrealistic expectations about her situation. It’s okay to have feelings about the kids preferring to call her step-mom over mom or even feeling a little uncomfortable that there are a lot of reminders of the first wife around the in-laws places, but these are things you sort of need to just accept. \n\nAiden’s first wife didn’t leave him in a nasty divorce; she died. And when you marry a widower, especially one with children, you have to be secure enough with yourself and your relationship, because the deceased partner can’t just be erased.\n\nIt sounds like your sister is just very focused on her own feelings, and either doesn’t have the capacity or want to empathize with the people around her. Those kids may never call her “mom”, not because they hate her, but because they have a mom and want to keep her memory alive. They’re also kids who might have difficult feelings about their dad remarrying and having another child. And it would be wild to expect deceased wife’s parents pay for his second wife’s kid or to pretend their daughter didn’t exist so your sister can feel better. \n\nSo, I would say NTA. Again, there was maybe a more sensitive way to approach the subject, but it sounds like your sister is heading down a path where she’s going to try to cut the deceased wife’s parents out and make her husband choose sides. While therapy would be helpful, I don’t think your sister is in a headspace to acknowledge she needs help in that way. Instead of saying she needs therapy, it might be better to say something like, “it sounds like there’s a lot of stuff you’re dealing with right now, and it’s taking an emotional toll on you. I’m always happy to listen, but it might be really helpful to talk with someone who can give you strategies to manage these situations”.", "Probably unpopular but YTA but it is a very tricky situation and you could be a little more understanding. I don't totally find a complete fault in her logic.\n\nHusband's ex in laws (late wife's parents) are not related to her at all, however she had to accept them and treat them like a \"big family\". However, it is unfair for her to not receive the same consideration back. If husband wants everybody to be a big family, he should also defend his wife and ask for the same treatment for her. Right now she is only giving, without receiving anything back. She had to accept the in laws, see them all the time, treat them like family, but the same is not applicable to her, she is just another woman. \n\nI know you will say she knew this before marrying her husband. Yes, she did. But I don't think she knew that husband will only expect her to work on that relationship. Also, a good husband will try to minimize the chances of his wife feeling like a non priority by small actions like maybe suggesting to his parents to add a picture of her as well on their wall, creating and adding new memories with her included, explain to his kids that a half sibling is still a sibling and try to remove this kind of wording etc. \n\nYou could definitely have more empathy for her and think if you were in her shoes, would you need some support and understanding or someone who constantly insists you you need therapy? You act like the only problem is her, you don't even acknowledge her struggles.", "So they have their big family and Norah can only look? I presume she was parenting his kids and they still think of her as \"father's wife\".\n\nShe is out of her line in few things ( late wife parents gifting decorations, taking down pictures with her ) but it can be a sign of deeper resentment she holds for this dead woman - she is doing her best and still not worth love from this big family she can only look at.\n\nYTA", "ESH.\n\n\nYour sister's expecting to take down pictures, being called their mom etc is outrageous. \n\n\nBut i don't think she wants to be treated the same. She wants her child to be treated equally. Given they are \"a big family\" they cannot have it both ways.", "NTA - Expecting the late wife’s parents to view your sisters baby like their own grandchild is weird, but in all fairness no one in that family seems to have normal expectations or boundaries of blended families. Apparently they are all supposed to be “one big happy family” and do all the “happy family” things, but not make room for a new wife and child? How did the IL’s *think* the widowers life would look like? \n\nYour sister *does* live in the shadow of a deceased spouse - a fact she is reminded of constantly - and everyone is making it clear that she’s either simply *NOT* part of the “big, happy family” or gaslighting her that she is and yet not treating her that way.", "YTA. I think your sister's feelings are valid. It can be tough dealing with constant reminders of a partner's late spouse. Maybe some therapy could help her cope, but implying she's \"wrong\" for feeling this way isn't the most empathetic approach.", "I feel like what you said was a little insensitive, borderline gaslighty, first of all.\n\nThere is a reason why people shy away from widows/ers. It's a very tough situation to be in. From what I've read about it, it seems common to feel \"2nd best\" to the deceased spouse. \n\nI think therapy is a good suggestion however I don't agree with your reason why.  I feel strongly you owe your sister an apology for that as well, or prepare for possible irreparable damage to your relationship.", "I can get wanting them, if they are going to be that involved, to treat people a certain way, like not emphasizing the technicalities like step or half. Like it seems reasonable that if they want to stay that involved they they make an effort to incorporate the new parts of the family in ways that don't drive a wedge further into the inherent rifts.\n\nBut expecting them to pay for the nursery is another thing altogether.\n\nI think\nYou are correct that your sister needs some healthy perspective work.\nBut her in laws really could use some work as well (assuming they're not)\n\nNTA", "NTA. I don’t know if therapy is enough.", "Nta", "NTA those poor kids of his and actually her new baby too. This marriage wont end well until she gets it in her head she is not those two kids mothers - they had a mother, death doesnt stop her being their mother. They just need her to be a person they can speak to and who makes their dad happy - nothing more. She can play mommy to her new baby. And those poor IL's = she wants them to be happy and celebrate the life their daughter is not living? And then she wants to threaten their access?  At this rate she will end up divorced and deserves to be.", "NTA. Your sister is nuts.", " Your sister is stupid. She needs more than counseling. Her marriage will fail soon. Ignore her.", "NTA, she really needs someone to show her what's happening.  \nThis isn't an ex-wife. She DIED. And the photos at her husband's inlaws? Those are of their DAUGHTER, their SISTER, their FAMILY.\nIf the wife hadn't died, it's likely Aiden would still be married, and these kids would have their mother. These kids are the children of a family member who is no longer here and your sister cannot fill that void.  If she can't accept it, she'll end up hurting everyone around her, including her new baby. \n\nIt really sounds like your sister didn't understand the pain she's entering and is having a hard time dealing with it so she's fixating on how to make it better for herself. I don't blame her for having blind spots, but therapy is the next step.", "NTA, your sister needs some serious help and I hope she gets it before the mental illness destroys her family.", "NTA, and wow, just wow.\n\nI mean she expected the deceased wife's parents to gift her a nursery?  Like wut.  Not her own parents, not her husband's parents, but the parents of the deceased wife.  Wow.  \n\nI mean, clearly she needs therapy, cause something is not right in her processing of the situation.", "She's certainly not even considering the very fact that a life was lost. \n\nThey aren't punishing her , they are keeping photos up for the kids. They are thinking of the children. \n\nShe seems very self involved to the point she's not seeing the irony in her thinking and expectations. \n\nHas she always been like that?", "NTA \n\nYour sister needs therapy", "NTA but definitely TA for not warning this guy before he married her, your sister is unhinged and jealous about someone who's dead. She will never replace his late wife ever, and she's not meant to. But it doesn't sound like she will ever accept that.", "She expected the deceased wife’s parents to pay for his new wife’s child? She’s crazy.", "NTA. Your sisters expectations aren't just unrealistic, they're ridicolous.", "NTA\n\nYour sister is wrong. Aidan made it very clear that they're all a family. That did NOT mean that his late wifes parents would start treating Norah like their daughter. It's probably very hard for them to see Aidan remarried and having other children when their daughter died tragically. Sounds like they're not being mean or spiteful at all just not as close because SHE IS NOT THEIR DAUGHTER. Your sister needs serious professional help.", "NTA, your sister is delusional", "NTA.\n\nThis is illogical and unreasonable.\nShe needs to understand that her step kids will call her mom if they feel like.\nBy your narration their mom was a great woman who was loved by all and it's wrong and insensitive to ask her step kids to call her MOM\n\nAlso the last bit, I was stunned too. She can't expect her husband's ILS to pay for her child's nursery.\nAnd her ILs have accepted her well enough what more does she want.", "She clearly is very shocked to find she’s not the main character in everyone else’s life. \n\nWhen confronted with this painful reality, there’s only two choices: adjust expectations as OP suggests, or blame everyone else for refusing to treat you like the main character you obviously are.  Unfortunately, 90%+ choose blaming everyone else.", "This sub is filled with stepparents who just … shouldn’t be.", "So she wants these people try to replace their dead daughter with her? She’d have a leg to stand on if his parents did more for the other grandchildren than with her baby, but expecting anything from husband’s former in-laws is just bizarre. NTA.", "NTA - if you stay \"on her side\" it will be all the way to divorce court.  Your recommendations were appropriate.", "So they're all one big family except for when she wants it", "NTA, everything you said is correct. Not to mention that the sister cannot expect them to pay for the nursery, especially considering the fact that their daughter passed away and Norah's child is not related to them. Taking pictures down is also a huge no because they cannot forget someone so important to them. Just asking them to take it down is rude. The kids are not wrong either. Technically they are not fully related hence the step and half in front of the titles. Wanting to replace their mother completely is wrong.", "NTA - Your sister is insane and entitled. The only reason she married her husband and had a baby is that his first wife died. Does she really expect his IL to treat her as a daughter? Or her kid as a grandkid?", "NTA. There is something seriously wrong with your sister feelings. You can't force any one to love you more or accept you better. She needs to grown up.", "OP, I think you are absolutely right.\n\nYour sister does have unrealistic expectations. Her beliefs about late wife's family is rather gross, TBH. They lost their daughter, they aren't going to be all happy happy joy joy over whoever comes afterwards.\n\nSister DOES need therapy. It's a tough role to step into and it sounds like she's tone deaf and getting it all wrong.", "You read that correctly. My sister expected her husband's late wife's parents to pay for a nursery the way they did for their own grandchildren their daughter had with Aidan.\n\nShe expected them to do everything for her daughter that they did for their own grandchildren.", "Seriously had to read this a few times to make sure I wasn’t confounding the late wife’s in-laws with the fathers parents. Like if I lost my daughter, and then the new wife of her widowed husband asked me to decorate their new baby’s room I think I’d go on a rampage.", "If they don't need to embrace her, than why does she have to embrace them? She is forced to accept them as a big family, so if they cannot do the same for her, why is she the only one forced to do things she does not feel like doing?", "Right? Uhm, she should be asking that from your own parents, not from his in laws who are not really related to her or her child. Or maybe she should ask that from his parents (her in laws). Your sister is so weird. You're certainly NTA.", "Yes, she expected them to pay for a nursery like they did for their grandchildren.", "Do they expect her to do anything for children that aren't even her children?\n\nAre they family or not? Pick a lane.", "Aidan keeps pictures of his late wife in the home. Some were moved to the kids' bedrooms to make room for my sister's photos. But some still exist in the living room, etc. My sister hates it.", "Happy cake day!", "She does expect that though. She believes they should be doing everything for her daughter they did for their grandchildren and believes her daughter should be just another grandchild.", "I don't know. At the time I remember thinking my sister was not going to be okay with that. But she decided she was going to keep her relationship with Aidan and married him. Maybe she thought once they were married Aidan would want things to change. Or maybe she thought her ILs would love her so much the late wife's family would be kicked to the curb. Her expectations are so unrealistic that I can't say. I feel like a therapist before she got married could have helped her a lot.", "Because the same is expected from her. She is expected to accept the ex in laws into her life, play the big family with them, but when it comes to her, what does she get out of this? The same way goes for her. She is not related to her husband's ex in laws, she does not know them for long, but she was told that the in laws are part of the family and she needs to accept it. So why not expect family members (that are imposed on you) to also have to accept you? Or is family going only one way?", "This is the best answer.", "His ILs weren't at the baby shower. General parties and birthdays they do together for the most part. But the baby shower didn't have her husband's ILs.", "I felt bad for the sister throughout the whole thing (except until the end, but again, I can understand what might have led her to think that). I don't think she feels like a part of that big family, and it's probably really hard for her.", "Exactly!! How cruel to “other” a small child at every family gathering.", "i can’t really think of a more sensitive approach?", ">Husband's ex in laws (late wife's parents) are not related to her at all, however she had to accept them and treat them like a \"big family\". However, it is unfair for her to not receive the same consideration back\n\n\n\nYes because there are children involved. \n\nAnd those children have a dead mother. No one is asking the sister to accept the late children's parents as anything but family because of their children. \n\nThat is common sense. \n\nNow, for her to expect that the parents who lost their daughter so she can be in that family, accept her as a (replacement) child for their late one, not even YOU will have the stomach for that. \n\nIf Op is expecting that her children be treated by their parents as the older ones are, everyone will be on her side. If she is arguing that her own family treat her stepchildren as theirs but do not get the same from her in-laws, that will be fair. \n\nGetting offended that her and her child are not treated same by the grandparents of her children's late parents??? Nope. She needs therapy for her feelings- which are also valid. Her feelings are valid.", "_Phew_. I was afraid I would only see one take. \n\nAre they a big family or not? Why is it being referred to as _her_ child? Its Aidan's child and they apparently see him as a son? \n\nWhats gonna happen with this new kid? Are OPs parents meant to get stuff for the step kids? \n\nIts very messy.", "What do you mean she can only look? She has grown closer to her ILs over the years. But it's unrealistic to think she will be a daughter/sister to the late wife's family or that the kids have to call her mom. If they wanted to that would be one thing. But they acknowledge her as their stepmom. It's not like she's nothing.", "She does though. She had complaints before she ever had her daughter about the way things are.", "I think it's understandable to feel a little weird at first and to have to figure out where you fit, etc, when a late spouse is loved and remembered. But I do think it's wrong to expect the people who loved the late spouse to remove years of memories from sight for you. I can understand maybe wishing that would happen but at some point acceptance has to come too or a decision that maybe it's not for you.\n\nI do understand I might not have been the most empathetic. Just after all this time and my sister refusing to seek professional help, I feel like she will just be stuck complaining for the rest of her life about this.", "I mean she was told flat out what the scenario was and how it would be and that it would never change. Expecting someone to take down pictures of thier dead child so you can be comfortable is disgusting. Yeah, it can be tough to deal with, but don't sign up for marriage to someone if you know full well going  in that it's going to be the case.", "yeah, it seems like OP isn't taking into account his sister's feelings. It is natural for a mother to worry about her daughter to be left out. It's true she can't force the inlaws to like her but she seems very stressed but all this and probably need more than to just be told \"go see a therapist\".", ">I feel like what you said was a little insensitive, borderline gaslighty, first of all.\n\n\n\n\n🤣🤣🤣🤣\n\nI am laughing so hard at your whole comment cos you do not know the words you threw out but thanks for the laugh.", "Telling a loved one with toxic thinking that they would benefit from therapy and trying to help ground them is “being on their side”. NTA.", "I did not catch that properly the first read through. Jeez NTA and you are right, Norah does need some professional support to guide her here. Like honestly the late wife is dead, she couldn't be any further removed from the situation but it's Norah that is keeping her influence alive by her insecurities\n\nIn  Norah's defence, the husband needs to address is the othering of Norah's child with the siblings. It's really unnecessary for them to be pointing out the half sibling part", "I’m so glad you told her. How much is she faking or withholding from Aidan about her absolutely bananas demands and entitled behaviour off Aidan’s late wife’s parents?\n\nMy god no wonder they don’t ‘embrace her’ much. Your sister needs massive lot of therapy and she’s in for also losing her in laws bc they’re close to the late wife’s parents who won’t stand for your sisters behaviour.", "Your sister is stunning, and not in a good way. Telling her unpleasant truths is important, and a good way to actually be on her side. \n\n You’re right, she’s wrong.", "Ouch. I’m cringing with second hand embarrassment. You made a good call regarding therapy. I hope your sister gets the support she needs. NTA", "Your sister is definitely unrealistic, her husband’s late wife’s family are not her family. These people are grandparents, aunts, uncles, cousins of the children not Norahs baby. Aidans family have embraced her, which is expected. The lates wife’s family have no connection to Norah or her baby. \n\nNorah needs to wake up to reality before her expectations negatively impact her life.", "Her child has two parents and two sets of grandparents. She has zero right to expect anything from her husband's late wife's parents... that's just insane. These people lost their daughter.  The kids lost their mother. A lot of grief and trauma ensued prior to her entering the picture and she's too fat up her own arse to realise her expectations are insane. She's not giving these people *permission* to be involved - they are the grandparents and the only familial link from the kids' late mothers side. I can't relate to the narcissism involved in thinking they're displaying photos of this woman - a person who was loved and died prematurely, leaving behind a young family, just to spite her personally. Gross.\n\nShe's heading down the path of becoming very unlikeable so your suggestions of therapy was wide. NTA", "I mean, this is going to be an unpopular opinion, but I see her point. Not about paying per se, but the fact that if they’re all one big family, when Aidan’s most recent child be included in that, and, more importantly, if not, how is that child going to feel\n\nEditing to add but I think this is a classic ESH, in terms of how it was dealt with, but I understand the perspectives of all parties and I have great sympathy for them all.", "Is it possible your sister is doing malicious compliance? \"You told me you and your late wife's family are one big happy family. Don't big happy families treat all grandkids the same? Where's the decorations for the latest grandkid?\"\n\nWhile your sister is being unreasonable, this situation isn't entirely her fault. It sounds like her husband has refused to accept this isn't one big happy family. I doubt his former in-laws are happy about including his new wife and now their child in all family get togethers. Your sister is probably correct when she says his late wife's family haven't fully embraced her. \n\nYour sister does need therapy, or someone to nudge her that a reasonable request would be to tell her husband that she doesn't feel it's necessary to constantly bring her child around his late wife's family. And going forwards accept from big events, when he's taking his older kids to spend time with their mums family, she'll be taking her kid to spend time with her family.", "[removed]", "The expectations on her husbands former in-laws and his kids are very strange. I am impressed the marriage has lasted this long.", "The nursery is more for the mother/parents anyway, the baby doesn't care... So she expected them to pay for a nursery for HER like they did for their daughter.", "Sis is smoking some good shit", "My uncle died before I was born when my mother was a teenager, more than sixty years ago, so I have perspective from the other side. My cousins were very young, so they don’t have vivid memories of their father and accepted my aunt’s new husband as their own. When my uncle (I always knew him as my uncle) died, we mourned his passing. He was a member of our family. \n\nBut it always saddened my grandparents and my mother because it seemed all traces of my natural uncle were erased. He was a remarkable man, but their mother didn’t talk about him because it upset her husband. \n\nI believe the living and the dead can coexist peacefully. Your BIL’s former wife is no threat to your sister. Her stepchildren need her, but she has to stop thinking step is an ugly word. To many people it means love. How would your sister feel if she were to die and someone else wanted to take her place?\n\nSo I think a therapist can help her sort out her feelings and put things into positive. You are right on target.", "I have to wonder why she married a widower when she clearly can’t stand being in a relationship with a widower.", "Yeah but she is still the mother of his kids, her kids shouldn’t be ashamed or have to forget about their mother just because she died. I get it’s hard for your sister but she knew he was a widowed and had two kids who lost their mother and still married him…", "That is really sad. Your sister is threatened by a dead woman. You are right, she needs to go to therapy and deal with her shit like an adult.", "Right, and this is the kind of attitude that makes her the A H and not you. This 'I know they say that this is how it's going to be for good, but I can change it all once we're married' attitude is just nonsense and unrealistic and unfair to her partner and everyone involved. She really does need to learn to put herself in other people's shoes and think hey, they lost someone who was a big part of their lives, why would they just forget about her because someone new comes along.", "I offered an example of a more sensitive approach - instead of saying “you need therapy”, you reframe it as you understand the person is dealing with a lot and it might be helpful to have a dedicated listener to talk it out with and provide them with strategies to manage these situations.\n\nEdit: I’m only saying there’s a more sensitive way to say “go to therapy”, because the sister is taking it as a personal attack and doesn’t recognize OP is trying to help.", "With all due respect, this comment and way of thinking just shows how much double standards our society has. I know couples in this situation and what I see with them is normal. These couple are working out because of boundaries, clear and realistic expectations and communication. \n\nNo one should cut the kids' contact with their maternal grandparents, but those grandparents are only related to the children, not to the step parent. Of course you invite both sets of grandparents to the kids' birthdays, of course the step parent should have a decent relationship with them. But as a partner to ask and demand your new spouse to see his kids' maternal grandparents like her own family and go out of her way to accomodate them into her life, but at the same time expect her to be ok with not receiving the same effort from them is just selfish. \n\nIf her and her kid are (understandably) not treated the same by the late wife's parents, than she should also be allowed to keep the effort with them at a minimum or at the level she feels comfortable with. When you insist on uniting people and acting like a big, big family, either ask all members involved to put in the same effort and treat everybody the same, or just give up and stop forcing relationships.", "People are soooooo hypocrite. The step parent MUST accept and embrace everything: step kids, in laws, late wife's presence, pictures, parents, everything, otherwise she is either a monster or she is stupid because she \"knew what she was getting into\". But the same courtesy does not apply to the new wife, no sir. The same people she MUST accept have the right to not accept her, treat her however they want, and discriminate her and her children.", "I think your sister had expectations, but they were not entierly unrealistic. \n\ncmonter is right. Your sister is just looking at this big family who loves and supports each other. She's not a part of it and it must sucks to feel like you're always going to be 2nd best. \n\nShould her stepkids call her mum ? No, of course not. But there's more to it. If they always have family gathering, it must be really hard to be invited but not considered or be treated like family. \n\nI think that this is more of a getting married to soon and lack of communication issue rather than just issues your sister may have.", "Well, people like when they are called names they work for and for her work she is only \"step-mother\"  \nI can see how she hopes about being called a mom and her hopes are crushed by ungrateful kids.\n\nI believe in every shitty situation there are some anchors taking everything down and things caught by these anchors. She is doing mothers job and is hurt kids see her only as step-mother. Everything else is list of complaints.\n\nAnd you are against her, what a shitty sibling you are", "Sorry, what i was planning on saying was she was TA for expecting to be treated the same, but not so much for her child. Ofc the same wouldn't be possible, but to some degree, given how close his husband is with late wife's family.", "THEY ARE NOT HER INLAWS ???? what are y’all not understanding ? These are the parents of the husbands late wife. SHE IS WEIRD AS HELL FOR EXPECTING ANYTHING FROM THEM.", "How else would *you* describe telling your sister that her \"feeling 'second best' to her husband's deceased spouse is crazy and she needs to seek therapy for her crazy thoughts\"?\n\nWhen countless books have been written about how this is a completely normal and pretty common feeling to those who have dated/married widow/ers.", "This. Sometimes telling people they're wrong *is* being on their side and supporting them. Supporting people doesn't mean enabling delusions or telling them that of course they should be allowed to get away with murder; it means helping them be the best person they can be.", "Yes! I – the youngest in my family – was the first one to be in therapy and I have deeply benefited from it. In the last couple of years I’ve been recommending it to my mom and brother, and they used to feel like I was attacking their character by suggesting therapy. Nope, I was just trying to tell them there’s a healthy and effective way to work on their issues and wouldn’t recommend it if I hadn’t tried it myself. My brother has since then started therapy and our relationship (along with other areas of his life) has improved.", "I bet they do it to spite Norah, since she’s apparently been pushing for them to call her mom. This is probably the teens’ way of establishing a very justifiable boundary.", "You’re right, in principle. And if Aidan‘s in-laws start excluding the kid from family events, then Norah might actually have a leg to stand on. But paying for the nursery is not it.", "Being included is one thing and there’s no indication of the child being excluded; expecting your husband’s late wife’s parents to pay for your child’s nursery, expecting your stepchildren to call you their mother and their half-sister sister (despite them not wanting to) is a whole other thing.", "She expected the dead wife’s family to gift her, NOT her in laws. Are you kidding me. They don’t owe her that, they already lost a child of their child.  She wasn’t expecting the baby gifts from her husband’s parents.", "I don't think there has been any evidence yet that the new child is going to be made to feel less-than.", "Came here to say this. I agree with others that paying for it is a high expectation, but you don’t get to be “one big happy family” minus sister and sisters baby. OP isn’t TA and sister does need therapy, but I also think she does not feel part of the family and that’s the main problem.", "Yeah the dynamic seems a bit unhealthy and I don't blame her for for feeling a type of way. Especially with another kid in the mix. She does need therapy though to sort through these feelings. She's not handling it well if she thinks they should pay for her child.", "This is the piece that raises a red flag for me. So she was told they are one big happy family and she better not do anything to change that but they’re treating her and potentially her daughter like an outsider? A bit hypocritical and I could see why she’s not happy.", "I think she doesn't say a lot of this, or maybe any of this, out loud to Aidan.", "I guess it's one of those in theory versus reality situations.  You think you can handle it until you are on the thick of it.", "It could be that she incorrectly assumed that her relationship with him would override his relationship with his late wife, and expected that “the dynamic between families will never change” was more of a challenge than a fact. \n\nThere have also been posts about people in relationships with widows/widowers who view the late spouses as their direct competition, or even people who resent their partners having had previous relationships, and the only way to “win” is for their partner to entirely forget past partners for the sake of their egos. \n\nSister may or may not feel this way, but I could see her using this situation to put a divide in those relationships without attacking his late wife.", "Yeah, it’s another version of the terrible mindset that having a child can miraculously fix a relationship.", "ah, i am not sure how I missed that the first time reading it but i agree!", "She is part of it. Just not as entirely as she wants to be. I do think it's unrealistic to think your spouses in-laws will treat you the same as their child/sibling who died. You can be welcome and included but for them it would not be the same. Her actual ILs, Aidan's parents, do treat her like family.", "Those kids aren't ungrateful. She isn't their mother and all forcing it will do is guarantee they will never ever forgive her. They don't owe her shit. She was the one who chose to step up and care for them, they didn't ask for that, they already had a mother even if she died. She's their step mother until they decide otherwise and any attempt to force it will cause trauma.", "I frequently have to tell my toddler he is wrong, examples are you shouldn’t jump of something 1.5m high, you shouldn’t run onto the road etc. I love the shit out of him but sometimes (often) he has wrong beliefs and if I don’t correct them he will get hurt. \n\nI really don’t see a significant difference with OPs sister. Her behaviour is likely to end in divorce or at best a unhappy marriage. Op is trying to prevent that by telling her she is wrong.", "?? I mean Aidan's in-laws are entitled to have a relationship and take their grand children out without having to take a half sister.  I dont think she has a leg to stand on if they exclude the half sister from grandchildren only activities.  \nI mean, FFS, the only reason they have any knowledge of who Norah is is because their daughter is dead, I dont see anything wrong with not wanting to extend open arms to someone who triggers painful memories.  Cordial, yes, but inviting her child to things I want to do with my grandchildren, no.", "If? Did you miss where OP said \"their own grandchildren\"? Meaning that the kid is not their grandchild?", "For sure. I mean, this is an ESH situation in my opinion. Editing to add but at the same time everybody’s actions are understandable, and I have sympathy for all parties.", "I mean, let's imagine sister husband hás siblings. Do the in-laws treat their grandchildren cousins the exact same way as they treat their own grandchildren? If the answer is no, It can be easier to navigate the diferences.", "Ehh no evidence and even then, the in laws are grieving parents who would be seeing how they’ve lost their daughter and her daughter being here to see her kids as teens/pre teens. As long as they’re cordial they don’t owe OPs sister everything the exact same. It’s cherry on top but not expected.", "She's probably not saying it with words, but I bet her actions and attitude aren't going unnoticed. \n\nI can't swear this is the truth, but I've noticed that when kids come from a home where they feel a new parent figure is pushing for them to forget about their bio parents, that seems to be when they call the new kids their half sibling. Meanwhile kids who are allowed to feel comfortable with the new additions and not have them pushed on them, recognize that they're half siblings but they generally don't call them that unless they're describing the family dynamics", "I was wondering how Aiden was feeling about this. But it sounds like he might be ignorant to his wifes issues?", "Truly strange behaviour.", "Curious. Was your sister desperate for a kid before she met your BIL? Because I get the impression she’s pretended to like the photos of the wife, etc to snare him. Then now they’ve got their own kid together her demanding entitled side is coming out and she’s wanting to erase the late wife and forget she existed bc she’s now there.", "Then his in laws should not be at every gathering with his parents!", "For few years she is there for them and she wants to  be called a mother, as she is propably doing job of their mother.\n\nCheck your privilege, \"they haven't asked\". How do you imagine 9 and 8 years old kid asking a female to be their mother? It would be really shitty situation. They are privileged and don't see how much. \n\nBut that's not about them. It's about her. She did everything in the book and hasn't get the result she hoped for. There is enough stories about shitty step-parents that in this case maybe you could see from position of good one.", "I didn’t say they needed to invite the new kid out to things they do with their actual grandkids. I said if they start excluding her from family events, then it’s a problem. \n\nOP makes a point in mentioning both Aidan‘s family and his in-laws do holidays etc. together. And that’s a place where Aidan’s new kid - and new wife, for that matter - absolutely belong.", "Did you miss where OP said the in-laws spend holidays with Aidan’s family? Meaning, occasions where Aidan’s new family also belongs?", "A cousin isn’t nuclear family.", "It was positioned to the sister that they’re one big happy family, so yes, they owe OPs sister the exact same.", "As far as I know she has never said a word about any of this to him.", "They are his family too and should be there if he and his kids want them there.", "They're very close and want to be together for stuff like that. My sister can't stop that.", "No, OP's sister is their step mother. The kids accept her as that.That is not acting like ungrateful brats. OP's sister was told the score when she married, she accepted how things were, it's not their fault that she expected to replace their mother", "you don't get to demand to be called mother - it's not clear from the post, but it seems like the kids were around 9 when their mother died. They remember who their mother was, and don't want to replace her. It doesn't seem like they disresect OP's sister or otherwise play up, they just simply don't see OP's sister as their mother (they might see her as a mother figure or like a close aunt), and that shouldn't be a problem.", "You don't know anything about OP sister's parenting or whether she's a good step parent. Because that's what she is.", "She's clearly not a good step parent though. Good step parents actually seek professional help when these issues come up, and if she did you'd quickly find every child physiologist would say you can not force a child to accept you as a parent after their biological parent has died. Trying to force them to creates more trauma and actually just means they'll cut her off the second their adults. \n\nAlso a good parent never makes it about them. It's always about the child. If the parent is making it about them their a;ready failing horribly. So your actually just arguing here she's a horribly selfish person.", "The post say they are toghether as a big family, that means aunt and unless too! Grandparents aren't nuclear family either!", "She’s being unreasonable and she can’t assume they’ll instantly like her enough to do that. She has her own in laws and parents to do that. She’s being entitled to expect them to pay. Hell she can pay for decorating her kids room.", "Then they should treat the new baby the same as the older kids.", "That’s totally fine. Then they should treat the new baby the same. How cruel.", "A. It’s been over 5 years \nB. I agree, they shouldn’t pay for the nursery. But they also (once the daughter is born) shouldn’t treat her any differently than the other kids or they’re hypocrites.", "Forget the rest of the story, expecting a 14 and 13 year old to call their step-mother \"Mom\" after their real mom died, is insane. Therapy indeed.", "NAH I kind of see her point. She is trying to point out the double standards here. She is expected to accept them as one big happy family and all the accommodating is supposed to come from her side whereas they are not held to the same expectations. It's not really about the room. It's too much for her to try to force the kids to call her \"mom\" though.", "Mm. It's clear your sister is being unreasonable about this situation she's in, and yes she could benefit from therapy; it's probably at the point that she needs it. But you've commented saying your sister's husband has no idea she's feeling this way. I don't see anywhere that you've ever encouraged her to TELL her husband how she feels. So much of this could have been gently managed in the past 5 years had she just talked to her husband about how she feels. That would have headed this off before it got to this point where she silently suffers, unreasonably expecting her parents-in-law to decorate her baby's nursery.\n\nThat said, I do think after 5 years of bottling her feelings, it's likely her healthy emotional toolbox is completely rusted shut and will need therapy. But she needs to at least try, and IMO that should have been your first suggestion.\n\nNAH because she hasn't actually done anything to lash out at her ILs or husband or you (her saying that you're wrong and should support her as a sister isn't a declaration that you're a jerk, it's a neutral statement of disagreement, so I'm not sure why you're on AITA tbh), but I think she needs a reminder that before therapy, people need to start by just trying to \\*talk\\* about their feelings with the loved ones involved, and not just during vent sessions. That may be impossible now though, and that's what therapy may help her with, but she needs to start by realizing for herself that she's trapped in this loop.", "NTA. Your sister *is* wrong, and suggesting help instead of festering resentment *is* being on her side. This isn't just an ex, this is the deceased mother of Aiden's first children. They need to see beautiful reminders of their mother at other family homes. It is healthy and important for them not to be alienated from their maternal grandparents!\n\nSister 100% needs a personal therapist *and* a marriage counselor. Her expectations of the other in-laws is incredibly inappropriate. But it's also understandable for her to feel left out. And her husband should be working to include her if he wants them all to truly be \"one big family.\" But that family has endured a terrible tragedy. Your sister needs help dealing with her jealousy, because it is unreasonable to expect Aiden's in-laws to treat her like their own tragically deceased daughter. \n\nIf she can learn to embrace the family she intentionally married into, she might find more acceptance from her step-children and their grandparents.", "I think your sister has a bit of a point, though she is being extreme in her exact tit for tat expectations.\n\nIf the late wife's parents are integrated as part of the core family this strongly then you can't have them treating the new child less than they do the others. It will just lead to the new child feeling excluded and inadequate. If Aiden is truly part of that family, then his new daughter needs to be treated as a full grandchild of the family as well.", "She’s got unrealistic expectations. It almost sounds like she wants everyone to forget the other woman existed and wants to replace her completely. That’s just not going to happen. They have every right to love her memory, also while embracing and supporting the new relationship. That doesn’t mean they have to pay for the nursery decorations for the new baby. You were right to suggest therapy because her head isn’t straight. She’s jealous of a woman who passed away. NTA", "NTA to op obviously, but what I’m gonna say is going to be an unpopular opinion I think. So, of course his late wife’s parents aren’t obligated in any way to pay for her nursery or anything like this. This is an unreasonable expectation. Therapy would be great for her to deal with some of her frustration because it’s not an easy situation to be in regardless of the circumstances surrounding it.\n\nWith all of that said, I don’t think she’s completely wrong when it comes to how she’s feeling. She was told from the get go that this is one big happy family, that she needs to accept it, that everyone has the same importance, so to suck it up her discomfort about the whole thing, but then she also needs to accept that she and her daughter are not part of this big happy family and they aren’t considered the same as the rest and they don’t hold the same importance? Which one is it? Her husband can’t have it both ways. \n\nSo I think he needs to accept that *he* might consider his late wife’s parents as family, but your sister is not obligated to in any way whatsoever. She should respect them in terms of the importance they hold for her husband and his kids, and because they are her husband and her stepchildren family, but they *are not her family*, and if that distinction is understood in terms of the late wife’s parents not treating her as such (as it should), it also should be understood that your sister will not consider them like that either. They aren’t her husband’s parents or blood relatives, and she doesn’t need to treat them the same way she treats her in laws for example. They aren’t, afterall, “a big happy family”, and that’s totally fine, as long as it is valid for both sides.", "YTA a little bit even if you are mostly right.\n         \nYour sister has been asked to have her husband's late wife in her life to an extent that is above and beyond. If it were not above and beyond, she would not even KNOW that his other ILs had gifted his children nursery decorations.\n\n          \nGiven how much of time your sister has had to invest in them, I can see why she had the expectation. I honestly think her mistake was marrying her husband, and that is now compounded by them having a child.\n         \nHer husband has not moved on, and she is now stuck in amber with him. It seems very, very sad.", "I think you need to listen with your third ear. \n\nWhat your sister really wants is the support of family. She has a newborn. Wanting support from family is not a toxic or crazy thing to desire. It is a natural, survival instinct.\n\nAnd to be surrounded by a big, loving, supportive family, but not be within that big loving supportive family, must feel really, really painful. And will screw with your head if you don’t have your own big, loving, supportive family to counterbalance that.\n\nYou’re right, she does need therapy.  \n\nWhen your sister told you she expected them to fill the nursery, she was really saying she wished her own family would do it. She was essentially reaching out to you bc she wanted support and help, but she did it in a very indirect, screwed up way, and you responded by telling her to get help elsewhere. I suspect there is a family history of not being able to ask for needs to be met. And her asking the kids to call her mom is misguided, but again, I think she is desperate to feel a part of a family, and right now she honestly probably just feels like a concubine.\n\nYour sister needs therapy, but she also clearly needs the support of her extended family (including you) to surround her and her newborn. Why didn’t you and your parents set up the nursery? I think that your sister was really hoping that you and your parents would step in and support and love her growing family, just like her husband’s widow’s family did for him and his late wife.\n\nWhile it is necessary that she seek therapy to deal with these emotions, it is just as important that you and your family surround, support, and envelop that baby with the kind of love that your sister sees the other family giving.", "So.. your sister is jealous of a ghost, and expects everybody to embrace and replace that ghost.. with her..? NTA. Your sister sounds like she does need therapy, because this does not sound sustainable in the long run, for either her, her child, stepchildren nor her husband. \n\nI hope your sister does take up therapy, and either finds peace in coexisting with the memory of her husbands late wife, or realises she can’t compete with someone who is no longer here 🌸", "I'm always horrified when I see people jealous of dead people. Nta therapy could help", "NTA... and a missed opportunity.  The best way to have gotten through this would have been to get to know who the first wife was and celebrate her life along with the family. There is zero need to compete with her. \nHad she done this, it would be more likely that she would be part of the history and family.  Her unrealistic expectations prevent the very thing she wants", "I really hope that your sister listens to you. She will only harm her relationships with everyone with this attitude. Why does she think her husband's late wife's *parents* should treat her the same? That is their late daughter, their child. \n\nHer stepchildren's feelings are also something she needs to accept. It has nothing to do with how their grandparents see her. It has everything to do with how the kids feel. \n\nI really hope she wakes up because this is delusional.\n\nNTA", "NTA, she married into this situation (which seems like a poor idea). Of course she’s wrong about the nursery, the larger question is how holidays, parties, etc are going to be handled.", "Definitely NTA. His in-laws from his 1st marriage do not have to nor will they ever embrace your sister or her child as their own because they aren't. Expecting them to do so is definitely Norah's issue to deal with. As for Norah's kids they have a mom and she's dead. They have no interest in replacing her. Your sister does need therapy because she needs to understand her place in her stepchildren lives.", "NTA. She does need some professional outside perspective to accept the boundaries her husband and his family have.\n\n\nBUT I think the new baby is going to open up some real dialogue between her and her husband. It sounds like they both want to have a big happy family, but have different ideas of what that looks like because Aiden already has a big happy family. Here's hoping the therapist can help open the lines of communication.", "Therapy would absolutely help with her insecurities here.  She needs to stop feeling threatened by a dead woman.  Of course their dearly departed daughter/wife/mom/etc. wasn’t erased from their homes like a dead pharaoh having their names chipped from obelisks by jealous successors.  If Aidan married & had a child with her, she needs to trust that she’s loved fully here, even if it’s not the exact way she would prefer (especially since expectations sound like they were laid out well in advance).  I can understand her disappointment if she feels like an outsider, but unless there’s actual exclusionary slights from them (and not just the nursery thing - that’s weird) she needs to chill.\n\nNTA.", "NTA, but I kind of feel bad for her because that is such a bizarre situation to be in, and I can see how confusing and conflicting it would be from her perspective. Mainly because she’s being told that it’s basically one big combined family now, but to her that is very untrue.\n\nNow expecting a nursery be paid for from people who aren’t related is strange and honestly comes across as a manic attempt to force what she wants.\n\nI think someone needs to sit her down and blatantly explain how things actually are so she can have normal expectations, and not explain it in a way that confuses her. (“It is all one big family now, *buuuut*…”)", "ESH. There are some parts that you are right, Norah isn’t being realistic but there are some parts she’s right that the ILs also need some nudging over their lack of sensitivity. \n\nFirst of all, you are right that Norah went in with her eyes open. She shouldn’t be seeking to replace Aidan’s dead wife in the eyes of the wife’s children and also the dead wife’s family. \n\nHowever, she’s also right in that the dead wife’s family is being unnecessarily discriminatory, in the sense that since Aidan had grown up with them and they treat him like a son, then any children he has regardless of whether the child is related to them by blood or not should be treated on the merit of the strength of their ties with him, and not because the child isn’t their daughter’s. \n\nLet’s be clear that Norah did not break up their dead daughter’s marriage. I’m assuming she only met Aidan after the wife’s death. \n\nIf that’s the case then Norah is right in that the dead wife’s family does seemingly draw lines and isn’t gracious when it comes to the children. \n\nIt’s one thing for the older children not to address Norah as mum, but quite another for them to insist that they MUST address Norah’s child as HALF-sister. \n\nNorah’s child is still their sister, and to go down to such precision that her child be addressed as HALF-sister smacks of hostility and tension. How is that good for any toddler who is innocent of all these adult dynamics?", "She may be having feeling of not being welcomed in her new family, and then all the other things pilled on are exasperating those feelings. Let her know that you love her and that she can talk to an expert about how to work through and communicate her feelings. It’s hard to feel left out of your own family. NAH", "Nta. She needs to grow up and stop trying to compete with a dead woman.", "NTA\n\n&#x200B;\n\nyour sister needs to realise that her daughter is nothing to do with the In-laws and is the half-sister of her step-children, she claims she doesn't like being compared to the husbands late wife but somehow expects to taker her place.\n\nshe definitely needs therapy because those sort of issues can easily turn bad if not resolved.", "Yikes. NTA.\n\nWouldn’t she want her own parents to be involved?", "She needs therapy, she's not their daughter her kid is not their granddaughter why would they do grandparents does she have a relationship with your parents?", "I had to re-read your words in order to make sure you said she expected his deceased wife's parents to pay for HER baby's stuff. That honestly boggles the mind on how that reasoning came about. While it is unfortunate that her step-children refer to the new baby as their half-sibling, her unreasonable expectations honestly need therapy. While she claims that you aren't on her side, you really are doing her a favor by calling her out on her B.S. and recommending therapy to her. She really needs it and I hope her having that outlet instead will improve her mentality.", "\"my sister says I should be on her side, and telling her she needs therapy is saying she's wrong\"\n\nYes, because she is wrong. Insanely wrong.\n\nNTA\n\nYour sister knew what she was signing up for, did it anyway, and is now bitching about unrealistic expectations.\n\nSure Aidens parents may treat your sisters baby as a grandkid, which is is, but why the hell would the widows parents do that?! It's not their grandkid.", "NTA. Period.\n\nFirst off, your sister shouldn't expect the approval of the deceased wife's parents to the degree you stated - f.e., expecting them to gift her the nursery. Yes, one big family between them and Aidan's parents, but still. They don't owe her anything but, you know, basic respect.\n\nI'm also getting weird vibes from your sister being off-put by the pictures and such of the deceased wife. It's a whole different ball of string when a father is single because he is WIDOWED. Her taking things like that as \"a message they were sending to her\" just reads as narcissism to me. I'm NOT diagnosing her obviously, so take that as a grain of salt and be careful with it, but keep that possibility in mind.\n\nIf that's the case, something to remember: narcissists deflect problems (they won't admit they're in the wrong), and for this reason will avoid getting help. Furthermore, they will make you feel bad for pointing these things out. Do NOT feel bad. And for Norah - she can get help. There is hope. You opening the conversation about her needing therapy is a step in the right direction. As long as you're coming from a loving, understanding place, you're showing her an out.\n\nIn Norah's defense, I do feel bad for her - of course it's understandable to feel excluded in this situation - but again, all you're doing is asking her to go to therapy, which I think she would benefit from.\n\nBut something to remember - MAINTAIN YOUR BOUNDARIES. Boundaries are everything. Sending you love, OP.", "NTA\n\nI can never get over how someone can think that they should 100% replace a dead wife/husband like they never existed?? She needs to get her head out of her ass. She's jeleous of a dead person.", "NTA - your sister does need therapy to accept that the late wife's parents are not the grandparents of her child. These poor people lost their daughter,  \n\nI would hope that they would try to treat the kids similarly as the baby grow up -- but there's bound to be a difference.  The older kids will be heading to college, and I wouldn't even expect them to be involved in the new baby's life at all.  This one is weird.", "Your sister's expectation is indeed unreasonable. You can point out that her baby's maternal grandmother is actually going to be her (your) mom - is she in the picture? Can she (or you for that matter) do something for your sister so she would feel cherished and important?\n\nIf it's possible to strengthen the bond between your side of the family, that'd do her good. If her husband's family are the people they socialize with the most, I cannot blame her for feeling secondary. Therapy could help, but also, you (and your family) can help.\n\nAlso , also: what's your relationship with the step-niblings? Will you treat the baby the same way you do them? Does your sister expect you to?", "NTA sister does need therapy. The only appropriate boundary she may have is in reference to removing the half in the sibling part. Maybe. If that is important to her, I think she can set the boundary/preference that they just call each other siblings. The siblings are old enough to not be confused and they can have a preference but if you want grandparents to stop saying “half sibling” for whatever reason, I could make an argument that that may be beneficial to younger sibling in terms of defining family. The technicalities of the family can be explained when older. \n\nBut new baby has two sets of grandparents and as her parents can figure out how they want to relate to her step children, the in laws don’t have to be volunteer grandparents to the new child", "NTA, and well done for not enabling your sister and suggesting she gets some help. Her expectations are absolutely delusional. It sounds like there is a lottttt here that she needs to speak to her partner about too, but if she's 5yrs into a marriage and hasn't been able to talk to him about this at all yet then therapy sounds like it would be hugely helpful.", "Your sister has a long list of problems with (as you mention) her expectations.  Why WOULD her new husbands former IL's pay for their nursery.  Why WOULD they take down photos of their own daughter?  Unrealistic expectations is a huge understatement, delusional is probably more appropriate.  NTAH.", "Holy cow you're NTA. Norah is being bonkers about this. \n\nOF COURSE people still have pics of deceased ex around. My house is covered in pics of my previous pets despite the fact that they're gone now and I have new pets. They were an important part of my life and that doesn't just disappear because they've died. And OF COURSE the older kids are calling her a step-parent instead of Mom because guess what, Norah: you're a step-parent. And OF COURSE the former in-laws are not PAYING FOR NORAH'S BABY'S NURSERY DECORATIONS is she even serious right now. \n\nNorah needs therapy and you are not at all wrong to point this out to her.\n\nAlso as an aside, telling someone that they would/might benefit from therapy is not an insult. It's saying hey, friend, I love you and I see you're having a hard time. You might benefit from talking to a PROFESSIONAL whose whole job is to help people work through their problems. \n\nNorah, if you get wind of this and you read these: you need therapy. NOW. You are gonna screw up your baby and this whole family the way you're going.", "NTA\n\nI do not understand women who marry men with a dead spouse and expect that person to vanish from the timeline. \n\nIf they don’t want a husband with a romantic past, they should date incels. There are plenty to go around.", "NTA.  You're right that your sister really needs to take a hard look at her expectations.  She may want you to agree with her but it would not be helpful to her as it would only feed into her delusions about how her husband's late wife's family should be treating her and what they should be doing for her child, which is obviously already making her unhappy.  Also her thinking that all the ILs are sending her some kind of message by having pictures of the deceased wife around most likely way off.  She needs to understand that though his first wife has passed on people are not just going to forget her.  She was loved, she was part of the family, she is the mother of 2 of their grandchildren.  Keeping pictures of deceased loved ones out is pretty normal.  I'm guessing your sister feels threatened by her husbands previous wife and that it is negatively impacting how she's perceiving things, such as why her step kids don't want to call her mom.   Your sister may be upset now with you for not siding with her, but hopefully you planted a seed that will make her start to think that it's possible her perspective is skewed.  Talking through her feelings with a therapist sound likes it could be very benefical for her.", "NAH you know if they want to be one big happy family why can’t this include their shared children?", "ESH. You not for suggesting your sister needs therapy.  She does.  She needs it to learn how to navigate this situation in a healthy way and to effectively communicate with her husband because if she continues to remain silent she will just grow more resentful and it will blow up in all of their faces.  They also need couples counseling and that should have taken place before they got married because while your sister definitely has some unrealistic and unreasonable expectations, Aiden, his family and his late wife's family do as well.  Your suckage is for suggesting that she gets counseling because you think her feelings are totally invalid and want a therapist to tell her that, not because you want to see her address the issue in a healthy way. \n\nThe reality is that this \"one big happy family\" dynamic only works in a healthy way if everyone in it is actually treated like an equal member of it and it's obvious that this isn't the case.  What the dynamic really is is that \"they\" are a happy family and anyone Aiden chooses to be with is an outsider expected to cater to it because they don't want their dynamic to change and it's not healthy or reasonable. Your sister is not wrong to be upset over the double standard.  She should have peaced out of that nonsense but they are married with a baby now and so the problem needs to be addressed.  It's great that they all love eachother and kept things as normal for the kids as possible after their mother passed but once Aiden decided to remarry and have another child he is now obligated to make sure his wife and child are treated properly and that his immediate family is in a happy and healthy place.  No matter what unrealistic things he said before marriage, he changed the dynamic of their family by getting married and adding another baby and they are just as important as everyone else in that family.  All of the other adults suck for failing to be reasonable and realistic here and they are doing a disservice to all of the children involved. The way the kids talk about their new sister combined with what your sister says makes it clear that this dynamic is creating a separation between your sister and her daughter with the rest of them and that is not a healthy way to blend a family.", "Some of you posting on here are missing the big picture.  The families appear to be getting together on birthdays and major events that pertain to this shared grandchildren.  And it’s understandable that Aiden isn’t willing to change that for his new wife.  The wife is completely ridiculous about his dead wife’s parents buying nursery items.  I would personally have no expectation for them to do anything for me, nor would I expect them to treat my child like their grandchild…period!  The new baby isn’t their responsibility.  She’s also wrong for trying to force her step kids to call her “mom”.  That should be their decision and maybe just maybe, she needs to act more like a mom than a jealous stepmom.  It just seems like she’s jealous of a deceased mom and is trying to compete with her.  She definitely needs therapy, especially since she doesn’t even like pictures of the woman in her house.  She died, they didn’t divorce each other.", "**She mentioned a few times over the five year marriage that she felt like Aidan's ILs (late wife's parents) did not embrace her as much as Aidan's family did and how much it bothered her.**  \\- Why would they embrace her as if she is their own daughter who they lost. \n\n**She brought up a lot that the kids always referred to her as step and shot her down hard when she suggested they could call her mom. -** Again she is not their mom, she is acting like she is the replacement.\n\n **It was two weeks ago when she came over and started complaining that Aidan's ILs had gifted the nursery decorations for their grandchildren and she had held out waiting for them to do the same with her daughter's -** Her daughter is not their grandchild really. and they are correct, her step kids and her daughter are half siblings. They aren't required to treat her daughter the exact same. \n\nNTA - Your sister does need therapy and to realize she is trying to compete with someone who is gone from this world. She wouldn't have her family now without that happening.", "LMAO NTA. It’s like comical how clearly she wants this revisionist history like this woman who LITERALLY EVERYONE cares about never existed 💀💀💀 she’s such a prick tho lmao", "NTA.\nHowever, you should be more gently. And create the IMPRESSION that you are in her side.\nBasically helping her to see things right and trying to understand the issue and why it bothers her etc.\n\nTelling her to go to therapy, although right, can come up as insensitive and dismissing her.", "ESH\n\nIf his late ILs are going to be in their EVERYDAY life, then they should NOT treat those kids any different. It is going to cause major problems down the road. Why should her daughter be constantly left out? this is not a once and a while get together. They are always over there. This is going to be bad for baby girl. She will NOT be as loved as the other children. I honestly hope the blood grandparents do not do the same thing.\n\nI do NOT think they should have paid for her nursery. The mom should be taking care of that. I'm just saying, this is going to be a disaster in the future.", "Clearly she is supposed to be the replacement for the dead wife.  If she is taking on their grandkids, they should take on her.", "YTA.\n\nClearly this is a matter of having sufficient time for everyone to acclimatize to the new family dynamic. 5 short married years is a trickle compared to the >14 years that the late wife (and her family) had to build with each other.\n\nSuggesting therapy was the AH move. She trusted you with her complaints and innermost insecurities, and you have repaid it by trivializing her ordeal into an \"issue\" that a stranger could fix. She is asking you to be her support and therapist!", "NTA- holy crap definitely NTA", "I suggest your sister to divorce him . I mean he couldn't let go , she couldn't accept. Why still be together ?", "NTA.  Norah is totally unrealistic on many fronts -- I totally get that these big family gatherings with photos of the dead wife all over could be uncomfortable for her -- but she knew the score from the start and she committed to her husband anyway, so she just has to deal/get over it.  \n\nAnd those kids were too old, when she came into the relationship, to ask them to call her mom, or to press the issue when they refused, that's just immaturity on her part.  \n\nI actually kind of get her wondering if the IL's might pay for the nursery like they did with their own grandkids, b/c it does sound like everyone is pretty intertwined here, but she can do nothing but graciously accept that they did not.", "NTA\n\nDeath, taxes and the audacity of some entitled socially unaware dumb stepmoms", "NTA She needs more than therapy.  I can't really say on here, but it involves a steel-toed boot and her behind.", "NTA. Your sister has set herself up for a lot of disappointment and frustration.", "NTA your sister is almost certainly creating every bit of discomfort in this situation in her own mind and projecting it out onto the rest of these people.\n\nI feel sad for her husband and this entire family.", "This is a nice article for you and your sister:  [https://slate.com/human-interest/2009/06/my-husbands-other-wife-she-died-so-i-could-find-the-man-i-love.html?pay=1695134368058&support\\_journalism=please](https://slate.com/human-interest/2009/06/my-husbands-other-wife-she-died-so-i-could-find-the-man-i-love.html?pay=1695134368058&support_journalism=please)\n\nShe answers another similar question here: [https://slate.com/human-interest/2012/09/dear-prudence-my-girlfriend-gets-upset-if-i-ever-mention-my-late-wife.html?pay=1695134421497&support\\_journalism=please](https://slate.com/human-interest/2012/09/dear-prudence-my-girlfriend-gets-upset-if-i-ever-mention-my-late-wife.html?pay=1695134421497&support_journalism=please)", "NTA. Your sister does indeed have unrealistic expectations and she is going to lose her husband if she does not realize this and change her attitude.", "NTA, your sister is wrong and ILs are clearly not owning anything. But her discomfort could have some ground. Do Adam parents involve your family as well? Are they trying to get a good relationship with your sister?", "You are absolutely right.  NTA", "NTA of course the dead wifes parents aren't paying for her kids stuff wowza", "NTA  She is definitely not seeing the situation and she does need therapy and you are not wrong!", "NTA. Therapy would be good for her.", "Nta\n\nYour sister sounds greedy, emotionally entitled, and unhinged in how she's dealing with her husband's late wife's parents. Overall, she sounds like a total asshole in this situation. She probably does need therapy", "Your sister is delusional and I agree she needs therapy.\n\nNTA", "NTA - Perhaps someone should explain how family relations are calculated; aunts,  uncles, cousins, grandparents. The family of your husband's ex wife are only related by marriage to that individual & child. There is no blood connection and in (USA/European) genealogy there is NO relationship. For your sister to expect them to treat her kids as if they are grand children is beyond foolish.", "NTA- You know when the right time for her to have a problem with all this was? BEFORE committing to the relationship.", "She expects the parents of the deceased wife to embrace the baby of their daughter's replacement as their grandchild.\n\nDelusional\n\nNTA", "NTA", "Ok, let's break this down:\n\n1. If she was that insecure about her partners late wife from the start, then, in hindsight, she should have broken up with him ages ago. She tried to push through anyway, so she needs to take some responsibility for her choices then. I understand what your sister is feeling. I'd be feeling the same if I were in her shoes. The difference is that I'd leave early instead.\n\n2. If her husband knew his late wife from childhood, then it'll take a long time until she has that same type of relationship with his parents. 5 years isn't nearly enough. And it's not just waiting time to pass, she's gotta take some effort and build that relationship properly. And by properly, consider items 3 and 4 below.\n\n3. She shouldn't expect anything from the late wife's family, other than maybe being a friend of the family. Definitely don't expect them to be grandparents to her children, there's his parents and her own parents already for that.\n\n4. Expecting his kids to call her mom was a terrible mistake. Also, expecting people to tone down the memories they have of someone who was very dear to them. That's unrealistic indeed.\n\nYeah, NTA.", "NTA for telling her to get therapy. At the same time, how does Aiden expect to handle future holidays with a new partner?  That would be weird for anyone if he wants to spend holidays not with his family,  but his dead wife's?", "NTA, honestly this is some truth she needs to hear if she wants this marriage to continue healthily.\n\nMy mom died when I was 12. When I was 14, my bonus mom moved in with us. At that point, we had already met her, got acquainted to her and honestly liked her. She never pushed the mom issue. She took the “you’re not my mom”-fights even though I know now that they hurt her to her core, because she rallied like heck for us. \n\nWe met her parents and of course it was awkward at first and they were “mr. and mrs. surname” for a long while until that felt unnatural. Much like at some point calling my bonus mom by her name or “step mom” felt unnatural. And then, we all had a convo about it. And it became an unilateral decision. She was ALSO mom now. \n\nAnd even though eventually our relationship soured over the years over different things, I can never not respect her. Because she took on the job, knowing it was a rather thankless one, with three (pre-)pubescent children who desperately needed her.  She got hurt plentiful along the way, which I know now that I’m older. It actually made me make a stand against my (original? Bio? I can never quite figure out the respectful term) mom’s family because they did not treat her decently and I wouldn’t stand for that. \n\nBecause if they loved me, she was a part of that. \n\nAnd even then, she really didn’t want me to cut things off, because they were my last connection to my mom’s youth and most things about her. \n\nShe’s a class act, that woman. And I can’t see another way of relationships like this going well. It is a hard *hard* road. And nobody can expect how hard, going into it. But that is what it is.", "wow\n\nyes, she needs therapy! She thinks she can delete IL's daughter from their memory? The late wife and mother of her hudbands kids?\n\nWhy did she go for him? She's broken and if she keeps it up I won't be surprised if there is a divorce\n\nNTA", "NTA, you are completely right and if she doesn’t get therapy there will be a lot more problems. They can be one big happy family, but she and her daughter are also painful reminders of their own loss. She is being unrealistic and not setting any of this up for long term success.", "> She then complained that they were not treating her daughter like their grandchild\n\nWell, for a big obvious reason, I would imagine. I would agree with your sister that I see some concerns about how his blended family dynamic is playing out (like I have a half-sister and we have never once referred to each other as half-sisters, we just say sister) and it might be more noticeable as the baby gets older. But in this particular instance, it's very unrealistic to expect them to pay for the nursery. NTA.", "NTA.  This is tough.  There's no playbook for \"what happens when spouse dies\" ...  I think it would be beneficial for her to talk to someone...and probably have the husband there too because he too needs to be aware of the needs of his new spouse so she can get the same treatment/love as the previous.", "NTA  You are not saying she is \"wrong\" by suggesting therapy.  You are saying she is unhappy, and therapy might help her feel better about her circumstances.", "NTA", "NTA, she is tripping", "You are such a realistic human and it makes me happy to know people like you exist. You are not the ah.. at all. Your sister seems pretty delusional about what she thought would happen. I am sorry for her that she isn't getting the relationship she picture but it sounds like there was nothing hidden by Hubs from the beginning. I cant imagine asking children who lost their mom like that to call me mom and being offended.. or thinking her husbands ILs would do the same for her as they did for THEIR DAUGHTER. Wow.. just wow.", "NTA and good advice", "\"Therapy\" is an understatement, she fr needs Jesus\n\nNTA", "NTA\n\nYour sister is entitled, immature, and greedy.\n\nWhat should the family do? Have a parade for her, pay everything for her and her baby?\n\nDon't want to be a step mom or the 2nd wife? \nDon't marry a widower with kids.  Easy!", "NTA! Your sister really needs to develop more realistic expectations.", "You NTA , she needs to hear it. But in your sister's defense, if Aiden's always saying his ILs are his other family/parents, she probably expects them to care about all of his kids equally since supposedly he's like a son to them.", "NTA. I'm guessing it's the pregnancy stuff that's making her think not straight. And so, yeah, maybe you should let her talk to a therapy. \n\nI'm thinking tho why would she think like that, and I'm guessing if it has to do with the entire \"big family\"? After all, from the post it seems that your sister had frequently go to their place and it seems that even the guy's parent's house is filled with their pictures too. When the kid grow up and experience this, how would she react? Her other siblings could easily hang around their own grandparents and the house is littered with their family. But how about hers? \n\nFrom the post I notice that OP never mention their parents, or else why didn't they step up and help with the decorations, after all this should be their first granddaughter from your sister right? 🤔\n\nWell all of it are speculation. It could all honestly be just your sister going crazy, as honestly anyone marrying someone with that situation is just crazy. It's very obvious how mentally exhausting that environment would be. Instant mother, then having to constantly reminded of your partner's previous wife. Like damn, that Aiden must be very good or else wtf is your sister doing with her life lol.", "NTA she needs therapy. And she is WRONG.", "NTA. I feel like a similar version of this same story gets posted every week at this point. WTH is wrong with all these step parents and their unrealistic expectations for how them and their children should be treated??? OP’s sister definitely needs something, because she’s going to mess up her kid if she doesn’t get help.", "Blended family dynamics can be hard. I have a step mom and two step brothers. They married when I was 17 but my step brothers were 2 and 4. I don’t dislike my step mom I actually like her quite a lot and while I consider her family I don’t consider her a mom and call her by her first name. She never tried to be my mom more of older friend we went shopping and got out hair and nails done girl stuff. My step brothers though I think of as my brothers and they barely remember before I was there so I’m there sister. They still call my dad by his first name and he’s fine with that of course their dad is still alive and sees them on the holidays. With the kids being the ages they are they likely won’t ever see her as their mom and she should not expect it. I have a few pictures of my parents up but not at my dads house they have family pics of all 5 of us there. A few single shots and step mom her kids and dad and me as well. Still I don’t expects gifts from their grandmas or aunts though I met them and they don’t expect gifts from my grandma or aunt though they know my aunt quite well. We work well together after more than 15 years but we had bumps and feelings of being left out in the beginning and yes therapy helped with that.", "Shouldn't her own parents (who are also OP's parents in this case) pay for the nursery in this case? Isn't that how the math works out? \n\nNTA", "NTA. Sadly, that kind of thinking will alienate her step kids, her ILa and her husband. He was clear that these relationships are not going away. \n\nShe definitely needs help because she is not going to “build” a family relationship by demanding it or trying to separate people that see themselves as family.", "NTA:\n\nEven suggesting his kids call her mom was a bad idea. She is obviously struggling with the dynamics of a blended family and needs help before she blows up her marriage. Being the second wife to a widower is a challenge and getting therapy is the only way forward.", "Your sister needs therapy and it's for much more than you initially said\n\nShe has tried to insert herself into another fully formed family and expected to fill a role she simply won't fill.  She won't ever be their mom, they're already nearly full grown and have plenty of wonderful memories of their actual mother.  The inlaws having photos of the late wife is not an attack on her, it's that her husband was with her since childhood.  So many more things.  Her trying to forcibly insert herself (why they call me step mom? Why is daughter their step sister? Because they are, for one), will likely further alienate herself and her daughter in the family.\n\nYour sister entered this relationship completely mentally and emotionally unprepared.", "NTA. Your sister needs to grow up as well as see a therapist or she is going to cause a lot of hurt and damage. Her husband's former in-laws are not the grandparent to her daughter so it's not a surprise they didn't decorate the nursery and she needs to understand when someone dies, people who loved them are not going to put away the photos or stop talking about and missing the one who died. Nobody should expect or want that.", "Your sisters daughter has no connection to his dead wife's family.  Aidan fathered kids with his late wife so they parents are only related to those children. They are not related to your sister nor any of her children so the best she can hope for is that they be cordial to her.", "NTA, and your sister is delusional if she thinks her child should be as important as her step kids are to their **BIOLOGICAL FAMILY!** It's a beautiful thing when a blended family gets along and the person that comes into the spouse's life later fits in. That doesn't happen overnight and usually it is rare. I have a blended family; my stepdaughter came into my life when she was 6 and we are close to this day. Her mother and I were very good friends (she was my wife-in-law, she just died this year.) All my children are grown now (including her) and both her parents are gone now, but she is and always will be my child.\n\nNow that being said your sister didn't come into their (the kids) lives when they were small, they grew up with their mother. So, the ties are there and cannot be erased because she came on the scene. They had a mother, and she has a child. Sometimes you have to play the hand you were dealt and keep it moving. She will never be their mother, and her child will never be her husband's late wife's family. Perhaps in time but she can't force when that happens, just sit on the sidelines and wait until you are called into play. At the rate she's going trying to be involved in this family that may never happen. Instead of pushing the issue relax and give them breathing room.", "NTA\n\nTherapy is a compassionate and rational course of action: she's having valid feelings... that would disrupt a lot of people's lives is she were to make them everyone else's issue. These are HER issues and she knew what she was getting into. She needs to stop counting beans and start counting her blessings. She can teach her daughter to navigate this and NOT make it an issue of her self worth, but if SHE sets up the dynamic that they are EXCLUDING her daughter, her daughter will experience totally unnecessary hurt through this. Maybe approach her again and suggest therapy as a way for her to genuinely feel better and protect her daughter from the hurt, instead of priming the pump for jealousy among her siblings.", "You're right. Your sister is clearly wrong. She's NOT related to those people and expects them to treat her as if she were.", "NTA so she wants to get rid of all traces of his late wife, but basically take her place as she still wants all the things for her and her child that her (late wife) parents did for her grandkids. She is so wrong here.", "NTA, she is delusional in thinking the IL’s should pay for their child. She should definitely seek therapy, otherwise it’s going to end up badly", "Definitely NTA I mean she gets a pass because she just bare a child and that's tough sht but you are definitely NTA and she needs a reality check FAST", "ESH. Norah for being so pushy and weirdly offended that the kids still have mementos of their mother, and the In Laws suck for excluding their new grandchild. That poor kid is going to be ostracized in the future.", "Redditors have such weirdly rigid standards when it comes to familial relationships.\n\nPeople will always talk about how \"BLOOD ISN'T WHAT MAKES A FAMILY IT'S WHO YOU LOVE\" or whatever, except if the person in question is a step-relative. Then all of a sudden it's \"Well you're not ACTUALLY family\".\n\nAlso I'm pretty sure that Aiden is the biological father of the newborn, which would make her family anyway.", "NTA.\n\n>She mentioned a few times over the five year marriage that she felt like Aidan's ILs (late wife's parents) did not embrace her as much as Aidan's family did and how much it bothered her.\n\nWhy would they? They're not related to her, and basically have nothing to do with her. There is no reason for them to \"embrace\" her. Aidan's family, i.e. her *actual in-laws*, have embraced her and that's all that matters.\n\n>She brought up a lot that the kids always referred to her as step and shot her down hard when she suggested they could call her mom.\n\nBecause she's *not* their mom. Why is that hard for her to understand?\n\n>She then complained that they were not treating her daughter like their grandchild\n\nBecause her daughter is *not* their grandchild.\n\n>She said if they want to stick around they should treat her daughter the very same as they did/do their grandchildren.\n\nNo. Because those are their *actual* grandchildren.\n\n>has her stepkids saying she's a half sister and not just saying she's a sister.\n\nBecause that's what she is.", "NTA.  Your sis is in a crappy situation.  She is expected to be \"part of the family\" in some ways, but not in others.  I agree that therapy is **always** helpful, but I think she would really benefit from discussing this issues with her partner.", "NTA. I really don’t know what’s wrong with your sister, but something is very wrong.", "NTA.  Your sister needs help before she makes a difficult situation worse.  She does not seem to have ANY empathy for the family who's loved one died.  It is likely complicated for them, too, to have lost someone they loved yet also want to be happy for their former son-in-law's new family.  \n\nShe also need to think of her step-children with empathy. Even if they have a great relationship with step-mom, they lost their mom - that grief never goes away.", "NTA  Where did your sister get the idea that her stepchildren's grandparents, who are no relation to her child, are obligated to buy anything for her baby?  They could be nice and buy a little gift, but they don't owe her a single thing!\n\nKeep encouraging the therapy angle, she needs it.", "Arjbfx", "NTA. Why are so many people expecting others who are not related to their child to pay for things? It's SO weird to me.", "Im sorry but, you're sister is an asshole for expecting her husbands late wife's PARENTS to pay for her childs nursery? That is so out of line ...", "Your sister's expectations are not only unrealistic, they are BEYOND unrealistic. They're downright.. I don't know... wacky? I can't quite land on the right word. But they're not right.\n\nNTA.\n\nAnd yes, she needs therapy. A lot of it.", "NTA. I wouldn't have worded it that way, but she probably should have put more thought into entering an established family and marrying a widower before doing so. Now she's already there, she should check herself. Maybe have your parents, if possible, sit her down and explain her child has two sets of grandparents and they're just not the same sets.", "Absolutely positively NTA. And your sister has very unrealistic & unreasonable expectations here with her husband’s in laws!!! I also agree that she should seek therapy individually and probably as a family.", "TAH is your jealous sister.  Her expectations of his late wife's family embracing her like their own, is ludicrous. They lost their child! her child - is no relation to them, and if they are pleasant and kind to the child (which I hope they will be) it is out of a generous spirit. To be sure a child feels included in holidays etc when her siblings' grandparents- who are not now, and will never be, her daughters' grandparents, would be a kindness, and should be appreciated, and never expected. Her even making the suggestion to call her Mom, was unacceptable. Their Mother did not abandon them, she died.", "NTA NTA!\n\nYour sister is a weirdo.", "Wos NTA.  Your sister does need some therapy. Is this a family dynamic that most people don't deal with yes. It is also a family dynamic that takes a lot of finessing.  It takes a lot of work.  I'm sure his in laws will be very kind to their child but that child is not the in-laws grandchild and there will be differences that her child will grow up seeing.  She needs a counselor to help her learn how to navigate this in a healthy way and you were completely right to suggest she start working on that now before her child has question's.", "Wouldn't being treated \"the same\" by her actual inlaws be OP and her sister's parents decorating the nursery? Has she itried ntegrating her own family of origin into this mix?", "No one owes anyone else a relationship because they think they're entitled to one. ILs don't have to include Norah or the baby in anything. The step kids don't owe her a maternal relationship, and the rest of the late wife's family don't owe her shit. Like the family is just going to pick up and move on after their daughter died like nothing happened. Yeesh. \n\nNTA. She needs therapy and someone to pull her head out of her ass.", "She has a point, all Aidan’s children matter, but she knew what the family was like beforehand. And she still chose to attach herself to him.\n\nNTA but she is deluded.", "NTA", "NTA, she's not their daughter, so of course they won't embrace her the same, or her grandchild.  They keep in contact for Aiden and his kids.  Now, it may be good for them to get her daughter birthday or Christmas gifts since she is now their grandchildren's half sibling, but to buy all the nursery furniture?  And to be 'haunted' by photos?  She needs to realize that Aiden's late wife didn't disappear from the earth just because Aiden remarried her.", "OMG thank you, I for some reason was reading that like the husband's parents, and I thought it was kind of shitty for them to not help out with their newest grandchild like they had the first ones. Wow. This is wild.", "Wow…I thought it was her in laws, not the husband’s in laws…thanks for clarifying.", "I read that part, understood it, and still somehow thought it was the husband's parents. Presumably my brain thought it was so batshit crazy that it couldn't possible refer to his late wife's parents and autocorrected it\n\nShe's utterly nuts", "Their own *deceased* daughter whom they will never see again. OP's sister needs to get a grip. These people are grieving their late daughter, will likely always be grieving her, and it probably hurt them to see Aidan moving on, marrying another woman, and having another child with her. Asking them to treat that child as their own grandchild is like... does OP think she can replace their *daughter?* that's insane.", "This is perfect.", "> She is their step mum and trying to get them to call her otherwise is a horrible move\n\nI was surprised at how many people felt differently on yesterday's post where OP doesn't want her stepfather to walk her down the aisle.", "Step mum isn't even a dirty word like women like Norah always act like. I got off to a bad start with my step dad. In fact it took until my mother passed for us to really start treating each other like father and son. Even now 25 years later, I still call him my step dad, but I say it with love.", "It's great for Norah that Aiden's parents have embraced her. It's totally bonkers that she expects his dead wife's PARENTS to embrace her as a replacement for their DEAD DAUGHTER", ">She knew going in what the story was and was told very bluntly that it would never change. She went forward with it and now wants it to change... Why do people do this???\n\nI guess my reading of it is that she accepted that these people are an integral part of the family she married into, but she herself is not treated like family. \n\nThey view Aiden as a son, and want him to be a part of all their family gatherings. However, Aiden's wife and daughter are somehow not really included in that? Something about that just rubs me the wrong way. If I viewed someone as a son and spent all major holidays with that person, I would view his wife as a daughter-in-law and his daughter as my grandchild.\n\nTheir views are clearing interfering with interfamily dynamics because Aiden's older children view their sister as only a half sister. Most people I know would not specifically make that distinction, and would view their half-siblings as just regular siblings.", "Yeah, her whole mindset on this is pretty weird. She seems very conflicted about her feelings. On the one hand, she wants the late wife’s family to accept her and pay for things. On the other hand, she doesn’t want any trace of the late wife left in her house. \n\nYou’d think if she wanted the kids to accept her as their only mother, she would want as little input from the late mom’s family as possible (definitely the asshole way to go). If she wanted to be accepted by the family of the late mom, then you’d think she’d be fine with keeping the pictures and memories of the late mom, and not try to pressure the kids into calling her mom. Considering that the late mom is their primary connection to her family. She can’t have it both ways.\n\nOP, I think your judgment is spot on here. She really should have worked through this, and made sure she was comfortable with the dynamic before getting married. A therapist might be what she needs now to help her realize that her expectations are unrealistic and even conflict with some of her own feelings. You letting her know that is the best thing you can do to support her. NTA", "I agree.\n\nI think the sister does need to go to therapy in order to work through some of the things mentioned by OP for sure. I can't imagine being bothered by seeing photos of your husband's late wife at their friends and families homes. That baffles me.\n\nHowever, I think people are discounting how othering it can feel to be in OP's sister's position. When you marry someone, you become a part of their family. This is a really unique and difficult situation, in which OP's BIL has a family that his wife is not able to be a part of or truly access, despite spending all the major holidays and general time with them.\n\nI am not saying the ILs need to treat her like a daughter or pretend their daughter didn't exist. But there's someone that really rubs me the wrong way about the fact that the IL's are around so much and are such a big part of OP's BIL's life that OP's niece is already looked at by her siblings as just a half-sister. This tells me a lot about how much OP's sister has been made to feel like family and how she is viewed by the IL's and her stepchildren. It's complicated to be a stepmother to children who lost their mom, but it does seem like OP's sister is being held at arms length in certain regards.\n\nI understand they are grieving, but if OP's BIL is like a son to the in-laws and the in-laws want everyone to be one big family, then his wife should be treated like a DIL and his daughter should be treated like a granddaughter.", "Yeah that was my first thought too. Even though biologically it isn't their grandkid, if they are really into big family gatherings and always involved, it is weird to exclude the new baby and will make for some strained relationships between siblings in the future. If she's suppose to accept the IL's as extended family they should be doing the same to her and the baby.", "Agreed. What else does it mean to be \"one big family\".", "This was my thinking. If the former in laws just took their grandkids and did things so often that would be different. But the fact that it sounds like everything time OPs sis goes to her in laws house her husband's former in laws are also present makes them horrible people imo for treating the baby differently.  If I were sis I would refuse to go to in laws for any events. Hubs can take older kids and she can take her baby to visit family who actually lives them.", "The baby is 5 months old. How exactly are they supposed to treat a baby who basically eats, sleeps and shits.", "What? Be kind to the child and don’t other them, sure. But pay for the nursery same?! Where does she expect it to end? Are they supposed to make a college fund for this baby? This new baby has 1) both parents living and 2) 2 whole other entire sets of grandparents, including one set (OP and Norah’s parents) that the older children do not share. And I’m not hearing anything like “she has always insisted that our (OP’s) parents treat the stepchildren exactly the same in terms of everything, including large financial gifts, as they would her own child.”", "Beautifully said👆👏👏", "I think family counseling is the right option here. I think we always assume that the widow has also healthily coped with grief, which isn't always true and will always play into any future dynamic, especially with kids and in laws involved. It sounds like there is a lot going on here that Norah and Aiden need to figure out in terms of how their family dynamic might need to shift to work for everyone to feel loved, included and valued.", "I think family/couple's counseling is jumping the gun. From everything OP has stated in the original post and comments, husband has no idea his wife feels the way she does, and she hasn't ever told him. There's nothing for him to be counselled on if she hasn't said anything about it in 5 years. Siccing a couples counselor on him is likely to become a confrontation, which is deeply unfair given she hasn't been honest about her feelings. She's been internalizing it, seething in private (OP has used words like \"she hates it\"), and venting to OP as her only emotion management. It will not last, and it's strictly her responsibility to take some kind of step in the right direction, be that therapy, or simply telling her husband what she's feeling so they can work it out.\n\nIf after talking about it they still are not able to resolve this, then couples counseling is warranted.", "I think all she is asking is to be treated like a DIL, not replace their daughter. They treat Aidan like a son, ipso facto, she is like their DIL. Notice how she is comparing the way Aidan's family has embraced her as an IL to the way Aidan's other family has not embraced her as an IL.", "I get the feeling that Aiden might be pushing the \"big happy family\" ideal and expectation without regard for the full dynamic. I could absolutely be wrong, but it just seems like from Norah's perspective here, that the inlaws aren't fully interested in that idea. But if Aiden is pushing that, Norah tries to meet his expectations and push to make it work, but she's by herself because the in laws aren't interested. I think Norah and Aiden would benefit from some family counseling to have open conversations about expectations, ideals, and feelings, and find a new dynamic that works for both of them.\n\nNorah should not be expected to be a pushover or excluded from her own family, which includes the in laws (which is the vibe I get from how she's feeling at least) but she also shouldn't have such expectations of the in laws either.", "Then she shouldn’t have married him. You can’t go into a marriage expecting things to be different than they were. This is the problem with lots of relationships- expecting the wedding to change the person.", "This.. is the best comment I've seen and I literally read every single comment.. beautiful !  This should be the #1 comment. I really hope OP sees this.. you are a great person.. very empathetic and kind.", "While I agree with your comment in theory, this woman is 40, not 23. It’s fairly entitled to expect her own family to cater to her in this way too. Especially because we have no idea what her own family background is (such as, siblings could already have kids and families tend to, parents could be older).", "They are one big happy family, except for the entitled crazy lady who just married one of the members.", "OP's only saying that her sister should seek therapy for her situation. Someone with a professional background in these kind of situations to help out with these clearly complicated problems instead of OP isn't a bad move.\n\nAnd to be honest, the late ILs don't owe her a nursery, her step-kids don't owe her calling her \"mom\" instead of \"step-mom,\" having pictures of the late wife around the house isn't a \"message\" being sent against Norah, etc. People can enforce boundaries, obvs. as long as people are still treated with respect - on that point you're right.", "Someone needs to google \"equal\" and \"same\"....\n\nOP's sister wanted the SAME present they bought their daughter when their daughter had her own babies. And she wanted these poor people to TAKE DOWN  piva of their own child.\n\n\nA big family doesnt mean grandparents treat their dead daughter's children equally with their half siblings. It means the half sib is welcome as a family member. Big difference.", "But see the ILs paid for their dead daughter's nursery.. she wanted the dead wife's parents to pay for it. Like I'd get it if the husbands parents paid for the dead wife's nursery, and she wanted the husbands pay for their new baby's nursery.. but that's not the case. This is a messy situation, on one hand she knew what she signed up for, but on the other hand I get that she thought everyone would grow to love her too.. and they would all indeed be one big happy blended family. But the thing that bothers me the most is that she is upset that the dead wife's family has pictures of her up.. and thinks they keep pics of their dead daughter up to spite her. I feel resentment and that's why I think therapy is necessary..", "I feel for her. This is a **hard** situation. She is both told that these in-laws, this family of the late wife, are \"part of the family and can't be excluded\" but she also feels excluded *by* them. It's clear she doesn't want them around because, frankly, no one, no matter how goodly of a soul they are, wants to be forever compared to a dead lover. She is jealous and rightly so to some extent.\n\nHer expectations are totally out of whack here, but this is a particularly wacky situation, too. I agree she should seek therapy to better process her emotions around this and to find a coping strategy. Being told \"this is how it is and it's not going to change\" is one thing at the off, but experiencing it is different.\n\nIt is extremely difficult to marry a widow or widower. 99% of the time that person wishes they were still with their dead spouse instead of the new living one and they remarry before they are ready to close the door on that part of their lives. I really feel for your sister. She needs help.", "I get it. She’s been told for the last 5+ years how they’re all one happy family. Wouldn’t dream of excluding anyone from the group. That she just needs to view his first wife’s family as part of his family.\n\nNow at the first opportunity, she’s seeing that is not actually true. She needs to accept that she and her daughter will be treated as second class citizens by half of the “family” she married in to. \n\nShe’s confiding in you. I don’t think she’s wrong to be frustrated by the double standard she’s being subjected to. She must accept them as family but how dare she expect them to accept her as family. \n\nI do think therapy would be a safe place for her to vent these frustrations and maybe learn coping mechanisms. You are showing you are not a safe space for her to talk about the tough parts of stepparenting.", "Oh geez ok, I was getting ready to say E S H because I thought you meant her husbands parents (ie… grandparents of all three children) paid for the nursery for the first two from the late wife, but refused to pay for the 3rd child from the second wife… on that I would have agreed with her.\n\nBut to expect her husbands’ dead wife’s parent to pay for a child that they have absolutely no relation to is just coo-coo", "😂 I guess your parents didn’t offer to pay so someone else had to", "That's absolutely insane, greedy, entitled, and unhinged.", "Very confused. Is she as focused on your extended family reaching out about the baby as she is about the husband’s former ILs? Has she forgotten about your parents and the fact hat they already are in the roles she seems to expect her husband’s widower’s parents to fill?", ">She expected them to do everything for her daughter that they did for their own grandchildren.\n\nBut not have pictures of the late wife in their home. Your sister just wants to BE the late wife and have no one notice the substitution?", "Oof. Your sistets about to crash her entire family dynamic. Shes got 2 choices here: \n\nShe can either seek counseling, understand that Late wifes family owes her and her child, NOTHING. Period. \nShe alsk doesnt have any right to make the teens call her mom, or half sister anything but half sister. Also, step and half arent slights. They are titles brought on by the current situation. If shes taking then as in insult thats her own doing. \n\nOr, she can fall down the rabbit hole so many others have. She will try to force the teens to call her mom, make young child think the siblings owe her (cuz your Sis is gona drill that into her). And she will either blatantly or subtlety try to insinuate to the late wifes family they either include her and young child as equals or shes cutting them off from Aiden and the teens. \n\nSounds like shes going to try to go nuclear. NTA, but be warned. Sounds like shes gearing up to do something very stupid. \n\n\"Look, Sis you can be mad at me all you want. That fine. But i am trying to help you. If you want a decent relationship with the teens and their grandparents (from late wifes side) your gona have to change your pov. Your joing *Their* already established family. Its *You* who needs to be courteous here, and remember your an addition to an already established family, not a replacement mom. You have no right to dictate that. Nor Aiden, if the roles were reversed. If you dknt change your view your going tl drive them away. I want you to have a good relationship. But your way if NOT a healthy or good way to do it. I am on your 'side.' I want you to get some help, cuz its obvious your hurting and I cant change your hurt. Neither can Aiden, the teens or late wifes family. None of them can help you the way you can help yourself if you really want this all to be harmonious.\" \n\nShe can either choose peace or chaos. Those are her choices. Pleasez be there for your nieces/nephews for if and when this all blows up 😬 Best of luck Op", "OP perhaps you should also told her she’d benefit from genealogical therapy. Your sister is, is, is…. Okay, words fail me. So just imagine how the ILs feel!  NTA!", "YTA for not giving Aidan a heads up before he married your trainwreck of a sister. Jesus, like the guy doesn't have it bad enough.", "INFO I’m curious, the husband says they will all be one big family. Is she expected to treat them as 100% full family while being treated as a step family herself? If she’s forced to treat them like full family then it’s only fair to expect to be treated as full family in return. I get where THEYRE NOT HER CHILDRENS GRANDPARENTS OMG but if she’s expected to treat them like parents they should be expected to treat her like a daughter.", "That is flat out insane.", "What did you and your parents and family do for her when the baby was born? Are you just as involved in her family as his late widow’s family is in his?", "Your sister didn’t *expect* the maternal grandparents of her step kids to fund her nursery at all. It was more like your sister setting herself up to be able to tell her husbands family something like, “See? Ya’ll AREN’T one big happy family like you SAY you are, so cut the shit and write HER (their beloved deceased friend) out of your lives.” \n\nI’ve noticed that a lot of people think that getting married means that your spouse will just completely dedicate their entire life and all their energy to you after the vows, like flipping a switch. Like, since you had said your promise in front of everyone you know, it now makes it so that your spouse is required to do and say all of your heart’s desires, without you even communicating what you want, regardless of the sanity of your requests. \n\nMarriage is a straight up license, like driving.\nMaybe we should have people take an entrance exam, or a 5-hour course.", "I think she's started this of by feeling like an outsider. I legit think she's had to deal with some hard stuff, but it sounds like she's started with feeling awkward, not treated them same, left out a bit and then spiralled over the years to this being where she is now. Lots of negative thinking, feeling things are unfair and spiralling down instead of up.\n\nShe genuinely does need therapy. There might actually be some legitimate things they are doing which isn't great... I also don't think siblings calling a baby that lives with them and their dad, their half sister, is a good thing. All my 3 siblings are technically step siblings but they were never called that. And so there might be some things they are pushing too hard... but unfortunately this expectation of her husband's dead wife's parents paying for her child's stuff is not realistic at all. That's too much. Call the baby just their sister, they all live together and this will make that wee girl feel different for sure... be aware they have different mums but don't keep shoving it down one kids throat... but the other stuff? Not ok.\n\nI think she's probably in a marriage she maybe shouldn't have gotten into in the first place, and I imagine it's messed with her head a lot and caused a lot of confusion and pain. But she's also came into it without pure acceptance and the wrong ideas. I think sometimes loving someone can definitely do that. You stay because you love them but always have issues and resentments and shouldn't have stayed.\n\nI feel sympathy for all of them and you are definitely NTA.", "Telling someone  they need therapy is often interpreted as \"you're so wrong you are actually insane none of your feelings are valid\"\n\nWhich is true for this situation but not helpful.\n\nMight be more productive to say I understand you feel like you are living in his late wife's shadow and I sympathize it would be one thing if this was HIS parents but its unrealistic and quite frankly ridiculous to expect his LATE  WIFES parents to treat your children like their own grandchildren. Why do you think they should pay for children they have no relation to?\"\n\nIf she keeps being ridiculous you can politely but firmly say \"I'm sorry I sympathize but I don't agree with you I'm not the one to talk to about this.\"", "Haha. Absolutely not. You’re assessment is correct.", "That actually really saddens me because the late wife's parents are probably still coping with/grieving their daughter too. Parents aren't meant to out live their children, that kind of loss lasts forever. It sounds like your sister is alienating herself in her new family :(", "I guess it didn’t occur to her that the in-laws bought a female nursery set, and a male nursery set. It’s unlikely they would have purchased a third set had their daughter had a third child.", "I know right?!?!? Like WTF 😒 yes she needs therapy, and maybe some family therapy as well with hubby in the mix.. idk but this sounds like it won't end well.. I feel bad for the new baby, it didn't ask to be brought into this mess 😕 oh btw NTA OP", "There's a difference between accepting her and acting like she's their daughter. She is their late daughters husband's wife. They do not owe her and the child the same treatment as their own blood. There is nothing saying that they haven't helped out with other things, just that they didn't completely supply the baby's room. Which is their complete right to do.", "She chose to date him. If she wasn't happy, she wasn't forced to continue to date him and wasn't forced to marry him. She was hoping he would change, or they would change. Hoping they would take the pictures down and things like that. Instead of just finding someone else to date.", "It seems a little odd to ask anyone to decorate a new nursery when they've previously paid for not one, but two, nurseries.  My in-laws gave some nice things for the first baby, most of which I reused for the second.", "If she expects them to treat her like a daughter in law, how does she feel about her and her husband paying for them to join on vacations? Would they even be invited on family vacations? Or what if they have medical costs as they age or need to be moved into a care home facility - would she have a problem paying for those things? \n\nIf not, I can understand that she wants them to be a part of her family just as much as she wants them to be her own child's grandparents. \n\nBUT, if she doesn't want to pay for those things or otherwise care about their wellbeing, then she has unbelievably unrealistic and unfair expectations.", "> Do they expect her to do anything for children that aren't even her children?\n\nYes, because they are her step kids. That's part of the deal when you marry someone with kids. The dead wife's parents are expected to be friendly to OP's sister, which means welcoming her into their home, buying her a present at Christmas, and bringing a gift to the baby shower. That doesn't extend to treating her like they treated their own daughter and buy her a whole nursery. If anyone should do that it would be OP's or Aiden's parents.\n\nThere are levels to family and what you are expected to do for them, and your daughter's husband's new wife is not at the same level as your own daughter. Accepting her as family does not mean treat her like their new daughter.", "This is so sad. She never should have gotten involved with a widower if this is how she thinks. It's super toxic and depressing.", ">My sister hates it.\n\nThen she shouldn't have married a widower.  Are the children supposed to pretend their mother didn't exist?  No wonder they aren't warming up to her.", "I have a friend who married a widower with three kids and became a stepmom. When she moved in, there was a huge family picture over the fireplace. \n\nWhen she had her own baby, she had a picture of the entire family taken and hung it on a spare space on the adjacent wall. That picture’s changed over the years as the kids got older, but the only way the picture over the fireplace of my friends husband, his late wife and their kids has changed was that it got a replacement frame after one of the kids had an incident with a golf ball. \n\nShe makes a cake for their bio moms birthday every year. She goes to visit her family on their moms death date so they can grieve. She’s encouraged them to keep up relationships with their mom’s family. \n\nI asked her once why she’s never moved the picture. She said “Without her, my kids wouldn’t exist. My husband wouldn’t be such an amazing husband. I owe that woman. The absolute least I can do is keep her picture up.” \n\nAll the kids call her “mom”, and I’m pretty convinced it’s because she respects their mom’s memory, gives them space, and encourages them to talk about her.", "Is it pictures of only his deceased wife, or picture that have her in them, with the rest of the family.  It's not reasonable to ask for family pictures be removed, but I think it is reasonable to remove a single picture of her or hang those in the children's rooms.  \n\nWhere are your parents in all this mess.  They should be the grandparents filling the roll of what your sister thinks the hubby's previous in laws should fill. \n\nNTA", "Does she expect your parents to treat her stepkids exactly as they treat her baby?", "“Just another grandchild,” absolutely.  Treating HER like THEIR daughter, not so much.  Sounds like unspoken expectations on her part that the nursery is about the baby, when maybe they were looking at it as about the new mother nesting?  Because like yeah why wouldn’t Y’ALL’S parents be involved…", "Here’s the thing, you’re right and NTA, however if your sister’s husband expects his family (your sister and all kids) to treat his former ILs as family, what is so wrong about expecting them to treat his new son as family as well? I don’t think your sister is right as she has a lot of hold ups about deceased wife, but I don’t think it’s healthy for a kid to grow up with a “family” that treats him differently. If former ILs are “like husband’s family” then they should treat his newborn son as such.", "Do your parents mind that she want her husband other in-laws to treat her and her child as theirs? Will they mind missing out on time because your sister thinks that her child should have another, different set of grandparents? Or does she expect the two teenagers to accept your parents as their grandparents too, and  all 3 children split their time between 3 sets of grandparents?\n\nAs a widow, I can’t ever imagine being with someone who feels entitled to the things your sister feels she is entitled to. I know it’s hard to get into a relationship, and form a family, for the new partner. It’s not impossible, but it does come with other issues - and your sister’s “solution” is more likely to end in friction than not. She’s already driving a wedge between her and her step children by objecting to them calling her their step mother. Not getting what she, unreasonably, feels entitled to will only drive another wedge between the late wife’s family and her husband and step kids. \n\nYour sister is going to end up boxing herself into a corner with her actions. I wouldn’t be surprised if, at some point in the future, she starts issuing ultimatums and demanding people choose. Her resentment is only going to grow if she refuses to address it. \n\nYou are NTA, you want her to feel happier and her relationships to succeed and you know that won’t happen without something like therapy. I hope she realises you’re right before she destroys what she wants so much.", "You’ve never seen grandparents with babies?", "I specifically said in my comment “not about the nursery”. Slow your rage roll and read before replying.", "I don’t think the sister is in the right overall. But I do get that she is expected to treat her husbands parents and his in laws the same - so yeah, it would make sense to expect the in-laws to also treat their grandchildren and “step grandchildren” the same. Otherwise, sister should be able to treat her husbands late wife’s parents as grandparents to her step kids and not as “one big happy family” - I see why she’s feeling othered. She’s handling it really really really wrong though and I agree her expectations aren’t really fair (pictures of late wife, stepmom title, half sister should all be fine imo if you’re marrying a widower)\n\nIt’s def a complicated family dynamic and OP was right to recommend therapy", "I do get where you are coming from, but they didn’t say that, it was the husband. They are still getting used to Norah being there and it’s gonna take a while for them to embrace her.", "They are one big happy family, she is the one who joined the family. That doesn't mean every single member of the family has to buy her a nursery or pretend to be grandparents of her child. That kid has grandparents already, and they are actively involved. She needs her head examined.", "Because there are young children in the home who don’t need to be ostracized from their greater family just because their mom died.", "She also shouldn’t expect the teenage step-kids to call her “mom” when they had a mom they likely have strong memories of,", "Was this because they weren't invited, or because they didn't turn up? Option 1 tells a completely different story to option 2", "So not ‘one big family’ then huh", "So she disnt invite thw\n But wanted them to be \"equal grandparents\"????  Norah sounds like a entitled toxic nightmare", "Of course they weren’t! It’s another example of their double standards.", "Malicious compliance on her end probably. She really does need help", "I do think she shouldn't have married him. The former ILs are pretty clearly part of everything, so I don't think it was a surprise to her or a change in his behavior after the marriage. I am pretty sure she is feeling bereft that there is nothing she can do to get a place at the table for her or her child after all she has given up.", "Thank you. I feel for that woman. Sometimes I have to be reminded to hear the emotions and not the words, and I guess this hit me.", "Did you even read my post? I did NOT say they owe her a nursery. I did NOT say they should call her mom. I did NOT say to take down all photos. Stop jumping to conclusions and attacking me. Dang.", "Yeah, one of the most supportive things you can do for someone is saving them from themselves. Unfortunately, people tend to view it as being attacked.", "Telling a loved one with toxic thinking that they would benefit from therapy is a longshot.", "Love this response. 👏", "It is a hard situation, but here's the important part - it's a situation that was explained to her well in advance.\n\nPersonally I would have had a good long think if my new partner is worth being eternally attached to the family of his deceased wife. I'm not sure if I could marry someone that's always going to have the ghost of his first wife around him all the time. She chose to marry and have a kid in this situation, she needs to gracefully accept how her life is now.", "It’s a hard situation, but I don’t think the former ILs of her husband are comparing her to their late daughter. \n\nThere’s definitely a complex situation here, as her husband and his late wife were together for so many years, the families have a common history. It’s very difficult to separate them, but I think OP’s sister has been delusional here in how she wants to be treated and how she expects her child to be treated! She asked her step kids to call her “mom” and wants her husband’s former ILs to treat her the same as they treated their own daughter!?!? As long as they’re being nice to her and her child, support their grandchildren’s relationship with her, they don’t need to do anything else at all!!! \n\nOP what do YOUR parents say about this? Maybe she’ll listen to them?", "This right here is the crux of the matter. She didn't expect them to actually help with the nursery, she hoped they would. Why? Because if they did help it meant she was family and they saw the new baby as family as well. They of course don't see her as family and I'd be willing to bet she's been treated as such but just smiled and kept it inside trying to believe the whole \"One Big Family\" lie. It wasn't that there were pictures of the late wife that gave her the idea they didn't want her around, it was their words and actions. The pictures are just a catalyst that solidified those into a tangible thought. The whole mom/stepmom thing is just part of the feelings of being the outsider. You would think being in their lives at least 5+ years starting when they were 8/9 they might consider calling her mom. Of course if someone, say a grandparent, has corrected the kids from calling her mom and reinforced that she is a stepmom that would put a finger on the scale. I can just imagine how devastated she was when they said \"No, you're stepmom\". From outsider to the extended family to outsider in your own house.\n\nOP is right for the wrong reasons. Both husband, wife, and kids need therapy and counseling to make this work. It's not \"One Big Happy Family\" it's one big toxic family.", "Yeah, I'm curious what will happen at, say, future Christmas parties together. Will her biological kid get a gift, too, alongside her step-kids? While the step-kids' grandparents aren't obligated to give a gift to sister's biological kid, I can see it being upsetting if they don't while the step-kids get showered with them.\n\nMy cousin married a woman with a son from a previous relationship. When he comes to Christmas get-togethers, he gets a gift like all the others. It's not hard to include someone.", "Have Norah's parents embraced their 2 step-grandkids?", "The expectation about the nursery is unrealistic imho. And nobody can demand to be called \"mom\", it doesn't work this way. But if both families make so clear they are one big family, and I'm always called a step and my child a half member of the family, I'm pretty sure I'd be upset too. They are obviously not bounded by blood relations only, so that would sting.", "Her husband's late wife's parents didnt gift OP's sister with a nursery because SHE IS NOT THEIR KID. They paid for THEIR daugjter's babies' nurseries. One family doesnt mean equal treatment. It means appropriate and equitable treatment. How is the new baby going to feel? Well, if he/she has decent parents who, I dont know,  actually parent their kid, then the baby will u deratand that those arw bonus grandparents not actual grandparents. Do OPs parents plan on treating the steps idenitical to the new baby?", "If I could give you an award, I would. It's completely ESH. The grandparents aren't going to treat the new baby well.", "She is not being asked to treat them like her parents. Just to accept that they are around and basically one big family. But she doesn't need to treat any of them like they're her parents.", "I really doubt the problem was the room. She was just trying to point a reality, that only she is expected to treat them like family, but they are not expected to do the same. Also, it is the same for her. It is one thing for her to accept these people into her life/their presence to certain events and a completely different thing to be forced to act like they are family.", "Yeah it doesn't sound like anyone is shunning her. Norah is just upset she hasn't been adopted as their new daughter. Which is weird as hell.", "I would be curious if they’ve done those things. Do they get her a present at christmas? Will they get one for her child (assuming christmas is at their house)? Were they supportive during her pregnancy considering how much time they spend around her? Is she allowed to be an authority figure to the stepkids when necessary? \n\nTo me, all this info would speak to the dynamics of the family unit. If the answer to all of those is “no,” then she’s right about not being treated like family and the nursery isn’t the actual issue. If the answer to most or all of that is “yes,” then sister is living in an unreality I’ve certainly never experienced", "I mean... I think many people (like me) who would never date a widower start from a \"not giving the benefit of the doubt\" point, but I can understand if some people want to be more hopeful, because IN THEORY 90% of widowers act and say in a way that shows they have elaborated the death and its consequences. Then, in reality, after some time the mess explodes.\n\nPersonally I think this is strongly an ESH situation. \"One big family\" and \"excluding the new wife\" can't go together. And you may ask \"ok but vivianlight, how do you expect the late wife's parents to embrace the new wife?\". And my answer is that they shouldn't, because there shouldn't be this \"one big family\" situation to begin with. They should keep the existing relationships (with the previous children) and the cordial new ones, but this mess of forced \"big family\" can't work. Right now, it's basically forced on OP's sister without actually including her... it's stupid. How could OP's sister develop barriers and boundaries if she can't physically have those boundaries and barriers? You are forcing her to accept a psychologically weird situation in which she has to accept a big family (which she seems ok with) while at the same time being excluded from it (which is where she explodes, leading to reactions and requests that still out her in the ESH mix). At the beginning of the post it's said that the husband said that the families are basically one big family and won't separate... but OP's sister IS family, their son IS family. I honestly understand the problem here, it's a mental trap basically. They need to separate the families (like I think already happens with the new wife's parents).", "That’s not the same thing", "But she’s not their grandbaby. OPs parents are the grandparents", "Ok, but that is what the sister seems most focused on, not personal interactions at family gatherings. In fact I would wager they have been just fine to her in personal interactions or why else would she have decided they were going to pay for the nursery in the first place?   \n\n\nI still disagree that they have to treat the kids the same though, the deceased wife’s parents can be family to Adrian and their grandchildren while being only extended family or close family friends to Norah and the new baby and I would not see any issue with that.  Treating Norah EXACTLY the same in all ways as their dead daughter (and her child vs. their daughter’s children), even outside of this ridiculous and entitled nursery issue (that clearly begs the question what insane thing is next that she’s going to freak out about) is a really, really high bar that most people could not meet.  Again, kind to Norah and the new baby and recognizing they are part of the *extended* family, yes.", "They've been married for 5 years. How long does the family need to embrace her??", "Unfortunately, you are either very young, or a very sad individual who does not understand the concept of marriage. When you marry someome, you form your own family with that person and you become the main family to that person. But hopefully when you grow up, you'll understand a little how adulthood works", "Oh I definitely agree! That is a line she never should've crossed. IF the kids are ever ready to call her that (they would probably never be) then it should be on each of their timelines.", "They weren't invited.", "Y’all are taking that and applying it to every single thing", "They weren’t invited, according to OP. Which if I were them would be a pretty large broadcasting of how Norah felt about me.", "Why would they be. The new baby is not related to them", "According to OP, they weren’t invited. Why Norah expected them to decorate her daughter’s nursery when she didn’t invite them to the baby shower is beyond me.", "Right", "The last part of your comment was added after I replied. Had I seen that last part, I wouldn't have mentioned the nursery part in my comment. If you thought I was attacking you, I'm sorry. Absolutely wasn't my intention. I was actually only meaning to add some things that you didn't mention from the post to use them to provide my own opinions on the matter.", "She is a stepmother, that's not an insult. And the kids aren't ungrateful for refusing to call their stepmother \"mom\". She is not their mom and never will be.", "Nah they had a mom. She's literally their stepmother.  No where does she say that they are bad towards her just that they won't call her mom and frankly that's okay", "It's AITA, 20% of the people replying never read the entire post, or they \"speedread\" it aka scan it for keywords and then stitch it into a coherent narrative that is frequently wrong.", "Totally - but it’s still what you do when you love someone", "Yeah, the \"calling her mom\" thing should never, ever originate with the stepparent. If it's going to happen, it should come from the child... if and when they want to. If they don't want to, then you don't do it. \n\nI love my stepmother dearly, and have for forty years, but I call her by her first name. It's just what I fell into (I think it's because what my dad calls her, so it seemed natural) and it doesn't make her any less one of my parents.", "It’s pushback for her pushiness. \n\nShe could have a great relationship with those kids, and the rest of the family if she only accepted the relationship has to be the one they want and not what she envisions how it should be.", "Like I said, being forewarned is one thing but you can't know for sure how it will feel and how you will take it until you experience it. She thought she could handle it and maybe it turns out she can't. She doesn't \"need\" to accept this just because they have a kid.\n\nShe and her husband *need* to have a talk about this and he *needs* to be open to making concessions. He chose to marry another woman into this not ideal circumstance just like she chose to marry into a not ideal circumstance. They are both at fault for OP's sister feeling terrible. He has culpability here too.", "I think that's a pretty unreasonable demand to expect the in laws to pay for nursery decorations. But if I were Norah I would have a conversation with my husband about how to handle this \"blended\" family dynamic. For example, if during Christmas the in laws only got gifts for their grandchildren, it would be understandable that they wouldn't want to buy a gift for Norah's child. But the child doesn't understand that and sees exclusion or being \"other\". Especially if Norah's family doesn't differentiate and the in laws are the only ones that do this. But again, that's where as a couple and a family you have to make a game plan for the best interest of ALL children.", "Oh and let's not forget that she gets upset that the in-laws have pictures of their dead daughter up. And that her husband and his sister have pictures of her up, knowing full well that they grew up with her from little kids to adults and then unfortunately lost her. The people that loved her and then unfortunately lost her should be able to keep pictures of their loved one who is departed on their walls if they want to and also the dearly departed's children should be able to see pictures of their mom hanging up at family's house or put them up wherever they want to.. the IL are keeping their dead daughter's memory alive as well as others who loved her.... This stepmom kind of reminds me of this post that I saw where this woman was so jealous of the previous wife who had died and wanted the step children to accept her and call her mom, and basically erase their mom...she was so jealous to the point that she went up into the attic and got all of the children's dead mother's stuff and burned it, took the pictures they had out of their rooms of their dead mother burned them, the letters that the mom had written to her children before she died she burned them.. this girl is not too far from that.. I just don't see this ending well 😕", "of course it will !!! I mean the kids are teenagers then they will have their own families before  this poor new kid is grown and the grandparents will shower their greatgrand kids and spend time with their great grand kids . OP sister needs to make sure her family is there for the kid and not expect the parents who lost their daughter to act like she is their daughter . where are HER parents to take care of the nursery etc ????", "But she's *not* the deceased wife's family?", "There's no way I would expect my husband's in laws to pay for a whole nursery. Or my husband's family. We also don't know if she picked super expensive things, in anticipation that she wouldn't have to pay.", "Not that weird if she's spending all her Christmases with them", "There is zero evidence in the OP that the sister is being excluded from anything. She's doing this to herself.", "The “one big family” refers to the husband’s parents being close with the late wife’s parents. Not OP’s sister or her child.", "But they are at EVERY family gathering for the foreseeable future. They can’t just leave one sibling out. It’s cruel.", "If the husband is viewed as their son, the baby is their grandson.", "Then they should not be at. Every. Single. Event. At husbands parents house. They are all one big happy family or they are not. They can not have it both ways.", "I don’t know what you expect from them, you think they would embrace her the same as their own daughter??", "So the kids lose/have to sacrifice the relationship with their surviving grandparents because Dad remarried?", "And yet they were expected to supply the nursery? Your sister is seriously entitled.", "Wow. So she snubbed them and expected them to suppli the baby family the baby’s nursery!?!! She didn’t even give them a chance. NTA, OP.", "This is the biggest face palm I have heard,", "Because new baby has to be around both sets of her siblings grandparents for EVERY occasion.", "If they’re one big family and at every holiday, then yes, the new baby is related to them. You can’t have it both ways.", "Baby showers aren't just for relatives. I had many friends at mine, and I've gone to showers for friends and coworkers. If they're \"close\" to the family, I don't think it would be weird at all for them to come to the shower.\n\nOf course, this depends on how they define \"close\". There's nothing weird about the kids' grandparents (husband's ILs) wanting to be at birthdays, holidays, etc. for their grandkids and still not wanting to be close to OP's sister. But if OP's sister's husband is going to act like they're one big blended family, then the ILs need to be in on it too, and they need to treat the new wife as part of that blended family by going to her parties just the same.\n\nI can't help but wonder if it's the husband that's trying to push the blended family idea because he isn't ready to let go of his late wife's family. I wonder if his ILs have ever expressed those views to OP's sister themselves.", "I'm pretty sure the baby's father is the grandparents' son.", "all is good. It is payday week and it is not Monday.", "We're also seeing the origin story for the AITA posts where someone grew up resenting the shit out of their half-sibling's bio-family because their parent(s) tell them they should expect equal treatment and then as an adult uses that as justification to be absolutely vile to either the half sibling(s) or their bio-family.", "Your toddler will/has learned that he is wrong and that you are looking after him. OP's sister is entitled and delusional and doesnt realise that the world doesnt owe her or her child jack shit!", "Good analogy.", "I agree with this. It's likely sister didn't imagine \"one big happy family\" meant *me and my child will be spending every foreseeable Christmas with my husband's late wife's family*. \n\nThe situation has changed. While the sister has behaved unreasonably in some aspects, initiating a conversation with her husband about how the arrival of their child changes things wouldn't be unreasonable.", "I don't really see what he's done wrong. He was close to his first wife's family and that hasn't changed with her death. This wasn't a divorce. There's no real reason to create distance. I do understand how uncomfortable it must be for Norah, but no one is a villain in this story.\n\nAlso his first 2 kids are entitled to have their grandparents play a close role in their lives. We can't expect everyone to tiptoe around cause Norah feel like the intruder in the family.", "Her daughter is a newborn, the other kids are teenagers.  I  would think they would be \"excluding\" her even if she was their grandchild.  Teens usually don't want to do \"baby stuff\".  I would wait and see if this was an actual problem when she is older.", "Agreed, that’s a conversation that should’ve happened a long time before they brought a new child into the world.", "\"I know it doesn't *seem* fair Little Norah, but they're not your grandparents. You get gifts from your grandparents and they get gifts from theirs.\" Or maybe \"I know it doesn't *seem* fair Little Norah, but they don't have their mommy anymore so their grandparents like to give them extra stuff to try and make up for it.\"", "100% agreed. It seems like OP’s sister thought she was some exception and could change the situation despite being told it wouldn’t change.", "Omg their stepmother burned all the pics mementos of their dead mother?? My heart just shattered for these poor children 💔", "I’m on here too much; I remember that post.", "no, but from the sounds of it, her husband is still so very much a part of that family. Of course, it’s going to be difficult if your husband and the father of the two children that you live with, and that your parent, are very inertwined with a family and then you have another kid and you and your kid aren't as welcome.", "I am a child of divorce. Both of my parents remarried and both had 4 more children in their second marriage. From eight years old, I was raised in my mothers home. My father's wife HATED me. She was so cruel that in 5th grade I started seeing my father every two to three years.My four younger brothers from mother are my BROTHERS. My father's children are exactly that \"my dad's daughter\" or \"my dad's son\". Even after his wife passed away, her children carried on her bad habits and cruelty. My own son has never met my father. I accepted defeat. Went no contact in 2008 and I have never been more happy in my life. As for my BROTHERS. If they ever needed anything I'd be there. My father and his kids can rot and Id sit back, laugh, and sip that tea.", "Yeah I gotta agree on that second part. No one tried to force anything in my family and my step siblings and half siblings all just get called my brothers and sisters. I'll explain if necessary coz we don't exactly look alike courtesy of the partially or entirely different DNA. But aside from the initial family blending period I've never felt the need to specifically say we r half or step.", "Honestly I don’t understand the people who expect the late wife’s parents to furnish the nursery. My parents and my ILs are damn near best friends. I’d like to think that if something happened to me, my parents would still be part of the big family we’ve all built. But what OPs sister is asking makes no sense to me. The late wife’s parents decorated those nurseries for their grandchildren. The new baby isn’t a grandchild. She might become something close, but that’s not something you can force.", "Yeah i agree, the timing of my mum's pregnancy with youngest sibling was TERRIBLE, but she stuck to her promise not to make me babysit and my stepdad didn't try to be my dad or treat me like i wasn't welcome. They basically minimised the impact it was going to have on me, and i've always adored my little sibling. Don't consider him any less than what my full siblings are to me, and once I was an adult I happily babysat voluntarily. If you try to force anything on a teenager they are going to strike back by doing the opposite with a force so vigorous that literally nothing can break their resolve haha.", "I was thinking kinda the same thing. Wonder if now that the baby is coming, if she will push for less time at the ILs. As the child ages she will push how it is damaging their child as the baby isn't treated the same. The new baby shouldn't be raised to know they will always be second place to the older children.  How that could be interpreted as the father loves them less as well.", "OPs parents will be at the baby’s events.", "But, this is not an ex/step parent situation.  Adrian is STILL their SIL. The 2 older kids are STILL their grandkids, and not only that, along with their relationships with Adrian’s parents and Adrian himself, the only living, changing thing they have left of their DEAD daughter.    \n\n\nNorah and Adrian will have to tell this new baby when they are old enough to understand that their two older siblings have (not had, HAVE) a different mom and different grandparents. It will not and cannot be a secret. Hence, perfect equalness in everything (except you agree not for financial stuff, which I don’t know why you’d draw the line there) is not necessarily *equity*. I just really think that bar is too high in this case, and the kids will all be able to understand because there are also other grandparents for the new baby. Again, I agree they should not be cold, unwelcoming, unkind, or othering to Norah and the new baby, but that doesn’t mean they have to or even could treat them exactly the same.  *Adrian’s* parents should, sure!", "It’s a f’ing shower. The baby will not be aware that they didn’t attend. Stop catastrophizing", "Nope. You can. The baby is part of the large extended family but NOT THEIR GRANDKID. This is a concept.so simple tiny children can and do understand.", "He is not. These are his late wife's parents.", "Sending you love <3 glad things are good", "Nope, families are big. You're not going to close to every member. And she certainly has no right to dictate which members come to large family gatherings, especially when her only issues are entitlement and jealousy", "Wanting children whose mother literally fucking DIED to call someone else Mom is, in fact, being a shitty stepmom.", "If its causing an issue in his marriage then there is a reason! I'm not saying he has to. He could leave if he wants. But both of them have to compromise if they want the marriage to work", "Yes but the new baby does not need to be given gifts by his \"ex\" in-laws, whether it's all one big holiday event or not.", "My mom had to practically beat my older sister off with a broom to stop her waking me as a newborn to play with me. She was a preteen. When I was a teenager, she gave birth to her first born and I was always eager to hold him and shower him with love and attention. You can't generalize teens and infants. Plenty hate them, plenty just don't care, plenty adore them. It's varied. Also, my big sister is technically my half sister. I usually forget that part because we just see each other as sisters. People are varied and relationships are complicated.", ">Her daughter is a newborn\n\nAnd?", "I was going to say this. Glad someone else did. The age gap is big enough that the new baby probably won't have a chance to notice unless the older children stay at home for a prolonged period. Unlikely since Norah will make them want to leave.", "They still aren't required to give anything to the newborn or say that she is their grandchild when she is not.", "That might be a fine explanation at an older age, but not for young children, and it is very likely to affect the family dynamics as Little Norah grows. We don't know how Norah's family treats the other kids, but if they get all of the kids gifts then the issue will be exacerbated and it's no longer \"they have 2 grandparents and you have 2 grandparents\". Any blended family situation is tough. This one has a lot of additional complexity that really needs the involvement of a family therapist.", "of course he is part of their family, his children are their grand children.  If OP's sister can't understand something that simple then she should never have married a widower.", "Yeah I think if there's no pushing or forcing of anything, kids tend to just say \"brother\" or \"sister.\" Technically my kids are half siblings (different dads) but it feels so strange to even type that, let alone say it. My daughter (10) would be LIVID if I called my son (1½) her half sibling. That's her BROTHER. Her stepdad has been in her life and living with us since she was 3; she knows him better than her own bio dad, who calls once a week and sees her on special occasions. The only reason she doesn't call my husband \"dad\" is because she's afraid it'll hurt her bio dad's feelings. But myself, my husband and both kids ARE the \"family.\" She doesn't see her stepdad or her brother as anything but her father and her brother, because I didn't push or force them to interact. I eased them into being close by respecting their feelings and going slow. Now she watches football and plays games with my husband and he and her have little games they play only with each other. And our son is HER BABY lol. You can't force these things. If I had, I doubt she'd be as close to her brother as she is.", "how does he treat your sister?", "Pergaps you need to. She seems to have severe mental health issues", "At the baby’s events. Yeah. But baby will be also spending part of EVERY holiday with the husbands in laws. \n\nI think most commenters here don’t have children or in laws.", "Catastrophizing? lol That’s pretty hyperbolic.", "Is Aiden not the father?\n\n> You can.\n\nYou can't.", "Then mom and baby should stay home. There’s no reason to subject an innocent child being treated differently than their sibling by one big “happy” family.", "Does he know it's an issue?", "What is the compromise here though? He doesn't take his kids to family events with their grandparents? He tells his family they can't be friends with people they've been friends with for years anymore? \nThis woman is trying to have beef with a dead woman, not an ex-wife.", "If you’re at, say, Christmas with the family, then not giving at least a small gift to all in attendance is rude. And if you’re all claiming you’re one big family, then you’re not rude to your SIL‘s new wife and kid.", "They should. My sister is actually my half sister and my grandparents never treated her differently. They always included her in gift giving and everything. She wasn’t excluded at family get togethers, even though there was no blood relation. \n\nIt’s different of course since I never met my sister’s grandparents, who would be more in line with this story. Also her dad is alive, he’s just AH she has no contact with. \n\nI don’t think they should have paid for the nursery though.", "Who has a kid over at Christmas and doesn't give them a gift? That's just cold blooded. The nursery is ridiculous, but not including the child in holiday celebrations is messed up. Poor little bean did no wrong.", "Correct. Where did I suggest they had to?", "That's a perfectly reasonable explanation for anyone old enough to even notice the discrepancy", "Yeah. I think the real problem here is that OP's sister interpreted \"one big happy family\" to mean more than it does.\n\nLike, my grandmother and her best friend from childhood lived within a few blocks of each other their entire life, and we always did holidays together and considered ourselves one big happy family. But there was also an understanding that within that large family unit, there were different levels of priorities. My grandmother always got me and my cousin several gifts and/or one large gift, whereas she only got her friend's grandkids one small gift each -- and vica versa (I only got one small thing from grandma's bestie). Same how my parents got me more than they got my cousin (and vica versa). It's easy enough to understand different levels of priority based on different familial relationships.\n\nNow, if the ILs try to exclude OP's child altogether or don't even get her any gifts ever, not even a small thing to make her feel included, that's another story. But imo it's fine for them to treat her as more distant family rather than as if she's their own grandchild.", "Maybe they will treat the baby more like a grandchild when it’s older but it’s 5 months old. Doesn’t know its head from its ass. They are probably dealing with the fact that this baby is not their bio grandbaby, that their daughter will never have another child etc. They def did not need to supply the whole nursery for a child that wasn’t their daughter’s. Where are OPs parents in all this? And OPs sister chose to have a baby, why does she expect other people to to pay for that decision", "What is hyperbolic is claiming that late wife's parents have to be around for a baby shower for a grandchild that aren't in any way related to. The baby isn't even born yet ffs. What possible bonding can an unborn fetus do?", "But that doesn't mean his wife's parents are related to this baby. Aiden was connected to them through his childhood and marrying their daughter. They have no such connection with his current wife. She was not a childhood friend who married into the family.", "Why? My step grandparents didnt treat me the same. I asked once. When I was 5. It was explained that they were my stwp grandparents. Zero issues. Norah is a nightmare step mom creating an issue where none exists.", "The child is not being treated differently. The child has grandparents. Op wants two people who aren't its grandparents to act as if they are. She needs mental help.", "HALF sibling. And yes, it matters.", "They're not related to the new baby... I can't imagine they're gonna like bully the kid, but they're not in anyway related other than the fact that it's their own grandkids half-sibling.", "it seems like you were, because they all still celebrate together as they always have. They can all belong and chances are In-laws will still do something small for OP's niece just not as extravagant", "But she's not their grandchild. She's the child of the woman who their late daughter's widower replaced her with. So this baby must stir up all kinds of grief for these people.", "Yeah I agree with this completely. You can't have it both ways. If they're family then she and her child should be treated like family. \n\n(I'm from a culture where polygamy is common, and this is absolutely the rule. My \"step\" grandparents would be expected to gift me just as they would their own grandkids. Because its not the kids fault, and you don't want people playing favorites.)", "This is also about how they treat OPs sister though. I actually think the husband is the asshole here. If he wants to stay close to his passed wife's family with her included then he has to step in to make sure she feels valued too", "Were they at every gathering on the other side of the family?", "Yes. It matters to folks that are not really one big happy family.", "They aren’t related to the husband and his parents either.", "Then you didn’t read my comment very well, if that was your takeaway.", "That's entirely the point, She's not part of the\"One Big family\". She's the daughters replacements child that they will never love. That's why mom held out hope they would help with the nursery, if they did it meant they considered her family, but they didn't and don't. Both the Husband and Wife definitely need counseling and probably the kids too.", "I agree with what you’re saying but they’re the ones who insisted on a big happy family, they don’t get to change it up when it’s no longer convenient for them", "I did say in another comment “Not the nursery.”", "You mean for their grandchildren? Why wouldn't they be at those events if they can attend?\n\nYou do understand that Aiden had children with their late daughter, right?", "But they are all related to the husband's oldest children", "They are chosen family. But the new baby? While chosen family is NOT their grandkid."]}