{"id": 27182, "submission_id": "16mjr4m", "title": "AITA for asking my bf to do more chores around the house considering he quit his job and has so much free time?", "selftext": "I F(28) and my BF(M27) have been living together for the last 3 years. For the first year we were just roommates and then we started dating each other. Since we started as roomates we never changed the chores and financal distribution everything is equal.\n\n6 months ago he quit his job as he has investments with returns that cover all of his expenses and more. At first I didn't think anything of it he just called it an early retirement. He is always home playing video games or doing something around the house or going out. Now he does do his portion of the chores but considering he has so much time now, I asked if he can maybe take over a few of my chores. I asked this because lately I am overwhelmed with work and then come home and cook for myself and do some chores. \n\nBut he refused and said \"we have everything split equally now if I couldn't handle my share of the bill I would have definitely compensated that by handling majority if not all the chores. But considering I do contribute equally I don't want to take on more work.\" I tried to argue but to it had no effect. I was really upset and he could feel it because he did come to me and tried to make up but refused to contribute more and is now upset that I am expecting something that he just doesn't want to or even have to do. And that I am being a dick by pushing the subject.\n\n\nEdit 1: I was not able to reply to many comments but thank you all for giving your opinions. Adding a few details which I saw people asking.\n\n1. He is able to retire now because he has been working towards it since he was like 15 or 16. He was very frugal about spending money on himself. Sacrificed almost everything a young person experiences like going out, parties, even friends(he has like 2 to 3) and sleep. His target was to retire at 30 but he got a little lucky(his words).\n\n2. I didn't propose this as a temporary change because. I got worried that he might become lazy. Please note he is not a lazy person by any means. But I thought that not doing anything productive could become detrimental to his well being and it would also lighten my share at work so we can spend even more time. Which I now agree is a bit selfish of me.\n\n3. Many people have also said that he doesn't seem to care about me. And I agree that it may feel that way from the post but he has taken care of me whenever I was ill and if I ask if he could handle things at home for a day or two he does that without any complaints. He just doesn't want to change the whole dynamic.", "created_utc": 1695105979, "permalink": "/r/AmItheAsshole/comments/16mjr4m/aita_for_asking_my_bf_to_do_more_chores_around/", "score": 592, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like an asshole for pushing the subject even though he clearly made himself clear.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "It sounds to me like your BF really wants to stay a room mate with benefits and not a real partner.  I don’t think you are being a “dick”. But I do think you are getting a glimpse of a future life life together. \n\nNAH. But you two really need to learn to work together if you are going to stay together.", "NTA. Relationships are about compromise and supporting your partner. If your partner is struggling you should do all you reasonably can to support them. \n\nInsisting on an even split of responsibilities when you have free time and you can see your partner is having trouble finding any is pretty insensitive and borderline cruel to me.", "NAH, but get out of this relationship. He wants to do early retirement while you're working yourself into an early grave. If he prioritized your time together he would get more chores done and have dinner ready just so you can enjoy yourselves when you get home from work. But he doesn't care about that. You're not compatible. So just get out.", "NTA and I hope you never have kids with him. You'll have to work and still do half the baby chores and 'your'  house chores... run baby girl, this is a fwb situation not a partnership. You'll end up resenting his laziness in the long run.\nIf he actually loved you he would pick up some of the chores so you could spend more time together.", "NTA. I'm sure if roles would be reversed, he would expect you to do more chores. Relationship is teamwork. He doesn't work, but why can't he do more in the house? Even just to help you more out because you work, come home and still has to do chores? If nothing changes, just break up, he clearly doesn't see this as relationship", "NTA for asking, and NTA for feeling hurt by his refusal to renegotiate chores.\n\nHe's allowed to say \"no\" to your request. You're allowed to be upset that your bf is refusing to put some of his time and energy (which he has more of than you at the moment) into helping you when you're overwhelmed.", "NTA. If I was planning an early retirement and had a long term partner that I wanted to spend my future with, I’d be working towards us both being able to retire early cause what’s the point otherwise? At a minimum if I had more free time and they weee struggling with work I’d take over more chore to help take the load off them. Someone else said it perfectly already.  he doesn’t see himself as your long term committed bf, he see you as a room mate with benefits. He may have said otherwise verbally but his actions say it all.", "Being roomates, the chores and costs should be as equal as possible. However, when romantically involved, it should instead be divided fairly. I mean if one earns more, they should put in more to pay the bills. And yhe same should apply for chores. If one has a lot of time where they are not working. They should take a bigger role when it comes to chores.\n\nLike, if someone is a homewife/husband, their work is to take care of the home (kids and house/apartment). \n\nIt should all be considered teamwork!\n\nIf he doesn't want to be ok your team, then he should piss off. You deserve someone better in that case.\n\nNot the AH", "NAH. He can say no to increasing his chores, you can feel under pressure from yours and ask for help from your partner. Maybe you could consider reshuffling the jobs instead to suit your schedules. If you usually cook dinner, maybe he could cook dinner since he’s not rushing home from work and you could take one of his less time sensitive jobs, like maybe the hoovering. If you’ve got no kids, other than cooking, dishes, bins and laundry there shouldn’t be much to create additional pressure. Everything else can wait for days off. It only becomes an asshole situation if nobody is willing to entertain further negotiations to make your lives easier. Maybe you could go in together on a couple hours of a cleaner each week.", "NTA\n\nIdk why, but he's treating the relationship like a transaction, not a romantic partnership", "I think it goes deeper than equity. Okay so he doesn't need an income but he's not doing anything productive, not challenging himself, has no goals, not growing as a person.  If this is a temporary rest, okay, but if he's checked out at 27, plans to spend his life playing video games and hanging out I would think seriously about what you're signing up for.", "NTA, you are a roommate with benefits.  At his age he is not retired.  Investments can go south. Just because he is getting a good return today does not mean he will in a few months. What if he gets sick?  Will he have to sell off a few investments, tape out the returns.  Best if you start looking for your own place.", "Nta but ywbta if you push it.  There's no need for a fight over it.\n\nThat said you would not be the asshole if you broke up over this. It's obvious that you are seen as a casual girlfriend rather than a partner.", "NTA.", "NTA - its normal to take on more if your partner is struggling and you have the free time. he’ll still have a lot of free time if he takes some more time to do some of ‘your’ stuff around the house.", "NTA, find someone who is an equal match in more than earnings.  Your distribution-of-chores system was set up for two working people to share. If you're planning on staying together, it's time to renegotiate.", "NTA/YWBTA (if you pushed it, he's been clear) - He doesn't have to say yes, but I wouldn't want to be in a relationship with someone who was unwilling to help me out if I was feeling overwhelmed. It wouldn't make me feel like they liked or cared about me very much. It's the nice thing to do to help out the people you care about.", "NTA, when myself & my wife worked we shared the chores, there was then a period where I was not working & she was where I took over 90% of the chores, she has since retired & we share the chores again.  \n\n\nI would simply just do half the chores (those that impact you most), see if he complains tell him to do them himself or pay someone to come in & do them", "I'm kinda torn? But your situation is more like a FWB. If he was your boyfriend/partner he wouldn't want to see you this exhausted and overwhelmed. He does not seem to care about your wellbeing as long as you everything is \"divided\". What happens if you guys have kids? \n\nHe is not a kind of partner I personally wanted to spend my future with.\n\nNta", "I'd say he's right in that he's still contributing everything he originally agreed to. You're asking for a favor and he's free to say no. You being upset with him for not being willing to alter the agreement is unfair.\n\nHave you offered something in trade to make up for him taking on more responsibilities? What about hiring a service to do your part of the chores?", "OP, if you approached this as \"I'm stressed at work and honestly overwhelmed, can you please help me out by temporarily taking on more of the housework until this project at work finishes in two weeks?\" you would'd be N T A, but that's not what your post describes. YTA.\n\nAnyone wonder what the average judgement would be if an entitled man wanted his wife that covered half of the expenses to be a proper housewife on top?", "I think we need to take responsibility for our own messes. \n\nI guess my question would be… what are “your chores.”", "NTA, but this is not an equal relationship. You guys are still roommates, not partners.\n\nI don't think he will change his views about you. Maybe hiring a cleaner could work short term, but long term I don't think you guys can make it work", "NTA.. this is the difference between a boyfriend and a partner.  A partner would want to lessen the load and equalize the circumstances. \n\nTime to look ahead to your future", "This right here is why I don't understand couples who don't share finances. If you two stay together long term, what does that look like? He continues to have his retirement while you work a full time job? He gets to have a nice relaxing life while you work a full time job trying to make ends meet? Because if 2 years into a relationship he's unwilling to do any extra work, despite clearly having the time available to easily do so, then its hard to imagine he's suddenly going to change that position further down the line.", "Sounds like you are roommates and not living partners. Sounds very transactional. NTA", "INFO\n\nAre the chores actually split evenly? Does he do half the household work?\n\nBecause he has a point if so. He worked, he saved, he's managed to set himself up for this. You have made different choices. Nothing wrong with asking for a favor but if he says no and is actually pulling his weight financially and with the chores...\n\nThis isn't a stay at home parent thing where he's being supported if that's the case. This is him still pulling his financial weight and his chore weight. Partnered with someone who chose not to do the same kind of saving or didn't have the income. Someone who now wants the benefits of his hard work to bleed over in to their life without having done that work themselves.", "NTA - Sure technically he is contributing half to the household. But relationships aren't built on technicalities, and you should want to help a partner instead of watching them drown.\n\nI don't understand why he can't cook you dinner, he eats too doesn't he? It wouldn't add much for him but would make a big difference to you at the end of a work day. He could also chuck your laundry on during the day, hang it up and leave it to you to iron. Only a little extra for him, still leaves the bulk for you to do, but would make it that bit easier.", "YTA\n\nBecause he has been successful, he has to cover your chores? Hard no. You are not married, you do not have shared finances, and even if you were, he is putting in 50% of the time, money and effort in your relationship so is not obliged to do more. It is a reasonable thing to be supportive to help a loved one through a bad patch. But you aren't ill, this is not a short term situation, what you are suggesting is that he be your domestic help because you don't want to pull your own weight.", "NAH sounds like you're not compatible.\n\nHe found a way to pay his bills and do his half, but I also wouldn't want to be the working partner while my other half is at home all day doing nothing. I like to be in a relationship with someone who works. Sounds like you found out you don't have the same work ethic.\n\nI think I'm being really generous here, but I had the exact same experience in my 20s. I learned from that I need a relationship with someone who also enjoys working. You won't change him and he doesn't think he's doing anything wrong so if it doesn't suit you, you're best off leaving.", "NAH. \n\nYou two opted for an egalitarian relationship where things are 50/50. This worked out but it’s a glimpse in what will happen in the future.\n\nWhat if you get an injury and you’re unable to do chores? Will he help? Or will he be like - you fell down the stairs; it’s your fault? Same goes the other way; if he’s injured will you pick up his chores?\n\nMaybe another solution is to stop doing any unnecessary chores (other than take out your trash, do your laundry) and take a step back while you’re focused on work. Like if you do his laundry- full stop because it’s 50/50. Also are there any chores you can outsource - like instead of shopping somewhere in person, do a grocery pick up to cut back on time. Maybe even skip cooking every night and opt for meal prep or something easy like pick up your own dinner (since he’s so 50/50 about the partnership).", "I've no idea why this one is so divisive. Obviously you're NTA. Contributing to a household is measured in time and effort, not just money. If I was lucky (or privileged) enough to retire early, I wouldn't want to laze around all day while my hypothetical wife got no free time - I'd at the very least take on the housework so that we could enjoy her free time together. This man values playing an extra hour of video games over your wellbeing and quality time with you. Which I think is selfish, but I suppose it's his right. It sounds like you need to be with someone a bit less transactional though, who actually sees the relationship as a partnership.", "You asked, he said no. Your agreement is fair as it is, he is within his rights to say no.", "NAH\n\nYou're allowed to ask, he's allowed to say no. I'd say you would be an asshole if you kept pushing the subject onto him. No is a complete sentence and he is still doing his share of expenses and chores.", "NAH but that man does not like you.", "You are just a roommate he has sex with. NTA", "YTA He made it and should not be punished for success. Solution: get a cleaning lady or whatever and pay for it together.", "well it ks your right to ask, it is not your right to 'push' anything on him. soft YTA, if chores are so bad start looking into a cleaning agency or smthng, do not bother your bf because you think he has it easier.", "ESH. You aren’t an AH for asking; but he’s not the AH for refusing. These are agreed upon terms of your relationship. The level of tit-for-tat is pretty limiting for a relationship going anywhere. You can always insist upon changing the terms. That just may result in finding a new roommate. Which leaves room in your life to find a more generous and loving relationship.", "NTA, but there's a middle ground here. He's probably worried because he thinks you'll dump the household on him and he won't be able to enjoy his well earned time the way he sees fit.\n\nYou should explain that this is temporary because of work or w/e it is and he'll be helping you personally, then things will go back to normal.", "YTA. He sorted his financials - he has chosen how he wants to spend his time. As long as he is not making more work/chores, you haven't got any right to ask for him to take more chores \"just because he's home more\". \n\nThat being said, my judgement is based on your relationship agreement. If you don't want a partner who treats you like this you'll have to make the hard call.", "Is he wealthy enough now that he could support you guys on just his income? If so and he’s not even willing to let you cut down on hours so you could have more time together, he’s not a great person. He just wants his own free time and doesn’t care if you’re miserable.", "INFO: are you willing to pay more of the bills?", "I don’t understand why anyone would be happy to watch their partner struggle and have the “well I’ve got my money” attitude. Yeah sure hes providing money but that’s not a partnership. If you’re in a long term relationship wouldn’t you want to have more time together and a less exhausted spouse? It would 100% breed resentment regardless of the gender. It seems like you’re still just roommates with sex. Your normal day would be work 8hrs, come home, cook clean etc, while he does 1hr chores and nothing the rest of the day. In terms of daily effort yours is 90% to his 10%. You asked if he could maybe pick up a few of yours to ease the pressure and he refuses. You never asked him to take over all of your chores, just to help. \n\nI don’t think this relationship is going to work, he will happily let you do more daily and live his early retirement. He would have to pay someone to do your share if you left and I think he’s quite happy with that. I mean I guess that’s his choice but I wouldn’t be with someone like that, regardless of what money they had. \n\nNTA \n\nIs this the relationship you want to be in? Where you struggle daily but because he provides money (not even more money than you to the household) he doesn’t want to help? He thinks that because he puts equal money that he doesn’t have to provide equal effort. Wouldn’t you rather be with someone that wants you to be happy? To not struggle daily? I just wouldn’t want to live in that kind of imbalance. My husband makes more than me, we both work but if he was able to retire early I know for a fact he would make sure that my working day would be easier as he would be at home, that I would come home to a clean place and if i was really struggling we’d work together to find a solution.", "YTA", "YTA\n\nHe's covering his bills and doing his chores. I'd tell you to go kick rocks. You want me to do more because you still have to work? Okay, $16/hr for doing the extra chores, I'd track it and pay whatever I'm supposed to less that.", "YTA obviously. \n\nWhy are you punishing him for being dilligent and successful.", "YTA\n\nHe is still contributing money equally. Just because he has free time doesn't mean he has to contribute more than you. If you are covering his portion of bills, then he has to take on more chores.", "YTA, if he’s contributing equally as before than he can do whatever he wants.\n\nConsidering his age, I would say he’s very smart if he can live off his investments. Asking him to fo more chores is like punishing a smart man for doing job quickly. Stupid but that happens a lot of time.\n\nBesides, I would rather go back to work than doing extra chores, that would be waste of my tine.", "YTA - his not working is irrelevant, if you need help ask him for help. If he refuses, that’s another issue.", "NTA", "NAH. He isn't objectively an AH since you two agreed on splitting things 50/50, but I personally feel like he is. I wouldn't want a partner that isn't willing to put in the effort I'd put in if they needed help.", "Yta if he cotrubites equally at the moment", "Slight YTA. He covers his bills, and yeah he could help if he wanted, it would be a nice gesture but he DOESN'T have to. Chores are work, and he is doing his part, also paying. I think he is right. It is an earned free time, if he didn't want it he would still be working. Just because he has more time it doesn't mean he has to do more.", "Nope. Make him.", "50/50 guys still expect women to be maids while working its weird. We aren't slaves", "ESH. It would be nice if he wanted to help you but I don’t think he is obligated to do more than his share since he is still paying half the bills. I think it does tell you he is not that invested in the relationship.", "No wayy. Definitely NTA. Why should you even have to ask?!?!", "Why don't you tackle it a different way? What if you ask whether he feels productive?", "NTA tell him to pay for a maid/cleaner/housekeeper out of his “retirement” or you’ll start charging him $$ every time you do a chore.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI F(28) and my BF(M27) have been living together for the last 3 years. For the first year we were just roommates and then we started dating each other. Since we started as roomates we never changed the chores and financal distribution everything is equal.\n\n6 months ago he quit his job as he has investments with returns that cover all of his expenses and more. At first I didn't think anything of it he just called it an early retirement. He is always home playing video games or doing something around the house or going out. Now he does do his portion of the chores but considering he has so much time now, I asked if he can maybe take over a few of my chores. I asked this because lately I am overwhelmed with work and then come home and cook for myself and do some chores. \n\nBut he refused and said \"we have everything split equally now if I couldn't handle my share of the bill I would have definitely compensated that by handling majority if not all the chores. But considering I do contribute equally I don't want to take on more work.\" I tried to argue but to it had no effect. I was really upset and he could feel it because he did come to me and tried to make up but refused to contribute more and is now upset that I am expecting something that he just doesn't want to or even have to do. And that I am being a dick by pushing the subject.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I kinda see both sides, both of your arguments are valid. As partners it would be good if you could help each other and seeing as you work more, it'd be natural for him to take on more housework. On the other hand, you're not a sole breadwinner, he is providing financially as much as you do, just not through typical work, hence he doesn't feel like it'd be fair for him to both share the expenses and do all, or most housework. I mean, normally you'd have one person providing through cash and the other providing through physical work at home, or both sharing.\nNeither of you are assholes, honestly. I don't think there is a definite right or wrong here, you just need to find a compromise that would work for both of you.", "Tell him this. Relationships AREN'T 50/50. That's such a weird thing to say. Sometimes you only have 20-30 in you, and that's ok. It's up to your partner to pick up the extra 20-30 and make the relationship 100%. Same the other way. When your partner is feeling worn and feels they can't hold up their end, you offer to help with the weight. You pick up what they can't and your relationship stays whole. I don't know if I worded it right but yeah...", "Must be nice to be “retired” at age 27. Anyway, he should be doing more around the house", "NTA He certainly is.\n\nThe person who gets to stay home while the other does a job is the one who does the majority of the household work. It's that simple.\n\nNow you get to ask yourself if you want to live with someone who doesn't understand what a partnership is.\n\nYour only two options are:\n\n1. 100% accept he's a lazy jerk and never complain about what a lazy TA he is.\n2. Break up so you can find a person who isn't a lazy TA and will be a full partner.", "yta and it sounds like you resent him for being able to work less. If a man had posted this same situation he would have been eaten alive by this sub.", "NTA. Relationships are meant to be a partnership, not a transaction.", "NAH. This all depends on the term of your request though.\n\nIf it's temporary because you've been overwhelmed with work lately then as a partner / boyfriend, it would be nice of him to help reduce your load at the moment. Have you communicated this with him?\n\nIf you don't communicate this with him then he might think you wanted this forever, which is not fair because the portion will be imbalanced. \n\nRegardless whether he works or not, he will still be contributing financially while doing more chores, which will make him carry 75% of the load, while you only carry 25%. Again though, if it's temporary, it's fine, because that's how a partner should support you when you need it. But if it's forever, you'd be taking advantage of him.\n\nI think you two should talk from heart to heart.", "YTA - if 50/50 was agrees 50/50 it is. If you want to renegotiate tell your BF exactly that.", "YTA, yes he has more money and has more time but he is treating the situation equally.\n\nHe is lucky to be able to avail his time to do what he pleases - I always see people saying that you need to be happy yourself when in a relationship, if he's worked hard to be able to do this then he should be able to\n\nThe tricky part is there's a romantic relationship, his partner will feel aome way should he not come to her aid, it's as simple as her falling and him not helping her up, in my opinion they could get a household helper to eliminate the problem (they can split the bill too, also it's to her main benefit as she is the one struggling)\n\nIf she's feeling lighter afterwards he will sense the change, if not it was just being pawned off on him for so reason\n\nAll solutions should benefit both parties in the relationship, she gets a load off her back and he gets to retain his boundaries which are very important too\n\nHe cares, he tried to apologize and make things right without sacrificing his boundaries which is healthy to show, just my 2 cents...", "YTA your an entitled asshole!  He made better choices financially than you did. He contributes to half. He has a right to relax and enjoy his free time.", "NAH, I'd suggest something like he makes dinner for both of you each day, and you'll pick up one of his chores that can be done on the weekend. That will probably make coming home easier after a long day while still being a fair split of responsibilities.", "YTA, he worked hard and made some investments and now resting. You could have asked him to help you since you are overwhelmed instead of saying that you are not working do these chores that’s not the right way to put it.", "I know a shining red flag when I see one and this is it. First he’s lazy then gaslighted you for being lazy. This is the life you’re signing up for if you don’t run now.", "Agreed NTA\n\nIt’s also not like OP is saying he should do ALL the chores, just a couple extra to help OP who is stressed. A relationship is never 50/50, there is always time one partner needs more support.", "This. Ultimately no partner should be sat down chilling out in the evening while the other works to finish the evening’s chores - dinner/tidy up/children/admin etc. There is work to be done and if both people muck in then it is over much faster. If she has to come home from office work and then start housework, while he has been sat around relaxing then she will ultimately burn out. There is no one way my husband would treat me that way, or vice versa. This guy has no thought for your wellbeing.\nNTA", "Wait so what your saying is he should be a househusband do all the chores cook and everything while still paying half of the bills", "Im hoping you're way too tired to have sex at the end of the day. Maybe that will give him a push,but I actually think you should get the hell out of there. NTA.", "They don't have kids. She just wants him to do everything around the house because she doesn't want to pull her own weight.\n\nThey are both contributing equally to household chores and even financially (considering he probably makes significantly more). Why should he pick up her slack?", "I don't think that's a fair assumption. Nothing in the post or other comments to suggest that. I actually think that OP is jealous that her partner has free time and is financially independent. YTA", "*make her life easier not his", "You just really don’t know. If the man has 5,000,000 sitting in an index fund with an average 4% return (very very reasonable) every year, that’s $200,000 a year, nevertheless the fact that he can reinvest the money into the index fund/save it. You don’t know his financial situation. \n\nIf the man is smart enough to have retired by 28 off of investments, he’s probably smart enough to have a backup plan.", "Omg this ~ I wonder how much she's gonna have to compromise when he ends up without funds.", "You are just going to get downvoted friend...\n\nThe poor 28th GF suddenly can't cook her dinner and do her part of the chores like any normal adult.\n\nCut her some slack and blame the man like everyone else.", "Well, he does not cook at all. He orders takeout. And for laundry we each do our own laundry and I would like to keep it that way.", "Nothing is ever 50% in a relationship and pretending like you can evenly split things is fool hearted. They have been together for 3 years. It’s either time to act like cohesive unit where you both  contribute to commons goals to to your own ability, fairness be damned, or to break up. Frankly if they are going to stay together and marriage is on the table, he should probably keep working so they can both retire. I can’t imagine a life where I get to be retired and do anything I want while my wife is still working full time to pay her half of the bills. That isn’t partnership.", "Yes if I were ever able to retire early, the last thing I would want to do is do more household chores. He didn't retire early so he could take on more chores.", "This post is about the opposite. She wants him to pay at least half and do most of the chores.", "Um they both do the same amount of housework is the point, but she wants him to do more.", "He does his share. How he gets his income is irrelevant. Do you think when one family member retires they should become the house maid?", "He's obviously worked his ass off to be able to afford to quit his job. If you want to call THAT being lazy, sure. Go ahead.\n\nHe's also doing his part of the chores still. If you want to call THAT lazy, sure, go ahead.\n\nHe's also still paying all the bills he's agreed to pay. If you want to look down on him for fulling all his original obligations, sure, go ahead.\n\nI don't think you're going to convince the others though.", "Are you stupid?! He pays 1/2 of bills, does 1/2 chores.  He has passive income. He can do as he pleases. The heck is wrong with you?! Why is he lazy?!  Because he is smarter than you and OP?!", "She didn't ask him to take it on for a week or two while she finished up some work. She asked him to take it on permanently. What's happening here isn't a sudden burst of stress.\n\nIt's more likely to be permanent resentment that he has gotten the ability to retire and she has not.", "Exactly! Insisting a relationship should be 50 50 at all times is basically valuing some distorted sense of fairness over your actual partner's feelings and concerns.", "Realistically with how op presents this do you think there is ever going to be an end to this \"help OP who is stressed\"?  \nOP isnt giving a reason for being stressed suddenly, so I dont see where you get the assumption that this is ever intended to be a temporary arrangement. The way I see it OP is trying to set this relationship up so that OP is always the partner that \"needs more support\". OP wants to be a not equal partner for the sole reason that her bf could afford to have a not equal partner.\n\nThe entire post is just taking about how OPs partner can afford to give more support, but suspiciously the part where OP makes any arguments why there is an actual need for more support and how that support lets her solve the underlying issue that causes a need for more support in the first place are missing entirely, despite being the far more important aspect.", "If she was stressed, she would ask for help. She wanted a permanent change", "No, I didn't say that. But if he valued their time together he should show an interest in making it possible for them to HAVE said time together. But he obviously doesn't have that interest and therefore I ruled they're not compatible.\n\nAlso, in our family we have decided that whoever gets home first is the one who cooks dinner, so we can save time for the whole family. So yes, it seems unnecessairy that OP should have to cook her own meal every night when boyfriend has been at home and could save her that time. I wouldn't have \"lost my head\" if the genders were reversed. It's just common sense IF you prioritize time with your partner. That's a big IF in this case. the boyfriend is all about a 50/50 split and is fine with OP doing housework while he relaxes instead of them doing things together. That's why they're not compatible.", "Typical AITA sexism tbh. Man achieved relative financial freedom and is being villainized for it. Should he take on a larger load of home duties? Yes, if he truly loved his partner then he would take up some. However, it seems to already be 50/50 so why make him do more?", "Every time these kinds of posts come up, people treat it like two roommates. If they’re a couple, and not just roommates, he should want her to have free time also, so they can spend more time together.", "Because **the only currency we can't make more of is time.**\n\nThus it follows that equity is that each person gets the same amount of **free time, not each person does 5 tasks.**", "If she has more free time and feels less stressed, they get more quality time together so it benefits everyone. Couples are a partnership. They help each other out. If one partner doesn't work it makes sense for them to take on more household duties.", "Having a happy partner who isn’t drowning makes everyone’s life easier. If it was me, I’d see what portion of my earnings I could give up to take maybe two jobs per week off my list and ask if he would be willing to do the same, removing 4 from the total. Then discuss how the rest are assigned fairly based on schedules. Not necessarily giving anyone more work.", "Why do you assume he's going to end up without funds..? Retiring at that age means he probably understands his finances and actually has a plan.", "You are roommates with benefits. Nothing else, nothing more. Run.", "Lmao, some people cant even read", "Because he’s not working at all and she is overwhelmed. \n\nIdk about you, but if I had no other commitments and my partner was feeling like they couldn’t keep up with everything in their life, I would be more than happy to take some things off their load!", "Equity means each person gets the same amount of **free time,** not each person does 5 tasks.\n\nAlso, each person contributes financially according to their means, not default 50/50.", "What's your definition of the difference between a roommate and a boyfriend?", "She's at a job and he's playing video games. Person who gets to not go to a job needs to do the vast majority of chores.", "At this point, you’re just embarrassing yourself because you clearly don’t know how relationships work😂 if you have a mindset like this, you don’t deserve to have a partner. There’s a difference between a boyfriend or a partner and a roommate. And seriously if you don’t know what to expect in a relationship, please just stay single.", "> he worked his ass off\n\nDid he? Retired at 27? I have a hard time believing that this is due to hard work - sounds like a trust fund baby to me.", "It doesn't really sound like she is struggling that much. She seems to resent him for being able to retire so early. Sounds like he made some good financial decisions, worked hard, and is living his best life.\n\nNow if she's putting in 60 hour weeks, working long ass days, struggling to do anything then sure he should be a good partner and help out more.\n\nBut it sounds like she wants him to just do more then her because he isn't working right now, even though he is likely much further ahead financially and is contributing his portion.", "But you did said that you edited your original comment to make your self look better but originally you said he should the have chores done and food on the table so she can come home and relax not so they can “spend time together” your disguising it’s as that but that not what your originally said \n\nAnd either way it’s not like basic chores take hours most day to day chores take 30 minutes to an hour they have all the time in the world to spend time together\n\nAnd let’s say we want this situation to be equal just like he have more time and have the ability to do more \n\nthat would mean she take on a part more of the rent and bills because she has more income coming in regularly than he does", "Which completely discounts the countless hours he spent building his life to even get to this point. He just worked so efficiently and invested correctly that he has the ability to coast off of his own hard work.\n\nThey aren't married, and they don't have kids. Daily chores take minimal time for one person.", "It is purely supposition on my part, but even investing through CDs can be risky, especially when we've only just crested the peak of a world wide period of record inflation.", "But he hasn’t retired to become a househusband and if he wasn’t there she would have to do it all after work. \n\nI can kind of see both sides here really. \n\nAnd if she wasn’t there he would have to do it all.\n\nBut both of them would have less to do.", "I don't think that's what it is happening though (without further clarification from op).\n\nShe just seems resentful that he has more freedom and money tbh.", "If she's overwhelmed she should hire some help, not drop her tasks on her partner. \n\nEvery chore distribution in this sub makes me wonder how does the sub think that single people working full time, doing all the household chores and feeding themselves survive.", "Whatever!!!", "If the genders were reversed I would guarantee you'd be singing a different tune and call OP an asshole. In fact, I remember there was a similar post with the genders reveres and OP WAS CALLED an asshole.\n\nYou're just a sexist, hypocritical prick.", "That's why equity is evil. It's exploitative.\n\nAnyone who has spent time around, had to live life with, a massive screwup understands this on some level. Equity is what leeches want.", "So if I set a goal, bust my ass working overtime constantly, saving money, having no fun for a decade and retire early to enjoy unlimited free time, my partner gets to demand that I do all the chores because they are a beneficiary of my circumstances that I worked hard for?", "How does a relationship work? Man expected to do everything while the woman makes herself look pretty?\n\nIn this post the man does equal share of chores AND has done so well they are financially set for life by the age of 27.\n\nSo you want him to then become a maid too?", "13 years married, ex husband is still my best friend, now in a happily commited long term relationship with stepson included, but you're welcome to make some more assumptions about me.", "No I didn't say that either, but I elaborated my reasoning to make my verdict more clear since you apparantly misunderstood me. But yes, having food on the table for the one that coming home late is just caring for your partner. They could then do their part by washing up after dinner or cooking on their days off. Why is it so horrible for you that the one who gets home first from work (or is home during the day) prepare dinner?\n\n>And either way it’s not like basic chores take hours most day to day chores take 30 minutes to an hour they have all the time in the world to spend time together\n\nYet her boyfriend wasn't willing to do a little extra for OP when she asked because she felt overwhelmed. The boyfriend would still have most of the day to do anything he felt like.\n\nBut they don't see eye to eye on this, she asked for help, he rejected her. She should consider what that means in the future if they continue this relationship. That's why I declared NAH. They're just not compatible in my opinion.\n\nEdited: fixed typo", "Right, if they take minimal time, why can't he pick it up then? He'll still have plenty of free time, opposed to the person who is actually working. It doesn't matter how much effort he put in the past. This is a partnership, he should want her to be happy.\n\nWhen I was about fifteen, I picked up cooking for my mother so she could have free time after work. Because I didn't like seeing her suffer. I couldn't imagine not doing the same for my partner.", "&#x200B;\n\nSo basically, \"because I have more money, I deserve more free time. Because you are poorer than me, you have to work more hours on top of what you already work because you have to make up for/ as punishment for being poor\".\n\nDoes this sound like a reasonable mindset to you?", "Assuming he worked for it and isn’t just a rich kid with daddy’s money is very bold", "Except, assuming it's invested in standard index funds, the long-term average throughout the past 100+ years has been around 7%. Typically, people will withdraw 3-4% and the likelihood of ever running out of money is rather low.\n\nIf you retire early and run out of money then it's usually because you didn't plan properly, not some highly unlikely catastrophic event.\n\n(None of this is a judgement on who's the AH, just clarifying that he's likely fine financially).", "Yeah, again, I guess I just see it as him wanting to offer a small portion of his newly found free time to help his partner out.\n\nHe’s obviously not obligated to and I guess I get why he doesn’t want to, but i just don’t relate to his perspective at all", "I'm sorry, but a 27-yo is not retired. He's just unemployed but has investments to support his life.", "But she does a job and he doesn't, he has the time to run the household and should.", "A relationship is not always 50-50. In some days, another person needs more support from the other. Yes, he has more freedom cause he doesnt need to work 9-5 but that’s the whole point of the relationship. Seems to me he’s fine as long as he has convenience and even though his partner is struggling, he won’t give more because he is already good to go. \n\nIf your mindset is like this, please do all of us a favor and just be single, since you’re acting like it anyway. Seriously it’s embarrassing how these people think it’s okay. Goes to show how you act as a “partner” (sarcastically speaking because I can’t call this a partner at all😂)", "Eh I read it more like he is still paying his share so he has no obligation to do anything more. And while that may be true, I think it’s unfortunate that he’s gained all this free time and won’t even consider allotting a small portion of that to make things a bit easier on OP", "No, she seems like she wants their relationship to be a true partnership instead of just a roommate relationship. It's obvious that he doesn't know what a true partnership is. It's just as obvious that you don't either.", "She’s not dropping them on him, she’s asking for help! And he has nothing else he needs to do! It’s not like he’s busy with doctors appointments because an illness took him away from work. \n\nIdk maybe it’s just because I would be happy to help my partner if I had essentially unlimited free time and they were struggling to stay above water.  But I think it’s a really reasonable ask for help", "Bro please tell me you’re single.", "Can you link the post?", "Not at all! I’m a lesbian so I find all that gendered bullshit pretty silly. My girlfriend and I are 100% equal in our relationship. When she picked up more hours, I did more for us. When she went part time, she picked up some of my stuff. \n\nWhen you’re in a partnership you have to work together. There will be times that each partner is unable to give 100% for whatever reason and will need the other person to help them a bit. It’s totally natural and normal to have an ebb and flow to help accommodate the hard things life", "Good, invite me to your divorce party.", "It’s already 50/50. Not sure what she’s being punished for. You’re saying she should rather be “rewarded” (the converse) for him being financially free?\n\nFor the record, I do agree that the BF should help. But how OP approached this comes from a place of resent and not a need for help", "I genuinely relate to both. If I was in a position to be lucky enough not to work, but then my live in bf/gf expected me to become the unpaid house keeper, Id be a bit pissed off. \n\nBut if I had a bf/gf living with me who was rich enough not to work and then I came home to housework after they’ve been there all day, Id be a bit pissed off 😆\n\nCan they both pay towards someone coming in doing a couple afternoons a week for the deep cleaning stuff and in the meantime just keep on top of laundry and dishes between them both?\n\nIts not like she is supporting him, and they have no kids, so really she isn’t entitled to him doing it all because he has more money than her. \n\nThis is a tough one!", "I guess got me it’s a question of “for how long.”\n\nOP’s partner is contributing equally financially. He made a bunch of money on his investments and wants to chill. OP thinks he should take over the majority of the housework *and* contribute equally to the bills. That might be okay short-term and would certainly be a kindness from the partner and I can’t imagine not wanting to do it for mine. But it’s not fair long-term and I’d want some guardrails/parameters. What if he goes back to work? Is OP gonna say “okay” and go back to 50/50 chores or will she be miffed about it because he doesn’t need to work and she does or something?", "If you win the lottery and quit work, you aren’t unemployed, you are rich. Unemployed might technically be true, but the term isn’t meant for describing someone who has no need to work.", "A great neighbour of mine (who has now passed away; lovely man) once shared that him and his wife would share their “fuel tank” when they arrived home. If someone happened to be 30%, while the other was 60%, then the one with 60% would do a little more to support the other. If both happened to say they were at 10%, then they would sit down together and work out what their priorities for that night and focused on those things. They were a lovely and happy couple", "Ahhh, nice. The reddit character attacks because I don't have enough context about OP and am not hating on him more.\n\nPersonally, If my partner was actually overwhelmed, I would and I have gone out of my way to do extra for them and pull more weight in the relationship for the time being. That way we can start to address the actual problem of them being overwhelmed at work and fix that piece.\n\nBut IMO there isn't enough context here so I'm not gonna just rip on him. plus they aren't married and don't have kids so commitment just isn't there it seems like. If she isn't happy with the arrangement that worked for the last 3 years and wants something that benefits her more and he is happy as is, then she should leave so they can both be happy.", "Nah. Either works just fine for some people. Sounds like it worked for a while and now she wants more. That's fine. And it's fine for him to not want that.\n\nMissing a ton of context IMO as well as this situation is likely very nuanced.", "Asking for help means that the help might not come..\n\nPart of respect in the relationship is knowing that you can be told NO. It's not his \"obligation\" to do it just coz she asked. The only reason her chores are so hard to do now is coz she feels \"jealous\" (maybe not the right word) that he has it so easy now... but his investments let him do that\n\n.. let her hire help or ask him to help with hiring...not the actual chores just so she feels better about his life being way easier", "Maybe it's because my own partner is preparing his retirement paperwork today and he intends to get another job, but if he didn't I wouldn't ask him to become my maid because he has worked hard and sacrificed a lot to be able to retire at 40. When I think about it it would feel extremely entitled on my part.", "I'm not a bro and no, I am not single. And as I said in another comment, if anyone is going to retire early in my relationship while the other works it's my partner.", "If you could read you'd know it already happened. My ex and I went to drink champagne together and exchange Christmas gifts and had a lot of fun, thank you very much.", "get help, Four\\_beastlings", "Yeah I can totally agree with that! She should be clear about what she needs and how long she needs it. Even if she just agrees to reevaluate it after three months or every month or whatever. \n\nHe’s probably very excited for his rest period and I want him to get it! I think it’s hard because he’s contributing financially but not actively doing any work, but he shouldn’t be punished for being smart and successful!", "This is what my husband and I have been working on as new parents. And just giving ourselves and each other grace to sometimes let things slide if we both just don’t have it", "Certainly not becoming the maid! But I think maybe taking two or three chores off of OPs schedule could be nice, and not even permanently, just until OP feels a bit more stable again", "Then I pity your partner whoever that is. When the hardship comes and you think this way, good luck to that person and I hope that person knows he/she deserves more💟", "Yeah like I think immediately asking him to do more around the house when he JUST stopped working was the wrong move by OP. If he wants to laze about for a couple months and not change the split while he’s resting and taking a break, that’s fine.  If I could coast on my investments, I’d be annoyed about my partner asking me to take on most of the housework (and I’d bitch and moan about it because I hate housework). At the same time though, I want my partner to be happy so I would absolutely look at ways that we could both benefit - like…do I make enough that I can cover more of the bills and my partner can work less? Can we recalibrate finances and pay for a laundry service or cleaning crew? There are a lot of other creative ways to tackle the issue at hand. OP’s partner isn’t an AH for saying no, but I also don’t think he’s a great partner because he doesn’t seem to care that OP is burning out.\n\nETA: WHOOPS I TOTALLY MISREAD. It’s been six months. Idk how I missed that on my first read and thought it had been a couple. Yikes. I def feel bad for OP. He still isn’t obligated and I’m not sure he’s an AH for not wanting to do more housework but he for sure sucks for not trying to do literally anything for OP.", "My kids are all out of the house now, but that is one lesson it is good to figure out early on!", "Two or three chores is almost all my half of chores, and we have a child part time. Does OP live in a 10 bedroom mansion? \n\nNothing in her post indicates that this is temporary, and it coincidentally happened when she saw her boyfriend at home all day. To me her post sounds like she intends to offload part of her house work on him permanently.", "What hardship exactly? Is OP ill? What's keeping OP from carrying on with her adult responsibilities that we all have? Because from my point of view her \"being overwhelmed\" coincidentally at the same time her partner retires looks very much like her wanting to take advantage of him.", "Two or three chores is half your chores?! That’s insane to me lol. I live alone without children, and I can think of probably 20 tasks/chores that I do to keep my place tidy and clean. \n\nNow some chores only happen once every two weeks while others are a daily maintenance thing. For example having him take over simple things like wiping down the tables, being in charge of getting rid of old food in the fridge, and cleaning the sheets on the bed would probably add a few hours of extra labor every week at a maximum. And hey, he could do the two other tasks while he waits for the laundry. \n\nObviously that’s a fake example but I think there’s very menial tasks that could help OP a lot without putting a giant burden on the new retiree", "I can see both sides of this. He feels like he put in his work and has earned this early retirement.  But in a long-term committed relationship you need to look at it from other perspective of, \"If our roles were reversed, what would feel fair to me?  What would make me feel loved?\"\n\nStrictly speaking, the current arrangement is fair. However, I feel like it is profoundly unloving to your partner to watch them burn out, struggle and drown while you spend the entire day playing video games and chilling, and have no impulse to try to give up even a couple minutes of your 24 free hours a day to help them.\n\nFair also means that both people are getting needs met in the relationship as far as is reasonably possible. I think that it indicates some relationship red flags that he's more concerned with 100% fairness than he is with OP's struggle. \n\n (Besides that, if he picks up a couple of extra things during the day, the two of them will be able to spend more quality time together at night/weekends. So it's not 100% pure benefit for OP with nothing for the boyfriend. If he wants a fun girlfriend with time and energy to do fun things, he should probably help her a little bit.)", "NTA. I have a feeling that his “investments” aren’t enough to cover the rent of his own apartment. Tell him that since he can’t afford to not work without your half of the rent that if he doesn’t start using his free time to do the chores you will move out and then he will have no choice but to go back to work to be able to afford to rent his own place or be roommates with strangers who could steal from him and invite bad people over. He wouldn’t be able to enjoy the level of comfort he has now without your contributions and you should make sure he knows it.", "NTA To me it seems like the bf has a very transactional understanding of the relationship. Why wouldn‘t he support his partner, when he has the time and resources to do so?", "NTA I don’t care whether he is able to survive on his investment returns, if my partner was sitting on their ass all day while I worked I’d be pretty pissed. You’ve been living together for 3 years and there’s no reason he can’t do things to make you have more quality time when you get home from work. \n\nAlso if you’re in a partnership you should want your partner to struggle less, do you really want to stay with someone who has the funds to make both your lives easier but would rather not? I’m not saying he has to financially fund you but if he has the means and time he should step up. It doesn’t take 8 hours to do housework and cook for two people.", "Nta for asking. Honestly I’d consider if this is what you want in a life partner. The idea of equally splitting everything works if you are roommates but if you are life partners then I think you make more of a commitment and pitch in more when you can, which the idea that eventually the situations may be different and you then would do more around the house when he has to work more or something like that. It sounds like right now you are just roommates who fuck which is fine if that’s what you want. But if you ever want to have kids I’d be really wary of his attitude because I can tell you right now you are going to get the short straw in any ‘equal’ equation of his.", "NTA, he just feels like since he's retired he can kick back.\n\nBut if he's not working he should do more around the house, also post some of those investments sheesh.", "What he is saying is.  \n\nI’m happy to watch my partner struggle.\n\nIs that what you want?", "NTA, whether he’s contributing evenly financially or not her no longer contributing evenly when it comes to effort. I’m assuming you are working a 9 to 5, but how much “work” time is he putting in. Obviously it wouldn’t be the same as a 9 to 5, but just cause he’s paying his fair share of bills does NOT means he’s “paying his fair share” of effort", "NTA   \nIf someone is home all day then they do more chores. If he is so well off he can retire before 30, he should hire someone. Making someone work all day and then do chores so you can play video games? Lol...that's not partner material.", "Someone who truly cared about you would offer to help when they see that you’re overwhelmed.", "I'm gonna say NTA here honestly. Relationships cannot always be 50/50, that's just how it goes. If one person is struggling, the other should be there to help pick up the slack. He's watching you work non-stop and doesn't care that you're exhausted and stressed. You have completely separate finances, cook and eat separately, and have hard lines about chores? That's not a partnership or even friendship, you're roommates with benefits. Partners support each other.\n\nWhat's going to happen if you marry or have kids with this man? Are you still going to do everything completely separately? Statistically, he's not going to pay 50/50 for those kids because moms statistically pay not just larger percentage of their income but a larger total dollar amount towards kids and household expenses than dads do. Is he going to do 50% of the parenting? It's statistically unlikely that he will, moms are the primary caretaker in the majority of families.\n\nWhat if his income goes up (cuz that's usually what happens with investments) and he wants to have a more expensive lifestyle? Will he still expect you to cover half?\n\nIf he's not willing to do something like pick up a couple more chores when you're stressed out when he does nothing all day, then he's not going to be willing to help you in other areas either.", "NAH. It sounds to me like your lifestyles are just incompatible. It's fair that he contributes to bills and does his share of the chores. It also makes sense that you see him having loads of free time while you're overwhelmed and want him to help you more.\n\nIt seems like he is not looking at you two as a unit, while you are. Some couples split everything, some merge everything, and some have a middle ground. There is no right or wrong here.\n\nYou should sit him down and explain that you want a partner who is willing to help out when you are overwhelmed, and that you are willing to help out when he is overwhelmed in return. Just know in advance that he is unlikely to take kindly to that situation. It sounds like he has set up his life a very certain way and is unwilling to change it.\n\nBest of luck!", "Not even trying to give a single f@(k. No concern for how you are feeling or any willingness to even temporarily do you any favors. That is not love, he wasn’t even willing to pay lip service and try to half ass it. Like do just the bare minimum extra and hope that would be enough to help you out, do something, anything……wow, not even for one day!", "You are not an A-hole, but neither is he.\n\nHe is sticking to the terms of the contract. \n\nHe is showing you in bold relief, that he will never go out of his way, or inconvenienced himself for you. \n\nDO NOT MARRY THIS MAN!\n\nIn marriage, each side gives 100%, imagine yourself sick or pregnant and having to rely on this child \n\nStart looking", "NAH.\n\nI understand your frustration,  but he isn't wrong either. If he is still contributing equally, then he isn't obligated to pick up the slack, so to speak. However, he's not your roommate. He's your bf. He should want to help you out.\n\nAlso, you come home and cook for yourself? Why are you two eating separately? Is he cooking for himself? That's a weird scenario..", "Probably going to get down voted for this and it's probably going to be an unpopular opinion with people who are salty. \n\nHe worked hard, saved money and sacrificed which meant he could retire really early. That's incredible and fair play to him. \n\nHe's now trying to cash in and enjoy it, why should he take on extra and basically be penalised for doing what most of us only dream of? \n\nIf he hadn't worked so hard and got to where he is and was still working a full time job you wouldn't expect him to take on extra.", "NAH\n\nVery simple answer, you're together and were happy with the split of everything.\n\nHes been more frugal, given up more at a younger age and retired earlier then you, because you enjoyed things he did not at those ages.\n\nHappy before but now not? You asked, he answered.\n\nAccept it or leave.\n\nBut answer this before you go, those SAME chores will still be there when you're single, so do you give up him because you need more from him and realize you still have the same responsibilities after he's gone?\n\nOR \n\nDo you get over your jealousy of his retirement and realize nothing has changed except how he spends his time?\n\nNo one was hurt, no one had a catastrophic event?\n\nHis retirement should be HAPPY not your chance to do less and make him do more.\n\nUnless there is a drastic change in mis mood, behavior, attitude? Hes finding himself, trying to enjoy the things he didn't do before, that you did.\n\nLeave him alone with he needs to do more or just leave him and do it all yourself anyways.", "Pre-edit: NAH. I mean, it would be great if he helped more because he had more time, but...if he's providing as much, or more, financially and doing the same share he was before (and helping when you ask,) then there's not much of a problem.\n\n&#x200B;\n\nPost-edit though: YTA. \"I got worried that he might become lazy!\" Oh, fuck off with that. He worked his ass off to go into early retirement. You don't get to stroll in and do that dumb shit of \"well, you're becoming lazy! DO MORE!\" You even said he does things around the house, goes out, and plays video games...which means he isn't just playing video games. He's doing shit. As time goes on, he may pick up more, he may not. But if you feel like it's too much, and you don't feel like it's working...then break up.", "You can’t change the rules just cause he’s smart w money. I’m thinking he’s right", "In keeping with this subs views. \n\nYTA for financially manipulating your partner. Leave them be. \n\nOh…. Wait. This is about a man being a lazy ass. Okay. In that case NTA get your bag Queen. Dump that loser. He’s a mooch.", "It is a relationship, not a stranger You share a house with. If You are overwhelmed he should pitch in and viceversa. Start thinking ir You want a relationship like this", "NTA You are realizing that you're not partners, just roommates. Partners help each other because they can, not because they must. Roommates share expenses and get on with their lives. If someone falls behind, they're replaced.", "YTA...\nIt just sounds like the OP is jealous of her BF's free time and success..\nAnyways these feminists always feel entitled to more and more these days without actually achieving anything...", "“Early retirement” at 27. Wait until it dries up and you’re dating a slob who you have to provide for", "NAH, and that's simply because you guys are in a relationship and should communicate as a team. Other than that, dude does his his share of the chores and deservedly living his life. Congrats to him on an early retirement!", "Don’t procreate with lazy and selfish.", "Some of you make me laugh. How much work cam  there be to do? He's obviously still doing his. No mention of kids or pets. Typical shit right here, he's home so she figures she knows best how his time can be utilized.  She'd rather come home and do nothing, this is on OP. YTA", "It sounds like you're more roommates that are dating then two people in a relationship cohabitating and being partners together. \n\nIt's okay that he makes money and doesn't need to work it's not his responsibility to do your part of things as your roommate. As your partner in life though, he should recognize that you need support right now and when you're expressing it, it makes me question why he is not open to that. \n\nI would definitely try and talk to him about how he views that type of partnership long-term if he intends to not work and still have all of the household upkeep split 50/50. \n\nIf there's no other reason for you guys to break up have you considered just getting a housekeeper?", "NTA\n\nSomething I read recently said that in a relationship you should try to think about having equal rest time (or at least equal opportunity for rest), whatever rest means to you. It sounds like right now that is very unequal. You could try framing it to your bf like that.", "NTA.\n\nYour BF needs to grow up and understand that your time is different to money.\n\nSorry for the below rant but, this issue resonates with me.\n\nMy(30m) income is significantly higher than my (29f) wife's. I have often worked multiple jobs to achieve this over the course of our relationship and she often worked less and did the majority  of our housework. However, in recent years my work hours decreased from 60hrs to 30hrs per week and my income increased dramatically. My wife also received multiple promotions in recent years and now works more hours than I do. So, while I work less I am still the main \"bread winner\". Despite her having the lower income, she is working more and much harder than I do so, I handle all of the weekly housework and yardwork because, I'm not a child. I love my wife and while I can't help ease her workload beyond advice and support, I will do everything I can to maximise her rest time at home and make her life easier.\nShe will clean small amounts here and there but when it comes to bathrooms, kitchen, vacuuming, mowing and other larger weekly tasks, I handle it.\n\nYour BF maybe needs a lesson in understanding that contributions to the house are not a single category. Finances and time are different. While often they impact each other, they do not always.\nIt's also important to learn that relationships are always a give and take and situations are never truly equal consistently. Someone will always have a greater need than someone else which, is why give and take is essential. That's how you can be a good partner. Sometimes their needs come before your own for you to succeed at a task or goal.\nI had to learn this all too as I grew up. I'm just lucky I had a patient partner who pushes through her fear of difficult conversations and we can openly discuss issues like this.", "Some of tall don't have a concept of a rising tide raises all ships", "He's the A-hole, not you. If he has more free time than you now it shouldn't be a problem. You are working day in and day out whilst he sits around after doing his half of the chores. If you were married and had children, he'd more than likely expect you to do more, dinner, looking after the children, etc. I'd say it's time to look into your future and leave him and his needs behind you", "NTA and it’s seriously concerning that he’s happy to make you work harder than him in every way.", "NAH in that both positions are technically reasonable. However, the relationships that work best tend to be ones built on compromise and mutual support over technicalities. If he sees you being overwhelmed knowing he could help without overwhelming himself and doesn’t because he’s technically contributing equally, he’s not being a great partner. Not quite TA for that alone, but it’s certainly not a trait I would want for a long term partner either.", "NAH - this isn't a partnership, sounds like you two are just FWB", "NTA. He has considerably more free time so it won’t hurt him to help a bit more.\n\nIf he wants everything split 50/50, why isn’t the free time? If he has enough to make one person comfortable for life you could both work part-time and both have time for hobbies as well as housework.", "50/50 is rarely fair in a relationship.\n\nIf you choose to split finances 50/50, and it works for you, then that’s great. But finances should have no bearing on the split of chores. If you’re working full time and he’s home all day, why wouldn’t he have a larger portion? \n\nTo add a slightly dramatic comparison; Would it be fair for a millionaire to split the bills 50/50 with their homeless partner? (In this scenario, money=time.) If one partner has way more money (time), and can afford to support the other, why would they expect their broke (busy) partner to spend the same amount of money? would it not be more fair for the broke partner to pay what they can afford in relation to their earnings, and the rich partner do the same?\n\nIf he has more time to spend, and you have less, why would you both spend the same amount?\n\nI’m not sure if that made any sense, it’s 1am and I can’t sleep, but I’m sure you get what I’m trying to say.", "NTA. My husband often ends up doing more chores because he gets off work early - but we split bills evenly. He's just there more, so he handles more. But I've had days where I get home early and throw myself into some chores during that spare time too. As for a dinner, whoever gets home first generally starts it. It's not a person specific chore. \n\nI'm usually in favor of equality - the person who pays less should contribute more in a different way, etc. However the couple works it out. So if he's covering his half then fair enough. But you're feeling overwhelmed and asking for help, so he should offer to help. That said, I don't think you are entitled to him doing more just because he has more free time. He invested in such a way as to get to this point and is carrying his own weight here. So it needs to be an ask, not a demand. \n\nYour bf seems more like a roommate with benefits than an actual partner.", "\"I asked if maybe he could take over a few of my chores\"\n\nI've been confused af reading through all these comments saying \"she's demanding he become a HOUSEMAID\" and \"now he has to do ALL of her CHORES?!\" Like...did I miss something?? But no, it's just people making shit up. Anything is possible when you lie. Reddit is like the official hub for misogyny 😅", "NTA.  Working full-time is exhausting and I can see how him having the benefit of sitting on his ass all day would harbor resentment.  Even though he covers his financial share and does chores, you're working harder.  I would however caution you against remaining in this relationship.  He's already clearly said he has no intention of being in a partnership with you and that's not going to change, regardless of the circumstances.", "INFO:  What exactly is overwhelming?  Also, once things are back to normal for you, will you take back the chores that are yours that he is doing for you?  \n\n***lately*** *I am overwhelmed with work*\n\nIt honestly sounds like you are a little jealous at this point.  He has done well for himself and has **EARNED** his free time.  Just because he has done that does not mean that you are entitled to get him to do your share of the work.  That's not how this works.  I honestly question you being overwhelmed instead of just being jealous.  Nothing has changed.", "NTA - Your BF is really acting more like a room mate. As long as a FWB relationship is what you want long term, stick with him. But otherwise this is not any kind of a partnership / sharing relationship. Time to move on to a better BF.", "YTA.  Just because he is able to stay at home, after investing wisely, you think he should do more of the housework.  NO!  You're just jealous he has more free time than you.  If you were the one able to stay at home and not work, you wouldn't like it if he wanted you to do more chores.", "to me this sounds like the equality we women have been begging for, not sure what's the big deal.", "He is correct.", "NTA. He is seeing himself as a roommate with benefits ( intimacy mainly ) if he thinks it's ok to watch you burn out while playing on his computer then I would seriously be reconsidering this arrangement.", "YTA.\n\nYou don't own his time. If he doesn't need to work, good for him.\n\nI wouldn't stop working and then do more housework. Yuck.\n\nI can get being jealous that he doesn't need to work...but you need to manage those feelings.", "ESH. If you retired before him, would you want your retirement to be more chores? Yall need to communicate better. The whole equal contribution thing still stands if he contributes his equal share financially. You shouldn't expect to get less work because he saved and retired. Retirement isn't \"quitting\" if the money is still coming in at the same rate.\n\nIf you're overwhelmed, he should pitch in. But if you just want him to do more chores because he is doing nothing, that really isn't fair considering how he got to the point of doing nothing.\n\nIt sounds like you need to hash this out now before you go any further.", "Slight YTA, but I understand where you are coming from. It’s a common conflict among partners where one has an evenly distributed work load and the other not.\n\nIf you didn’t pick up more chores while your partner put more time into learning investments and earning money, it’s not ok to demand that he is doing more chores now. ( But asking is of course fine and if it’s just temporary it would be nice from your partner to help out )\n\nAlso if his investments go wrong and he needs to work more than you to reearn them, would you offer to do more than your half?\n\nSomeone I know „solved“ this conflict by renting themselves an office where they go everyday, still do nothing, but somehow their partner accepts that better.", "YTA for even suggesting something that ridiculous. His free time is his free time, period.  The idea that he should do your half of the chores simply because he made better financial decisions than you, or is in a better financial position than you, is asinine. Unless you plan on picking up more of the bills to make up for him taking on more of the housework that is. Otherwise you just sound jealous and entitled. Don't be surprised when he decides this relationship isn't for him if you keep pushing this nonsense.", "NTA.\nI work from home and my fiancé can't for practical reasons. We work the same hours but she her office is half an hour away. That means she spends 5h commuting a week while I stay at home. It's only normal that I would do more chores while she's literally walking to and from work.\nIt's not about sharing the chores equally, it's about sharing the time we can't have for ourselves. It's just common sense.", "No mom, it’s the weekend. I’m not gonna do homework on the weekend, that’s my only free time! \n\nNTA.", "ESH", "NAH, you can ask, he can say no.\n\nI don't understand people calling him an AH, it sounds as if you both contribute equally at the minute, which seems like a fair deal to me. If you were living alone you'd have 100% of the chores and 100% of the financial responsibility.\n\nIf you treat his income as his job then it makes more sense. Its not his fault his income is gained easier than yours and he shouldnt have to be punished for it 🤷‍♂️", "By the title alone YNTA", "If he's doing all his stuff he absolutely doesn't need to help you at all, his bills are covered and his chores are done, it can be worse! Now if it were me I'd have no real issue pitching in to help you out but I see his point he's hitting all his marks, and he's not putting any extra stress on you truth is your being lazy by not doing your share, the point of work is to bring in funds so what he does is irrelevant.\n\nAs I said it would be nice if he would help and but he doesn't have to, pushing on him that he's chilling so he can do stuff is wrong is his time and he should give it up freely, not by some made up rule.", "I'm torn on this one as to me. It isn't obvious.  If your boyfriend has extra time and freedom, it would be natural for him to do *some* extra without it being a big deal.  \n\nHowever, up until now, bills and chores have been 50/50.  His good fortune, smart planning, extra work, or whatever to get him here should benefit him, and you sound a little resentful.  He is still doing his half, so nothing has changed for you.  What sacrifices did he have to make to put himself in this position?  Did he still do his half getting to this point, and *he* had less free time or more stress getting there?  \n\nI get where you are coming from but I get the feeling this is more envy and resentment than wanting \"fair\"", "YTA unless you offered to start paying a higher portion to compensate.", "NAH. But can you just split a cost of a cleaner? Once a week should be enough for two adults without kids as there shouldn’t be that much mess.", "NTA. I do 100% of the domestic labor in my house bc my husband works twice as many hours as me. I’d feel terrible if he came home to do chores after working a long day when I was there just hanging out. Bf is being super inconsiderate. If he truly cared for you he would help you more.", "NTA", "His point is completely valid but that is a roommate mindset, not the way you think in a relationship. Relationship isn't about deviding everything 50-50 all the time and set that in stone. If your partner tells you they are feeling overwhelmed and need some help, then do your best to help (especially if you have a lot of free time on your hands). So NTA", "NTA\n\nBut, do you want to stay with this guy?", "NTA. But I recommend watching this [video ](https://youtu.be/yfL4RTuC9Bk?si=be-mjj1L80XahJdl) from Brene Brown. She expertly explains a partnership is never 50/50 because you are both not always able to provide 50/50. \n\nSomething to think about when looking to change how you split or care for household chores between the two of you:", "NTA. As your partner he should want to relieve your stress and ease your workload. He is sitting at home all day and could easily do some chores to free up some time to actually spend together when you get home. \n\n\nAs an example, I work some pretty crazy hours at my job and my partner, who although also works full time, will pick up a lot of my chores on the nights I’m stuck at the office pretty late. Why? He doesn’t want me to be super stressed out all day, come home and do more work, then have no time to unwind or spend together. To me this is completely normal, and what I would anticipate anyone who loves someone to do. \n\nBut it’ll be pretty hilarious if you move out and he has to come out of retirement to pick up your half of the rent. Also, who is he even playing video games with all day? Does he not have any friends who work?", "Probably NTA, assuming you don't insist on exact equality in other realms.   \n\n\nI think you might want to reapproach from the perspective of your relationship. A 3 year investment in building a life as a unit, is a much more significant one then a roommate agreement. While you started as roommates, and it makes sense for two people with those kinds of obligations to each other to split things as equally as possible, as individuals who are sharing a living space for expediency, or some in response to some kind of financial pressure, building a partnership carries a whole series of other expectations.   \n\n\nUltimately, I would define a romantic partnership as a situation where both parties take on some extra burdens for each other, and also share in their successes. At the very least, this is the case after years of investment into such a partnership.   \n\n\nMaybe try explaining to your partner that exact equality is living more like roommates who fuck, then like partners. Doing some bonus labour to alleviate pressures on a partner, especially when the labour is less arduous to one partner than  the other, is how strong succesful units are built. Surely, you take on some responsibilities or labours that your partner doesn't, for the purpose of being stronger as a unit.   \n\n\nIf you don't do this, for each other, I wonder if you are truly partners, or more like long term FWB's/", "NAH I wouldn’t want to do more chores either just because I’m at home more, but I would also step up if I felt like my partner was struggling. It sounds like something needs to change if the current situation is unsustainable, whether it be your work situation, home situation, financial situation. Either he’s part of the solution and being a partner or part of the problem", "NTA I think he has a point that you share chores 50/50, but when you said you were struggling, he should have stepped up.", "Every person should act as if they have a full time job all the time excepting days off. If it’s not working, it damn well should be taking care of the house or looking for a new job or building a business or whatever", "NTA.  When I was working long hours and my husband was home in early retirement, he picked up more chores around the house because he loves me, he saw how overwhelmed I was, and it was the right thing to do for someone he loves.\n\nYour BF is perfectly content to let you carry more of the load while he plays video games.  Put in stark terms like that, why would you stay with someone who doesn’t put your well-being first?  Love is not a feeling; it’s a series of actions.  Your BF doesn’t truly love you.  He loves himself more.", "NTA. The person who’s at home the most/has the most free time does the most chores, that’s how it works. My husband and I have changes our load of chores many, many times over the last 30 years. From me doing everything to him doing everything, to all possible combination s in between. 50/50, 40/60, 30/70, etc, etc.", "You guys are short term. If you were long term he’d be working for the early retirement of you BOTH!", "NTA. He is not your boyfriend,  he is a fuckbuddy. Is it fair that he does most of the chores? No, but if you are in a relationship, you hold the fort for your partner when they are struggling, because you want to see them happy, and vice versa. Dump his selfish ass OP.", "How come you guys are cooking your own meals? If you both take turns cooking, that can help both of you. Maybe some chores can be combined. Though I think you don't like him just sitting at home playing video games.", "NTa. He's a roomie with benefits. IF you are ok with that, then keep on as you  were.", "NTA. I noticed you go home and cook for yourself. Do the same with laundry and cleaning. When he makes a mess, leave it there. I know it takes a particular level of pettiness, but try to ignore it until he starts whining. Just tell him you don’t have time, too busy with work.", "YTA. I say this because you are trying to control and manage his time. You 2 had an arrangement that you both seemed satisfied with. Let say it was 50/50. He is still doing his entire 50% but because he has more control of his time you are now asking him to do 55/45 or even 60/40.  It sounds like you want to permanently offload chores to him.  The question here is why should your bf take on your chores and your answer is because you are busy and he is not.\n\nNow the conversation to have here is what does this look like in the future if you married and had children. In this situation his responsibilities would change. His retirement for 1 does not work with a family.", "NAH. You're not wrong for requesting it but as your own post states, he sacrificed everything so that he could retire early to be free from work not to support you. How is replacing his paid work with free labour good for him? Likely there is resentment on your side because you had to work.  \n\n\nThat being said, he doesn't sound that committed to a relationship. I don't know how much money he has but is it enough for a house, kids, etc or just enough to cover his limited expenses? Likely he will get bored at some point and start making money through means be that a job or business.", "NTA.\n\nAnd I think what these comments that are ytas are missing is the work load is now uneven.\n\nBoyfriend has passive income, and excessive free time. His only \"work\" is half the chores. Not job. Work. If he sleeps 8 hours a day, and his chores take a generous 4 hours to complete, he's got 12 hours to do whatever he wants a day.\n\nOP has to *work* for her income and only has a small portion of free time, and she also has house chores. If her work is 8 hours, plus 4 hours of chores, plus 8 hours sleep, she has 4 hours of spare time. That's 1/3 of the leisure time her bf enjoys.\n\nThe load is not equally shared.\n\nAnd these are just hypothetical numbers where they have equal time consuming tasks as chores. Reducing the chore time, doesn't change the outcome. Op works more. A true sharing of responsibilities would mean her partner takes on some of the load she's carrying, now that his is lighter. It would be the same expectation if their roles were flipped.\n\nNTA. OP has a roommate with benefits, not a partner that cares about her.", "YTA. You agreed that the arrangement was equal. Now you want to change it in your favor.\n\nIf you got an inheritance and could quit your job, would you want to add his chores to your duties?", "YTA.  \nWhen reading below this is addressed to everyone voting \"N T A\" and suggesting for y'all to break up.  \n\n\n1 - What has changed in the last 6 months that has lead to more stress besides him having free time? It sounds like you just wanna do less chores and expect him to do more purely because he was prepared for life.  \n\n\n2 - To everyone saying \"N T A\" I've seen several post where the wife wasn't working at all and the husband was called TA because he simply suggested she do more chores, so the fact that y'all are being so sexist in the comments is crazy  \n\n\n3 - \"Break up with him!!!\" Yeah cause who will that benefiet more? The dude who is completely stable right now or the girl who is already stressed to hell with half the chores and work? (News flash, it's the girl, if she breaks up with him she'd most likely have to work more hours to cover her rent cause I doubt he'd wanna live with his ex, then she'd have to do more chores solo!)  \n\n\n4 - Why do you expect him to do more just because he planned for life? Like the comments said a relationship isn't 50/50, so why are you expecting HIM to take on more just to make you happy? A relationship is about making your partner happy but it sounds like you're attempting to take away his free time to ease your burden.  \n\n\nThe only thing that bugs me is that he didn't offer to do this for you, that is the only thing he did wrong (cause like I said in 4, the goal is to make your partner happy in life on both sides)  \nYou attempting to force him to do this then getting mad when he didn't is on you, but him not proposing to do it also bugs me.  \n\n\nBut you're 95% the AH in this situation. while your BF is 5% the AH.", "NTA but get a cleaning person or whatever else you need and split the bill for it.", "It sounds like you  wants to have the BF pick up more than his fair share of household work.\n\n  \nBF does his share of household work.\n\n  \nBF pays his share of household expenses.\n\n  \nBF helps OP more here and there as necessary occasionally.\n\n  \nBF is in the position of being able to retire young due to his own efforts and sacrifices.\n\n  \nI think you are trying to take advantage.", "I can imagine this the other way around. \" Screw him you're a girl boss who saved and retired early, why should you pick up his slack?\" but...….. since this is a dude that was clearly brilliant and figured out how to retire young he's gonna be the asshole.", ">Since we started as roomates we never changed the chores and financal distribution everything is equal.\n\nThis is fair\n\n>I asked this because lately I am overwhelmed with work and then come home and cook for myself and do some chores. \n\nThis is fine, as in, you're free to ask and partners should be expected to help each other.\n\n>2. I didn't propose this as a temporary change because. I got worried that he might become lazy. \n\nThis is a problem. This indicates that you weren't asking for help because you needed help. You were demanding that he works more as an effort to control him. You don't want him to help you. You want to assign him busywork because you think it's good for him. You're acting like a shitty employer. Why do you think he decided to retire?\n\n>it would also lighten my share at work so we can spend even more time\n\nThis is back on track. Again it's appropriate to ask him of him  especially when there's some mutual benefit. That makes you sound like a partner. But the earlier comment sours it.", "Agreed. NAH. You aren't an asshole for wanting him to support you when you're overworked when it's so possible, but he's contributing equally so can't be called an asshole. He doesn't care that your stressed and overworked, though. It shows that he's not all that concerned with your wellbeing and feels no need to to support you in any way that puts him out at all. I'd consider this more of a friends with benefits relationship and not expect it to last long term for you own future happiness. At some point you may want to end it to find a partner who has more interest in supporting you during difficult times.", "He isn't being a dick by refusing to do her half of the chores.  If everything was fair when he wasted away at a day job, then nothing has changed now that he's at home making money off his investments. The only thing that has changed is ops entitled behavior. If op wants more free time, she should stop being jealous of her bf and focus on her career.", "Yup ☝🏻🚩🚩🚩", "I agree with this, NTA. My fiancé is physically disabled. We don't do a split of chores in terms of number of tasks because that wouldn't be fair - each task takes far more out of him than the task does for me. We end up evaluating what he can handle (which ebbs and flows over time) and divide up the chores on an ongoing basis based on amount of time, energy, and ability. I can't imagine dealing with someone so stubborn that the old agreed upon chores must be strictly adhered to despite a major life change.", "Yeah. Ima go with this. NTA", "Classic Reddit comment. Immediately suggests breaking up the relationship based on one post from one person’s perspective.\n\nWorking herself into an early grave? She’s doing the same amount of work she was doing before he retired. The same amount of work that any grown adult needs to do. \n\nIt sounds like she’s doing a lot less work than he was doing before he retired, given that he was able to retire before 30. Give the guy some time to enjoy his hard work ffs and then you can reconsider housework balance, talk about what works and what doesn’t, what is causing OP to suddenly feel stressed and overworked etc.\n\nEven though he is ‘retired’ he still sounds immature. People sometimes need a lot of time to mature and that sometimes comes through spending time in a long term relationship. Not everything is a reason to immediately break up.", "I'm going to show my wife your answer... if I'm working she can't expect that I do half of the baby chores and \"my\" house chores. \n\n\nThank you", "He does work, he has investments. If she was fine with the way things were when he was wasting time at a 9 to 5, then she's fine now. Nothing has changed except her strange level of entitlement.", "Exactly, people are missing the fact that it’s all about motive here. The reason she wants help isn’t because she is stressed or even ‘working herself into an early grave’ like one extremely dramatic person suggested. \n\nShe just wants to change the dynamic because she’s annoyed her partner doesn’t have a normal job, which I guess could be a somewhat reasonable stance to take but it’s a totally different issue and you need to phrase it that way.", "i really do not understand the logic behind chores being divided based on income. uh, no, division of *household spending* should be based on income. the division of chores should be based on HOURS WORKED. if you work outside the house more, you should have less chores than a partner who does not work. because they are in the house more and have significantly more free time. it would be the same if the roles were reversed too.", "He can also just have several apartments and rent them out, which is pretty safe way to last you years", "He can always go back to work later. Retirement is not an irreversible state.", "If she was asking for temporary help I’d understand but it seems like she’s permanently asking him to pick up some of her chores despite the fact that he clearly busted ass to be able to retire early", "OP, this is a GREAT reply. Make SURE you are ONLY doing your half of the chores. Also, pay professionals to do them for you if you need to. It's your half, so you can do them how you want to.", "What if you were like sick or something and needed some help?", "I mean… Until they’re married I think it’s reasonable for one not to make major time or financial sacrifices for the other. Isn’t this the same sub that tells women not to do wife level stuff while they’re a girlfriend?", "Exactly, find someone else who is working a nine to five, that way ops jealousy doesn't torpedo another good relationship.", "Investments are work, just like any other job they produce income. Being jealous your partner has a better income stream than you is childish. Get a better job instead of giving your partner the side eye.", "Uh huh, because people who set themselves up and retire by age 27 are typically lazy morons. Good one", "She isn't doing more than him. He is still pulling his weight. She's just mad he retired early and she still has to go to work all day. It's an issue of jealousy, nothing more.", "He's retired, paying half the bills, and still doing half the chores. If that's lazy I'm the pope.", "Working smarter not harder is a good thing. She doesn't get a gold star for putting in more effort for the same result.  He isn't responsible for her financial decisions. They don't have kids, no one is a stay at home parent. They both contribute financially and equally at home. She has nothing to complain about.", "If you're willing to destroy a relationship because you're jealous your partner retired knock yourself out. She could do much worse.", "Absolutely. She needs to see someone struggle the same way she does, so her jealousy doesn't screw up another relationship. He needs a partner who isn't looking for a free ride.", "Ah yes, if you're not slaving way at a day job just to make ends meet you are a worthless chump with no life goals. Reddit, the land of lunacy.", "l get the impression she says \"help\" for being overwhelmed when she means \"not fair\" you have a better income stream than me and I want some of your free time.", "Does she need help temporarily because she's overwhelmed at work or is she just jealous he doesn't have to work a normal 9 to 5 like she does anymore?", "Wow imagining renting an office to sit and do nothing just so you can ignore your partner struggling.", "He's making good money off smart investments. That's way more productive than killing yourself at a nine to five. Working harder instead of smarter isn't a badge of honor.", "He doesn't cook at all. And I can't have takeout every day. So I have to cook for myself the majority of the time. Some days if I can't then he will arrange food for me. Playing video games is a bit annoying because in the last six months it has gone from 1 or 2 hrs per day to 7 to 8 hrs. But he can do whatever he wants with his free time I don't get to dictate it. I just thought, him picking a few extra chores could be better for everyone.", "I really need you to explain how he gaslit in this situation. By stating facts? That is actually the opposite of gaslighting. Sure, he should take on a bit more housework in order to help out his partner. But he did not gaslight anyone. He simply stated he is contributing the same amount of money and the same amount of housework as OP. There's no shifting of reality in there. \n\n&#x200B;\n\nI beg y'all to learn what gaslighting means. It does not apply when there is a simple disagreement. It does not even apply when someone simply lies. Stop changing the meaning of words!!!!", "Saving up and retiring early is lazy? Huh.", "Lol y’all wouldn’t be saying  this if the man just didn’t want to do his share of house cleaning. He would be called lazy and told that “she is still paying her half and her her half done do your own half” \n\nBut because the man doesn’t want to be a maid for her while still paying his share is him being lazy. Lol okay. No OP is the lazy one. She wants him to keep paying his share and do all the house work because she’s “tired” not his fault he invested his money and she didn’t. Tf? \n\nYeah OP your a huge AH to ask him to do your half of house work. Stop being lazy af and do it yourself.", "Why isn't she the lazy one? Nothing has changed except his job. She can't do the one or two things that she needs to do? I bet there are stuff that doesn't even need daily attention.", "☝🏻🚩🚩🚩", "If he is really a boyfriend and cares about his partner he will lend a hand when asked. If he were just a room mate  you would have a valid point.", ">6 months ago he quit his job as he has investments with returns that cover all of his expenses and more.\n\nI would say that is a considerable time to enjoy yourself doing nothing.\n\nHis partner is overwhelmed and he doesn't want to help out. He doesn't cook but order takeout every night which means OP has to cook for herself every day after work (unclear if they even eat together). I know it's very typical of reddit to suggest a break up (usually because these posts show a really unhealthy relationship dynamic) but I don't really see them as compatible since they seem to live completely separate lives and are at very different stages in their lives.", "Have you seriously never used your free time to do something kind for your partner?", "The post says that he doesn’t work. Having investments isn’t working.", "She said she's struggling. Asking for help when you're overwhelmed is not some \"strange level of entitlement\" in a partnership. My partner and I both offer to do more for the other person if the other person is feeling overwhelmed, it's just a kind and normal thing to do for the person you love.", "Exactly. But I disagree that its reasonable.", "This kinda undercuts what he’s doing though.  \n\nIf he’s making stable enough income from investments to live off of, he’s likely doing a lot of reading on the market state and staying ahead of the game to make proper moves — especially in as volatile a market as it currently is.\n\nThat’s not him **not working** as you and OP seem to be labeling him with, that’s just him doing *different* work.", "She could lose her job also.", "Why do you think it seems permanent? She specifically mentioned she's feeling \"overwhelmed lately\". To me this suggests she's going through a tough patch at the moment.", "They’ve been together for two years. The first year they were roommate.", "Sure, working towards their shared retirement when married sounds reasonable. But they're not married. They may never get married. I suspect the problem here is that he's \"playing games\" all day. If he were working for a charity, or starting his own business, or studying to be a therapist and she were to say, \"hey, stop doing those pointless things, do my chores for me\" the conversation would be very different. But he gets to decide what is meaningful for him, not her, not me. If she doesn't want a relationship with someone who is playing games all day, that's the actual problem here.\n\nAs it stands - his life, his choice. I can't say if he intends to live the rest of his life like this or if it's just a recovery phase from a really bad burn-out. It does not matter. They aren't married. They have no children. Neither of them is in need of extra support, they are both individually doing well. He contributes just as much to the relationship financially and physically, it does not matter what he does with the rest of his time.\n\nTo be clear, I respect your view even though I don't share it. I'd be more likely to want to be in a relationship with someone who was contributing toward shared goals than someone who was just living in the moment and looking after themselves. I just don't think it's reasonable to demand that.", "So you're looking for someone to leach off of. Cool. Not everyone is OK with that type of relationship. I'd have a hard time loving a freeloader.", "They're in their 20s and have been dating for *2* years. The common goals they should be working towards is pitching in for a vacation and deciding between getting a cat or a dog. They shouldn't be paying for each others cars or retirement.", "And somehow OP will be fine doing their half of the chores because they'll kind of have to be", "Cooking and laundry are like 80% of my household chores aside from my dogs. Idk what he is even doing everyday if he's only doing half laundry.\n\nSounds like you went from roommate to situationship.", "Do you need a temporary helping hand? Like for a month or so? Or are you simply trying to offload your half of the chores on him permanently because he has more free time? Those are very differnt scenarios.", "He may have worked hard previously but the daily she does do more than him. I’ve explained why I feel that way and why I absolutely would not be with someone with that kind of power imbalance. He’s treating her like a roommate not someone who wants to spend their life together. It would breed resentment in the relationship if she struggles daily while he sits at home. \n\nYes it’s great for him for retiring early but how’s this going to work if they married/kids? I don’t know about you but if I retired early I would also want to make my partners life easier and I know my husband would do the same. Why would I want the person I love to come home exhausted and then still have to do more before they can relax when I could very easily take up more to help them so we both get more time together? Sure I *could* do nothing but game all day and only do the bare minimum I have to because I worked hard to retire early but that would not make me a great partner, that’s how someone who lives alone or with a roommate behaves. \n\nIf I could afford to retire early “and then some” I would want my husband to have a more comfortable life, whether that was me taking up extra chores or I would provide more financially so my husband could reduce his hours. Not stick to expecting him to work full time, do chores and cook while I do the minimum. It’s a kinda of “fuck you, I got mine” kind of attitude and isn’t a solid foundation for relationships. I would leave if I was op.", "Eight hours a day! That's too much. I love video games but I can't do more than a few hours. All that sitting and staring at the screen is bad for anyone. I can understand why you suggested doing a few extra chores. Do something else, man. Get some exercise, grocery shop. Doesn't help that he only does take out. He should cook.\n\nHave you tried talking to him about the excess video game? Does he really only want to play video for the rest of his life? Does he have any other goals or interests now that he is retired?", "A good solution would be him hiring a house cleaner once or twice per month to lighten the load for both of them.", "Exactly, the need didn't change, they were sharing the same chores and bills before.  He's taking him time which he is perfectly entitled to as long as he contributes equally financially and otherwise.", "We can all read.", "Right. He games all day. She works. There’s a clue in their, if you can find it.", "Available time/energy is highly relevant.", "If one person suddenly works a whole lot less than yea if they aren’t sick they pick up the slack. I broke my leg and had a long recovery. My partner did everything around the house while working full time until I could hop around and start picking things up. I work 3 days a week now, so *I* do the majority since I’m home more often. \n\nThis is how stable partnerships work.", "I’m not sure it is obvious. OP just states that he gets enough passive income to cover his current expenses. That’s very far from being well set to cover his future expenses arising from circumstances both within and out with his control. To be honest he sounds like a bit of a liability to me and my assumption was that he had enough to get by now but not to evolve his life in any way or respond to e.g. markets tanking, inflation etc. Or maybe it’s more likely some creative mix of the two positions - either way he doesn’t sound like a terrific partner", "Typical male bashing on here. And you lames can't even retort, just down vote.", "If it were a temporary thing he probably would. Op doesn't need help, she's just jealous. And wants to offload her half if the work onto her partner. If he were a doormat she might have a point.", "Why is she overwhelmed?; They don't have any kids. She cooks for herself and does her own laundry. That's overwhelming? Sounds like she's bitter her bf doesn't have to slave away at a regular 9 to 5. Sorry, that's not a situation that her bf even needs to address. She needs to take her jealousy up with the person in the mirror.", "He isn’t being villainized for financial freedom. People are saying that he should just help his partner when she’s overwhelmed", "When one partner doesn't contribute financially, sure. Investments are work, they produce income. Just like any other job. It isn't her bfs problem that he made better financial decisions and has more free time than her.  She's jealous, not in need.", "You don't take advantage of your partner's smart investments or superior financial decisions by offloading your half of the housework onto them. Her lack of free time is her problem to solve. This is an issue of jeloiusy, nothing more.", "Yep. Also if he’s so minted he’s retiring it’s not even like he has to do the chores himself? If he’s independently wealthy vs just coasting on a passive income that isn’t fit for purpose for his future then hire a cleaner to do it all then OP is free and he can play his video games or do whatever else he pleases?", "They've only been dating for 2 years they shouldn't be commingling their entire financial and home situations that fast.", "Making money is working. Investments, YouTube, slaving away at McDonalds, there is no difference.", "Why wasn't she struggling when he was at work all day? And why even mention him sitting at home or playing videogames if it was all about her being overwhelmed. Also, this doesn't read like someone who needs a temporary helping hand for a week or two. It sounds like she expects him to permanently take on more of the chores simply because he has more free time now. And that's a hard hell no.", "I’m not saying he’s in the right, but the post doesn’t read at all like someone who is struggling and needs a bit of help due to being overworked. It reads like someone who is upset that her partner doesn’t have a job", "It just sounds coincidental that she's suddenly \"overwhelmed\" right after her bf retired. They don't have kids. They live in an apartment. He bf orders takeout, she cooks for herself and does her own laundry? Unless she's leaving out major details it just comes off like she's jealous.", "That should be part of the conversation then. Ask for some help for the next couple weeks or a month.\n\nI don't think people are assuming that because OP comes across as a bit judgemental over how he spends his time when not doing his share of chores.", "I understand your perspective, but you can’t declare that they don’t need “any extra support.”  OP has expressed that they are feeling overwhelmed lately, so they asked their partner if they would pick up some additional chores from her list. This was her expressing a need for extra support. This did not carry further into a discussion about how long that support would be wanted for, what those specific chores are and so forth, so a lot of details do not exist. \n\nWe can extrapolate that OP is envious, that she takes issue with him gaming all day and abandoning further ambition at twenty-nine to retire while she’s still working, but we can also take this at face value because *everyone needs help sometimes.* By your reasoning, he has decided that helping his partner when she’s feeling overwhelmed isn’t as important or meaningful to him as the fact that he has already done his equal part. \n\nIf we demand and uphold a 50/50 split with no exceptions, we can never ask for help, because that changes the distribution. If you never help your partner when they’re feeling overwhelmed, if you’re unwilling to try for even a handful of days, how the hell would you reach marriage? \n\nI understand the boyfriend’s perspective, also. I agree with another commenter who said that they may not be compatible, because some people are good with a give and take, and others only want to be responsible for their part and nothing more, no exceptions because that is their concept of fair. These two kinds of people do great with people like themselves, but not so much with others.\n\nSo I get you both, it comes down to differing values and priorities. I think it’s fair to say that the most common consequences of having differing values and priorities to the person you’re dating is the end of the relationship, often to both parties’ benefit in the long term.", "It what world is anyone a freeloader in any of these situations?", "Yep, being in a relationship isn’t just 50/50 all of the time. Sometimes one person needs a little extra support and then it’ll switch, that’s just the ebb and flow of life and a partnership means supporting each other through all of those times.", "This is why I don’t think a strict division of household labor works in a long term partnership. \n\nIt’s totally fine to have a set of chores that generally belongs to each person under normal circumstances. But if the person who usually takes out the trash is having an unusually busy and stressful week, the trash still needs to get taken out and it’s a kindness for the other partner to pick up the slack for a while. \n\nWhen I was a kid, my dad lost his job almost exactly at the same time that my mom started her first full time job after having kids (she worked part time until all of us were in school full-day). So even though she had usually been the cooking and laundry parent, she was going through a stressful period and my dad was home more often, so he became the cooking/laundry/school drop off parent. Later when she was more settled in her job and he was starting something new, they rebalanced the tasks again to make sure everything was getting done and nobody was too overwhelmed. That’s how it should be if you’re really in partnership with someone.", "This. It's so damn hard for me to even ask for help when I'm overwhelmed, getting shut down like this basically just guarantees I won't do it again...and that's a bit of a death knell in a relationship. Can't blame OP for being upset about now knowing that she's on her own, even in a relationship.", "She suddenly got overwhelmed when she saw that he had enough money to exist without working. Before that she was just whelmed. Wonder what changed", "Just because he’s working from home doesn’t excuse her from being an adult and cleaning up after herself.", "She conveniently doesn't mention said chores. Between 2 people, no children, how much is there to do?", "Somehow, I sincerely doubt you would do more than your fair share indefinitely.", "That's not a relationship, that's you looking for someone to leach off of.", "Equity is not giving the same amount of free time to one who has not worked, scrimped, saved, invested and thought ahead as to one who has.\n\nWhy should the person who has worked hard, sacrificed more, save much, investment wisely be penalized?", "Why is op unable to do half the chores at an apartment when the couple doesn't even have kids? Why did her job instantly become \"overwhelming\" the minute she saw her partner enjoying his newly earned free time?", "Hire a house cleaner because she can't do her half of basic chores seems excessive. Unless she is working 70-80 hour weeks, no excuse outside of having children to justify a house cleaner IMO.\n\nWouldn't she have to pay for that as well? Probably would just add financial stress to her tbh.", "A good solution would be for them to hire a house cleaner and split the cost equally between them.\n\nThen they would both have the same amount of \"free\" time.", "That's when the other person is providing most of the financial support", "Nope, he worked and sacrificed for his well-earned \"free\" time.\n\nOP did not.\n\nChores and expenses should be split equally between them.", "She didn't say he games all day. She said he goes out, hangs around the house, and plays video games during the day. He still makes good money and pays his bills because of his wise investments and provides. He very much pulls his own weight. OP doesn't and wants him to help pull more of her weight (which is fine to ask and fine for him to refuse).", "No, it is not. I said similarly before but now OP has edited to say that he can retire early because he started working at 15-16 and scrimped all his life. People who do that deserve a rest.", "You sound jealous and silly. In the real world no one cares where your money came from. It isn't any better to slave away at McDonalds than it is to invest. If you stop trying to drag other people down you might have time to pull yourself up.", "Even if that’s why, how is that a problem? If he has all day off and she has to work, why would he not pick up a few extra chores so she gets as much free time (and time with him) as possible?\n\nThe finances aren’t relevant in this, they shouldn’t have anything to do with the split of chores. In this case is solely about household maintenance. Would you feel the same if he wasn’t paying his share, and she was the sole provider? No, because why should she have to come home and do 50% while also having to work when he stays home all day.\n\nIt’s the same thing, minus the providing. He’s home all day, and she’s working. That is already unbalanced, so 50/50 split isn’t going to balance that out. It’s going to stay unbalanced.\n\nIdk if that makes sense, I’m tired as shit, but hopefully you get what i’m trying to say.", "People can get overwhelmed for any number of reasons. But yes, one reason could absolutely be that her boyfriend is relaxing all day and she feels it's unfair she has to continue working once she gets home because he doesn't cook. And if him not working is causing her to feel overwhelmed, then they may not be compatible.\n\nThe thing I wondering about myself is all the takeout. Boyfriend order takeout every single day which must accumulate a LOT of trash. Does he take care of that by himself or is the garbage a chore they split 50/50? Since he doesn't cook at all, does OP do all the grocery shopping? Looking at my own relationship, if one of us could get of work early that person did the grocery shopping since it's less people in the supermarket during the day. She wanted him to take on more chores but we've been told he doesn't cook and she want them to continue doing their own laundry so what's left? Cleaning and grocery shopping. When you're at home all day you cause more of a mess than if you're working so does she need to tidy up after him or not? Since they split the chores 50/50.", "Man dude, if you want to date him go ahead, I would hate this arrangement and would either leave or talk about finances. I would never date someone long term that didn't want a combined life, OP can feel the same way, she can leave. Glad you'd be cool with it but most people with 'good investments' who retire at 29 end up penniless at 40. I'd want to be with someone who works with me so we both retire at 40 with safer bonds that won't go up in flames one day.", "I agree with that sentiment on a personal level. A relationship is built off of mutual understanding and respect, and if he valued her then he would help.\n\nObjectively, however, a partnership is 50/50. If he’s already doing his share of the chores and paying his share of the rent, why should he be made to do more when he’s already doing his part. He’s 100% being villainized for financial freedom. \n\nNow OP can choose to leave OP to potentially find someone who can pay 50/50 and also be a house husband on top of that, but that’s not likely going to happen. The likely result is that they’ll find someone who can do 50/50 and willing to take on an extra load while OP is busy during times like these, which again, is within their rights to seek out.", "Yeah this is not the behavior of someone that cares about her.", "Well that's bullshit", "There are many ways to make money. Working is one way. People also make money through investments, handouts from parents, government funds etc.", "Entirely this, and also the whole post reeks of a very limited awareness of what the boyfriend even does. \n\nA person in their twenties making stable income off of market investments is not just doing nothing, he’s likely trading in options or making appropriate moves to maintain healthy investment income.  Strongly unlikely the guy is surviving a whole year on dividends unless he has somewhere in the range of 5-10 million stashed in a whole dividend focused portfolio, but even people with that much in that format have to keep on top of it all to ensure their income stream isn’t jeopardized by a company cutting dividends which happens quite regularly.\n\nOP seems to just genuinely not have any respect for her dude who decided to be smart with his money, invested with understanding for the system, and did very well for himself.\n\nIt also reeks of limited perspective.  OP comes home to BF playing games or winding down his day seeing none of what he did, and then can only focus on what OP has yet to do that he didn’t just do for her.  Like, there are no complaints that he isn’t doing his half of the list, only that he isn’t doing items from her half too.", "But OP is not asking for a little temporary help to get over a rough patch, (which she says he does), she is trying to change the household chores permanently.\n\nOp is unfair to BF.", "This. I've been married for over 30 years. We own a house and raised three children together.  We've never even formally divided up the chores. If someone is overwhelmed, the other person steps in.", "This is how my partner and I have been doing things and it's working really well so far. For a period he was working a ton and I took on most chores and now he's back to normal and I'm having a rough time and so he's doing the majority. Just gotta roll with the punches, sometimes. The only chores he doesn't do are cat related due to his allergies, everything else just gets done when it needs to by whoever is able to do it.", "But OP is not asking for a temporary assist because she is overwhelmed at the moment which OP admits he does.\n\nShe is asking for a permanent shift which is unfair.\n\nWhy should BF do more than OP?\n\nBecause he is smart and work hard when OP and other people his age were partying, spending money frivolously, and not thinking of the future................really?", "My partner and I split the chores by who enjoys doing what. For the ones neither of us like, we alternate. It's so much easier because we're doing the things that we each find low effort and high reward with an occasional high effort, low reward task that we get appreciation for doing.", "I can see both sides but there’s a huge question here about how good a partner this person is. He has retired before 30 which is commendable but according to OP he did this as the passive income he can now generate covers his share of their expenses. However their shared expenses in their twenties could be significantly lower than in subsequent decades depending on their shared plans for buying a home, holidays, pets, contribution to elderly care, or even just increased healthcare costs in later life. Can OP genuinely maintain the desire to have a long term relationship with someone that seems to be happy to watch her struggle while they enjoy their life doing nothing? With someone who (with luck) might live another 50/60 years or more still doing nothing and may never change their stance on providing support to their partner? Being a good partner involves enjoying sharing the good times as well as the harder times - this individual is having all good time and seemingly isn’t motivated to share any of it. I can see both sides too, if dude wants to do nothing then let him do nothing. But it may be an unrealistic expectation to do this within a committed partnership, maybe OP should seek someone that really wants to be part of a team.", "I think the point is if you’re doing nothing all day everyday and your partner is overwhelmed you help them out if you’re a decent person. Now she’s disappointed because she had previously thought that he actually cared about her", "the argument that if he wasnt there she would have to do it all is so funny to me.\n\nbecause then why should he be there? she can get any random roommate and keep her status quo right now. what is he doing to be her partner?", "Maybe now but what happens if they ever have kids? Not a good look for the future", "lol this is such a bad take. She was probably just as overwhelmed but didn’t see a bunch of room for her PARTNER to take some of that off. With him doing the bare minimum every day, he could step up and do an extra hour of chores to help his gf out. \n\nPartners are not glorified roommates. It’s not just about “well he makes money without working so he’s contributing 50/50!”.", "Facts!", "I just view the fair share differently I think. If my partner is struggling, I’m gonna do a little bit more to keep her feeling supported! \n\nIf I have the capacity to make my partners life easier, why wouldn’t I do that? And I know she’d do the same for me", "House cleaners exist. You don't actually have to \"justify\" hiring them 🙄", "I would never want to date any of y’all, damn. 50/50 split is toxic when one person is working and the other doesn’t have to. I make three times my wife’s income, should I just hoard it all or demand she do most chores because I pay for almost everything? Not when we both work full time. People in relationships help each other out based on available time/energy. \n\nSome real selfish boomer-mindset people in this thread.", "He's in his 20s. None of that happened.", "Doing an hour extra of chores/cooking a day when they still have 7+ hours free (when their partner does not) is not a huge ask. Their partner will also have more time and energy for them and it's really a win/win.\n\nThis weird 50/50 mindset is incredibly selfish when one person has a wealth of time/energy and the other is barely getting by.", ">they are financially set for life by the age of 27\n\nwhat? He is set for life. She's still paying half the bills, why are you pretending he's somehow set \"them\" up for life?", "What job can you possibly get that allows you to retire by 27? Is he making a million dollars a year coming right out of college? Assuming he *is* working a high paid job that requires college - age 22 at earliest for an undergrad and age 25 at earliest for a masters.\n\nYou think he can earn enough all by himself in 2-5 years to retire for the rest of his life?\n\nHe is either:\n\n1. Lying about “retiring” and is actually living off savings that he will deplete in a short amount of time, or\n\n2. A trust fund baby who never had to work in the first place.\n\nNeither of these options involves “working hard”.", "If he wasn't contributing financially that would make sense. If she were working 60 hours a week or had some massive project that was overwhelming her at work it would make sense. If this were her asking for a temporary helping hand from her bf it would make sense. \n\nBut it sounds like she's just pissed he has a much better income stream than she does. And she's trying to shove her half of the chores on to his plate, permanently. That's absurd.", "Where on earth have you plucked that statistic from? Thin air", "I don’t fully agree with the arrangement I just don’t agree why she want to change the arrangement she says it because she’s tired and overwhelmed but didn’t become tired and overwhelmed until he “retired”?I would get if some days she was feeling low and asked him to take more on but to expect him to do every day when he quit to relax and have more free time is crazy \n\nMost people don’t retire at 29 so whatever statistics you used isn’t based correctly", "If you would hate an arrangement where your partner paid 50% of the bills and did 50% of the housework you're goofy. She lives in an apartment with no kids. No one is overwhelmed or overworked. She's just jealous her bf has retired and she's still has to work.", "Which wouldn't matter either way, since a dollar is a dollar. And how you earn it doesn't make you any better or worse than the next guy with a dollar. Jealousy is a nasty personal problem, not something your partner needs to sacrifice further to address.", "Only if you go to work for fun. If you go to work for money, then its spot on. He just has a better income stream than you.", "Not if BF is home for longer periods of time and OP is overloaded. Doesn’t matter he doesn’t have to work, he doesn’t get to have salad days for the rest of his life if he wants to share a home with someone.", "No, he should spend his free Tim as he sees fit. It is pretty ballsy to expect him to do ops chores just because he is in a better financial position and prioritizes his free time over making more money.", "The saying is true, you do good work and get rewarded with more work. \n\nNow that he is financially free, he gets more work.\n\nStarting to understand people who live off welfare and do nothing to improve (not that I’d live off welfare if I can, that’s just fucked up to me, but I understand)", "I think this is what they call “financially independent” not necessarily truly retired.", "That's...literally the definition of retirement lol", "I'm sorry but living off your smart investments and spending your free time as you see fit = Retired. Age has nothing to do with it.", "Op isn't struggling, she was just fine as long as her bf was at work all day. Nothing changed except ops jealousy and entitlement.", "No, she wants to take advantage of her partners free time, and that's not ok. She was just fine when he was at work all day. The only thing that has changed is her jealousy. She needs to focus on her own career instead of giving him the side eye for having a better income stream.", "Partners are not suckers you can leach off of. She didn't need any help before, she certainly doesn't need it now. Him having more free time and a better income stream is not a signal for her to offload her half of the housework in his lap. She is not asking for a little temporary help, she is trying to take advantage of him and his free time. That's not ok. They don't have any kids, they aren't married, there is no reason on earth why she shouldn't be able to do half the chores while maintaining her job, the same way she has for 2 years without issue.", "I ofc agree with everything you're saying, but what I have an issue with how hypocritical this sub is. I can legit bet my bottom dollor if the genders were reversed, the majority opinion would be something else.\n\nAlso Apologies for name calling.", "Agreed. You help the person you love even without being asked to. It's this thing where you're in touch with their emotions so if they're having a bad period you intervene and do as much as you can to help them\n\nWhy? Cause you love them or just cause it makes them happy or both of these and other reasons. \n\nSometimes you intervene and do some chores even if nothing is wrong with your partner, cause you don't want to burden them with everything - they're not a maid", "What if he set a goal to be financially independent and sacrificed his youth in order to attain that goal and now wants to enjoy the free time he never got to have? Does he not deserve that? \n\nI'm not saying the split needs to be exactly 50/50 but we truly don't know the circumstances here. For all we know it is not a very serious relationship. If she's upset about that, I agree she has every right to dump him if she feels he doesn't care enough to help her out. And he can decide what's more important to him, a few more chores or his independence.", "Some people aren't comfortable being leached off of. If op was happy working and doing half the chores when her bf was at work all day, then she should be fine now that he's got a better income stream. Literally nothing has changed except opwanting to take advantage of her partners smart financial decisions. He didn't become her maid just because she's mad he has more free time now.", "His age doesn't matter, all of that happened. Her jealousy does not = him needing to do her chores.", "Yes it can if you work trades out of high school or some lucrative executive position, dump all savings into reasonable investments and then move to a LCOL area.", "Go read OPs edits in her post, he worked hard for this since he was a teenager and she's more worried about him \"getting lazy\" now that he's achieved it. Just let the dude enjoy his life. Sounds like people in this thread are just resentful that he escaped the rat race. How dare he relax when I still have to go to work!", "Yeah and? I also couldn't ever be the person sitting home all day without feeling guilty about that situation, people can be different from you, and not want the same thing. I want a relationship where wins and loses are shared and we are one household financially but I don't date just to date I look for life partners, and that's already the relationship I have so I'm happy. OP is not happy, so the relationship needs to change or end.", "Yeah - for me I would loose attraction for someone who just laid around all day and couldn’t do a couple “acts of service” for me because they wanted to play video games 8 hours a day - even if their investments paid for that lifestyle.\n\nDoing a few extra things around the house would take about 20 minutes. And when your partner, that you supposedly love, is spending 8 hours outside of the home working, it should be a no brainer.\n\nOp - my guess is he’ll want to keep the relationship 50/50 forever.\n\nWill you be okay with working if you have kids? Will he make you split childcare 50/50 so he can keep gaming while you go to work since that’s what’s “fair”? Will you be okay working until you’re 60+ because he came into the relationship with “investments” and wants separate finances?", "Which is in fact a good argument for UBIs, as a square deal is the best workers can get, you can't have productive people supported by unproductive people, but you shouldn't punish people for being productive, either.", "If his investments tank he'll be working again though. Many things could change and he'll end up working again. I don't know if I'd call that \"retired\" just yet?", "The thing that distinguishes retirement from unemployment is permanency.", ">she certainly doesn't need it now.\n\nShe's literally asking for help.\n\nThis is such an incredibly selfish take. He has 8+ hours of free time that she doesn't, he can't spend 1 to help offload his partner? In my opinion, he's the leech, he's getting her to pay half and do half the work when he has wayyyyy more available time. Like, can you see how uneven this is? Your take is WILD to me.", "OP is not helping the person she \"loves\".\n\nOP is the one with her hand out.", "They can break up and he can do 100% of the chores? Like, this take is so shortsighted and selfish.\n\nDoing an extra hour of chores/cooking is not a big ask when he still has 7+ hours free that she does not. This isn't about \"oh no I worked hard so my free time should stay free!\", it's \"your partner is struggling and you can help out more, and still have a TON more free time than them\".\n\nSeriously, it's like half the people in these comments have never been in a healthy relationship and are all just roommates with benefits.", ">leached off of\n\nIs equitable living being a leech? lol. It's weird you had to jump threads and post on a different comment because you got downvoted so hard. \n\nIt's SO weird how you take it to extremes, \"become her maid\", is asking to split the chores differently than 50/50 suddenly make him the full time 100% maid? Dude plays video games all day, 8+ hours of extra free time, and still wants his gf to have almost no free time because he \"earned\" it. They can't split chores 75/25 and he still has 6-7 hours of extra free time she doesn't get? You want your girlfriend to work herself ragged with a full time job, 50% of chores, 50% of the cooking, and have no time for him, while he just sits around and \"relaxes\" for the vast majority of his day?\n\nWeird takes dude. If you only consider \"money in\" and \"chores done\", sure he's at 50%. If you consider \"available time\" and \"available energy\", he's ABSOLUTELY the leech and doing far less than what's fair in the relationship.\n\nI legit feel bad for any partner that gets into a relationship with you with this attitude.", "How is that different than retirement? You think retirement accounts don't tank?", "That's why I see all the 80 yo folks re joining the workforce when their investments tank. Age has nothing to do with it.", "If he went and roomed with another person he'd still have the same allocation of chores that he has today. \n\nI've been in an 18 year relationship and take care of a ton of shit around the house.\n\nBut I wouldn't demand my retired partner takes on more chores just because they happened to retire sooner than me. They earned that retirement and I'd feel scummy asking. But apparently this perspective makes me an awful, uncaring person?\n\nGo read OPs edits in her post, he worked hard for this since he was a teenager and she's more worried about him \"getting lazy\" now that he's achieved it. Just let the dude enjoy his retirement. Sounds like people in this thread are just resentful that he escaped the rat race. How dare he relax after busting his ass for years and do an equal amount of chores when I still have to go to work!", "People typically adjust from high risk/high return to low risk/low return in the years nearing retirement. Even switching to GICs, etc for that very reason.", "Exactly. What has changed besides her bf having more free time and being able to quit his job?", "Ok boomer. If doing a little bit extra around the house is \"ruining their retirement\" so that your partner doesn't feel overwhelmed with 10+ hour days, I think you have bigger problems.", "NTA - my husband worked hard all his life so he could retire at a young enough age to enjoy it,  I took care of him while he grew his career and made his retirement fund.  Now I'm working and, while he still makes significantly more than me, he handles more of the household chores so we can actually enjoy our weekends and downtime together.  He's showing his video games are more important than having free time with you - he could take an hour or two each day to handle a little bit of your normal chores so evenings and weekends can be together time but would rather just have \"me\" time.  Good to find this out before children and marriage - this is incredibly selfish.", "YTA\n\nIt sounds like he's contributing his portion of the finances as agreed, why do things change because he's able to meet those requirements without working?\n\nI've seen so many confusing definitions of *equal*\n\nAs an example, one party makes 4x the other party, so they agree to split the bills proportionality.  Meaning one person pays 80%, the other 20% because that's what they can afford.  Which I guess supposed to be equal... some how.  But when it comes to chores they both work full time so I guess those need to be split 50/50 based off a free time because now we just set aside that one partner pays 80%, now it's based off free time.  So the 50/50 is equal.\n\nBut then the partner who makes more has more responsibilities, sometimes has to work weekends and that's just their tough luck, that's them needing to work overtime and is not calculated as reflecting them making more and needing to put in more time.  I guess to be equal you count what the other party does.  If you have to do more, that's your own fault.\n\nSo the definition of equal is, if you can pay or do more you should, otherwise we split it.\n\nSo now we have this case,  the basic argument is, you have more free time so even though you pay your fair share, it's not fair that your free time go to you, you should pick up my chores so I also have more free time.  That way it's equal.  Forget that your success is yours, now your success is only fair if it's also my success.\n\nSeriously this guy needs a version of fair that actually reflects contributions to the relationship, not some one sided game that always benefits the other party.", "YTA- he didn't just quit his job and left all the responsibility on you for bills. He is holding his own in everyway based on your post you are mad because he has more free time than you because he sacrificed alot early to live the way he does now. Why should he have to do more chores because he planned and executed what he wanted out of life better than you. He does his part as you said but now you want him to do more for your own selfish reasons. He is not a SAHH and you don't pay all the bills. Do your share and stop being mad because of the choices you made in life.", "Just gonna say this, you found the 0.01 percent. If he has money he can replace you, millions of girls would kill to live a life like that. You will likely never find a man as financially well off as he is. He knows it. You now do. \n\nHonestly, you two should hire a maid. If he's made it and wants to veg he has earned it. \n\nThis is a case of you needing to really really understand your position. You can either add to his life or go. As soon as you become a drain or whine or complain or god forbid nag him he might just one day decide you aren't worth the hassle and find a younger more attractive version of you who isn't so annoying and is completely content doing house work for the tradeoff of enjoying financial security and the perks that come with money \n. \n\nYou need to drop the entitlement. Yes it would be nice of him to do house work, but honestly in his position he doesn't have to. Personally I would do a few bits and bobs around the house, but not a lot.\n\nIf he wants to veg all day then so be it. He earned it.\n\nThis is an issue with wealth gaps. He is quite literally above you. You now have to cater to him or he can simply leave and replace you. While he is quite literally irreplaceable.\n\nYou can slug it out in the dating market as a woman a few years older or deal with it and acknowledge the cost is worth it.", "Have you actually seen his finances? He's only had 9 years of full-time work available to him. He has to support himself for the next 60+ years off these investments, but you haven't said what they are. Is it real estate where he's paying upkeep, taxes, etc, on, and is one market swing away from being broke? Is it in volatile/ high-risk stocks/assets where he's set on paper now, but in 3 years, if the company goes under, his fortune is gone too?\n\nYou are NTH for asking for help, but I'd be more concerned about what happens if his nest egg isn't quite as big as you thought. I think you need to have a frank discussion about where his money comes from and how much he has, especially if you intend to financially entangle yourself more.", "If you're asking for his help because you're overwhelmed, you're not the AH... if you're making expectations on how he spends his time because you think he's being lazy, yes, you are.", "NTA. If he has so much money he should hire a maid.", "Start to look for another place without having to have roommates. Then you can worry about just your place and not having to depend on somebody to help out when you need it.", "YTA. The only thing that changed is where he spends his time during office hours, nothing else. He finally gets ahead to where he can relax a bit and you want to punish him with more chores? \n\nI bet you would have the same issue if he hired someone to do his chores while he was working. \n\nYou guys set it up this way and he's done nothing wrong by existing within that framework.", "I’m going to upset some people here but NTA. I can’t think of a partner I’ve had that would be okay with me not having a job, not studying, and not doing most of the household work. Even if I was able to pay my fair share. What you have isn’t a partner it’s a roommate who sees you a filler to whatever he’s lacking (sex, companionship, etc.) If he won’t do more to help you out even though he can, that says a lot about how he views and values you.\n\nIt would be different if there where children in the home he had to care for all day. Then I’d be calling you an AH, but there aren’t.", "NTA", "I don't think anyone is an asshole here. It's just a clash of values.", "YTA If he’s still paying his portion of bills he shouldn’t have to do YOUR chores. Unless you pay more and he cleans more.", "NTA. No relationship is perfectly equal, sometimes you need to give a little more or take a little more to ensure the person you love is doing well, you are partners. If I work 80 hours a week but my wife needs me to do something extra around the house because she’s overwhelmed with other things then I’ll do it. \n\nIt doesn’t matter if he works or doesn’t work, it doesn’t matter if he makes enough money to pay his bills, his girlfriend who I assume he cares about asked for some extra help and he is out nothing but maybe an hour of video games every day or every few days by providing that help yet he cant/won’t do it. It sounds like he might not be the best partner for you.", "You don't have a life partner or boyfriend. You have a roommate that are fucking.", "I think this discussion portrays a difference in cultural ideas.\nOn the one hand there is the idea: partners share their work and if one partner can do more for the other partner because they have the capacity then they are expected to do that. (This is mostly seen as a baseline for a more committed lifetime partner/relationship.) - from this picture the boyfriend is TA. And you WNBTA.\n\nBut a more modern view is that partners are more independent and their work/financial life is more independent from the relationship itself. I would say this impart is also more common in the western European and Scandinavian countries. This includes also the idea of you make an agreement on how the rules of the relationship are and stay true to it independently from a change of life circumstances if not both partners want to change. Assuming that in the time where he worked hard and life's frugal he still did 50% of the shores while you had more time and his life was more stressful - it is reasonable for him to expect the rules now where they are more in his favour to not change as well. In this case you WBTA. \n\nI believe that even for the below case there is a limit and that is if the partner is suffering - if the person is ill - needs temporary relief ... but if this is about a general change in the dynamic, then from the second case it sounds like you want to \"profit\" from the work he did when he was younger. \n\nIn general a node to all of the people who scream red flag and end of the relationship at every possible situation - although there are definitely situations this is the right response - keep these words for contexts where they belong and be empathic for different ways of living.", "I kind of think YTA(although I'd probably expect my man to do the same tbh ). He didn't retire early just to work at the house by doing all of the chores by himself. I get it , you're at work while you think he's doing nothing but video games & partying , you're a little envious. But if he's still contributing to his half of bills & cleaning , you can't expect him to do it all . Plus if this has been the way chores were split since the beginning, why should he have to change it ? If you guys had remained roommates & not started a relationship, would you still expect him to take up your chores ? If you're that tired though maybe suggest splitting a housekeeper one or two days a week to help with your part of the chores.", "Im a teacher. In the summer when I have off, I do a little more. Because I’m home and it takes me almost no time, because it’s less work for partner and he can come home and rest, and then we can spend more time together and both enjoy a better quality of life. \n\nNta.", "Question: Could he be retired appt this age if OP weren’t paying 50% household expenses? If the answer is no; I feel he should take on a little extra so the two can have additional free time to spend together. If the answer is yes; it is up to OP to decide whether she can adjust to this arrangement or not.", "This isn't how relationships work. It isn't 50/50, it's 100/100. You do what you can and you help to pick up the slack when your partner needs it.\n\n\nI'm a full time medical student. My annual contribution to our household is currently negative $100,000. (some of that of course is loans to cover daily expenses as well, but it is debt all the same) If we decided that chores were split based on monitary contribution, I'd be doing 100% of the chores. In reality, I rarely do chores because 98.6% of my time goes to school and studying or taking care of our daughter. My husband cooks, cleans, does laundry, you name it. He's literally out getting th epild changed on MY CAR right now. Because he knows how hard I'm working right now and he is happy to take over these tasks if it means I can focus on achieving my goals without burning out.\n\n\nThat's a partnership. Your boyfriend hears you asking for help and he doesn't care. He's only worried about what he views as \"fair\". I hope he sees reason and steps up. Because what he's doing is sending a very loud message about how much he cares for you. Or at the very least, showing a gross lack of empathy.", "Ima say YTA but maybe NAH. He spent the last 15 years of his life sacrificing everything and working his ass off while holding this dream of early retirment. Now that he finally achieved it he is clearly going to want to hold on to that free time and enjoy himself. He didn't sacrifice his youth so that he could swap from a job to being in charge of all the housework.\n\nThat said it would also kinda bother me to have a partner that just chilled at home all day and just happily watched me struggle. \n\nBasicly I think he is more then reasonable to hold on to the dream he worked and sacrificed so much for, at least for a few years. But I also get how it would make you feel weird.", "NAH. You are not his wife. He already does half the housework. Asking more is just being jealous of his free time.", "YTA he cover half the expenses and half the chores. Why would you be entitled to contribute less?", "YTA. He is doing half of the chores and is paying his half. He wasted his early life for that, he deserves the return on investment.", "YTA. He earns his free time. It's not yours. You can ask. He can decline.  Maybe both of you can contribute some money toward a part time maid to do the chores?", "YTA, he is doing his part of the chores, he is contributing his share money wise. He is sitting at home but he has earned that right because of his earlier hardwork, whether he plays video games or goes to work in that time, it’s his choice. It would have been great if he were willing to help you out more, but you can’t force him to take on your chores.", "8/10 dudes who's main \"hobby\" is playing video games are shitty partners with poor work ethic. Just get another.", "8/10 dudes who's main \"hobby\" is playing video games are shitty partners with poor work ethic. Just get another.", "Info: by requesting doing more chores, did you suggest that you are willing to pay his share or at least more than half of the bills?", "NTA, this is not how a relationship works, this is how being roommates works. Roommates divide their responsibilities 50/50, a relationship is a living, breathing thing that evolves and adapts according to each partner’s means and needs. Someone gets sick, the partner steps up and takes care, someone loses their job, the partner takes on more of the financial burden. In your case, you have less time or energy for chores, the partner that does sweet f-all all day takes some on. Without being asked. \n\nIt’s not about how much each of you is contributing to the money or the chores but TO THE RELATIONSHIP. And he is contributing less, by the sounds of it. Honestly, I would really take a step back if I were you and reevaluate whether this is, in fact, a relationship, or whether you’re just roommates with benefits.\n\nAnd this “retirement”? Would he be able to maintain this retirement if he was living on his own, paying full rent, utilities, food, travel and household costs? If that is not fully 100% the case, then he hasn’t retired, he has just decided to let you contribute half of his monthly needs while he sits on his arse. Just something to think about.", "INFO. You said he has investments so he has passive income so he could retire early. Was that as a single person? What is his plan for the future? Are you going to get married? Have kids? Does his financial planning include the expenses of having kids? What about buying a house? \n\nI get he worked hard, saved as much as possible to make this happen, but especially if he is already there, how many more years would they both have to work for her to be able to do the same thing? I’m having a hard time imagining a long term relationship where one person is retired at 27 and the other has to work till they are in their 60’s from either side of the situation. \n\nI’m concerned this relationship isn’t going to become a partnership as other have mentioned. If he is only planning for himself at what point does his thinking change? It really does sound like a roommates with benefits situation.", "I am going with YTA. You want to give him work bc he invested and can financially support himself and take care of half the household chores with no problems. You don't want to make sure his idle hands don't become detrimental, you just want to do less for your home. Men get roasted bc they dont go 50/50 on household chores if both people in the home are contributing financially. You are no different my dear.", ">But I thought that not doing anything productive could become detrimental to his well being\n\nThis is frankly not your call to make and it's also very condescending of you.\n\nYour boyfriend had a goal and he worked towards it and achieved it. If you disagree with the amount of time that he is spending on his hobbies now that he retired early then it's honestly a you problem and maybe an incompatibility. But you don't get to control what he does with his time and you also don't get to patronize him.", "🚩🚩🚩🚩 NTA. Run now before it's too late. Are  you ready to continue this life for another 3 years? Think about it. Do you want care or selfishness? Just things to ponder 😏", "Nta. But could y’all budget and get a cleaning service for a brief time to help if not just go a few nights without doing certain chores and pick them up the next day", "NAH BUT I’d say that BF isn’t really thinking of himself as being part of one team with shared goals.\n\nMy husband and I agree what our goals are as a family, couple and individuals and our time and money goes towards making those things happen. We don’t look at how we are divvying up chores or money and strictly split it down the middle. We look at what needs doing and figure out how to get it done. If one person is struggling and the other is playing video games (really?) the obvious solution is for the person with more leisure time to pitch in more. You guys aren’t roommates trying to make sure you contribute equally. “Sorry dear, I can see you’ve had a rotten week at work and the laundry isn’t done yet and the baby is covered in poo but hey! I put in my 50% effort and it’s not fair if I help you. Sucks to be you!” Very modern I’m sure but not terribly loving in my books. I’d find someone who is interested in being on your team; in my experience those are the keepers.", "YTA.\n\nYou're basically punishing him for being successful.\n\nIf his retirement means he has to do an extra few hours of chores a day, he would be much better off going back to work, retaining the current chore split, and making extra money from the job... by working the same amount.\n\nIf he knew that retirement was going to mean that it increased his chore workload, he probably wouldn't have retired. I wouldn't have.", "Life is change. Stagnation is death.\n\nSituations in life change - constantly. If he can't change with them, I'd leave him behind. What's he going to do if/when you decide to get pets or children or let some family member in need move in with you?\n\nPersonally, I'd re-evaluation my life's choices at this point.\n\nNAH -- not really, just some jerk-light behavior on his part.", ">Are the chores actually split evenly? Does he do half the household work?\n\n\"Now he does do his portion of the chores\"\n\nit's implied.", "Uh, they would say the same, that the person who doesn't have a job does the majority of the chores. Period. It's not about the money, it's about the time.", "And *I'm* sure if the roles were reversed, and a man was demanding that his wife--who front-loaded her career and retired early, but still pays her share of household expenses and completes household chores as she's always done--now had to take on the overwhelming majority of the housework and become the family housekeeper, he would be downvoted back to the stone age.", "Wait until it doesn't dry up and you dumped a guy 30 years ahead of his peers because of your ego lmao", "Did anyone else catch the part where she said she comes home and cooks dinner for herself? Like when she says they split chores evenly does she mean they basically take care of themselves and not things like one person cooks and one person does the laundry?", "Tell me you have zero idea what gaslighting means. Nothing in this situation even remotely approaches gaslighting behavior. BF just said they should keep the split of chores equal since they were still splitting finances equally, which is a bit shitty since he's not working but also fair since he's still contributing. What he's not doing is fucking lying and trying to convince OP that her reality is false, which is the definition of gaslighting. He's also not really being lazy since he's still doing his share of the work and OP also says he does other stuff around the house. Please stop throwing bullshit psychology terms around willy nilly.", "On the flip side though if any person worked themselves to death while sacrificing everything for 15 years based on the dream of early retirement, there obviously going to want to enjoy that for a while after achieving it.", "I’m sure you’ll do half the breastfeeding then!\n\nNot everything in relationships (romantic or otherwise) can be a perfect 50/50 split, everyone has a unique set of circumstances and ideally people in a relationship can adapt to changes in those circumstances. I used breastfeeding as an example cause it’s one thing a man would not be able to do half the time, and I doubt it’s the type of thing taken into consideration when you thought about showing your wife that comment. \n\nWhile formula etc are options, if you’ve chosen together you’d prefer your child to be breastfed, what chore are you going to do 100% of to make up for that imbalance? Or is it just too bad for her that she had to destroy her body to bear your spawn and she shouldn’t expect a single thing to change in terms of household responsibilities while she recovers from bodily trauma? \n\nIf you lost your legs would you want her to insist you maintain the exact same chore distribution because she’s working while you stay home all day on disability?", "The difference being your wife is *also* working all day. Taking care of your baby.", "This is fair... If she is home and you're working, she should pick up the slack. I have been both a stay at home and working mum over the years (they are 16 and 9 so I've been doing it a while now). I'm not saying don't help her, im just saying the home person should be doing more of the home duties. My partner barely done anything after getting home because I WANTED to spend time with him, and that's how a relationship should be. Also to be clear I wasn't just man bashing... there is some horrible women out there in the wild too.", "Yeah OP is TA.", "Time IS money lmao.", "Spoken like someone who has no hope of an early retirement so they want to leech.\n\nThe guys goal was, without a doubt, to have their free time. That's why they worked so hard towards the goal of retirement. This undercuts their goal entirely. You are doing what corps do. Rewarding good work with more work. That wasn't what motivated him.\n\nShe doesn't understand this person she's dating. Or she does and just resents him. But either way? She's being a terrible partner to him. He achieved something few achieve and many dream of. And she's trying to take away the primary benefit. Not because of a work catalyst temporarily. A single piece of work really eating at her and it'll be done in a month. Permanently. Because she resents his freedom.\n\nShe's being a bad girlfriend.", "YES\n\nIt’s resource investment. Resources are time and money.", "It doesn't depend on gender. My opinion would be the same.", "And she isn't responsible for putting up with a lazy partner.  It's chores today but later on down the road, she's setting herself up to be with a dude who thinks his only obligation is to sit around playing video games.  Personally, I think the fact that he has the benefit of financial security without employment yet sits on his ass doing nothing all day is a huge red flag.", "He is a man. That's the reason people are mad at him. No one would bat an eye if the genders were switched. I think the whole post is bait, tbh", "His partner only got overwhelmed because he's got free time. She hasn't been talking about that big project that ends in a month that she could just use a helping hand to deal with. She wants permanent change and mentioned no catalyst other than his retirement.\n\nShe wants to leech and feels resentment that he got to retire and she didn't.", "I disagree. Apparently, he spent 15 years of his life sacrificing everything and working constantly for the dream of creating an early retirement and a life of luxury. 6 months is going to feel like just settling in to his new life of free time after that many years of constant stress and self deprivation.", "I mean if hes free all day taking on a few more chores won’t take away all his free time. Besides if he was single he’d be doing those chores anyways but he’s so have reached his dream of retiring.", ">I'm sure if roles would be reversed, he would expect you to do more chores.\n\nOkay... but, wasn't gender central to the point you made...?", "Can I ask how old are you? This feels like an extremely dated mindset.\n\nThe same could be reversed here. Doesn't OP have any ambitions? He's already retired while they haven't even tried hard enough to be able to retire yet. Has she considered extra schooling? Maybe working for a better job so she can retire soon? Does she have any other goals or interests or does she just want to work this job forever? Does she get enough exercise done? Maybe she should spend more time at the gym that would help her energy levels so she doesn't struggle to manage work and chores like everyone else that works?\n\nSuch a one sided view, and disdain of how he chooses to spend his time because it doesn't fit with your personal values.\n\nYou have spent literal years playing a mobile game, how is that any better? \n\nThis man's job is managing his wealth and investments. Just because it takes him less time per day because he worked hard(er) until this day doesn't make it less valid.", "OP became overwhelmed when she saw BF enjoying his hard earned retired lifestyle.\n\nOP is jealous.", "It's not a temporary request though. She wants him to continue to pay his fair half but do more than his share of the chores permanently.\nI think OP needs to work on finding a new job which is less stressful since that seems to be the problem not her partner.", "Equity is everyone getting the same experience when young. The bf sacrificed his youth for this. Op didn't. \n\nWhy should she now benefit from his sacrifices when she lived her youth?", "I'd say yes if that person wasn't pulling their weight, but since OP said he worked very hard to get to a point where he's financially independent I'm not sure it's fair to say that he should pick up the slack for others who didn't put in the same effort.", "No, just no. He sacrified a lot by a frugal livestyle to have this freedom. Why should he be a SAHD for her, when they split. Its not like shes oroviding for hom and his part is doing the chores.", "We agree with that but to expect him to do it every single day he doesn’t work isn’t ridiculous she didn’t just magically become overwhelmed and tired she just want him to do more because he doesn’t work", "All of it? No. But he also has absolutely no obligation to take on more than his fair share. Which is what he does already.\n\nAnd that's also not true. If he was single and decided to get a roommate and divide up chores he'd have the same workload he does now. Hell, if he's retired he might prefer that lifestyle. Built in socializing if it's a roommate he gets along with.\n\nBut that roommate wouldn't start feeling entitled to his free time in the same way this bad girlfriend has.\n\nLook, you have to view money the way he views it right now. Money and time are the same resource in different forms. You trade your time for money. He traded his time for money. Now he has enough money that he can have time without trading any of it and that makes him happy. Suddenly someone wants to take his time again.\n\nShe really doesn't understand this person she's with. The mindset he has is going to be why he was able to retire early. It's also what makes him guard his time as if it was money.", "Most people who retire don't have personal cleaners. What are you talking about?", "Or, OP has been overwhelmed, and now that he’s had six months to chill out, she thought he may have the free time and extra energy to help her a bit. \n\nNo one but her can really know her motivation, but typically if you’re in a good relationship, you can give your partner the benefit of the doubt", "Because you don't even know that he did all those things, first of all. And even if he did, it doesn't cancel out that his gf is also working hard.", "Idk, because they're in a relationship and presumably building a life together? If I didn't have to actively work but my partner did, I would want to arrange things to where we enjoy life together. Maybe that would mean I do some more chores so we can relax together when they get home, maybe we'd both get part time work and both have more free time, maybe I wouldn't do more chores but hire someone to take up the slack. \n\nI think the main issue seems to be that they are still operating under a roomate agreement --- everything completely separate, 50/50 down the middle --- rather than transitioning to a partnership --- things are considered more collectively and 50/50 on everything isn't really realistic. \n\nMy dad still did chores even when he was the sole income earner, because he was part of the household, and being able to spend quality time with my mom was more important to him that keeping score of every contribution to make sure everything equaled out.", "You don't even know that.", "Yes you did quite frankly lying about make it worse you said relax and your original comment thing changed it nothing to be ashamed of dear\n\nIt a lot wrong  with it because the one who getting home first preparing dinner will always have to prepare dinner because you know work goes based of schedules \n\nMe and my husband have a system if one of us feels low we help each other and do more but I would never expect my husband to daily take over part of My chores just because he isn’t working even though everything is still split \n\nOp also refuses to pay more even though she is currently making more since she’s the only one currently working \n\nMy problem isn’t really with you judgement it’s how your phrasing your comment your acting though he is selfish and doesn’t care about her because he doesn’t want to do part of HER chores every single day \n\nShe didn’t suddenly become overwhelmed.She just jealous her boyfriend can quit for sometime while she can’t so she believe he should do more", "So what is his fair share? Is it 50:50 regardless of how much he has and how much his partner has? Or is it his fraction based on how much he has and how much she has?\n\nYou’re right, time and money are interchangeable. If he’s a lot richer than she is, he might pay more of the bills right? \n\nCurrently he’s got a lot more time than she does. So it would make sense for him to contribute more time.", "Not to mention, If he was single, there might be less washing up e.t.c.. so no, he would not be doing all the same chores if he was single as the other commentor suggested.", "Most people who retire aren’t 27. What are you talking about??", "Because it's her responsibility and he has no obligation to.\n\nNobody is arguing he can't pick it up. They're arguing he shouldn't have to and she's entitled for thinking he should have to. She can ask. That's fine. He can say no. That's fine. Her pity party is why OP is TA.", "That's not at all the point. It's not \"he gets, or deserves, more money 'cause he's rich.\" \n\nAs explained by the OP, is that he front-loaded his career. He focused all his earning potential into his early years. As the OP says, he didn't take part in the usual social or recreation activities when he was a kid in order to maximize making money. This is like a professional athlete who makes their career's worth of income in their 20s. \n\nOr, this is like a kid completing all their weekend's worth of household chores by Friday night, and a parent saying since you have all this found time, you're now in charge of everyone else's chores, too.", "Why should she be sacrificing almost the entirety of her free time, when that is literally all he has? Why would he *not* want to free up her time, reduce her stress, and allow them more, and higher quality time as a couple?", "If he made enough to retire from investing, he basically won the lottery. \n\nPeople will say “oh it’s because I was smart and timed the market” but it’s all bullshit. The stock market is unpredictable even for people who have studied it for years. \n\nHe got lucky.", "You’re really assuming a lot of things here. Who said OP was partying, spending frivolously and not thinking of the future? OP and BF are both 27; how many people that age have saved up enough money to retire just by working hard and saving up money? A lot of people that age are still paying off student loans or saving for a house etc. Fact that BF is able to retire sounds more like a rich/privileged kid that invested wisely or something like that. Not every young person has that opportunity. \n\nFurthermore, if the person you are in a relationship with and who you’re supposed to love deeply is telling you they feel overwhelmed and would appreciate some help, why would you refuse unless you’re just selfish/lazy?", "I sincerely do not believe that you or that most people would.", "Yes, you can give your partner the benefit of the doubt, however, the OP wants to make this a permanent change which is very unfair.\n\nBF has stepped up to the plate in times to help on a case by case basis as stated by OP, herself.\n\nBF does not want this to become permanent which I totally understand.\n\nBF worked hard as a young teen to afford the lifestyle he wanted.\n\nWhen others were playing hard, wasting money, living frivolously, etc, BF had his nose to the grindstone to achieve his goal of early retirement, why should he not reap the benefits?\n\nOP is jealous and selfish.", "OP said he did all those things.\n\n\"He is able to retire now because he has been working towards it since he was like 15 or 16. He was very frugal about spending money on himself. Sacrificed almost everything a young person experiences like going out, parties, even friends(he has like 2 to 3) and sleep. His target was to retire at 30 but he got a little lucky(his words).\"\n\nOP is working hard now.\n\nBF worked hard then and for many years according to OP.\n\nHowever, her responsibility for her share of normal household chores is not eliminated because she is working hard.", "This entitled mindset is incredibly selfish. Thinking that someone providing half of the resources and doing half the housework is not pulling their fair weight is insane.", "According to OP he started working at 15 and has been living very frugally and investing well.  You don't need a degree to make a good salary.", "50/50 is fair. Equity is someone attempting to leech. You argue for equity. You argue for her being a leech.\n\nThis is a girlfriend not a wife. This is cohabitation not a marriage. It may be a step on that road. But not if OP keeps up her selfish entitled behavior.", "Retirement the status does not indicate enough wealth to hire servants and maid services. It only indicates the ability to not have to work to make ends meet.  \nYou can reach that status at any age. Some are more probable than others.  \nDo you understand now?", "OP became overloaded because she is jealous of all BF well deserved, hard earned free time.\n\nIf OP wanted a similar lifestyle she should have thought ahead and worked hard and scrimped and saved. \n\nOP said she is afraid BF would get \"lazy\".  Reeeeeeeeeaaaallly...................\n\nOP is jealous.", "I mean, I have done that. It’s very natural for partners to go through phases where one person leans on the other a bit more. Even if it’s just for a few days here and there. \n\nMaybe it’s not realistic, but it’s something I’ve always been able to do in relationships and my partners have never objected", "Sure, but we don't know what he started with, or what she did. Everyone has different circumstances. It's not a penalty to help your partner by taking on more chores bc they're overwhelmed rn. \n\nAnd I don't see the difference, tbh. She's working hard now, he worked hard then.... so what do her sacrifices mean? Nothing? She's doing full time school and a more than full time job. \n\nI do more to help out my coworkers than this dude is doing to help it his partner.", "No one said he wasn't \"pulling their fair weight\", you really need to learn to argue the actual points, not throw in hyperbole and fallacies.\n\nThe ONLY thing their arrangement is fair on is \"money in\" and \"chores done\". The way you put things, available time isn't a metric you care about at all. She's working 10+ hours a day on work/transport and chores. He's doing what, 1-2? And it's \"unfair\" and \"selfish\" of her to ask that he contribute more so they can spend time together? She's not even demanding, she's ASKING if he could pick up some more work because she needs help and would also like some leisure time, ideally spent with him.\n\nI can see why you're just \"in a relationship\" and not actually married, it's so selfish to not want to help your partner out when you have nothing but free time and they're spending the vast majority of their time working. Would it kill him to put in an extra 30-60 minutes per day? In your mind, it would ruin his whole retirement. Damn.", "OP is overloaded because OP works and OP’s BF is home to dirty up the house more.", "No one is saying BF should not or has not stepped up and helped more on a case by case basis as the need arose.\n\nOP stated BF has done exactly that as the situation occurs\n\nThe problem is that she wants this to become a permanent change.\n\nShould one expect a SAHP to be willing to babysit for family member because she is home anyway or her children are in school and has the free time?", "Uh yeah..\n\nI was talking about the bf obviously. If you can't be bothered to help your partner in a relationship, no strings attached, get out of that relationship, it isn't gonna last anyway.\n\nShe asked him for help and if he loved her he would've wanted to help her simply cause he loves her and she asked and he saw she was struggling. \n\nI know I would and I have many times and the feeling has been mutual.\n\nIf he just wants to be her room mate groovy....he isn't obliged to help her with anything then and they can split equally", "Yes, equity is one person being a leech and another person being leeched off of. To answer your question directly.\n\nPeople who want equity are leeches or would be leeches.", ">The ONLY thing their arrangement is fair on is \"money in\" and \"chores done\".\n\nSo everything is fair then.\n\n&#x200B;\n\n>The way you put things, available time isn't a metric you care about at all.\n\nBecause it's totally irrelevant. You are correct. It is not a factor.\n\n&#x200B;\n\n>She's working 10+ hours a day on work/transport and chores. He's doing what, 1-2? And it's \"unfair\" and \"selfish\" of her to ask that he contribute more so they can spend time together?\n\nCorrect. Because you aren't factoring in that he did, almost certainly, far more than that in his early life in order to earn this free time. You are ignoring that cost he paid in his early life with a resource he can never get back. Time. Young time at that. The healthiest time.\n\nSo yeah, she's horribly selfish and can't even see his perspective. And you seem to be the same.\n\n&#x200B;\n\n>She's not even demanding, she's ASKING if he could pick up some more work because she needs help and would also like some leisure time, ideally spent with him.\n\nNo, she's demanding. She's doing it with indirect tactics, throwing a big fit about it. But she's trying to get him to do what she wants. She didn't just ask and let it go. It's a demand. One she might eventually give up on. But she's demanding.\n\n&#x200B;\n\n>It's so selfish to not want to help your partner out when you have nothing but free time and they're spending the vast majority of their time working.\n\nAgain you are ignoring the cost he paid to get this time. Acting as if it's just a windfall, good luck, and that he hasn't pushed harder and exhausted himself more in those earlier years than she did to get there. Retiring at 27 scrimping and saving from 15 on is not trust fund money. This person worked hard to get there and is finally getting to see the fruits. And not even 6 months later their entitled girlfriend is trying to exploit them because she doesn't understand, not really, the price he paid and the work he put in. She resents him for making it to his goal and having the thing he bought... because that's what his time is right now. He bought it back from the system. And she now wants it. She wants to take something worth more than money to him and use it for stuff she just doesn't want to do.\n\nIf she can't come to realize this she's an awful girlfriend.\n\n&#x200B;\n\nHow's that for \"responding to the points?\" Even though I did it the first time. It's the obvious implication of the equity argument. That \"fair\" should be redefined so the leeches benefit.", "Brawawahaha............. he dirties up the house more and you know this how?\n\nYou certainly assume much.\n\nHe may be one of those people who cleans up after himself.\n\nAnd since the chores are split equally, what extra work?", "I'd feel scummy if I was retired, enjoying my free time, only for my partner to come home after a full day's work and me to continue sitting around doing whatever while they have to do chores. \n\nIn my experience, whoever retired does take on greater than 50% of the chores, because the thing that's important to them is spending quality time with their partner. My granddad basically became my grandma's sous chef when he retired. He'd prep and lay out everything for cooking dinner each day and when she got home she'd do the actual cooking, and I'd follow him around the house as he did other chores. Now that my mom's retired before my dad, she does more around the house than she used to. \n\nAlthough honestly, based how OP described how her bf came to be retired before 30 (sacrificing a social life, etc.), it wouldn't surprise me too much if their relationship was more convenient for him than anything else since they were already roommates before they got together. He might not be in it for the long haul now that he has the time to look for different options. But maybe that's cynical.", "If someone makes it a life goal to retire early and pulls it off only to have everyone around them trying to take away the thing they worked hard for... free time... that's a relationship that doesn't work because she's failing him. Not the other way around.\n\nIt's convenient that her stress and need for help suddenly increased when he got to retire. It's almost as if she's not feeling this way because of outside forces but because she's resenting him achieving his goal. And that makes her a shitty girlfriend. Not him a shitty boyfriend.", "Like, oh no, how dare this poor wheelchair kid get a fancy ramp when the tall guy gets nothing, equity is LEECHES: [https://pbs.twimg.com/media/DeXtI2qUQAAEiBt.jpg](https://pbs.twimg.com/media/DeXtI2qUQAAEiBt.jpg)", "Man, your worldview is so off, but you’re right, you did at least give your (outdated and selfish) opinion on each one of my points. \n\nIs a 60/40 chore split “stealing/leeching” from this precious boys young life spent grinding? What about 70/30 so that his girlfriend has some energy at the end of the day to spend with him? Is spending 30 minutes a day while he’s at home for 8 hours not working unreasonable?\n\nAttitudes like this end in divorce and dead bedrooms, I’m amazed any partner would put up with this level of selfishness and “I got mine” without an iota of supporting their partner."]}