{"id": 2719, "submission_id": "yzek39", "title": "AITA for banning my mom from my house after she brought resin and glitter in to make a point about my wife?", "selftext": "My mom and my wife do not get along. That is actually an understatement. They can hardly manage to be in the same room, but we get along great with the rest of the family as does my mom, and neither is willing to sit out of family stuff.\n\nMy wife does get overwhelmed by my mom and everyone tends to gather around my mom, so our therapist suggested that she bring something she can do when she needs a break, so she has been bringing crochet.\n\nMy mom got annoyed by this and said it was rude and something a five year old would do, and said if she ever brought something to our house and tried to go into the other room and ignore us, we would raise hell. to be fair that is kind of true. My wife is really big on manners but doesn't always uphold the standards she holds my mom to, so I told my mom that wasn't true. I joked my mom could learn how to crochet (because none of her hobbies are something you can bring to someone else's house)\n\nRecently we hosted a family get together and my mom had a large bag when she showed up. I honestly didn't think anything of it. We were all outside and my mom casually told me she needed a break, so I said that was perfectly fine. See no double standard, she can go inside and chill.\n\nMy uncle later went in to get a beer and came out laughing and said I need to see what my mom is doing. My wife and I ran inside and my mom was working on an art project at our coffee table. She had resin, glitter, beads, shells, and my wife lost it and began screaming.\n\nMy mom said we were being hypocrites and she was doing exactly what my wife did, her hobby is just messier. I told her to get out, cussed at her, and said she was banned. She said ok and then told us the glitter on the floor isn't her fault, her husband did that. I told her to get the fuck out and never come back. She got glitter and tiny beads on the rug, and resin on the table.\n\nMy aunt and uncle defended her and said I was being unfair and my wife is super rude to bring crochet to family stuff. My aunt said if my mom is banned from our house, we are banned from hers and I can't go to Thanksgiving. My cousins tried to defend me but my aunt was serious. Even my cousins after the fact said it was kind of funny and not that big of a deal.", "created_utc": 1668872080, "permalink": "/r/AmItheAsshole/comments/yzek39/aita_for_banning_my_mom_from_my_house_after_she/", "score": 140, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My wife is doing something a lot of people would consider rude or socially unacceptable but I back her. I told my mom she could do the same and didn't specifically limit what she could bring. I yelled at her and called her names, and banned her which might have been too extreme\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Great! Now I’m worried everyone thinks I’m an AH because I bring crocheting everywhere with me! I thought it was because of my abrasive personality not my hobby…", "NTA\n\n&#x200B;\n\nYou did not ban her for bringing a hobby, you banned her for ruining your rug and table on purpose. And she is an AH harassing your wife on purpose.\n\n&#x200B;\n\nSo go no contact with your AH mom, and keep it that way. Refuse to discuss it with your relatives.", "Crochet is a quiet, non-messy craft that doesn't disturb anyone. Your mother's glitter-resin activity took over your living room and messed your rug. Your mother is also very aggressive in her attacks on your wife, she simply cannot let your wife have one small thing for herself, even the crocheting she has to make an issue out of. \n\nI think you need distance from your mother, aunt, the whole family. Make your own thanksgiving and traditions, because this is not healthy.", "NTA. I bring my crochet everywhere. It’s super unobtrusive. Glitter? That shit is craft herpes.", "NTA - send her a glitter bomb", "NTA as others have said, it's extremely normal to bring knitting or crocheting with you to family gatherings. It's not normal to bring a whole damn craft table. To make things even worse, your mom knew full well what she was doing and did it to be rude and spiteful.", "NTA\n\nLots of people crochet and knit when they're at social gatherings. There is nothing rude about it at all. Was your wife leaving the room to do it, or was she only using it to keep her cool around your terrible mother? Either way, your wife is still not the AH.\n\nYour Mom is the AH here. She's being completely unreasonable about your wife crocheting, and bringing some huge messy art project to your house was 100% purposeful and passive-aggressive (not even passive-- just aggressive). Now she's seen the consequence of that. It sounds like you aren't missing out on much not having her around for the holidays!", "NTA.  Your family dynamic sounds messy, and I'm not just talking about the mess your mom left on your coffee table.  What your mom did was deliberate and spiteful to your wife.  Your wife is just following her therapist's advice.  I don't blame you at all from banning her from your house.", "NTA -- I often bring crochet and knitting projects to people's houses. My friends pretty much expect it now. I can socialize just fine, and no one needs to clean up after me. (Edit: They also kind of like the fact that I'm totally fine with babysitting duty because I can do that while knitting too.) \n\nUnless your mom is normally an avid maker of messes, she clearly was doing it to bother you. A permaban might be kind of excessive. I don't know though. I mean, it doesn't sound like she is willing to cut your wife any slack at all, and I don't know how you negotiate with someone unwilling to budge.", "Your mother sounds like a spiteful child. I'm going with NTA just for that. \n\nYour wife isn't going to ruin any property with yarn.", "Please invite your wife to join us on r/JustNoMIL. Your wife was doing what her therapist suggested for her to cope, and your mom is obviously the source of the anxiety. Good for you for standing up to her. NTA, but your mom sure is one.", "NTA\n\n> She had resin, glitter, beads, shells, and my wife lost it and began screaming.\n\nIt wasn’t that your mom needed a break that was the problem.\n\nIt was that she brought something that was going to be difficult to clean. And it was a setup - your mom didn’t need a break, she was out to punish your wife.\n\nYour mom choose to do something destructive as a fuck you.\n\nYou are not being unfair. It is not rude to bring crochet, and bringing crochet is NOT equivalent to something destructive that a host will have difficulty cleaning up.\n\nPeople do get overwhelmed - your wife was making an effort to continue to go to family gatherings in spite of that.\n\nYour mother is not.", "NTA. Your wife is just doing a harmless coping mechanism, that was recommended by her therapist; it's not meant to be rude, it's for her health. Your mother is being petty, vindictive and vicious - attacking your wife for her own selfish gratification. Your mother should be ashamed about her behavior and any relatives backing her up are no better. Your mother doesn't like your wife, that's why she chose to be angry about the crochet rather than understanding in the first place. She obviously doesn't think much of you either, since this attack occurred in your home, against the person that you love.", "NTA. My sister brings her crochet everywhere, always to family gatherings, it's no prob and we like seeing what she's up to. Your mom was being unreasonably controlling, and then intentionally damaged/destroyed some of your personal property. Are you sure your mom is an adult?", "NTA. Crochet and Knitting are hobbies that people bring everywhere. My mum brings it to all functions, as does my sister. My dad says he used to have people bring it to lectures to keep their hands busy. People crochet on the bus, on the train, wherever.\n\nCrochet is not comparable to resin crafts. I would never bring resin crafts to someone else's house and set up in their living room. It's messy, it's toxic (like literally resin is a toxic substance) it belongs in a craft space. \n\nWhat your mum did was rude, and childish.", "NTA\n\nWhy are you exposing your wife to this hateful and spiteful hag anyway?", "Your mom is an asshole", "NTA. If your mother is sticking to her \"this is an innocent hobby\" excuse next time you go over bring some stuff saying you have a new hobby of making chartreuse boards and open a can of surströmming and put it on some crackers. When she complains about he smell tell her she's being a hypocrite and your hobby is just smellier.", "NTA. What your wife decided to do with her crochet was absolutely harmless, hurting no one, and it let her relax during stressful situations. But your mother, honestly, is determined to take offense at anything your wife does. \n\nAs far as your mom’s “hobby”: if she honestly wanted some time out to relax, that would be fine, but she specifically chose something to mock your wife, and something that would be as messy as possible. And she made a point of leaving a mess when she left. This is being passive aggressive at its best (with an emphasis on aggressive). This was a pure spite move on your mother’s part, and she was actually surprised when you realized that and took it badly?\n\nAs far as the people who say that the crochet is rude: they are wrong. Just wrong. I am an introvert myself and need to retreat from social situations from time to time. Little hobbies like that are ways to relax and recharge. \n\nGood for you for defending your wife!", "Had your mother just showed up with shells i maybe might have said e s h. \nShe went full petty with glitter which will still be around next Christmas. \n\nI actually support the knitting/ crocheting, especially in anxious times, and dont see how it is inherently rude. But it seems maybe your wife isnt applying manners in the process.\n\nEdit- NTA", "Your aunt and uncle should offer to pay for the damages your mom caused if they think she was just doing a project. NTA", "NTA \n\nYour mom though 🤷‍♀️\n\nThis crap is the women's version of a pissing contest.  It sounds unfair for your wife to put up with your mom's baiting her.   It sounds like that your mom is going to push your wife to the point where wife no longer participates with your family.  That is just emotional blackmail.", "NTA. And as an avid crocheter, I would avoid your judgmental family and take my craft somewhere it was appreciated.", "NTA.  I bring my crocheting with me all the time.  It's not considered rude because I sit in the room with everyone else while I'm crocheting.  I still hang out and interact with everyone, but i just have my hands occupied.  I have lots of other \"hobbies\" but I have never left a mess or glitter bombed someone's house.  That is not even in the same league.  That is seriously WTF.   Your mom was really out of line with that.", "Oh my gosh your mom is the AH. I feel bad for your wife. Geesh!", "NTA. Your mother wanted to make a mess under the disguise to prove a point.", "Wow.  NTA.  Your mom sounds very petty.", "NTA. Crochet doesn’t involve glitter and resin. Your moms being unreasonable.", "NTA. \n\nYour mother is an adult. She really ought to start acting like one.", "I have been known to take my knitting into my kids school and do it while waiting to speak to a teacher🤣", "NTA. Hope you can make other plans for Thanksgiving and enjoy even more away from them.\n\nPretty sure you are going to happier without the drama.", "NTA\n\nA quiet activity that makes no mess is one thing. Glitter and resin ruining rugs and furniture is another. Your mom did it deliberately to screw with your wife.", "NTA\n\nI can see why your wife has trouble getting along with your mum. Expect her anxiety to clear up the moment you go no contact with your mum and her flying monkeys. \n\nCook your own hassle free thanksgiving dinner! Share it with friends who are also celebrating alone or (my favourite) non US friends who just don't get Thanksgiving. \n\nKeep being an awesome husband!", "Glitter’s number one purpose is to be shiny, and number two purpose is to annoy people long long term, since it seems to last forever. She did it intentionally\nNTA", "Considering you’re ONLY supposed to work with resin in a well ventilated area while wearing a respirator, gloves and eye protection, I’m gonna go ahead and say it’s a liiiiiiittle bit different than just whipping out a ball of yarn and a crochet hook. NTA.", "NTA. Doing needlework during a visit is a very old tradition. There was a time when it was thought that a woman's hand should never be idle. I knit all the time. I have family who knit. I am asked to bring my knitting.\n\nYour mother is just being mean. She's the 5 yo in this situation. No one in your family is being kind or considerate to your wife. Sometimes someone's family is a bit much and some quiet time in another room is needed.", "NTA. Your mother was being a controlling jerk on purpose.", "NTA - That woman brought craft herpes into your house. Time for barrier protection.", "Nta, your mom sounds like a massive piece of work and a massive asshole. Your therapist suggested the crochet, who is your mom to judge and make comments about that, and then to mock the situation by making a mess in your house to prove a petty, immature point", "You're NTA, but I know what I would do. You take my advice and you'll end up being the asshole for sure, but fuck em. Your mom feels proud of her stance. She feels so proud that she showed you what for, doesn't she? Make amends and then go into her house and scratch up her hardwood floors and put some cuts in her couch. Do it subtly and eventually when it gets noticed, either play dumb or ask if her husband was just being the messy klutz he is. I hate people that take pride in being assholes because they think their point of view is the only suitable one. Also, fuck Thanksgiving with that group. If they don't see the issue, they're not considering that your wife's crochet is not hurting anybody. Your mom's actions cost you time and money, assuming you end up dealing with it. Fuck your family, they deserve scorched earth. Fuck glitter.", "NTA for banning your mom, but kinda an A for making your wife hang out with her in the first place.", "That woman brought herpes into your home.\n\nTell her she’s welcome back after she pays for the table and rug to be professionally cleaned.", "NTA but your mother absolutely is.", "INFO: What do you mean by this line? \n\n>>My wife is really big on manners but doesn't always uphold the standards she holds my mom to. \n\nIt's clear your mom is a huge AH and definitely the worse one in this situation, but some context for this would help decide if she's the only asshole here.", "I worked have no problem never seeing such a vindictive woman again. Your mother is a jerk.", "If things are so bad that your wife has to crochet to keep from having anxiety, there should be no visits anymore. This is really ridiculous that your mother can’t be an adult. There is no double standards here. NTA", "NTA. People have done small, unobtrusive crafts such as crochet and needlework at gatherings since the invention of gatherings. It's just an old-fashioned way of keeping your hands busy while you visit. \n\nYour mom destroyed your property on purpose, to bully your wife. And the rest of your family isn't much better - they're treating this bizarre behavior as a joke.\n\nIf I saw a grown woman scattering resin and glitter around, I wouldn't be cackling about it like your uncle, I'd be rather alarmed. It's weird.", "NTA. Your mother was being petty AF.", "NTA. Your mom is vicious!!", "NTA (in this incident). I think the main issue that needs to be explained is that your wife’s break activity doesn’t ruin people’s furniture. Glitter and beads are messy, but vacuum can help. But resin is hard to clean. Like many other people explained, crocheting is a very normal thing for people to carry around in their purse and do. I’m sorry you were uninvited to a family dinner.", "I'll go against the grain here with an ESH.\n\nYes, your wife isn't the asshole for crocheting and your mom is the asshole for bringing glitter into your home.\n\nBut in general, your mom and your wife both sound like exhausting, unpleasant people to be around. Why is your wife so obsessed with your mom following etiquette? How is she getting \"overwhelmed\" by a person you describe as introverted? Why is your mom so theatrically offended by crocheting? Why do you and your wife jump straight to screaming and banning people from the house just because a guest does something rude? Is there a lot of alcohol involved and are you being filmed for a reality TV show?\n\nUnless there's a major issue behind the scenes, like racism or theft or abuse, it's ridiculous for two grown adults to be having such a dramatic feud. Normal people don't get so bitterly angry over what essentially seems to be a basic personality clash.", "NTA\n\nCrocheting doesn't make a mess and can easily be cleaned. Your mom is the only one here acting like a tantrum throwing toddler, purposefully bringing messy \"hobby\" with her just to make a point.\n\nThat was your mom's only point ; to anger and irritate your wife and leave a mess your wife had to clean up.\n\nKeep your mom banned; she is downplaying your wife's need to take some time to herself, appointed by her therapist and instead is mocking her struggles. If you give in now, your mom, aunt and everyone else will never respect your wife again.\n\nAlso, my petty ass would send a glitter bomb to anyone who says it's perfectly fine and not an issue at all, just simple clean up. See how they like it when their house is covered with the art herpes known as glitter.", "Your mother is a complete AH.\n\nShe didn't \"bring a project to take a break\" like your wife did. She brought it to **make a point**.\n\nFrankly, I don't know why you're upset that you're not going to Thanksgiving. Your aunt and uncle ganged up on you - Mommy's Own Flying Monkeys? What kind of dysfunctional family is this?\n\nI'd remove myself from **all** occasions with your family, personally. My grandmother crocheted because she loved to, in front of us sometimes, I can't imagine taking it personally - or getting to the point where I'd:\n\n1. Get an idea that will not improve my life, but WILL cause issues in my child's\n2. Go to the store to execute on that petty idea\n3. Spend money on craft goods, knowing they will make a mess of my child's home\n4. Bring them all in a bag to my child's house\n5. Open them up, and make an intentional point of getting my child's house messy\n6. Call my daughter-in-law a hypocrite, blame my husband for getting things on the floor\n\nWhy would you want to spend time with this narcissist?\n\nWhy do you say *\"your wife doesn't always uphold the standards she holds your mom to?\"* All your wife did was quietly, neatly, step aside from what is clearly a **toxic** environment for her.\n\nYour mom's standards are in the gutter - she went out to the store to buy something that would cause an argument and mess up your house!!! That's the lowest of the low to do to your own child! How can you possibly say your WIFE is the one not observing manners?\n\nYou, my friend, need couples counseling. NTA for not setting boundaries for your family. I want to hug your poor wife for having to experience that, and I say that as someone who has her own toxic MIL.", "What your mother did was actually destructive. She ruined your table and carpet. Ask what you wife's crocheting ever damaged? \n\nYour mother is throwing a tantrum. She will only learn if you all go NC. Her actions show that she is actually the problem. \n\nNTA but your mother definitely is, along with anyone that supports her abusive/entitled behavior.", "NTA and I second the suggestion to send Mom a glitter bomb.", "NTA. Is your mom looking forward to the 6th grade next year or is the jump to middle school making her a bit nervous?", "NTA, but is it possible your wife misinterpreted what the counselor said to mean leave the room to crochet? Usually, things like that mean \"something to keep your hands busy and your mind slightly occupied while you remain in the space.\"\n\nYou have every right to ban your mom permanently after that level of passive aggression and glitter, but do have your wife check with the counselor.\n\nAlso, I LOVE glitter and it covers my house. And even I think your mom was out of line. I would never bring it to someone's home now. (Though I did as a college kid, and it kept a friend from getting sexually assaulted because I threw it at the guy whenever he came too close, so it can serve an actual purpose haha!)", "NTA.  It's fine to bring crochet or knitting to someone's house, but not if you go off to do it in another room. So to be clear, your wife is being an asshole. However, your mother's counter-assault is childish and over the top. She needs to grow up. You were right to defend your wife, even though everyone sucks here to some extent.", "NTA. But I feel like both your mum and wife are absolute AH. Honestly your mum's pettiness deserves to be made legendary. However you say your mum is more of an introvert than your wife and yet your wife needs to crochet to relax from being around your family? I don't know but it feels like she is trying to make a point. I would like to know what happened that your wife's and your mum's relationship is so tense?", "NTA I had a upscale society wedding in a major city and I remember one of my great aunts knitting during the ceremony, I saw her as I peeked before I started my walk down the aisle of doom. Made me smile. Before spinners it’s how folks dealt with anxiety and hyperactivity. Frankly it’s less annoying and far more productive than a spinner. I just remember seeing her there knitting and smiling. It was her way of dealing with the stress of a large family gathering.  Had someone been throwing glitter at that same wedding, security would have been called immediately. Glitter and cats are Satan’s creations.", "MIL troll in rare form this Saturday afternoon.", "ESH. Your mom was out of line, but so is your wife. You say yourself that she holds your mom to standards that she doesn’t for herself, so she just chooses to be difficult because of a feud, and this obviously isn’t a one-off incident. They’re both ridiculous.", "ESH. Did your wife really need to scream when she saw what your mom was doing? Did you really need to curse at your mom and kick her out? You could have told your mom to put the junk back in the bag. Maybe you and your mom should do family therapy. She seems mean spirited. She needs to hear from a neutral third party that she is intentionally antagonizing you and your wife.", "ESH. Maybe your mom and wife need to take turns on who goes to family events and who stays home. Although it is hypocritical that you are fine with your wife doing a project but not your mom. It doesn’t matter what it is because it’s still a project and they both need “breaks.”", "NAH OP said he didn't mind if his mom did a hobby at his home  mych like OPs wife does at famy gatherings he also says in the comments his mom is messy at her home but he doesn't say anything because that's usually at her house", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mom and my wife do not get along. That is actually an understatement. They can hardly manage to be in the same room, but we get along great with the rest of the family as does my mom, and neither is willing to sit out of family stuff.\n\nMy wife does get overwhelmed by my mom and everyone tends to gather around my mom, so our therapist suggested that she bring something she can do when she needs a break, so she has been bringing crochet. \n\nMy mom got annoyed by this and said it was rude and something a five year old would do, and said if she ever brought something to our house and tried to go into the other room and ignore us, we would raise hell. to be fair that is kind of true. My wife is really big on manners but doesn't always uphold the standards she holds my mom to, so I told my mom that wasn't true. I joked my mom could learn how to crochet (because none of her hobbies are something you can bring to someone else's house)\n\nRecently we hosted a family get together and my mom had a large bag when she showed up. I honestly didn't think anything of it. We were all outside and my mom casually told me she needed a break, so I said that was perfectly fine. See no double standard, she can go inside and chill.\n\nMy uncle later went in to get a beer and came out laughing and said I need to see what my mom is doing. My wife and I ran inside and my mom was working on an art project at our coffee table. She had resin, glitter, beads, shells, and my wife lost it and began screaming.\n\nMy mom said we were being hypocrites and she was doing exactly what my wife did, her hobby is just messier. I told her to get out, cussed at her, and said she was banned. She said ok and then told us the glitter on the floor isn't her fault, her husband did that. I told her to get the fuck out and never come back. She got glitter and tiny beads on the rug, and resin on the table.\n\nMy aunt and uncle defended her and said I was being unfair and my wife is super rude to bring crochet to family stuff. My aunt said if my mom is banned from our house, we are banned from hers and I can't go to Thanksgiving. My cousins tried to defend me but my aunt was serious. Even my cousins after the fact said it was kind of funny and not that big o a deal.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA \n\nCrochet is so much different than resin and glitter and beads and doesn’t destroy someone’s furniture!! A small bag of yarn and needles is a hell of a lot different than glitter! Your aunt is a huge Ah go banning you from thanksgiving and your mom is a huge Ah for having no remorse for the mess and destruction she left behind", "NTA,Your mom is ridiculous!as someone that does resin art i can tell you its a very very messy hobby plus getting it off a surface can be a pain.Your mom was just being spiteful and it backfired.", "NTA.\n\nNo offense, but your mum seems mentally ill.", "NTA.  That was an intentional spiteful act that damaged your property and left a mess.  Your mom is petty and juvenile", "INFO.  OP you need to clarify in your post whether or not your wife leaves the room to crochet by herself, because that makes a difference with regards to your wife's culpability in this situation. People here are assuming she's just crocheting in the room with everyone, but you've suggested she leaves the room, so please clarify. Also, is your wife experiencing anxiety when she goes off to crochet, or just hatred and disdain?  This also matters.  Thanks!", "Info: honestly, does it matter if you are TA. Most if your whole family are against you, and are banning you. Is this the hill you are wanting to die on? Also, have you tried explaining that your wife brings the crochet stuff as a recommendation of her therapist?", "My GrannyB was always the epitome of a lady with impeccable manners. She did Russian embroidery, crocheted, tatted and knitting and took her current projects everywhere *(except formal gatherings)*. It's not a rude thing to do. \n\nWhat your mother did was destructive, mean and spiteful.", "resin is something you shouldn’t ever so without being in a well ventilated area, and bringing it out during a party is unsafe and shitty. resin work has little to do with crochet, which is very much a socially accepted craft to bring out during conversations—particularly when it’s not a one on one conversation. there are so many crafts she could have chosen but she chose to be obnoxious and handle toxic and messy substances on your coffee table", "Glitter is the devils work.  😈", "NTA. The only point she proved is that she's an AH and instigator.", "Nta. I would have made her clean every bit up first especially if you have kids or animals.", "NTA your mom was being vindictive.", "I'm so torn cause I kinda like the petty side of your mom, but at the same time it's glitter... That's the devil's confetti. \n\nI think NAH. I assume mom knows the therapist suggested the idea and that's why she brought her art project? She's just following your suggestion. However, I Understand hating glitter.\n\nEdit to add maybe you could sit her down like the child she wants to be and explain the difference between knitting and freaking glitter. Your wife's hobby is not messy or spiteful.", "You know what, you all are assholes. Grow the fuck up all of you.", "Lol. I think as long as you've given everyone a handcrafted gift at one time, you're in the clear. 😉", "Love it.    OP this is the way", "I bring my knitting to my in-laws' house almost every time we go, because we spend so much time sitting around chatting. It literally never occurred to me that could be perceived as rude or antisocial, and now I'm second guessing if I've accidentally been insulting my husband's family (whom I love) this whole time.", "Yep.  I remember LOTS of times, going back to childhood, where women would bring their knitting and crochet to family gatherings.  They'd sit there chatting while working on their stuff.  It isn't rude at all.  MIL is absolutely the AH here.  She deliberately brought something that would make a mess just because she wanted to be an AH.  Wife is doing something totally acceptable... except to MIL,", "The mother was clearly being petty to make a point but OP left an awful lot out of the post that would give some context. OP and his wife are not innocent in this relationship dynamic. \nOP’s comment:\n\nPreviously we did get mad at my mom for trying to remove herself from situations. My mom is more introverted and my wife felt if she was going to come she needed to socialize the whole time. She also calls my mom out every time she is rude, but to be honest can be pretty rude to my mom as well. She also got mad my mom wouldn't eat her cooking and called her a toddler, but went to my mom's feast of seven fishes on Christmas eve and was gagging because she hates seafood. Biggest blow out was probably when my wife got mad at my mom for jumping into some guy's arms and kissing him, and then later that night sat on my lap in front of everyone and my mom was like what the fuck. My wife totally missed the point and was like are you jealous because I took your son? My mom didn't talk to us for a while after that one and almost skipped out wedding. After multiple family members confronted me about the double standard, I did set some boundaries with my wife", "OP has some more information buried in comments that makes it clear the wife is also a problem in this relationship. To summarize: \n\n* OP's wife hates that his mom is introverted, and used to get angry at her for taking breaks during overwhelming social gatherings, telling her if she was going to come, she needed to socialize the whole time. (This additional context makes the wife's own crochet breaks, because \"her therapist told her she *also* needs a break,\" feel like possibly a weird passive-aggressive escalation?)\n\n* When the mom doesn't like the wife's cooking, the wife gets mad and calls her a picky toddler, but when the mom hosted a feast of the 7 fishes, OP's wife was theatrically gagging on the food in front of everyone because she doesn't like seafood.\n\n* OP's wife got angry at the mom for showing PDA with a guy she was seeing (a kiss), but then right after that, made a point of sitting on OP's lap in front of everyone. When the mom pointed out the hypocrisy, OP's wife told her she was just jealous and heavily implied she wanted to fuck her own son.\n\n* OP's wife has privately described to OP feeling irrational rage when she sees people liking OP's mom or wanting to sit near her or talk to her at social gatherings.\n\n* Multiple family members have approached OP asking him to please not let his wife be such a dick to his mom all the time.\n\nBringing glitter and resin into someone else's home is still an asshole move, but the context does show this to be yet one more battle in the petty war that they've been fighting, and that OP's wife has been doing plenty to feed and escalate herself. The wife also sounds like a huge asshole, to be quite honest.", "> Unless your mom is normally an avid maker of messes\n\nShe is but it is usually her own house. she is always getting paint and mud everywhere, refuses to clean it, but I've never cared as it was her house. I do think she is smart enough to know doing it in someone else's house is full out declaring war", "And destructive", "I spent a very long time trying to figure out how I missed the chartreuse boards craze.", "What part of \"neither [OP's wife nor OP's mother] is willing to sit out of family stuff\" makes you think the wife is being forced to participate?", "But only if she will submit to having her pockets and bags turned out prior to being allowed entry, indefinitely. Glitter! And resin!\n\nIntentional sabotage warrants a home version of the TSA search.", "Previously we did get mad at my mom for trying to remove herself from situations. My mom is more introverted and my wife felt if she was going to come she needed to socialize the whole time. She also calls my mom out every time she is rude, but to be honest can be pretty rude to my mom as well. She also got mad my mom wouldn't eat her cooking and called her a toddler, but went to my mom's feast of seven fishes on Christmas eve and was gagging because she hates seafood. Biggest blow out was probably when my wife got mad at my mom for jumping into some guy's arms and kissing him, and then later that night sat on my lap in front of everyone and my mom was like what the fuck. My wife totally missed the point and was like are you jealous because I took your son? My mom didn't talk to us for a while after that one and almost skipped out wedding. After multiple family members confronted me about the double standard, I did set some boundaries with my wife", "My wife's anxiety isn't really related to my mom. It is postpartum anxiety and some other stuff. She's even admitted it makes her irrationally angry to see how everyone likes my mom and wants to sit next to her. she doesn't want to just not see my family as she likes a lot of them. Also to be fair my mom previously had some anxiety during visits and we really werent nice to her about it and just told her to suck it up", "> Why is your wife so obsessed with your mom following etiquette? \n\nIt is just her personality and some control issues she is working on\n\n> How is she getting \"overwhelmed\" by a person you describe as introverted? \n\nMy mom is introverted but also has a strong personality a lot of people find unpleasant and it bothers my wife to watch everyone flock to her and treat her like she is so funny and cool when really she is kind of mean.\n\n> Why is your mom so theatrically offended by crocheting? \n\nBecause she knows she would get yelled at if she did the same thing, and we previously got pissy with her for trying to hide during family events.\n\n> Why do you and your wife jump straight to screaming and banning people from the house just because a guest does something rude?\n\nBecause resin stains and glitter is a pain in the ass to clean", "She didn't go out and buy this stuff to make a point. She is very into art and I'm sure has vats of this stuff. Her husband  \n probably did throw the glitter as she has previously thought it was   \ncute/funny to toss glitter or once paint at him while she was working.  You cannot diagnose someone with a personality disorder over the internet, and I absolutely took my wife's side here. I am just acknowledging she has had some rude moments in the past. I literally banned her, so there you go, that's your boundary", "Thank you for acknowledging the 'leave the room' piece. Everyone is glossing over that but it matters!", "Clearly you don't have anxiety. It does not make you an asshole to take a breather in another room when you're in overwhelming situations.", "My mom was cold in the beginning as she doesn't like change and is very slow to warm up to people. My wife took that badly. Then my mom met my MIL and they really got into it and some nasty things were said on both sides.My MIL kept implying my mom must be jealous that someone was stealing her son and my mom said some nasty things. At this point I think my mom was afraid of being alone and she responded by pushing me away and acting like she didn't even want me in her life. \n\nWe were hypocritical for a while. Previously we did get mad at my mom for trying to remove herself from situations. My mom is more introverted and my wife felt if she was going to come she needed to socialize the whole time. She also calls my mom out every time she is rude, but to be honest can be pretty rude to my mom as well. She also got mad my mom wouldn't eat her cooking and called her a toddler, but went to my mom's feast of seven fishes on Christmas eve and was gagging because she hates seafood. Biggest blow out was probably when my wife got mad at my mom for jumping into some guy's arms and kissing him, and then later that night sat on my lap in front of everyone and my mom was like what the fuck. My wife totally missed the point and was like are you jealous because I took your son? My mom didn't talk to us for a while after that one and almost skipped out wedding. After multiple family members confronted me about the double standard, I did set some boundaries with my wife", "Not the same at all.  If you work with resin it is highly recommended you use protective equipment.  Even the UV stuff can be toxic if mishandled.  Glitter, resin, and beads?  Mom brought that into OP's house.  If the resin cures good luck getting it out of your carpet. \n\nMom is definitely the bigger asshole in this scenario.  Crocheting doesn't leave a huge mess behind.", "Yarn doesn’t make a mess. Glitter is the herpes of craft supplies.", "It 100% does matter what it is. One is something that doesn't take up space or make a mess. One is something that makes a HUGE mess. When's the last time you've been around glitter? You don't bring that shit to anyone's house without their express permission.", "She is leaving the room. She has been diagnosed with postpartum anxiety, but admits that right now she can't tell the difference between hate and anxiety", "> Also, have you tried explaining that your wife brings the crochet stuff as a recommendation of her therapist?\n\nyes but they feel we were mean to my mom when she had anxiety and was hiding from us and they don't like the double standard", "I want to love it, but with glitter, like with nukes, a war can turn into some mutually assured destruction real fast.", "I doubt it, unless your in-laws are unhinged. I have friends and family who bring their knitting (or crocheting) to family events, pub quizzes, doctor's appointments, on public transit, etc. It keeps the hands busy and is productive. As far as I know it's a pretty normal thing to do.", ">It literally never occurred to me that could be perceived as rude or antisocial\n\nIt used to be that knitting, crocheting, tatting lace, using a drop spindle to spin yarn, etc were all considered to be *mainly* social hobbies, because you can all hang out together and work on whatever it is you're supposed to be finishing up for the family. See also: Quilting bees.", "I think the point here is that she leaves the room to do it.   OP mentions this but it's not obvious. Personally I think it's rude to leave the room, but quite the opposite to do it while you're visiting. It shows your comfortable and content in their company, right? :)", "It sounds like the wife may be leaving the room to crochet. You’re just keeping your hands busy while still engaged in the conversation, so I don’t think most people would have a problem with that.\n\nI’m an introvert with a very loud and intense extended family, so I get what she’s doing and why. But it’s definitely more “antisocial” than what you’re doing.", "Jesus, the wife is a huge asshole. It sounds like everything the mom has done has been a response. \n\nI think I get why the family is choosing the mom over the wife.", "!!!!!!!!!!!!!!!!!!!!!!!!", "Yeah, I don't know why I added that. It doesn't matter if she destroys her own home. Glitter, just by itself, is a WMD (weapon of mass decoration).", "Clearly she's not \"smart enough\" since she only did it to prove some pathetic point and make the maximum fuss, all while encouraging your uncle and aunt to gang up on your wife and try to shut you out of family gatherings.\n\nShe is toxic, and you should protect your wife.", "I know right, resin on their coffee table? If they didn't get some IPA on that soon as (which they probably didnt because most people dont keep it in the house) its gonna have to be totally refinished or thrown away. \n\nWhich really, his mum owes them for.", "Wow. Your mom is definitely in the wrong, but your wife is not necessarily in the right if she is goading your mom like that.", "So then there needs to be some compromise to your wife’s behavior. This just sounds like a rock and a hard place for you. Your mother and wife are being quite immature.", "Actually I have GAD so I'm very familiar with taking a breather. Since OP doesn't mention anxiety, only an interpersonal conflict, then I assume his wife is overwhelmed with negative feelings as opposed to anxiety. If i misinterpreted, then my bad.", "Both women seem to be a LOT. And they both need to recognize it and move on from their childish feuds. Because frankly at this stage they're fighting for the sake of fighting.", ">Glitter is the herpes of craft supplies.\n\nHAHAHAHAHAHA\n\nAlso, what the wife is doing is therapist-recommended. Mom is doing it just out of spite.", "I literally have a Victorian lace spindle designed for this purpose.", "Glitter is the herpes of arts and crafts and it's absolutely disrespectful to bring it into anyone's home without permission!", "I honestly thought you were saying to use an India Pale Ale to remove resin.  But then I googled.  Thanks for the chuckle.", "Given that it's specifically mentioned this was an idea her therapist had, it's clear something is causing her significant distress.", "The Ale would be a better choice. Then if it doesn't work, you can drink it. And if you drink enough, you won't care that it didn't work to clean the coffee table. Win-win.", "He said \"our therapist.\"  That could be for anything. Sorry, I refuse to make assumptions about her mental health. I provide my judgement based only on what OP said. If someone does not have a significant mental health issue (which OP does not indicate), then I stand by my opinion that it's rude to go to a family event and sit in a room by yourself just because you don't get along with one person. OP himself even acknowledges this is poor manners, so...."]}