{"id": 27194, "submission_id": "16mswjt", "title": "AITA for shouting at my sister because she took my car and refused to come back?", "selftext": "\nI M(25) had a really important match to attend today’s evening and all my gears like my shoes clothes pads, bat, gloves basically whole kit was in my car. My sister(28) had gone to my elder sister(30) house from last two days. I asked my mother when she is coming back she told me today in the morning but she didn’t come so in the morning when she didn’t arrive, i asked my mom again when she would come she told me by 4 pm. I said ok and then i started doing by office work. \n\nThen i went to the gym and i came back around 6pm thinking that she would be home as i need to leave in an hour or so but when i came back my car still wasn’t here. I lost my temper completely. I called my sister to ask what’s the matter why haven’t you came yet? she told me she is nọt coming, i told her i have an important match and my kit is in the car i need it urgently, she said you manage i am not coming and hang up on me. I then called her severely times but she didn’t pick it up. I then called my elder sister and i asked her to let me talk with her so she gave her the phone and completely shouted at her telling that i would never let you touch my car again and lot of things that I shouldn’t have said at that time and i shouted at my mother too for passing me the false information and keep giving me false hope. \n\nI said lot of words that I shouldn’t be saying and í created a scene at home. Now my sister came to know about this that i am creating a scene at home and shouting so she is now she is coming back, crying! Maybe I spoiled her night too and now i am waiting for her but it’s already too late I won’t be able to make it my match and I’m probably fucked because i will be getting kicked out of the team. I thought of informing my sister that now you coming back will makes no difference, just stay there but she probably won’t listen now. Now i am fully aware that everybody at home going to abandon me for some days.", "created_utc": 1695134573, "permalink": "/r/AmItheAsshole/comments/16mswjt/aita_for_shouting_at_my_sister_because_she_took/", "score": 1612, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I shouted at my sister because she refused to come back at home and give me my car back\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "No, tell her to come home and then take your keys away from her.  Never loan her your car again.  NTA  She deserved to get yelled at for being so selfish.", "NTA, and make sure you actually don’t give your car to your sister at least for a while so she understands you are serious about stuff like that", "NTA. Please, don't loan her anything again. But, if you do loan anything to anyone, make sure they know when you need it back, even if it's something that you don't use often or even care about getting back.", "NTA. I'd have told her to come home immediately, that she did not have my permission to use my car anymore, and I'm going to report *my* car stolen in 20 minutes if my car isn't returned. \n\nDon't let her ever borrow your car again. She was ungrateful and abused the privilege.", "Nta. If they say anything, say that your sister \"is an entitled brat who thought of no one but herself. I selflessly let her borrow my car, and she could not even give me the same respect and energy by making sure I had it back for an important match or atleast make sure I had my kit. I will no longer let HER or ANYONE borrow my car in the future due to the selfishness and disrespect I have been given.\" Follow with saying \"I do apologize for yelling and screaming. I was upset and frustrated with the fact that now I have probably been kicked off my team, the fact that mom lied about when sister was coming home, and the fact that my sister disrespected me. So do not ever ask to borrow my vehicle. If you take it without my knowing/permission, I will report it as stolen.\"", "NTA\n\nI would have called the police as soon as I saw it was gone.", "Nta, next time call the non-emergency line. She can't steal your car like that.", "Nta you should have called the police and reported the car stolen", "NTA.  You were good to loan your sister your car and she should have listened to you when you said you needed it back in time for the match.  It was not right of her to decide without asking you that she was going to stay longer than originally agreed upon, thus denying you access to your car and its contents.\n\nSorry all the women in your family are mad at you for getting mad (okay, maybe yelling is not the most mature way to deal with what was going on) but I do think your anger is understandable.  Your sister completely disrespected you when she failed to return your car on time and, in fact, harmed you with her disrespect.  \n\nYou were very nice and generous to allow your sister to use your car and she needs to acknowledge this as well as her responsibility to return it when agreed.  She was totally wrong to just tell you that she couldn't be bothered to return YOUR car when you needed it.  It is your sister who was totally in the wrong here and who caused your upset.  I don't know what you said in your anger, maybe you owe an apology for that, but this would never have happened if your sister had returned the car when she should have.  Think twice before loaning it to her again.", "That's called theft. It's a crime", "Why can't sister get her own car? How often does she borrow yours?", "NTA. I would've given her a simple choice: either bring the car back or I'm calling the cops. And I would have no issue following through with that threat if she didn't listen.", "NTA NEVER let her use your car again.  No matter how much begging, pleading and wheedling (and weaponized tears), just say NO.", "NTA\n\nI am just surprised your sister took your car and left for DAYS!  Ridiculous!", "NTA. I feel like you had a lot of pent up anger (understandably) but maybe the shouting and whatever else you said to her was a bit much. However, if it truly is your car that you own and not a family car then she had no right to refuse when you asked her to bring it back. I would not let her borrow it again. \n\nIf she takes it without permission (depending on where you live) you can call the police and report it stolen.", "Hide your car keys so she can't just take it", "You need to make sure that only you have a set of keys for your car. Ever.", "NTA. Take your keys back and don't let her borrow your car again.", "Make sure she hasn't made a copy of your keys.\n\nNTA. She caused this!", "NTA, but why does your sister keep using your car? Put the keys somewhere she can't find them. if she needs to go somewhere, \"she\" can catch a cab, or buy her own car.", "[If there’s a] next time that she tries to do this with your car, tell her to return it in thirty minutes otherwise you’re going to report it stolen and have her arrested. NTA", "NTA. I would have reported the car as unreturned, possibly stolen.", "NTA, don't let her take your car anymore. Hide the keys, do whatever you need to. She is borrowing someone else's car without being considerate of the actual owner and has the nerve to give attitude? All your stuff was in the car and both your sister and mom kept lying to you. You couldn't even prepare since you were under the false impression that she was on her way or something. I hope they don't kick you out of the team.", "Who cares. NTA. Your sister is inconsiderate and evidently spoiled. Who TF takes someone else's vehicle and returns when they feel like it. She should've been cussed out.", "NTA - Don't let her use the car again, and if she does, report it stolen.", "It was no secret you had a match. I’m sorry to say but no one cared. If they did she would’ve dropped the kit off or even driven you to the match. \n\nIf your family is going to give you the silent treatment over this I’d find a new place to live.", "NTA! This is egregious of her", "NTA.  Never ever lend your sister anything ever again.  Your mother should have been straight up if she knew your sister was not going to be back on time.", "Take the keys away and tell her she is never allowed to use it otherwise you will report the car stolen.", "You were dumb for giving her the car in the first place", "Don’t let her borrow your car anymore, simples \n\nNTA", "NTA. SHE took ADVANTAGE of YOU! Never let her borrow the car again.", "NTA but what is your problem?? Why are you such a pushover. What do you mean you spoiled her night???? So what if she's crying she isn't 8 she is a grown adult. What she did was unacceptable - don't ever lend her your car again - take all the keys and tell her that if she ever takes it again - next time you will call the police and report it stolen. Send that to her via text so there is proof if you need to call the police.\n\nIf you lose your place in the team - tell her to go apologise to the team and explain her selfishness. \n\nStop being manipulated.", "Kind of the AH but only for the shouting. Especially at your mom. You were 100% correct in your reaction other than that.\n\nI wish you had just gotten a ride to your older sister's house and taken the car without telling anyone and let them figure it out.", "This story feels weird, like there's more info we didn't get about why she disappeared for so long. But based on what we have here: NTA. It's your property and she took liberties with it. Especially if this team sport is important to you and she was aware of that. It could have been anything else - you needed to go to work, you wanted to go camping, whatever. It's your car and the default is that you get to have access to it whenever you want. Your job isn't to figure out how to do without your vehicle longer than you had initially given permission, it's her job to return in the time you provided.", "Why haven’t you called the police to report the car as stolen?", "You should've contacted her by noon and made her return your car. YTA to yourself for letting her borrow it to begin with.", "NTA but please use correct grammar.", "Kinda the AH, dude your 25, sister is 28, you can cut mommy out of the equation and just communicate directly. Half of her annoyance is easily you waiting until the last minute to tell her you need your kit from the car in like an hour so she would have had to book it to get it to you.\n\nHad you told her earlier she night have been able to get your car back sooner. But how was she supposed to know if you don't tell her? You only talked to your mom, not her.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI M(25) had a really important match to attend today’s evening and all my gears like my shoes clothes pads, bat, gloves basically whole kit was in my car. My sister(28) had gone to my elder sister(30) house from last two days. I asked my mother when she is coming back she told me today in the morning but she didn’t come so in the morning when she didn’t arrive, i asked my mom again when she would come she told me by 4 pm. I said ok and then i started doing by office work. \n\nThen i went to the gym and i came back around 6pm thinking that she would be home as i need to leave in an hour or so but when i came back my car still wasn’t here. I lost my temper completely. I called my sister to ask what’s the matter why haven’t you came yet? she told me she is nọt coming, i told her i have an important match and my kit is in the car i need it urgently, she said you manage i am not coming and hang up on me. I then called her severely times but she didn’t pick it up. I then called my elder sister and i asked her to let me talk with her so she gave her the phone and completely shouted at her telling that i would never let you touch my car again and lot of things that I shouldn’t have said at that time and i shouted at my mother too for passing me the false information and keep giving me false hope. \n\nI said lot of words that I shouldn’t be saying and í created a scene at home. Now my sister came to know about this that i am creating a scene at home and shouting so she is now she is coming back, crying! Maybe I spoiled her night too and now i am waiting for her but it’s already too late I won’t be able to make it my match and I’m probably fucked because i will be getting kicked out of the team. I thought of informing my sister that now you coming back will makes no difference, just stay there but she probably won’t listen now. Now i am fully aware that everybody at home going to abandon me for some days.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - Your sister took something that wasn't hers and refused to give it back.  \n\n\nYou should have reported the car as stolen...", "Where I live its called grand theft auto, if she were my sister being screamed at would be the least of her worries.", "Next time, if she don't come with your car saying you call the police and report it stolen what she did was totally entitled and selfish. Tell her to get her own car.", "NTA.  I would've called the police.  See how she'd like explaining a stolen car.  Don't ever let her drive your car again.  Tell any family, that has a problem with how you talked to your sister, they can let her \"borrow\" their car from now on.  See how they like being taken advantage of.", "You should of reported for car stolen and taught her a lesson. Or gotten a ride to your other sisters and made her pay for it. I would never let her borrow the car again though. Nta", "NTA. I would have called the police at this point. She stole your car and your stuff. She and your mom knew what they were doing and conspired against you. Shes actung like she has some right over your car. Calling the police at this point wouldnt be extreme. It would be appropriate. This isnt a reckless teenager this is a almost 30 year old woman. \n\nI would also call your older older sister and tell her that shes currently housing a stolen vehicle.", "NTA. Enjoy the silence. Siblings yell at each other all the time. I’m not sure why playing the crying card makes the victim the AH, but it seems to work far too often. Hide your keys, and never let her use your car. Refuse to drive her anywhere.", "NTA - NEVER let her take your car anywhere again. She can not be trusted and frankly, neither can your mother. If/when they try and pressure you to let her take your car again, be strong. The answer is NO. And while NO is a complete sentence you can remind them how she refused to come back the last time with your gear in the car.", "NTA. Sis can borrow your parents' car or buy her own.", "NTA. Report it stolen. Tell the police she had permission to take it but not keep it indefinitely.", "NTA  Your car and your belongings.  Did you tell her she could take off in your car for so long?  She is an adult and could have come back and chose not to.  You most likely should not have shouted and cursed so much, but you were upset, I get that.  What your sister did was rude and your mum shouldn't have lied to you.\n\nThis is about respect, if your sibling is nice enough to let you use their car, then you need to be nice and return it when they need it.  Your sister is not nice.", "Nta.\n\nDo not lend your vehicle out. \nWould you lend anyone the cash value of your vehicle?\nIs she insured on your vehicle?\n\nLet her know you will call the cops the next time she takes your vehicle. And be prepared to do so.", "If you didn't give her permission to take your car report it stolen.", "NTA Why doesn't she have her own car? She's 28\n\nnot 18. Hide your keys so she and your mom\n\ncan't find them.", "NTA\n\nTell her to bring the car back immediately or you will be calling the police to report it as stolen. \n\nNever lend it to her again.", "NTA.  May I recommend reading Adult Children of Emotionally Immature Parents?  I found it very helpful.", "NTA. Warn her that if she takes y9ur car again you will report it as stolen. And mean it.", "This is exactly what i told her and my mother, that i am never going to give her my car and if you come to me or my dad comes to me telling me that let her use it then i am not gonna listen to that too ffs!", "NTA, never lend her your car again and keep the keys out of her reach. And do NOT apologise.", "Yes, it has happened before and i let it go. I usually take cab and this time if my kit wasn’t in the car i would have taken the cab. I went mad because today was my saturation point and I can’t sweep this under the carpet. The fact she didn’t even acknowledge that i have an important match to attend is what annoyed me", "I don’t usually say no to anyone from the family to use my things and I genuinely believed my mother when she told me she will be coming back in the morning because she is on her phone with my sisters all day so i didn’t bother asking my sister. If I knew i would have told her straight away.", "Thanks. Will do.", "Haha that would be extreme", "No next time.", "Even if I had reported it to the police, my match would still have been missed. And i can’t never go this extreme on my own sister, i do lover her and maybe she is not going to repeat that again. Hopefully", "Maybe she wasn’t expecting me to get this much angry and she thought i will manage anyhow but when i yelled at her and basically at everyone for not taking me seriously, she started crying and came back home but it was already too late.", "Twice a week? That’s bare minimum.", "She has to go there only to stay for 1 night so i agreed, she left on monday and had to return back on Tuesday morning but she kept bailing", "Her house and the location i needed to reach for match was completely opposite plus it is atleast 1.5hrs of drive and with traffic you never know. And I didn’t had that much time i only had 1 hr. My match was at 7:30pm  and i needed to leave by 6:30pm anyhow.", "She didn’t disappear, she went to my elder sister house to meet her.", "Why are you so condescending? I thought OP did great for a non-English speaker.", "Sorry, English is not my native language.", "Hide your keys and refuse to let her have your car again. If she finds your keys and steals your car, call the police and report it stolen.", "NTA You could have reported the car stolen.", "That’s the issue you allowed it before and didn’t make clear boundaries with it, she needs to understand that if it’s your car she can’t do what ever she wants", "You need to move out", "You probably should have gotten a cab over there and gotten your keys back. =/ If she's not back soon, report it stolen.\n\nOr, report your car missing at the very least. Express that you are VERY concerned about your sister's wellbeing because she promised she would return by this morning and isn't answering her phone.", "What annoys me is the fact that she'd been there with your car for nearly 3 days and would probably still be there if you hadn't forced the issue.  She does not need your car for that, she needs to get a ride instead of holding your car hostage.", ">I genuinely believed my mother\n\nNow you know to NOT trust blindly in ANYONE!!! Especially family because they often think they can just walk over you.", "In fairness, your mother is not your sister's keeper.  While I agree that your sister is the AH, you do need to act like the 25 year old you tell us you are, and communicate with people directly. Stop expecting mummy to do it for you.", "Except, if you told her to bring it back and she refused, she *did* steal your car.", "The thing is... they have brainwashed you into thinking your sister literally doing something illegal is acceptable but you reporting it would be \"too much\". You're like a frog in boiling water, my friend.", "Even the threat would have worked. NTA", "She obviously doesn't care much for you if she's willing to get you kicked off your team.", "Did you get your car back? NTA", "Got ya, she is just being difficult.  You are very generous.", "Your explanation was fine. We all understood! Congratulations on using a second language well!", "Don't apologize, your grammar was fine for using a language that isn't your native.", "Should have.", "No, not if he let her have it ffs", "Yep. Sister will learn her lesson the hard way.\n\nWhat the sister did was stealing. And she needs to learn that not returning something at the agreed time is wrong.", "Yes if she won’t bring it back. Doesn’t matter if you agreed to it initially or not.", "You mean if I give my keys to the restaurant valet, he gets to keep the car?", "She failed to return it at the agreed upon time. Refusing to return property is theft.", "I get your frustration, but one question: Why, oh why didn't you call your sister the night before, even in the morning and DIRECTLY be clear that you needed the car, it had the stuff you needed in it, and confirm what time she would be back?  \n\n\nWhy are you asking your mother? Why didn't you call midday to confirm the car was back? Why are you waiting till the last minute to be clear with your sister how much you need your car back and by when?\n\nShe's a jerk, but, in your shoes, I would have been way more on top of talking directly to sister and making she was home well early in the day.", "INFO: Did your sister knew that you needed the car? What was her answer when you informed her?", "Aww poor baby, your sister is acting like  a jerk and now she's crying.  (s)  Your family abandoning you for a few days will give you a nice break.  Don't EVER loan her your car again...", "Sweetie, this is where you give her 20 minutes to get her ass home before you call the cops and report your car stolen. NTA", "I cannot judge. \n\n&#x200B;\n\nFirst because of this: \n\n*\"shouted at her telling that i would never let you touch my car again and lot of things that I* ***shouldn’t have said****\"*\n\n&#x200B;\n\nThen you also added this:\n\n\"***I said lot of words that I shouldn’t be saying*** and í created a scene at home.\"\n\n&#x200B;\n\nIn the end, if you just shouted and said a few insults, I can understand your frustration, probably I wouldn't call you AH. But there's a chance that the problem is not how loud you were, but what was actually said. So, without this piece of information, I can't make a clear judgment here.", "The moment the car wasn't there at the time it should have been, it meant it was gone without your consent.\n\nStolen.\n\nYou shoujld have reported her sorry ass.\n\nThat'll set boundaries.\n\nNTA", "NTA OP.  You should have called the cops on her.", "I don’t know tbh. One hand, it’s your car and she should have given it back and you said some rude things to her and caused a scene. You could have reported it stolen, but you had the right to be mad. I say ESH", "YTA the moment your mom was wrong about her being back in the morning why didn’t you call and ask her? She would’ve had all day to give you your kit back…", "Was there a reason why she couldn't come back with your car?", "Nta.", "NTA\n\nShould have reported it stolen. See how she likes them apples.\n\nNever let her or anyone else use your car again.", "NTA. Could've gone a step further and reported the car as stolen. It's petty but your sister is a major AH.", "NTA.  It's your car, not hers.  Stop letting her borrow it.  Who does she think she is and what is wrong with your mother!  Tell her the next time she does that you will call the cops and tell them that the car was stolen!", "No good deed goes unpunished. Q.E.D.", "Next time just call the cops!", "NTA go no contact with your sister", "I'm not sure how to say this clearly enough. NEVER lone your car again. Ever.", "NTA. My sister did the same thing to me and my parents threatened to call the police to make her give me the car back. She didn’t have her license at the time either. She thought going 100 mph in my car was hilarious.", "Never lend your car again. She took the piss. \nTell the team you had family trouble. Which is true.", "NTA\n\nNever give her your car again, you can't trust her. Also it's shitty how your mother and sister behave like she is a victim.", "I would have told her to return it immediately or report it stolen. She has zero respect for you.", "I would have called the cops. You have more patience than I. NTA", "Why are you even letting your sister use your cat if she's like this ??", "NTA. Hide your car keys and do not let anyone borrow it - they are taking advantage of you and to not come back with YOUR car for YOUR sport is incredibly selfish and shows exactly how your sister feels about you. You can apologise for the shouting if you want, but you were provoked it sounds like. Hope you don't get kicked off the team!\n\nTime to move out and keep all your assets to yourself.", "NTA : The reason why you need the car doesn't matter. It's your car. You were nice even letting her borrow it in the first place. You let her borrow it for a set amount of time. She neither respected you or your property by refusing to return it and not returning when she was supposed to.\n\nAnd you also wont be the asshole if you call the cops and report it stolen.", "I'm not sure you want from writing this post? Are you asking if you had a right to be upset? Yeah, absolutely. Was it ok that you raised your voice? I think so. \n\nBut you seem to be asking if you're TA for what you did, which incorporates what you actually said. Did you threaten her? Did you say things that you knew were low blows and would absolutely devastate her? Did you lose control and just say whatever you could to hurt her? \n\nIf you're not willing to share what you said, maybe you know that you did something wrong.\n\nYour sister was awful and entitled and rude. No question.\n\n&#x200B;\n\nBut otherwise, can't offer you any productive feedback \n\n&#x200B;\n\nINFO", "NTA\n\nNext time - report your car stolen.  Because she STOLE your car. \n\nShe had your car without your permission.  She was not permitted to have your car at that time and she NEEDS to spend some time in jail.  Like maybe 2-3 days like she kept your car.\n\nIf Mommy and Daddy are upset about that - they can give spoiled princess the keys to their car and not be able to do the things they previously committed to do.", "NTA sister is the AH. I don’t understand how people can use your stuff and say oh I will do what I want with your stuff and you just have to figure it out. Sister needs to get her own car or take the bus better yet since mom thought it was okay for her to do this she can take moms car next time. What sister did was very rude and inappropriate she could’ve had the other sister pick her up if she was planning on staying there. Sister should’ve be coming home like she was supposed seeing as it wasn’t her car to begin with. The sense of responsibility within in the sister is lack luster. Obviously sister doesn’t care if OP gets kicked off the team and that is selfish. If they choose to not speak with OP it’s because they are mad with themselves that they pushed OP to come out of the box and flip out. OP shouldn’t feel too bad we all say things we should in the heat of the moment but sometimes those are the things people have needed to hear", "NTA. The minute she told you she wasn’t coming home I would’ve reported the car as stolen (by definition it was)", "Nta you lent her the car on the basis of hereeturning it at a perscribed time one minute past that time it is theft", "YTA. It is asshole behavior. But... it is understandable that you responded that way, you were angry, you may have missed out on a great opportunity, many would even say you were justified. \n\nYou, made your sister **cry**, there's no way you come out of that without being the asshole. \n\nShe shouldn't have done what she did, nor should your mother. What you should have done is remained calm. You knew your car was not where it was supposed to be at the time it was supposed to be there. So, logically, you should have been on the phone to your coach and then get a hold of a taxi or some other mode of transport. Instead you reacted emotionally.\n\nYou, being the brother and clearly the \"big I am, strong dependable brother that does no wrong\", should apologize for reacting the way you did. Stress that this was important to you and that you felt let down by the behavior that the car should have been back and wasn't. But admit it was no excuse and you could have done things better. \n\nIf you shouted at your mother, that's a big no-no as well, deserves an apology right there. I would consider doing something that would make it up to both of them. \n\n&#x200B;\n\nI think you know you made a dick move.\n\nOh... and don't loan your car to your sister again. Clearly there's a punctuality issue and she has broken that trust.", "YTA.. what were you missing a game of Quidditch at Hogwarts? Grow up..", "Report the vehicle as stolen.", "NTA, next time just call the cops.", "NTA. Hide your keys and never let anyone in the family use your car again. You are not the one at fault here.", "Nta.\n\nApologise to your team for missing the match and explain why. \n\nAlso go to your sisters house and get the car back, if she refuses, get the police. It may be a family dispute, but if it's your name on the title, she has no luck in keeping it.", "Nta.\n\nApologise to your team for missing the match and explain why. \n\nAlso go to your sisters house and get the car back, if she refuses, get the police. It may be a family dispute, but if it's your name on the title, she has no luck in keeping it.", "I wonder if your mom was just relaying what sister was saying about her arrival times.  Maybe you shouldn’t have been yelling at her?\nBut as for sister she’s the major AH.  As most have said, she never gets your car again.", "NTA\n\nA lot of similar AITA situations would call this theft.  Do you own the car?  Is it in your name?  If so, you should have called the cops and reported it stolen.  I assume the answer is yes since you are 25.  Talk to whoever is in charge of your baseball team or league about this situation.\n\nYour parents are also enablers of her abuse and proved to you that they don't give a fuck about your own self-interests.  With people like your sister, when you give an inch, they take a mile.  Never accommodate them in any capacity again.\n\nAs for her \"crying\"?  Who the fuck cares.  She wouldn't be in this mess if she hadn't TAKEN YOUR CAR!", "NTA Next time just report your car as stolen", "Call the police and report it stolen.", "NTA, is there no way to explain your circumstances to your team coach? If you had the means, you would have attended, no? It's like getting rear-ended on the way to the match.. not exactly within your control whether you go or not under those circumstances", "Why did you ask your mom when she was coming back instead of asking your sister directly?", "NTA. Don’t loan your car to anyone.", "NTA, sorry your family is so awful. Never lend your car to her again, she lost the privilege. Also lesson learned to call directly next time since you can’t trust your mom. I hope she at least had a good excuse.", "NTA. Do not lend her your car again. Ridiculous and disrespectful behavior on her part.", "NTA  \nThey didnt give a shit about you missing the match. They dont care about you. I doubt this is the first time they show this kind of behavior", "Why didn't you talk to HER at any point until it was too late to do anything???? ESH", "The car is stolen.  Report it, and press charges.  Don't let her fuck around with your property without consequences.\n\nNTA.", "NTA but.. are you really 25? You shouldn’t need your mom to tell you when your sister is coming back with YOUR car. You and your sister should be the ones communicating.", "NTA. She made her intentions clear. She was spoiled plain and simple and TOLD you how things were going to be with YOUR car. Heeeell to the no sir.\n\nIf she's crying now too effing bad. She bit the hand that fed her dude. You did her a favor and her response was to spit in your face. Do not let her use your car again. And if your family decides to shun you for a few days reply loudly with \"Glorious peace and quiet!\"", "NTA She borrowed your car, but kept it without your permission. She then denied you access to your car.  She essentially stole your car. Think how sad she'll be when you alert the police.\n\nNever loan her your car again. She can walk.", "NTA She borrowed your car, but kept it without your permission. She then denied you access to your car.  She essentially stole your car. Think how sad she'll be when you alert the police.\n\nNever loan her your car again. She can walk.", "The rude response is to report your theft and put your sister in jail\n\n>came back my car still wasn’t here. I lost my temper completely. I called my sister to ask what’s the matter why haven’t you came yet?\n\nUnless you gave her the keys and the car is not yours.", "NTA, report the car stolen and watch the hilarity ensue.", "Nta. The car is yours, this means she needs to follow all your damn rules about it,  the fact that she hasn't or won't means she shouldn't touch it", "You still live with your mother?", "ESH WHY DIDN'T YOU CALL THE COPS?!", "NTA. That is your car! Did you pay for it? Upkeep? Insurance? Did she ASK to take your car?  I would have reported it to the police as stolen. Stop taking the blame for her treating you like chit! She is wrong!  Stand up for yourself, she sounds like she has been doing things like this all along.", "NTA. You expressed why you needed your car and were assured that you'd get it back that day, not to mention earlier in the day to only be told later.. and later.. and later until being told it wouldn't be happening at all.\n\nIt's egregious to be denied your own car for an extended period of time, more so when it's needed for an important situation only to be told it doesn't matter to the person who has your property.", "Get your car locks changed.", "no", "Apologize to your mother. Buy her flowers. Write a beautiful card. Make sure she understands that your emotions got the best of you -- you love her dearly and you regret losing your temper toward her. Your sister is TA. I have no further comment for her.", "NTA, I bet you said a lot of words that needed to be said. At best apologise for yelling but also explain that both your sister and your mother lied to you with grave consequences for you. Your sister lied about how long she wanted the car for and your mother lied about your sister bringing the car back. Once trust is broken, it can never be completely repaired. Your mother will probably try to excuse her lies by claiming she was trying to keep the peace. Point out how badly that went. Don't trust your sister with your car again and be careful believing anything either of them say again.", "EVER...", "Took way too long to find a response that actually pointed to the Op not being blameless in this scenario.", "He said that Mom was on the phone chatting to Op's sisters all day, that's why he asked her", "That’s what I want to know", "Why aren't there ever comments calling OP an AH when OP is a women shouting at a man.", "It is entirely reasonable to take his mother at her word when she says sister will be back at a certain specific time. The obvious and overtly plausible interpretation is that they talked recently and sister updated that she'll be back then.", "Let them know of she takes the car again the first people you will be calling will be the police.", "You are being abused. Kicked off the team? This is disgusting!!! Don't ever lend her your car again. If she takes, it call the cops. Please find yourself another place to stay some time soon. You deserve better than this.", "Are you actually 25?", "Call the police and report it stolen, she refused to bring it back when you told her to, she may have borrowed it to begin with, but at that point it's theft.", "NTA", "INFO:  Why doesn't your sister have her own car?", "If any of them take your car again without permission tell them they are to come home within 5minutes (or how long it will take them to get from point A to you) or you are calling the cops and reporting the car stolen, and follow through). Honestly I wouldn't even give them the chance and report it stolen straight away but that would nuke your relationship with your family so it's up to you if you give them a warning or not.", "If it is your car, stop taking cabs, if it's a family car, get your own car.\n\nYour mother and sisters are walking all over you because you have given them permission to, so even if you do tell her no more taking your car (assuming it is only yours) she is going to not believe you and just take it anyway.", "SO you repeatedly let her walk all over you and your surprised she did it again? Why is your OLDER sister using your car? She had 3 more years of life to become successful but didn't bother...she's going to drag you down and you're letting her!", ">I don’t usually say no to anyone from the family to use my things \n\nAh. That answers my main question of why she had your car to begin with. \n\nYou've established a pattern and some family - you now know - will take advantage. You'll now have to do the hard work of breaking that pattern to establish firm boundaries. Stop being their doormat.\n\nI'm unclear on where the car usually is, or your housing situation, but if you live in your parents' home, and the car key / car is there easily accessed? Keep the key on you at all times. And stop loaning the car out.", "Your mother is a liar. Tell her!!!", "It's not. It's exactly what happened. She stole your car.", "How is it extreme to report your car stolen when that is exactly what your sister did. She took your car and refused to give it back. You said it your self, shebonly caim home when you blew up and caused a scene which has given your sister to return home crying and play the victim. She is 28, do you really think that is acceptable ADULT behaviour for a 28yr old.", "Her unreasonable expectations of  you are not your consern .", "Maybe you related harshly. \n\nBut you did tell her you needed the car back, by X to use it, and she knew it. \n\nIf she had issues that's one thing, or felt unwell. But yo just keep it and turn back whenever she felt like it as not a respectful move.", "Why doesn’t she have her own car?", "No dude. The fact this is your reply is EXACTLY why your sister did this. She expects you to do this kind of thing and let her off easy. She has learned a repeat pattern from you and takes you for granted now that she knows what she can get away with.", "You're a pushover.   \n\nShe will keep doing that because she knows you won't do anything. \n\nShe will cry a few tears and you feel guilty so you will feel sorry for her.", "God, grow a spine", "This is exactly why your sister steals from you, because you make excuses for her and won't give her actual consequences", "She doesn’t seem to love you back.\n\nThis is not the way a loving person acts.", "Buddy.... she seriously f*cked up your life. She knew this was important to you, she just didn't care. If your own sister isn't going to treat you with love and respect, then it's really up to you to treat yourself with love and respect. It's not selfish to say no at this point, it's just protecting yourself. You cannot trust her to bring your car home when you *need* it, you can't loan her the car. Every time you do from this point on is an act of disrespect to yourself and the message that you're a doormat to everybody else. Love *yourself* dude and say no to your selfish sister.", "NTA - I'd tell her, and anyone who is on her side side, that you will no longer lend anything, and that you will consider taking them without your permission to be theft.", "I get that more why she felt entitled to the vehicle for so long. I imagine you didn't give a blanket permission to take the car for an indefinite amount of time even if that ran over to anything you planned to do within the week.", "What’s up with your mom, is sister the favorite? I hope you did not get kicked off the team", "Most of your recent comments are very angry towards women. I hope you get a grip you sound like you’re a miserable fuck.", "It's probably cause I'm used to women shouting, it's like a natural reaction and water off a ducks back to me. I don't really care about shouting matches, my problem is with making mothers, sisters or younger siblings cry. All of these are dick moves in my book. \n\nMen should act like men and not like third rate college footballers with mommy issues.", "You're fine. Don't listen to anyone who says differently. NTA Good luck, and I hope you didn't lose your spit on the team.", "get a carabiner clip and keep your keys attached to you- even better if you can get the kind with the screw on locking mechanism", "The police?  Good luck with that.  At best they will whine about you really wanting to file a report on your sister.  If they actually take a report they will put it on a stack about a mile high and maybe get to it next year.", "Yep, I’d be more than shouting at her. I would have reported it stolen. She refused to bring your property back to you, that’s stolen.", "I'd like to know why they're getting kicked off the team for missing 1 practice", "And if yes why doesn't a 28yr old who can drive have her own car.", "I’m thinking OP is ESL", "Please don't advise people to waste the police's time and invite them into your life unnecessarily", "NTA - To be fair, maybe the sister did tell her mother those things, and then kept changing her mind.", "More importantly why are two adults still living with their parents and fighting like teenagers.", "Look at hot page on this subreddit, it's mostly men posting AITA today and if you look at my post history you see I often talk shit about men being trashy.\n\nAlso it's not wrong to point out double standards/sexism on this sub, unless you want to deny there is a clear bias against men here.", "He's on another thread calling a single mother a dumbass and a leech 👌 so classy", "Ah, there is so much to unpack here.\n\nCalling women crying machines\n\nPutting down men for having emotions.\n\nIt's hilarious you think men can't shout at someone who is doing a shitty thing.", "Thei grammar is better than half the native English speakers on Reddit", "Depends where you live", "Sister might not know that.", "It becomes stolen when it's not returned on demand.", "The law says otherwise", "She has the keys and same last name..", "He didn't miss a practice. He missed a match/game.", "That's a great question. I am thinking it may be a qualifying match and this is the end of the year? Or perhaps this has happened already a couple times before.", "eh a lot of people can have driver licenses but not own a car due to moving to a city with abundant public transportation, so that's not the issue here", "Then the mother should have told her, \"no, return your brothers car now.\"", "Things are different in different countries. While in the west, some kids leave the house after 18, in several other countries it’s pretty common for people to stay on with their families till they get married. In some cultures, people stay on with their families long after they get married (along with their new spouse and children - joint families) \n\nDifferent folks, different strokes", "Have you seen how much rent is now?", "[deleted]", "Damn right. I once invited this one dude over for dinner, he’s still living with me.", "1 match then; a single occasion. It seems like overkill for a good player who has been reliable all season (or hasn't had a season yet to show themselves unreliable as the case may be)", "Goa?", "I chuckled, have an upvote", "Todd moment", "ESH.\n\nWhile I'm mad on your behalf, in that if you take someone's car you need to follow the owner's time schedule... you're just mad that your lack of attention and lack of planning is costing you your place on the team.\n\nShit that we create should be handled by the creator.\n\nBut sis is a bigger AH. You're just an unattentive prick", "As far as the actual situation, NTA. Your response, YTA. She was beyond inconsiderate. However, the shouting/yelling/etc was not the way to handle it. Could you not have asked your mom or a teammate for a ride and confronted your sister later, or even had someone to drive you to go get your car and told her to find a way home? You’re both too old for that kind of behavior.", "NTA but why didn't you ask her directly instead of going through your mom?", "I would've called the cops & reported my car stolen & where I \"think\" she might've gone, sister or not", "Your whole family is a bunch of AH. Good luck with that family. NTA.", "Your sister needs her own car.  Don't give her your car or keys -problem solved.\n\nYou should have told your sister to stay overnight and come straight  back with the car the next day because you had made plans- going to a game and all your equipment was in the car. You should have called her or texted her that you wanted her home and why  and not relied on your mother at all.  Also if she didn't make it back as arranged, it would be the last time you let her use your car.  She probably would have made it home so you wouldn't miss your game- if you had told her when you expected the car back or else.  However, I would not let her have my car or keys again.  If she doesn't have a drivers license that is even more reason to not give her your car. Play stupid games, win stupid prizes.\n\nPS:  This is why smart people don't let other people drive their cars - even family.", "NTA, but you should have contacted her earlier in the day after the first timeline was missed.", "NTA", "Now i am fully aware that everybody at home going to abandon me for some days.\n\nAnd this is a problem how?\n\nThe way they treat you this would be a pleasant treat for you.\n\nNTA\n\nYou are owed an apology and never ever let anyone have your car again.", "did you pay for the car or your parents?\n\nWho pays for the insurance?", "NTA. In fact, I'd report my car as stolen.", "I can understand your anger. You are not an AH.  do not lend your car to your sister for a very long time.  Tell your mother not to lie to you to protect your sister.  Your sister is selfish and her actions should have consequences, like getting her own car.  kt", "NTA\n\nTake away any keys. If they take your car again, report it as stolen", "ESH.   \n\n\nYeah, your sister is wrong but your reaction was over the top.  \n\n\nAs you said yourself in a comment below, you would be fine taking a cab to the match if your kit was with you, so why didn't you just cab over to your elder sister's place, grab either your car keys or your kit, then make your way over to the match.  \n\n\nI know hindsight is 20/20 and you may not have realised you had the option at the time but fact is, you lost your temper.", "NTA. her behavior and entitlement is disrespectful.", "Starting a wordfight most often ends up in the opposite thing you wanted to happen...", "NTA  ! Horrible Sisters and Mother", "Info:   \n1. Did you have a clear conversation about the conditions for borrowing your car?   \n2. Why were you asking your mother, not your sister when she would be back?   \n3. Did your sister know about the deadline for returning it?   \n4. Did your mother deliberately lie to you or did she actually think the car would be back in time?   \n5. If this was a deliberate lie/ plan, does it happen a lot?   \n6. What did you say that you \"shouldn't have said\"?   \n7. Is there a history of you being unreliable? Why would you be \"kicked off the team\" for missing one game?\n\nI think it's highly likely you're not TA, but I also think there's very poor communication at play. I'm not sure why you didn't go straight to your sister as opposed to communicating through your mother and waiting until the last minute to hope your car was back.  It's your car so you can prevent others from borrowing it unless it's one of the conditions for living with them (if you do).", "Nta\n\nShouldve called the police", "NTA \n\nReport your car stolen", "It's his frickin' car that he loaned her.", "Wow, you're toxic af with the gaslighting and victim blaming.", "Why were calling mom and not Sis?", "Should of just say you are reporting stolen", "You should have threatene to call the police for stealing the car . -and actually do so if she didn't come IMMEDIATELY.\n\nNTA", "NTA Absolutely NTA\n\nIf ever there is a next time, take a cab to where she is and then take your car back.\n\nIs there any chance if you Explain to your coach what happened that he might give you another chance? It doesn't hurt to ask.\n\nYour sister though, is the one who abandoned you! And your mother. You did nothing wrong. They did.\n\nTell her to go suck dirt next time she wants to use your car.", "Never again .", "No, that's the usual response when someone steals your car.\n \nWhat your doing is called enabling. You're reinforcing your sisters poor choices. It's not doing her any favors.", "No it wouldn't have been, she stole your car. You only think it's extreme because you're a doormat, you're used to being used.", "It doesn't matter what she expected you clearly stated you needed your car . When you told her that she should have immediately driven to bring you said car. Do not ever loan anything to her she doesn't deserve it.", "She'll actually steal it next time she wants it bad enough.", "Yeah, the only way it really could have worked is if you knew days ahead of time that she would not make it back in time for you to go.", "I don't know. I have not noticed that to be the case. So tell me, why aren't there ever comments calling OP an AH when OP is a women shouting at a man?", "You use the term 'gas lighting' and 'victim blaming'... and I don't think you know what they mean. \n\nNever said the Op was responsible for his sister taking the car (probably with permission), nor did I say the Op was responsible for his sister not bringing the car back on time. \n\nI said he was a dick for making his sister cry.", "You’re doing fine", "> Stop expecting mummy to do it for you.\n\nEspecially when mummy's a big fat fibber.", "Yeah but it's also weird that she has it for 3 days and OP doesn't appear to know when it's coming back, or care, or convey to her directly that he needs it by a certain time...    \nLike, it's his car, so not TA but that's weird.", "It's still the nuclear option that will likely result in irreparable harm to your relationship with your family.\n\nIf that's worth it to you then so be it, but I can't stand how this sub casually flings around the letter of law as if there are no deeper consequences involved.", "Yep, we have an offence called \"Taken Without Owners Consent\" for EXACTLY this kind of situation in Britain", "And some people simply cry when they're called out for shitty behavior or even to manipulate people; that was MY point. You automatically scapegoated the brother because the sister cries when she's called out on shitty behavior as if tears automatically make him wrong and her right and THAT'S what I call b.s. on.", "You don't tell them your sister stole it. You report it stolen and she gets pulled over.", "No clue why esl means", "Even if she wasn't, it's easier for his sister to lie through a third party. It's also easy for things to get lost in translation. \n\nIt always amazes me how many supposed adults rely on their mothers to be intermediaries with their own families. And then get surprised when communication breaks down.", "I think you're unpacking more than there is to unpack.  \n\n\nDid not call women 'crying machines', that's on you and I want no part of that. \n\nMen can have emotions, they can cry all they want, I have no issue with that. I have issues with grown ass men making women/younger siblings cry. \n\nAlso men shouting because someone did something shitty, just demonstrates a lack of self control and a need for anger management sessions. Life is already too short to make your own blood pressure spike like that.", "Ah so Op is just generally disrespectful. I'm starting to see a pattern.", "English as a second language", "Maybe she didn't talk to her mother after she said that she'd be back by six.  It's hard to say - but yes, if the mother realized that she was going to be later, she should have said that she had to return NOW.  It would have been better if when she said that she would be back by six, her mother had said, see that you are, your brother needs his car.", "Depends on the coach. If he is worried about it he has reason. However, none of that matters. His sister technically stole his car. She was supposed to be back with what she borrowed in time for him to make his match. She refused to bring back HIS car. She is in the wrong. She is lucky all he did was yell. I agree with the people telling the OP to call the police next time. He has a right to have his car when he needs it not at her convince.", "Oh"]}