{"id": 27244, "submission_id": "16n9472", "title": "AITA for getting mad at my family about a poorly planned trip?", "selftext": "A while ago, I suggested that my family (my mom, stepdad, and I) take a trip. We're taking a train trip and then renting a car to visit some towns near our \"main\" destination.\n\nThey said it sounded like a great idea, and my stepdad took it upon himself to look up train tickets and hotel rooms (he has hotel points from work travel).\n\nI told them to please let me know ASAP what my share of the hotel and train tickets would be, as I needed to make sure to set aside the money. It was already going to be tight for me, as I am paying off some debt, but I could make it work, and this will be a kinda once in a lifetime trip for someone like me.\n\nOver the next few weeks, I keep asking one or the other of them to let me know what my share will be. They keep saying \"oh, we'll let you know, thanks for reminding me\".\n\nFinally, *last week*, my stepdad lets me know the train ticket is $109. Awesome, I send him the money.\n\nThis week, I still haven't been told what my share of the hotel and rental car will be. I figured it wouldn't be too much since my stepdad (who has already booked the room) said he got 2 nights free, and we only needed 3 nights total. (Leave Thurs morning, take overnight train back Sunday night).\n\nFinally, today, I am told the following:\n\n* The hotel is $300/night, since it is in [MAJOR METRO DOWNTOWN].\n* We booked 4 nights not 3, since the overnight train Sunday night wasn't available after all.\n* So your share is $225 for the hotel. We still don't know about the car lol.\n\nNow, with 5 min of google searching, I found 2 different hotels from my stepdad's points brand that are both >$100/night cheaper, and closer to some of our destinations. Additionally, I had planned my leave request for work under the impression we were getting home Monday morning, so I would have all day Monday to do things like do laundry and clean my apartment before work on Tuesday. Instead we are getting back Monday evening, leaving me roughly 4 hours to get this stuff done. Oh, and my apartment has exactly 1 washer and 1 dryer in the building, so hopefully I don't get stuck behind someone else.\n\nI expressed frustration at not being more involved in the trip, which I came up with, and at not being given more info about the cost and about changes to the itinerary. I said you all knew my money is tight, and I repeatedly asked you to get me the cost as soon as possible, and you kept blowing me off. I also pointed out that, unlike my mom who sets her own schedule for work, and my stepdad who has flexible telework, I work in healthcare and have to be in clinic first thing Tuesday, basically 12 hours after stepping off the train.\n\nMy mom just said \"this is stupid, and if you don't want to go you can just cancel, but I'm not talking about this, you're just being dramatic and should have saved more money\".\n\nAITA?", "created_utc": 1695175436, "permalink": "/r/AmItheAsshole/comments/16n9472/aita_for_getting_mad_at_my_family_about_a_poorly/", "score": 18, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my mom and stepdad they were assholes because when planning a family trip they booked a more expensive hotel then what I would have used, didn't tell me my share of the cost when I asked them to, and didn't tell me about changes to the departure date/time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA \n\nThey're both at fault, not you. Don't let them point their fingers at you when they should be pointing at themselves. \n\nAsk nicely for that $109 back but don't expect a miracle. Tell them kindly that unfortunately, you won't be able to go after all, you hope they have a great time and maybe you'll be able to go another time. \n\nDo not EVER plan on a trip with them again! Count your blessings and forget your losses. I think you just dodged the bullet of a very empty wallet.", "ESH you proposed a trip and then gave up all planning of it. They kept blowing you off about money. It would have been better if you had told your stepdad not to make any plans or reservations without your input.", "NAH. They didn't convey the costs as quickly as they agreed to, so you're justified in sharing your disappointment. \n\nI think your conversation about your budget was too vague. \"I need to budget/save for the trip\" is not the same statement as \"I can only afford $X.\" \n\nThe trip was adequately planned. It just wasn't what you wanted. Unless you were clear about your budget, you can't expect someone else to know what you can afford.", "INFO: why do you need to clean your apartment after you return? Surely you can clean it before instead? It isn't going to get significantly dirty in 5 days absence", "I've gotta go with YTA - you're the one who proposed the trip in the first place knowing money would be tight but then still didn't offer any cost ranges to help set reasonable expectations.", "^(NTA.)", "INFO: when is the trip, as in how soon is it coming up?", "Don't suggest any more trips \n\nNTA.", "NTA. Tell them you are not paying for the car or gas, it's going to be on them. When they don't like it, say they are being dramatic and that's no big deal.\n\nLol. I am kidding, of course, although it would be fun to watch their reaction.\nJust reschedule or go by yourself.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nA while ago, I suggested that my family (my mom, stepdad, and I) take a trip. We're taking a train trip and then renting a car to visit some towns near our \"main\" destination.\n\nThey said it sounded like a great idea, and my stepdad took it upon himself to look up train tickets and hotel rooms (he has hotel points from work travel).\n\nI told them to please let me know ASAP what my share of the hotel and train tickets would be, as I needed to make sure to set aside the money. It was already going to be tight for me, as I am paying off some debt, but I could make it work, and this will be a kinda once in a lifetime trip for someone like me.\n\nOver the next few weeks, I keep asking one or the other of them to let me know what my share will be. They keep saying \"oh, we'll let you know, thanks for reminding me\".\n\nFinally, *last week*, my stepdad lets me know the train ticket is $109. Awesome, I send him the money.\n\nThis week, I still haven't been told what my share of the hotel and rental car will be. I figured it wouldn't be too much since my stepdad (who has already booked the room) said he got 2 nights free, and we only needed 3 nights total. (Leave Thurs morning, take overnight train back Sunday night).\n\nFinally, today, I am told the following:\n\n* The hotel is $300/night, since it is in [MAJOR METRO DOWNTOWN].\n* We booked 4 nights not 3, since the overnight train Sunday night wasn't available after all.\n* So your share is $225 for the hotel. We still don't know about the car lol.\n\nNow, with 5 min of google searching, I found 2 different hotels from my stepdad's points brand that are both >$100/night cheaper, and closer to some of our destinations. Additionally, I had planned my leave request for work under the impression we were getting home Monday morning, so I would have all day Monday to do things like do laundry and clean my apartment before work on Tuesday. Instead we are getting back Monday evening, leaving me roughly 4 hours to get this stuff done. Oh, and my apartment has exactly 1 washer and 1 dryer in the building, so hopefully I don't get stuck behind someone else.\n\nI expressed frustration at not being more involved in the trip, which I came up with, and at not being given more info about the cost and about changes to the itinerary. I said you all knew my money is tight, and I repeatedly asked you to get me the cost as soon as possible, and you kept blowing me off. I also pointed out that, unlike my mom who sets her own schedule for work, and my stepdad who has flexible telework, I work in healthcare and have to be in clinic first thing Tuesday, basically 12 hours after stepping off the train.\n\nMy mom just said \"this is stupid, and if you don't want to go you can just cancel, but I'm not talking about this, you're just being dramatic and should have saved more money\".\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Ntah. Tell them to give you back your momey.", "NTA - tell them you’ve decided to take your Mom’s advice and cancel going as a longer trip is outside of your budget. Also, ask for your money back to start a fund for a solo trip later", "I'm sorely tempted to do this, but I'm super upset because the whole trip was originally going to be me going by myself to 1 specific destination.\n\nI mentioned I was starting to plan it to my mom, and she expressed interest in going, and it kind of ballooned in scope. \n\nWhat was originally going to be a \"leave Friday, tour the city Saturday, return Sunday morning\" turned into \"leave Thursday, tour 3 cities Fri/Sat/Sun, return Monday.\n\nI'd been trying to put this trip together since *last* fall, and now my options are throw away the plans and sit alone at home, or go along with it and be broke the camels rest of the month.", "Kind of just tidy up and make sure things are good to go before the workweek?\n\nTypically is try to use Sunday as the day to vacuum, mop, do laundry, make meals for the week, etc.", "I was never asked. I was told \"oh, STEPDAD has hotel points, he'll take care of it!\".\n\nFrom the very start, I made some suggestions (since the original trip was me going to one city by myself and then mom and stepdad said they wanted to go), and was told they'd handle it all, I just needed to make sure to pay my share.", "Leaving the morning of October 5th, returning the evening of October 9th.\n\nThe reason I was so insistent about knowing the price ASAP is because I only get paid twice a month, around the 1st and the 15th. 80% of my paycheck at the 1st pays my rent, so all my bills and other purchases come out of my 15th of the month check. Hence wanting to know so I could set aside money from 2 months rather than 1.", "I think they ended up running away with your idea, whether they meant to or not and now they're in so deep that they've lost sight of they've done. Your mom sounded really defensive and putting her guilt about it back onto you by blaming you for not saving enough money and accusing you of being dramatic. Geez. She has a partner to contribute to the costs but you don't. And who's paying for all the meals and entertainment??\n\nEDIT: See about changing your vacation request at work for another time. Then start saving up for another trip for you and a friend! You would end up being the 3rd wheel with your mom and stepdad and probably doing whatever they want to do, going to restaurants that they want to go to, et cetera.", "Why can't you just go yourself? Take an earlier/later train, stay at a different hotel.", "Never being asked doesn’t mean that you can’t speak up for yourself. Especially when it means the difference between losing out on a fun trip because you can’t afford it, or being financially irresponsible just to still go anyway.", "Ok, ESH, but more of this is on you. They should have been quicker about getting you the info.\n\nBut also…if you had strict financial limitations the conversation should not have been ‘let me know asap how much it costs’ but ‘I cannot spend more than X amount’. You went along with them making the plans and didn’t tell them you had a limit, then got mad when they made arrangements that were cheap enough for you. And frankly, $225 for three nights in a hotel is an INCREDIBLE deal, so I don’t know what you were expecting to pay. Nothing stopped you from putting aside more than enough money for the trip.\n\nThey also can’t help that the train you initially wanted wasn’t available.", ">She has a partner to contribute to the costs but you don't. And who's paying for all the meals and entertainment??\n\nLol, yeah, also - the extra day out of town means an extra day to pay the guy who checks on/feeds my cats. Meanwhile my mom and stepdad have my youngest brother there to mind their pets (not to mention he lives there rent free despite being employed full time...)\n\nAnd we're each paying for our own food, and splitting the cost of the rental car (not been told what that is) and gas for the car.", "Well for one I've already paid them part of my share, and for another I already scheduled my time off work. I can't change the dates, at least not beyond leaving later and/or returning earlier.\n\nThe train from my town only goes to that destination 1/day, and that's *if* I could get a separate ticket this late.", "You're not wrong, but I just feel like my trip was co-opted out from under me and instead of it being a collaboration it turned into \"this is what we're doing\".", "😲 Are you serious? That's not fair. You're getting the short end of the proverbial stick, my friend!!\n\nReminds me of some old card playing saying, or was it a song? \n\" You gotta know when to hold'em, know when to fold 'em!\" I think there's a last part that says something about knowing when to walk away!!\n\nEDIT: If it makes you feel any better, something similar happened to me some years ago. I had planned a special anniversary party for my parents. After discussing it with my siblings, one of them just went behind my back, made all the arrangements and presented it to our parents like it was their idea. They even picked another place instead of what I had planned, took my parents there and back, acting like they were the big organizers and then took all the thanks for an evening well planned and executed.", "Can you take back the money, and then re-book at a later date so it can be what you first wanted it to be?", "The song you're thinking of is \"The Gambler\" by Kenny Rogers", "I can ask if they will give back the money. The train tickets are already booked, and I have no idea if mine could be refunded.\n\nThe hotel room is booked (we're all dog piling in 1 room \"to save money\", so even if I back out, they'd still use the room.\n\nBut I have no way to make them pay me back. Money was paid via PayPal.\n\nMy (bio) dad has offered to chip in, so I might still be able to afford to go depending on how much he can afford to lend me, but I'm just feeling super soured on the whole thing.", "NTA - no one expects to get treated this way by their family. You tried to get ahead of it by asking about your end ahead of time and they kept blowing you off. You should tell your Mom how disappointed you are and how you expected more from her, especially if it was supposed to be the two of you to begin with. If she thinks honesty is being dramatic, that’s on her. Nothing more you can do. Sorry this happened to you.", "Yes, yes it is. \n\nYou gotta know when to hold 'em, know when to fild 'em, know when to walk away, know when to run.\"\n\nOne of my dad's favorite Kenny Rogers songs. Even a TV movie or two that was/were inspired by the song or the song was created as the theme for the movie(s).", "It's also Hank Hill's favorite song 😁"]}