{"id": 27263, "submission_id": "16njllz", "title": "AITAH to offer my house as a venue for my SIL's bridal shower", "selftext": "My sister in law (brothers wife) got married recently. I offered to throw a bridal shower for her knowing that she doesn't have any friends, and her cousins are boys. She gladly accepted and seemed very happy. \nSo I started planning, I consulted with her on a few details to make sure the event would be to her liking: the decor, colour scheme, games/entertainment etc. And it was agreed that we would have the party at her house, a few streets away. Everything was in order until she finally sent me the guest list of over 40 people!!!  Hosting this amount of people during the pandemic (no restrictions at the time) in a small space seemed impractical to me. So I offered to have the event at my place instead, in order to accomodate all these people (originally we had discussed about 8 -12 guests) I have a large outdoor area with a fireplace, pool and garden and have plenty of extra chairs, tables etc. So nothing would need to be hired and the venue would be free. \nSIL freaked out!!! She insisted that we have the event at her place even after I explained that the space would be far to small for the amount of people on her guest list and attempting to accommodate that amount of people would pose more of a health risk. She insisted so I agreed but I tried to manage her expectations of the event by saying that we wouldn't have enough space to have a photo booth, candy table, champagne bar etc. \n\nShe accused me of making her event about me and saying that I should be doing whatever she wants and not what I want. I just wanted her to have the best celebration possible and felt that I could do that for her if I had the space to make all of my ideas come to life. I also feel that if someone volunteers to do something for you on their dime it should be appreciated regardless.\nAt the end of this conversation she said that maybe it's best if I don't arrange it for her after all. I accepted immediately and said that I really wanted her to be happy and if she preferred someone else to arrange it instead that that would be the best option going forward, and that I will not be involved any further and attend as a guest. And she agreed to this. A few hours passed that day and suddenly she messages me again and apologized for being rude and saying she was just stressed etc. But she really wants me to still plan the party for her so she'll 'let' me do it. I feel that my offer was very gracious and the fact that I opened my home to her and her family was generous, in addition to paying for the event. \n\nBut was I in fact the real the A hole here?", "created_utc": 1695211615, "permalink": "/r/AmItheAsshole/comments/16njllz/aitah_to_offer_my_house_as_a_venue_for_my_sils/", "score": 21, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > (1) offering my house as a venue for the party instead of the agreed smaller venue\n(2) the offer contradicted the brides wishes\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. I’m bothered that you guys had discussed 8-12 guests and she now expects you to foot the bill for 40.", "NTA - weird reaction on her part, I mean it sounds like a dream come true to me - you mean I don't have to make sure my house is spotless or have the stress of 40 people in my home? Sign me up!\n\nYou mentioned it was mid-pandemic, what ended up happening?? How did it go?", "Thank you for the feedback. I did end up just doing it to not create drama. But the whole situation left me so confused. I decided that I would just never offer to host a party for her ever again. But now that they are married, could have a baby soon etc. I was torn.", "Asian family.... 😂 I think she got caught up on not being able to leave anyone out even if she didn't actually want them there initially.", "NTA. Even consider if declining the offer of continue planning the event, this seems like the thing she will bring with resentment in the future. You can say “after all the things from last conversation i prefer to have a guest role so it doesn’t affect our relationship “", "NAH. Your offer was amazing, the venue was perfect for the amount of people and your “vision” sounds like fun. You’re not an AH for offering a gorgeous party. However, maybe the bride didn’t want all that. It’s not clear if she wanted a Photo Booth, candy table, champagne etc. Maybe she wanted a less fancy affair and that’s why I can’t call her an AH here either. Communication is key in these situations. I hope you solved it and everyone had fun.", "The reason she gave was that her family would feel more comfortable at her place than mine since I'm some rando and not part of 'their' family. Which was something I hadn't considered.", "A bride should not hold a bridal shower at her own house under any circumstances. Here’s what Miss Manners has to say on the topic.  \n\n “If only Miss Manners could pry that word “shower” out of the hands of people who want to honor their relatives. Showers are properly given only by friends, and before the wedding. But this does not prohibit the family from giving parties that are not associated with presents.”\n\nLink to whole article [here](https://www.washingtonpost.com/lifestyle/style/miss-manners-wedding-showers-and-gifts-unwelcome-host-guests/2011/09/30/gIQAhxcavL_story.html). \n\n“Miss Manners keeps hearing of such social atrocities as mothers demanding them, bridesmaids going broke giving them, brides sulking because they didn’t have them, and guests being milked for multiple ones for the same couple.” \n\nNTA", "ESH. Bride was being impractical and unappreciative and you were high on hosting.", "YTA\n\n&#x200B;\n\n\"She insisted that we have the event at her place\" .. she is fine to do that. It's HER event.\n\n&#x200B;\n\nOFFERING was fine - but insisting makes you the AH.\n\n&#x200B;\n\n&#x200B;\n\n\"She accused me of making her event about me and saying that I should be doing whatever she wants and not what I want. I just wanted her to have the best celebration possible\" .. obviously not. YOu want to do something you KNOW she doe snot want . THAT makes you the AH, she is right.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy sister in law (brothers wife) got married recently. I offered to throw a bridal shower for her knowing that she doesn't have any friends, and her cousins are boys. She gladly accepted and seemed very happy. \nSo I started planning, I consulted with her on a few details to make sure the event would be to her liking: the decor, colour scheme, games/entertainment etc. And it was agreed that we would have the party at her house, a few streets away. Everything was in order until she finally sent me the guest list of over 40 people!!!  Hosting this amount of people during the pandemic (no restrictions at the time) in a small space seemed impractical to me. So I offered to have the event at my place instead, in order to accomodate all these people (originally we had discussed about 8 -12 guests) I have a large outdoor area with a fireplace, pool and garden and have plenty of extra chairs, tables etc. So nothing would need to be hired and the venue would be free. \nSIL freaked out!!! She insisted that we have the event at her place even after I explained that the space would be far to small for the amount of people on her guest list and attempting to accommodate that amount of people would pose more of a health risk. She insisted so I agreed but I tried to manage her expectations of the event by saying that we wouldn't have enough space to have a photo booth, candy table, champagne bar etc. \n\nShe accused me of making her event about me and saying that I should be doing whatever she wants and not what I want. I just wanted her to have the best celebration possible and felt that I could do that for her if I had the space to make all of my ideas come to life. I also feel that if someone volunteers to do something for you on their dime it should be appreciated regardless.\nAt the end of this conversation she said that maybe it's best if I don't arrange it for her after all. I accepted immediately and said that I really wanted her to be happy and if she preferred someone else to arrange it instead that that would be the best option going forward, and that I will not be involved any further and attend as a guest. And she agreed to this. A few hours passed that day and suddenly she messages me again and apologized for being rude and saying she was just stressed etc. But she really wants me to still plan the party for her so she'll 'let' me do it. I feel that my offer was very gracious and the fact that I opened my home to her and her family was generous, in addition to paying for the event. \n\nBut was I in fact the real the A hole here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "U not the A hole. SIL need to chill and appreciate ur offer. She can't have it both ways, either u plan or someone else does. U did a nice thing by offering ur house and paying for everything, she should be grateful instead of stressing u out.", "NAH. You are doing the best that you can and she is stressing out about the wedding. \n\nSide question.  If she has no friends,  who are the 40 people she invited?", "Well, it’s her party. Your points are all valid, but it’s her party in the end. I think she’s TA. I’d just go along with it and get it over with.", "NTA, you were only trying to help.\n\nBut I have to ask: how does someone without any friends and no female cousins manage to invite 40 people... who were all those people?", "NTA you gave her a hand, she pretended the whole arm.", "How does she \"not have any friends\" but also have 40 + people to invite? Are you sure you didn't hijack this from the start? Something doesn't sound right here", "NTA. \n\nIt was lovely of you to offer to throw her the party, and graciously accommodate a much larger gathering than previously agreed upon. \n\nYou were being very practical around space constraints while also trying to mitigate issues around overcrowding. The party sounds like it was quite an elaborate one but as you say in a later post, she is the one who wanted something larger and more extravagant. We could give her the benefit of doubt that perhaps she didn't want to feel upstaged by the event being held in your home, and losing an aspect of control and intimacy? Whatever the reason was, it was quite rude given the effort you went through.", "NTA, and let me say, I would have declined her offer after she was so rude to me.", "DO NOT RENEGE ON BACKING OUT. This will happen over every choice about the party, and you're already free from it. Dont go back. NTA.", "NTA. The size of her guest list dictated a venue change, and your suggestion was reasonable. Hopefully she realizes that now and is sincere in her apology, and you can choose to graciously accept it.\n\nI must admit I may be a bit biased because I once offered to fully host and fund a bridal shower for a family member, spending thousands, plus I rented a special house near where she lived as a venue, and then she presented me with a guest list of over 100 women. I had to explain that was too many people for a bridal shower, and perhaps she could have several showers instead (bride's family, groom's family, friends only.) She eventually relented, and she had two lovely showers, but I always felt she held a grudge about it, which I did not appreciate.", "NTA, and she is going to be a blooming bridzilla.", "This is my take as well. She was being impractical expecting 40 guests inside of a tiny area. And you hear you were offering a bigger area for the amount of gas she decided to spring on you.\n\n\nNta\n\n\nThough personally you wouldn't matter how much she apologized I would not take back over nor would I let them into the house\n\nBut I'm also Petty and also been used way too much so take it as you will", "Never even thought about that part.... she just sent a guest list and out if nowhere 40 people were on it.  Somehow I never got the chance to even be bothered by this part because she started the whole other drama.", "Exactly! That's what I thought. I would love for someone to offer to do this for me. The reason she eventually gave was that her family would feel more comfortable at her house than at mine. Since I wasn't part of 'their' family and they didn't really know me. The event was planned and then cancelled 2 days before because one of her 40 guests arrived from out of town with COVID and stayed at their house exposing the entire household. The event never happened..... she was married  a few weeks later.", "Perfect response thank you I will be using this in the future.... (I ended up planning the event to keep the peace) but I have decided not to host anything for them again.", "She loves all things extravagant the bigger the better, she was consulted at the start on the kind of event she wanted and everything was planned to her liking. I think the thing that triggered her was when I told her it would be impractical to have all those things we had discussed for 40 people in her small garden. \n\nPeople got COVID and the event was cancelled in the end. But the drama of the whole situation left me confused. \n\nThank you so much for your feedback.", "OP didn't insist, SIL insisted, OP just explained there would be far more limitations with a smaller space and expressed concerns about covid - seems pretty rational to me.", "Asian family....", "Asian family.... the people she invited were all family only 2 friends from high school were invited. (She is no longer friends with these two friends due to some other wedding drama that happened between them) \n\nAt the same time to some degree I do think you are right, although I did wait an entire year after their engagement to allow anyone else in her family to volunteer to plan it but no one did..... having said that  I have a tendency to get excited and hijack event planning because it's something  I'm really good at and enjoy doing and seeing the joy on people's faces (usually) when their event comes to life.  I think in future it's best I don't get involved in planning again and just attend their events as a guest. \nThanks so much for your input", "Thank you so much for your feedback. I think you are right on the money she probably wanted it at her home so she could have more control and the party could feel more 'hers' and I had not even considered this I just said more guests equals more space needed and never thought of any other nuances.", "Thank you for this. And I am so sorry to hear of your experience sounds like you planned something amazing for her . I cannot imagine holding a grudge over someone doing something so kind for me.... 100 people is literally insane.", "Dear Karma, \n\nThanks for having OP's back.\n\nLove,\nSisters of OP\n\n>The reason she eventually gave was that her family would feel more comfortable at her house than at mine. Since I wasn't part of 'their' family and they didn't really know me.\n\nHow did they survive attending the wedding?! Was the venue owned by someone in \"their\" family? Why wasn't that offered for the shower to begin with if being in the family is a necessary requirement for participation and attendance?! \n\n(Sarcasm aside, social gatherings are events and sometimes events take place at venues. Sometimes venues are houses. Sometimes when multiple families are involved, venues can be personal locations, such as houses, that one may never have been associated with before and never will be again. That's how social gatherings work. Sheesh...And the sarcasm never got put aside, did it?)", "Ah, then I really don’t understand why she wanted it happening at her place. Oh well. Still, you were definitely not the AH. And blame it on her nerves. Some brides get nuts and have ideas of their own and can’t see beyond them. At least she “apologized” in a way.", "And what was even worse is that her mother refused to advise her that 100 people was too many for a shower. \"Whatever she wants,\" was her mother's opinion. And I had to say \"She's young and she doesn't know what's appropriate. It's our job to help explain that to her.\"", "The reason she gave was that her family would feel more comfortable at her place than at mine because I wasn't part of their family.... yes she did apologize however it was only after she realized that no one else would organize it for her and she needed me to do it or she just wouldn't have anything at all. I think you are so right she was fixated on her ideal situation which just unfortunately wasn't practical.", "Exactly this sounds like the same exact situation I had. It was just it's her day her choice whatever she wants without regards to what's practically possible."]}