{"id": 27288, "submission_id": "16ny3po", "title": "AITA for rescinding my offer to help with my niece's wedding.", "selftext": "I have always been good with money and am careful with it.  I also inherited a good chunk to be fair, I was able to retire last year fairly early as these things go.  I am not married and have no children.  My sister in law asked me to help with her daughter's wedding.  This is my brother's step daughter, there is no blood relationship.  I suppose she is not really my niece, but they call me her uncle.\n\nI initially told them I would help, I was thinking maybe $1,000 or so.  I was going to give the same amount as a wedding gift, but they did not know that.  They started booking things and asked if I could give them $15,000.  Yes, I could, I just don't want to, I would give $1,000.  My sister-in-law started pressuring me for more, I said no.  $1,000 was a nice contribution for a step uncle (for lack of a better term).  She then got angry and called me names, etc.  This is where I might be an asshole.\n\nI told her that the offer of any money is rescinded, I would not give a cent, not attend the wedding and not give a gift.  She called me an AH and all sorts of other things.  My brother called me an apologized for his wife and asked if I would consider $5,000.  I told him that I loved him, but did not like his wife and that my decision to give nothing stands.  He then joined the AH chorus.\n\nAITA for rescinding my offer to $1,000?", "created_utc": 1695247620, "permalink": "/r/AmItheAsshole/comments/16ny3po/aita_for_rescinding_my_offer_to_help_with_my/", "score": 3322, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for rescinding my offer of financial help for my niece's wedding?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Yeah, calling you names was a genius way to get you to contribute more money..\n\nI don't blame you for not giving anything at this point. They are acting so entitled to YOUR money, but just because you have money to spend doesn't mean you have to spend it on them.", "My full blood uncle had nothing to do with our wedding apart from being a guest and he's got a few dollars too.  I would never have thought to go to him and ask for money.\n\nIf they're asking for $15k, they're spending too much.  And as for your brother, he made the decision to marry a woman with a daughter, he should have started saving way back then.\n\nNTA", "NTA. If your $1000 isn't good enough for them, so be it. They don't need it. Keep your money. Your brother apologized JUST to beg for more money - it wasn't a true apology. Users suck.", "Okay, let's recap:\n\nSIL:  Give us $15,000 for my daughter's wedding, even though you aren't technically related.\n\nYou:  Nope.  You can have $1000, though.\n\nSIL:  She gets angry and calls you names\n\nYou:  Okay, then I'll give you --- let's see, NOTHING since you called me an AH among other things.\n\nI am baffled that people who are asking for a FAVOR or a GIFT think that verbal abuse and name-calling will get them what they want.\n\nI mean, has that ever happened....ever??", "NTA. You don’t have to give a single penny, and TBH, those thousand dollars were not at all what they wanted. When you thought it was more than a generous gift (and it is!) your SIL saw it as nothing. So keep your money and stay home.", "NTA and asking for $15k??? Holy entitlement!! I cannot imagine asking anyone but a bank loan officer for $15k.", "NTA.\n\nI don’t understand people who ask others for money for things like this. It’s entitled & weird.", "NTA \n\nI thought people have some audacity asking family and friends for money for their wedding. But to ask non-family is SO out of line!!!", "Nta talk about entitled dont leave them anything  in your will either", "NTA.  Their assumption of $15K is outrageous. Your offer of $1K was generous. Sure, it should have been worked out ahead of time, but they never **ever** should have booked things with a blank check in mind. Then to start insulting you, thinking that would somehow soften your heart and open your wallet?  Ha!", "NTA, man. A grand was a huge gift for someone who's not a blood relation, and the way they're acting like they have a right to your money should tell you that they don't deserve your help. Don't worry about it. Not your problem.", "NTA.  A novel idea would be to have the wedding they can afford, rather than demanding (err...requesting) huge gobs of cash from anyone!", "I'm gunna go NTA here...\n\nWhile I personally wouldn't have shot straight to rescinding and not going to the wedding at all, I really can't blame you for your decision. It sounds like they were trying to use you as a wallet and got mad when the purse strings were cut. People can't plan an event above their means with the intent of depending on someone else's bank account. \n\nYou're retired. You're not going to have more money coming in, regardless of how much you still have. You can't go blowing it willy-nilly on some party just because your step-niece wants a more expensive breed of flower for the table settings. That's absurd.\n\nAnd it sounds like you're not particularly close with them as it is, or the step differentiation *probably* wouldn't have crossed your mind. We're people on the Internet, we don't care about who's related by blood and who's related by marriage. But it does stress (to me) that it doesn't sound like these are people you regularly brunch with or anything.", "NTA. \nIt sounds like they wanted you to “buy” your way into their wedding and your presence would be at the low price of 15k.", "NTA. They’re not entitled to your money, very simple.", "NTA. When someone asks for something and gets angry and abusive when you decline, they were never asking. It was a command disguised as a request.", "NTA, $1000 was a generous offer from you no matter what relationship you had with her. They probably wanted the $15000 to pay for the honeymoon.", "People are often, including in this thread, confused by such entitled attitudes.  How could anyone demand so much money from someone they're clearly not super close to? The answer is simple:\n\nThey don't respect you. At all. Not even a little.  The only way someone can feel entitled to someone else's money like this is if they don't see you as a person the same way they see themselves as people.  You're probably just \"the weird uncle who doesn't *need* all that money. He should give it to us.\" \n\nOP, the nature of this request and the reaction to your very reasonable choice to offer nothing after the vitriol makes it clear these people wouldn't give you $5 if you need the bus home.  Never regret giving them nothing. They're AH. \n\nYou are NTA.", "nta.\n\nshe's being greedy and entitled thinking  your money is for her use.\n\nrescind away and don't spend so much as a penny on the wedding.", "NTA my entire wedding was under 15K", "NTA. It is in no way your responsibility to pay for the wedding. Offering 1k is generous. Your generosity was met with ridicule and any sane person would no longer offer to help financially. Sounds like you don’t have much of a relationship with your niece anyways so the only thing they wanted from you was money.", "Nta \nFair out I'm getting married next year to my partner of 10 years and we haven't asked anyone for money \nCause we want to get married so we will pay our own way for the wedding \nWeddings aren't cheap but that's why u start out with a budget and then work out how long it would take u to save \nBut if someone was going to give me money I wouldn't bite the hand that feeds me 😅", "NTA  \n\n\nnext time one of them calls asking for anything more than 1000 dollars, tell them that you offered to *help* with the wedding, not *pay for the whole damn thing.* if they send the flying monkeys after you, call your sister in law and tell them the rest of the family is on her side and as such they have offered to pay for it.", "No. You have essentially zero relationship. Stick to your guns.\n\nPeople! Please stop having weddings you can't pay for. It's one day.", "Only thing I’d suggest if there was a similar situation, is to answer “can you help?” with a “I’d be happy to contribute $1,000 to helping them with their celebration” instead of an open “yes.”  Would help to clarify expectations early on.  They got ahead of themselves thinking higher amounts and common civility went out the window.", "NTA. I would never ask a family member to pay for my child’s wedding. She was way out of line when she demanded $15k", "NTA\n\n$1000 is very generous. If greed is more important than gratitude, especially from someone who isn't even your blood relation, then you absolutely get to say, \"You know what? Never mind. Forget this noise.\"", "My whole wedding was $7500 lol", "Nta 1000 is a good chunk of money from a step uncle to help with a wedding. They all got greedy and you have every right to not help at all", "NTA. Relationship does not make uncle a bank. A relative is never entitled to another’s money. Then they had the audacity to insult. Nope.", "How the fuck did these people ever managed to gaslight you into thinking you're in the wrong??? \n\nNo man. NTA.", "Have ppl no shame or sense? Why are they spending above their means for a wedding? \n\nNTA. I can’t believe your brother and that family.", "NTA doesn't matter what your financial status is, I think that $1000 was an appropriate offer. I don't think they had any class to ask you for more", "NTA. You offered good, then got worked over, and did the smart thing taking the offer back.   \n\n\nThis, about a stranger twice removed. The answer is \"no\". Do not explain your no. No is a full and complete answer.", "NTA BUT I would consider attending the wedding if your relationship with your niece is positive. No need to give money but also no need to punish her personally for her parents terrible behavior. Of course if your uncomfortable going then don’t - but perhaps send a little gift and a card as a gesture of your relationship to HER not her parents. But if she’s also behaving poorly then throw the whole lot out lol", "NTA. But probably a good lesson to be more specific about what “help” means in the future, in case you try to help anyone else who turns out to be off their rocker. 😄", "NTA this whole thing is weird. I feel like the entitlement would still be there, but if they wanted to ask for help for wedding expenses (tacky) they should have had a number in mind or asked you how much you can contribute to help with budget. $1000 is very generous given your relation, related or not, but it seems like they wanted your contribution to be a significant percentage of the cost. $1000 is helpful but they clearly were thinking bigger financial contribution. (Entitled). I would love to know why they thought 15k was a reasonable ask. \n\nI wouldn’t help with wedding either. I don’t know how involved you are with the step niece but after the dust settles, if you feel like the niece is more innocent, I think a good gesture would be something specific to her and husband. Completely up to you, doesn’t have to be near $1000 but it sounds like the mother is a piece of work.", "Well, things would have gone easier for you if you hadn't, but I can't say I blame you. NTA. And $15,000 is a HUGE ask. And $1000 is quite generous for a nephew or niece! I only gave $200 to my nephew for his wedding. \\*Feeling cheap\\*", "NTA but in the future if you plan to help out, if you already have a monetary value in your head, i would say that upfront. “Yes i will help. Ill give $1,000 towards the cost.” \n\nThey assumed you would help with whatever amount they came up with because no limit was set upfront. Very ballsy of them to ask for $15k. Who the heck do they think they are lol \n\nThey were a choosy beggar in this case. You can’t ask for financial help & then get upset because the amount i’m offering you is too low.", "NTA, but really, YOU and THE BRIDE should have had a clear friendly discussion up front about how much “help” you would give.  You and her parents didn’t clarify, which led to misunderstandings and anger.  To preserve family relationships, consider contacting the bride directly to wish her well and offer a specific amount of “help “.  Acknowledge things kinda blew up with her parents due to failure to clearly communicate and you regret that and still wish her well.", " NTA. Spend it on a vacation during the same time as the wedding. They are not entitled to your money.", "NTA 100%", "NTA. Just no.", "NTA. They are ungrateful gold diggers", "ESH. There’s a difference between “helping with the wedding costs” and being a generous gift giver. You misled them to start with by saying you were willing to contribute which was always going to be a more significant amount, when really all you had in mind was a generous gift. You could have said up front ‘yes I’d love to contribute $1000 to the wedding’ instead of certainly inferring you were up for more, and no one would be here getting upset about it.", "INFO:  How long has she been married to your brother?  How long has he been in the stepdaughter’s life?  \n\nYou’re NTA but you seem super distant/unhappy about the fact that she is your niece.\n\nLike…\n\n> This is my brother’s stepdaughter, there is no blood relationship.  I suppose she is not really my niece, but they call me her uncle.\n\nYou sound very cold/distant.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have always been good with money and am careful with it.  I also inherited a good chunk to be fair, I was able to retire last year fairly early as these things go.  I am not married and have no children.  My sister in law asked me to help with her daughter's wedding.  This is my brother's step daughter, there is no blood relationship.  I suppose she is not really my niece, but they call me her uncle.\n\nI initially told them I would help, I was thinking maybe $1,000 or so.  I was going to give the same amount as a wedding gift, but they did not know that.  They started booking things and asked if I could give them $15,000.  Yes, I could, I just don't want to, I would give $1,000.  My sister-in-law started pressuring me for more, I said no.  $1,000 was a nice contribution for a step uncle (for lack of a better term).  She then got angry and called me names, etc.  This is where I might be an asshole.\n\nI told her that the offer of any money is rescinded, I would not give a cent, not attend the wedding and not give a gift.  She called me an AH and all sorts of other things.  My brother called me an apologized for his wife and asked if I would consider $5,000.  I told him that I loved him, but did not like his wife and that my decision to give nothing stands.  He then joined the AH chorus.\n\nAITA for rescinding my offer to $1,000?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, why why why do people think they’re entitled to other people’s money? 1k is a very generous gift from an uncle let alone a step uncle. They basically wanted you to pay for the wedding. Then when you refused but still offered money they got nasty. Why would you give money to anyone disrespecting you? Def stick to your guns. May cost you your brother relationship but clearly his wife leads him by the balls. NTA", "NTA. Planning a wedding relying on someone else's unpromised contribution (because initially they didn't have an amount and then it was 1k) is really dumb. They need to plan within their means, which was 1k from you.", "NTA.   What a greedy  family.   Skip the wedding  because they will still be looking for a big check", "Nta. Asking the step uncle for 15k is crazy.", "NTA. She insulted you because she wanted more money? That's moronic. \n\nBe glad you found out how entitled they are and how they really feel about you. Now you don't need to help with anything.", "NTA - I really don’t get people who start calling the potential money-giver names after that person says no.  If it were me, I’d ask if there was something I could do to change OP’s mind.  I’ll help clean OP’s house or take over home cooked meals each week…or whatever.  This biting the hand that could potentially feed the recipient is just dumb.", "NTA They are very ungrateful, and asking for 15,000 is ridiculous, even 5000. Rescind the 1000, then maybe they will realize what their actions have caused them!", "NTA. You're a lovely human for even offering $1k . . . especially for an adult step niece. No one is entitled to money, and people with money are not required to give away money they've earned/acquired.  \n\nIt sounds like she wants a wedding beyond her means. \n\n(I'm so glad my husband and I went to Las Vegas.)", "NTA - Honestly, no one is entitled to your money. You offered 1k and that's generous. My own brother makes a lot more than myself and I never even thought of asking him for money to go towards my wedding (or anything for that matter). If they can't afford the wedding they want with their own funds then they need to scale down their wedding. No one needs to spend 15k of someone else's money on a wedding.", "Nta\n\nThey don't get to pick your contribution amount. \n\nRight there that makes them all ah.\n\nSecond name calling is never ok. They can get married at the courthouse if money is an issue.\n\n\nOr God forbid save themselves. Oh, the horror", "NTA. The nerve of some people.", "NTA \n\nthey were being greedy and even started to berate you .", "NTA. You offered $1,000 & that wasn't good enough. She resorted to name-calling & you yanked any and all offers. She shouldn't have been a choosey (entitled) beggar. And your brother isn't any better. It is your money. How you choose to spend it (or not) is entirely up to you.", "They are not entitled to your money. You offered a generous contribution. The appropriate response is thank you.\n\nNTA", "NTA", "No you are not. I believe it’s out of line to ask others to help give money for a Wedding. The parents are there to offer, and if anyone else wants to offer, they can do so out of generosity, but to ask is highly inappropriate I think you were awfully generous to even give 1000 as a gift and for them to pressure for more is so disgusting. I do not blame you for rescinding everything.", "NTA\n\nNone of my three blood uncles even bothered to RSVP “No” to my wedding, they all just didn’t show up. Four months later, I got a note and a gift from my middle uncle’s wife, apologizing for not attending because he was recovering from *heart surgery* that none of us knew about. Their mother died from heart complications, so it’s a sensitive subject. My mom is still pissed at all her brothers, especially since she gifted a large check to my oldest uncle’s daughter when she got married a few years before I did and we all attended the wedding 1,000 miles away.\n\nYou should be petty and go on a nice $15,000 vacation around the same time as the wedding and be sure to take LOTS of pictures.", "NTA. Heavens above. You are about to give 2k to someone you barely know and they tell you it isn’t enough. Like you I would tell them to whistle", "Good lord, NTA. I can’t imagine being offered a monetary gift and then demanding $15,000. Even $1000 makes me uncomfortable. They 100% think ‘you can afford it, so you should give it to me’. Gross", "NTA and now how could you even give ANYTHING without feeling like a sucker? Yikes. If you are still going and giving the 1k, I’d give it to them in a 5 yr treasury bond or similar.", "NTA . You don't have to have a reason not to contribute. Is is your money, they have no say. After the greed, then the way they acted when you refused to help any longer, you should feel confident you've done the right thing.", "It's nice to be generous to others, but when they feel they're entitled to your money, then that's a different story. Doing good for others is one thing, but trying to take advantage of others is another.", "$15,000? The kindly dropped it to $5,000? \n\nAre they kidding? $1,000 is so generous. Your are NTA. Hope the bride realizes what a pill her mother is and what it cost her. Wait, she probably knows as she's probably making her miserable too.", "NTA. She should've asked how much you'd be willing to contribute.\n\nThat said, how has your niece factored into these conversations and why hasn't she asked you directly (or apologized0? I ask because you mention your brother and SIL- it's not clear what the niece's take is.", "NTA.  You owe them nothing not even 1 cent.  The absolute entitlement of them.", "NTA where is this girls father? And no, you're not obligated to give any money to a step relative", "NTA. Transactional love. Ewwwww.", "NTA. 1K was generous, and it is completely ridiculous for them to demand 15K, and then get hostile with you for not giving in.  Wow, what has your brother said about this?  Don’t give them anything at this point, unless the bride comes to you, apologies profusely and explains she had no idea the extent to which her mom took things.", "NTA, if you give anything they will keep hounding you for more.  Put a block on your credit so they do not use your information to get things.", "It’s amazing how many of these AITA posts are a result of people not accepting no for an answer. NTA. They asked, you answered, the end.", "NTA. Beggars shouldn’t be choosy.", "I'm confused by this. Is it the typo where did your brother ask you to increase your $1,000 contribution to $5,000? Perhaps it's supposed to be only $500. By the way, not being willing to accept $1,000 donation to your wedding and demanding more and more is an asshole thing to do. Maybe you could go back to giving them the money if there's plenty of ass kissing and groveling, but realistically it sounds like you're nothing more than a checkbook to them so stand firm.", "NTA even a little bit.", "I hope you have a will. There's a children's organization or animal shelter or a needy person in your life who deserves your money (after you're gone) way more than them.", "Yeeeeah, NTA at all. I would ask what your relationship is with your step-niece - if you have an okay relationship, I might consider sending a gift - it seems like SHE wasn’t asking, her mom and stepdad were.. so I wouldn’t punish them for her mistakes. That being said, you’re within your rights to not send anything.", "NTA! Your money spend it how you like; they definitely do not appreciate you!", "NTA\n\nIt would seem their version of kinda uncle to your brother’s stepdaughter was spelled ATM.\n\nI am sorry they felt so entitled to be so greedy. \n\nAnd yep the perfect response was now no money and not attending the wedding. \n\nI do hope that you have a will that spells out where your money is to go.  If any of it was to your brother you might wish to make some changes.  Personally I’d leave him the $1,000 then also make it so anyone who challenged the will gets nothing.", "NTA. You are not a bank.", "Nta", "NTA", "Nta for rescinding. But ya for basically not claiming your neice blood doesn't make family love does.", "Nta at all.", "NTA for rescinding the offer part. Your SIL shouldn’t have called you names and just accepted the $1000.\n\nBut you will be if you don’t attend or give a gift. Your niece didn’t do anything wrong. It’s unfair to hurt her by not even coming.", "NTA... the nerve of some people...  I wouldn't care if they apologized a million times , there is no way in hell that I would give them anything after being so disrespected  by both of them.   I slightly feel  bad for the daughter but chances are  the apple doesn't fall very far from the tree.    It really sad that your intended generosity wasn't enough for the people that call themselves family.", "NTA. “Help” doesn’t necessarily mean money, and if it *does* mean money it means the amount you’re willing to give and no more. Why people go hog wild when offered *help* truly astounds me. I’d rescind my offer as well, you’ve now been told by three people it was not an adequate amount so I guess they can go without it.", "No. They bit the hand that was gonna feed them.", "NTA. Consider yourself fortunate not having to deal with this any further, as I'd have been unsurprised if that then turned into can you **also** buy the $8000 wedding dress? And help with the honeymoon? Why are you so stingy,  you have money, why can't I spend it?", "NTA your brother and SIL are major AH....", ">They started booking things and asked if I could give them $15,000. Yes, I could, I just don't want to, I would give $1,000. My sister-in-law started pressuring me for more, I said no. $1,000 was a nice contribution for a step uncle (for lack of a better term). She then got angry and called me names, etc.. I told her that the offer of any money is rescinded, I would not give a cent, not attend the wedding and not give a gift. She called me an AH and all sorts of other things. My brother called me an apologized for his wife and asked if I would consider $5,000. I told him that I loved him, but did not like his wife and that my decision to give nothing stands. He then joined the AH chorus.\n\nNTA !!!\n\nIt might be worthwhile to at least attend the wedding, even if that means reinstating the $1k (eventually).", "INFO: since SIL was asking, do you know for sure the money was actually going to the couple getting married? Is SIL the kind to 'skim' off the top or tell the couple the money was from her?", "NTA. Send em a nickel in an envelope so they know the stamp costs more than you contributed", "NTA. This is why it's good to not tell relatives when you have money.", "NTA. They should live within their means.  $15k is a helluva request.", "NTA  They made it clear that your gift was unwelcomed.", "NTA.  You don't owe them a dime.", "NTA! Don’t give them a dime!", "NTA OP.  What’s next, are they gonna ask you to give them one of your kidneys?  I’m glad you shut them down.", "NTA. \n\nQuestion OP- do you have a close relationship with your niece? There’s no mention of her being involved in the bullshit. If she’s indeed not involved, and if you had a relationship with her before I’d consider giving her the money after the wedding as a gift, but not for the wedding costs.", "Your brother and SiL are both greedy, entitled AHs. I feel badly for your step-niece, though.  If you get along with her, you might consider sending her the thousand as a gift... after the wedding is finished.  If you don't have much of a relationship with her, though, don't bother. NTA", "Whew!  Your niece and family don't deserve a cent given their behavior.  Just really classless.  Chances are the $15K would have grown later when the bride or family discovered something they couldn't live without (chocolate fountain at the reception? doves to release after the ceremony? diamond encrusted pumpkin chariot to carry the entitled bride and family to the ceremony?)", "Sounds like they are spending too much. My SIL just got married and it was very fun for less than $10k. 100% NTA the rest of the family are all AH", "NTA 1K would have paid for my whole wedding and I would have been thrilled with any gift I got. For me it’s not about gifts, it’s about celebrating the love. I guess that’s why we are still together 23 years later.", "Nta", "NTA. It's not even clear to me why you'd be helping to pay for the wedding in the first place.", "INFO: Have you spoken with the niece at all through any of this, or are you just dealing with bro and sil? If just them, maybe they promised niece money and are trying to pass your donation off as theirs!", "NTA. It doesn't even look like you have a relationship with the bride so you weren't invited. Just your wallet. At least they revealed their colours at the early stage.", "NTA. I would say that your SIL kind of rejected your offer when she started calling you names for offering \"only\" $1000.  \nTheir loss.", "15k a big chunk of cake to just randomly ask for. That's probably most of the cost of the wedding. \nIf the bride called you and said that she was sorry that her parents were money grubbing jackwagons, I'd probably return to the original plan.    \nNTA", "NTA... I dont understand the entitlement of some family. Especially when one member makes sacrifices and saves - their efforts are not public property", "They are greedy. NTA.", "NTA \n\nDid your brother not receive an inheritance he could've use for the wedding?", "It’s just a wedding but whatever is important to u", "NTA. I guess they need to change their wedding to suit their budget.", "NTA no way. Tell him you’ll contribute to the next wedding.", "NTA their assumption is that as you don’t have a wife or children, that the brother is going to inherit your estate, so why not just give it to them early? They are assuming your money.\n\nI’d send a nice toaster from Target (get the bright red one) and call it a day.", "NTA, jeez man I feel for you", "NTA.\n\nThey don't get to shit on your tongue then DEMAND that you sing for them.", "NTA. 1k is incredibly generous, especially given the relationship you have with her. Especially since you were planning to give an additional grand. They have no right to your money and were acting incredibly entitled", "NTA these people are so stupid!!! $1k is good, in fact, any money is good. Glad you shut them all up!", "I would have been thrilled with $100, let alone $1000. NTA", "NTA. \n\nLet’s set aside the “step” part for a moment. Even if she were your brother’s bio child, you are under no obligation to help with the wedding. She’s not your daughter.\n\nThe way your SIL is treating you is unacceptable, and your brother doesn’t seem to be helping the situation. Sure, he apologized. Then, rather then asking what you were willing/able to contribute, he asked for another outrageous sum of money.\n\nYou have every right to refuse to financially contribute to the wedding. Call your sibling and say, “I’m not a bank. I’m your brother. My offer was more than generous, and you and your wife tried to take advantage of me. That’s wrong and hurtful, and I am no longer willing to contribute to wedding costs.”\n\nI’m sorry this happened to you. It’s hard to mix money and family/friends. If you continue to have a generous heart in the future, I’d suggest being clear about your limits upfront. It can feel weird, but at least your boundaries are clear.", "I love how he called you to apologize and instead of asking for you to come to the wedding, he immediately asked you for money.", ">I initially told them I would help, I was thinking maybe $1,000 or so. \n\nNo one really thinks helping with wedding costs is $1k. \n\nI mean they are horribly entitled but you really should have NOT said you would help if you intended such a small amount. I'm not saying it's not a generous gift, but it's absolutely a different thing that helping with total wedding costs. Everyone is to blame on not clarifying that.\n\nNTA technically bc they are entitled but really it's closer to ESH overall...", "NTA.\nGood decision to not give anything because your brother called to apologize then didn't even try to say please just attend. He didn't say your 1k was more then generous and we'd be happy to accept if you're willing. \nNo he was like how about 5k like a gift is a negotiation?!?", "NTA.", "The fact that they even had the audacity to beg for money *while apologizing* is baffling. A lack of shame doesn’t even begin to describe their actions. They don’t deserve a cent.", "It’s incredible the entitlement of people. They see a family member better off and feel they are entitled to his money (maybe because he has no kids)!  Incredible and sad as they don’t really care for family relations. \n\nOP NTA", "I personally would donate $5,000 to charity in their name. Then they’ll get a nice thank you note. Win-win situation. NTA", "Weddings have gotten unbelievably expensive in the past few years due to inflation and demand. $15k could easily be less than a quarter of the bill, even at a modest large wedding. That said, yes, NTA, and SIL is a huge AH.", "[removed]", "Yes, and they can always have a smaller wedding.", "I mean, calling someone names for not giving them 15x his original offer would be an automatic dealbreaker in my book too.", "> They don't respect you. \n\nExactly.  They think that OP is a weakling that they can bully out of fifteen grand.", "I’m confused.  He offered $1,000 and that wasn’t enough.  I thought when the brother apologized he asked for $5,000.  But ppl are saying $15k???", "Definitely agree with this. I also agree NTA, but this whole situation could have been handled better.", "I don't know - to me 1000 bucks is generous. 🤷‍♀️  Who just gives away 1000 bucks?", "Thank you for your perspective.", "I am not sure why this comment is downvoted. I also thought is would be more than 1k to “help” with wedding costs. But maybe I am more aware of the cost of weddings.\n\nOP you are NTA in refusing to pay 15k.  I think this could have been avoided if you and SIL had a fuller conversation at the time she asked, for that you are both at fault. Asking doesn’t make anyone an AH, it the verbal abuse that puts SIL and your brother in the AH line.", "I have met my niece once, I don't know her at all.  My brother and I would have worked this out without his wife, who I fully admit to disliking.  Maybe I will give it to her after, that is a good idea..", "The same thought crossed my mind. Are they even going to use the money on the wedding?", "First and foremost if you cannot afford to have a lavish wedding then don’t have one. \n\nIf you have to ask for handouts to pay for your kids wedding then scale down. \n\nYou get married because you love your partner and want to do life with your person a wedding is just the icing on the cake. \n\nWhat you not get to do is ask for money and then demand more. \n\nNope. Full stop. NO! OP NTA!", "You are so much nicer than I am. I would spend that $5000 on something completely frivolous or a nice vacation and post pictures of it daily. Send them a postcard too.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Oops found it!", "OP, you’ve met her once and her mother had the audacity to ask for $15k?!! NTA. AT ALL. I’d reach out to your brother’s step-daughter and tell her that you offered $1000 but her mother demanded $15k, since you are not an ATM, you’re declining to be involved at all. But if you feel you still want to gift her the $1,000, that’s absolutely your prerogative", "Don’t give anything please. Why would you? You got berated and called names. No, they is not a way to go about things, and then receive a gift. If you give anything then you become a sucker and a joke.", "Exactly.   It’s all about one upping their friends.  It’s all about aesthetic and show than actual celebration.", "Neither I nor sweetie had much money; we're both disabled and were struggling to get by. Getting married would actually hurt sweetie's benefits. But we wanted to get married anyway, so we did.  I helped make the food alongside my in-laws in the kitchen. We had the wedding in their backyard, on the one day most of sweetie's relatives could make it. My gown cost $40, we found it in a little shop and it was navy blue with a lot of embroidery, and I was able to reuse it for other things afterward. Sweetie had a beautiful shirt his mom made by hand. I'm estranged from my family, so none attended.   \n\n\nWe spent very little because we had nothing to spend; we didn't even have rings. (A shop sold us some simple ones the next day at a discount because they heard we'd got married without them; I think we spent about a hundred combined as they were silver.)  \n\n\nWe've been married over 25 years. You don't need a big, fancy wedding, and you sure don't need $15k on someone else's dime.  \n\n\nNTA in the slightest. You can have a loving wedding under $1k, let alone 15. They tried to take advantage of you and that's no way to start a wedding.", "NTA. Bet ya that $1000 that if you’d agreed to the $15000 that would not have been the last call for money…..", "Nta that is rude of them to demand more and honestly it’s a party not even something practical like a house down payment. People way over spend on weddings.", "NTA - don’t give them a cent! Makes me think whether they even maintained any sort of relationship with you “only” for the money.", "Weddings are becoming ridiculous.  One should not go in debt for a wedding OR guilt people into paying for them.  This wedding entitlement crap needs to stop.  Stand your ground.", "NTA. Whatever help you offered, should've been accepted. The niece and her fiancee are the ones getting married, not you and it's their obligation to fund their own wedding. If they don't have the money, they should either consider a smaller event that they can afford or save for a large event. Well deserved to bot receive anything. They shouldn't have tried to demand for more and try to take advantage of your kindness.", "NTA You were willing to contribute, but you weren't willing to fund a large chunk of the wedding expenses. There is a difference. You are not a walking ATM for your step-niece's wedding.", "NTA and brother and SIL are entitled to expect $15K without discussion and prior agreement. However, OP should have set boundaries on what he would contribute to the wedding when he made the offer. Clearly, this is a failure to communicate that has caused hurt feelings, anger, resentment and stress for all involved. $1,000 is generous and if he had given it as a gift and never offered to contribute to the wedding, my guess is family would have been overjoyed at the generosity. BUT $1,000  does not go far in the world of wedding planning.  It probably would not even cover a deposit on a venue, for flowers, or even a very modestly priced wedding dress.  Once tempers have settled down, hopefully they can move past this but it won’t be easy.", "XD\n8", "YTA\n\nYou are more wealthy than they are. They asked for help with the wedding and you said yes. At this point it is fair to say that their expectations of how much help ($$) they'd get from you was guided by their perception of how wealthy you are. They acted on this in blind faith (unfortunately) and made bookings etc. $15,000 was the amount they requested subsequently, however, this was way above your intended gift of $1000.\n\nThat they'd be upset at this point is only natural.  Obviously, you were well within your rights to have limited your gift to $1000, even if it was based solely on the principle that this was what a step uncle should be expected to pay.\n\nHowever, if rather than saying that $1000 was my limit and that's the end of that, you decided to go the way of pointing out to them that, with your wealth, you could have easily afforded to pay the $15,000 but won't simply because you did not want to as a step uncle, then that would make you an asshole in my book.\n\nRescinding your offer of financial help afterwards, would just be what you'd expect from an asshole at that point.\n\nBeing an asshole in this situation is not a bad thing though, as no one has ever said before that an \"asshole and his money are soon parted\"", "Nta and don't give them a penny.  I would have been grateful for $1,000.", "NTA\n\nThey are definitely idiots for spending so much money they don’t even have on a frickin contract tho.", "NTA. Nothing makes you want to go out of your way for when people start calling you an AH. They aren’t asking for help? They want you to pay for it. Sounds like it is time to go NC with that crew. Tell them to have the wedding they can afford", "NTA. They wanted more than the generous $1000 so they get nothing as a consequence. Rude, greedy people need to be humbled.", "NTA who asks anyone for $15k?? I mean maybe if my kid was dying…look weddings are nice but they can be cheap or you can make it legal at the courthouse and save up for a party.", " NTA", "NTA Not at all. They not only have a lot of nerve, and are rude, but the immediate response to a “No” is anger and name calling! I don’t care how much money you have, OP, keep it and enjoy it - with people you like who appreciate and respect you.", "NTA.\n \nHey, I'm gonna be marrying a couple bottles of BBQ sauce this weekend. You're not related to them either, but I need 15k to they're a cookout to celebrate.", "$1000 is generous. $15000 should get a night with the brothers wife. What a terrible brother to demand this of you.", "Nta. It's one thing to ask if you'll  contribute, it's another to tell you how much you will be contributing.", "NTA. It doesn’t matter how well off you are; nobody has a right to EXPECT you to fund a fancy party they can’t afford. You offered a nice present. They should have accepted it graciously. They are the AHs here.", "Nta. If anyone offered me $1000, I'd be totally appreciative and happy to get it", "How can people be so entitled!? NTA", "NTA.\nThis is NOT your responsibility", "Nta", "Your brother and his family should be embarrassed, the entitlement they have towards YOUR MONEY is baffling. Don’t give them anything, take that grand and go on a mini vacation instead. Seriously NTA.", "Nope. Not the AH.\n\nNot at all regarding money.\n\nMaybe a little bit because you aren’t accepting the niece as a “real niece”. Unless your brother married her mother when she was an adult, then it’s a bit rude to consider her not really your niece.\n\nBut as for the money, no 15 k, no 5 k, and now no 1k. The two asks were ridiculous.", "NTA: Here's what was supposed to happen. She was inciting you to say something rude and insulting. Then she could get offended and involve your brother to ask you to apologize. Then to smooth over the waters you'd give them the $15,000. Instead you called her bluff and took back the money. \n\nBy the way, if you gave your brother the money they would have taken credit for the wedding saying that 'of course your uncle helped.' \n\nIf the bride has treated you well no need to punish her. Send her a $500 wedding gift. That's still pretty generous, she'll appreciate it and it will annoy her parents given it is half what you were going to give and they don't get any credit.", "NTA, not at all...take the 15k they asked for and go on an amazing month long vacation while step niece is getting married.", "NTA. Why do people feel so entitled to other people’s money?", "NTA.  We did stuff for our niece’s wedding and a gift and when we were done it came to about $1,000.  We were really close to them and I would do the same in a heart beat for them.  Not for her sibling.  That will get nothing from me if they get married.  Write these people off.", "NTA.  I wouldn’t even consider asking anyone other than my parents to contribute to my wedding.  And I didn’t even ask that.  They offered.  I can’t wrap my brain around the entitlement of expecting anyone to foot even a part of the bill.", "NTA", "NTA.\nTheir wedding, their expenses.  \n\nBlows my mind people ask for an expected amount for gifts.  I'd told em to get fucked long ago, brother or not.", "NTA.", "Nope. NTA She was rude as fuck and your brother jumped in with her.", "NTA. Your only mistake was in not asking them to quantify what they meant by help; their idea of help and yours are clearly different. Weddings are expensive but my guess is $15k was the excess between what her parents were willing/able to provide and what she wanted.    \n\n$1,000 is a perfectly reasonable amount of help to give to someone not even related to you; if they had a certain dollar amount or item they wanted you to pay for it was up to them to ask if you'd be willing to provide X for it.\n\nI think they just went all out, based on their assumption that you'd help as much as they wanted rather than asking you how much you'd help.\n\nThere was a post not long ago about someone who promised to pay for their kids weddings; the first two were typical weddings, the third wanted a wedding in Italy that cost a lot more than the other two combined.", "NTA, but what happened to your brother's inheritance? Why can't he pay for things?", "Wow def NTA. The audacity of these family members. How can they just ask for $15k. No shame in their game. If I were you, I wouldn’t attend either. They should budget for their wedding instead of expecting free hand outs. Also, they are rude AF - def don’t give them a vent", "NTA.\n\nFor our wedding, our families plus the extended family held a joint garage sale to help pay for most of it. It wasn’t the most extravagant wedding, but it was enjoyable", "NTA\n\nWho are these people that want someone else, anyone else, to pay for their wedding? A wedding which I assume is between two people who made the decision to marry without including the prospective ‘Bank of Uncle’ in their future wedding plans.   \nIn my opinion unless someone specifically tells the betrothed couple upon the announcement of their nuptials that they want to contribute XYZ as a gift, then they should assume they are paying for everything themselves and plan accordingly.", "NTA.  Step niece or biological niece you're in no way obligated to shell out $15K for her wedding.  A $1000 gift is pretty generous.  Why your SIL and brother think they are entitled to get more from you is beyond me.", "NTA, but I would still gift the $1k. Your niece didn’t call you names, her folks did.", "NTA.  Calling someone who is about to give you $1,000 a bunch of insulting names is not only an AH move, it is also extremely stupid.  OP, you acted correctly.  I would have done the same thing.", "NTA—The audacity is astounding. You’ve made the right decision. That’s your money to do as you please, not theirs. Abhorrent behavior.", "NTA No is a complete sentence.", "NTA \n\nNext time just say you don’t have more money and to mind their own business.", "NTA", "Classic case of fuck around, find out. Nta", "NTA, and your brother is a piece work. \"Sorry about my wife. What, you won't give us $5,000? Well you're an asshole, then.\"", "I think $1000 wedding gift is very very nice gift. $15,000 though?? If you can't afford wedding, than don't get married or downsize your thoughts and do something you can afford. I'd rather use money for house than wedding. Such a waste. NTA", "Def NTA. If they can’t appreciate your generosity, then they don’t deserve it.", "NTA\nPeople need to stop planning events with OPM.", "NTA\nYou said you'd \"help\" not finance it.", "I actually think this is a “not enough info provided” situation. How exactly did you word your agreement to help? Did you promise to pay for the wedding or an aspect of the wedding (like venue or catering)?\n\nIf you promised them you would cover XYZ without understanding how much that typically costs, didn’t specify an amount up to which you would cover, let them book whatever, and then “offered” $1,000 when the cost was $15,000, then YTA. \n\nIf you just agreed to chip in some money and they made assumptions all on their own, then NTA.", "NTA.  Nobody is entitled to someone else’s money. It’s mighty tasteless that they even asked.  Take a nice vacation the week of the wedding.", "NTA. LOL, how the heck did she thought it would turn out by insulting the person to get them to agree more? Please don't give anything to these greedy entitled AHs.", "NTA and I would have celebrated you at the wedding if you’d gifted us $1000. Anyone who expects support is totally in the wrong.", "No", "Honestly... I would leak it that I was offering $1,000.. but my plan was to give $20,000 as a gift at the wedding so they can start their new lives together.  That huge gift is the reason you didn't want to give more than the $1k.\n\nBut since you were cursed out and saw the true face of your SIL, you are no longer interested in offering anything. There is no coming back from that\n\nNTA", "NTA.", "One of the easiest decisions ever made ..soooo NTA.", "NTA\n\nWhat horrible and entitled people. \n\nDo not give them anything.", "NTA. Nobody is entitled to your money. Also, with the divorce rate so high, giving $15,000 is a financial waste.", "Nta and everyone here is waaaaayyy nice than i am. Id probably get permabanned if i typed what i woulda said to the SIL.", "NTA. That's rude and entitled.  Make sure if the bride to be asks,  you let her know her mother is the reason you're no longer contributing", "NTA. Fucking rude and entitled on their part. I would have done the same.", "Nope, NTA!! You were being generous and they were being entitled and greedy. The name calling is the cherry on their bad behavior sundae.", "NTA she should have clarified what she meant by \"will you help with the wedding\" in the first place by saying can you please help with a giant portion of the wedding", "NTA. Regardless of how you are related, a $1000 contribution to a wedding is more than generous.", "I had an aunt who earned decently into the 7 figures a year when I got married. She was invited but I never asked or would have asked her for a cent. It’s my wedding and if I couldn’t afford it I wouldn’t have held it. \n\nThe OP is NTA for sure.", "$1000 is a nice contribution to any relatives wedding who isn't your own child. Maybe if they had asked for $2k or even $3k you might have said yes but $15k?! That's a hard pass. Definitely NTA.", "NTA. Give her nothing now.", "NTA  - no one believes that weddings bring the worst out in people until it happens to them. (Source: not a money issue, but I nearly uninvited my mother from mine,  over a dress)", "NTA - people don't get to verbally abuse you and tell you how much to pay.  You as the giver decide.  Wow.  I wouldn't give them a dime either.", " NTA however if niece wasn’t involved in the money grubbing I’d still gift her $1000", "Oh. Hell. No. NTA \nHow entitled!", "Nta. Disgusting. They want you to contribute but when its not what they want, they immediately turn on you?!? Tells you that you made the right call!", "NTA, but did you ever mention the $1000 when you initially offered to help.  Weddings are expensive and giving the limit ahead of time would have avoided all of this.", "No you are not. Your money. You can decide how to spend it and they should ask how much you would consider giving before planning wedding around your bank account.", "NTA - why do they think that you owe them anything? Sounds like you barely know his step daughter", "NTA. You owe them nothing and frankly their rudeness and greed deals the deal", "NTA\n\n There is a long way from 1000 to 5000. Good lord. She's not even your niece and they think you should give her all that money?", "NTA I’d stick with the rescInd but the couple $1000 as a wedding gift.  Even though you don’t know them you can afford it and it would be a nice gesture.\n\nINFO:  How did you inherit a large sum of money but your brother didn’t?", "How did the inheretence happen? Was your brother included?", "INFO: what was the exact conversation that led the brother and sister-in-law to believe that you would be contributing financially, OP?", "NTA at all. Imagine getting mad at someone because they would only give you $1000", "NTA\nSIL is out of place. It would be different if you had offered her that sum hit to demand it, no. The name calling sealed the deal for me. You cannot call me names because I don't want to give you my money. Audacity is sky high these days", "Nta", "NTA.  Dude, you were gracious enough to offer $1k & they had the audacity to look a gift horse in the mouth?  Justified!", "NTA. I could maybe see asking for money for a medical issue, or some emergency situation beyond their control, but a wedding? Why are people so bent on throwing a party that they can not afford on their own? Scale back, people.", "NTA even close. There may have been a miscommunication, and your sister-in-law said you would help more financially without ASKING you how much you would contribute, but that's not YOUR problem. That's theirs. Keep your money, they suck.", "NTA- the fact that you have done well for yourself is awesome for you! With that being said, doing well for yourself doesn’t give anyone else an open invitation to the fruits of your hard work and labor! Anyone who for one minute believe they have a right to any of that is ludicrous!", "NTA wedding more like begging lmao", "NOT AT ALL", "NTA\n\nNot only are they greedy, but when you didn't pay up they tried to \"good cop, bad cop\" you.", "NTA. I just do not understand why people think that they are entitled to have relatives pay their bills for them, especially when the bills have to do with something  unnecessary like a wedding. You plan the wedding you can afford. If you want your daughter to have a more expensive venue, and so on, you start saving for it years ahead of time. There are all kinds of ways of cutting costs. One of my sisters is very frugal. She rented her wedding dress. When one of my nieces got married, they had the reception in her new inlaws backyard. It was  beautiful.  \n\nExpecting others to fund the wedding is bad enough, but getting mad  when they won't fork over the money is inexcusable.", "YTA for not attending your nieces wedding. Your NTA for not paying for it", "NTA … another study on The Audacity smh", "NTA but could be...\n\nSend them $1000 in pennies.\n\nWill cost you a bit but would get a point across.\n\nAnd be a story you can tell for ages.\n\n* or maybe dimes 'cause they weigh less and would take up less space for shipping.  Unrolled of course for maximum effect.", "NTA\n\nYou're retired. No matter how much money you have. You no longer have an income, so you can't just keep giving large amounts of money away, or your money won't last. \nThey sound awful.", "NTA\n\nIt’s your money, your choice. You were really generous to almost give them £2,000. But their ungrateful attitude towards your gift, was the reason you no longer giving them the money. I bet they thought you would pay for the full wedding.", "NTA When they say \"Don't look a gift horse in the mouth,\" this is what they mean.", "NTA but for sure it can taint your relationship with that side of the family \n\nIf it ever comes up in discussions I would use these two arguments \n\n- a wedding is not an investment. By the end of the night the money is gone. People should only spend what they can afford\n\n- you don’t appreciate being called names. As soon as that happens, all offer to help is rescinded and this will be true for the future too", "NTA, very obviously…..", "NTA, but you said you inherited the money. Did your brother get any inheritance from this source, or did he have nothing to do with that source? I’m trying see why he thinks he is entitled to anything.", "NTA. They treated you in a way that they wouldn't want to be treated themselves. Your niece is not your responsibility and both your SIL and brother are out of line for asking you for those sums of money.", "INFO: seems pretty N T A, but just so we get a complete picture, a few questions: 1) how old were you when you retired? 2) was their any drama with the inheritance? Like we’re you given substantially more than your brother?", "nta: I don’t know what it is that makes people get crazy and overspend on a silly one day event. You offered, it wasn’t enough, and they poisoned the well. That’s on them.", "NTA at all", ">She then got angry and called me names, etc\n\nNTA", "NTA Who the hell tries to negotiate a gift they are receiving?", "Can I just ask how your niece has been? Would she be grateful for the $1000 or would she be entitled like her parents and demand more? It just feels a shame if she is being punished because she has AHs for parents.\n\nHowever, it’s your money and you owe them nothing, especially given their behaviour which is so beyond rude. Definitely NTA.", "I have a relative who took out loans to pay for a destination wedding in Europe though no one had any ties to the country. The wedded couple is now divorced. With this type of attitude, I see the same future for your niece, so sending them any money outside of what you offered is a loss.", "It's your money to do with as you please. NTA.", "You should take 15k and go treat yourself.\n\nWhatever you fancy, maybe get a nice car, buy a nice watch or go on a long holiday.\n\nMake sure to flaunt it on social media to piss them all off.\n\nNTA", "NTA for rescinding due to the treatment.  But both you and SIL should have talked more pointedly about the actual amount they were looking for and what you were willing to help with.  This could have been avoided with clearer communication on both sides. You both left it too open ended after the initial conversation.", "Hail no!!! NTA. $1000 was more than plenty. As soon as the level of entitlement kicked now you saw their true colors. It’s not just the entitlement part, or the insult because it’s all of those and more. They just see u as the meal ticket. So nope good for u to rescind and also hopefully after the insult you rsvp’d that you won’t be attending. Be strong don’t get bullied either, u made the right call! So sic of this.", "NTA - better put them in the no contact list! The level of entitlement is so high, NASA called for help to catch a satellite that far!", "NTA. YWNBTAH even if she were your blood relative.", "NTA. I can’t imagine acting that entitled!", "NTA\n\nProbably just go no contact with these lousy fucks.", "NTA. Make sure that they know your fortune is being left to your cat or something and make sure your will is up to date.", "NTA. They’re counting your money and deciding you could afford it. \nBTW, you say you inherited money. Did your brother also inherit money and then burn through it?", "NTA. Are they serious? 15000? It must be for the whole wedding... ridiculous amount.   \nIf I don´t have money, I am not planning lavish wedding...", "NTA I bet they already booked stuff counting on your cash cause rich uncle", "U do have yourself to blame, There's always a lot more to the story than explained by one party \n\nThough, a grand is a good chunk of change as a gift  i believe you had created expectations to be part of wedding preparations. Naturally, they had thought you would chip in more. As, it's a wedding.\n\nA 1000 dollars doesn't get you half as much as it did a decade ago. \nDon't create false expectations, when u feel that they're not your blood.", "1000 bucks is a fair amount. I'd fold for 20 whole dollars.", "You don't have to contribute, obviously. But you should still go. Your step-niece isn't her mother, she wasn't the one that insulted you.", "Nta. Give a hand, get your arm off.", "Well, they were just counting on you to pick up the entire tab, weren't they?  You're well off, no kids, what else do you have to spend your money on?", "NTA. It's your money, you are fully entitled to do exactly as you please with it. I would honestly have done exactly the same. They are assholes for just assuming you'd give 15k", "Nta, no it turns out is hard for a vast majority, but not you.", "NTA !!!!!\n\nNot in a million years are you the asshole here. You set some healthy boundaries and stuck to them. Good for you !! I am sorry your brother is an asshole though. He seems like he is miserable.", "NTA lol why do people always bite the hand that feeds them lol the human greed never fails to shock me", "NTA\n\nOMG that is crazily entitled and presumptuous.\n\n$2k is very generous - such ingratitude rightly voids that offer.\n\nSorry they all let you down.", "NTA, obv.", "NTA\n\nYou were willing to give a gift, as you are not obligated to do anything at all, and they crapped all over it and demanded more. \n\nThe fact that you don't even feel close to the bride is the biggest factor.", "NTA. Ungrateful people don’t deserve any help at all, especially if they are abusive.", "Apparrently she missed the part where you are GOOD WITH MONEY. Not giving it away so some ingrates can have a nicer party, illustrates your financial acumen.", "NTA, they took your offer to help as an invitation to overspend thinking you'd cover for them.", "NTA. The sheer entitlement of some people!", "NTA\n\nThe entitlement in these people is beyond limit.\n\nGo donate 5k to a worthy charity (so you'll deduct it from your taxes) in the bride's name and send them the certificate as a wedding gift.", "NTA. If anyone in my family, let alone a non-blood relative tried to give me $1 for my wedding, I’d have accepted it and said thank you in a heartbeat. $1000? Im calling you uncle u/early-retirement-22 for the rest of my life and naming my first born after you. That would’ve been just under 10% for my wedding, so you were going above and beyond. SIL can pound sand.", "If someone tried to gift me £1000, I would try and reject it as being way too much.nta.", "I blame the films and television programmes about weddings. They create unrealistic expectations. The hen/stag dos are also blown out of all proportion. My sister and I had lovely simple weddings, ceremony at local church, then reception at home. Married now for 47 and 46 years. My boys also had comparatively simply weddings, which they paid for. ( we have made other contributions) so hoping both marriages will last also.", "No.", "They're being greedy grasping a-holes you might want to also go no contact with them also", "NTAH- they had no business asking you to ‘contribute’ to their daughters wedding in the first place. They certainly had no right to think that you should ‘contribute’ -15,000.00 nor 5,000.00. The ‘contribute’ meant that you were supposed to either fund the entire wedding or GIVE them the money- it was not a request for a loan- you were supposed to ‘gift’ it. \nI would have done exactly what you did- withdrawn the 1000.00, uninvited myself and not sent a gift either.", "NTA. Both your brother and SIL call you an AH because you are refusing to do what they want with your money!? Where is the father in the equation and why is he not paying for his daughter's wedding? I'd suggest you go NC and block both of them. What a cheek.", "NTA. If they can’t afford a wedding without your help, it means they are wanting a wedding that is far beyond their means.  You offered an amount and it would have been free funds for them, but seems they got greedy and entitled to think you’d do more because you have the means.  I think you’re doing the right thing by not giving them any money at this point and just not attending or involving yourself.", "NTA. You are not a walking talking piggy bank.\n\nSadly enough that's how some people react to money in the family.", "NTA but I think u were probably too grandiose in declaring that you would “help” with the wedding.\n\n$1000 is not really helping with the wedding. That’s just what blood relatives outside of immediate family usually give (like you were a real uncle. Which is nice too, hence the NTA", "ESH When they asked y8ou to help with money you should have clarified how much they needed.  If you are close to retirement you should have been able to work that out and avoided the whole conflict... if you wanted to.", "NTA\n\nPlease plan a bucket list trip/activity for the day of the wedding and post a pic saying “best day ever”.", "NTA. It's your money and you can choose how to spend it.", "NTA", "I think if step niece isn't part of the abuse, or even knows it's going on, it would still be a lovely gesture for OP to gift them $1k at the wedding.\n\nOP said no one knows about his gift intentions, so they're not expecting it if he does decide not to.", "What the hell else does he have to spend it on?  What's the point of amassing money if it never does anybody any GOOD?", "Exactly. Hopefully she’ll learn that kicking over the beehive is not how you get the honey.", "My aunt and uncle who are very well off - the most well off in our family - were also just guests at my wedding. I didn't dare ask them anything, especially since they'd loaned me some money for my car and I was slowly paying them back (it was about $1500 in 2006). I'd never asked them for money, and the one time I had, I paid them back in full with my tax return. Apparently, they really appreciated it because at our wedding, they forgave all debt as a gift and gave an additional $3000 as a gift. It was beyond generous and I was super grateful for it.\n\nSome of my cousins complained and whined about why didn't *they* get anything from them? But my mother said that if they didn't always approach aunt and uncle with outstretched arms and dollar signs in place of eyes, then perhaps aunt and uncle would have helped them, too. Not only that, but the times they've \"borrowed\" money from them and not paid back or dragged their feet on it was one too many. I always paid them monthly or in bulk with my tax return. They very much appreciated that, I guess.\n\nBut the audacity here is... quite impressive, actually. I wonder if they have an endless supply of this audacity. OP, good on your for rescinding the offer. They don't deserve it; they are not entitled to your money like they seem to believe they are.", "This is the 21st century and brides/grooms should pay for the majority of their own damn wedding.  \n\nI honestly think the wedding industry is a big scam for the most part.  Many brides are brainwashed from those wedding magazines.  Having an overly expensive party does not make you any more married, just more broke.", "My uncle gave me a framed photo. \n\nIts been years, I still have the photo. I rather like it.", "Seriously. My husband’s aunt and uncle have lots of money. They’re crazy loaded and have multiple houses. I invited them to the wedding (only 15 people total) and emphasized that we were asking our guests NOT to give us gifts because their presence alone was all we wanted. \n\nSure, his aunt and uncle could have easily afforded to pay for my wedding, but I think I would die of embarrassment before asking them for money.", "I'm not married, but my sister did get married a few years ago and no one apart from the parents and the people getting married, no one was really invested in the whole thing. We're Indian, so our weddings are incredibly involved but apart from a couple cousins teaching my sister to dance and my uncle giving my sister a saree (traditionally the mom's brother is supposed to give the bride the wedding saree), no one really gave any extra gifts. It just wasn't necessary or expected. \n\nThese people are so entitled it would be funny if it wasn't frustrating. \n\nNTA", "Says the spoiled rich white girl...", "I'm so cynical, I don't think most unions really deserve so much money being thrown at them. Like, invest that shit in something that has real equity.", "Yes! This was my thought.\n\nINFO: what was the exact conversation that led the brother and sister-in-law to believe that you would be contributing financially, OP?", "> While I personally wouldn't have shot straight to rescinding and not going to the wedding at all\n\nWhy would you agree to be a doormat to an abusive SIL?\n\nOP was being abused by SIL for not giving \"enough\" money. Good for OP for standing up for himself.", "Me, too.", "Lovely story - happy life!", "Some periods:  . . . . .    ;)", "Amen to that!", "They didn't ask for any specific amount until after he said he would contribute. $1000 is a contribution, the second $1000 was to be the gift. \"Contributing to a wedding\" does not even mostly mean \"pay a hefty amount toward it\".\n\nOr put another way: Beggars can't be choosers.", "Reddit thinks that only blood relationships count as family, and family only matters when it poses no inconvenience whatsoever. It's completely asinine. My SIL is related to my daughter by marriage, not by blood. She's still her aunt and she adores her.", ">their expectations of how much help ($$) they'd get from you was guided by their perception of how wealthy you are\n\nThis is where they were clearly and unambiguously incorrect and spoiled in assuming so.", "\"Look, I apologize for my wife, she was out of line.\"\n\n\"That's big of you.\"\n\n\"Yeah, we'll go down to 5 grand.\"\n\n\\*click\\*\n\n\"Hello?  Hello?  Three?  We can do three!\"", "First of all I agree, OP is NTA.\n\nAlthough I get the brother's stand a little, planning a wedding is super hectic and he might be inclined to need help. OP could support the 1000 to him and probably lend some extra which should be returned. This would be in good faith to his brother and to demand an apology from the SIL.", "> (maybe because he has no kids)\n\nThis is 100% it.\n\nI have seen first hand so many cases like this where people feel entitled to a relatives money because they have no kids, \"what he needs so much money for?\".\n\nIts not only within families, I have also seen people demand someone pays a larger share of a dinner or trip because they have no kids.\n\nSome people have no fucking shame", "This is NOT the good thing to do!!!!", "It can do him good.", "Found the SIL…", "I'd rather set the money on fire and piss on the ashes than give it to entitled assholes like his SIL. I'd even film it and send it to them.", "This honestly, best to have a court marriage, and a “celebration” at a public venue/park that is way cheaper than booking a venue for the “wedding ceremony” price.", "Everything's gotten expensive due to inflation and demand lol. Unlike groceries lavish weddings aren't a necessity so there is a pretty obvious solution here", "Wedding don't have to be expensive. It's insane to think that people are ok with going into debt or mooching off others only to blow it all on one day.", ">even at a modest large wedding.\n\nThe word large is the problem here.\n\nOh, I know how expensive weddings are.  If a couple is spending up to $60k on a wedding, that alone is the problem.  No-one needs a large wedding.", "I feel like this is an american thing. In Germany the average wedding costs between €6,000 and €10,000. I was in a few weddings over the last year and they were all pretty amazing but none cost more than €10k.", "I’m not disagreeing with you, but I have to wonder if maybe 15,000 is the entire cost of the wedding or close.", "Not true - if you’re creative. We were married on my grandmother’s front porch. My mother sewed my dress. A friend took photos. It was autumn, so other friends made a big pot of chili. We paid for hot cider, beer & wine. Other friends (still yet) who had a bluegrass band brought their instruments. We built a huge bonfire & everybody danced ‘til dawn. 20 years later, he’s still the love of my life. ❤️", "> Weddings have gotten unbelievably expensive in the past few years due to inflation and demand.\n\nNo they haven't. Its the person that makes the wedding expensive.", "Oh dear - too cynical! Maybe think of it this way: Invest the $ in something that will grow in value over time for the couple … like a home, a college education, or a retirement nest egg! A lavish wedding returns nothing but stress & debt.", "The initial ask was $15k. In the \"apology\" the brother asked for $5k. Still 5x more than what OP was going to give them and after Op was called an asshole. The damage was done by then.", "Shameless, greedy, rude and vulgar describe them.", "Attending the wedding isn't being a doormat to the SIL, it's supporting the stepniece. It's not her fault her mom is an AH, she may not even have heard what happened yet. I'd still go and bring her a gift, certainly doesn't have to be $1000.", "If you give then you’re triple the sucker. Block them imo", "Yes which is why I said it would have been a generous gift.", "If anything reddit is always all about how you choose your family and blood ties are not the only thing that matters.", "Wedding culture is just so fucking ridiculous I don't get it. My wife and I had a nice short ceremony outside the courthouse with the judge and our family. Lovingly married 10 years later, no debt from a crazy big wedding, no drama. It seems like more people have issues in a marriage if they don't get their giant Hollywood event or some such thing.", "This, my wedding was $600", "They might have better luck with a GoFundMe account. (Not)", "[spits out tea]", "😂", "*snortlaugh*", "Except he can demand the apology all he wanted, he isn't gonna get it because SIL would have already gotten what she wanted:  the money.  And brother ONLY apologized to get money.\n\nI agree with others you have the wedding you can afford.  Anything else is showing off for no reason.\n\nNTA.  OP stick to your guns!", "Yeah, it’s pretty gross.", "The vacation needs to be at the same time as the wedding though, with postcard sent. \"Toasted you with my crazy expensive glass of (insert expensive booze here), Love, Uncle My Bucks Aren't Yours.", "There was a backlog of weddings due to covid so people are having trouble finding a date/venue, not to mention the costs of everything increasing.", "Same in Austria I reckon. The total cost of our wedding was just under 9,000€ for 120 guests. We asked for no gifts, just people's presence to celebrate with us (plus quite a few travelled from abroad). We budgeted with cash gifts totalling 2,000€ - actually ended up with over 8,000€, it was quite a shock for us (a very good one, not gonna lie)", "Thanks, I caught it right after I posted. Granny needs to clean her glasses!", "Fair.  I mean to say that his generosity was help toward the wedding and he was not misleading at all.  $1000 is a significant amount.  So I guess I reject your premise lol.", "Not on questions like this", "Big weddings and gender reveals are about the most narcissistic things there are.", "Somebody said there’s an inverse relationship between the cost of the wedding & the duration of the marriage.", "I have actually seen a study recently that says the length of marriage is shorter the more expensive the wedding was.", "That's what my girlfriend and I plan on when the time comes, and money that would have gone towards a big wedding will instead go into the honeymoon fund.", "I'm saying he should give the money only when he gets the apology he deserves\n\nAgain to reiterate, NTA. No matter his future decision", "Holiday TikToks Starring OP as John Candy/Uncle Buck (first name \"Not Your\")😆", "Good excuse to elope.  A friend of mine got married in the height of Covid.  They were only allowed 5 people total, and they were two of those 5, then the celebrant and the legal two witnesses.  They had to sneak in a photographer.", "Courthouse, 10 minutes, done!", "\"Was\" is the operative word here. I don't know of any venue that is still backlogged specifically by COVID.", "Pssst - you can edit your comment. Click on the 3 dots below the post. Choose “edit,” then “save.” Ta-da!", "Yes. I used to think that the funnest weddings foretold the worst marriages. My cousin had an amazing wedding with signature martinis and chocolate fountains. They stayed married for 6 weeks.", "https://20somethingfinance.com/wedding-expenses-and-marriage-success/\n\nYep. Makes sense too as financial issues are a leading cause of divorce.", "Cost of our wedding: $0\nDuration: Number of years since 1987", "Yeah, I feel like I've seen it mentioned in wedding threads like this before. Kind of a bummer really.", "One elopes, one does not \"get eloped\". Many of those who had tiny covid weddings are the cause of the wedding backlog; they felt cheated and want a big wedding or waited to marry until they could have a big wedding.", "Doesn't work for those who want a church wedding.", "There are still places booking out quickly; I do sometimes read the wedding subs for different drama than here. Popular or obvious venues are still booked up way ahead of time.", "A few very highly desired locations are but most are back to normal backlogs.", "I mean, it unfortunately makes a sad amount of sense. The leading cause of divorce is financial strain, after all, it makes sense that if you start your married life several grand in the red that you're pretty much shooting your marriage in the foot right from the words \"I do\".", "Oiy.  Thank you for the grammar correction.", "Also, “elope” doesn’t mean “get married unceremoniously.” It just so happens that marriage is the *context* it’s most common to see the word used in, but it just means to travel secretly. Travel being operative. If you’re just getting married at city hall in the town you live in, even if you do it suddenly and don’t tell anyone, you aren’t eloping. If I travel alone to Vegas for a weekend but don’t tell anyone, I am technically eloping (though I wouldn’t describe it that way as it would obviously be confusing).", "I'm not a religious man, so that is a fair point.", "I find it hard to believe that people can't find a church that won't do a wedding for less than $60k, or whatever you said a wedding costs nowadays.\n\nLike, maybe all the DrEaM lOcAtIoNs are backlogged, but there have got to be modest churches out there that would be more than willing to host a wedding for a reasonable price.", "Hehe; the verb there is \"want.\" They can pay the minister to come to the courthouse too, get the quick and dirty religious marriage ceremony along with the civil one.   \n\n\nObligatory Simpsons reference: [https://frinkiac.com/meme/S03E12/661387.jpg?b64lines=IEhlcmUncyAkMTAgd29ydGggb2YgY2hpcHMuCllvdSBtYXkga2lzcyB0aGUgYnJpZGUuCgoKCgoKCgoK](https://frinkiac.com/meme/S03E12/661387.jpg?b64lines=IEhlcmUncyAkMTAgd29ydGggb2YgY2hpcHMuCllvdSBtYXkga2lzcyB0aGUgYnJpZGUuCgoKCgoKCgoK)", "When we got married, almost 25 years ago, we got married quickly after 9 months.  Generally, it was a 12 month wait list to get any reception place.  And it was the reception place that we had to work around.", "I mean ... it's also kind of hilarious. \"I want to celebrate my transition to adulthood in the least responsible way possible! THIS WILL ONLY END WELL.\"", "Sorry, that construction is like fingernails on chalkboard.", "To me, elope is to secretly to be married, usually without the  knowledge of family and friends.  Traditionally, it was to travel somewhere to marry, but now, just means to marry without telling anyone.", "However, in context, \"elope\" relates to marriage.", "A lot of people don't want a church wedding though; I used to belong to a Cathedral parish, weddings for parishioners at the time were $1,000, non-parishioners $2,500 incl cantor, organist, wedding planner and use of the parish hall but most people didn't use it because it was too small for the size wedding they wanted. My friend had told the deacon her son was planning on marrying there and he told her the son needed to become a parishioner in his own right immediately for pricing. That was before 2010.\n\nI think a lot of people quietly have their weddings without drama and posting controversy online; if you know you're getting married at your church and using the hall, everything probably goes like clockwork.\n\nThere have been recent posts about people who wanted to marry in the family church but wanted no religion in the service or wanted to use secular music that the old minister approved but the new minister refused; I blame the bride/groom for those things because they were taking the easy way out and pacifying their families but mistaking it for hiring someone who had to do what they wanted.\n\nChurches can have drama but I think it's less because they typically have rules to follow and as long as you follow the rules you're good; parishioners would know that.\n\nIt also depends on the church; I'm Catholic so first, one party must be Catholic; second, except for the Cathedral, one must be a parishioner. There's a beautiful small church run by a religious order and known for its music program. Right on the front page of their website they make it known you have to be a parishioner for 2 yrs and support the church financially before getting married there.\n\nOther churches have other rules but you're right, plenty of churches who, depending on their rules, would be happy to host weddings.\n\nThere are several that rent their event center separately so you could get married somewhere else and have your reception there.", "I don't know where you're from but in the US, the religious and civil marriage aren't separated; the couple would be married at the church and the minister would fill out the marriage license which would then be sent in for registration with the county.", "I read the wedding sub and they say a lot of venues are slim picking 2 yrs out but I think a lot of people want crazy extravagant weddings.\n\nWhen I was young a lot of people were married at a church w reception at VFW or other fraternal or ethnic hall. Now it seems to be expensive venues.", "OK, have just made the correction - just for you.", "Yes, but also given the context, it seems clear the original commenter was not suggesting they should travel to get married in another location in secret, thus not eloping. The rest of my comment was just extraneous detail.", "Thanks, I appreciate that.", "Bless you, brilliant Arthur!", "Colloquially, eloping no longer implies running off to Gretna Green; colloquially it is now used to mean a small wedding."]}