{"id": 27313, "submission_id": "16o6cew", "title": "AITA for telling my stepdaughter to talk to my husband when he was in a meeting?", "selftext": "I (35F) met my husband (38M) 3 years ago, we've been married for 6 months. I met his daughter Ana (16F) about 2 years ago. Husband's first wife is deceased.\n\nMy husband and I agreed that I will take the role of step mother, which means he will be responsible for making the rules and deciding the punishments and we will both enforce them. We hoped that Ana would respect me role as a step parent and hopefully even grow to like me. \n\nHowever, since the start, Ana has shown no regard for me as a person. She's made it clear that I will never be her mother, which is okay, I am happy to be step mother. But she goes beyond that. She has learnt to break rules when I'm the only one around and when I remind her of the rules (that my husband made), she screams that she doesn't have to listen to me and I am not her mother. If I tell my husband, she screams that I'm a lowlife narc. When I brought this up to my husband, he told me to handle things like an adult and nobody likes a narc.\n\nYesterday, Ana urgently asked me for $100. I could easily afford it, but I was curious, so I asked her what it was for? She immediately went on a rant about how she doesn't have to tell me anything because I'm not her mother and she doesn't owe me an explanation whatsoever. She needs the money now. I had enough and I told her to talk to her dad. He was in his office taking a work meeting. She realized that I'm not giving her the money, so she screamed some more obscenities at me. So I just repeated \"talk to your dad\" over and over until she gave up and went to where her dad was working to ask him for money. \n\nNow my husband is mad at me for letting her interrupt his meeting and says I should've just acted like an adult and had an adult conversation with Ana.\n\nI'm over being treated like the evil step mother at this point and I'm happy to let my husband handle everything regarding Ana. AITA for telling her to go to her dad everytime?", "created_utc": 1695270489, "permalink": "/r/AmItheAsshole/comments/16o6cew/aita_for_telling_my_stepdaughter_to_talk_to_my/", "score": 21, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think AITA because I knowingly let Ana interrupt my husband's work. I don't know if I could've handled it better. Maybe I should just given her the money and let my husband deal with it when he was free.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Clearly, Ana thinks she can walk all over you without consequences. You're not her personal ATM or her doormat. If she can't give you basic respect, why should you bend over backwards for her? Directing her to the person she might listen to was the right move. She needs a reality check.", "NTA - Ana’s behavior is unacceptable and your husband’s response is worse. He is being totally unsupportive and is letting his daughter abuse you. \n\nA question to think about, you’ve been married for 6 months. Is this relationship worth the next 2 years (or realistically more) of your husband and Ana’s BS? Because I don’t see this AH guy changing.", "NTA but your husband sure is.\n\n>If I tell my husband, she screams that I'm a lowlife narc. When I brought this up to my husband, he told me to handle things like an adult and nobody likes a narc.\n\nWithout having any input on what the rules and punishments are don't even get to report to him what happened?  That's just bad parenting on his part.", "NTA\n\n>Handle things like an adult and nobody likes a narc.  \n>  \n>...should've acted like an adult and had an adult conversation with Ana\n\nDoes he put his finger on his nose and declare \"Not It?\" \n\nHow can he expect you to have an 'adult' talk with 16F? She's not an adult yet!", "NTA Ana can’t seem to respect you so why should you have to fork over $100. Also I’ve never loaned/given money to anyone without an explanation of what the money is going towards. Dad seems to be siding with her so he deserved what he got. If he doesn’t like that she interrupted his meeting then he needs to set boundaries for the future.", "Nta. She seems like she's just like dad for some odd reason lol . Tell dad you're done being the adult since she doesn't care either way and he can handle alllll parenting for now on. You are now no longer responsible for anything. He can grow up and handle it like an adult now.", "Nacho all the way- not your child, not your problem", "NTA. You and your husband need to have a serious talk about both her behavior and your parenting plan. He wants to be the one to set and enforce the rules, but refuses to listen when you ask him to do that. He’s telling you to handle it like an adult, but you agreed that you wouldn’t be the one deciding punishments or rules. He’s removed ANY power you had in that situation- he doesn’t want to hear about it, and he won’t actually deal with it, but you’re not allowed to do anything? HELL. NO. \n\nYou don’t have to be a parent but you do have to have some authority in your own home. If you’re not allowed to assign punishments OR tell your husband about his daughter’s misbehavior, you’ve basically been relegated to nothing in your own home. You’re basically there for her to stomp on. Absolutely unacceptable.", "She is only doing what she learned. Which is disrespect for you", "You did have an adult conversation - when she asked for money, you wanted to know what the money would go to; when she couldn't give you that, you politely declined and suggested another avenue. \n\nAna did not have an adult conversation. She was entitled and when she couldn't get her way she threw a tantrum. Ana is also a teenager dealing with some pretty big changes in her life, not an adult. So I suspect she will continue to have many other conversations in which she does not act like an adult.\n\nI'm not sure why your husband thinks you're responsible for Ana's behavior, but you're not. I'm not sure why he thinks that you're not behaving like an adult, but you are. I'm not sure why he thinks Ana behaving like an upset teenager makes you less of an adult, but it doesn't. He needs to parent his kid. \n\nYou're NTA, but if your husband doesn't want to parent his kid, this isn't going to get any better.", "NTA. Ana clearly has a lot of adjusting to do. What strikes me here is \"my husband and I agreed that I will take the role of stepmother.\" Okay, back up a sec...\n\nAna's mom is deceased.\n\nYou and Ana's dad have been married only six months.\n\nAnd, you both arbitrarily decided how your household relationships were going to go. Without consulting Ana. She's old enough to have input. Does she want a friend first, does she want an aunt/niece relationship. What about big sister? You guys just plopped Ana down and told her like it is.\n\nAs for the home office, both of you seem to have a clear lack of disrespect for your husband's work environment. Ana charging in and asking money from her dad there and then might not have happened if you hadn't been egging her on. So ESH for this part.", "Seems like there’s a couple of entirely seperate questions here. \n- are you an AH for not giving Ana $100 with no explanation? No. If she wants to play “I don’t have to explain because you’re not my mother” then you’re under no obligation to give her money because she’s not your daughter.\n- your husbands lack of support for you enforcing his rules: if you’re expected to “handle” things, he needs to support your handling. Without that support, he needs to understand that there will be no enforcement. (Is he maybe doing a bad job of telling you he doesn’t expect you to enforce his rules?)\n- sending his daughter to talk to him during a meeting (which is the question you actually asked for judgement on), yes, YTA for that.\n\n“No” IS an adult conversation.", "ESH - All of you have serious problems, I understand that these posts often don't include all of the complexities of given situations; that being said; at the absolute least; assuming you haven't embellished or lied, the fact that you've remained in this situation means that you've done a tremendous disservice to yourself. The textbook definition of insanity is repeating the same action in the same sequence and expecting a different outcome; to surmise, I'm saying that you've been fooling; and hurting, yourself needlessly. Do yourself a favor and leave this situation and also please reach out to someone to talk to, we all need someone in our times of tribulation and the fact that for you this isn't your husband should tell you everything you need to know. Best wishes.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (35F) met my husband (38M) 3 years ago, we've been married for 6 months. I met his daughter Ana (16F) about 2 years ago. Husband's first wife is deceased.\n\nMy husband and I agreed that I will take the role of step mother, which means he will be responsible for making the rules and deciding the punishments and we will both enforce them. We hoped that Ana would respect me role as a step parent and hopefully even grow to like me. \n\nHowever, since the start, Ana has shown no regard for me as a person. She's made it clear that I will never be her mother, which is okay, I am happy to be step mother. But she goes beyond that. She has learnt to break rules when I'm the only one around and when I remind her of the rules (that my husband made), she screams that she doesn't have to listen to me and I am not her mother. If I tell my husband, she screams that I'm a lowlife narc. When I brought this up to my husband, he told me to handle things like an adult and nobody likes a narc.\n\nYesterday, Ana urgently asked me for $100. I could easily afford it, but I was curious, so I asked her what it was for? She immediately went on a rant about how she doesn't have to tell me anything because I'm not her mother and she doesn't owe me an explanation whatsoever. She needs the money now. I had enough and I told her to talk to her dad. He was in his office taking a work meeting. She realized that I'm not giving her the money, so she screamed some more obscenities at me. So I just repeated \"talk to your dad\" over and over until she gave up and went to where her dad was working to ask him for money. \n\nNow my husband is mad at me for letting her interrupt his meeting and says I should've just acted like an adult and had an adult conversation with Ana.\n\nI'm over being treated like the evil step mother at this point and I'm happy to let my husband handle everything regarding Ana. AITA for telling her to go to her dad everytime?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  She clearly didn't want to have an adult conversation so she made the call to go bother dad.  Hubby can't really expect much if she doesn't even see you as an authority figure so he needs to get his shit together and run his house.", "NTA. Your husband is the actual problem here.", "NTA but you seem to enjoy the drama. Why not just say “no” and leave it at that?", "NTA. You were acting like an adult. You politely asked her what the money was for, and Ana went off. Most adults will disengage with abusive behaviour.", "NTA, but your husband is.", "NTA", "NTA. Your husband is the one with the child and who has the obligation to support her. She has no right to your money, especially that much for no reason she's willing to disclose; had she asked nicely and told you what she wanted it for you still would be in the right for saying no. \n\nIs Anna in counseling? She should be whether to talk through her grief or her anger that her dad remarried.\n\nThis is a husband problem; his daughter needs to talk to you respectfully but knows he won't enforce it. You need to make a rule if you haven't; if she wants money she asks him, never you.", "NTA. Until you talk to mw with respect do not approach me..”Why are you asking me? I’m not your mother!” Bye Felicia, and walk away.", "You are not her mother, true.\nBut also you are not her personal ATM, so sending her to her father was more than justified.\n\nNTA\n\nAna is 16y not 5y old, so she should be more than aware that barging into her father's work meeting is not the best choice. That's on her and your husband's bad parenting.", "NTA and honestly you need to have a talk with your husband. This is not okay behavior. You deserve at least basic respect, not just from Ana but from him, too. Ana does not acknowledge your authority, then fine, either he handles her exclusively or he makes her understand that you do have some authority in the house. If he can’t be bothered to do that, why are you staying?", "Please record one of these outbursts so your husband can hear it. If he thinks that is okay then dip.", "Ana and her father are BOTH assholes.\n\nYou're being disrespected by both.\n\nWhy are you \\*staying\\* in this relationship?  It's seriously toxic.\n\nNTA.", "Ana doesn't think it, she knows it. Her dad clearly takes her side against his wife. I don't get his insistence on making it about being \"an adult,\" though. You just can't reason with someone whose bad behavior has been reinforced. NTA. I would tell the brat to stop asking for parental responsibility from someone who clearly doesn't receive parental respect."]}