{"id": 27366, "submission_id": "16oz88y", "title": "AITA for not hosting my own baby shower?", "selftext": "I am currently 35 weeks pregnant and decided a while back I would not do a baby shower. Besides the fact I feel like it is tacky to host my own shower and basic tell people \"hey buy me stuff\" it is a ton of work. I decided not to do a baby shower because when I attempted to do a small gathering for a gender reveal not a single person I invited came, not even my best friend. I decided then and there, after much crying, I would not set myself up for the same disappointment and instead bought everything myself or with gift money from coworkers and one really good friend of mine. At this point I now have everything I need and there is absolutely no reason to have a shower. I am being told that I should do a shower or atleast do something after the baby gets here because every baby should be celebrated and I basically feel like people around me are trying to force me into some sort of party that I don't want the headache of dealing with. \n\nSo AITA for not wanting to host a party in my and my future child's honor?", "created_utc": 1695351452, "permalink": "/r/AmItheAsshole/comments/16oz88y/aita_for_not_hosting_my_own_baby_shower/", "score": 26, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I refuse to host a party and people are saying I \"have\" to have a party that I don't want because I 1) don't need it and 2) don't want to set myself up for disappointment again\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nIt is in poor taste to host your own shower for the reason you stated. You don’t have to have any kind of shower or party if you don’t want one. I don’t even know why this is a question. No one is obligated to throw any kind of party.", "NTA\n\nThese people in your life are morons.\n\nThis is your second child, as you said in the comments, so lots of people don't do a shower after their first. Does anyone actually think that without a shower your child won't be celebrated?  Do what is best for you and that sounds like not putting yourself through the stress and expense just to please other people.", "In my experience, it does appear as a gift grab if you host your own shower. If others feel it is so necessary, they can host one for you.\n\nSimply enjoy your pregnancy, and look forward to the new life ahead. \n\nNTA.", "NTA\n\nThey want a party? They can host it themselves.\nNo one can force you.\n\nAnd after what happened with the baby reveal? Dear, you have good reason to tell them to f*** off.\n\nAfter having the baby you'll be way too focused and tired to be having a party. If they want to meet the baby they can come for visit at your home when you say it's ok to do so.\n\nThere'll be enough parties afterwards each birthday.", "Nta. I always thought it was cringe to host your own baby shower. It's lovely when someone throws one for you cause then you can feel loved and appreciated if they're willing to do all that for you and the baby! I feel sorry about your gender reveal tho. Had that happen to my sister once, was so sad", "NTA.\n\n> I am being told that I should do a shower or atleast do something after the baby gets here because every baby should be celebrated\n\nSure.  Let me know when and where and I’ll show up if I can.  I have everything I need though, so tell them no gifts please.  Thanks for offering!\n\n>I meant you throw it.\n\nI’m good.  I celebrate my baby every day.  Thanks for the thought.", "NTA. It's extremely tacky and in poor taste to host your own shower.", "NTA \n\nYou don’t need to have a baby shower, if you don’t want that unnecessary stress, that’s okay. Go thru your pregnancy how you want to!", "NTA. You’re set. You don’t need a shower", "NTA.  It's tacky to host your own shower.  And it would be equally tacky to host a post-birth gift grab disguised as a party.", "It’s totally tacky to host your own baby shower. When the baby is born, send announcements.", "NTA. It's entirely your choice!\n\nETA: I saw below that this is your second child. I don't think it's common to have a shower for a second baby, so you definitely don't have to. Especially if you pretty much have everything!", "NTA. You are not supposed to throw your own shower, it is tacky and poor etiquette. If people want to celebrate your baby, they should host a shower for you.", "NTA. You celebrate a baby by loving it and caring for it. A baby doesn't know about showers, and won't care even when they're old enough to know. This is so silly. Just have your baby, and congratulations!", "YTA for throwing a gender reveal. dunno why you people want to celebrate your babies genitals as if it even matters. im not surprised they didnt show up to your gender reveal party", "YTA. It's not about forcing a party on you, it's about celebrating a significant milestone in your life. Your decision not to host a baby shower may come across as ungrateful to those who care about you and want to share in your joy. It's not tacky to accept support from loved ones. Instead of shutting them out, consider compromising on a smaller, more low-key celebration if the thought of a big party is overwhelming.", "\"no.\" is a complete sentence. your friends are idiots.", "NTA. Why tf do they demand a party? Do they know they can just give you gifts without a party?? Do they need free food?! What is going on!?? Geez. You’re 35 weeks, please, go take a nap and forget them.", "NTA\n\nI know what it’s like to not have a baby shower or bridal shower etc. organized for you and it’s so awkward to throw it for yourself. Don’t feel bad at all for not wanting to give yourself extra work / stress. Also, this could be a great opp for your husband to organize something special for you, and he could even work with your close friend to do it but again it’s kinda awkward to ask someone to throw a party for you. Don’t feel bad!", "NTA… girl the first opportunity to celebrate this baby already happened and no one came. People show you who they really are when you’re pregnant/postpartum. \n\nYes, baby should be celebrated, but only by the people around you who care about you both.", "NTA, I didn’t have baby showers for either of my two, I did get presents after they were born and also before but luckily I grew up in a time where the pressure to keep up with the Jones wasn’t as important. You do you, I can understand why you don’t want to put on a baby shower as it’s your family or friends that are supposed to do that for you. After they didn’t have the courtesy to turn up for the gender reveal, why would you put yourself through that all over again.", "NTA. The baby will be celebrated even without a baby shower. Your baby isn't going to care if they don't get one. They're not going to grow up and hate you because you didn't have one.\n\nEnjoy the last few weeks of your pregnancy and ignore everyone's unwanted opinions.", "NTA \n\nAnyone who expects me to host a party at 35w pregnant can go screw themselves.", "NTA. \n\nI’m curious as to where you are that you’d be organizing your own baby shower, where I am your closest friends would always organize one for you. It would be very tacky for me to organise it myself. Almost one of the first things my friends said after I told them I was pregnant was offer to organize the shower for me.", "I'm just getting told from several people at this point that I should do one and that all babies should celebrated and why won't I do it and on and on and I've gotten to the point I've started to question if I was right in my refusal. This isn't even my first kid, it is my second, though my last was born almost 10 years ago", "It just off putting to me as well given this is my second child. Yes my last was born almost 10 years ago so I had no baby stuff left from him but still, I don't need a shower for this child and I don't need the headache to pulling one together either. It would literally just be a cash grab at this point, or diapers....that's all I need and I'm intentionally waiting to buy diapers so I don't have left over boxes", "THIS. They want to go to a party that they don't have to pay for or do any work for. They aren't friends, they're just users.\n\nOP, please memorize this and repeat this to anyone who harasses you to throw a party: \"Thanks for offering to throw a party for me and the baby! I'll tell everyone else who asks that you've volunteered to host it, and I'll send them your way.\"", "I cried and got over it, is what it is. I didn't even bother telling them what they had skipped out on, just told my family 2 months later I was pregnant and it's a boy, tada", "Might have to do this next time it gets mentioned haha!", "What does this even have to do with the question? This is completely irrelevant.", "They didn't know it was a gender reveal. I know reddit hates gender reveals but it wasn't some huge thing. It was literally open an email and read the blood testing they did for genetic issues, but it also had the sex on there so we were going to find out regardless. I invited just a few close family members and a single friend. Wasn't planning to burn down the state or anything lol", "Wow, bad experiences? What does it have to do with what OP asks?", "If they want to celebrate they can throw the party. That’s literally the most common etiquette for these things, especially baby showers. And in my experience if I want to get someone I love/care about a gift I don’t need a party to do so. I just get them the gift. I’ve had friends who chose not to have a baby shower at all and I still went to their house with a gift to welcome their new baby. \nFor example - my husband and I eloped in another state. No one was invited. My parents were thrilled. They threw us a pre wedding shower and a post wedding celebration and my family came and gave gifts and were excited to celebrate us. \nMy husbands family didn’t throw us a party and we didn’t get any gifts from them “because there wasn’t a wedding”. We don’t have a good relationship with them to start, so I don’t mind. I just find the mentality that an event has to happen to give gifts. \nTo me gift giving is unconditional. It doesn’t matter if I get to go to a party and eat a $10 plate of food.", "I wouldn't have minded if they wanted to host it, even if they hosted it at my home. It's just tacky to me to host my own shower, even more so for a second baby, and emotionally if people bailed again, I would be devastated again. \n\nIf any of them had shown the least amount of support it might be different but given no one has called and checked up on me a single time, well, I don't have much support. Unrelated, but my Aunt and uncle recently came to my home to the first time and we have been here over 6 months and live 20 minutes from them. There wasn't a single positive word said, and the only reason they came was because my cousin wanted to host a birthday dinner for them but my uncle's mom can't get into my cousin's house, but my house is wheelchair accessible.", "And congratulations 👍", "You’ll surely celebrate your child by loving him/her and providing for his/her basic needs. That’s what babies really care about.", "are those the people that didnt come to the gender reveal? just tell them, you dont want to host another party they wont shoe up to.", "Babies don’t need to be “celebrated”. Babies do not GAF if you throw an entire parade in their honor. They are babies. \n\n“Celebrate” the kid in a couple years when they actually know what’s going on and can have fun. It’s called a birthday party.", "Then they should throw it since they're so hung up on it.", "The correct answer is \"I really wish you had been at the gender reveal party, we celebrated my new baby the day I revealed them to my friends and family so I wouldn't have to deal with a lot of hostess hassle in my 9th month when I can barely stand up, let alone entertain a house full of people because I am so busy USING MY BODY TO MAKE A WHOLE OTHER PERSON. The next time my child will be celebrated will be at their future birthday/Christmas/college graduation. I'll make sure and let you know the details of that gathering once they are finalized. Cheers! *Whole line of passive aggressive emojis*”\n\n\nPotentially unrelated, but worth mentioning depending on the beliefs of your social circle... in 2023 many of us find gender reveal parties to be incredibly tacky and do not go to them on principle. Personally I will never recover a friendship with a friend whose husband reacted to a pink cupcake by kicking over his grill and spiking the cupcake into his yard while screaming \"REALLY?!? What the FUCK!!!\". She stayed with him, he's the exact \"boys do sports, girls do chores\" asshole we all saw in that moment, and basically she now has three daughters, the worst husband on earth, and no friends. Which is to say nothing of the fact that gender is a social construct and a child born with one set of junk might very well decide it doesn't match their gender. Gender reveal parties have a heavy undertone of \"You'll be a girl/boy whether you like it or not!\" which many people find to be a depressing burden to put on a creature that hasn't drawn breath.\n\n\nHOWEVER: I find it unlikely that every single person in your support network is blocking gender reveal parties and not a single one said anything about their potential reasons for doing so. Sounds like your friends and family just don't make you a priority, which sucks.", "You just say because the last time I tried to celebrate my baby you didn’t show up. \n\nCongratulations!", "Then all of those people telling you to have one, should throw one for you.   \n\nYou certainly are not obligated to do anything you don't want to.\n\nNTA", "If anyone says to you that you should do one, I would just respond with “yah it would be so nice if someone threw me one… oh well 🤷‍♂️”", "Every person who pushes this should be asked when THEY are planning on hosting it.\n\nNTA", "NTA. \n\nYou don't have to hold any event if you don't want to. But it could be that no one came to the gender reveal not because they don't care about you or your kid in general, but because many people view gender reveals as tacky and wasteful. A regular shower is viewed differently.", "Oh that's so sad. Sorry that happened to you. Honestly that would have made me not want the whole baby shower thing more", "Did they know you were pregnant and inviting them to a gender reveal beforehand? Or was the purpose of the party a surprise?", "[deleted]", "Not to mention newborn babies need to be protected from random people's germs.", "I had also just bought my house. Didn't think a brief mention of a gender warranted a full explanation.\n\nBasically, I told everyone it was a gathering at my new house, that we wanted everyone to come see the new place and have lunch with us and we had planned to basically surprise everyone by telling them we were pregnant and then finding out the gender. We were providing lunch and I didn't want it to be a huge thing"]}