{"id": 27367, "submission_id": "16ov7jt", "title": "AITA for using the court system to help me", "selftext": "My mother passed away over 2 years ago.  Myself and my 2 half siblings inherited a piece of property with a mobile home.  One of my siblings moved in to it.  An appraisal was obtained and I agreed to sell my share to them for roughly 60% of the value of my share.  Over the last 2 years, I paid for probate with no help from either of my siblings.  To keep creditors from forcing the place to be sold to pay medical costs, we had it moved to the 3 of our names.  It's been over 2 years, I have pled with them to buy me out or agree to sell.  I have a business and home I am on the verge of losing due to the economy and am struggling to keep my head above water.  The sibling living in the residence is going through a lot too, I understand this.  I have purchased things to send her to help in the past.  I've not received so much as a message letting me know she received the things I sent, even though she has.  That sibling told me if Id give her 6 months to try to get a loan, if she couldn't after that period, she would agree to put it up for sale without me needing to use legal means. That 6 month period ended in April of 2023. After she told me basically she didn't care about my situation, and would keep the place because it means more to her than to me, I decided to give her notice that if she couldn't buy me out, I would be contacting an attorney to use the court system to force it to be sold and  the price I was willing to sell before is off the table, I want fair market value.   The place is in disaray.  The little 2 bedroom houses at minimum 3 adults and 5 children.  With her share she could relocate and have a down payment for something bigger.  They both let me know what  piece of garbage I am for forcing it to be sold.  Am I supposed to loose everything I've worked for now so she doesn't have to move with money in her pocket?", "created_utc": 1695339730, "permalink": "/r/AmItheAsshole/comments/16ov7jt/aita_for_using_the_court_system_to_help_me/", "score": 51, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I hired an attorney to force the residence to be sold.  AITA for forcing this situation after waiting for my siblings to resolve the issue?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA: Realistically, no one should have moved in. The home should have been sold as soon as you were able to with the profits being shared.\n\nGive up the idea of them buying you out. If it is a $300K home, expecting them to pull together $100K to buy you out would be really difficult for them to achieve without selling the property.\n\nThe only option is to sell.", "NTA.\n\nEither they can buy you out or not, but they don't get to keep it all for free.", "NTA - attorney is a good idea", "When the property is sold, you should try and get 1/3 of rental value for the last two years unless they have been paying taxes etc.", "NTA.\n\nSister said she didn't care about your situation? Great. Hire the attorney. Stop helping her out since she doesn't care that you're struggling.", "  \nRetired probate paralegal here with over 15 years experience. In my entire career I never saw a situation where a sibling or other heir who wanted the real estate for himself/herself ever successfully bought the others out or obtained a loan in their name to buy the other heirs out.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy mother passed away over 2 years ago.  Myself and my 2 half siblings inherited a piece of property with a mobile home.  One of my siblings moved in to it.  An appraisal was obtained and I agreed to sell my share to them for roughly 60% of the value of my share.  Over the last 2 years, I paid for probate with no help from either of my siblings.  To keep creditors from forcing the place to be sold to pay medical costs, we had it moved to the 3 of our names.  It's been over 2 years, I have pled with them to buy me out.  I have a business and home I am on the verge of losing due to the economy and am struggling to keep my head above water.  The sibling living in the residence is going through a lot too, I understand this.  I have purchased things to send her to help in the past.  I've not received so much as a message letting me know she received the things I sent, even though she has.  After she told me basically she didn't care about my situation, and would keep the place because it means more to her than to me, I decided to give her notice that if she couldn't buy me out, I would be contacting an attorney to use the court system to force it to be sold and  the price I was willing to sell before is off the table, I want fair market value.   The place is in disaray.  The little 2 bedroom houses at minimum 3 adults and 5 children.  With her share she could relocate and have a down payment for something bigger.  They both let me know what  piece of garbage I am?  Am I supposed to loose everything I've worked for now so she doesn't have to move with money in her pocket?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA. You should've contacted the attorney in April to force an immediate sale.", "NTA\nDo it now you have waited too long already. They want a free home and that's exactly what you ate giving them while you lose yours.", "I live in another state and could not prevent an \"owner\" from moving in, but you are right on all counts.  I've hired an attorney to force a partition sale.", "It's a mobile home so probably worth closer to $30k if its not too old or beat up. Hopefully the land has more value than that.", "Thank you.", "I suggested splitting the tax bill, but my sister did always take care of it since she resided there.  I don't want to make things unnecessarily hard for them, I just want out.", "The land in this area has been being bought up by developers.  In my opinion the only value is the land.  The appraisal  value was $180,000.  I initially agreed to sell for $35,.  Now I will only stop the legal proceedings for $55,. (still less than 1/3 of the appraised value)", "Why? She's clearly taking advantage of you and does not care about you! Get your fair share, because if not... They're just going to keep it! Why should they be rewarded for their bad behavior? Besides now you're going to have expenses related to this to cover.", "No. Insist on full market value."]}