{"id": 27405, "submission_id": "16pdo6e", "title": "AITA for not apologizing to a man for saying his obsession over coffee was “abnormal”?", "selftext": "\nI (f27) was running late to work yesterday and stopped to get my coffee at *insert national orange and pink coffee chain* instead of the local little shop I go to. I live in Brooklyn so there are a lot of great places for coffee, but not all of them are speedy. This places coffee isn’t half bad anyway, plus they have donuts. \n\nEnter coworker “Parker” who is a self proclaimed coffee snob. Parker is my age.  He saw the cup on my desk and started teasing me. The first time I was like “haha I know “ and that was that. Parker didn’t stop though, and it felt less like teasing and more like…just being rude? He started going off on my taste, how I wouldn’t know good coffee if it hit me in the face, how I was crazy to drink that trash at various points throughout the day. Finally at lunch he was like “you should really just let me make you something so you can actually appreciate good coffee” and like? We have a small kitchen where he keeps a moka pot and beans and it sounded unbearable. I said “Parker it is not normal to be this intense over a cup of coffee” and a few of my coworkers who were sitting next to me snorted. We all kinda exchanged looks as he made his own coffee. \n\nThis morning on the elevator it was just Parker and me and he said “I was very embarrassed by what you said yesterday. I’m very passionate about coffee.” I said “Okay but you don’t need to be rude about it to me” and he said “It hurt my feelings and you should apologize.” He then divulged that he is autistic and coffee is a special interest of his. I didn’t want to apologize, but this is making me rethink it. If anything, to keep the peace? I don’t know if I should. Will I be the A if I don’t?\n\nEDIT- It was Dunkin Donuts, I’ve gotten a few comments as to why I wrote it the way I did. I’ve seen so many things like “chain that rhymes with Farbucks” etc I thought it was an actual rule, lmao.", "created_utc": 1695397521, "permalink": "/r/AmItheAsshole/comments/16pdo6e/aita_for_not_apologizing_to_a_man_for_saying_his/", "score": 945, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I didn’t know Parker had a special interest in coffee/was neurodivergent; but I’m still thinking I shouldn’t apologize because he treated me so rudely. I think it might make me the A if I don’t.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA Your coworker was rude, doubled down on it and tried to use autism as an excuse for his rude and condescending remarks.", "NTA.  He was basically bullying you.  That he has a hard time understanding social cues is understandable, but that doesn't help you in the moment when the harassment just keeps happening.\n\nIf you wanted to be extremely nice, you could say something to the effect of, \"Look, I wasn't talking about you liking coffee in general, I just felt harassed because you kept attacking me about that one cup of coffee that I was drinking.  I'm sorry if you felt like I was shutting down your interest.  That was not my intent.  Going forward, please do not comment on my drinks.  Thank you.\"", "I. love. coffee. Everyone in my office knows this and will hit me up once in a while for coffee or coffee info.\n\nThat said, I know that not everyone is like me. If you ask me for a cup, you'll get a good cup. If you don't ask me for a cup, you'll get whatever you normally like to get. It doesn't matter to me - not my circus, not my monkeys.\n\nParker's an asshole. You don't owe him an apology, and him using his autism as an excuse to be a dick is just plain wrong. This is actually an opportunity for Parker to learn some about acceptable social interaction. Like, **he** can just do whatever the fuck **he** wants, piss off everyone around him, and then demand an apology from them because **he** feels like **he** got his feelings hurt - from a situation that **he** instigated?\n\nNTA", "NTA\n\nParker should take a special interest in learning manners. 😒\n\n\"I was embarrassed when you went off on me about coffee, multiple times, after being asked to stop. My feelings were hurt when you started saying I had shit taste in coffee. You are not owed my mental and medical history, but you have no idea about my life outside of work. You don't know if I am autistic and D.D. is my safe food. You don't know if I am financially struggling. So from now on, talk to me about work related things and this won't be an issue going forward.\"", "NTA. He has no business acting like a victim.", "NTA\n\nParker was being obnoxious and didn't stop when he should have.", "NTA he was basically bullying you for your coffee and is expecting you to apologize to him???? I would just try to limit your interactions with him, especially if he thinks he can use his autism as a way to get away with his behavior", "NTA. Parker used his passion to belittle you and you responded in kind.", "Autism isn't an excuse, but an explanation. He needs to apologize to you and own up to his mistake. He should get more leniency than most because it is true that autistic people struggle with things like these, however part of being autistic is understanding that ultimately it is your personal responsibility to fit into the world as best you can.\n\nThe appropriate response would be, \"I am sorry about ragging on you, my autism frequently gives me tunnel vision and I don't always know what is appropriate.\"\n\nYour comment about normalcy likely cut deep. It's a tough word to hear when you *know* you aren't normal. That being said, how were you to know? \n\nUltimately NTA.", "You had the grounds to say what you did.", "NTA, he was being very rude about your coffee choices and he needs to learn to respect other people.\n\nalso, I wouldn't believe that he's autistic all of the sudden, sounds too convenient and in case he is autistic, still doesn't excuse him to be a rude asshole, he must learn to respect other people.\n\n>he said “It hurt my feelings and you should apologize.”\n\ntwo can play the \"hurt olympics\", tell him he hurt your feelings with his comments and he owes you a bigger apology for talking down to you in front of everyone in the office.", "NTA. Tell him his autism doesn't give him the right to bully you, which insulting you for getting your coffee at that chain is. It's bullying. And you hope he learns from that as other people might even be more kind and if he tried it with a stranger he risks being assaulted.", ">“I was very embarrassed by what you said yesterday. I’m very passionate about coffee.”\n\n\"Sucks to suck, jackass.\" Is the only reasonable response here. He was actively being an asshole, autism isn't an excuse for that. Dog breeds are my girlfriend's hyperfixation and we've specifically worked on her learning that other people don't know as much about it as her, they will say wrong shit or hold opinions she disagrees with and that's fine, it has to be let go.\n\nAutistic or not he has to learn the lesson here.", "He’s passionate about coffee, and passionately rude too. Not incompatible \n\nNTA", "NTA. I'm autistic and I'll admit it, my 'special interest' is with cats. I know all sorts of facts about cats, can even identify most breeds just by their picture.  But I also know to stop talking about cats if someone asks me to stop. Yeah, I get it, autism is not identical in people and maybe he really didn't realize you were uncomfortable. If that's really what happened, there are resources for autism. I frequently look up different facial expressions so I can try and recognize when people are uncomfortable (or happy, sad, etc...) around me. I'm assuming here, but it seems he is able to do that as well. It's easy enough to do, quick and - even better - it doesn't cost a cent.", "NTA. There's few things worse in this world than coffee snobs, steak snobs, or those people who make weed 100% of their personality", "Omg…NTA but using autism as an excuse to be an unbearable ahole isn’t cool. He can be passionate but he took it too far, especially after you directly told him he was being rude. That’s when he used his autism as a weapon.", "He is good at one thing.. he tried to show off and you put him in his place. The autism defence perhaps explains his inept attempt to start a chat about his passion. No fault to you, no apology necessary. But maybe wave an olive branch by chatting about something coffee related.", "He was absolutely attempting to ask you out for a coffee date and failed in a spectacular public matter. He can drink his espresso alone.", "If he actually has autism. He has made fun of your choice of coffee multiple times throughout the day. There is no need to justify your choice. His behavior was simply annoying and unnecessary and your reaction was warranted. If he is autistic, he might not be able to control it, but you couldn't know beforehand. NAH", "NTA he yucked your yum in public to shame you out of liking what you like. Autism isn’t an excuse to be an asshole and a special interest isn’t an excuse to be an asshole.", "NTA.\n\nFirst, I have to point out that your comment was not especially mean, and struck me as a calculated tactic to both match his unnecessarily critical tone and shut down his lines of conversation at the core. If he is offended by a single line after all his shitslinging, he is insecure and shouldn't be doing it in the first place, autistic or not.\n\nEven though autism is, practically by definition, misanthropic, I do not think it is a good excuse to be an overbearing, hypercritical dick to people. It is a spectrum, I think many places of the spectrum can be managed with practice, and I further think that some people are nowhere near as autistic as they claim and just like feeling special and not dealing with their shittery. \n\nWe all are a mess of difficulties and disorders, and we all have to work through it to achieve a kind of social harmony, and this guy sucks at it and needs to commit to being better about it. Demanding an apology from you while taking no accountability for himself makes him the asshole, not you.", ">insert national orange and pink coffee chain\n\nTotally irrelevant, but is there a reason people do this? There's no rule against mentioning a business that I know of and it's not like you're trying to obfuscate which ~~donut~~ coffee shop you're talking about besides not using the name for whatever reason.\n\nAlso, NTA. I don't care if coffee is a special interest of yours. Not being harassed is a special interest of mine. You took it with humor at first, but there's only so much shit someone can put up with. I recommend you tell him exactly that. If he apologizes to you first then sure, apologize if you want.", "INFO: Did you tell Parker to stop before you made the comment you did at lunch?", "Kids today are over oppiniated and soft with feelings.\nNeither get to understand eachother because they lack basic skills in communication and consider an opposit as a direct attack on one's own belief.\nStart the conversation as adults all over again while you both mutually apologies for miscommunication.", "‘Finally at lunch he was like “you should really just let me make you something so you can actually appreciate good coffee’\n\nIf he would stop talking about it and make the coffee would you accept this solution?  Because it seems to me like the best of all worlds. No conversation, no comments on ‘normalcy,’ more coffee.  \n\nNAH.", "Why didn’t you just leave him alone?", "YTA  ... For this reason.... Coffee literally has 2 sides of the spectrum.... you don't care and will just drink whatever or you're a complete coffee snob. There is no in between. You were rude, apologize", "ESH. \n\nYour coworker definitely crossed the line by getting too intense about the chain's coffee\\* and should apologize for that, but it sounds like you spurned a legitimate offer where he was trying to do something nice.  \n\n\\*though I'll admit, as a tea guy, I'd sooner drink sewer water than the stuff they claim to have as \"tea\"", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nI (f27) was running late to work yesterday and stopped to get my coffee at *insert national orange and pink coffee chain* instead of the local little shop I go to. I live in Brooklyn so there are a lot of great places for coffee, but not all of them are speedy. This places coffee isn’t half bad anyway, plus they have donuts. \n\nEnter coworker “Parker” who is a self proclaimed coffee snob. Parker is my age.  He saw the cup on my desk and started teasing me. The first time I was like “haha I know “ and that was that. Parker didn’t stop though, and it felt less like teasing and more like…just being rude? He started going off on my taste, how I wouldn’t know good coffee if it hit me in the face, how I was crazy to drink that trash at various points throughout the day. Finally at lunch he was like “you should really just let me make you something so you can actually appreciate good coffee” and like? We have a small kitchen where he keeps a moka pot and beans and it sounded unbearable. I said “Parker it is not normal to be this intense over a cup of coffee” and a few of my coworkers who were sitting next to me snorted. We all kinda exchanged looks as he made his own coffee. \n\nThis morning on the elevator it was just Parker and me and he said “I was very embarrassed by what you said yesterday. I’m very passionate about coffee.” I said “Okay but you don’t need to be rude about it to me” and he said “It hurt my feelings and you should apologize.” He then divulged that he is autistic and coffee is a special interest of his. I didn’t want to apologize, but this is making me rethink it. If anything, to keep the peace? I don’t know if I should. Will I be the A if I don’t?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nAnd if you really want to bam him up, start putting good coffee in the disposable cups from the worst coffee chains you can think of", "Nta", "NTA. I’m so tired of people using “I’m autistic” as a fucking get out of jail free card. Your autism is not an excuse for being an asshole.", "NTA. He was being rude to you, even if he didn't realize he was being rude.", "You can apologize if you want to keep the peace, but NTA\n\nHe was making fun of you for something as stupid as coffee preference.", "Never TA to expect civility at work, no matter what.", "I would have said I am sorry I didn’t know you were autistic. Next time maybe I will tell you how rude you are being or just because you love coffee that way doesn’t mean everyone else does", "NTA he was being rude. Autism isn't a pass to be an asshole.", "\"Did it occur to you that harassing me about not being a coffee fanatic is stressful for me? How is it that you're the only person with feelings that ought to be respected?  You get to be passionate about anything without harassing me and saying rude things about how deficient you find my tastes. Please grow up. And if you won't grow up at least don't be aggressive with me and then whine when I respond aggressively right back.\"\n\nNTA. I'd have talked to my empty coffee cup and pretended it was Parker: *The coffee guru has arrived. He's lecturing me again. Isn't this fun?*", "He doesn’t get to bully you because of your coffee taste. Frankly he doesn’t need to comment on it at all once you said “stop”. He needs to apologize to you", "NTA Autism or not, he knows the meaning of being rude. And he was over the top rude to the point of bullying.", "NTA\n\nIt's great that coffee is his special interest, but that doesn't affect you at all. Being autistic doesn't give him the excuse to 'coffee shame' you. Personally, I don't think you did anything wrong, and he can work through his emotions by himself.", "NTA \n\nThe issue isn’t that he likes coffee. It’s that he harassed you for the entire day and you’d finally had enough.", "NTA.  He should apologize for being rude in the first place.  He needs to understand that what he sees in front of him doesn’t not mean that is someone’s preference and that different people have different taste and financial circumstances that may influence a decision on any given day.  He was rude on many levels.  You only were on one.  Autism is not an excuse for being rude.", "NTA, but him a shitty coffee and call it a day. Lol", "NTA. You told he that he was being rude to you and his response was that *you* should apologize to him for the one-off comment that you made after he had been harassing you all day. He never apologized to you. Autism is not an excuse to be rude and even if his autism made it difficult for him to read the social cues and see that he was going on about it too long and annoying you, when you told him you found it rude he should’ve apologized instead of using his diagnosis as a defense.\n\nIf he apologizes to you first, I would apologize for you comment as well but other than that I don’t think you need to.", "NTA.  He was being a dick.  Autism may be a reason but it’s not an excuse - he can learn not to be an ass.", "NTA\n\nHe was bullying you and your choice to stop for coffee.", "NTA\n\n> “I was very embarrassed by what you said yesterday. I’m very passionate about coffee.”\n\n\"That's right. Your display of excessive coffee passion in a business environment was indeed embarrassing. How astute of you.\"", "Nta. He should be the one apologizing to you for bullying you about your coffee. It's just coffee so why does it matter to him?", "I think he was negging her into a coffee date?", "Thank you. I do like good coffee- our office is close to a Stumptown and I love to see what seasonal stuff they have! If you said “oh Stumptown is good but try this it’s even better” I wouldn’t mind. He just seemed so mean about it.", "Absolutely this, word for word. ⬆️", "That's a hot take I can relate to.", "I see what you did there.", "I have this conversation with my 9 yo all the time - she also has autism.\n\n\"you can't berate other people because they don't people like you want them to. unless they are harming you, themselves, or others, you need to learn to let it go\"", "It’s not a rule?! I’ve seen so many people do it I assumed it was. The more you know", "How was OP rude?", "That is fair! I will say that even though it was something nice, it felt condescending. I will accept your ruling though of course. \n\nAnd haha, I wouldn’t know about the tea but I will take your word for it! A friend did bring the spiked iced teas they just came out to a party  for us to try jokingly and it was like straight simple syrup! Awful.", "I would not trust a guy that insists/bullies someone into letting him make a drink for someone, let alone a woman.\n\nAm I saying he IS a creep or potential HR violator, not in the slightest. But it's commonly accepted that he should not be that insistent.", "\"Parker I don't like coffee or any human being enough to have these kinds of conversations. Can we talk about something else?\" Boo. Hiss. Boo. Please go away Parker.", "Honestly that was my thought too.", "🥶I am very much engaged. He has met my partner who is also a woman, so he knows there’s a 0% chance even if I wasn’t getting married. Certainly hope it’s not that.", "This was my read too.", "Yup. He can indulge in his own interest in coffee all he wants, it isn’t okay for him to go all in on insulting someone else’s different preferences, and he absolutely needs to be able to recognize the difference, especially in a professional environment.", "My personal rule #1: don't be a dick.\n\nIt's okay to enjoy your hobbies, just don't be a jerk while trying to force other people to also enjoy your hobbies.", "Lol fair enough. Yeah, I think people do it a lot just to not give too much info about where they are. At least that's the feeling I get.", "I think a good way to apologize without actually apologizing (since yeah, he started it and you don't really owe someone an apology for being a bit rude after they started it) would be to just ask for a cup at some point in the future.  I'm not gonna lie, this dude sounds awkward AF, but that's not a capital crime and you'll probably get a nice cup of coffee out of it.", ">Am I saying he IS a creep or potential HR violator, not in the slightest.\n\nI am. Fuck that guy.", "Absolutely not. If OP comes in with any other coffee deemed unacceptable then it’ll become a slight against him. “Did I not make a good enough cup” BS. There’s no reason OP needs to engage with this person irrespective of their alleged diagnosis", "I don't wanna, he's all yours", "I think you're assuming facts not in evidence.\n\nIt's all well and good to claim that you should never give any slack to someone on the autistic spectrum, but that's just as bad as forgiving their every offence.  Either way is a super inflexible, one-size-fits-all approach to something that's incredibly varied in how it manifests.  This was over coffee.  I'm totally willing to believe that this guy legitimately didn't understand why he was in the wrong (he was, obviously), because autism can make that sort of thing hard for some people to see.\n\nThere needs to be \\*some\\* grace when dealing with a neurodiverse person.  Because otherwise, you're enforcing the notion that they need to be exactly the same as a neurotypical person.  Society tried that until recently, and it was shit.", "Tbf he seems disinterested in if other people want to. I'd run for safety personally.", "He clears does not understand he’s in the wrong as he’s demanding an apology and using his diagnosis as an excuse to be a dick.", "i hate that coffee you were drinking, but IDGAF if you decide to drink it. why would i? why would anyone care what someone else decides to eat/drink? \n\ni've made cutting remarks to *my friends* over their choices but it's all playful & they know it & have done the same. i don't know what this guy's reasoning is for being such a PITA but i certainly don't think you owe him an apology. NTA.", "NTA, I’ve had a coworker in the past who acted like the food police and it was unbearable. They only knocked it off after I said something similar. What anyone else is eating or drinking is not his business. You don’t owe him an apology.", "NTA.\n\nThe fact that he added in that bit about making you a good cup almost makes me think this was an adult version of when boys in school tease girls because they secretly like them.\n\nEither way, you don't need to apologize, certainly not until he does so first.", "NTA\n\nI wouldn't either. He was being fucking annoying. \n\n\nHaving a special interest in something doesn't mean other people are required to humor you.", "NTA he sounds like a massive AH and needs to learn to keep his opinions to himself.", "NTA.\n\nSo, being autistic does not excuse Parker from being an asshole. And he was an asshole about your coffee.\n\nYou do not owe him an apology. You said the right thing in the elevator. He was embarrassed because he was being a jerk to you. He MAY have been being a jerk to you because of his neurodivergence, but he was still a jerk.\n\nMaybe go to him and say something like: \"Hey, can we start over on this coffee thing? I hear you that you are really passionate about specialized coffee. That's great! I am not passionate about that, and that's ok.\" If you want to let him make you a coffee, I bet all will be well.", "NTA. Being autistic is not a blank check to be rude and pushy towards other people. If he was mentioning his autism as part of an apology for his behavior, that would maybe merit some extra understanding from you in accepting his apology. But he wasn't apologizing, he wanted to use it as an excuse to bully an apology out of YOU.", "NTA you’ve nothing to apologise for. Ask him why he hasn’t apologised to you for harassing you all day over a cup of coffee? Ask him if it’s only his hurt feelings that matter? Ask why he thinks you have to be accountable for defending yourself and he, as the attacker, doesn’t?", "NTA. As an adult on the spectrum, I can tell you that if my obsessions caused me to badger you about some choice that was largely inconsequential to you, it would not be up to you to apologize. His telling you that it embarrassed him was unfortunately the closest he's going to come to apologizing to you, but it's an indicator that he understands the situation was of his creation. He may well have been fishing for an apology, but none is owed.", "You are a bear. Parker was poking you. Parker got what he deserved. Don't be like Parker. NTA", "NTA. Bring autistic and it being a special interest doesn’t give him the right to be rude.", "NTA. His autism and its resulting issues are not your responsibility. He’s a big boy now, and has to learn not to verbally abuse people over things he’s “passionate” about.", "NTA.  He was rude and mocking you over a cup of coffee then tried to use his autism as am excuse for being rude.   Nobody likes snobs", "Yeah no. The obsession with coffee could be related to the autism, but being a dick about it is definitely a choice.\n\nNTA", "NTA. This is a learning opportunity for him. Tell him that while you can appreciate his special interest, it does not mean he can insult your own coffee preferences. If you want to prioritize speedy service and a decent coffee over something that is more specialized, that’s your call. As a coffee professional, I question his assertion that his moka pot is that much better. Maybe he should try making a pour over if he really wants to experiment with the unique flavours of specialty coffee beans.", "Being autistic doesn't mean he's inherently right, or that he didn't make something unimportant a big screaming deal.\n\nI empathize with him not getting the social cues and letting his excitement get away with him... but come on. NTA.", "Huh. Apparently I missed the day at Autistic school where talking about your special interest means insulting other people repeatedly. I guess I've been doing it wrong.\n\nNTA, obviously. What he did goes beyond not being clued into social expectations and into objectively being a jerk territory.", "As someone on the spectrum, I will sometimes get invested and over-share my thoughts and opinions on my interest. It's very hard for me to draw the line between normal and abnormal enthusiasm. And it can be embarrassing when I get called out on it if I do.\n\nThat being said, if that happens, I apologize. I don't stalk off and sulk. And I certainly don't corner them in an elevator and DEMAND an apology!\n\nI empathize with Parker, but his behavior makes him an AH. \n\nNTA.", "NTA, maybe if he offered his OWN apology first. I'd let him know that he hurt *your* feelings and see where it goes from there.", "NTA.  Who gives a shit if you hurt his feelings.  I would say if you would like me to apologize to you, I think you should start by apologizing to me for being rude.", "NTA....if i was in your place, I'd get some more cups from that place and drink your coffee out of it, no matter where you got your coffee from.", "No he doesn’t get to claim special interest, he’s aware of his autism but magically not enough that he can control his coffee rage, his feelings aren’t more important then yours.", "If someone is being an asshole, without any evident reason as to why or what was making them behave that way - you responding, does not make you an asshole either. You did not know, nor could you have known, he had autism prior to that moment. \n\nIn this case, you're not the asshole.", "NTA\n\nAutism does not excuse his behavior or hurting your feelings. His disability isn't an AH pass.", "As someone on the spectrum who also gets (*privately*) offended when people don't think as highly about my special interests as I do because, How does everyone not see that this is just the coolest shit?, just because it's his special interest doesn't give him the automatic right to make that everyone else's problem.", "NTA.  My brother is a huge coffee nerd/aficionado, has his own espresso machine and grinds his own bean, etc., and he has never insulted anyone for for drinking coffee from a chain.  Parker was rude and wouldn't take no for answer.", "NTA.  Definitely don't apologize.", "NTA, I wasn’t sure with the title but in no way did you need him giving you flak about it", "\"He then divulged that he is autistic\"\n\nGod I *hate* it when people try to pull the autism card to excuse their shitty behavior. Tell him you'll apologise if he apologises for belittling your preference in coffee.", "NTA. I’m also very passionate about specific things but I understand it’s not everyone else’s job to accommodate me and my obsessions and also I know to keep some things to myself.", "He was bullying you. Don’t apologise. Fuck that!", "NTA. To help keep the peace in the future without tolerating harassment, be clear with him when he is annoying you. The sooner the better. “I don’t want to talk about coffee anymore. We had that discussion this morning and I don’t want to hear it.” He may not have been picking up on your annoyance throughout the day. You did what most people would do and kept quiet about it until you lost your patience, it’s understandable.", "NTA. He was bullying you and now he is trying to use his autism as an excuse.", "NTA Being autistic isn't an excuse to be an asshole. Every healthy human has special interests but being a snob about it isn't ok.", "NTA.\n\nAutism isn't an excuse. Yes you could have been more direct, but sounds like *he* never apologized for how *he* came across.", "NTA but you could explain \"alright, I'm sorry, but I feel like you should equally apologise for harassing me over coffee. I understand you're autistic, and I appreciate you telling me that, but I need you to realise that your behaviour was rude.\"\n\nBecause frankly, autistic people are capable of knowing better when they don't use it as a crutch to allow rudeness.", "Just because you're autistic doesn't give you an excuse to be a dick. I have an autistic friend, he isn't rude besides ribbing. \n\nIf he wanted to, he could have brewed up something as an improvement to what they were drinking. Instead, he was an outright dirty butthole", "NTA- He was rude. Let him stew.", "NTA - how about your feelings? He was nothing but rude to you - being autistic is no excuse.", "Dunkin Donuts coffee has consistently scored as one of the best tasting coffees in blind taste tests for many years.  His snobbery is over the top.  Enjoy your coffee and NTAH.", "NTA\n\nDude was literally insulting and negging you, then obsessed wanting to make you coffee.\n\nSeems like the incel's guide to dating. And autism is not an excuse to be rude.", "NTA.  Parker is rude and obnoxious.  He needs to shut up about this.  No reason to apologize.", "NTA. Coffee can be his special interest but that doesn't mean he can push that onto you, or that you need to consider his tastes when you buy something for yourself.", "NTA. \n\ni’m autistic and my special interest is film, particularly horror. i have a lot of knowledge when it comes to horror movies and have seen tons and tons. when i was 16 or 17 and not as mature or attuned to being kind to others, i would ask if someone had seen a movie - let’s use my favorite, Scream, as an example. if someone said “Oh, I haven’t seen that,” I used to say, “OH MY GOD! you haven’t seen Scream??? what????” in a pretty harsh tone.\n\ni realized after some time, around age 20, that that’s quite condescending. now, if i tell someone about a movie i like and they haven’t seen it, i specifically say “you should watch it if you get a chance, it’s on (streaming service). it’s really good!” that subtle difference is how you go from being a total bully and snob about your special interest to being a person who is sharing your passions and knowledge.", "my comment may be un-pc, so bring it on...I'm ready for the haters. I'm tired of people using the \"A\" card. As far as I know, autism doesn't cause snobbery. it also does not cause bully behavior. using autism as an excuse for an apology is just wrong. Autism seems to be the new ADHD. And, this type of entilted behavior does nothing to help normalize autism.", "NTA. He was a dick, no need to apologize for matching his behavior. \n\n***Autism is not an excuse for consciously choosing to be a dick.***", "NTA and as an autistic person, I fucking hate when people use that as their excuse for being an asshole repeatedly despite being told to stop.", "NTA .\nI'm a raging coffee snob, and even I won't bother, harass, insult and bully someone for their choice in coffee.\nIt's a personal choice that is none of my business, period.\nIf people are curious, I'll be happy to explain, but that's it.\nParker was bullying you.\nHe's the one who should do the apologising.", "NTA\n\nJesus things like this make me glad I work in the trades. Parker would've been told to mind  his own fucking business before he ended up wearing the coffee by like the fifth sentence.", "NTA. I’m autistic and am VERY defensive over my special interests but this is going too far. I’d understand his reaction if you had like… insulted HIS taste in coffee first or implied that he didn’t know anything about coffee because that’s generally what sets me off when it comes to my special interest, but him getting mad just because you drank coffee he didn’t like is over the top. If you had known it was his special interest, saying that he wasn’t normal would’ve been kinda shitty, but you DIDN’T know.", "NTA. If he wants an apology, he owes one first. He doesn't get to be an ass and then play the autism card.", "NTA\n\n>He then divulged that he is autistic and coffee is a special interest of his.\n\ngood for him? it doesn't give him the right to be a jackass to someone for what they choose to drink. one or two light hearted comments? fine - but berating you and telling you that you wouldn't know a good coffee if it hit you in the face is too much, like ***way*** too much.\n\nI'm also autistic, and I like to think I do a half-decent job of not treating people poorly because they aren't as interested in one of my hyperfixations as I am - I would certainly never berate someone for their taste if it didn't match my own, at the very least.\n\nYour coworker needs to learn how to treat people, that isn't a problem you need to solve and he doesn't deserve an apology for being called out on his weird and harassing behaviour over what coffee you decided to drink - where's ***your*** apology for being insulted and berated all day?", "NTA\n\nWhat a dope. \n\nI wouldn't apologize.", "Hi. Obnoxious autistic here. NTA.\n\nIf he wanted to gush to you about how much he loves coffee and you said he was a freak, fine, fuck off. But insulting you like that is completely over the line, and he's hiding behind his autism to do it, which smells to me like he knows it's unacceptable and has gotten away with shit by hiding behind his autism before-- but that's speculation on my part.\n\nHe needs to playfully insultingly infodump about his special interests to his personal friends. His coworkers are not required to sit through it, especially if he's being rude as hell about it.", "NTA\n\n&#x200B;\n\nDOn'T apologize. HE needs to apologize.\n\n&#x200B;\n\nIf he sharasses you again about it, involve HR.", "fuck no you are NTA.", "NTA, his autistic ass needs to realize that he too can be offensive.", "Autism isn't an excuse to be an asshole.\n\nNTA", "NTA\n\nAlso, being autistic is not and excuse to be rude or hurtful towards others, and I hate how people feel like they have to accept inappropriate behavior because they are autistic", "Being a bully is not a symptom of autism. You should explain yourself, but not apologize.", "NTA, but if the autism thing is real you should explain first that he had hurt your feelings when he told you that you had no taste. Then apologize for hurting his feelings. Be direct and very specific especially while explaining how he hurt you, but do it without emotion.  I'm not autistic myself but I know, work with, and get along with many people with autism. Being completely honest and direct works wonderfully. After you're trusted you can make little jokes, but be prepared to explain immediately if it's taken the wrong way.", "What a bully, I'd report him to HR. Dude was harassing you over a cup of coffee and hiding it behind being \"autistic\"? Nah, his feelings ain't shit. I wouldn't go near his coffee beans. \n\nNTA", "NTA\n\nI am on the spectrum and say you did nothing wrong. Of course I also can't stand coffee.", "NTA and this is by far the most Brooklyn story I’ve ever read. If you plugged “gen z Brooklyn work drama story” into chat got this is what you would get. I 100% believe that is is true. \n\nI don’t think you have to apologize. But now that you know, maybe ask him to make you a cup of coffee on the condition that the comments on coffee sitting on your desk are to cease forever and he is never to provide or offer to provide it - it’s by request only (and of course he’s free to say no). \n\nThen drink his coffee which likely will taste very similar to every other cup of coffee you have had, and tell him it’s great. Anytime in the future he annoys you or you need something you say “you know what I could go for right now? One of your great cups of coffee.”  Dude will be a big asset.", "Sounds like he was hitting on you, and it fell flat.  \n\nI get that he's upset, but you shouldn't need to apologize.", "You could say you didn’t mean to insult his special interest itself, but he needs to stop being rude when talking about it. Like the interest itself isn’t abnormal, but he needs to learn to stop when people say stop", "NTA. \nIf he's autistic and that's his Special Interest, he has no idea how intense he seems to alistic people. But, he means no ill by it either. \nExplain to him why you were upset by the way he approached you. Direct, straight forward, explanation - Don't try to soften things, or \"protect his feelings\", or any of the other typical alistic \"I want to talk about this but I am afraid being direct will be rude\" behaviors, just tell him nicely and directly. Be polite, don't be emotional, just explain how it made you feel, why it felt that way, and that you understand (now) that he didn't mean anything harmful by it. Tell him what your needs are for future communication, \"do this, not that\". \nApologize for being harsh with him, admit you didn't know he was autistic and don't understand the intensity of a Special Interest, but didn't intend to make fun of him or make him feel bad about himself. As another reply stated, the \"normal\" thing probably cut deep... He's neurodivergent in a world that absolutely punishes anyone whose neurology is outside the norm, because they aren't \"normal\". So, you should own that and make peace with this poor guy who just really loves coffee and connects with it in a world where it's extra difficult for him to connect with or understand things and the secret rules arrive them that everyone around him seems to.", "Lol you're NTA for the parker situation, but def an AH for stopping while already late.", "The coffee you drink absolutely sucks ass. And yet, NTA. \n\nMy relationship is similar. I’m a coffee “snob” and my significant other isn’t at all. I make mine and they make theirs. Who cares?\n\nJust because he’s autistic doesn’t make him more right. A disability or class or whatever oppression Olympics doesn’t count here.\n\nIt would be like if he saw you driving a Toyota while he drove a Chevy and made fun of you for it so you dished it back. Then on the elevator ride he said “well I’m trans so you need to apologize to me because you hurt my feelings over my Chevy”.\n\nFucking settle it like grown adults. Either way. NTA", "I think you can say Dunkin Donuts without it being a problem. No idea why youd feel the need to censor that.", "I think it's fair to apologize for embarrassing him. He also needs to apologize to you.\n\nIt sounds like he needs more work on socialization but that's way outside the company's remit as well as yours. It might be worth saying to him \"you're bothering me a great deal and you need to leave me along right now\" politely but firmly. If he doesn't listen, then it's time to involve your manager or HR.", "I have Autism and in a way can see both sides, but i think you’re right he went to far if he’s anything like me he probably wasn’t picking up on your social cues. Might be an idea to have a chat with him and explain that you didn’t mean to upset him and that you acknowledge that he was just trying to help but he went to far. Set a sort of boundary with him so that you can always express when he‘s over stepping. Thats what i’d want my co-worker to do.", "I think you should apologize for hurting his feeling, and tell him that you felt he was very rude to you about your coffee and you snapped because he wouldn’t let it go. I just think apologizing is usually a good thing to do when it really doesn’t cost you anything and keep the peace. Ask him if it is best to be direct with him if something is bothering you next time. I would give this situation a little grace because it’s all just communication issues and that can easily be fixed! I mean he could turn out to be a jerk but I try to give people the benefit of the doubt", "YTA: Autism special interest can be very hard to manage even for someone who is \"high functioning\".  That said you could have easily asked \"You are very passionate about this, why?\" Or better yet.  \"I see this means a lot to you, but I am burned out on this topic, could we maybe drop it?\" Instead you called him abnormal which could be translated by HR as attacking a disabled co worker.", "ESH", "NAH - everyone was coming from a different angle and no one is at fault. Look up the double empathy problem - autistic people and non-autistic people communicate well within groups but find it more difficult to communicate between groups. \n\nWe (autistic people) can be quite sensitive to humiliation (and being called things like abnormal) because it is used to punish us so he might feel bad in a way that seems disproportionate to you. I'm not saying you were punishing him or humiliating him on purpose BTW, I understand that you were trying to diffuse an awkward situation, but to him he was probably trying to share something important and then someone was mean to him. I am almost 40 and it took me a long, long time to learn when people aren't interested and I'm still not good at it!\n\nHe shouldn't have hassled you, but it is good that he talked to you about how it made him feel because now you can both try to communicate in a way that prevents both of you being upset. Maybe it would help to say to him (f2f or by email) that you are sorry his feelings were hurt and you understand he was trying to share something special to him, but that you found it very overwhelming and you didn't know how else to make him stop. However in the future you know you can just ask him to stop!", "ESH  \n\n\nMore Parker than you.  Did he need to go as far as he did? Absolutely not.  Did you need to shoot back instead of taking the high road and leaving it alone?  Absolutely not.  \n\n\nParker did the adult thing and let you know that you hurt his feelings.  Own up to it, apologize.  But also state that he insulted you and you were harmed (hence your act of aggression that hurt him), and that he needs to apologize.    \n\n\nBoth of you just need to take the opportunity to be adults and show compassion to each other.  At least Parker took an appropriate step and wanted to talk to you in private about it.", "I’m a bit of a coffee snob, but like… I love the iced coffee from the orange and pink place", "NTA, but I really wish people would work on their titles,  you *really* have to read this one to get the context. The title doesn't capture it at all", "NTA, did he even apologize first?", "NRA\n\nTell him he cannot use his autism as an excuse.\nIf he does not tell and gets offended.. sucks to be him", "I am a coffee snob with all kind of coffee gear at home. And dunkin makes a surprisingly good, dark roast, americano.", "NTA and it seems like he only divulged that he has autism is to make you seem like a bad person for not giving much thought about the coffee. Also if he has this elaborate coffee machine at work and says his coffee is superior then he clearly has enough sense and awareness to buy the things plus why is he so invested with money that could be spent on something like food. Coffee from any chain tastes the same to me but he went overboard", "He jh\nI i I", "NTA, and it would not hurt him to apologize. He wasn't being \"passionate\" about coffee, he was being difficult and not letting you enjoy yours.", "NTA kinda sounds like he was trying to ask you out and actually believed that talking to you like that would work...", "NTA OP.  Just because he may be on the spectrum doesn’t make him any less the asshole.", "NTA. It's fine that he's passionate about coffee and he's autistic, but that doesn't give him an excuse to be rude.\n\nMaybe redirect his focus to the fact that the way he was talking to you made you very uncomfortable and came off as very rude and he should not put down other people's beverage and food choices.", "NTA - Dang, Parker should chill. if he starts to make a big deal about it even more just apologise and get it over with, even if he doesn't deserve it its easier", "NTA  \nIn the should department, he should can it and scurry away.", "NTA. He’s autistic AND an asshole.", "NTA.", "I used to live in Brooklyn and Dunkin Donuts coffee was great, fast and cheap. NTA.", "I wish you would've told him you're passionate about donuts and told him to fuck off. NTA", "NTA. Tell him to quit being a dick.", "Nobody who has an official diagnoses for autism would ever say that to you. I’d personally be mortified and apologize nonstop about how I thought you realized I was joking.", "NTA. He was being rude and bullying to you. Being autistic isn't an excuse for behaving like a jerk. He's allowed to like nice coffee, he's allowed to make himself nice coffee. And you're allowed to enjoy the coffee you got at Dunkin. Your reaction was in response to his bullying, not his passion.", "The info dumping is classic autism.\n\nThe being shitty about you not drinking a coffee that meets his 'standards' is pure bullying.\n\nIf he wouldn't have done that to a man, its sexist.\n\nIts worth having a chat with HR, but someone needs to explain to this dude that if he goes off on someone, there will be consequences. HR are the someone.\n\nNTA, OP. He was being shitty.", "I try to avoid chains as well, you just get better coffee at most mom and pop shops, and Im not a fan of most corporations. But berating people over their choices that don't effect you is just rude and annoying.", "NTA but if he's out as being autistic, it might be appropriate to apologise for saying \"it's not Normal\" since that is an list ableist language and turns out Parker is, well, not neurotypical.\n\nThat being said, you now have allowance to make it very clear he also offended you. Eg, \"okay Parker I'm sorry I said what I said the way I said it, in hindsight I can see how that embarrassed you. However I want to clarify what I meant. What I meant was that I was really offended and exhausted by you reminding me multiple times throughout the day that my coffee was inferior or that I have bad taste. I honestly don't care as much about coffee as you do, and I appreciate it if your comments on what I drink are limited to one per day, if that. I snapped because I really didn't think it was any of your business, and I used the term \"not normal\" as a way to get you to back off. I realise now I could have just told you how I felt. I think you were being rude and crossing boundaries and I'd also like an apology.\"\n\nWhich you deserve. Sure he's autistic, it doesn't give him license to be a jerk. He just may not be as quick to realise he is being the jerk maybe?", "NTA> Being autistic doesn't give him free reign to be rude, demand apologises for being told, effectively to shut up about his coffee nor is a reason he can't apologise for how he acted first and then maybe out of politeness he might receive an apology back (though I think it's not needed).", "Idk - it’s tough if he actually is autistic. Maybe sit down one on one with him and explain to him that it’s rude to behave the way he was behaving.\n\nPoint out to him how his insistence is insulting your own tastes and preferences and that (while you may appreciate good coffee) not everyone has to like everything to the same degree. \n\nTell him he was embarrassing you by being pushy and so you felt you had to defend yourself. Ask him to apologize and then reciprocate the apology. Let him make you the cup of coffee.\n\nOr don’t… \n\nIt’s fucking work and it’s not your job to teach autistic people how to interact with other humans. Tell him to fuck off and stop bothering you or you will report him to HR.", "I have a friend with an autistic son and she is always reminding me when he's stepping over the line with people, which is often. So stepping over the line doesn't mean he gets a pass, it means you have to tell him or he will just keep doing it. So you told him. He stepped over the line. His passion is his passion, but he needs to know to keep it in his own Moka.", "I'm autistic. There's a big difference between passionately sharing your special interest with someone and being a complete cockhead over it. He chose the latter. Just because he has autism, it doesn't give him a free pass to be rude and then use the \"autism\" card to remove himself from any ill-doing. You were pretty tame all things considered anyway, NTA", "Nta\n\nYour co-worker would absolutely hate me.\nI can't stand coffee. It looks and smells like shit to me.\n\nHe owes you an apology for overstepping.", "Well he was trashing your taste in coffee so his autism doesn't protect him from his interest from being trashed as well if he is doing it to others. Pot kettle black so NTA.", "NTA. He'd have a point if he'd just enthusiastically talked about his special interest, but he didn't. He insulted you multiple times; you don't owe him an apology", "NTA. Also you don’t need to change names and ages, Conan. We can recognize Jordan Schlansky anywhere.", "I think you need to point out that HE needs to apologise to you for being rude to you about your taste in coffee etc. It's not his business to police what you like or don't like. I mean, I wasn't a fan of the coffee in the US when I visited, but you all seem to enjoy it and isn't THAT the point???\n\nI also don't know how good/bad dunkin donuts coffee is in the scheme of things and they do vary from place to place. I do know that our local Donut King has really good espresso coffees and when the right barista is on the lattes are delightfully delicious. Not as good as my favourite cafe's but pretty damn good. I wouldn't drink the latte's from macca's though. Bleaarc. Cheap beans!\n\nIf he doesn't do so then I wouldn't even bother contemplating apologising to him. If he does, it's up to you whether you want to do so as a relationship mending measure.\n\n&#x200B;\n\nYou are NTA", "NTA.  Someone once said I have a coffee ritual. That doesn't give me the right to look down on someone else's preference. You don't need to apologize...explain that he hurt you as well by criticing your choice and you guys adde even.", "NTA\n\nThe language he used in the elevator tells me he's gotten a lot of work for his autism. He knows the way he was talking about you is not ok. Autism and special interests are not an excuse for harassment like that", "NTA. if he just discussed it with you, you could apologize for misunderstanding but the fact that he insisted that you need to apologize only means someone should learn some manners and it's not OP.", "NTA. Autism doesn’t give you a green light to be rude", "NTA why doesn't it matter that he hurt your feelings?", "Reading the top comments is blowing my mind. YTA", "NTA. He knows he's autistic, so he should be self aware enough to examine the interaction and figure out that he was the one out of line. Petty me would have responded with \"You hurt my feelings by insulting me with comments like not knowing good coffee if it hit me in the face. Sounds like ***you*** owe ***me*** an apology.\"", "NTA. Dude needs to chill. He gets a little leeway for being autistic(he may have thought he was being funny or sharing an inside joke, or genuinely helping), but when you called it out, he went passive aggressive on you. He veered into harassment over your coffee and that wasn't okay.", "Most sane Melbourne coworker.\n\nJokes aside, NTA. Regardless of his interest he should understand that insulting someone is not the way to go about sharing it.", "NTA You don’t owe him an apology. Maybe he didn’t know his behaviour was inappropriate, now he has been told.", "NTA. He was being mean to you, and bullying you over something ridiculously insignificant. Maybe he’s autistic, but that doesn’t give him the right to bully you about your coffee. All it does it explain why he knows a lot about coffee.\nIf the coffee is good to you, enjoy it. He seems to have missed the lesson about how different people like different things.", "NTA, and it's about time that Parker learns that \"I'm autistic so I'm allowed to be an asshole about this\" isn't actually a valid excuse for being an asshole.", "NAH\n\nYou weren't rude but Parker thought you were.  Your other co-workers also have noticed his traits and it's coming from his autism.  But it sounds like his ASD isn't common knowledge.\n\nSomeone without ASD might've just laughed along because they recognise that they are being way to intense for something that doesn't warrant it for others.  He's struggling with social norms.\n\nI'd probably ask him to make you one of his coffees so you can compare.  Then tell him how great it actually is while the others hear it in the tea room.  That will probably make him feel a bit better about the situation.", "NTA.\n\nThere should be a banner along the top of this sub's page that states \"Autism is no excuse for assholism,\" and it should run 24/7.\n\nParker's autism is not the problem here; his own rudeness and pomposity over *coffee* is the problem. He can be passionate about it all he wants - on his own time, in his own space. Not in the office. You don't owe him an apology.\n\nPersonally, I love Dunkin' - it's a religion here in the Northeast US, and anyone lecturing us on specialty coffees would likely have an iced mocha latte dumped over their heads by day's end.", "https://en.m.wikipedia.org/wiki/Ziltoid_the_Omniscient", "You both need to apologize. He's on the spectrum and doesn't going to pick up social cues well. He needs to think about other people's boundaries. You had every right to be pissed off that your boundaries weren't respected, but you could have communicated that in a way that didn't attack him.\n\nIt's also a situation that should be deescalated without getting HR involved.", "As someone obsessed with coffee, his behavior is uncalled for and I would prefer to be snobby over a small business than a corporation", "Just talk to the guy. Surely, when someone tells you that you hurt their feelings— even if it wasn’t your intention— you would feel a little remorseful. Also, he disclosed a disability, which isn’t easy. As someone with autism, I can empathize. We do get obsessed about particular things. Is it possible that you interpreted his comments as rude when he didn’t intend them to be, either? \nHere is where the need for a conversation comes in. “I am sorry if I hurt your feelings. That wasn’t my intention. I felt a little under attack, and it that wasn’t your intention, perhaps we both need to be more careful with our words going forward.”", "NTA. I love coffee and only go to DD when I'm in a hurry. i usually can make better a home, but some times I'm lazy or running late. I'm not about to shit on people who love it. What you like has nothing to do with me! Your coworker sounds insufferable", "\"Look, pal, nerd out over coffee all you want.  But fanboying like that to people who aren't into it is annoying.  It's like asking who would be hotter as animorphic ocelots, Kirk or Spock.  Sometimes that conversation is interesting only in your head.\"", "It really seems like Patrick's complaint here is that the OP insulted him having a special interest in coffee by saying it's not normal to be that intense about coffee. You could replace \"coffee\" with anything else and it would be the same problem - the implication he is abnormal*. Sometimes people with special interests need a gentle nudge to tell them to drop the subject. The OP's response was rude, which is understandable when she feels harassed and wants it to stop, but it did lead to some laughter from coworkers too. \n\nIf the OP would like to apologize, it should be for not communicating more clearly. \n\"Patrick, I misspoke the other day. I was trying to communicate that you were making me uncomfortable by repeatedly commenting on my coffee. If it sounded like I was insulting your special interest, that wasn't my intention at all and I apologize for that. In future, I will try to be more clear but I also ask that you don't make negative comments on my coffee choices, okay?\" \n\n\n\n\n*Before someone says it, yes statistically autisitic people are not the \"norm\" but that doesn't mean it doesn't hurt to hear you're \"abnormal\".", "[removed]", "this is the way. he's autistic. bluntly explaining the truth to him is the way to go. he'll internalize that so much easier and more fully than being made fun of. he probably didn't realize he was being rude and will be devestated he came off that way. if he's not upset with himself for missing the cues, and making you feel bad then he's the ass hole. otherwise NAH", "Yeah, if anything, he should have apologised and explained that it wasn’t personal, it was just his special interest, and that he will try his best to not repeat the behaviour in the future now that he knows it makes her uncomfortable. It could have been a moment about the importance of communicating boundaries clearly to him and a positive reset from the day the before.", "THIS!", ">You don't know if I am autistic and D.D. is my safe food.\n\nLOL, yes, this would be PERFECT.", "I came to say this. My husband and I are pretty into coffee, and would totally tease one another about getting “bad coffee” something like “wow, you must have really needed coffee to get it from there!” But would never do that to someone else. We did however rate all the convenience store coffee in order from best to worst and I’ve had someone ask me which convenience store they should go to if they’re just getting black coffee lol so I like to think we’re helpful in our obsession.", "I’m like you honestly, I love coffee, I’m snobby about it FOR MYSELF and I don’t really give a fuck what other people drink. There’s a Dunkin around the corner from my office and my coworkers go there sometimes (mostly cause it’s the cheapest place in midtown NYC). They invite me sometimes. I say no thank you. It’s really that easy.\n\nBut I do agree with the coworker that Dunkin coffee is fucking disgusting (where is the coffee flavor??? It is brown water) and I would never drink it.", "especially when Parker was bean such a massive AH.", "I see what you did there  lol", "Going to concur with this considering at a much earlier stage of my life I was the \"Parker\" but I had a good boss and excellent understanding coworkers who helped me be me whilst guiding me to better understand that I may need to limit some of my passions around others as they may not be interested at all in the same things. \n\nI will also concur that being told your abnormal does indeed cut deep, you will never be normal no matter how hard you try or mask and you will have to accept that people will notice that and call you out for it as they will not know your difference. \n\nEven if there's no further interaction going forward the op is NTA however an olive branch apology with the condition of \"I will always point out when you're taking shit too far\" I know I would appreciate that situation as that's what I got. But again that's not your job and doesn't change the NTA either way if you choose not to.", "Autism is not an excuse to be rude. Though I wouldn’t suggest he is faking his autism for “convenience”.", "I like this solution", "She didn’t know he was autistic", "You do know that OP is the one who wrote this, not Parker, right? So Parker has no way of knowing you're telling him to leave OP alone.", "he wasn’t just trying to share something, he was actively being a dick. Being autistic doesn’t excuse this stuff. I’m autistic, I’m well aware that we can be insufferable when we don’t know when to quit talking, idk how he hasn’t learned that yet, or how he got a job like this", "i thought that too until op mentioned that he has coffee making materials at the office", "That was my first thought too. This was a misguided and creepy attempt at flirting.", "I honestly thought this myself as I read it :(", "As a counterpoint, as someone who also has a lot of special interests and poor social skills, I'll still argue that Parker is being too sensitive here.\n\nI've been told multiple times that it's \"not normal\" to be as obsessed as I am about some things. Do you know when I'm told that? It's when I'm not getting the hint that it's time to shut up about my interests. I don't take it as a personal attack against me or my interest; I recognize that they're (correctly) saying that it's not a good thing to keep talking about your interests when nobody's interested.\n\nInstead of OP apologizing, she should probably explain to Parker that she wasn't insulting his interest, but rather returning his teases and making it very clear she was no longer interested in hearing about how much he was judging her choice of coffee.", "The OP, apologizing to Patrick after he repeatedly insulted her? Well, if she doesn't respect herself the slightest bit, that might be an option.\n\nPolitely informing him her response was about his harassing behavior rather than his tastes is one thing — the right thing to do. *Apologizing* after he verbally pissed all over her tastes, which were none of his business in the first place? Only after he apologizes first for being an AH to her.", "I disagree. I have autism, it does hurt to be told you're abnormal, but OP said it's not normal to be this \"intense\" not \"you're abnormal\". If he hadn't been so rude all day then it wouldn't have even come to that. OP doesn't need to apologise - if I were Parker, I'd take it as another social lesson in the seemingly endless cues and whateverisms I seem to miss all the time. He needs to realise that his behaviour didn't come off as he wanted and take something from that. It sucks but just because we have autism it doesn't mean we can just stop trying to learn social skills and become stagnant and rude people. And I speak from experience, it's HARD but you have to keep learning.\n\nUltimately, if you think OP should apologise for miscommunicating then so should Parker x10 because he was being nasty all day and OP said one thing after reaching their limit that wasn't even rude, just short which most people would be at that point. Autism isn't an excuse, it may help explain things but you don't use it to get out of jail free so to speak.", "The thing about normal is that it is actually statistically very abnormal to actually be normal.", "Yes, this! Make it clear you weren’t intending to disrespect his special interest, your only issue was that he kept pestering you about your own preferences. Even his offer to make you a coffee was tinged with insult, that’s what’s the issue.", "Great response", "The way you are directing her to speak to him sounds like someone speaking to a particularly dumb and sensitive child, not an adult co-worker.\n\nOP did not say anything rude or impolite. They were trying to fob off Parker's harassment by making a joke about it.", "Over here! We've got a bot! Found one!", "I am super into coffee. And tea. I like everything particular. \n\nThat doesn't give anyone the right to berate you. There's ways to share a passion like that without scolding someone for their tastes - everyone likes different things.", "This is the way. It's one thing to be helpful in your obsession, but quite another to demean other people who don't share it.\n\nYou've dangled it out there, and now I'm curious - care to share what your top 5 convenience store coffees are?", "Actual conversation between me and Mrs. Baka (she doesn't drink coffee) on a long drive:\n\nMrs.: Do you want a cup of coffee? There's a Dunkin' at the next exit, they have coffee.\n\nMe:  I can wait.\n\nI know there are tons of folks who like it, but I'm not one of them.", "I am genuinely curious here. Not trying to “gotcha” here or anything.\n\nI understand that people on the spectrum can experience difficulties social cues and/or reigning in their special interests, and can sometimes be blunt with their phrasing. But in Parker’s case, I’m having difficulty understanding how he would not find things like “You wouldn’t know good coffee if it hit you in the face” or “You’re crazy for drinking that trash” as anything but mean or rude.\n\nLike it would be one thing if he just, I dunno, rambled on about what coffee beans he finds the highest quality, or his top 5 coffee places, but he didn’t do that.\n\nIMO, if you feel like something you’re interested in makes it okay to insult someone to their face like that, I would also consider it abnormal, neurodivergent or not.\n\nHow does someone on the spectrum process speaking to someone in this manner?", "I agree. OP is NTA but could apologize for using the word not normal, on condition that the guy first apologizes for antagonizing her over her coffee choice.", "Exactly. Not OP’s job. Google is Parker’s friend. He can read all about how to stop being inappropriate at work.", "I had to read your sentence a bunch of times to figure out you were using \"people\" as a verb.", "Op snapped at the coworker when the coworker was simply emphasizing their quirky like of coffee....OP could've just said \"no thanks I'm good\" instead they implied the coworker was weird \".... it's not normal....\" Oh yes it is normal to be a coffee savant... perfectly.", "I didn't say that it excused him. I acknowledged it was an awkward communication that made OP feel uncomfortable. That's not OK. However, I am approaching the situation with a level of empathy for *all* parties and explaining how it may have occurred so that it might be avoided in the future. I would have really benefited from some compassion when I was developing social skills at a slower rate than other people (I still benefit from compassion when I get it wrong now). As for \"idk how he hasn't learned that yet\", you must be aware that not every autistic person is able to develop or use the same set of skills? And that one of the ways we develop is by people telling us we got it wrong? Hence me suggesting she explain to him that she felt uncomfortable, so he has that data for the future.", "I am not drinking anything someone that intense gives me.", "Lmao hr my coworker noticed my coffee cup, arrest him for rape.", "NTA he has to learn boundaries", "Yeah, my first reaction was that he was, very, very awkwardly, hitting on OP.\n\nDoesn't seem like that, though.", "I mean, I'm somewhat familiar with the coffee scene. People really are just this intense about coffee and truly see bad coffee as an offence, like socks and sandals, or crocs, or pickle ice cream, or pairing stripes with spots, or whatever other fashion and food atrocities there are people feel strongly about. Like putting ketchup on pasta in front of an Italian person, or putting pineapple on pizza. If he's anything like most coffee enthusiasts, he cares more about the relationship between you and coffee than anything between you guys.", "Wouldn't be surprised if he's one of those that thinks 'oh, OP just needs to go to pound town, and I'm the right man for the job to turn her straight'", "LOL not saying that's the case, but some men think that's just a bonus/he can turn you straight/you'll miss xyz. So I'd definitely put some space in between you and coffee guy, because making you a drink is a way too \"nice guy\" move.", "YES! I was just thinking that it would be a totally different story if he saw the Dunkin cup and said to OP: \"Hey, I saw you grabbed Dunkin. I have a moka pot in the break room, and was going to make some coffee, do you want a cup?\"  \n\n\nThat's a nice way to do a favor for someone and not make them feel bad. And also not be creepy or harassing while still showing off his coffee skills.", "Agreed. I have special interests I won't STFU about sometimes, but when someone loses their cool at me I'm always embarrassed and the one doing the apologizing later on. I might disclose the condition that makes me hyperfixate and miss social cues, but only as an explanation for why \\*I\\* made a faux pas—not them.", "I live in Japan, and we just rated the major chains, but it was 7/11, Lawson, Daily, K, then Family Mart. Since then Family mart bought out K and changed their beans so I personally think their coffee is better than Lawson now, but 7 is still the best.", "Happy to answer especially as this example behaviour will become more common unfortunately for reasons I'll explain.\n\nBasically I was lucky I suppose that my diagnosis was much later as an adult, but my father was also diagnosed at the same time and already in his final years in the military, as was my younger brother who was still a young just coming into teenage years and then my youngest of my younger sisters (1/4 kids neurotypical ). So whilst we all got the benefit of \"that explains so much\" it never changed how my parents raised us beyond the typical stricter on the first child. We were still expected to be kind, considerate, generous etc even if we didn't understand why we had to be. Our world views were challenged again and again, the slowness in our understanding and remembering to be this way was accepted compassionately and obviously selfish, mean spirited behaviour was punished. \n\nWe were taught how to talk to people fairly , how to try and understand it from their point of view , to attest to how slow we are in this regard it's taken me 30 years to truly put myself into someone else's shoes and understand it. I understand the benefit of how I was raised and the disadvantages of how I see so many other children in my position being raised where the parents are bowing to instead of challenging the world view of their divergent children as it's easier and results in less meltdowns. You can still discipline autistic and ADHD children and hold them to the same standards as typical children (level of how autism affects them dependent of course) you just need more patience and to be gentle about it.\n\nThe golden rules I was taught when talking to people\n\n1. Is it true ?\n2. Is it necessary?\n3. Will it cause no harm?\n\nIf only one of those statements is a yes then don't say anything.\n\nAs more and more parents use autism/ADHD as a method of excusing their child's behaviour instead of taking the longer and harder path to help actually fit better into society they inadvertently teach the child that society should fit around them rather than fitting around each other.\n\nTo Parker he cannot understand why on earth would the OP enjoy terrible coffee , she must indeed have something wrong  in her head as that is the understanding his parents have inflicted by excusing his behaviour and bending  the world around him and by never forcing him to challenge his world view as far as he's aware this is the only world view.", "🤣🤣🤣 sorry", ">He started going off on my taste, how I wouldn’t know good coffee if it hit me in the face, how I was crazy to drink that trash at various points throughout the day.\n\nCoworker was a rude ass.", "Quirky!~", ">As for \"idk how he hasn't learned that yet\", you must be aware that not every autistic person is able to develop or use the same set of skills?\n\nIf he's capable of going through school and getting a job, then he's capable of learning the skills needed to not harrass his coworkers. At 27 years old, it is his responsibility to access the tools and resources he needs to be able to succeed in life, and that includes making sure he knows the correct way to treat his coworkers. It would be irresponsible of him to enter the workforce if he isn't aware of how to follow the rules.", "Yo me too, and he is a HR violator.  Its called harassment", "Me too.", "Yep sometimes people just won't learn unless they have experiences like this one. Absolutely NTA", "Definitely this. \"Did you want some of the coffee I make. I'm already making it...?\" Has a way different feel than \"You *have* to let me make you a cup\"", "ありがとうございます", "Ahhhh, okay I understand! I was so focused on the “social cues” aspect, I hadn’t taken a step back and thought about it in the whole manner of being raised, but that totally makes sense now. It also makes sense possibly why Parker responded the way he did, and blew off OP saying he didn’t need to be rude about his special interest.\n\nThank you for explaining in such a detailed manner! Sounds like you had some really great, patient parents!", "No he wasn't..... it's like calling a sports fan weird for being passionate about football...OP is TA, they could've rolled their eyes and walked away any time.... but they unnecessarily insulted the coworker", "But your username.. think of all the chats you could have about coffee. 😂", "So your saying that it's ok for a coworker to constantly talk crap about how you drink your coffee?", "Slack here would be accepting his apology, except it doesn’t seem like he gave an apology in the first place. Just as maybe Parker didn’t realize that he was being rude, OP didn’t know that Parker is autistic", "I'm saying OP needed to walk away.... THEY were out of line", "Why did op need to be the one to walk away instead of coffee guy"]}