{"id": 27439, "submission_id": "16ppdel", "title": "WIBTA if I tell my girlfriend I don't want her taking drugs.", "selftext": "So I 23M and my girlfriend 21F arent seeing eye to eye when it comes to consumption of drugs. To give a little background we both drink alcohol and smoke weed on a fair basis so when it comes to \"special occasion drugs\" I only really think of magic mushrooms as a go-to.\n\nShe has an upcoming girls trip where they are going to a music festival and she has openly expressed a desire for her and her friends to take Molly or Extacy at this festival. However I feel I have a pretty solid line that I have been more than vocal with when it comes to hard drugs. Especially since hearing and witnessing coutless stories of people accidentally ODing, taking one drug thinking it was another, and knowing that people cut drugs with worse stuff, I don't feel comfortable with her taking drugs like this, especially since I won't be around. I worry about her safety since she is quite naive when intoxicated and the friends she is going with don't really have any regard for her safety when they are intoxicated (this is from numerous of past stories I could but won't tell) \n\nSo, would I be the asshole if I put my foot down and told my girlfriend I don't want her taking drugs at this festival?¿\n\nEDIT: I appreciate all the input everyone has given. A lot to think about. To clarify, when I mentioned hard drugs as Molly/Ecstasy I was naming those as the more common ones. She has also mentioned cocaine use and ketamine. (also we do shrooms together every once and a while. That is where my line is drawn. Secondly, when I said \"putting my foot down\" I mean in a sense of I am giving her the ultimatum because she can choose the drugs or me because I'm not comfortable being with someone who puts themselves in unnecessary danger for the sake of it.", "created_utc": 1695426674, "permalink": "/r/AmItheAsshole/comments/16ppdel/wibta_if_i_tell_my_girlfriend_i_dont_want_her/", "score": 68, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Would I be the asshole when I tell my girlfriend I don't want her taking hard drugs at a festival. \n\n2) it might make me an asshole because I would seem like a controlling boyfriend by not letting her do what she wants to.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NAH. You’re allowed to express your concern and ask her not to do it. You’re also allowed to decide that this is a dealbreaker for you and you’re not interested in being in a relationship with someone who uses hard drugs. At the same time, she’s allowed to experiment with drugs if she wants to. You cannot actually prevent her from doing it. Just let her know that this is a dealbreaker issue and talk it through.", "NAH. \n\nYou have every right not to be in a relationship with someone taking drugs that bother you. She has every right to do with her body what she wishes. \n\nThis is a relationship dichotomy and you get to choose which side you’re going to die on. If it means that much to you, and it seems to, then it sounds like you’re single and just haven’t realized it yet.", "NTA. Die on this hill, OP. No reason to invite danger. I actually have several friends whose children accidentally OD-ed. I'm an average person and, still, I have several formerly average friends who are now bereaved and will never get over it. I always tell my kids, why take drugs? Why? You can drink or smoke weed (within reason and not driving), but why would you want to take any hard stuff, it's ridiculous. Perhaps if gf is insistent, she's not the one for you.", "NTA\n\nPeople saying you are, are at best misguided*,* at worst they aren't looking at it from your GF's best interests.\n\nHard drugs should be a hard stop for any relationship. Much less hard drugs at a festival that could have who knows what cut into them, not to mention tons of malicious guys trying to take advantage of your GF or her friends.\n\nShe's obviously naive--she's 21. \n\nYou can't really stop her though, but you can make it an issue you'd end things over.", "NTA. This is not something to fuck around with. This is the hill to die on. I am a perfect example of why you don't screw around like that. When I was 28, I had \"friends\" who didn't value me as friends should. We did something together. I don't know what it was. It was put in my drink, I was told about it after the fact. My \"friends\" didn't get me home safely, even though they were my ride. I woke up in a strange place, with people I didn't know, I had been horribly assaulted. I won't go into details, except to say it was bad. When I was finally released from the hospital 3 days later, because of how beat up I was, my \"friends\" thought it was funny. \n\nThis isn't something she should do with people who don't value her. She shouldn't really mess around at all. People cut stuff with other stuff, she could end up a lot worse off than I was.", "NAH but don’t be surprised when she doesn’t budge because her behavior won’t change unless she wants to and she’ll just do it behind your back", "NTA - Like you said, you have a line and need to voice that to her. If she doesn't agree, maybe she isn't the one for you. Relationships are about respecting each other's boundaries.", "Run away dude. Been there, done that. It doesn't work with you \"putting your foot down\".\n\nAs others have stated on here, that's you trying to control her. It doesn't work. I've been through Hell and back with my ex over drugs and alcohol. If it's something they want to do, they're going to do it.\n\nI put my foot down when I was with my ex wife. Didn't matter, she did it anyway. We went to counseling and they told me that I couldn't control her actions, that I had to let her be the one that wanted to change. She claimed she did but it never happened.\n\nAfter 3 years of Hell, I was out. I drank and smoked a little weed, but that was it. Drinking, smoking, taking acid, downers, shooting up speed, that was too much. \n\nYou're not an asshole for being concerned about her, but ultimately, it's her decision.", "The real question 🙋🏻 is what are you going to do if she does? By evolution, or by God, people have free will. It’s not how she chooses to exercise hers, but how YOU exercise yours, when she does.", "mmmm. this is very complicated. on one hand, i very strongly believe that, for the most part, (unless it's like become a Serious Problem) adults should be allowed to make their own decisions re: substances. i don't consider MDMA a hard drug AT ALL. but! i do understand that drugs are socially unacceptable and a thing that people should be careful with. it sounds like she's never taken MDMA before? being in a crowd of people with friends that are also high doesn't sound like the safest place to experiment.....\n\nidk. i see that you're just concerned about her well-being so i'm going with NTA. maybe if she takes it around you first so she's safe it would be a better idea?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I 23M and my girlfriend 21F arent seeing eye to eye when it comes to consumption of drugs. To give a little background we both drink alcohol and smoke weed on a fair basis so when it comes to \"special occasion drugs\" I only really think of magic mushrooms as a go-to.\n\nShe has an upcoming girls trip where they are going to a music festival and she has openly expressed a desire for her and her friends to take Molly or Extacy at this festival. However I feel I have a pretty solid line that I have been more than vocal with when it comes to hard drugs. Especially since hearing and witnessing coutless stories of people accidentally ODing, taking one drug thinking it was another, and knowing that people cut drugs with worse stuff, I don't feel comfortable with her taking drugs like this, especially since I won't be around. I worry about her safety since she is quite naive when intoxicated and the friends she is going with don't really have any regard for her safety when they are intoxicated (this is from numerous of past stories I could but won't tell) \n\nSo, would I be the asshole if I put my foot down and told my girlfriend I don't want her taking drugs at this festival?¿\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO what does it mean for you to put your foot down? Does it mean you'd exit the relationship if she does those drugs? If so, I think it's fair to say \"I can't be with someone who does these drugs.\" \n\nYears ago I had to tell my best friend that she could either continue doing coke with a shitty new guy she met or we could be friends, but that I had no interest in watching her piss her life away. She chose the coke and the shitty guy for a while before he fucked things up enough for her to leave. We reconnected about 6 months later, and I miss that time we wasted, but I'm still glad I set that boundary.", "NTA.\n\nJust remember if you try and force her not to, you will look like an over controlling partner, just say \"you do you but that shit doesn't align with my values and it's a deal breaker\".\n\nIf she decides to ignore you and or call your bluff just leave don't yell don't try and guilt trip her just nope out, and move on.", "In this case I am strongly on NTA side. My bf has done the same thing, went to parties and did a lot of drugs. When I found out I was furious. Not only is it illegal, as you said it’s highly dangerous I wouldn’t want to put anyone in that situation, so I don’t blame your concerns. I don’t think you can really control her actions, she may say she didn’t but does it anyways. It’s kinda a hope for the best situation here.", "NTA. \n\nI’ve taken Molly and Extacy a few times when I’ve gone to raves in the past and it may be fun for a few hours, the next day is some of the most depressing shit Ive ever been through. Thank god I was around friends that looked out for me while I was under the influence. \n\nYou’re clearly concerned for her safety and nobody can stop you from feeling that way.", "Yes. YWBTA. She is an adult and she makes her own decisions. You’ve expressed your concern and she disagrees. Any further insistence is controlling. If you don’t like the choices she makes, you are absolutely free to decide to not be with her. But the idea of “putting your foot down” to your partner when she says she wants to do something is…a mess. She is a grown up. You are her peer, not her daddy.", "NTA.\n\nThis is a reasonable line to have. If she crosses it & you’ve made your position clear, you actually need to do the follow through & leave.", "[deleted]", "YTA You can say you don't like the idea of her taking drugs, but ultimately it's her choice and you don't get to \"put  your foot down.\"", "NTA. Having boundaries is never a bad thing and making that clear with her is all you can really do. The rest is up to her.  If she respects you as her partner she would sit back and consider not taking the drugs. If she does end up crossing that boundary, stay firm on your decision, if you back down she’ll see you was a doormat.", "NAH, I think I'm in agreement with other she is free to do as she wants and you are free to CALMLY and in a non-controlling manner express that you are concerned for her safety and that her going ahead with this may be a dealbreaker.\n\nI did also do a cursory search because I swear I heard at one point that personal use test kits exist to check what one is about to take. I found one study that suggested such kits fail to distinguish pure \"safe\" mdma and one tainted with something else. So, if there is even a trace of it it will just read positive and that's it. I'd suggest you do your own research into it, MAYBE there is a good one out there. If not, then also a good bank of evidence if she tries to excuse it by saying those exist?", "When I was in high school I would say chill out. However now I'm in my early 30s and I can say without a doubt that taking these drugs are way more dangerous because of all the fentanyl. Honestly it's just not worth the risk imo. \n\nTo me it's not a question of whether you should put your foot down or not. She's going to do what she wants to do regardless of what you do. Putting your foot down is only going to drive a wedge between you two. I would do some hard research on the subject educate her on the dangers and how to test the drugs etc and let her make her own decision.\n\nOf course she probably won't want to listen to you being 21 and wanting to go out with their friends and do drugs at the music festival anyway.\n\nYou have to decide whether you want to stay with her or not if she decides to do the drugs. \n\nDo some research and look into it. \n\nMaybe get yourself a girlfriend that doesn't have only girls outings with her friends and other random strangers who are men in settings where men approach women with sexual motives, where you're not invited or allowed to be there with her. that in itself is a pretty big red flag.\n\nIf I were in your situation I would probably break up with her and find someone else. Find someone who isn't going to hang out with other men and put the relationship first. Up to you of course but this is what I would do. I like to be in a relationship where I'm included in things.\n\nMost high value men won't take any girl seriously who does that, they will bang them sometimes but they won't ever take them seriously.\n\nMake sure you set proper expectations. Otherwise you're going to be doing whatever the heck you're doing while she's out at the music festival on drugs and you're going to be worried about more things than drugs.", "My friend oded on ketamin when it was mixed with too much alcohol. It wasn't anything else just strong ketamin and alcohol. Similar shit can happen with molly. You can't put your foot down and forbid her and lock her in her room so she can't go but you can advise against it and break up with her. People get too casual with that shit. Nta.", "NTA she should be thanking you", "Sounds like people here have no idea what they are talking about. Things you should be talking about are having test kits for her & all her friends, and also agreeing that mixing drugs, ESPECIALLY alcohol with anything else, is an obvious no-no. They should have a plan on where to meet if they get separated, one that doesn’t rely on phones. Other than that you need to chill and trust her, or decide that it’s worth breaking up over. These things can be a wonderful experience and she doesn’t deserve a partner that wants to baby her", "NTA at all did I read going to Mexico and taking drugs.If I we're you I'd go to any length to stop her.I mean you can't keep her locked up.I am a recovering drug addict and once I chose to use all bets are off\nDeath,jails and institutions.But on a sad note no one could tell me no so I used and by God's grace I never lost my life YET=Your eligible too.If I chose to use drugs I don't get to chose the consequences.", "YTA. You have a solid line about drugs, but it is up to her to decide where her line is.\n\nWhat is a hard drug? Anything that you wouldn't take? I don't use drugs at all, not even that killer alcohol, but it is up to each person to decide as adults. Take her as she is or set her free.", "YTA. It’s one thing to express your opinion and hope you guys have the kind of relationship where she will respect you and the fact you’re not comfortable with her doing those particular drugs. \n\nIt’s a whole other thing “to put your food down” and tell her she CAN’T do those drugs. That is 100% not your place as her boyfriend.", "A party girl gonna party. NTA", "YTA to yourself for being involved with someone who wants to take hard drugs when you don’t like it. \n\nYour decision is whether to continue this relationship.\n\nHer decision is whether to take hard drugs and whether she wants to be with a man so controlling.", "Drugs are bad m'kay", "NTA I don't know where I got Mexico from but read my last response please do what you can if you can,but also remember we can't always stop people especially the ones we love.Im in recovery and drugs are serious buissness.", "NTA OP. Anyone can press a pill these days. What they take may not be ecstasy or Molly.  Your feelings and thoughts are valid. If she does it anyways/persists bro let her go. Addiction is real, fentanyl is real, and it’s just not worth the risk.", "Am I the only one that doesn’t consider party drugs like Molly or Ex “hard drugs”? like personally I don’t do them, but I *would* place them on the same tier as magic mushrooms", "YTA for trying to make it a rule.\n\nYou aren’t an AH for caring and being worried.\n\nSeveral people here are talking about boundaries. It’s not a boundary when you are trying to change someone else’s behavior. That’s a rule. Rules don’t work really well in healthy relationships. \n\nYou can tell her how worried you are.\nYou can tell her how uncomfortable you are with this idea and how much you disagree with it.\nYou can tell her why.\n\nYou can’t tell her no. You can’t tell her she can’t. She isn’t your child.\n\nIf she takes the drugs you can exit the relationship.\nThis is a boundary. \n\nIf she takes the drugs and something bad happens you can exit the relationship or be there for her her. Also a boundary.\n\nWhat you shouldn’t do is say I told you so or stay in the relationship and withhold support and affection in retaliation for her taking drugs.", "anyone calling you the AH needs to seek out NA meetings asap", "YTA. You don't get to \"put your foot down\" about her choices on what she does with her body. You can express your concerns. Maybe encourage her to have a more specific conversation with her friends about what their plan is. Like, are they just planning on buying x from the first rando who approaches them? Maybe schedule regular check-ins/communication.", "YTA if you mean that you think you can tell her what to do and she should do it. (I personally think you should both cut out the weed and the alcohol, all that stuff is bad for you). But you don't get to make choices for her. If you don't want to date someone who uses Molly or Ecstasy, you can let her know that and break up with her if she chooses to go ahead. But that will be a NAH situation. She can do whatever the fuck she wants and you get no say in it, even if you're giving her good advice.", "NTA, with the caveat that you should be careful about how you communicate your concerns to her. There’s nothing wrong with communicating openly and honestly with her about your worries regarding her safety and well-being, but be sure not to say it in a way that implies that she isn’t “allowed” to do drugs. She is an adult and has the right to make her own decisions, but she should also be aware of how her choices will affect you and your relationship going forward, which she can’t know that unless you tell her. And if the decision you makes leads you to no longer be comfortable being in a relationship with her, you have every right to end the relationship. Although she has the right to make her own choices, choices do come with consequences, and sometimes those consequences can unfortunately include the end of a relationship.", "Forget that question. The bigger question is why are the drugs in there at all. Shes out.\n\nAlong with the drugs. It has to be that way. I am a former pain patient and exclude people who exhibit drug talk or other tells indicating they are a liability to me and mine. Ive had nothing for a couple of years and dont plan anything in the future. Ive not been around girlfriends and drugs scene for little close to 50 years now. I am a old trucker and under the new clearinghouse regulations anyone that tests hot will be out of the industry essentially for life.\n\nCombine that with the medical enforcement against proper legal drugs. Its a impossible situation. Which is why people like your friend and drugs need resolving now while you two are younger.\n\nThe problem with ordering someone to not do something will create conflict to the point that they are going to really go to it. You aint seen whats coming back you after yet. And there lies a range of problems including death, injury, imprisonment and all that mess.\n\nIts better to try and live a life without drugs. Im not going to preach, but Ive lived long enough past the point where even lawful drugs are not given out anymore by doctors or anyone. And the People where i live consistently fail to vote drugs to become legal for a variety of good reasons.\n\nWith that said, there are places in the USA where you can find the drugs you seek that are lawful at the State Level but never at the Federal Level and there lies the conflict. If you dont work a federal public safety job theres no problem.\n\nFinally but not last I have seen younger people including those my age get destroyed by drugs. I myself carefully considered end of life one night due to conflicts with stupid doctors who are dealing with a hard state enforcement problem with medical drugs. Im still here. And have no drugs at all. Might get a few more years out of this yet.\n\nGood luck.", "You are maybe not an AH for your concern but you are most certainly a hypocrite, mushrooms are every bit as dangerous. I'm not doom-mongering, I've done piles of both, she's probably talking the lesser of two evils unless it's cut with rubbish and that's the risk you take. You can't exactly argue if she throws mushrooms back at you, if you can swallow that and agree I'd say you're a decent enough guy but at the minute I'm not sure I believe your reasons", "I'm going to say NTAH here because of your concern, but you do seem to be trying to control her.  She is an adult.  How would you feel if she asked you to stop doing mushrooms for whatever reason?", "Hard drugs? Let me get this straight, whatever drug YOU want to do is fine, but when she wants to do it, it's a nope??\n\nThat isn't a hard drug ffs \n\nCocaine is a hard drug\nMeth is a hard drug\nHeroin? Yup. Opiates? Definitely \n\nMolly? Fuck no omg quit being such a ween it has the same effects as mushrooms\n\n\nAnd everyone saying NTA you have EVERY right to control what she does and doesn't do??? Pshhh", "NTA.\nI told each gf I had that I won't be with them if they used drugs.\nI've been 100% drug free my whole life and I expect my wife to as well", "While I do not condone hard drug use, especially given the environmental we are in with fent being in every fucking thing, YWBTA for forcing her to comply with your wishes just because you’re not around. What would you do if you were there? Drug test the Molly? Knock or out of her hand? Knock her out to stop her?\n\nBoundaries are there for to let others know the expectation of your reaction to their actions. Not to force others to follow your orders. If you don’t like her actions, your reactions can be to leave the relationship or continue telling her that you don’t like it. But doesn’t mean she has to listen to you. She is an adult and even if she isn’t, she is not your ward, your child, your conservatee, or in your charge. \n\nIn the same vein, she can have the choice to set her own boundaries and leave you if she doesn’t like what you have to say.", "YTA molly isnt heroin and adults are allowed to make their own decisions about their bodies. If you “put your foot down” she should absolutely break up with you.", "“Girls trip” plus Molly plus music festival minus you = your going to get cheated on in some capacity 100%", "YWBTA, if you as you put it \"put your foot down\". However both of those drugs in question are well known for their common aphrodisiac properties. The only real reason to take either are to have more fun during intimate relations. I would say her and these friends are really really close, or she plans to be sleeping around. That's just my take on those drugs( I have tried them both).\n\nEdit: making it about her decision is controlling, letting her know your uncomfortable and leaving when she doesn't respect that is having boundaries and respecting them. Don't \"tell her not to\" let her know your uncomfortable with it, and if she does it anyway leave. You let her know as her partner you were not comfortable with it.", "NTA but you and your girlfriend should be aware that MDMA, LSD, mescaline, and Psilocybin should not be thought of as recreational drugs, but rather as medicine. And there is ample research to back that up that is making its way through regulatory agencies. \n\nThat said, if used in the setting she proposes to use them, they are drugs. NAH either way though.", "Jaja Molly is the one that makes girls horned", "Get her some Narcan and test strips before she goes \n\nBoundaries are for you; not to enforce them on your girlfriend. You can call it a dealbreaker, but you can't tell her what she shouldn't be allowed to do.\n\nJust go if it's a dealbreaker.", "NTA, you have a boundary and a right to be worried about someone you care about", "NTA if you break up for that reason, YTA if you try to control her for it. \n\nHer life, her mistakes. \n\nDon’t let that become ‘our’. \n\n-coming from ‘special occasion’ user", "NTA. Those types of drugs can be very dangerous. Especially for women at festivals who aren’t with people they can 100% trust. She could OD, she could get raped. \n\nNot wanting her to die or get hurt is a perfectly reasonable boundary. But you also can’t stop her.", "Why would you be with a druggy? Stupid move.", "YTA\n she's a grown woman. Maybe instead of telling her no  show her ways of practicing safe consumption. She's not telling you what to do, so you should do the same. Sure you may not like it, but at a festival, assuming shes not irresponsible, she'll be ok. Its about safety and moderation", "NTA my dad died of a drug overdose when i was 11 drugs have quite literally ruined my entire life they have real world consequences tell her to just stick to shrooms and weed", "yta. unfortunately for you, she is an adult and can make her own decisions even if that includes ones that you don’t like. if she is taking appropriate measures such as testing the drugs in advance, using with friends and not mixing with other substances, there is no reason why she won’t be perfectly fine. it’s her choice and you don’t get to put your foot down, you only get to give her advice or leave if it’s a dealbreaker", "NTA\n\nYou care about her. That doesn't mean that she will listen or is obligated to, since she is an adult, but it's still good to tell her how you feel.", "NTA. It's a boundary for you, possibly an unsafe situation for her and it is her prerogative to either agree or disagree. But if yiu draw a line in the sand, prepare to walk away.", "NTA. At least insist the drugs are tested.", "I've done ecstacy, coke, and Molly several times when I was her age. Did I survive? Sure but was it worth the risk? No. I was put in a lot of avoidable situations. Did other people I know do all that stuff and live to talk about it? No. Another problem with drugs is there is so much fentanyl and other crap mixed in with them nowadays. You cannot trust that molly will be just that. It's not worth the night (day) of being f$cked to end up hooked on something worse. NTA OP. Not one bit.", "You are incompatible with the person you are attempting to control.", "YWBTAH It's your place to express concern. But she's an adult. You don't get to put your foot down and control her. I understand not wanting her to take potentially dangerous drugs, but it's her decision. She's your partner, not your kid. If you can't be with someone who takes drugs, that's a different conversation.", "YWNBTA\n\nBut\n\nBe prepared for her take all of the drugs simply to show you that you can’t control her. You may want to decide, beforehand, how you will respond when she does that and start making preparations.", "YTA because you’re being a hypocrite. Even though the chances are quite low, marijuana laced with fentanyl does exist and the side effects of eating hallucinatory mushrooms include convulsions and seizures. \n\nAlternatively, MDMA is used as therapy to treat severe PTSD patients. \n\nOf course this doesn’t negate the risk of getting street MDMA cut with fentanyl. But I wouldn’t want someone who drinks, smokes weed and eats mushrooms, putting their “foot down” on an occasional drop of acid or X at rave/music festival.\n\nFYI: she can always test her drugs before taking it.", "N-T-A for suggesting, YTA for putting your foot down. its not your choice at the end of the day, she is her own person", "YTA but only because you said you’re putting your foot down and telling her not to. It’s her choice to make even if it’s one that will harm her.", "A well organized music festival is probably not the worst place to be doing it. People usually take care of each other, and the medical staff is trained well. Good luck if she rolls and feels a connection with someone while she’s there, those feelings get real deep, real fast.", "INFO Has she taken pills before?\nMdma and xtc are just fine, imo better than drinking shots all night. But talk about testing kits, how to actually take the pills, proper hydration, mdma withdrawals after taking the pills. If she knows about everything just let her have fun.", "Like I would legit dump your ass for calling Molly a hard drug \n\n\nFor real\n\n\nThat is some loser shit", "You can’t really control her you can say how you feel and maybe she will compromise. Nah, btw for me I don’t like being touched on drugs I just liked sitting and absorbing everything on my own, you don’t have to take care of her or worry if it’s something she knows how to handle or even spot stuff that isn’t safe.", "NTA. If they do do it, make sure one of them keeps an eye on the others. One of my friend’s siblings died from LSD because he was wandering around without supervision and got hit by a train. Not the same drug for sure, but there’s always got to be someone looking out for others in the group with any substance that impairs your cognitive abilities.", "My Daughter ODd at a festival thinking she was taken one thing and it darn near killed here.  ER Narcon-etc.  hold that line .    Your telling her your message because you love her.  Easy way to frame it.   Good luck with this…", "NTA.\n\nBreak up! Stay broken up.", "I say no one’s the asshole. She’s an adult and ultimately is going to make her own decisions. Your concerns are rational. Everyone has their own relationship to substance use—for many it is a relationship that is sensitive and fraught with trauma. \n\nDoes your gf know about harm reduction? Will she be prepared with fentanyl test strips? Does she carry narcan with her when she knows she’s going to be with people taking drugs? Do any of her friends carry narcan? If I were in your position, these are the questions I’d probably ask her.", "NAH. Ultimately she can decide what she wants for herself. But you wouldn't be an AH for expressing a concern about drug use. If it's coming from the perspective of you just want her to be safe while she's having a good time, that's fine. Don't be hyper aggressive about it, that's only going to push her away or make her more likely to use whatever.  Try to calmly express your concerns while putting your foot down. And it's also fine if you find drug usage as a deal breaker. You bring up a very real concern that people are ODing more and more because of misidentified product or product cut with more dangerous substances.  My brother unfortunately passed from an OD, toxicology found cocaine and two kinds of fent in his system. More and more dangerous substances are being added into everything at this point. Whatever happens, hope everyone stays safe, but people will do what they wanna do.", "a lot of the time, they’re mixed uppers and downers, and the mix sends the user into a psychosis and they get all snakey, after one dose u can get heavily addicted rapidly. My family works with the unhoused population and I have narcan training, mixing uppers and downers can have immediate OD like symptoms and nalaxone isn’t always helpful. Even if it is, bot everyone has acces to a narcan. Is ur gf aware of how scary it is to have to administer nalaxone? How long it takes to get someone out of the OD? Does she have any knowledge regarding narcan or overdosing? NTA ur a W bf", "NTA\n\nBut mind your words in this conversation. Its okay for you to choose to not date someone who does hard drugs and its okay for you two to come up with a compromise regarding this situation... buts its not okay to ban her from using certain drugs just because you dont like it.", "NTA. They will say it’s pure. No drugs are pure. FENT is real and killing people daily. Also risks of cheating, assault or rape, all the things while at this festival \n\nNext question: \nDo you trust her to go and not lie to you about taking it?", "Make sure she brings a test kit with her. It's about safety and being educated.", "Test strips for fent are $1, for her own safety let her know that. Even if you break up.", "ESH - I don’t think you’re TA per say bc this is a reasonable opinion and trying drugs like this could lead to adverse effects. However, she is an adult & it’s her body. It is a little crappy to draw an arbitrary line wherever you want it to be and determine the drugs you like are fine but others aren’t. \n\nHow long have you been together? I think if I were you I’d say pls be careful, limit what you take, don’t go crazy trying everything. Maybe she wants to see what it’s like and it will be a one & done experience. However, if it becomes something she wants to use more regularly I do see that as a problem. Ask her what her intentions are (though obvs that won’t always go to plan).", "NTA\n\nTaking pills from a dealer nowadays is a real risky move. I don't blame you for being deeply concerned. Especially when there's weed and mushrooms which is much safer.\n\n>I worry about her safety since she is quite naive when intoxicated and the friends she is going with don't really have any regard for her safety when they are intoxicated (this is from numerous of past stories I could but won't tell)\n\nYeah this is common as fuck and the big reason I don't hang out with drunk or high people anymore. I turn into a babysitter for full grown adults. It's not fun.\n\nOnly thing you can do is tell her your concern and... well, watch her actions carefully. Because if she goes through with it, and assuming all turns out okay, it probably won't be the last time.", "NAH. The detail I am most curious about is you not trusting her friends with her safety. That is a good reason to be concerned - in a hard drug scenario, trusted friends are critical for safe and fun experiences. Though it also sounds like you don’t completely trust her, and both of those things are red flags. You should trust her to make good decisions and she should be allowed to have fun, but if that is not the type of person you wish to be with, that’s okay too. You can’t control what she does, you can only express your opinion/position, discuss it as a couple, and act accordingly. \n\nI would try and articulate to her the issues you have regarding her safety, and try to have an empathetic discussion starting there. Validate her desire to have fun, but soberly explain why you are concerned for her. Those are noble and valid concerns, and she should be able to hear you out. \n\nDo not “put your foot down”. That is not your place. Rather, communicate with honesty and empathy, and come to an agreement.", "Why would anyone do drugs when they could just mow a lawn?", "Ketamine as an example is a very profound drug that is fascinating to take in a controlled setting, and when you have a reliable source. If you enjoy psychedelics I recommend trying it at least once. That being said, NTA. You are right to be concerned. Taking powerful drugs in a potentially chaotic setting, especially when you don't have a reliable and trustworthy source is very risky. I personally think these drugs should be taken at home or in a familiar setting without being surrounded by strangers. The experiences are intense enough on their own, they don't need to be added to.", "EXTREME NTA. Festivals and raves are breeding grounds for various experimental party drugs, especially \"home made\" shit that you don't even know. Horrible people will more than often target enthusiastic young people who are willing to try anything and everything. A friend of mine got baited into smoking \"weed\" when, in reality, it was a mixture of cocaine, weed, and meth. It put him in the hospital for weeks and he almost died.", "YWBTA. If you are concerned about drugs being cut with other stuff, you should have a talk with her about getting a test kit.\nHere’s the thing - it’s perfectly reasonable to not want to be with someone who’s regularly doing drugs.\nBut, she wants to try them at a festival. If she does and has fun with her friends, and doesn’t make it a regular thing, what’s the problem?\nAnd in the off chance that something bad does happen? That’ll be ok because you’re not with her?", "No", "YWBTA\n\nGo ahead...tell her to choose \"drugs or me\" when you two do certain drugs together. \n\nLet us know how that goes.", "You don’t have the right to “force” an adult to not take drugs, but you sure do have a right to not associate with them. You can definitely give her an ultimatum and say drugs or me. You’re doing it with her best intentions at heart, so if she cares about you she should want to make sure you felt comfortable. \n\nThe problem I see with it is it might be seen by her to be a little hypocritical since you do some drugs. \nFor some perspective, I don’t do any drugs and it would be a deal breaker if my partner smoked weed and did magic mushrooms. No judgement, just giving a possible suggestion of how your girlfriend might feel. I get where you’re coming from, I just think it may be a little hypocritical coming from you so probably ESH.", "Leave her, bro. It’s not worth the heartache! Stay strong.", "NTA\nIf she and her friends wants to fuck around and find out with hardcore drugs, that’s on them, but you shouldn’t be there to pick up the pieces/deal with the aftermath of that shit.", "NTA. You are right to be worried. almost seems like every drug these days is laced with fent or some other shit that takes you right out. permanently. theres a reason places with a high population of OD related deaths have drug testing centres. I got no advice on how to help. Maybe show her some statistics on this kind of thing.", "Love drugs? Bad idea + fentanyl is the real killer here, lots of pills are packed with that shit", "NTA \n\nIm too old for that stuff now but if my partner wanted to do ecstasy anyplace but with me they wouldn't be my partner anymore. IF they want to have fun do mushrooms but doing fuck drugs at a festival sans your partner is inviting bad decisions you want to claim you had no control of later.", "There are better ways to go about this. If you’re concerned she’ll take impure drugs then help her find test kits (you can get them online) so she can insure that what she’s taking is genuine. \n\nIt doesn’t have to be an antagonistic thing.", "Nah. You're not an ass for wanting your girlfriend to be safe. Molly is a fairly popular drug. It's even considered \ntherapeutic in some settings. You can buy testing kits online. If that's something you aren't comfortable with, then that's a different story.", "YTA. alcohol and shrooms are both hard drugs, and so is molly.  They are all awesome, and you're not her dad. Back off dork.", "Ask yourself how you’d feel if your partner told you not to smoke weed, drink or do shrooms? \nIt’s disingenuous for a not sober person to tell someone not to do drugs/drink IMO no matter how harmless your usage is", "NTA. With the fentanyl crisis today, no this isn’t unreasonable. Even with test kits that test a small sample there is no guarantee that someone won’t get a fatal dose. 10-15 years ago I may have disagreed but recreational drug use has become increasingly unsafe with those types of party drugs.", "NAH. It's her prerogative to experiment with drugs if she likes, and it's completely reasonable for you to draw a line there. If she's insistent on taking drugs, and you decide to stay with her anyways, at the very least ask her to test her drugs. Test strips are fairly easy to order discreetly online, and it's far better to test than risk taking something laced with fentanyl or god knows what else.", "She's going to do it and not tell you.\nI'd be more concerned about her cheating on you than OD'ing on MDMA/Molly/ecstasy 100%", "NTA My ex used to do that stuff on the regular with his friends. And they were in the military too. I would get super upset whenever he went to festivals because I was worried sick. I get you. However, if they want to do it, they will regardless of what you think they should. So be very careful. Also, this situation may repeat itself so I'd start thinking for options on how to solve this long term.", "NTA but if she is set to go and take those drugs, thats what she will do. you cant stop her. you can either make sure she stays safe or you can walk away", "Lmao MDMA is in the process of receiving approval from the FDA --> https://www.foley.com/en/insights/publications/2023/09/fda-approval-ptsd-mdma-assisted-therapy-closer#:~:text=MAPS%20is%20hopeful%20that%20MDMA,and%20modifiers%200821%20and%200822).\n\nI would say alcohol has caused just as much, if not more damage? As long as she tests it and gets it from a trustworthy source, I don't understand the issue. If I were her I would break up with someone who was so controlling and incapable of seeing their own flawed logic.", "You would be an asshole if you \"put your foot down\" and told her that she can't. You aren't her father, and she isn't a child. She gets to choose for herself. \n\nHowever.. you are absolutely entitled to assert a boundary. \"I don't feel comfortable being in a relationship with someone who takes hard drugs. If you choose to do that, we may need to accept that we aren't compatible.\"\n\nSee the difference? One is a personal boundary. The other is an attempt at controlling someone else's behaviour, which shouldn't ever happen in a healthy relationship.", "You aren't be the AH for showing concern, but you will be if you give her an ultimatum.\n\nDrugs can be enjoyed as safely or often more safely than alcohol.\n\nIf she's a sensible person trust her and let her have fun.\n\nAnd if you love her surely you don't want to lose her over this?", "NTA it if you dont like it, you have every right to walk away. You have no obligation to stick around, the same way she has no obligation to do what you want", "NTA, we all get to choose our partners and drug use is a very common element in this mix. You have told her where your personal boundaries are, she is free to cross them and you are free to end the relationship because of this.\n\nTo all those suggesting OP is controlling you are wrong. If they are sincere in stating where the line is drawn for them then they are being nothing more than an honest partner.", "It's completely fine for you to opt not to be the BF of anyone whose lifestyle isn't acceptable to you.  This isn't just about drug use, but about pretty much anything.  You get to pick partners with whom you're comfortable and who make you happy.  The deciding factor for you could be something very significant such as drug use (good judgment on your part!) or something that's purely a matter of taste, but you get to walk away when you realize there's incompatibility.\n\nWith the drug use thing, know that if the only reason your GF isn't using some very problematic drugs and putting herself in danger is that she doesn't want you to break up with her, you still have a problem in terms of her judgment, lifestyle clashes, and very different approaches to high risk activities.  \n\nNTA", "Tell her it's a relationship deal breaker to do these drugs. IMO don't tell her what you don't want, that's not in your control and doesn't say what's important to you in a relationship.", "Appreciate the support on that, just feel there is too many risky factors that come with them.", "Why is it ok that they drink alcohol? There are plenty of substances that I'd imagine you'd classify as \"hard\" drugs with less addiction and harm potential than alcohol if used properly. MDMA on its own generally doesn't cause serious or life threatening effects without extraneous factors like prolonged high temperature or poor water intake and these extraneous factors can be accounted for and mitigated with proper harm reduction practices like scheduled alarms for breaks and water and/or a trip sitter. The same cannot be said of alcohol poisoning which can come on way quicker than most people think and cause serious injury.\n\nYou think of alcohol and weed as normal and pretty safe because there are legal avenues to purchase them (in some places) allowing for cleaner safer products and their use has been relatively normalized so the general population has a better understanding of the risks and how to use it safely.\n\nWhy take drugs? Literally thousands of different reasons, both valid and ridiculous. Humanity has been getting high since the dawn of civilization, some of the first permanent human settlements were built to more easily make beer, the Oracle was huffing ethylene in the temple of Delphi, some of the greatest poetry of the Victorian age were written by guys who were constantly smoking opium, Freud would probably have never created psychoanalysis (and the entire modern profession of psychiatry) without the mountain of cocaine he and his colleagues consumed, Steve Jobs said LSD was one of the most profound experiences of his life. \n\nI'm not saying there's no merit to telling your kids to stick to weed and alcohol and that other substances are dangerous, that's a pretty normal belief. However I wish more people understood that stance gives the impression that weed and alcohol are mostly safe and any other drugs are \"hard\" and extremely dangerous which is just incorrect. Just because you've never found a reason to do drugs doesn't mean your kids won't and when they take a risk and try MDMA or something, odds are they'll have a great time and come out the other side fine, immediately making them think your whole drug stance was full of shit and possibly engage in more dangerous behavior. I think people in general would be a lot better off if they were told the truth: that no mind altering substance, whether it's coffee or heroin, is completely safe but some are significantly more risky than others which is why if you do choose to use a psychoactive substance it is extremely important to know exactly what you are taking, how much you are taking, and follow proper harm reduction practices for the substance in question. People are generally able to make better decisions when they are told the truth and can decide for themselves", "I have friends who have ODed too. That’s why you test drugs. Ask her to test them, if you don’t agree to that than YBWTAH", "HOLY SHIT\n\n\nDanger???\n\nWow none of you have ever done drugs in your life and it shows.", "MDMA is not a hard drug lol", "Appreciate the support with it. It's just hard because for me this could be a final straw I wasn't prepared for or expected.", "I mean alcohol is pretty awful for you just societally accepted. That's the only real distinction here pure mdma has less hangover effects and has been shown to help with depression. My only problem would be alot of this stuff is cut, great if you live in a country where you can get it tested for purity. Otherwise it is a fair concern to have should you be able to put your foot down on this particular drug I find it a little inconsistent at best with your current world view of drugs with the regular consumption of alcohol a detterotive drug to memory with regular use. Whereas the occasional use of mdma has no study to prove any damage to the body as far as I'm aware. Off course there is the addictive quality of any drug and thus is best quantified against the own person family history and genetic predisposition for addiction.", "Totally agree, appreciate your input.", "Boundaries are for yourself not a means to control other people.", "Great point, I'm not a pushover and I'm not one to waste my time being angry. I feel pretty comfortable with my decision moving forward.", "Yeah you've got it spot on. I'll throw in an edit. When I say \"putting my foot down\" I am saying she can choose between being able to that or being with me.", "I don't understand the distinction you're making honestly.  It feels very pedantic.  Are you saying because he used the words \"put foot down\" it's somehow an issue?\n\nHe *can't actually* control her.  No one can control anyone.  \"Put my foot down\" is an ultimatum which implies exercising the only power you *do* have, which is leaving.\n\nEven someone \"controlling\", which is endlessly thrown around here, only has the power the \"controlled\" gives them, short of some kind of physical violence or significant emotional abuse.\n\nHe says \"Im putting my foot down!\"\n\nShe says \"yeah ok\", and gets stoned out of her mind anyway\n\nOP chooses to stay and this pattern repeats.  In your mind that's \"controlling\"?\n\nWhat if OP says \"OK you broke my boundary, so I'm walking\" and she says \"OMG IM SO SORRY I DIDNT THINK YOUD LEAVE ILL NEVER DO IT AGAIN!\"\n\nIn a way doesn't that mean the threat of leaving was, in its *actual impact*, even *more*  \"controlling\"?\n\nTo me the OP is just talking about setting a boundary.  She of course can choose to violate it.  Anyone can.", "You can set a boundary and your partner can choose to honor it or not. \n\nWhatever choice is made there are consequences. Good or bad.", "His version of \"putting his foot down\" is clearly not in the dominance sense that he is telling her what to do. It's stemmed from a good intention, if you don't take the drug there's clearly a chance of less harm or something bad (drug related) happening. \n\nAnd choosing to do it around a ton of random strangers is completely different to doing it in the comfort of your own home.\n\nShe's a grown up by age, that doesn't always mean that they are a grown up.", "Hey maybe he's not her daddy,but she can die.I rather see him try and put a foot down than possibly be at her funeral.SHE is going to make her own choices but he would be the ultimate asshole is he didn't at least attempt to try and stop her even if it's in a immature way.Seen a lot of people die from I'm just going to take one pil,one hit etc.", "Imagine being called an A for caring about the well-being of your partner. If only those who fell into hard drugs that then spiraled their lives towards vicious addiction had someone who pressed hard into saying \"no, I don't want that for you\" rather than watching them fall into a pit...\n\nSo what I'm understanding if your friend wanted to walk through a field of mines that would result in their serious maiming or death, you would let them because they're an adult and you already warned them... you never cared for the person.", "I think we should imagine that this post said: I don’t want my girlfriend driving race cars, or undereating, or drinking alcohol. It’s all the same. You can express your concern for you girl friends safety, and you can leave them if you don’t like the risk profile they are exposing themself to. So if “putting your foot down” is saying you will leave if they continue the behavior that you think is too risky, then go ahead, put that foot down. NAH! But if putting your foot down is trying to stay with her but control her then, YTA.", "So it’s “controlling” not to want a loved one to ingest illegal and dangerous narcotics? Let me off the ride. I’m going to be sick. \n\nGoodness. What an incredibly poor view of life.", "Fucking dumb opinion.", "What the hell is your opinion? If your partner expresses that she wants to go cliff diving despite having 0 experience and has around 50% chance of dying, would you not \"put your foot down\" and just... let her do it and see if she either comes out alive or just doesn't come out of the water at all?\n\nIn what world do you live in where not wanting your partner to engage in potentially dangerous hard drugs (crap that you don't even know where it came from or who made it) is considered controlling?", "THIS IS THE WAY. \n\nShe chooses her path. You choose yours, OP.", "She's going to a festival.  You're making wild assumptions that she's thought this through.  Maybe she has, maybe she hasn't... but he's allowed to not be ok with it.\n\nJust like she's allowed to do it.  Her choice and a consequence of that would be potentially losing her current relationship.  If it's worth it to her, then so be it...but acting like he's not allowed to care and voice that is bullshit.", "NTA if there’s one thing you put your foot down on, it’s hard drugs. Especially girls at a fest. And I’m in the EDM community but I take a hard stance against crazy drugs because you can have a ballin time with just weed and alcohol, or neither.", "Kind of the complex I am dealing with in my head, thanks", "Or he's allowed to not be ok with her doing it.  She can do them, and deal with the consequences of that.  Acting like it's not ok to be against these drugs is ridiculous.", "A lot of us have taken drugs and feel lucky to be alive. And I wish people wouldn’t have enabled my friends who weren’t so lucky. This isn’t about hurting peoples feelings, this dude doesn’t want his gf to die. There is a line between weed and Molly bc weed doesn’t frickin kill people.", "also, newsflash buddy, a move like this is likely to make her reconsider the relationship and do something...relationship ending. especially on Molly lol so if you do that then you might as well accept that the relationship is over.", "\"if I put my foot down and told my girlfriend I don't want her taking drugs at this festival\". Never did he say she can't. Don't misquote someone to fit your narrative. He's clearly not an AH for expressing his opinion on whether he wants his significant other to take hard drugs at a festival.", "Not his place to tell her as a boyfriend? What about her parents? So because he is only her boyfriend he doesn't get a say so? Jesus Christ as they are standing over her coffin tell her mom and dad it wasn't my place to put ny foot down or try and intervene I'm only her boyfriend.Obviously you've never lost anyone to the disease of addiction.Yeah she probably won't listen or he could be the one voice of reasoning that just may save her life.", "that’s just not true… the rate of “MDMA” being heavily cut with other substances is completely incomparable to mushrooms. the rate of medical incidents in relation to either drug is also incomparable", "Totally understand where you're coming from. When I say \"put my foot down\" it's moreso me saying \"hey I'm not comfortable being with someone who puts themselves in unnecessary danger for the heck of it\"", "There are some people who are pretty naive, and it doesn't matter if they're an adult.  They are easily taken advantage of. \n\nYou might think it's controlling, but to him, it's trying to stop a car accident you see coming.", "Bc apparently women can’t exist apart from their SO without cheating? Tf are you on about", "Uhhh… what?", "MDMA is fun as hell for non-sexual reasons too. It's actually very silly to immediately assume that MDMA=she's gonna cheat. A non-cheater on MDMA won't cheat.", "Definitely side with your edit. That is the route I would go down with the future conversation that's coming.", "Umm. They ARE recreational drugs if not prescribed and fulfilled by a legalized dispensary. No judgment, I do weed and mushrooms myself. But unless it is coming from a licensed dispensary that can control the dosing, i would not consider street drugs as “medicine”", "Drugs are drugs than can sometimes be medicine to the right people. Nothing wrong with thinking and using them as recreational drugs to unwind though. Those substances aren't medicine to plenty of the people who use them, but rather just a good time and way to connect with friends.", "Totally agree, this is a convo we have had before too.", "It’s used as an EXPERIMENTAL therapy in a controlled environment, doesn’t mean just taking it at a festival is good for her brain or a safe situation to put herself in", "Stick with the stuff that you know is relatively safe, and not easily adulterated. Stay tf away from pills! There’s some dangerous pills out there floating around, and I really don’t recommend taking random ones for fun.", "Molly and X purchased randomly tend to be not MDMA at all, but a mix of meth with strychnine added for hallucinatory effect. Or lately a little fentanyl. Not a good thing to ingest.", "NTA. You are right to be concerned, but all you can do is verbally put your foot down. She is the one making the choice. I hope she comes around and decides to play it safe.", "And every one of the deaths was a freak occurrence by non-addicts", "For context, I am not against drugs. I think most should be decriminalized if not legalized. Even if they aren’t for me, I respect and believe that people should be able to take them safely. \n\nThe sad part is, people can’t take them safely — not without a lot of diligence. I lost a friend to “ecstasy” that very certainly wasn’t. One dose and that was it for a healthy, fit, thriving human being — lights out. I’ve known so many people to take the drug safely and get what they expected, but one wrong gamble and you don’t get a second chance.\n\nIf your partner really wants to explore other drugs, she should utilize [dancesafe.org](https://www.dancesafe.org) for safety tests on anything she ingests.\n\nYou also mentioned some substances much more dangerous than party drugs, and I would strongly caution anyone I cared about not to venture into H or other similarly addictive substances. Really truly, even once can ruin your life. \n\nGood luck, and I hope you both stay safe.", "Even weed is dangerous now if you don't know the grower. Just had a coworkers uncle smoke weed that was laced with fent and od'd.", "Are you fucking kidding me??? Let's test the illegal street drugs? I've seen people die in their addiction,heard of people that only took on hit and bam their gone only to leave behind loved ones.I wish I could award you with the dumbest answer and solution I've ever heard of are you for real?", "It's better that it comes now, when she's your gf, not your wife. It would only grow as a massive burden. People often don't recognise these things as the fundamental incompatibilities they are.", "Exactly, that's why I said \"if she doesn't agree, maybe she isn't for you\". I'm not telling him to use this as control. I am telling him to express what he is okay with, and if she doesn't agree, it's probably time to move on. He doesn't have a right to control what she wants to do, but he can still express what he does or doesn't like.", "Just break up with her. This is an irreconcilable difference for people in their early 20s and that's fine. If you do \"put your foot down\" and she agrees to not do drugs she's either going to do the drugs with her friend anyway and lie about it, or she'll resent you and her friends will hate you leading to your eventual break up.", "Sorry but if you feel perfectly ok ending the relationship so easily over that, then you should probably leave anyway.", "It's not that complicated. \n\nA personal boundary is what you to keep yourself safe. It's not ever about controlling what another person does. \n\nWhen you give someone an ultimatum or tell them they can't do something, you are trying to control their behaviour. Which is by its very definition \"controlling\". If the term is endlessly thrown around, that's because people are educating themselves around what unhealthy behaviours look like within relationships, and they're calling it out. \n\n\"You can't do that or I'm breaking up with you\" \n\nVs\n\n\"I can't be in a relationship with someone who takes hard drugs\"\n\nOne is an attempt at controlling someone else's behaviour. The other is a boundary. It may seem like a subtle difference and therefore \"pedantic\" to mention it, but the feeling around each statement is entirely different.", "That boundary is not his to set. He cannot set a boundary as to what she does with her body, but he can set a boundary about what type of person he is willing to date.\n\nThat’s the distinction.", "“You absolutely cannot do Molly or I’m leaving” is controlling. It is trying to control HER behavior. “I’m not comfortable being with someone who does Molly” is expressing a boundary. That’s respecting her choice and making your own choice based off of it. Not telling her to change her behavior. She can then make her own choice based on her limits. There is a major difference there. One is choosing what to do with your own body and autonomy. The other is trying to tell HER what to do. It’s not pedantic. It’s literally the difference between having boundaries and being controlling.\n\nEdit: part of that is that telling them you’ll leave genuinely has to be your own boundary, not something you do to manipulate them into changing. It is a non-judgmental limit of yours. Not a way to strongarm them. Obviously you hope you are able to find a middle path, but you are also open to not. It’s not coercive.", "A boundary is not telling someone what they can and can’t do. That’s what I’m saying. It’s having your own limit and expressing it and changing your own behavior to do so. Not demanding or trying to make someone else change theirs.", "She can make her own decisions. It doesn’t matter what his intentions are. He has given her advice - it’s not bad advice necessarily, but she doesn’t want to take it. There is nothing else he can do that isn’t controlling. What, he INSISTS that she not take molly? She’s an adult with autonomy. It doesn’t matter that he doesn’t like her decision. \n\nIt’s like - if my partner hated vegetables and I insisted that he eat them. I’m not wrong in my reasoning, and it makes sense why I care, but fundamentally he is an adult and can choose what he eats. I’m not his mom.", "This.  Can you imagine the conversation if she passed?  Her parents: “You knew she was going to do this, and you just let her? You didn’t even try to do anything to stop her?!”\nOP: “Nope, that would make me a controlling AH.”", "This is a good clarification. It seems like people might have different understandings of the phrase “put my foot down” cuz sure OP could say “I don’t want you to” or even “I don’t want to be with someone who does that” but they can’t say “I forbid you.” Totally fine to express concern and personal boundaries, but the GF is a grown adult and responsible for her own actions and consequences. If she wants to take drugs, whether it might harm her or not, or be illegal or not, that is her choice to make and deal with.", "This 100%!!", "Yes, exactly this.", "Yeah, it's like being \"controlling\" not to want someone to go join a cult. Like, yeah, her body, her choice, but also you can specify deal-breaker behavior from a partner.", "Actually she isn't allowed to do it since it's illegal", "you sound just like my conservative mom", "She’s 21. She’s at that age where she’s exploring life and will probably need to learn things via experiences, and not from someone just saying no.  The more people tell her no, the more she’s going to want to do it.", "Alcohol does and everyday.", "Nor does molly.", "except he is, what do you think putting your foot down means? he’s an ah for thinking he has any say in the decisions she makes, he can advise but she wants to do them and he won’t change that. he could simply tell her it’s a dealbreaker or leave", "What part isn't true? I said MDMA if it isn't cut with crap is less dangerous than mushrooms, I didn't say it wouldn't be cut but of itself it is less likely to put you out of control. Mushrooms are very dangerous, I've known several people who have never come back from trips and a couple who severely harmed themselves, as in mutilated themselves. That's very unlikely with MDMA so the main argument he has is that it could be cut with something but he'd let her take a potentially mental health destroying trip with him so I don't think he has the moral high ground here. I suspect the thought of her being out feeling loved up with her female friends plays a bigger part than he's willing to admit, it's not so much the drugs as his own insecurity", "I get what you're saying, you're worried about her like a good bf should be!", "They aren’t legal federally and they are sort of barely legal in a handful of states, so they cannot be prescribed. But there are many medical professionals who do recommend them at this point and supervise their use. Meanwhile they are in advanced stages in federal approval processes.  You just can’t expect federal agencies to keep up with the science even in the best of circumstances. I wouldn’t get hung up on it. And mushrooms are not street drugs if you grow them or know someone who does.", "Just making shit up I love it", "I don't even get Flower anymore unless I know the grower or its a dispensary just because of Fetanyl.", "And to the 22 people who upvoted\n\nYou're stupid too", "This is so false wow.", "Lmao nope. You don’t have a clue what you’re talking about. But it’s a good idea to buy some fentanyl test strips.", "Yeah, you made this up.", "Absolute nonsense. No one sells meth as Molly. They make more money selling meth as meth", "Fent would be destroyed by the burning.", "Like abstinence was ever the answer \n\nYou're over here being righteous and condemning an actual helpful tool used to prevent what you've mentioned above. \n\n\nYes, drug test strips. People are going to use drugs irregardless let's encourage them to at least manage the risk so when they take a \"hit\" the aforementioned doesn't happen. \nYou should  took at look at data regarding test strips cuz you're coming across stupid AF\n    Whats next? No narcan?", "Lol, yes, you test them to make sure you know what you’re taking.\nWhy are you against that?", "You're so right! I've also heard of people stepping just outside their homes and BAM, shot, or an AC dropping... We better stop that too. I've also seen people choke on just regular old chicken!!! No more eating that, or much of anything... Oh what's that? Informed and intelligent actions mitigate a lot of risk and we can't just not do something because of a very small percentage, as long as we take reasonable precautions? Damn...", "She's taking about taking a few pills not smoking crack or shooting heroin lol", "It his his boundary, he can set it however he wants it.", "It is his boundary, he can set it however he wants it.", "Jesus man 🤦", "The fact that you're being downvoted for this shows the lack of understanding this sub has around healthy relationships. \n\nYou are 100% spot on.", "Damn I was reading this thinking “wow this person gets it” and then saw all the downvotes. You are 100% correct, and well said. Boundaries are lines we set for ourselves that healthily dictate to others how we will protect our own emotional well-being. Boundaries do not dictate to others how they are allowed to behave based on our feelings. Smh", "The amount of downvotes you have makes me worried for the people in this post with relationships. Hope they aren't control freaks with no awareness of what the term boundaries are", "This is spot on and the people downvoting you worry me.", "Comparing him not being fond of the idea of her dying from accidental fentanyl exposure to eating vegetables? Okay.", "He can put his foot down. He will not be there , it may not mean much", "So who's to deal with the aftermath IF there is one? Is it just a case of \"oh you're in hospital......I told you so right? Good luck with that\" and you wouldn't be calling him the AH if he did that then?\n\nIf I'm with someone as in a relationship then you're there for the good AND bad, meaning their actions also affect you, so yes you can have input but I agree that you literally cannot force or insist a person do what you tell them even if they wanted to jump into a fire.\n\nIf I was OP I would most likely just leave that person because judgement-wise if it doesn't align with your own values then yeah it's going to be hard to be together.", "I agree,I rather see someone try and be a controlling AH even if it fell on deaf ears that be standing over her coffin.Your so right.", "Your conservative mom is a member of the EDM community and says she has a ballin time on weed?", "In this case, I feel like \"putting his foot down\" simply means he is going to clearly state his opinion: \"I don't want you doing hard drugs at that festival\". Other than that I agree with what you're saying. He can tell her it's a dealbreaker or leave 100%", "You can tell who doesnt know a thing about drugs. They just hear govt scare tactics and think they know all about consumption and dangers. They fail to realize that just  a few years ago weed was a \"hard drug\" and till this day still a schedule I drug", "All the down voted are the ones who have ACTUALLY done this shit\n\n\nThese weebs probably believe drug dealers hand out free drugs to kids for Halloween", "Just commented to op, but I had a coworkers uncle od off of weed that was laced with fent. Happened 2 or 3 weeks ago.", "That's not true people smoke and vape fent everyday. Do you know when people don't have foil or tooters they can put it in cigarettes blunts etc. Why do people who have no idea about opiates say stuff like this. You can even smoke oxycodone heroin fentanyl morphine all of em. Trust me", "I have a feeling that the person you are replying to thought that they meant test them out (by taking some) and see.", "I get that, but people have, and are entitled to their differing views on these things, and speaking from experience the difference tends to become bigger over time and can become insurmountable. I'm not passing any judgment here, it's just one of those things. Could happen with alcohol, or anything really. If its something that one person enjoys and the other can't stand, it's a wedge.", "That's not how boundaries work, sorry.", "Well my boundary is that you’re not allowed to speak anymore.", "Right?!", "He can’t forbid his adult partner from doing anything. He has expressed his concern and discomfort. What would “putting his foot down” look like?", "Yet marijuana has also been found to be laced with fentanyl and eating mushrooms always comes with the risk of convulsions and seizures. But somehow, it’s okay for OP to smoke weed and eat mushrooms, but dropping X is off the table. Sounds pretty hypocritical to me. \n\nFeel free to Google marijuana laced with fent or side effects of eating hallucinatory mushrooms.", "Sure, he CAN. And it would be a huge controlling red flag.", "Sure. If your values don’t align, you leave. You don’t try to control their behavior. That’s what I’m saying. Either you’re on board with the person even if Molly winds them up in the hospital (which is honestly unlikely), or you’re not on board with Molly and therefore not on board with them. That’s the choice you get to make. If you stay or not. Not if she does drugs or not.", "lol, no, I reacted like it was my mom and stopped paying attention after the first bullshit sentence hahaha", "You can tell who’s taking the drugs when they believe people are really out there selling pure ecstasy these days", "Thank you holy shit\n\nI'm in a room with the BIGGEST weens that have clearly NEVER did drugs, giving advice.", "Pretty sure Fent combusted like that gets destroyed which means he was actually already fucking with Fent before he smoked his \"Fent laced weed\" unless he did his weed in a special way like an oven vape or something.", "Going \"Hey the moment you touch that shit I'm fucking gone.\"", "I feel like “putting his foot down” in this instance is very clearly just expressing his boundaries and disapproval of her doing random party drugs. Obviously he cannot literally forbid her.", "Get weed at a dispensary and the odds of it being laced are basically zero. Party drugs? A genuine gamble. It makes sense that OP would be concerned about that.", "If you get weed with fentanyl and smoke it you are just stupid or don't know what weed looks like, as someone who has been handed weed that was laced, took one look and said no thank you", "No, it really wouldn't be a controlling red flag\n\n\"No I don't want you to drive drunk\" is the exact same thing here.", "Yeah, so funny...", "U can find pure stuff. But fact is most ppl dont want to spend the money on it so they spend less for cut stuff, they dont test their things, and they buy from strangers. All no-nos", "Yeah. You _can_ tell. 0o", "Or you're such a fan of drugs that you fail to realize there is some validity in what they're saying. Always true? No. Sometimes buying at a festival? Sure. Yes I've done hard drugs and lost friends to them.", "Could have been in a vape pen maybe.", "I know people who smoke fent in blunts and cigarettes and get high just fine, even revived them with narcans before. It's unlikely but can work and does happen when people don't have foil and tooters", "Fentanyl laced weed is definitely a thing. It's been becoming more common over the last 2-3 years in some regions.\n\nFor the record, weed can also be laced with cocaine, heroin, and/or LSD.\n\nIf you smoke black market weed and are unaware of fentanyl lacing then you *really* need to educate yourself and start taking precautions to protect yourself. If FTS's are avalible to you, then you should be testing a sample from every batch you buy to make sure it's safe before consumption.", "Taking molly = possible danger to yourself  \nDriving drunk = likely danger to yourself and anyone else on the road  \n\n\nIt isn't the exact same thing at all.", "It’s not at all the same.", "what's wrong with you?", "This girl likely won’t be finding pure stuff or testing her drugs. Separately she has a right to destroy her body but OP has a right to not want to be with someone who uses chemical drugs (this seems to be what he’s saying). \n\nAlso concerning to me is it’s genuinely not safe to be on drugs at a festival. Do you know how many people get assaulted in those situations? Just bad ideas all around\n\nAlso: buying from someone you know doesn’t matter. Your drug dealer likely isn’t telling you the truth and is not your friend.", "You've lost friends to Molly? BullSHIT. \nI don't believe anything you're saying if you state that Molly is a hard drug \n\nBe for real", "Like there is more truth to \"people give away drugs for Halloween\"", "I'm 34 now and haven't touched drugs in 10 years but im not so out of the loop that anyone is going to make me believe that MOLLY is dangerous \n\nACID is more dangerous than Molly\n\nThe only thing you risk is DEHYDRATION\nNobody is mixing Molly with anything either who tf gives away free drugs with the purchase of other.", "“someone who uses chemical drugs”\n\nwhat a strange distinction to make. Essentially all drugs are chemical. Do you take issue with the drug itself? Or the general use of recreational drugs?\n\nIt is also naive and generalizing to say that it is “genuinely not safe to be on drugs at a festival”. There are so many factors to consider. Generally speaking, if you are with people you trust, take moderate doses you are familiar with taking, stick with your people, and use sound judgment, you will be very safe and have fun. Of course it happens, but it is not the norm and certainly does not mean the experience is overall unsafe. It does not sound like you’ve ever had that experience yourself.", "True and yes he has a right to his beliefs and opinions 100% \n\nMost ppl are on drugs at fests and nothing goes wrong. Youre just as likely to get assaulted on drugs at a fest than you are walking down a city street. Its about control. I personally always am aware of whats going on. Some ppl cant control themselves and just want to get fucked up as much as possible", "I have done molly and all sorts of other drugs regularly for about 10 years and I don't know many but It does happen. Taking a bad pill at a festival or sometimes there's an undetected heart issue the person didn't know about", "“Acid is more dangerous than…” Oof. It’s amateur on amateur crime out here…", "I was with you until you said lsd is dangerous, mdma is an amphetamine all amphetamines have dangers like dehydration and serotonin syndrome plus if you use daily neurotoxicity due to neuro plasticity issues...", "You're wrong though, acid is less dangerous than MDMA as MDMA can cause serotonin syndrome or put your heart under too much stress at high doses.", "You know its not about giving away free drugs lmfao\n\nThe drugs are cut with awful stuff so they can SAVE money. Each dealer adds whatever to it, so it weighs more and sells more. Some insidious people add stuff to make it more addictive", "or the main danger when you take any drugs for the first time, without knowing how you are going to react to them, is your actions more than the drugs itself. without anyone sober with the group, they could easily get a bad trip and being taking advantage of. id say a music festival isnt the best place to try a drug for the first time, even if it was just weed, and specially if *the entire group* is planning to try it at once, without anyone being sober to take care of anyone that might react badly to it.", "Idk I just figured he was cool with weed and shrooms but not othered and maybe it’s w weird word choice but that’s how I noticed he seems to be separating them. People I know who think shrooms and weed are ok because they are “natural” and everything else is “hard” \n\nFor safety at a festival, there’s actually a ton of research on it.\n\nJust linking a few but you can goggle and thousands come up around the current phenomenon and culture of sexual violence at festivals \n\n[One in three women at music festivals sexually assaulted or harassed](https://www.telegraph.co.uk/news/2022/08/30/one-three-women-music-festivals-sexually-assaulted-harassed/)\n\n\n[Shocking' level of sexual harassment at music festivals](https://www.bbc.com/news/entertainment-arts-44518892.amp)\n\n[It’s estimated that 250,000 women are sexually assaulted at festivals each year. Things have to change](https://www.gq-magazine.co.uk/article/sexual-assault-festivals)\n\n[Distinctive risk factors tied to sexual assaults at large events like festivals](https://www.reuters.com/article/us-health-sexassualt-mass-events/distinctive-risk-factors-tied-to-sexual-assaults-at-large-events-idUSKCN0R31XX20150903)\n\nNot sure what you mean by “it does not sound like you’ve had that experience yourself”", "I’d say your statement about walking down the street is factually incorrect. \n\nI’d be really careful to make bold statements unless you are well researched and that attitude sounds a lot like **victim blaming** and **minimizing** a **known issue**. It’s not about being “able to be in control and aware while on drugs” (which isn’t possible, that’s like a drunk person saying they’re cool to drive), it’s about not putting yourself in a situation to be intoxicated when it’s a known risk. \n\nThere are so many research articles about sexual violence, rape culture, sexual harassment and music festivals google has pages upon pages about the phenomenon. It’s a **known** issue.\n\n**[More than a quarter of sexual assaults happen at mass events like festivals, student orientations and holiday celebrations,](https://www.reuters.com/article/us-health-sexassualt-mass-events/distinctive-risk-factors-tied-to-sexual-assaults-at-large-events-idUSKCN0R31XX20150903)**\n\nAlso stats:  **[One in three women at music festivals sexually assaulted or harassed](https://www.telegraph.co.uk/news/2022/08/30/one-three-women-music-festivals-sexually-assaulted-harassed/)**", "I knew a lot of ravers back in the day when ecstasy was crazy strong and not one of them developed serotonin syndrome. Molly is nothing compared to that 90a shit. Not happening."]}