{"id": 27452, "submission_id": "16q2apn", "title": "AITA for setting boundaries with my brother regarding his wife?", "selftext": "My brother IB (Idiot Brother-mid 30s) and I (20s F), fought recently over some boundaries I set with his wife CW (Cheating Wife-late 20s). The 2 of them are a constant source of stress for the whole family. They're always fighting, and trying to make it everyone else's problem too. They have 2 kids (3,7) and a 3rd on the way.\r  \n\r  \n2 days ago, it was recently discovered CW was cheating again. Shocker I know. But she was bringing their 3yo with her and leave them in the car, alone, while she was hooking up. And IB decided to forgive her... Yeah, you read that right. He forgave her for ENDANGERING their 3yo child and leaving them in a car alone for an unspecified period of time. CW even admitted she was doing this in the middle of the summer too! They could have died in the hot car!\r  \n\r  \nIB then tried asking our older brothers wife and I, to hang out with CW more. I think he's hoping that if she's with girl friends CW wouldn't cheat and we could keep her in line? Frankly I don't think anything could stop her at this point, this seems to have been going on for their whole relationship.\r  \n\r  \nHowever, I've long sense reached my limit with CW. If the conversation isn't about her she will make it about her. Every time she gets caught cheating she plays the victim card as if it's not her fault she cheated on IB. Hell, on a previous confrontation about her cheating, she assaulted IB for not believing her lies about where she was and having evidence she was cheating.\r  \n\r  \nSo when IB asked us to hang out with CW more I felt I had to make it clear that unless I have to, ie. for the sake of their kids, I will not have anything to do with her going forward. Their never ending drama has done nothing but cause me constant stress and anxiety. I've already done my best to be LC with them as possible. CW can go pound sand for all I care.. or whatever random guy she's hooking up with that day. Our older brothers wife said more or less the same thing. She's also pregnant and is supposed to be on bed rest and avoiding stress as she has high blood pressure.\r  \n\r  \nWell IB didn't like our responses. He called us selfish b\\*tches for not even attempting to forgive CW. That she was the mother of his children (debatable) and that she won't be going anywhere anytime soon so we might as well learn to get along. That he loves her and she loves him (again debateable). He finished off with a jab at why my ex and I broke up. Saying that since I'm so selfish and only think about myself it's no wonder why he left me.\r  \n\r  \nI laughed and retorted, \"that's rich coming from a man who can't keep his wife from running off to sleep with other men and asking others to keep her in line. There's nothing more selfish than people wanting others to handle their problems for them.\"\r  \n\r  \nNow he's mad and giving everyone the silent treatment. Most of us our enjoying the silence. I don't think I'm TA, but some friends I vented to said it wouldn't kill me to help IB keep CW in line to keep the peace. \r  \n\r  \nSo, Aita?", "created_utc": 1695469137, "permalink": "/r/AmItheAsshole/comments/16q2apn/aita_for_setting_boundaries_with_my_brother/", "score": 76, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Should I have agreed to help keep CW in line to keep the peace? I feel like it's not my responsibility to watch her. But I probably could have been nicer about it at least.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Definitely set boundaries and go even lower contact with them. Don't let anyone make this into your problem.", "NTA\n\nKeep her in line? How? You don’t have control of these people. They’re adults (debatable)", "NTA do those friends know about the leaving the child in the car thing?", "NTA and if possible you should report the kids in a hot cat situation to CPS before she kills one of those kids.", "NTA and it seems like problem solved from your end.", "NTA tell you brother people in glasshouses shouldn’t throw stones.", "NTA\n\nAs you've said, solving his problems is not your job. You are under no obligation to hang out with her.", "NTA, “keep the peace, keep the peace” said by people who have never had to keep the peace, said by people whose god awful behavior has forced others to “keep the peace”. Screw the frame queens…male, and female…and enjoy your actual peace.", "NTA.  I would suggest you sneak some dna from the kids and test them against YOURSELF to see how each of IB's kiddos are related to you.", "NTA. You already said you would be nice to her if you have to, so the \"learn to get along\" box is checked. You don't have to be friends with anyone, especially a garbage person. That's all besides the fact that if she needs to be constantly supervised to be faithful to her husband, he's solving the wrong problem.", "Definitely NTA. Your brother wants to be an idiot, that's his choice, but you have no responsibility to keep anything in check for him. Just enjoy the peace and let those skeletons rest.", "NTA.", "NTA. \n\n>some friends I vented to said it wouldn't kill me to help IB keep CW in line to keep the peace. \n\nIt's not normal for anyone in a relationship to feel they need to hire/force people to stop that person cheating. If you're doing that then you either need to get couples counseling or you need to admit defeat and walk away.", "Adults who need to be kept in line at most are a waste of time. Trade your IB and CW in for a nice couple of pets. Train them and name them after your IB and CW. Explain to them how you trained them and feed them and how well behaved they are and that they provide more comfort and reliability than the humans they're named after.", "NTA, your brother might not be an asshole but is surely a fool, cheat once forgive and perhaps forget, cheat twice, forgive but do not forget, cheat 3 times and its never going to stop, so either agree to an open marriage or divorce.", "Forget the IB and CW. Report the child endangerment, anonymously if you must, but the full story would help caseworkers. Will you forgive yourself if something to them and you didn't?", "NTA \n\nI'd step back completely and lets the relationship implode. But before I did I would tell him that if I ever hear about the wife endangering the kids again, I would call the authorities. Go NC", "Nta.", "One of the most obvious NTA’s ever", "LOL debatable* NTA", "NTA. But you do need to get better friends. What utterly ridiculous advice!?", "I agree it's not like you actually COULD control her behavior. And it's not wise to get involved. If she cheats again, he will just blame you for failing to keep an eye on her. NTA", "If you agreed to try and keep her in line, you would just be taking the blame when the plan inevitable fails. Brother saying you let him down and his wife saying you weren't a good enough friend or whatever spin they want on the story.\n\nNTA", "So they can say it's your fault next time she cheats? Hard pass. NTA", "NTA.\n\n>CW can go pound sand for all I care.. or whatever random guy she's hooking up with that day. \n\nWow, you have a way with words!  Bravo.", "Hell no, you're not NTA. Your brother & his disgusting wife are absolute assholes. Your response to him was amazing. SIL enjoys being a serial cheater, so are the kids even your brother's?", "Definitely NTA. Your Brother is an idiot.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother IB (Idiot Brother-mid 30s) and I (20s F), fought recently over some boundaries I set with his wife CW (Cheating Wife-late 20s). The 2 of them are a constant source of stress for the whole family. They're always fighting, and trying to make it everyone else's problem too. They have 2 kids (3,7) and a 3rd on the way.\r  \n\r  \n2 days ago, it was recently discovered CW was cheating again. Shocker I know. But she was bringing their 3yo with her and leave them in the car, alone, while she was hooking up. And IB decided to forgive her... Yeah, you read that right. He forgave her for ENDANGERING their 3yo child and leaving them in a car alone for an unspecified period of time. CW even admitted she was doing this in the middle of the summer too! They could have died in the hot car!\r  \n\r  \nIB then tried asking our older brothers wife and I, to hang out with CW more. I think he's hoping that if she's with girl friends CW wouldn't cheat and we could keep her in line? Frankly I don't think anything could stop her at this point, this seems to have been going on for their whole relationship.\r  \n\r  \nHowever, I've long sense reached my limit with CW. If the conversation isn't about her she will make it about her. Every time she gets caught cheating she plays the victim card as if it's not her fault she cheated on IB. Hell, on a previous confrontation about her cheating, she assaulted IB for not believing her lies about where she was and having evidence she was cheating.\r  \n\r  \nSo when IB asked us to hang out with CW more I felt I had to make it clear that unless I have to, ie. for the sake of their kids, I will not have anything to do with her going forward. Their never ending drama has done nothing but cause me constant stress and anxiety. I've already done my best to be LC with them as possible. CW can go pound sand for all I care.. or whatever random guy she's hooking up with that day. Our older brothers wife said more or less the same thing. She's also pregnant and is supposed to be on bed rest and avoiding stress as she has high blood pressure.\r  \n\r  \nWell IB didn't like our responses. He called us selfish b\\*tches for not even attempting to forgive CW. That she was the mother of his children (debatable) and that she won't be going anywhere anytime soon so we might as well learn to get along. That he loves her and she loves him (again debateable). He finished off with a jab at why my ex and I broke up. Saying that since I'm so selfish and only think about myself it's no wonder why he left me.\r  \n\r  \nI laughed and retorted, \"that's rich coming from a man who can't keep his wife from running off to sleep with other men and asking others to keep her in line. There's nothing more selfish than people wanting others to handle their problems for them.\"\r  \n\r  \nNow he's mad and giving everyone the silent treatment. Most of us our enjoying the silence. I don't think I'm TA, but some friends I vented to said it wouldn't kill me to help IB keep CW in line to keep the peace. \r  \n\r  \nSo, Aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "[removed]", "NTA\n\nBoundaries are absolutely necessary \n\nWhen your brother has cooled off, maybe if you want to have a talk with him and explain and lay it out in a kind way \n\nIf you want to. \n\nHe’s going to need support when his eyes finally get opened, and he finally stopped being dependent on this alleged human being", "Trying my best to. I think now unless it's about family stuff I won't be replying to IB anymore. Though I have already blocked CW awhile ago. Every message from her kept turning into her trying to get me on her side for their current fight.", "Honestly it regularly feels like we're fielding fights between 2 teenagers in their 1st serious relationship. It's very exhausting.", "Yes. They were mad about that. But because they're married they think we should try to keep the peace since I'll have to keep dealing with them in the future for at least birthdays and holidays.", "Already have. But because I did it anonymously I didn't get feedback aside from what IB learned. Apparently because there's no proof of neglect and abuse they basically just showed up, checked the house was safe, had a quick chat with each kid, and left. I wanna hope they're on the watch list.", "We can only hope. I'd love to have a whole week of silence from their nonsense at least. Help me catch up on sleep the stress took.", "I think that idiom might be lost on him lol.", "I made an attempt to early in their relationship as I do with all my brothers relationships. But after I noticed her true colours I just couldn't anymore. It's hard to be friendly to someone who believes the world revolves around them.", "I hate that phrase too. Why must I keep the peace? I'm not the one who disturbed it. I just wanted away from the stress.\n\nSo im doing my best to enjoy this silence. Been catching up on sleep whenever I can. People really underestimate how much stress gets you.", "The immediate family is actually in talks of pooling money together to afford that. Sadly most of us have pretty tight monthly budges since covid and 1 parent being retired. But if we do, we'd probably wait until baby #3 arrives. Do all 3 at the same time.\n\nThankfully my other brothers and I watch the kids semi regularly. So it shouldn't be too hard to get samples from them. Baby 3 especially should be easy since babies are drool machines. IB we might have to trick or just go with his hair.", "Yeah, we've all tried to get him to see reason. But it's like they both refuse to acknowledge that they shouldn't be together anymore if they're always fighting and she's always cheating. It's like talking to a brick wall.\n\nSo I decided that unless it's for the kids I'm done with the politeness she doesn't deserve. Best she gets is a mention in the Christmas card. Mostly so my 7yo nibling doesn't ask why their moms name isn't on the card too.", "Good plan. My cats and I have been enjoying the lack of stress and noise.", "Yeah we've tried telling him that before the silent treatment started. He didn't listen. I've tried to get several family members in some kind of therapy. But sadly no one listens to me. They all think I'm the weird one for being in therapy.. the denial is strong in this family apparently.", "That sounds like a great back up plan lol", "It's been waaaaay more than 3 times. We've confirmed at least a dozen. Most knew she was married too. IB needs some sense knocked into him somehow. This is not something the kids should be seeing and thinking is normal.", "I have made an anonymous report to CPS. They didn't really do much. They came, did a look around, talked with each kid, and left. I'm hoping they'll be kept on a watch list. They may not show or have proof, but these kids are not in a healthy home environment mentally.", "I've already placed anonymous reports to the CPS. They have barely done anything yet. But I'm hoping they're on a watch list. They think their neighbours placed the calls thankfully.", "Yeah. Idk why he thinks we could control a grown woman's actions.", "Pretty much how my oldest brothers wife seen it. There's no way they wouldn't find a reason to blame us.", "No clue. The immediate family is in talks to pool funds to get them all tested once baby #3 arrives. These things are pretty damn expensive for a reliable one though.", "Good thing I'm calling him IB - Idiot Brother for this lol.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your friends are idiots, so your supposed to babysit CW for your brother that's madness.", "Sounds exhausting. Maybe should let your brother know ... they need professional help & advice. Unless you’re a couples therapist .... you can’t help these people. Way above your pay grade. \n\nGood luck!", "Your friends lack experience and are naive. Or they've been through shit and are still jaded about the world. From what it sounds like, this confrontation has caused some peace to be kept.", "You might as well go full bore AH here and never have to deal with any of it ever again.", "Keep the peace, keep the peace!…What peace? Nothing about this situation, which the OTHER person is creating, is peaceful! There is no peace :)", "I mean you said yourself the silent treatment is going well for you, so I say let him continue and let him know you don't plan to support his relationship or be a tool in his relationship, so he should only contact you when he's needing help with the kids....not the wife.", "Well, pitter patter!", "like I said open marriage or divorce and it sounds like divorce would be the preferred option.", "Report every time, and ask others to also do it. A one-off is much different than an established pattern.", "Right? I'd rather babysit a class of hyper kindergarten kids. Would probably have better luck with keeping them out of trouble lol", "God I wish I could convince them to go to therapy. I've had no luck convincing anyone in my family to seek professional help. They all think I'm the weird one for being in therapy.", "A bit of both. The world and bad relationships have broken too many people. I hope this peace lasts a bit at least. I feel like if I keep dealing with CW I'm gonna say things I wasn't planning to say and causing bigger fights. And I think that would negatively affect the kids. They see enough fighting with their parents, they don't need it from everyone else too.", "Very tempting.", "It's pretty peaceful without them lol. Nice and quiet.. well, as quiet as a home gets with 2 young ish cats.", "Pretty much. Our oldest brother is thinking of doing the same thing. Keep the wife and their kid away from their nonsense as much as possible. Thankfully they got time to make solid plans. Their baby isn't due til around Halloween.", "If only we could convince them to divorce. For some reason they just won't. They usually say they stay together for the kids, but we're all pretty certain that's a lie.", "Planning on it. Thankfully they think it's their neighbours who called CPS. They're already on bad terms with most of them due to their constant fighting. Wouldn't surprise me if the really were calling CPS too. They don't like IB and CW, but they're nice to my other brothers and I and they've always been nice to the kids.", "🤣🤣🤣\n\nShe is definitely his problem.", "Shes certainly not my problem lol. I'd rather be in the middle of a Hurricane."]}