{"id": 27510, "submission_id": "16qho6g", "title": "AITA for not wanting to change restaurant plans for a vegetarian?", "selftext": "Added additional info to bottom:\n\nOur family of 13 that haven’t seen each other in awhile are planning to meet up for lunch.  Half the family decided on a specific restaurant to meet at.  The half that decided are from out of town and are driving an hour+ to meet up.\n\nAfter scheduling the meet up, it turns out there is nothing she can eat on the menu because she is vegetarian and gluten free. 1 out of the 13 people (a local) is a vegetarian the other 12 have no problem eating at this restaurant. \n\nMy wife thinks we are being assholes because we say we should NOT have to change our plans for one person. We think the vegetarian should eat before or after and just sit for an hour enjoying the families companies if there isn’t something on the menu they want. We do not think 12 people should change their plans to caterer to one person (we do not know if it’s vegetarian by choice or for a health reason). My wife thinks we should pick a restaurant with more vegetarian options. \n\nAre we the asshole for not wanting to change?\n\nAdditional information - when I mention above that there is nothing she can eat, that wasn’t accurate, but her words.  Are are salads that by default come with meat, but you can request not to include.  She said she didn’t want to do that.\n\nAlso, uncovered the vegetarianism is not for ethical reasons. She feels she’s gained wait. Please do not make convo about ethical nature of meat eating.", "created_utc": 1695509371, "permalink": "/r/AmItheAsshole/comments/16qho6g/aita_for_not_wanting_to_change_restaurant_plans/", "score": 147, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We did not change the restaurant which meant the vegetarian gluten-free family member had sit without eating.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO - is there a reason you have chosen this particular restaurant? Why don't you want to change venue?", "NTA\n\n>We do not think that 12 people should change their plans to caterer to one person\n\nGiven that there actually are options (salad) for her to eat, I fully agree.\n\nI am saying this as a celiac, sometimes you have to suck it up and eat the lettuce salad", "I’m trying to understand why dietary requirements were not considered before a restaurant was decided on. \n\nThe bit where I think you are being an AH is that you think your company is worth so much that someone should happily just sit and watch you eat, when presumably, unless you all talk with your mouth full, not a lot of interacting will be happening. Given the attitude that projects, she probably isn’t expecting to enjoy your company. \n\nIt’s really not difficult to find somewhere with options, this almost feels deliberate. \n\nAnd if you just remove the meat from a salad, without a substitute, there’s no protein, which won’t be filling or satisfying.", "I don't think you're an AH, but your not kind either.  As a vegetarian I never tell people were to eat.  I can always find something to eat.  The only request (not demand) I may  make is not eat at a seafood place because I can't take the smell.  But if the majority wants to go to one. I suck it up and go.  By the same token if I am with a carnivore, I would never pick a vegetarian restaurant.  I would want the people I am with to be comfortable even if it puts me out a little.  Kindness is never wrong.", "NTA- She's on a diet. There are salads. You can't carpet the world because 1 person refuses to wear shoes. Don't change your plans.", "I’ve been a vegetarian for 15+ years and usually I’m fine picking just a side or asking for a modification to a dish with meat in it, but some places (particularly in the American South) make that pretty difficult. Once in Texas I had a salad that was literally just lettuce and cheese without the chicken. That was the best option. Although I do agree that as a vegetarian we should be able to find something that will work for us, some places honestly make that difficult. I can guess them being GF adds to that. \n\nIf you don’t care if they are able to be included, why bother inviting them. YTA. The world doesn’t need to revolve around them but how hard is it to choose a restaurant that could give them at least a couple decent options?", "INFO: is the gluten-free thing by choice or due to health concerns? That may make it far more difficult for her. I find the gluten-free thing is more annoying than vegetarian", "INFO: Does the restaurant have any salads? And vegetables? Any soups? Or is it the Pork'n'Steak house?", "I love this,, \n\n\"We think the vegetarian should eat before or after and just sit for an hour enjoying the families companies if there isn’t something on the menu they want.\" It says everything about you and your wife.", "Yes & no. I find it really hard to believe this place doesn’t have a salad unless its a sushi place or something. But at the same time it’s really not hard to just pick another restaurant. Sounds like you both are being difficult.", "Meh, You're kind of the asshole, but I won't go full YTA.\n\nAs a Celiac who also doesn't eat meat, I would definitely appreciate someone choosing a place that could accommodate my needs (more the Celiac than the vegetarian, as veg is easier to accommodate), but personally, I will always take the reins and choose the spot, make the reservation and essentially take the initiative to take care of myself.\n\nJust some food for thought - while there may be something she *can* eat on the menu (yup, salad, always salad), being able to (maybe) be able to safely eat at a restaurant always being a salad really sucks.\n\nLastly, while I choose not to eat meat for ethical reasons, just because her reasons are different, it's irrelevant. It's still her choice, and you need to respect it.\n\nETA: Who are you referring to when you say \"we\"? Because from what you said, your wife doesn't agree with you, yet you keep saying \"we\". Don't lump her into your narrow-minded decision. \n\nAlso - how would you feel if someone told you to eat before going to a restaurant because a place has been chosen that can care for your needs? \n\nLike shit? As you should. But I don't think you'll ever see it that way, sadly.", "I have Questions!\n\nIs anyone of the other 11 people complaining about going somewhere else?\n\nIs there other restaurants in the area that are just as good for similar prices?", "YTA. This is a really inconsiderate thing to do to a family member. I’m a vegetarian with a few food allergies. It feels so crappy to have to get the side salad with no dressing while everyone else gets to enjoy a nice, complete meal. And you have to watch everyone else eat, adding insult to injury. How hard would it be to pick a restaurant where everyone can eat?", "Since you all sound like AHs, whoever she is , she should skip out on the meal completely, because who can enjoy the company of people who don’t give a shit about her? Especially because it sounds like the point of this meal was the restaurant, so putting the spin on it that it is mainly as “family time” is disingenuous.  \n\nAnd a lot of my judgment has not to do with whether adjustments can be made for her at that restaurant.  It has to do with how you talk about the issue. And the fact that you expect her to literally put up and shut up, and happily watch everybody else eat.", "YTA. this person should eat before hand and enjoy watching everyone else feasting?\n\nWhy don't you all just eat before and enjoy each other at a park setting? \n\nOn one hand, you are implying the eating isn't that important, and on the other that it is so important you can't even both to change the venue with days of advance notice.", "YTA. So what if it’s just one person? That is an entire human being who will have to sit and watch the rest of you eat a nice restaurant meal together. Yes, she’d still get the companionship of being around you, but a big part of having a meal together is *having a meal together*. I don’t understand why the rest of you would choose to leave her out when you could take fifteen minutes out of your life to find a different restaurant.", "YTA, she’s just asking for a restaurant with an option she can eat at. My child is gluten free and I couldn’t imagine expecting her to sit and watch everyone else eat when we easily could to to another restaurant.", "YTA\n\nExpecting someone to sit and watch everyone else eat is downright ridiculous.", "I'm on the fence here. It seems reasonable that if you meet up to pick a place where everybody can eat, but in large groups you really should follow what the group wants. If you meet up often enough, it would be nice to let her pick the restaurant every once in a while. I'm gonna say NTA.\n\nRegarding her reason is for weight loss though, I think she's going about this a silly way.\n\nRestaurants aren't exactly the best for dieting. Fat is flavor, and flavor is what sells. A lot of vegan places have such delicious tasting food because it's drenched in that flavorful fat. I love a delicious vegan meal, but expecting a meal at a vegan restaurant to be healthier than a salad at any other restaurant is a good way to gain weight -- if you think you're eating better when you're not, you're not going to pay as much attention to what's going into your body. \n\nEven if she just has a side or an appetizer while everybody else is eating, she can still enjoy some food and the company without sitting on the sidelines pouting. She could eat a full homemade meal before and after, then use this meal as a snack, spaced out ofc and it would probably be way healthier than a meal at different place that the rest of the group doesn't really want. \n\nBeing that we don't know what she actually wants, it's hard to say whether it would actually be healthier or not, but it's a pretty good guess that it whatever she has would be equally or less healthy than a salad.", "INFO: does the restaurant have gluten free options?\n\nA lot of sauces are usually not gluten free in my experience - in the event she was considering eating meat here the once.", "YTA. Don't invite someone to eat where they can't eat anything.", "YTA.. simply because every single sentence you wrote makes clear that you are an unbearable person. Also what dusty place even serves all their salads with default meat in 2023? Sounds disgusting.", "YTA. And a big one.\n\nOne: why don't YOU eat before the meeting and enjoy the company while she eats?\nTwo: what do they sell at that restaurant that you are refusing to go somewhere else?\nThree: if she's vegetarian because she wants to lose weight, you should support her and go somewhere she can enjoy a decent meal without breaking her diet. One of the most difficult parts of trying to lose weight is your family and friends not supporting you and preparing food (or going somewhere) you can't eat (or they eating something you can't in front of you), and where the only option available you'll find is a crappy plate full with lettuce and some tomato and onion.", "YTA Why wouldn't you want everyone to feel included and welcome?", "YTA. It would be one thing if there was even one thing on the menu this person could eat. \n\nI suggest that you contact the restaurant and see if they can do anything. My team wanted to go to a steakhouse and I was vegetarian at the time. They very graciously made me a nice plate of veggies. Normally I would say it’s up to your friend to call them, but you’ve been an AH and need a redemption arc.", "Just let the restaurant know or ask them for a vegetarian option.\n\nUsually they find a way.", "YTA for sure. \n\nI think it would be thoughtful to include the friend. Salad alone is not a complete meal. Y'all can eat anywhere. They have limited options. I couldn't enjoy my meal knowing someone gets nothing when a simple change of plans would allow everyone to have a meal. \n\n*However* I am vegan and am aware its a difficult diet to accommodate. I either plan ahead (check menus or nearby restaurants), eat ahead, or don't attend the meal if there isn't anything for me. I don't expect anyone to change plans to cater to my ethical choices (but literally all of my friends are thoughtful enough to consider my veganism and soy allergy when it comes to choosing a place to eat, so I don't often have this issue anymore). \n\nI do get upset when I am promised a vegan option for an volunteer event, a friend's dinner party, or wedding and the option isn't actually vegan or it is just a few chopped vegetables. The reason this is upsetting is that- in those instances- I was mislead and didn't prepare a meal for myself as I thought I'd have one. I end up hungry watching others eat.", "The group that decided were not aware the person was vegetarian.\n\nAlso worth noting the people from out of town specifically wanted to eat here.", "NTA, but I think everyone in this situation could have handled things better. I've been vegetarian for 24 years and if I was invited out to a place with no options for me to eat, I wouldn't go. Sorry, not sorry. I'd enjoy lunch on my own and meet up with people later.  If it was a big deal to see the people involved, I'd order the salad and no meat.  But also, if you know someone in your party has food sensitivities, it is a kind and welcoming gesture to choose a restaurant with options everyone can enjoy. \n\nAs a dietitian I can't help but wonder, gluten free? that doesn't help with weight loss. But whatever. to each his own.", "YTA and none of your comments have made you any less of an asshole.", "YTA. If you were the one person that had a diet restriction (by choice or by need) you’d want the large family to find an alternate restaurant. Is it really that difficult?", "YTA. You seriously want her to eat beforehand and just watch you all eat? That's ridiculous and entitled of you to expect that of her. There isn't anything for her to eat, including the salad that comes with meat. Asking her to \"just remove the meat\" is kinda disrespectful.  Why invite her at all if she can't eat anything there?", "NTA-It seems like from your addition that this person is only doing it for dietary weight loss purposes.   12-1 majority rules.", "NTA. Majority rules.  There may not be a lot of choices for her but I’m positive there are vegetarian options.  Heck a vegetarian can eat at McDonalds.", "So your position is \"Oh it's cool she can just eat a pile of lettuce while the rest of us enjoy a proper meal, or fuck it she can just get Taco Bell before or after!\"\n\nYes, that is true, and I'm sure she does it often when she must. But that's a really shitty fucking thing to do to a friend/family member when you're supposed to all be getting together and enjoying each other's company.\n\nSounds like there are plenty of other places you can go where EVERYONE can get something they can enjoy.\n\nMajor YTA. I'm no vegetarian but if I were her I'd tell you to go fuck yourselves.", "YTA\n\nThere is no shortage of restaurants that offer vegetarian options in addition to meat.  Why choose to exclude one person when it's easy to include everyone?\n\nTheir reason for being vegetarian is irrelevant.", "A lot of my extended family are vegan or vegetarian. Do you know what I do? Let them pick the restaurant.", "The vegetarian can call ahead and arrange something with the restaurant easily enough. NTA", "I can’t believe there is a restaurant with no vegetarian items on the menu. Finding a restaurant like that is a feat. YTA", "YTA it's definitely asshole behavior to go to a restaurant with family when one of the family members can't eat the food there. It's really not a big deal anyways. Just choose a different restaurant. You live there, you can go to the original restaurant whenever you want.", "There's no salad?", "NTA. After reading edits and comments, this person sounds like she’s being super difficult just to be difficult. This is all because she went on a diet to lose weight. Her want to lose weight should not be dictating where 13 other people get to eat. She has options at the place you chose she just doesn’t want them.", "Y’all are assholes. You’re telling that family member that she’s not really part of the family if you can’t be bothered to coordinate plans that accommodate her. If she insisted that you all eat at a vegetarian restaurant, then she’d be the asshole, but that doesn’t seem to be the case. You could find a place that works for everyone. If my family did this to me, I would hear the message they’re sending and not come. And seriously consider never joining them for anything again.  \n\nYTA.", "Is she REALLY gluten-free or is she just faking it because it is also a fad?  That said, I would find it highly surprising if she can't make one meal work out of side dishes or something altered.  I have a good friend who is vegetarian and she is great at it.\n\nNTA", "NTA \n\nShe can call the restaurant!\n\nAs someone who is gluten free, dairy free and wine has to be preservative free. I have called many a restaurant in my life.  \n\nHave even bought my own wine to a restaurant when it wasn’t a BYO place. \n\nRestaurants are usually really good. \n\nI’m also not coeliac so I explain I get sick from gluten but cross continuation is not dramatic. \n\nI’ve yet to come across a restaurant that can’t accommodate me when I’ve rang ahead.", "YTA most people wouldn't find it a problem to change a restaurant to something that has at least one vegetarian option. As a vegetarian I wouldn't want to eat in a place that has no meat free meals either, I'd be worried that even with my request they wouldn't prepare  my meal without meat but rather remove meat from something premade and that is not the same. Honestly if I were that person, I just wouldn't come with the way you're behaving, you obviously don't even like that person or else this wouldn't be an issue", "YTA, there’s nothing there she can eat that doesn’t suck. She’s also gluten free and a lot of salads aren’t v gluten free. Plus a salad without meat is worthless as a meal most the time. It’s ridiculous to ask her to sit there and eat nothing bc yam are too selfish to care if there is something there for everyone. It’s not like she shot down a bunch of restaurants. She said there isn’t anything there she can eat. And I don’t care if her dietary needs are ethical, allergic, or health based. You clearly don’t care about her as a person and it shows how unbelievably selfish you all are. \n\nJust pick a different restraint that has some decent gluten free/vegetarian options. Salads don’t count.", "NTA: the vegetarian chose that lifestyle...the rest of the group didn't.", "Did you know this person was vegetarian?  Did you know the restaurant wasn't vegetarian friendly?  If you knew the former and didn't bother to find out the latter, YTA.  I am not a vegetarian, but I like my friends to enjoy being with us.", "It sounds like the celiac vegan is volunteering to find a new restaurant that everyone else approves of, make reservations, and organize the meal. A lot of times it's easier to complain than do the work to get what they need.", "Is there a restaurant everyone would enjoy, or will there always be 1/13 unhappy. If there is one everyone would enjoy, YTA.", "Yta. You are imposing on the restaurant - most aren't happy with non-paying, non-eating people taking up space. And on the person you are either expecting to go without food while watching others eat or pack food to eat in car. But you are in a bind.\n\nI get that you are upset about disappointing the family who want to go to a specific restaurant and driving 2 hours to do so. Best solution is communication.\n\nTalk to everyone going. Explain problem. That restaurant looks great but X isn't catered for. Which is more important - food or family? X may be happy with meeting up for coffee before hand if local. And call restaurant - with warning, they may be able to cater or suggest an option like bringing food in and paying a cover.", "NTA, the person can stop with their ridiculous self limiting BS for one meal instead of expecting the world to revolve around them.", "YTA", "You're the asshole. \n\n\nYou decided to book a restaurant that catered to the 12 of you, but didn't think of booking a restaurant that catered for all 13 of you. \n\n\nExpecting someone to sit at a restaurant not having anything (because of dietry requirements) while the rest of you are enjoying a meal, is what makes you an asshole. Look into booking a restaurant that caters for all 13 of you.", "YTA.\nAccept it if this person doesn't want to come.\n\nFFS.", "nta. dint go if you don't think there are any options.  you aren't entitled to dictate a dinner based on 1 individual", "NTA really a restaurant that doesn't have vegetable sides ,she's being ridiculous", "Additional perspective - curious on comments about my specific perspective instead of that from the entire group.\n\nI have never drank and have spent my life going out to bars and parties with friends that do. I am always the odd man out, sitting without a drink in hand. It had never been a big deal for me (high school may have been a little rough).  I am willing to be flexible so my friends can have a good time. Is this not similar?", "NTA. As you mentioned, there are option for this person to yet. she needs to adapt to the world, not the world to her", "NTA I've been vegetarian for most of my life - I've eaten in every kind of restaurant including steakhouses. I've never not been able to eat, as long as you're paying full price and nice to your server they'll be more than happy to substitute, leave off or you can simply order appetizers for dinner. Your relative is making a big deal out of nothing.", "NTA.  Unless it's someone's birthday/graduation/special occasion - 1 person should not get to dictate where everyone else should be eating (or what they should be eating).  If 12 other people decided where they wanted to go - then that's where meal is going to be.", "NTA", "Nta", "YTA why would let someone starve? When all other 13 people can eat anywhere.", " As a vegetarian of many years who has attended events and things where there has been nothing I can eat, people will stare and judge you if they realise that one person isn’t eating because there isn’t anything they can eat - I’ve never made a big deal over it, but I’ve had other people sat at my table before who have and chatted mad shit about the host for not feeding all their guests. It’s your choice, but people around you probably will judge you. Personally, I wouldn’t be happy going out to a restaurant knowing one of the guests couldn’t eat there, but maybe that’s just me.\n\nThe fact that she’s gluten free does make things far more difficult. You may think she can “just eat the salads” but many salad dressings are not gluten free, and depending on the way they’re prepped they may not be easily made vegetarian either - it’s not uncommon for salads to be prepared ahead of time, and that includes the meat that is in them.", "NTA. If there is an actual viable option that she's refusing to consider and trying to make the whole thing about her food choices, then she should tough it out.", "YTA. Jesus Christ.", "Only about five percent of americans are vegetarian and only one percent vegan. If 95 percent of the family have agreed with this restaurant, then so be it.", "Honestly… she might be gluten free for health reasons that she doesn’t want to get into (autoimmune diseases, infertility issues, etc.) and is using vegetarian as a main complaint because of it. For some people, gluten sensitivity or allergy is like a peanut allergy - even a tiny bit can set off an immune response. Unless you’re making a reservation at the most special restaurant ever, I don’t really see why you can’t just go to another restaurant.", "NTA, I was vegetarian for 5 years and have been vegan since, 7 years, and I just ask for the restaurant as I also have celiac. if there’s nothing I can eat, I eat before and order a soda and enjoy family time", "YTA\n\nLike it's that hard to pick a place that has an entree that is vegetarian and gluten free", "yes YTA. You also mentioned she’s gluten free and for some people that can be really serious. It’s certainly more serious than the vegetarian. \n\nAnd as a gf person I can say candidly that even though we often say we are used to not having options to eat, doesn’t mean we are happy or don’t feel left out in a situation where our eating options are limited to none.", "NTA but why is this even your problem? If she wants a different restaurant she should be the one to coordinate that with the group and hopefully find something everyone likes.", "NTA. It's a choice not an allergy, and there are vegetarian friendly items on the menu, they just would prefer to not have them, then that is their issue. I don't eat seafood and went to a seafood place with family because they love the place. I had a salad. If you were going an asian restaurant and they had a peanut allergy then you'd be the asshole to not change the location, but this is just a choice they made for a diet to lose weight. They can have a salad for one meal (which is a typical weight loss dish).", "NTA, there ARE things she can eat, she just chooses not to. Everyone's plans don't have to change for her diet.", "NTA. Only because I grew up the vegetarian in a full meat eater family and you learn to find things you can eat. I can understand that it’s frustrating as a lot of restaurants really don’t carry any good vegan or vegetarian food and maybe that’s where her feelings are stemming from but changing plans for one person out of 12 isn’t fair. This would be very different if it was a group of 4 and one person didn’t like the restaurant choice", "Nta As a veggie. Im always the first to say \"dont worry about me, Ill figure it out.\" and I do.", "NTA I doubt there's absolutely nothing at all they can eat", "NTA\n\nThere are option at this restaurant... she's just being a PITA.\n\nWhere does she want to go?", "Additional note - argument from half the group is that why should the majority give up what they want because one does not want to. If 12 people wanted to see Oppenheimer and one wanted to see Barbie, what movie should the group see?", "NTA", "NTA, especially since you added the detail that it's strictly a fad diet choice. She can lose more weight by eating nothing than eating lettuce. Which as you've pointed out is also available anyway.", "NTA - there are thing to eat for the veggie. It’s not on to change restaurant for one persons choice.", "Hopefully the family member knows that diet alone won't help. Exercise is very important as well. That being said your family member is being picky and their options should be pick something and eat or don't eat, or stay home.\n\nNTA", "NTA", "NTA \nI'm a vegetarian and personally, I wouldn't make my family cater to me and change restaurants.. but that's not what she's doing right? I mean, it's your wife who is calling you out. I can understand where she's coming from though. if she's trying to lose weight, she can have the salad. mmm", "This family member does have options. She can eat a vegetarian meal they do provide, or she can eat meat in a smaller portion meal if weight loss is the driver here. It’s unfair to make everyone else change when there are options available. NTA", "So she thinks her choice to go on a diet should decide what restaurant 13 people eat at? Bullshit! She can get a salad...quite frankly a chicken salad would be more conducive to losing weight but whatever. There are things she can have, she just doesn't want them. Why can't she just request a few sides? Those are usually vegetables. I would have a different opinion if this was allergy based (like she's allergic to seafood and they wanted a fish restaurant) but this is probably vanity driven so I don't think ya'll should be switching if everyone else already agreed. NTA", "YTA, but I think you just don’t get it. For them being the vegetarian and having one choice while everyone else has the entire menu feels exclusive. If they are the only one with dietary constraints I’m sure you could have found another place to include the whole family. This has happened to be before and it’s not the end of the world, but I’ve ordered things I don’t like or left hungry. Makes you the odd man out", "NTA", "There are vegetarians, and there are entitled vegetarians.  She doesn't need to go if she is directing everybody's choice", "NTA", "Yup nothing wrong with a salad. Sounds like it’d be good for her. Not fat shaming as I’m also not super skinny and trying to eat healthier. NTA", "YTA. You are telling me that out of every restaurant that can accommodate everyone, you are choosing a restaurant that can’t? Is it really that hard to find a restaurant that offers vegetarian food? \n\nIf you want to be inclusive of your whole family, you accommodate. Otherwise don’t consider them family", "YTA \n\nDoes it matter that she said the word vegetarian?  If she simply said \"There is nothing on the menu that I like,\" would that have been better for you?\n\nEither admit you're okay with excluding her or be willing to explore another option.", "How much effort would it take to find another restaurant with more veggie and gluten free options?", "YTA. \nYour argument about vegetarianism being a choice goes both ways. You have *chosen* to eat flesh and animal by-products, which one person will not eat. Meanwhile you are refusing to eat food that hasn’t been slaughtered or taken from an udder first. \nThat’s your **choice** too, even though being in a place that serves soup, salad, sides without meat or fish won’t kill you. Allow me a LOL. \n\nYou could easily, and I mean EASILY find a place that serves food that everyone can eat. Who’s being selfish here?\n\nEdited: punctuation.\n\nEdited: My reference to animal by-products and udders is irrelevant, as they aren’t even vegan, they are only vegetarian. I’m doubling down on my judgement.", "NTA, I think gluten free is more of an issue than vegetarian. Gluten free people think every meal should revolve around them no matter how many others it inconveniences. I have a gluten free tyrant um relative who uses that as an excuse to force every family meal to a Mexican restaurant -- the one cuisine I don't like and everyone knows it. If I agree to attend, I just order water and contribute $5 to the bill (but the gluten free relative would NEVER do that at a restaurant we might all like).", "I have dietary restrictions so severe that I risk getting sick just sitting in some restaurants. \n\nI wouldn’t expect someone to choose a restaurant based on my dietary needs. It would be nice if they’d let me pick, but it’s not expected. On the other hand, I DO expect my friends and family not to give me a hard time for declining the invitation. I’m perfectly happy cooking for myself at home and enjoying some quiet time. \n\nSo anyway, I can’t vote because I don’t feel like o know the whole story, including whether this restaurant was specifically chosen in order to make her feel excluded, or whether her dietary restrictions are severe enough that she risks her health by ordering a “salad, hold the meat and the croutons” at the restaurant you’re going to.", "I mean maybe not an AH but come on, this is a family get together and you can't make it so everyone has a good time? Do you hate this woman? How would you feel if it were you? There has to be some compromise surely, you can't invite people to eat and then say \"but not you, you have to sit and watch us\" \n\nI'll go with ESH you could be nicer and she could eat something low calorie for one meal", "ESH. As her reason is not for ethical reasons, she can take a break for the day. You and the others suck because you didn’t bother to find that out first. If someone can’t eat anything on the menu and you want to catch up with them, you go somewhere they can eat. No one wants to sit around watching other people eat.", "Esh. You’re already fighting before the dinner. Why not then just make it a potluck? Then ppl can bring what they want to eat.", "Okay when I first read it I was thinking YTA - but with the added information I gotta say ESH. \n\n13 of you are families - what are you if you can’t support one of the families’ dietary requirements? I grow up in a omnivorous household- now I am transitioning to vegan. My mum has been very supportive. \n\nShe’s an asshole for not comprising with vegetarian options available for her. And being vegetarian doesn’t mean it’s healthy", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOur family of 13 that haven’t seen each other in awhile are planning to meet up for lunch.  Half the family decided on a specific restaurant to meet at.  The half that decided are from out of town and are driving an hour+ to meet up.\n\nAfter scheduling the meet up, it turns out there is nothing she can eat on the menu because she is vegetarian and gluten free. 1 out of the 13 people (a local) is a vegetarian the other 12 have no problem eating at this restaurant. \n\nMy wife thinks we are being assholes because we say we should NOT have to change our plans for one person. We think the vegetarian should eat before or after and just sit for an hour enjoying the families companies if there isn’t something on the menu they want. We do not think 12 people should change their plans to caterer to one person (we do not know if it’s vegetarian by choice or for a health reason). My wife thinks we should pick a restaurant with more vegetarian options. \n\nAre we the asshole for not wanting to change?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: Did you want to eat there or do you have no problem eating there? It seems the hassle isn’t that big if you “have no problem,” but if this is something specific people are excited for, I can understand.", "Nta\n\nHer decision.  If she does not like the menu, she should stay away", "NTA. The vegetarian is the one who should adjust. They should be used to the scenario by now and prepare for it. The info you've added makes me think the person is an attention seeker.", "NTA. I find it hard to believe that there's absolutely nothing on the menu that the vegetarian can eat. Where are you going? Even a steak house has a salad bar", "NTA I find it extremely hard to believe there isn’t anything a vegetarian can eat a vegan maybe and even then you’re right they are local and can eat before or after if they are gonna be so difficult.", "Just call the bloody restaurant! For the sake of keeping a group of 13 paying diners, I'd be *very* surprised if they couldn't offer something suitable to accommodate the veggie. How difficult is a stuffed aubergine or something of that ilk with a side salad?", "NTA. 12 people should not have to bend to the dietary ; not medical, choice of ONE. The excuse of weight gain is on her. Everyone else should not be punished for it.", "I dunno what kind of restaurant you’re going to, but 13 people would not be an insubstantial transaction for the business, so you’d think they’d be a little bit accommodating… has anyone thought to call them up and see whether the chef has anything up his sleeve?  See what they’ll do for their 20% tip… NTA, but not very accommodating for a family member, even if she is being precious…", "NTA\n\nI've been a vegetarian for 31 years.  I never expect others to change plans for my dietary restrictions.  I know that my menu choices are limited at most restaurants.  It's not a big deal to order a salad or side items (fries, macaroni, etc.) for my meal.\n\nIt's ridiculous that 1 person expects you all to change your plans for her.", "INFO\n\nDepends on the restaurant, and depends on how strict the diet is. \n\nAlso who is the \"she\"? I'm a little confused as to whether your wife or someone else is vegetarian. If the vegetarian says it's fine, why does your wife care? \n\nOne definite a$$hole remark you gave is to tell someone to eat before or after, and just enjoy everyone's company. I don't know about your group of people, but I don't want to see anyone that badly. If the person in question suggests it, that's fine, but for you to basically tell to suck it up is rude. This certainly puts you in a pickle if people are desperate to go to this specific restaurant. \n\nI've been to restaurants where the sides are cooked with bacon, and like other people said, lard. Some mac'n'cheese recipes are not GF, and have a lot of calories either way. Trying to think of what other sides there might be, aside from various forms of potatoes, which aren't great for dieting. Soup is hit-or-miss. \n\nIf she's looking after her weight, just be careful with the salads because some of the big fancy ones at restaurants have a lot of calories, due to candied nuts, lots of cheese, lots of dressing, volume of food, etc. Plus if she isn't getting protein and fiber, she might not feel full, and could end up snacking.", "Only read title nta.\nVegetarians and vegans is a choice that should not affect others. Most restaurants have salad.", "NTA. Of course 12 people shouldn't change their dinner plates just to cater to 1 person's diet. Is this a joke?", "As a vegetarian, there are always options. Even if it’s just salad and fries. If she’s vegan that’s a different story but I’ve never been to a restaurant where there’s literally nothing I can’t eat. NTA.", "NTA there is something she can eat I’m sure.", "NTA.  There is almost always something, it just may not be exciting meal wise.  I also have to avoid gluten.  If she doesn't feel like salad she can get a baked potato, side veggies, beans, fruit cups, chips and dip, rice, fries, ice cream, meatless tacos.  I have a sister that is vegetarian.  She always says there is something, you just have to look and ask.  Plus many places now have gluten free options or meatless substitutions.  If we both go somewhere and aren't sure we will find something we like we snack a little just in case.  Sometimes it is a little bland when I get mashed potatoes not without the gravy, but if she eats dairy she cans still have food with something to give it flavor.  It feels more like she wants it catered to her.  You never can please everyone, and she should at least go  and enjoy the company.", "She just does not like the options she can scoot NTA", "I'm leaning toward Y T A on this with what's currently presented.\n\nThat you didn't know they were vegetarian/gluten-free ahead of time suggests to me that you don't see them often, and it feels pretty rude to exclude someone from a meal (which is what this is, even if they were sitting at the table with a glorified side salad) when they don't see you often, especially when the reason is \"we *want* to eat here instead of somewhere that has actual meals you can have\" rather than \"someone else also has dietary restrictions that conflict with yours\" or something similar.\n\nSimilarly, if you go out to eat with them often, and they're always having to \"make due\" with a bowl of iceberg lettuce and some sprinkles of shredded cheese? That wears on you a lot, especially coming from family members, and doubly so if anyone at the table is making sideways comments about what you're eating or not eating.\n\nIf you're going out with this person often and usually accommodate, I lean more toward N T A. And I also lean more that direction if the gluten-free part of this, like the vegetarianism, is optional versus medical.\n\nI have a similar and more extreme set of dietary restrictions to this person, and I'll suck it up and drink a soda and pack a protein bar a lot of the time, especially for other people's weddings/birthdays/etc. But it sucks, and if my relationship with someone is conditional around me *always* doing that (either because that's the only time I see them or because that's the way they always treat my dietary needs), usually that means the relationship is probably fading away. Even if it's with family. Though I will also note that my major restrictions are for medical reasons, so they're \"optional\" in the same way choosing not to poison yourself is, which does change context a little.\n\nYou're right that 12 is greater than 1. If that 1 person matters to you, though? Consider how demonstrating an unwillingness to accommodate them - even if their restrictions are \"optional\" in service to a weight loss goal they have for themselves instead of a medical need or ethical stance - is likely to impact how willing they are to spend time with you in the future. Because they would not be unreasonable for skipping meals where they don't actually get to eat a meal or for refusing to spend time with people who expect them to attend them anyway, especially if trying to advocate for themselves turns them into the \"family troublemaker.\"", "If she is gluten free for health reason then yta.\nCrosscontamination can be dangerous and therefore asking the restaurant to remover items from the salad wouldn't be enough. \n\nIf it's all to lose weight (which gluten free doesn't really help with all that much) then she is just being difficult. \n\nEither way in my family we wouldve changed the restaurant to accomodate everyone, so I don't really get this stance.", "As a vegetarian, who has never eaten meat, i wouldn't care. There are always salads, fries, breads, cheeses etc. Or I'd eat before and just have drinks there. But has she actually said she won't go unless the venue is changed? She might not really care and was just mentioning there's not many veggie options.", "Nta", "Just saying... this would never be a problem in India. LOL. Even the non-vegetarians relish the veg meal options available. I've never seen a restaurant here where at least half the menu wasn't vegetarian.", "NTA - fuq them vegetarians", "There's  a peaceful way to solve this issue. She can suggest other places if you like them then go for it. If not she can eat a salad\n\nI was fasting during a team lunch and i had fun with my colleagues. She can survive ! NTA", "YTA. At the start you say she is vegetarian and gluten free, but you only focus on vegetarian? If she has celiac diesels that’s a medical condition that has to be taken seriously, and also some people can’t physically eat meat without being physically sick. \nI believe you are most probably an asshole. I don’t see the issue of changing the restaurant. You are saying your relative is not important and that is rude.", "YTA. Have you ever been on the side of the person literally not having anything to eat, while everyone else is praising the food and enjoying themselves, bonding over it? \n\nIt's extremely rude, and the person won't forget. It's happened to me, many times do to a family never caring about my health problems, so they let me sit there. And looked sad at me for not being able to eat. Well they made it so never choosing options I could have, they could have asked me but never included me. I'm so happy I don't have to see them anymore.", "YTA. And I say this as a meat-eater.", "You say shes vegetarian and gluten free but only talk about the vegetarian.   \nBut if she needs a glutenfree diet she really has less options. Because she can't eat the bread and many of the sides that are offered.   \n\n\nAnyways I'd ask the restaurant if they offer something gluten and meat free without just removing something from a standard meal.   \n\n\nOtherwise I'd just order something from a differend restaurant and make sure with the owner its okay if one out of 13 brings their own food due to dietary reasons.", "As someone who is vegetarian and has coeliacs - sometimes there is only one option available and it may not be one I like that much (sometimes its just a side salad or a starter) - and if that is the case I'd say still go for it and she just eats that option\n\nIf there genuinely is nothing then either change the venue - or accept that she isn't coming - the 'eat before then sit there with nothing' isn't a valid option either IMHO and sometimes I will just back out", "YTA. I would one hundred percent not attend this family gathering if I was her. Way to make someone feel welcome and included. You don't even have to do the cooking yourselves, so I don't understand what the big gripe is.", "YTA.\nYou are planning this in advance. This is not something you stumble upon and needs to make it work and compromise and this is not the only option available.\nI can just imagine the uproar if you would be forced to go to a veggie restaurant and be told ' just eat some meat before and enjoy our company'\nYou are happy to plan for two of your group to have a bad experience just because you are either lazy or ideological ( I suspect the latter), both make you the AH.\n( I am a meat eater btw, not that it should make a difference)", "NTA. At least to me, you aren’t. I have many food  restrictions….like several. People sometimes are worried about me and it’s very kind, but I tell them “I’ll figure it out”. I’m there because they want my company, not because I need so desperately to eat at that restaurant, ya know? And I can usually scrounge up at least a couple thinks to eat! Even if that’s veggie sticks and reach with some French fries, or a drink and some breadsticks! Like, I’ll make it work, but it’s my job to manage my food sensitivity! If I really can’t find something I may bring a snack too haha", "Sounds like a play for attention. I am pescatarian and there have definitely been times I am eating a salad when with a group. Since her concern is weight, she should be happy with the salad. NTA", "I’m curious about this as well, what kind of restaurant is it? Is it famous locally? Why are they all so set on it?", "Yeah I was also wondering how long after scheduling they discovered the issue and how long there still is to change plans\n\nTrying to make n last minute plans to eat out with 13 is tough so it could be too late, I get it\n\nBut beyond that, you’re trying to get together with family and risking that this person will just stay home instead of sitting around watching you eat. Do you to feel ‘right’ about this more than you want to see this person?", "I was a vegetarian by choice for a long time. I could ALWAYS find something on the menu to eat, even if it was ordering a baked potato, fries, salad, etc. I never expected people to cater to my dietary choice. Even in the deep South, when my friends wanted to go to a BBQ Pit place where every menu item was meat based, I ordered a few sides that were meat free. So here you have ONE person who wants the other TWELVE to rearrange plans to go to a different restaurant because it must have an entree they really like. NOPE. That's BS.", "Try calling the restaurant to see if they’ll allow her to bring food in.  With such a large group - especially if you reserved a party area for more privacy, they might be agreeable.", "Celiac here too. Lots of salad, lol, but always better then nothing 🤷‍♀️", "That and almost everywhere now has V/GF options... salads, fries, pasta, soup, burgers. Even the pub down the road from me has the option of gluten free burger buns and pasta of the day.", "Obviously assuming here, but if this person used the words \"gluten free\" I think they're a picky eater who follows fads, not a celiac. Because, well, celiac is already a very specific word. \n\nNow, people have the right to be picky eaters and to nit eat whatever they want. But yes you can't make 12 people change restaurants because you don't want to order a perfectly good salad. Op it NTA", "It was this line for me. If he had left that out, I'd probably be N A H.", "This is how i feel about it. My best friend is vegetarian, I'm very much not. Whenever we go out to eat thats one of my chief concerns. She loves appetizers so even at a steak house there is usually something she can eat off of that, but I cant imagine being so rude and picking some place she only had one option/no entree. It just seems so odd to me.", "Apparently the vegetarian thing is because of a temporary diet not because of a lifestyle choice. And there are salads that can be ordered without meat but that’s been kiboshed. \n\nOtherwise I do agree with you. I don’t eat shellfish and pork for religious reasons. And normally I’m the one checking and suggesting restaurants so I can make sure there’s something I can eat on the menu. I’ve also dieted and the whole cutting out food groups never worked, if anything I had to quit because I was starving since my diet was compromised. \n\nSo maybe they could pick a restaurant with a wider variety but idk something about this feels like it’s kind of on the line for me, especially as there are options the family member can choose from and this is a recent thing that people wouldn’t have known about.", "same. vegan here. i never impose my shit on others. if everyone wants to go somewhere, i’ll ensure i’ve eaten enough beforehand.", "Exactly. I was literally barefoot for roundabout 4-5 years, whenever I could be (had a pair of flip flops in the car for shops and restaurants and whatnot). Guess what? You develop callouses thick enough to walk over broken glass, you don't ask the world to change.", "As a vegan I’ve had places serve me a bowl of lettuce with packets of vinegar before. That’s it. There was literally no other option.", "Why change the place where everyone else wants to go just for this one person who, as per OP edit is just trying to lose a bit of weight? Nothing to do with ethics/lifestyle/health.... Literally just to lose a bit of weight. If they're trying to lose weight they could easily find something to fit the bill at the restaurant", "Not sure. Didn’t want to pry. The complaints from her end were all vegetarian related.", "Salads have meat on them by default.", "Not his wife, she's the one who thinks they're being assholes not to change the restaurant.", "While the vegetarian is like \"I cant eat anything here (altough there ARE options) so lets just eat somewhere else that I like, and the family from OUT OF TOWN who SPECIFICALLY chose this restaurant (being out of town means they cant just go there themselves any other day) have to suck it up\". Tells you everything you need to know about the vegetarian.", "Have you ever been to a sushi restaurant? Definitely can eat vegetarian pretty easily.", "In the anglosphere, (idk where OP is from) restaurants have the obligation to cater to all dietary requirements and each possible combination of them. Now, if I was in a group of 12 people and I didn't \"prefer\" anything on the menu, I'd just order the thing that I \"could\" eat and deal with it. \n\nSometimes if you're in a group you just have to roll with it.", "According to an edit by OP, said person does not have any allergies, they 'want to lose a few pounds', so T.S. for anyone that isn't her.", "Actually a park meeting came up. And that did seem to be a fair compromise, but fizzled out. Not sure why.", "There’s always something to eat at a restaurant if you’re vegetarian and/or gluten free. I’ve been gluten free since 2007, and I’ve been vegetarian and vegan on and off since then. There are salads always. And often you can order something that’s not on the menu but a variation of what they serve. For example, a baked potato with sautéed vegetables. It’s not that hard and I would never expect 12 people to cater to my needs. I can figure it out on my own.", "Or perhaps she needs to be more flexible and select sides or other items that would work for her.  The whole 'an entire human being\" thing is an appeal to emotion.", "The woman isn't vegetarian, she temporarily cutting out meat as she is trying to lose weight. There are vegetarian options but she doesn't want those.", "But there *is* food the vegetarian can eat. She’s choosing not to.", "Also, she's not asking for a vegetarian restaurant, just an option she can eat. Personally I try to choose restaurants which have something that everyone can eat. It's really not that big an ask. I live in Asia and when I eat with others we always pick a place with a veggie option, even my traditional asian in-laws can understand that. And a salad without the meat would just be vegetables, she'd be so hungry after that.", "I've got a vegetarian friend but she's also fussy, she won't eat mushrooms, tomatoes and a bunch of other main vegetables. (I'll added I don't really like mushrooms or tomatoes either but I have less limitations eating meat)\n\nThere's been numerous occasions where we have skipped certain restaurants (planned restaurant but also when walking around) due to her not liking the menu and the we've ended up eating somewhere where no one else enjoys themselves.\n\nExample: we skipped a restaurant because they only thing she would eat were the hot chips and they had steamed veggies which she did want, ok fair. We ended up going to a fish n chip place and she got hot chips and a bubble and squeak... the other 4 of us didn't feel like greasy fish n chips and the place was average at best.\n\nThere's dozens more examples, it's taken me awhile to get to this point.\n\nPersonally I'm putting my foot down and I've said I won't be catering to her picky vegetarian tastes anymore when we are out, nearly everywhere has items catering to vegetarian/vegans these days, if you don't like what they offer, to bad. \n\nI'll add I always make sure there are vegetarian options available when out and I always make sure to have food available for her when she comes round to my place on top of supplying for others.\n\nThere's are options on the menu for the person OP is talking about, they just don't want them. This is the same thing I've experienced. She's more than capable of going along for a few drinks and spending time with her family and If she really wants something to eat there are vegetarian options for her or she can choose (in this case OP mentioned her food restrictions are for losing weight) to have a non vegetarian option on the menu for this once off occasion.\n\nNTA.", "This was the rude part to me.  Not the restaurant choice, but it came across as weirdly controlling to expect them to sit and enjoy watching everyone else eat.", "I don't understand why this is so hard for OP to understand.", "She's on a diet , so 'temporarily vegetarian ' whatever t f that means.", "This is the best suggestion.", "Also. This is family y'all haven't seen in a long time. I do all I can to make sure my family feels included and fed! I couldn't imagine letting a family member go hungry while everyone else is eating.", "Vegan with a soy allergy sounds challenging as far as ongoing meal planning and cooking for oneself, not even considering eating out! I'm sure you've found creative options but as someone just beginning to explore vegan recipes for an anticipated house guest at Thanksgiving, I immediately think of various forms of tofu. Vegan with celiac restrictions...makes my uninformed head spin.", "A salad and side dishes can be combined to make a complete meal.", "She is not an ethical vegetarian/vegan. She 'wants to lose a few pounds' so meat has been given the heave-ho.", "So having the info that someone is vegetarian in the group and that the chosen restaurant doesn't have a vegetarian entrée for them, have you brought forth that information to the rest of the group and asked if their willing to chose a restaurant that offers both meat based and vegetarian entrées?", "You can all eat elsewhere.\n\nThis person can NOT eat there.\n\nWhy is this a hill to die on?\n\nYou obviously don't care about this person...", "Ops responses have been just fine. You’re all crazy.", "She’s vegetarian and gluten free. Find me something at McDonald’s that fits both of those. You can’t. The fries have meat and wheat in them. The salads have croutons already in them.", "He says even the salads have meat, why do you assume there's vegetarian options?", "She's not a habitual vegetarian either.  She's just on a fad diet and wants the rest of the group to go fuck themselves like you said.", "Not \"can't.\" \"Doesn't want to.\"", "She can eat some of the food (eg salads). She is just choosing not to. Also going vegetarian to try and lose weight is just plain stupid. There’s usually a lot less calories in lean meat than most veggie alternatives.", "The thing is she isn't even a habitual vegetarian.  She is just on a weight loss kick and has given meat the heave-ho.", "Not celiac, not truly vegan, just dieting, and not willing to do the work as you said.\nNTA", "Interesting take adding in restaurants perspective.", "On that note though, restaurants have an obligation to cater to any and all dietary restrictions. Even steakhouses have seafood and vegetarian options these days. \n\nI'd say more that the GF Veg. individual didn't \"like\" any of the options on the menu, rather than there being none.", "Again, this isn't an equal comparison.  Bars and parties generally have non-alcoholic drinks there too.", "Not an equal comparison at all. I attend parties and don't drink alcohol, but I get a seltzer with lime or an NA beer. I can enjoy my beverage while everyone enjoys theirs. Someone have no food while others eat food when there was and option to be inclusive the whole time is just intentionally impolite.", "I am a vegan, and I haven’t had a drink since 2005. \n\nWhen I go out to a party or a bar I expect other people to drink and be drunk. Because that is the environment I’m walking into and I have zero problem knowing that I will be asking the bar for water all night. \n\nWhen I am asked to go out for dinner I check the menu to see if there is anything I can eat. I am a vegan for health reasons not moral ones. Sometimes there is nothing on a menu for me to eat except maybe French fries or an iceberg salad with tomatoes. Neither of which are an actual meal.\n\nIf I find myself in one of these situations like for a work meeting, I make do. Generally I have water or tea and makeup some reason, but it tends to make the rest of the party feel odd for enjoying their meal.\n\nIf I’m going out with friends they generally ask to make sure there’s something I can eat. And with family? They will look at the menu first before suggesting a place to eat. Not by my request, I don’t mind if we are going somewhere they really want to eat, but it’s usually because they care and want me to enjoy myself. \n\nIt sounds to me like no one in the family actually cares about this person.", "Why can the family not pick another restaurant though? Majority of restaurants will have something everyone can eat... pick something everyone can at least have a meal at.\n\nThey act like driving an hour means the family will never be able to go to this restaurant if it's not on this occasion", "I don't think this is a good analogy, seeing a movie you might not be really interested in, is different than watching your family eat without you", "Because if you don't change restaurants ONE PERSON CAN NOT EAT.\n\nThis isn't comparable to a movie preference and you know it.\n\nY'all are selfish as hell.", "I disagree. The restaurant has the obligation to meet any combination of dietary requirements. If it takes group bookings it should understand that it needs to have a range of dishes suitable for people who would be dragged there. \n\nI mean, even steakhouses usually have a couple of vegetarian and seafood options. \n\nI'd also like to add that a vegetarian dish means a proper main course that isn't just a salad, a GF option that isn't just a salad etc. \n\nIf the restaurant cannot offer a GF Veg option that isn't just \"a salad without the meat\" then the restaurant is TA, not the family who all wanted to go there.\n\nIf the GF Veg. person has a range of options but they just \"didn't like them\" then they are the asshole. Same as if someone with no dietary restrictions was kicking up a stink if they didn't like any menu options. Sometimes you have to suck it up and do what the majority would prefer.", "The discussion is not on the ethical nature of eating meat.", "12 people choose to eat what’s available. One choose not to. Guess who doesn’t get to control what 12 other people eat?", "Most people don’t go gluten-free for the hell of it and you sound like a jerk.", "Apparently, it is a restaurant that serves only meat, meat-salads, meat-potatoes, and meat-vegetables.  And meat-soda.", "Sometimes the sides at good BBQ places can be the best part too", "Soooo I thought we were supposed to talk about ethical nature of meat eating or something like that. Anyone? /s", "Such a reasonable suggestion.  No harm in asking the question.", "It’s ridiculous if your family won’t go to a restaurant where you have more of an option than a salad.", "I'm the only vegetarian in a pretty large family and they would either pick a place where I had at least an option or call ahead and ask if it was possible to provide one. The past years my mother really started to prefer veggies over meat anyway, so if we go somewhere she tends to pick vegetarian restaurants.", "i would only order a salad-with-meat without the meat if the price was also without the meat.", "My BIL is a vegan, and I always host the big dinner holidays. I try and be super careful with everyone. But I'm dealing with over  12 people who also have food preferences. Anyways during one dinner, I mixed the spoons, and I was honestly so upset, because I figured I'd have to throw his vegan meal out and start again.\n\n And he was was like, \"It's just a spoon, don't worry, thanks for making me a separate meal.\" And I'm not saying all vegans have to do that, but it was the kindest thing he could've done.  \n\nI love him so much for this. I was trying to be careful, but I just put the wrong spoon in the wrong pot and I automatically was like.... \"okay time to toss it all and start again.\" Thankfully he was very sweet about it. And I really try and respect how everyone wants to eat but it was honestly an accident.", "Wish all vegans were like you. Granted, most are and it’s just the obnoxious vocal minority, but that’s true for most groups to be fair. Regardless, major props.", "Honestly as a vegetarian myself, this seems odd. I’ve never been to a restaurant where there is nothing I can eat. Even steakhouses have salads, pastas, etc.", "Hmm... okay. \n\nI can't really decide on a judgment, this is tough. I was vegan for a couple years in college and it really wasn't hard for me to settle for stuff like French fries (I couldn't bother worrying about cross contamination). But it made people feel weird anyway, so they didn't really invite me out for food anymore. \n\nI wasn't difficult, but other people would get stressed over finding somewhere for me, and I hated that. I didn't wanna be a bother. \n\nI think it could go either way. I think you have a choice to be more accommodating, but she could also be a little less difficult. If this is a restaurant where you can make changes to items on the menu, she should not have too much trouble, I don't think.", "Can one customize the salad by asking for no meat? Genuinely asking. \n\nI find that I can always find something to eat anywhere I go, even if there are slight alterations needed.", "What the hell kind of restaurant sells meat-based salads only", "The only options are salads with meat. That is not an option. Taking out the meat will leave her with a few pieces of lettuce and a crouton and that's _if_ the restaurant will actually do that and OP isn't just assuming they will.", "And gluten free.", "Restaurants can serve whatever food they like. There is no legal obligation to cater to every possible dietary requirement.", "No matter how many times you claim this, no restaurant is legally, socially or morally obligated to accommodate dietary requirements be it vegan, vegetarian, halal, kosher etc. I could see MAYBE it being a law in SOME places for gluten free, lactose intolerance or allergy related restrictions, but the others are lifestyle choices that may or may not have ethical, religious or heath motivations.\n\nPrivately owned restaurants are not obligated to serve every variant of diet and restriction, combined or singular.", "This depends a lot on where you live and what level of \"gluten free\" your food needs to be. There are a lot of restaurants local to me (midwest USA) where I can't trust anything at all as someone who gets ill from even a little cross contamination and a lot of meals I've gone to where my only option was a soda and a protein bar from my purse.", "I disagree, truly eating gluten free is extremely difficult at restraunts. Paper straws, salad dressing, cross contamination, shared fryers/stoves are all things you have to worry about. If she has Celiac then she may be severely limited to restraunts.", "I'm also gf and veggie and I think this depends on where you live. I've certainly seen restaurants where it's absolutely not safe to eat and/or there is nothing on the menu I could eat. Plenty of restaurants don't do salads or baked potatoes – consider Chinese food, for example. I can rattle off a whole list of restaurants just near me that I physically can't eat at – there's more I *can't* eat at than I can eat at.", "I am \"only\" vegetarian and I have been at restaurants without any vegetarian option on the menu. Even the side dishes were fried in animal fat. \n\nThe \"we can create you something\" things they provided were really bad.", "And it's not for any other reason other than the person is wanting to lose weight and go on a diet, nothing do to with serious health reasons or medical issues other than gaining weight. She can't dictate to everyone else where to go just to meet her trying to shed a few pounds", "I feel like everyone is focusing too much on the vegetarian options and forgetting about the gluten free part. That could be playing a factor", "The salads served at places that otherwise serve nothing vegetarian are worse than going hungry.", "Except in this case there aren't vegetarian options available...", "Probably because 12>1? Sorry but the vegetarian is in the minority here. There are ALWAYS some kind of option. Is it the best option? No, but it’s something to eat.", "Because:\n\n1) she's just on a diet. She's not actually a vegetarian\n\n2) there are options on the menu, she just doesn't want them\n\nWhat's so hard for *you* to understand?", "Salads can have the meat removed (they default on there) but she said she didn’t want to do this.", "This person *can* eat there per the edit. She’s choosing not to. She wants to lose weight but said she doesn’t want a salad without meat.  I’m all for respecting a person’s food restrictions and preferences (I’ve learned to make vegan and kosher foods for my friends) but it sounds like she’s being difficult just to be difficult.", "💯 this, many haven't seen the edit where OP says that this person is only doing it to try and lose a few pounds, nothing ethical behind it or health related at all", "No she's not. She just wants to lose weight and decide to skip meat for a while.\n\nNTA", "Worst case scenario you can order some French Fries.  Mashed potatoes.  Pasta with Alfredo or tomato sauce (they said vegetarian not vegan). Pick the bacon bits off the salad or ask for no meat added. There are work arounds if you want to make an effort and spend time with the people coming from out of town who want to go dine at that specific restaurant.", "I will in my experience, one person opting to just a side or drink in a large group is usually fine.  It’s more if you’re taking a table of 6 but only two eating loss of revenue/tips.  \n\nAlso going to be different if you’re during busy time and truly blocking a table, or in a slower time when a bunch if empty tables.  Just leave a slightly bigger tip.", "We went through it when my Mum had late stage cancer and no appetite. We still wanted to eat out but she wanted a starter only. Some places were great, others less so and generally found the chains better. \n\nAnd my partner is vegan. I'm not. It can be a bind as lot of places we can't eat. But having someone not eating cramps the style and people feel guilty so meal rushed. Phone restaurant and discuss. Offering a vegetarian option often isn't a problem with warning.", "They absolutely do not have any obligation to do that. It certainly is good business to accommodate various food preferences/restrictions, but restaurants cannot nor are the obligated to “cater to any and all dietary restrictions.” A customer can ask, but if a restaurant cannot or chooses not to accommodate that request there is nothing the customer can do about it.", "Restaurants have no obligation to cater to any dietary restrictions.  Many do because they consider it good business (keeps from losing an entire party over one with special requirements).", "I'm not sure that is true though at least not in UK. Many places don't cater to vegan diets though they do offer plant free. To be considered vegan food, you need separate kitchens. I know some fish and chip shops that only offer gluten free food on Monday as deep clean on Sunday so can ensure no cross contamination but only on that day. There are significant overheads to offering vegan and allergy-free food. Many places won't guarantee it is even if offer options. \n\nSame with kosher - colleague was strict Orthodox jew so any project roundups could only be at Bevis Marks,thankfully a good place to eat.\n\nAnd with a vegan partner, I grieve as a foodie that I can't do many restaurants that offer tasting menus and don't cater outside of that. My choices are leave him at home or go to places that can accommodate him.", "I think it’s worse. Have you been the one non-drinker at a party of drinkers? Drunks can get pushy and rude. \n\nWhereas no one was critical of this person for being a vegetarian", "Why can't she navigate the menu and make a meal out sides or other items?", "Found out being her vegetarian is a choice therefore a preference as well.  It is an accurate analogy.", "No, restaurants aren't required to meet any combination of dietary requirements. Vegetarianism isn't covered under the ADA. It's a private establishment and has the right to set its  menu.\n\nNot every restaurant is kosher or halal, or bakeries don't have to have gluten free options, and vegetarian restaurants don't have to have a meat option.", "I am a lifelong vegetarian, live in a huge city, and there are many many restaurants I simply cannot go to because they cannot accommodate vegetarians... Many state on their website that they do not make alterations for dietary restrictions. \n\nI would never tell a group of 12 to move their plans for me, but it is not like every restaurant has veg options.\n\nOP's \"range of options\" is the side salad that comes with a meat dish. YTA OP, there are certainly other restaurants in town.", "Now that you have added an edit, yes. Not at the time I wrote my comment.\n\nThe discussion is therefore dismissal of a person’s choice based on a majority decision which could easily be adjusted to include rather than exclude. The majority argument appearing to be that they don’t think the minority’s reasoning is good enough.", "I see. But you think it’s ok for 12 to control what one person’s choices are in a cheery and rare family reunion setting. \n\nInteresting.", "Many people do claim gluten-free without having a legitimate need.  It has become a fad diet.  It makes it harder for celiacs or people with wheat allergies to be taken seriously.", "Part of that actually is true.  All salads have meat.  It's ridiculous.", "Sooo true. Some of the best restaurant veggies I've ever had were a side of collards from a local barbecue joint, and their corn pudding is also divine. Easily just as good as the meats.", "They usually have meat in them though.", "It’s ridiculous if 12 other people need to accommodate one person, deal. It’s not your day, maybe don’t do drama llama.", "A good amount of us are generally like this! The ones who don't just use it as a personality trait anyway 😂 cross contamination is gonna happen to you once in a while it's really not the end of the world in a scenario like you mentioned, not as if it was deliberate. Like your BIL said we're usually just appreciative of the extra effort to make the separate meals", "ya, that’s often the case with most groups. the extremists with the loudest voices fuck it up for everyone. thanks, internet.", "I have been to a restaurant called \"The Potato\" and they didn't have a single vegetarian option. Some restaurants are ridiculous.", "Thanks for your perspective. I imagine group would have changed opinions if it was a medical issue.", "Sure, but she didn’t want to do that", "No but they usually have something on the menu that suits each, cause it's just smart planning", "Ding! Ding! Ding! \n\nWe have a winner.", "Beggars can’t be choosers. Get over yourself.", "Removing meat is different from asking the restaurant to make it without meat. And what will there be instead of the meat? I hope you’re not suggesting she eat a plate of lettuce.", "Probably because that salad is designed around meat and will just be extremely boring without it. A good vegetarian salad can be fabulous, but a meat salad with the meat removed usually isn't.", "OK, that's different than what you said.  You said she couldn't eat anything, not that she didn't like the choices.", "That's according to op on the vegetarianism thing and that's what he heard. He doesn't even know about the gluten free thing. He doesn't care enough to ask.", "Are you just not familiar with gluten-free? As a concept, like?", "Omg did you just suggest to pick the meat off? You're the worst.", "Yeah, I was vegan for a couple years in college and friends just wouldn't invite me out, even if I was okay eating some fries or a boring kinda salad, because they felt too bad lol", ">To be considered vegan food, you need separate kitchens.\n\nWhy would this be the case? That seems like a very militant definition.", "I disagree (I am usually the non-drinker too).\n\nBut my friends aren't jerks when they drink.", "I don't drink at all. This is a completely different situation. It's almost impossible to find a restaurant without alcohol unless you are going out for like fast food. \n\nYou don't have to hang out with drunk people. She doesn't have issue hanging out with people who are eating meat, she just doesn't want to. \n\n\nYou're complaining about how others drink, she's upset about her options. \n\n\nI'm not sure my opinion in general, I was leaning towards NTA, but you are definitely an AH in this comparison.", "I'm assuming you grew up as part of a family that occasionally ate a meal around the table together. Was anyone ever singled out and expected to just sit there with a glass of water and watch everyone else eating? Do you think, if that person was you, you'd feel welcome and like part of the family?\n\nYou don't need to drink alcohol to live. Everyone needs to eat.", "Yeah, you just don't care if they eat or not. \n\nYTA. Do you even like this person?", "Because they're a whole person also attending this meal and they shouldn't have to spend a primo price constructing a meal out of side dishes? \n\nWould you go and spend restaurant prices for a meal consisting of some side mashed potatoes, side fries,  side garden salad (but you're paying for meat you just won't get it),  and steamed broccoli? \n\nSide note: most soups aren't even vegetarian, they mostly use animal based broths.", "FWIW I'm a lifelong vegetarian and pretty flexible (I'd never ask someone to move a big dinner like this because of me... I'd either not go or not eat) and there are plenty of restaurants where I could not eat anything even with sides.\n\nOP seems to think the side salad that comes with a meat can be ordered without the meat to make a meal... that is like 30 calories of greens. I just don't get why there are no other restaurants in town that would work? Why make such a big deal of it to begin with", "No.  It's not.\n\nShe.  Can't.   Eat.  There.", "I meant social obligation, not legal. I've worked in a lot of restaurants and with warning any of them will cater to any dietary requirement by making adjustments to certain dishes. Probably not Kosher or Halal because it has to do with sourcing ingredients, not just preparation.\n\nYou can't just turn up, but at the time of booking if it's mentioned it will be accommodated. Especially if it's one person out of a large group that may not dine there if the requirements aren't met.", "This is fair and accurate. If every individual got their way, no one would. Majority is the argument.", "They’re aren’t controlling what the one eats. She is choosing not to eat the vegetarian and gluten free options available. She is not allergic to meat and gluten. She is “dieting.” Her choice to “diet” should not take precedence over the agreement of the 12 other people to eat in that restaurant.", "Exactly, my relative does it voluntarily and uses it to force every meal at Mexican restaurants because of the corn products. Is there no other cuisine that is gluten-free friendly??!!!", "I love that this restaurant only offers meat-based salads.  Bullocks.", "Just make sure the veg isn’t cooked in lard or something first", "I work at a BBQ place that has vegetarian collards as well as meat collards.", "I don’t know. I actually care about my friends and family.", "And for whatd in reality a diet. NTA op", "lol, true. Gotta love it 👍\n\nEdit: I guess a few people disagreed with my last opinion lol", "Yeah, with my boyfriend who has an actual issue with both gluten and dairy, it's tough but people tend to try harder to help find him options.", "I wouldn't want to pay for a salad with meat (the most expensive part) if I wasn't going to eat the meat. If the restaurant would reduce the price of the salad, then that's fine. \n\nAlso, does this group tend to split the bill evenly?  If I knew all I was going to eat was a bowl of lettuce, but would be expected to subsidize 12 people's full meals, I'd be unhappy about it.", "NTA then.", "Okay, that’s officially her problem and not yours at this point. 🙄", "She's just asking her _family_ to accommodate her a little. Why is it so hard to \"change plans\"? Just book another restaurant.", "Pardon? There are no freebies here. Going to a place to pay to eat there is literally the _opposite_ of 'beggars can't be choosers'. I'm choosing not to go to places that won't serve a half-decent meal. If my friends rather I go hungry at a shitty restaurant that can't provide a _single_ vegetarian meal (the very lowest of bars) that isn't a sad salad, then they're not very good friends.\n\nBut please, I was interrupting your daily two minutes hate against vegetarians. Have at it.", "Those were specifically her words. “I can’t eat anything”. What I rolled with in initial post.", "Oh missed the gluten free.  Guess pasta is out but the rest still stands.", "She is not an 'ethical vegetarian'.  She 'wants to lose a few pounds' so meat has been given the heave-ho.  Picking the meat off is PERFECTLY reasonable if you're not an ethical-vegetarian or vegan.", "I agree but it is difference between vegan for some certification and plant-based. Preparation of vegan food has to be kept separate from preparation of non-vegan foods to avoid risk of cross-contamination. Need to be even stricter with food allergies and many places take line we will try our best but cannot guarantee cross-contamination will not happen. \nKnow small businesses that prepare vegan certified food as well as meat and they need separate kitchens.", "Halal food as well, you need a whole different set of equipment, might as well a separate kitchen. Most observing Moslems won't tolerate cross-contamination too so if other dietary restrictions like that I wouldn't be surprised.", "ReRead my message above.  I do NOT complain about others. That’s my point. I hang out with people I care about and let them do their thing.", "If this was around a family table a specific meal could be prepared for the person.  If they turn it down, that’s on them. Which is what this is. Could she not have a salad without meat? She says no.", "More \"whole person\" BS.  Yes, I would go and spend restaurant prices for sides to make a meal if there were no entrees that met my preferences.  It is about the fellowship and I would be adequately fed.  I have a good friend who is a vegetarian who has no issues with doing this.   It is simply working within the world and not expecting it to revolve around her wants.", "One of my best friends has been a vegetarian for decades and she never had an issue finding a decent meal to eat out of various vegetable sides and such.  She has never just had to make do with a plate of greens. \n\nI guess we differ on who is making this the needlessly big deal.", "You are using the word “cant” incorrectly.  She very much can. She chooses not to.", "I don’t know where you live but that sounds nice. I’m in Canada on the west coast and there are tons of places who will just tell me, “sorry there’s nothing we can make you”. If you’re in a major city it’s more common but I’ve still walked into places in downtown Vancouver and all they could suggest was French fries that they couldn’t guarantee didn’t have cross contamination.", "Ah well, gods forbid your relative should “get their way” by being able to order food they want to eat during a family reunion.", "So how is the one “controlling” the twelve by wanting to go to a restaurant where everyone can eat? :D  Control suggests limiting options, not broadening them :D \n\nBut sure, let’s keep treating this as an analogy instead of what it is: a family reunion which is being organised (surely) to accommodate all invitees. Except it’s not.", "I would think some Asian cuisines could be easily adapted, though regular soy sauce is not gluten free.  I know a couple of people with celiac issues and others who just say they are gluten free.", "As a vegetarian, I can tell you that there are definitely plenty of restaurants that only have meat-based salads. It's weird but it's definitely a thing. Though usually you can ask to have the meat taken off no problem.", "This. I can't imagine good collards cooked without bacon, lardons, lard or ham. At the very least, butter, which would be vegetarian (depending) but not vegan.", "That is so awesome! It's not common though.", "Then just don’t go? Lmao why is everyone feel like the 12 ppl should adjust for one? If she doesn’t fit or want to go then just don’t? It’s her own decision. OP even said it’s a diet thing not like a life choice. Beggars can’t be choosers", "Yes because it’s totally reasonable in 2023 for the vegetarian option at a restaurant to be to order the meat salad, pay for the meat salad, and ask the chef to pinky-swear they’ll leave the meat off. \n\nA “meat salad” without the meat will likely be a boring, bland bowl of leaves. This restaurant is either terrible or made up.", "What about her gluten free needs you seem to be completely ignoring those.", "I would edit your original post then to avoid confusion.\n\nDo I still think you should choose another restaurant that has actual vegetarian options?  Yes.\n\nBut unless this restaurant actually refuses to omit the meat (doubtful), N T A", "You can’t eat French fries if you are gluten free frequently as they are often battered in flour and used in a cross contaminated fryer.", "Picking the meat out of a salad is also not an option", "Halal and Kosher are very specific mandates set out by a specific text (Torah or Koran), vegan is significantly looser in application. Insofar as there are even vegans that wear second-hand leather clothing and others that don't.\n\nMany vegans tolerate vegan food being prepared in a kitchen that deals with meat, some (as evident by the parent comment) do not. Some don't care if it's the same oven/stove/fryer, others do. And the varying degrees in between.", "And no one there is saying \"There is no option for non alcoholic drinks. You either drink alcohol or stay parched\". Your analogy is stupid. \n\n\nI'm on your side for the main post. My husband is a vegetarian, and while he gets frustrated when he goes places that have very limited options, or he ends up with a few sides, he understands that sometimes that's the thing. If people from out of town want to try a place or it's celebrating a special event for someone else, he understands.", "So this is a family meal at which one member of the family, who is apparently universally hated, isn't welcome? What was the invitation like? \"If you're not doing anything on Friday, would you like to meet up with us so you can watch us eat?\"", "Yes, I'm sure your friend has no problem eating nothing but sides when an option exists for you both to get a full meal /s \n\nIt's about fellowship...if that's the case, then why aren't we choosing to eat where EVERYONE gets an entrée?", "She’s also gluten free, i can guarantee that’s part of it.", "Ah.  You're one of those.\n\nLook, telling a vegetarian to just eat meat would be like telling you or I to eat a dog or other human.\n\nJust be honest.  Tell her you have no respect for her and don't care if she's there.", "You are misinformed. Many vegetarians will have adverse reactions to consuming meat after long periods of abstaining from it. YTA..", "Yes, every attendee should have veto power. Surely unanimity is at hand!", "She *can* eat anywhere. She is *choosing* not to. It’s as simple as that. You keep *choosing* to complicate a very simple situation.", "As a person who never cooks and spends a good part of her life in restaurants, I can tell you that there a very few restaurants that don’t offer a plate of lettuce and some random croutons if a customer asks for it.  \n\nEven steakhouses offer plain salads.  OP said that this place does as well, but the person doesn’t want to ask.", "Bs", "Kombu, smoked paprika, spicy apple cider vinegar, garlic, onion, coconut aminos, vegan butter or oil. \n\nWorked at a vegan place that made vegan, gf, soy free collards. \n\nPlus! If you cook them in an instant pot it takes like 20 minutes!", "Yeah I honestly don't get why people are viewing this as a valid option? For a pre-planned get together. \n\nI'm vegetarian, and tried vegan for a few years back - around 2013 (which was freaking hard, I imagine it's easier now) - and I have definitely gone out to eat and had a side salad. And it's okay, when it's every now and then, but being almost purposefully excluded at a meal when the whole point is to get together and enjoy the company and food, would piss me off.", "Added a note to bottom. Ty", "Ordering it without meat is an option that the vegetarian said she didn’t want to do.", "Thank you for your perspective.", "No, the conversation was. Hey we’re all meeting here for lunch, you in? Like normally people that don’t automatically assume the worst in others they disagree with.", "She has no problem with it.  She will decline people choosing other places because she is willing to make the place most people want to go work.  Fellowship is the people being together in a place.  It has nothing to do with an entree or sides.  Some people don't expect the world to revolve around their dietary wants and will adapt to the situation.", "That’d be a fair point, however, she is not vegetarian for ethical reasons.  She feels she’s gained 10 pounds this year.  \n\nInteresting that you would dismiss an discussion so easily.", "You are basing your answer on an assumption. This is information we do not have (other than she is recently vegetarian).", "LOL! I’m not involved in this at all! My words have no relevance on this any more than yours do. \n\nThe complication had already been made by OP deciding this is AITA-worthy instead of, y’know, helping to arrange a family reunion that everyone can attend. Find another venue. It’s really not hard! Why OP decided to make the one relative into the antagonist instead of someone who would like to partake in a family meal, I don’t know.\n\nI wonder if this family will expect the bill to be split equally regardless of who had what, and then that sole relative, if they care enough about these people to show up, will be accused of making a fuss when they protest. I look forward to that post.", "A plate of lettuce and croutons is a pretty terrible dinner though. If the restaurant can't do anything vegetarian other than that, I wouldn't want to eat there.", "Yeah, maybe she doesn't trust the restaurant, whatever the reason they're still the AHs for not just picking a different restaurant", "And when this mystery family member said \"well, there's nothing I can eat there\" was the response \"oh, tough shit then I guess\" or \"why are you being so selfish?\"", "Apparently OP does because their dietary need for meat is more important than one person in the party even eating. \n\nThere are MANY options that would cater to all people present. OP chose to exclude someone. \n\nI'd LOVE to talk candidly with your friend and hear how they really feel and now what they tell you to protect your ego.", "Oh...and somehow you think that makes her not a real vegetarian?", "Because you're being willfully obtuse", "It doesn't take that long in my painful, painful experience", "Nope, it’s a medical fact… If it’s a recent change it may have no effect on her, but that’s not the point. You asked if YTA, and everyone has overwhelmingly agreed you are. Fighting everyone just makes you look worse lol.", "That is not the point, though.  OP’s cousin wasn’t offered that.  They were offered a regular salad without meat.  You made up a scenario and I responded. \n\nNo one said OP’s cousin was being asked to eat some lettuce and croutons.  Ffs.", "They are not vegetarian because of medical or ethical choices, it's because she feels she's gained weight and has (temporarily?) chosen to go vegetarian. She can ask for the salad with no meat.", "Why should everyone else flex for her when she is showing zero flexibility whatsoever?  She's the real AH here.", "That is a false statement.  The one person in the party can eat, she is just choosing to be difficult and inflexible.", "Not suggesting that at all.  However, I do feel ethical reasons carry more weight than worrying about a few pounds. For an ethical vegetarian it’s about life and death, in this case it’s about waistline. I can respect both choices, however, I am more willing to bend my perspective for an ethical vegetarian.", "Are you unwilling to see from alternate perspective.  A restaurant that parents want to celebrate their 50th anniversary needs to be changed? \n\nWhat would be the other choice so my parents can enjoy a restaurant they’ve been waiting on?  Not to invite her at all?  No one would want to do that.", "Wanting an actual meal at a restaurant isn't being difficult.   What is being difficult and inflexible is insisting on having your meat meal while someone goes without instead of going where everyone can partake.", "But you’d already made this decision before finding out it was a fitness choice rather than an ethical one…why are you arguing it would have made a difference when if clearly didn’t.\n\nETA it seems this isn’t an AITA question. This is a “do you want this person at this event” question. If the answer is no, then by all means eat at a place they have specifically said they can’t eat at. Let them know that it’s more important to eat there then it is for them to be there. If yes, then it’s actually not that difficult to find a new place.", "YOU are the one who asked if YTA, not me.  \n\nConsensus is, yes.\n\nExpecting a visitor to sit and watch others eat is horribly selfish.  You're an adult - you should get that.  Your wife does!  \n\nI think you should take the advice from the other person who said to call the restaurant to see if there are any vegetarian options or solutions available.  That seems like the best bet.\n\nGood luck."]}