{"id": 27525, "submission_id": "16qutkl", "title": "AITA for storming off after I got to know I was adopted?", "selftext": "I (22f) am I the youngest of 4 siblings (30m 28f 25f). My life was as normal as it could get. Normal parents who were supportive and sometimes had arguments etc etc. My two oldest siblings loved me but usually talked more with my other sis as she was more outgoing, talkative n all ( I am much more introverted and don’t like talking much). My sister (25f) n me never saw eye to eye though. We all always had fights but she would often say how I was adopted so I couldn’t relate to her n all. I always brushed it off as a joke cuz everyone says that to their siblings. Yesterday we had a family dinner for her birthday with my brother  and my eldest sister.  My other sis was talking about how her boyfriend had brought a bouquet of different types of daisies ( which picked out early in the morning to surprise her it seems) and how she was irritated that he didn’t spend on an elegent bouquet instead ( It wasn’t as professionally made)\nFor context he has brought her other presents as well. I commented on how she should be happy he personally picked out flowers for her and she EXPLODED. She commented on how I’ll be sooo happy with something super cheap cuz that’s where I came from and I asked her what she meant. She started laughing and said that this is day was always meant to come and looked at my parents and told them to tell me how I was adopted. They and my siblings tried to shut her up but she just went on and on and I asked my parents if it was true. They just looked at each other and I got to know the truth. I told them to excuse my and just went back home. I couldn’t process how they hid it from me. I do not mind being adopted and don’t really care I’m not biologically theirs but the fact they hid it from me hurts. I got a text from my sis after 2 hrs on how I make all situations to be about myself and how I stole her limelight on her birthday. \nSo Reddit AITA? I don’t feel like I am but my parents still haven’t responded to my texts. \nEnglish also isn’t my first language.", "created_utc": 1695552929, "permalink": "/r/AmItheAsshole/comments/16qutkl/aita_for_storming_off_after_i_got_to_know_i_was/", "score": 4952, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I feel like I may be the asshole cuz I could have told my parents how I really feel instead of just storming off\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour sister is a major AH.\n\nSorry but you now have some decisions to make and some tough questions to ask. You have every right to be angry that you were never told especially as your siblings obviously knew.\n\nYour Parents are AH's for not telling you.", "NTA. You're in shock after this huge revelation. Your sister sounds a nightmare. She is AH. Hope her bf dumps her.  Parents should have told you sooner.", "NTA\n\nI think your parents never made an 'educated decision' about not telling you you were adopted. They thought that by not telling you, you would not feel alienated and really a part of the family. Same with your bigger siblings. They thought you as their real family member and were afraid YOU would behave differently if you knew, so they never told you. I'm not saying if it's right or wrong. They should have consulted a professional regarding this issue (hence the educated decision).\n\nAnd it would have worked if not for the little monster of that sister. \n\nJust remember that to some degree, the concept of family is relative. Putting myself in your bigger siblings' place, I prefer an adopted nice step-sister over a shitty little sister who's more like a spawn of devil instead of my own parents.", "Absolutely NTA.\n\nYour sister is absolutely the AH here. \n\nYou didn’t steal her limelight, she threw a tantrum and used her knowledge of your adoption as a horrible way to lash out and hurt you. \n\nAlso, you have every right to feel hurt that your parents hid this information from you.", "Your sister obviously needs serious therapy.", "NTA\nShe was acting ungrateful for a thoughtful gift, you made a comment and she blew up. Unless there is some part of the story missing then you did not do something wrong. \nAlso if i just found out i was adopted in a hurtful way (she said it to hurt you) i would have left too.", "NTA but I think your parents are more at fault for letting your middle sister treat you awfully than for not telling you earlier that you were adopted. Maybe they were trying to protect you from her in their own misguided way?", "I think that your sister was the baby for three years, then you came into the picture, she didn’t want to not be the youngest and just never got over it. You should give the people that raised you the benefit of the doubt that they weren’t trying to hurt you, parents make mistakes, this was one of those times. You should show them that they taught you to be kind and forgiving. Your sister, who told you — are you mad that she told you, or are you upset your parents didn’t; because it seems like a contradiction to be mad at both. If it’s your sister, just remember; they already had her but they wanted you. YNTA", "Nta, your sis sounds like she's jealous.", "NTA.  Your surprise is understandable.  Needing to leave to process this huge revelation is understandable.  Your sister is terrible.", "Adoptive mum here. We recently adopted our children and were advised to bring them up with the knowledge that they were adopted - However - this is relatively new and when you were adopted, your parents may have been advised NOT to tell you. The view was that it would help you integrate into the family. You are NTA, but your sister is. I wish you the best in finding your way through all of this.", "I think you should have a heart to heart talk with your parents.  It sounds like they are decent loving   people.  Please don’t forget every family has major asshole in their family. In your case happens to be your sister.  Ignore her and your life gets much better.  \n\nGood luck.", "NTA, but your sister is. She turned this around on you on her birthday. She sounds jealous, childish & very petty. \n\nMaybe sit down with your parents one on one & ask about your adoption. Some counseling may help too. \n\nI hope everything works out.", "NTA, she made the whole thing about you when she tried to hurt you. If i were you i would take distance from her", "NTA... sister is though. You have every right to be upset. They hid this from you and tried to deny it when you realized what your toxic possibly narasstic sister was saying was true. \n\nWhat bothers me though is that she is making assumptions about your birth parents. I'm wondering if she knows who they are because of her comment that you come from someplace bad. It's always possible your are the child of a woman who got pregnant from a upper class family who made her give you up because she brought shame on them. She is acting like they pulled you out of the gutter.\n\nYou are 22...you have a right to answer. Your parents can either cut you off or answer your questions. It's up to you. Good luck OP.", "NTA. Your \"sister\" got some major issues. I would either go NC or LC with her. Your parents are also ah for keeping you in the dark for so long.", "NTA they should have told you.", "NTA. You’re allowed time to process. But you absolutely didn’t steal her limelight: first, she’s the one who brought up the topic and second, you removed yourself from the situation and didn’t explode (if you’d wanted to make a scene that’s what you would have done), which was very mature. Sorry your sister s****!", "I was in foster care at around 11 years old. I was in 2 different foster homes and I still consider both of them my family.\n\nBlood had nothing to do with it, it was the love I received from them that makes us family.\n\nI hope you can get past this.", "Tell your sister she's pathetic and needs serious therapy, and if she was interesting enough the attention would have been on her.\n\nNTA", "NTA but let me get this straight you youngest older sister -  25f has always been a dick to you and said you were adopted but you ignored it thinking she was just an AH. Then at this recent event your other older sister 28f was also a disgusting AH. Wow didn’t you hit the jackpot of shitty families! I’m sorry they’re AH - you’re right flowers in any capacity are kind. You probably have some hard decisions to make now though…", "There is never a right age or moment to tell somebody that they are adopted, I say this as somebody who knows parents who have to do this soon. They probably spent years trying to figure out how to tell you. The ah here is how they let your sister talk to you, and then off course the sister herself", "NTA\n\nI think the biggest a-holes are your parents. They should've told you when you were a toddler, it's recommended to tell children about their adoption as soon as possible so they can grow up with that information. \n\nYour sister was obviously never accepting of you and couldn't cope. It was your parents duty to prepare their children for their new sibling, get them to therapy and work on the sibling's relationship.\n\nYour sister kept making hints for years, your parents definitely knew and still didn't say anything. It must have been clear to them that sister might reveal it one day.", "YTA\nSomeone gave you up, these people chose to take you in. You should be appreciative. They are more your parents than the biodoners that left you behind. To top it off you are full grown acting like a child about it. \nYour sister is an asshole as well. A fantastic response to siblings that run that game is \"at least they chose me, they got stuck with you\"\nBe better", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (22f) am I the youngest of 4 siblings (30m 28f 25f). My life was as normal as it could get. Normal parents who were supportive and sometimes had arguments etc etc. My two oldest siblings loved me but usually talked more with my other sis as she was more outgoing, talkative n all ( I am much more introverted and don’t like talking much). My sister (25f) n me never saw eye to eye though. We all always had fights but she would often say how I was adopted so I couldn’t relate to her n all. I always brushed it off as a joke cuz everyone says that to their siblings. Yesterday we had a family dinner for her birthday with my brother  and my eldest sister.  My other sis was talking about how her boyfriend had brought a bouquet of different types of daisies ( which picked out early in the morning to surprise her it seems) and how she was irritated that he didn’t spend on an elegent bouquet instead ( It wasn’t as professionally made)\nFor context he has brought her other presents as well. I commented on how she should be happy he personally picked out flowers for her and she EXPLODED. She commented on how I’ll be sooo happy with something super cheap cuz that’s where I came from and I asked her what she meant. She started laughing and said that this is day was always meant to come and looked at my parents and told them to tell me how I was adopted. They and my siblings tried to shut her up but she just went on and on and I asked my parents if it was true. They just looked at each other and I got to know the truth. I told them to excuse my and just went back home. I couldn’t process how they hid it from me. I do not mind being adopted and don’t really care I’m not biologically theirs but the fact they hid it from me hurts. I got a text from my sis after 2 hrs on how I make all situations to be about myself and how I stole her limelight on her birthday. \nSo Reddit AITA? I don’t feel like I am but my parents still haven’t responded to my texts. \nEnglish also isn’t my first language.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "NTA. \n\nYour sister threw a temper tantrum and ruined her own birthday party. All you did was try to defend her boyfriend from her selfish and entitled behavior. My guess is that she’s harboring some jealousy of you which causes her to continue lashing out at you.", "[removed]", "NTA\n\nBut your sister is a major AH and should seek professional help.", "NTA, the advice for decades now was to tell kids they are adopted when they are young. Your parents are also AHs for letting your sister bully you with this information all your life and not putting a stop to it.", "NTA It seems both of your sisters are AHs. Both of them have insulted you over the years by using the fact that you were adopted against you. Your 25f sister always said it, and now it's 28f. Keep in touch with your parents for information but cut off any sibling who thinks this behavior is OK. Permanently.", "NTA. Your sister has been harboring a major resentment against you ever since you were adopted since she was no longer the baby of the family. She couldn't wait to tell you. It was probably the best gift she could have gotten, except you ruined it by leaving the party and not having a breakdown in front of her. She probably got a talking to after you left.\n\nNow think back about all the other ways she was mean to you growing up and showed her resentment. You'll probably find that this wasn't a one time thing", "NTA, but your sister certainly is. If she didn't want attention on you she shouldn't have made it about you. You do need to have a conversation with your parents though. They most probably hid it from you for the best of motives, unwise but not AH's", "NTA and to be petty, I'd respond with something like, \"at least our parents actually chose me. You? They had no choice.\"", "NTA. I am adopted and my parents never hid it from me. The fact your parents hid this from you is unfair to you. And your sister is a colossal jerk for her behavior.", "NTA. Your sister is though for pulling that move. She was the baby till you came along and she is jealous of you so she bullies you with this kind of behaviour. She owes you a massive apology. That’s the sort of behaviour that should have been stamped out in childhood or teens but she’s still acting like a spoiled brat. You were right to point out her ingratitude over the bouquet her bf went to the trouble of picking and arranging. I actually pity her bf.\n\nI am so glad you always had a close relationship with your adopted parents and older siblings but you should have heard you were adopted from your parents. That’s on them.", "NTA  \nExcuse me?! Your sister says how YOU make everything about yourself...? She's the one putting you in the spotlight, for no other reason than to humiliate and hurt you, she's the one using her birthday to make you miserable, SHE is the one to make it all about you, you were absolutely fine with saying what you've said, and your sister's bf sounds like he's in for a miserable time if he stays with her for much longer.\n\nYour parents should have definitely told you, there are other reasons to tell a person they're adopted other than the obvious one of 'you shouldn't lie to your kid for their entire life', like, for example, medical records? Genetics play a huge part in that, and you should know who your parents are, even simply for the right to know if they have any genetic diseases you should be on the lookout for.   \nAnd not letting a kid the chance to meet their biological parents, or know where they came from, is straight up cruel in my books.\n\n&#x200B;\n\nYour sister sounds like a psychopath, in all honesty. And your parents sounds borderline neglectful. But this is the internet, where dramatic judgements are being made with way too much ease, so I probably should add a disclaimer to say that I don't know your family enough to medically diagnose them, but I would say keep on the lookout for any other lies\\\\secrets they may be keeping from you.", "[removed]", "I mean you were told repeatedly throughout your life that you were adopted. You chose not to believe it. \nNTA for leaving though. \nMaybe don't comment on your sister's life. You claim you are introverted and don't talk much yet there you were running your mouth about her life when she didn't ask for your opinion.", "[deleted]", "NTA. What a terrible way to find out you are adopted. Shame on your parents for letting the negative spin on being adopted go unchallenged.  Shame on all of them for having zero empathy and compassion.  There is nothing bad about being adopted. There IS something bad about your family’s attitude toward you.  You have a right to know about your genetic heritage. Don’t expect much from these people who you call family. Please find support from people other than these. Hopefully you have extended family or friends you can reach out to. You have done nothing wrong and you do need support.", "NTA what a horrible thing to say to someone. I can't believe she used your heritage as a weapon. Firstly, that's super classist, what did she think she was accomplishing by that? Putting you down based on where or who your from. Tell her to say that to any other adopted child or person who is from a more impoverished background and ask why she feels humanly superior.\n\nSecondly you were all raised in the same household, so it's very cruel to say something like that. Why would your parents hide something like that from you and yet your siblings knew? That instantly gave them power to clearly weaponize it. And why would she say the most earth shattering thing to you during a disagreement about flowers on her birthday. I hope she reads this and you tell her this but honestly her birthday is literally a drop in the bucket compared to revealing you were adopted, and she made it about you and not the other way around. It's extremely ignorant to drop a bombshell like that on someone and expect them to smooth it over mentally and play nice for her birthday. Is she dumb or a sociopath? \n\nLastly, your parents should have found a healthy way to tell you, it could have been during childhood, teenhood or right before adulthood but honestly telling your child earlier is better, but it should be done right. What if you always felt different, or had different genetics that could have affected you and mentally you tried to force correct yourself by gaslighting yourself into thinking, well there's no history of X in my family so we can eliminate that. I'm also not saying that you would have had your bio families entire medicinal history but knowing is better than not. \n\nNTA for sure and sorry about how that happened, I think you handled it very maturely", "[removed]", "Her bf dumps her, her parents at least ground or chastise her; and she gets a flat tire on her replacement wheel", "[removed]", "[removed]", "Hiding crucial information like that definitely makes OP's parents AHs. They might have meant well, but it was a really cruel and ill thought out decision. OP's sister is an AH for multiple reasons but she's not the only one here.", "Yes, the sister has clearly been harbouring resentment for OP all these years. It must have hurt her (sister) when she was \"silenced\" by her parents - even though she said it during arguments, it was dismissed/not validated.\n\nNTA OP. Your parents probably thought they were doing what is best for you as well though when you were of age to understand, they should have reconsidered this.", "This was my thought. She’s jealous and probably has been since the parents brought OP home. She’s also just mean spirited and vindictive. \n\nOP you are definitely not the AH", "I was adopted over 40yrs ago and the advice then was to tell in an age appropriate ways, as they realized just how badly not telling went in the past. OP is only 22, I guarantee most advice from those within the adoption world post 2000 was not to keep it hidden/secret.", " No. It’s the same sister who has always been nasty. English is not her first language so it’s jumbled but I reread her post. Birthday sister is the 25year old who is always mean. Other siblings and parents were trying to silence her.", "Found the sister. What a horrible take.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "That OPs parens are currently not answering her texts also makes them AHs. OP found out they were adopted in an aweful way, and they should do everything they can to make sure she is ok right now. Wheter it is giving her space or texting her that they are here for her when she is reasy, but answering her texts are a minimum. Instead OP now has to worry that they are angry at her.", "Objectively, maybe the parents didn’t see the information as “crucial.” I’m NOT saying they are in the right, I feel like with something that big, they must have had their reasons for not telling her. They justified it for her entire life, with schools and doctors and friends of the family. More people must have known she was adopted (her parents’ friends, older cousins, aunts uncles) who all would have had to participate in this conspiracy of silence. Something compelled them ALL to withhold that information, and prevent anyone in her life from gossiping about it.. I mean think about it, if she had aunts or uncles, they would have known, but in order to keep it from her, those relatives would have had to never discuss it where and of their children would hear it; that’s borderline impossible.  it was probably a good reason", "Not an expert on the matter, but the world is a big place— surely it there might be regional and cultural variation? English isn’t OP’s first language, so she might be from a country where telling the adopted child isn’t the norm? \n\nWhich would also help explain why they were able to keep it secret from her, if it’s a cultural norm not to tell. Since you’d also have grandparents, aunts, uncles, etc. who’d know and not tell.", "NTA.  For several reasons.\n\nI'm adopted and have grown up knowing, and that in itself brought enough questions and insecurities. To have this news dropped on you later in life by a vengeful sibling who clearly wanted to hurt you, and for the rest of your family to not do anything to support you is just awful.\n\nGive your parents some time before approaching them again to discuss. I'm not at all condoning what they've done here, but they're probably trying to figure out how to handle and you're unfortunately going to have to be the mature adult in this situation. You deserve answers and I sincerely hope you get them.\n\nAs for your sister, I'd go NC. She's clearly toxic and enjoys hurting others - why continue a relationship with her at this point? You'd be much better without. \n\nYou can complete the 23andme or ancestry DNA kit (I've done both and rec the 23andme kit) to see if you get any hits on your immediate family. I was in a closed adoption and have since had reunification with biological siblings via this test.\n\nGood luck OP. Hugs.", "NTA. Your sister is cruelty personified. Somehow you’re the villain of her life in her head. \n\nIgnore her, she doesn’t deserve your time. For the others, you all need an honest, difficult few conversations at the least. They love you and don’t treat you as an outsider from what you’ve written. They shouldn’t have lied. But be careful. I’m sure they too had a difficult decision in whether to tell you or not. There’s no correct choice there luv. \n\nBe well", "As an adopted person, it sounds like your sister has issues with it, not you. Your parents chose to adopt you, which is a far more arduous process then just having a child. For some reason, biological kids can feel threatened by something like this especially as she is the youngest bio kid. Whenever someone tried to built me for being adopted, I told them my parents chose me but yours got stuck with you. My favourite \"insult\" to this day is I was called a second hand child. I laughed so hard at this because it's true! \n\nThis doesn't give her an excuse to be an entitled little brat. I'm sure your parents didn't tell you to make sure you didn't feel like the odd one out as a child, but I think they should have realised this day would come that you would find out once you were a teenager. \n\nMy best advice would be don't blame your parents for not telling you, but do ask why they didn't. Explain to them that you are not angry about it, but just want to understand it from their perspective. You may find a different kind of relationship with them then. \n\nAs for your sister, she knew and tried to use it as a weapon against you. You don't need toxicity like that in your life. Go NC.", "They adopted you because they broke the other ones. Your parents are bigger assholes than your sis! They probably think they did you a huge favor, too. \nNot the asshole.", "Your parents are AH for not telling you, you are 22 yrs old wtf. Also your sister is a major AH, they tried to shut her down to hide the adoption not bc what she was saying was downright despicable.", "NTA, your sis is a huge AH though, and cruel! She's also a terrible, ungrateful gf.  Your parents should have told you sooner, you're reaction was actually very controlled and calm considering you've just found out that your family aren't your biological family! So sorry you're having to deal with these AH!", "Im so sorry you found out like that. The parents are to blame for sure. Don't forget they gave that big mouth sister the ammunition to throw! Secret keep people sick! In this case make people sick.", "Is your sister by chance, the devil?", "NTA\n\nAnd that Ladies and Gentlemen is the reason it's recommended to let your adopted kids know before the age of 6.", "A therapist could help you sort through this all. Your family is dysfunctional and you can step outside of it and decide what your life and relationships with them can look like. They are so messed up and treated you as less than. Definitely NTA.", "NTA, Your sister is fucking disgusting, I would go no contact, you don't need someone like her in your life.", "Everyone is the Ah except you, you are NTA. The feelings around adoption aren't always easy and I always knew that I was adopted. Having it thrown at you in that moment... It's no wonder you couldn't process.\n\nIf you are able to, consider arranging a time to sit down with just your parents to discuss it.", "NTA. I'm an adoptee and I don't remember a time when I didn't know I was adopted. It's knowledge that I just kind of grew up with. I cannot imagine finding out something so huge as an adult. Your parents suck for keeping this from you.", "Update when you feel you can share more. My heart goes out to you!", "NTA. What a horrible way to hear this. As an adoptive parent, my daughter’s adoption story was part of our bedtime routine for years. From the first day I held her. She knew before she was aware she looked different form her sibs and parents. It was never a secret. I’m so sorry no one told your parents to do better.", "NTA\n\nNow you can lord it over your bratty sister that your parents chose you because she was so bad they didn't want to get stuck with another like her.", "Evil sister: shares a deep family secret in the middle of her birthday party, for no reason other than to hurt OP.\n\nAlso evil sister: You stole the limelight on MY big day after I blindsided you by announcing you were adopted 20 years ago!!\n\nSomeone is definitely a selfish jacka$$, but it isn't OP.\n\nNAH", "Every one in your family is TA - for hiding this from you and for letting that one sister speak to you that way. She’s pure evil and everyone has enabled her to be so nasty. Why have your parents allowed all your siblings to treat you like this for so long?", "I’m shocked that the parents have allowed the derogatory comments from the older sister. Just awful! NTA but your sister is.", "NTA\n\nYour sister is. I don’t have a judgement for your parents. They should have told you knowing who your sister is and the obvious resentment she has for you. But they also had their reasons…but by the time you were 18 I think you should have been informed. I just don’t think they’re assholes for not. It’s complicated.", "ESH except you. Your sisters are cruel and using your reality to hurt you is really mean and unfair. Your parents (and I say that intentionally) probably had good intentions in “protecting” you. From what, I’m unsure but they probably thought they were helping you. They could’ve/should’ve approached it differently.\n\nYou didn’t do anything wrong, being hurt and removing yourself from that situation in that moment makes sense to me.", "NTA and if it’s any conciliation, you can always hold over your sister that your parents picked you, they didn’t really get a say when your witch of a sister popped out.", "Nta. I'm actually shocked and concerned that you think you might be. Your sister is a huge ah, and your parents are ah's for not telling you from the beginning. This could have been easily avoided and really not a big deal had they been honest. Find a good individual therapist and see if your parents and siblings would be willing to go to family therapy with you.", "No you are most definitely NTA but your sister, (and I don't think I would call her that since she's never acted like a sister to you) is. And your parents could have stopped this long ago by telling you in a calmer time and place so they're the AH too. \n\nGeez your sister sounds like a selfish and self-centered person, and probably insecure too.", "What a violation. Your sister isn't the AH. Your parents are.  I would be breaking off all contact with them from here on out. If they had the audacity to lie to you about your very existence how on earth can you ever trust them again? You are absolutely NTA. Welcome to the adopted club! Never met an adopted person who wasn't a wonderful person.", "NTA. It doesn't sound like you stormed off, just left to not cause a bigger argument. Your sister is a major AH though. I'm torn about your parents because you don't yet know their reasons for not telling you. It might have been for family inclusion or may be for selfish reasons. They definitely should have told you for medical reasons alone, i.e. you should know your biological family's medical history. They now have to earn back your trust.\n\nTake whatever time you need to process this and then set up a sit down face to face talk with your parents. Definitely go low contact or even no contact with your 25f sister. Set boundaries with her. She needs therapy or something for her jealousy of you. Talk to your other siblings when You are ready. \n\nOn the plus side, you've learned that you were chosen by your parents. I know that sounds incredibly corny but it's true. Maybe that is why your one sister is so jealous. Maybe she felt they took time away from her in the process to adopt you. You can now decide if you want to find out anything about your biological family. Don't let your family influence your decision on that, decide for yourself. Good luck OP!", "The only asshole was your sister.  You are not the asshole for feeling as you do, and you didn't make her birthday about you.  She did by choosing that moment to force the parents to tell you.  \n\nHaving said that, contrary to some opinions your parents are not the assholes.  They made a mistake, sure, but it was made out of love.  Take time to nurse your feelings then reach out to them and talk to them about the situation.  Express how you feel.  Hear what they have to say about it.  And move forward with them.  \n\nYour sister, though, is a write off.", "All of you are immature.", "[removed]", "NTA - As someone is is adopted, I am so sorry that you found out that way. I cannot stress enough how much of NTA you are. Your sister is absolutely TA. Honestly, if my sister did that, I would cut her off permanently. Your sister intentionally told you like that to hurt you. Seriously consider cutting her off and going NC with her. I would speak and see your parents and other siblings alone. You can have your own relationships with them that do not need to include your selfish sister. Cut off your sister. You will be much happier.", "NTA how did you make your sister’s birthday about you when she insisted your parents tell you that you were adopted on her birthday ? \nTalk to your parents & other siblings ad see if you get some answers . Ignore the sister that was always mean to you. Block her for some time .", "NTA. It sounds like your sister never got over the fact that her limelight was stolen when you were adopted and is carrying that resentment throughout her life. This is why she is always berating you. It sounds like she needs therapy to get it and your parents should have dealt with this behavior when you were children. This is all on your sister. Your sister made it all about you when she told everyone there that you were adopted. She is the AH and this behavior shouldn't be tolerated.", "Just to quickly note that the sister thrusted the limelight onto you OP!", "The birthday girl’s anger at you for her not being the center of attention is misplaced.  That anger belongs on the sister who chose to tell you that you were adopted at her birthday dinner.  NTA", "NTA. That title belongs to everyone else in your family. I’m so sorry that you had to go through that.", "NTA. She told you about the adoption in the midst hurtful way. She made her b'day about you as she brought this all up.", "NTA but your sister is. You need some time to process this and eventually talk to your parents about it. At some point they should have told you - and it was their place to do so, not your sister’s.", "No, \n\nYour sister should have smacked in the mouth. Your family loved you and did a great job being parents but they failed in disciplining your sister.", "[removed]", "NTA\n\nYour parents are.\n\nYour sister is. AND AND the situation wouldn't have been about you AT ALL if she hadn't decided this was the time for the big reveal. What was supposed to be your reaction? Sit there and listen to her spew her vile out? It sounds like she also knows where you were adopted from. Where is a three year old going to learn that? Because your parents told her at some point.", "[removed]", "[removed]", "NTA\n\nYour sister is grade A tho.\n\nI wish your parents had always made this part of your story, and regardless, it should never have been something that was secret FROM you. The fact that your siblings knew makes it really hit hard.\n\nAnd did we all mention your sister sucks?!? She's HATEFUL!!", "There should be any stigma against being adopted. Your parents adopted you, the *chose* you. If anyone is the asshole here, it's your sister for making this an issue for you.\n\nNTA", "NTA your sister is the worst. Your parents screwed up big time, too. You are right to be upset.\n\nCongrats on your sister for ruining her own birthday by being a major AH.", "NTA, your parent's neither, they took some big bad decisions tho. But your sister is the only AH here", "[removed]", "Nta. But I think your parents meant well. I don't know, but families fight and bicker and love each other all the same time.", "Instead of just enjoying her birthday. Your sister made it about you when she forced the parents to out this family secret. Also why did all the siblings know about it and not you? They should have told you first not last. Seems like an out burst from a middle child who is always seeking parents attention through putting down the competition. \nNTA", "NTA. But your sister definitely is", "You were chosen to be taken into a family and loved. The other two were pot luck.", "NTA and neither are your parents. \n\nYour sister on the other hand is big time snob and a. She’s an embarrassment to your family.", "NTA.....but your sister is a HUGE AH. I'm sorry this happened to you. I do understand because I found out at the age of 16 that I was adopted by my step-father. My mother was my biological mother. I spent my childhood wondering why my father didn't like me....then I finally understood....he wasn't my father. I have spent my life (I'm 70) hating my step-father and being angry with my mother for not telling me the truth. I have been seeing a therapist for 7 months now because my anxiety was causing heart problems. Please don't wait and try to deal with this on your own. Seek out some help. It will make all the difference in the world moving forward.", "I’m sorry you had to find out this way. You’re NTA at all. Your sister, however, is a major 100% AH with a hairy mole.\nI believe in karma. Hers will come soon.\nI just wonder why your parents were so afraid to tell you sooner?\nAnyway, I hope your parents didn’t treat you differently throughout your valuable life. Be strong, you’re wanted and lived by many, I’m certain.", "I found out I was adopted when I was 20, and that shit was devastating, I was in shock for a few hours because I felt lied to my entire life. I got over it because I know my family loves me unconditionally, but it felt like the sky falling at that moment. It will get better. \n\nThat being said, your sister is a complete AH, you should probably go low contact with, or NC. If she didnt want to make it about you, she could have just stfu.  \n\nYou're NTA at all, and never will be in a situation like this.", "NTA.\n\nI agree with other posters that your sister weaponizing your adoption makes her a major AH.  As an adopted child myself, I'm not pleased with your parents not telling you.  I knew from my first memories that I was adopted.  Whenever people were AHs about it, I would tell them at least my parents chose me.  I'd remind myself of that privately, too.\n\nYour sister is wrong.  You didn't make the situation about yourself.  You made a comment about how thoughtful her boyfriend was to hand pick a bouquet of flowers and she turned around and called you cheap/trash because of your biological origins, forcing your family to drop this huge thing on you while she sat back sadistically watching.  Then she turned around and tried to blame you for this moment that she created.\n\nI think you're doing what you need to do to process this.  I hope your parents will be more forthcoming going forward.", "NTA\n\nYour sister is delusional, she started the hole situation and knew you would be devastated. You didn’t “steal” a damn thing from her. It sounds like she is bitter at being replaced as the “youngest” so she lashes out at you.\n\nGive your parents a chance to explain.  I know you are hurting, & they are most definitely in the wrong for not telling you sooner. But when & how to tell a child they are adopted is hard especially given your nasty sister.  I am guessing they wanted you to grow up sure of their love and of your place in the family. They didn’t want your sister’s insecurities to cost you your self assurance.  Also they might have been afraid of you rejecting them.  Many adopted children react to the news by making up elaborate birth parent stories.  If my birth parents were here they would let me do whatever I wanted!\n\nI hope you and your family recover from this and grow closer together, except the sister who started it all. I hope she gets therapy.", "NTA. Your sister is for how she's treating you. Your parents are for letting her treat you like that, for withholding such important information from you, and for not responding to you now when you may need their reassurance, their explanations or whatever else you need most. Has anyone but your youngest sister reached out to you? I'm so sorry you're having to go through this apparently on your own.", "NTA. Idk if you’re in therapy but it might be helpful to have a third party help you navigate this incredibly difficult situation and how to move forward with your family.", "Coming from someone who was adopted, your definitely NTA. Can’t believe your parents didn’t tell you and sibling used it against you like that, I’m really sorry this happened", "HUGE NTA; if I were you after a comment like that I would seriously be considering going no contact with your sister for awhile at least she has some major issues because what she said to you was just so messed up and hurtful. Really sorry you are going through this OP, definitely NTA.", "NTA. Your \"sister\" isn't worth your time or attention. But your parents should reach out to you and talk. If they don't, they are ah's.", "NTA, she totally weaponized your adoption and then got pissed that you got upset and \"made her birthday about yourself\".  \n\nDoes she have a mental disorder that she doesn't see that she did thus to herself?", "[removed]", "OP  your 1 sister is obviously a horror show. The rest of them screwed up badly. NTA", "NTA but you sister is . Your parents wanted you, they chose to have you. Cut her off before she can hurt you more.", "NTA and your sister is a total AH.  I would block her everywhere and refuse to even speak to her again. Take a deep breath and just be still.  You have received a lot of information and you are probably overloaded with emotions and questions.  When your parents do contact you, ask to speak to them in person and let them tell you what they feel they want to share.  I would definitely ask why you were never told.", "Parents should’ve told you about your adoption when you were around 16-18.", "NTA well, at least you don't have the same DNA as your awful sister. Don't forget, your parents choose to have you. Good luck, this can't be easy for you.", "> I got a text from my sis after 2 hrs on how I make all situations to be about myself and how I stole her limelight on her birthday.\n\nYour sis made the day all about you by revealing that you were adopted.\n\nNTA", "NTA. If you were adopted, you should have been told ling ago.  \n\nI had a school friend that was adopted. Her goto phrase when her older brothers were being mean was\n\n“ Our parents picked me.  They are stuck with you. “", "NTA but damn your parents should have shut your sister down like a decade ago.", "You sister aimed the limelight right at you! NTA. She is though.", "yeah nta you had a shock and it's not okay that your parents told your siblings and not you. Also she's the one that made her b'day about you so that's on her.", "NTA, go NC with the whole bunch", "Wow, your sister is a big jerk. You are NTA, but she sure is.\n\nI would say that maybe your parents never told you because they love you and they wanted you to feel just as secure in their love as a bio child. \n\nFrom what you say it seems the other 2 siblings love you too.\n\nPerhaps your parents made a mistake in not telling you, but it was a mistake out of love.\n\nI am sorry for your effing horrible brat sister.", "[removed]", "NTA. But your so called sister sure is. You didn't make anything about you...she did by having a hissy fit and saying that stuff to hurt you.", "NTA. Man I'm sorry this is happening to you. Your sister is an AH for real. Take some time for yourself to get your thoughts straight before confronting your parents.", "NTA\nI’m an adoptee. I grew up knowing I was adopted, but there are other adoptees who like you weren’t told that you were adopted.\nThere’s actually a term for this: late discovery adoptee.\n\nThere are support groups out there to help you process it if you are interested.", "Remember they chose you, they just had to put up with her. They couldn't send her back.\n\nWrite that in her next birthday card.\n\nNTA", "I'm sorry you found out the way you did. My heart goes out to you. This is the first time you have ever been in a situation like this. Based on the circumstances, I think you handled the situation much better than most! As for your parents not messaging you back, my heart feels for you. NTA", "Well, your sister is a total AH - birthday drama queen that she is, and then tries to reverse the blame of her actions on you!\n\nCommon wisdom holds that children should be told they are adopted in an age appropriate way as they grow up. But parents aren't perfect, you just had a seismic shift in your world view, so taking some time to process it is pretty expected I would think. It sounds like overall, your parents were fairly good - but they do need to step up now and have a talk that they have put off for decades. The fact that they are not responding to texts isn't right.\n\nNTA.", "NTA\nYour sister is being a spoilt baby.\nConcentrate on your relationship with your parents. Don't bother with the sis until she decides to act like an adult.", "You did not \"steal your sisters limelight\", she bullied you to tears. She is awfull, you'll be better off cutting her out of your life. You deserve so much better than this siblingabuse, because that's what it is. You are NTA", "The bad news is your sister is a major AH. The good news is that thanks to her bitchiness you now know she isn’t actually your sister. So no regrets if you cut her off. And she ruined her own birthday with her toxicity. NTA \n\nYour parents are also AHs because they should have told you years ago.", "Excuse me, what?   Your sister got mad because you made that whole thing about you on her day?  Didn’t everyone else there try to shut her up?  Didn’t she just keep pushing and pushing and **pushing**?? Wasn’t she the one that demanded your parents tell you the truth?\n\nAll you did was listen.  That does not make you the ah.  That title goes completely and totally to your sister who, by the way, absolutely does not deserve her boyfriend if she can’t appreciate the effort it took for him to give her that bouquet.\n\nSo yeah, you are definitely NTA here, don’t worry.   You’ve got plenty of other stuff to think about so just let this go.", "NTA. You can bet that the sister has been waiting for the chance to spring this on OP for maximum devastation.  She weaponized it and then threw it into conversation just like a grenade. The sister is a huge AH, and parents are AH for not telling OP and allowing the environment that let this happen.", "Don’t be mad at your parents your sister you can  b pissed at her. I’m sure your parents never told you because they wanted you to see yourself grow up as a part of the family and not feel like an outsider, and for you to think  what’s wrong with you because your parents didn’t want you. I’m a way it’s even more special because they didn’t have to love you but they chose to love you and keep you safe and sound. Now when your siblings say to your face your adopted. Just reply hey they chose me but they had to love you", "Good grief NTA She brings it up and accuses you of stealing her oh so precious birthday? She is 25 not 5. Imagine that. Conversations other than about the birthday girl happen. Bet she's mad she didn't get a bouncy house, too. As for those parents, dude, what were they thinking?", "Nta, how she told you and the reason she told you (because you made a valid point about being grateful) makes her the asshole.", "NTA! 'Sister' behaved horribly. You are so right, sister should have been impressed that bf went to the effort to find and pick the flowers, rather than fussing over $$$. Throwing the fact that you were adopted in your face is nearly inexcusable.", "NTA. She's the one who told you you were adopted, therefore making it about you.", "You: NTA. Your sister: I'd call her a bitch, but that gives actual bitches, such as myself, a bad name. Your parents: I'd put them as AH because they should've told you waaaaay sooner. I'm more than positive they had their reasons, and, speaking from experience, the reasons are probably not that great but were probably done so with good intentions", "I wanna punch your sis, shes the AH", "NTA.  Your sister is a jerk. She said those things to hurt, and used them to try to hurt you. She only ever wanted to hurt you with those statements, and it's sad that your parents didn't:\n\n1. Explain to you earlier\n2. Curb her attitude at an earlier age\n\nso EVERYONE EXCEPT YOU is the asshole here.", "I'm of the firm belief that children should know they're adopted the whole time or you then have one of these very awkward we have to tell you something situations! If your parents believed they shouldn't tell you you're adopted, then they should have changed their mind the minute your sister started with the nasty you're adopted comments when you were a kid. They should have realized that that moment coming younger was probably better than a coming after 22 years!\n\nYour sister is the biggest AH here! She clearly has an issue with being a child they had and not one they chose! Sounds like jealousy! So she's always been trying to knock you down a peg, and it just so happened that she managed to do it on her birthday... That is certainly not your fault. This is more like FAFO on her part she doesn't get to cause a scene and bring something you didn't know up on her birthday and then cry that you got attention on her birthday! Lol\n\nTake some time and think this all through. Get a therapist, or find some type of form online or you could talk to people that this is happening to also. There might even be a sub here somewhere. Whatever you decide to do is completely fine! But I do believe you need some outside help to navigate this because it's a lot! NTA for the question asked", "NTA\n\nYour entire family is, though.  Hiding you were adopted this long was thoughtless at teh best, cruel in reality.  I'm adopted, so is one of my sisters - we've always known, we had time to know and accept our history, and we always knew we counted for as much as the 2 bio-daughters.\n\nI will put this out there, you don't have to accept it, it's just to, maybe, help you deal with this.   It's been a common cliche in media and popular culture for finding out you were adopted to be a terrible trauma with lots of drama.  I feel like it has convinced some parents to think not telling is somehow sparing the adopted child all the questions and emotions that come with finding out.\n\nI'm not saying it justifies what they did, by any means, but it may explain why they would hide your adoption from you.", "I would go NC your adopted sister and limited contact with your family while you process this info. You can decide how you want to proceed. If you feel like you don't belong, find a group where you do feel you belong. Family isn't always blood or legally adopted. Family can be friends and kindred spirits that you find along the way.", "[removed]", "NTA", "NTA you are a late discovery adoptee. Take time to process this information. You're allowed to feel everything, anger, denial, sadness. You have a lot to work through. Your parents should have given you this information from the very beginning. You should have always known you are adopted. I'm sorry you are dealing with this now. There are late discovery communities (I'm not involved in any directly so I can't advise you.) I hope you find one to connect with that helps you deal with this.", "Update us.", "NTA \n\nThey should have told you.  They also should have respected your need to know. They should have reined in the vicious, atrocious actions of their  child.\n\nInstead, they want to bury their heads in the sand.\n\nMight be time you distanced yourself for your mental and emotional well-being.", "NTA your parents should have told you. Your sisters sound awful. Why have contact with them? I would take a break from seeing your sisters for a year and go to therapy to process this.", "Hey OP. I understand your issue. Once you come to terms with this, I hope you find the strength to forgive your parents. You don't have to, of course, but I hope you do. You're are NTA, obviously. And your sister should have not done that. But you now have other priorities on your plate!\n\nYour parents should have told you a long time ago, they should have told you from the get go, now it's seriously disrupting for your sense of identity. Seek help if you can afford it. It will help you to process all tbis immensely. Best of luck!", "You didn’t steal her limelight, she gave it away when she decided to reveal you were adopted.  But there are more issues at hand, I think the sister is jealous that she’s not the baby of the family and the spotlight isn’t always on her", "[removed]", "When you are ready to text her you can tell her “I am glad to know that after seeing you our parents were not happy so they got to choose me”. Send it with a heart", "Your parents are huge AHs for keeping it a secret, it should be normalized and not something to be hidden", "You are not the AH… Your sister is. You didn’t make it about you… Your sister made it about you. This should not have happened this way… You shouldn’t have had to find out like this.", "NTA your sister is horrible and is terribly jealous of you.  Think of it this way your parents choose you , they are stuck with your sister.    Lol hope you got a chuckle out of that.  For real I am so sorry that you were in the dark. Your parents may have never know how to tell you and were always trying to find the right time but there really isn't a right time.  Reach out to your parents talk to them one on one let them explain.    I know everything is upsidedown you have every right to feel everything you are feeling.  Don't push away let yourself breath and talk to your parents.  Write down a list of questions you want to ask them.  I am sure you have so many questions.  It sounds like aside form your \"sister\" you have a family that loves and cares about you.", "NTA SHE made it about you. Gleefully.", "They all knew and were taught by your parents that you should be excluded from certain aspects of who and what your family is.  The bio children were taught that they should make an effort to keep secrets from their adopted sibling.  That there is knowledge that should always keep them a little divided from you.  This is awful.  It’s awful that they handled your adoption this way.  It’s awful that your siblings were put in this position where they were taught that you are to lord to by all of them and it’s probably the reason your sister grew up thinking that you deserved to be treated differently.  Your parents did this they are the most to blame but I can understand how your siblings might have felt confused or afraid to tell you.  They were always taught that it was the right thing to do and probably thought it would only hurt.  At least that’s probably true for two of them.  The birthday sister just developed a superiority complex thanks to your parents terrible decision", "NTA", "Oh no… I can’t believe your sister did that. NTA", "OP, you clearly are not the AH. Your sister is though. She’s trash and I hope you cut all contact with her. \n\nAt its core adoption is trauma, and you’re not going to be forced to deal with it. Your parents fucked up and they should spend the rest of their lives trying to rectify the lie and betrayal. I strongly recommend a trauma informed therapist who specializes in adoption.", "NTA your sister is horrible.\n\nbut what did your other siblings and your parents do after this happened?  I’m concerned and appalled if they did not reach out to you.", "NTA. I feel for your situation, as your adoptive parents have spoken with their silence and they clearly prefer their biological kids including their mean daughter to you.", "NTA. Your sister is a monster.", "NTA. I really feel for you. Your entire family sucks and your sister is a massive AH for hurting you and then tell you that your stealing her thunder. You have every right to cut her off permanently for her cruel behavior all the way into her adulthood. And the rest of your family don't sound great either. This isn't first time she behaved that way with you. Why are they letting her mistreat you", "NTA. You were bound to have a reaction to the revelation that your parents are not your biological parents.\n\nConsider the circumstances of how you found out. You were told as a means to hurt you, to silence you, to make you feel small. If and when your parents would have revealed the news would  not have been for those motives. So try not to judge your parents too harshly. You've recently become an adult. It could be they were going to tell you the truth about your origins at some point in the near future. But  now you will never know. Don't waste energy being angry about something not happening when and the way you thought it should; life is filled with events like that.", "Don;t be ungrateful that your adopted parents wanted you and chose you. That is a big deal !!!", "Next time she pulls shit like this on you just say that your parents must have been so disappointed with the way she came out that they decided never to take the risk of having genetic kids again. She's a shit person and you don't deserve this OP. \n\nI would forgive your parents though, I feel like the late 90s early 2000s were a different time and people didn't always get the best advice on how to go about raising adopted kids and whether or not to tell them they were adopted. Your feelings are completely valid, but I would see how they respond to your texts/maybe meet up with them in person.", "NTA. Your sister made her day about you, she did that all on her own. She sounds bitter that they picked you to be part of the family. She is 100% the AH here.\n\nYes, your parents should have told you sooner but there are still a lot of older people who have the old fashioned idea that a kid should never know they’re adopted and they could be struggling with that. They probably haven’t called because they don’t want to push you when you’re upset. Not sure I’d agree with that either but there could be a lot of things going on you and your siblings aren’t aware of too. Reach out and ask to speak to them, just the three of you.", "ESH except for you. Your sister is a piece of work for picking on you like that. And your parents and siblings suck for not telling you the truth. They should not have kept this from you. I’m so sorry.", "It bothers me that everyone else knew. It's like your parents were hiding a shameful secret. If they had acknowledged the adoption and celebrated when you joined the family, your sister wouldn't have been able to hurl the truth out like an insult. She and your parents are a-holes. I hope your parents have reached out to you.", "Nta, that's a horrible way to find out. I would definitely recommend cutting that sister out of your life, she clearly doesn't value you.", "NTA  \n\n\nYour sister on the otherhand...I hope her boyfriend finds someone worth his time", "NTA, your sister made her birthday about you when she decided to be the BIGGEST AH.", "How is she blaming you for making her birthday about you when she was the one who did it?? You're NTA and parents need to tell their kids they're adopted as soon as they're old enough to understand the concept, not tell everyone else to use as a joke and insult", "Ohh i would have a snaped so hard there. An extremely strong slap Might reached her cheek🤷‍♂️", "NTA - WOW . .  your sister is a jerk! She has probably been jealous of you all these years after your adoption and used it against you to try to hurt you. She tries as hard as she can to stab you in the heart with this knowledge, yet she shows herself to be incredibly shallow and unkind.  Her comment that you made the situation to be all about you is untrue . .  as she turned your comment on the flowers around to be something way huger than it was and thus she made it all about you. \n\nThe other issue you are having is with your parents for not telling you the truth. However, I don't see ill will in their action . . .  Maybe you can go talk to them and find out more about everything. Don't let it destroy you if you had a \"normal\" life . . .  It will be something for you to work through . .  but be careful not to let your sister see you hurt, because that is what she wants . ..", "NTA / you didn’t ruin the birthday sister did.", "First off, your sister is THE ONLY AH\n\nYou gave yourself the space you needed in the moment to deal with a great shock. It’s not as though your parents say you down and told you and you ran off. You were told by your sister in a spiteful and mean way. She sounds like she’s been jealous of your whole life. And talk about making everything about her, your sister is a real piece of work!\n\nYour parents should have told you a long time ago and as common as adoption has been since before you were born I’m very surprised that they didn’t. That was a mistake on their part and you can address that later. People make mistakes, often under the guise of not wanting to hurt someone. Talk it over with them and then discuss it with your brothers but don’t blame your brothers for not telling you as they were probably raised being told to not say anything. \n\nYour sister owes you an apology. I doubt you’ll get it from the response she gave to a sweet and romantic gesture from her boyfriend. Chalk it up to her being jealous of you and no that it will eat her up inside. Let that be her punishment and smile at her as you think about that.", "Z", "Nta; you can tell your sister that at least you know you were wanted!", "[deleted]", "NTA OP. But holy cow. What AHs your parents are by not telling you. WTF??? Your sister is a giant ass.", "Nta. There’s no way that you could be in this situation. Your sister is a spoiled brat who didn’t get her way. However I do think this is a conversation you should be having with your parents about why you had to find out about your adoption from her and not your parents. Take some time to process how you feel. You don’t owe anyone a reaction.", "NTA OP.  Your sister wins the award for Biggest AH ever for pulling this stunt, and your parents aren’t much better.  They should have been up front with you from the start, and they weren’t.  I would go low contact with them for awhile, but your sister?  No contact.  She is a bully, and not worth your time and effort.", "You're not the asshole for taking this poorly, but damn my full response on what should be said or done about your sister would not pass the rules check on this subreddit, so I'll just say she's a disgusting person who should be told she's not worth anyone's time and the limelight looked better on someone else. She spent years mocking you for being adopted and dropped that bomb on you all over not getting a fancy fucking bouquet. Clearly someone adopted her personality from Veruca Salt. That is some trash act there.\n\nNTA", "NTA. I suspect your 25 year old sister resents you so much as you replaced her status as the baby of the family in her childhood. Suddenly the attention she got because she was the youngest went more towards you and she was just a middle child. And she was also not standing out as being the only daughter and was just one of three. I guess your older siblings didn't feel the same status loss for a lack of a better word and with the bigger age difference seeing you as some kind of competition was also less probable. \n\nThough none of that is of course your fault. If her childhood got worse in any way after you got adopted, it is her parents' fault and not yours. You don't deserve her nastiness at all.", "NTA. \n\nYour sister needs to seriously reflect on herself. You two are 3 years apart, I am assuming you were adopted when you were an infant? You stated you and your sister never clicked, it sounds like your sister has resented you since your parents adopted you since she was no longer the baby of the family. \n\nYou didn't put the attention on you. She did. Had she not exploded at her own birthday, her birthday would not have been about you, it would have been about her. Your sister needs to work on her resentment and grow up. \n\nOP, talk to your parents. There might be a very valid reason you were not told you were adopted. Your siblings knew because they are older than you, and obviously your mom was not pregnant with you, so they have to explain the new addition to the family to your siblings somehow. It's not like you have younger siblings who knew, they are all older, they were 8, 6 and 3 when you were adopted. They must remember you being brought home.", "The fact that your sister has been making these “jokes” for years and your parents haven’t said anything should tell you all you need to know about that. Clearly sister is holding it against you after all this time and your parents let her keep that over you instead of telling you the truth. NTA", "I genuinely refuse to believe this is real.", "Sounds like the evil sister was 3 when OP was adopted and never got over not being the baby of the family anymore.\n\nShe was probably one of those toddlers who begs her parents to put the new sibling back where they found her!", "NTA. Your sister's reaction is not acceptible.\n\nYour parents should have told this to you years ago...", "NTA Your sister is the C word and she obviously has a major jealousy problem with you being adopted. As for being adopted, you know one thing for certain; they wanted you as their child. Your sister? They are stuck with her. They chose you. See the difference? I am sure you will have questions you want answered as is your right. Good luck to you.", "tis a crazy thing", "[removed]", "NTA- adoption should not be a secret.\nYour sister is TA. Cut her off.", "NTA, sister put the light on you. She could've held her tongue. She chose to spill the adoption beans there and then instead. She can complain about you stealing the limelight but she's the one that turned it to you", "I would tell \"sis\" that I was at first hurt getting the news this way, but upon reflection, I am grateful that I'm not related to her at all.  Then go NC.  (No reason not to. She's a stranger.)\n\nNTA", "[removed]", "NTA look your sister is vile. Go Ku contact with her asap! Tell your parents that if they don’t talk to you about your adoption you will cut them also. They may also be struggling to figure out how to tell you more after your nasty pig of a sister blurted this out in the open.", "NTA, your \"other sister\" is a horrid person.", "Nta they are all horrible ppl", "NTA. Your sister seems like the type of person who wants to be center of attention and when you were born as the youngest right after her, she no longer had that attention so she's blaming you for everything, hence why y'all never got along and why she immediately said you always have to make everything about you, which I'm betting you don't since you're an introvert. \n\nSide note I will never understand parents who don't tell their children they're adopted from a young age. I think if you're adopted, you should know you are your entire life. But also the parents need to make sure that that child knows they are loved beyond belief and that being adopted is *not* a bad thing.", "NTA.\n\nCurious: how did you take getting constantly told you were adopted growing up as a joke, especially if it came up repeatedly? I have never heard of siblings saying this to each other even if it was not true. Do you and your family look similar enough that it never honestly occurred it may be true? Not trying to blame you or anything but I found this interesting.\n\nYour parents should have told you though. Pretty grossly irresponsible to have hid it from you into adulthood.", "How on earth did they expect you to react to that? And now your parents won’t answer your texts? Your sister has a major case of main character syndrome to think she can drop a bombshell like that and still have the day be about her. And your parents need to offer some serious apologies for not having told you. NTA.", "nta. your sister should not be attacking you for the simple fact that you are not related. hope you feel better :))))", "I don’t really have an say on this but I feel like the parents or family wasn’t in the wrong here, of course they “were” hiding information on you being adopted but everyone treated you as an sibling/real family member. Never once they treated you any different by the sounds of it, and the sister just seem like she lost being the youngest or the “spotlight” or being the “baby” from everyone eyes. It seems she just never accepted you or the fact she lost the spotlight, maybe both. In all honesty I would talk to your family about it, ask questions, the feeling of betrayed, anger, or even lost could all be dove with questions and answers about it. \n\nAlso the sister is the asshole.", "Your parents withheld this information because they thought that for you -- their child -- this was the best thing to do at the time. My guess is that after the paperwork was done they never thought of you as anything other than their child. And once the years go by there never seemed to be the right time to tell you -- it's not like it's a conversation for Thanksgiving dinner.\n\nPlease forgive your parents. They did what they thought best because they love you.\n\nAnd your sister is a dick.", "These are difficult situations and emotions that you might need help processing.\n\nFirst cut out your sister for the time being. She is an immature bully who is probably resentful and jealous of you.\n\nReach out to your older siblings to see if they know how you came to be adopted. Reassure them that this doesn't change the way you feel about them and ask them to talk to your parents.\n\nText your parents again. Tell them you that you don't mind the fact that you were adopted, you are just angry and upset that they hid this important fact from you. You would like to sit down and talk to them about this. You will be there when they are willing to reach out.\n\nYour parents are probably upset that the 'secret' has been revealed. They might be angry at your sister and afraid of your response. Depending on your adoption story, certain facts might be hard for you to hear.\n\nFinally, find a therapist who deals with issues that adoptees face. You say that being adopted doesn't matter to you now but after you hear your story, you might feel differently. If your adoption story includes being the child of abuse, you might need help resolving how you feel about that. There's also the issue of finding your bio parents- would you want to or not? You will need support as you navigate these issues.", "NTA.\n\nBut now whenever she pulls \"You're adopted\" card you can always say \"At least I know our parents wanted me. They got stuck with you but I was chosen.\"", "NTA, and your sister is a nightmare. It sounds like you just excused yourself from a situation where you were blind sided and shocked which I think is a perfectly acceptable response. Your parents should have told you sooner, your sister needs to be out of your life.", "NTA but when you go back and talk to your parents you need to tell them that your sister has always been cruel and you're gonna limit the time you spend around her.", "Nta. Your sister is awful.", "NTA. Your sister stole her own limelight. \nShe didn't have to bring up the fact that you were adopted and any normal person would react the way you did. She should have seen it coming. The fact that she is mad at you for walking away really shows what a horrible human being she is. \nNot everything is about her and not everything is about money. You should really be proud of yourself for being so grateful.", "NTA - she made it all about you, not you. She doubled down and forced the situation. She sounds jealous and insufferable. If your the baby perhaps she is holding onto a grudge from when you were brought home. Babies take a lot of attention away from the older kids and perhaps she didn’t cope well and this is why she’s so awful. \n\nNot defending her actions just an explanation to why she’s so awful.", "NTA\n\nYou're parents and family should have told you. Even with the best intention of not wanting to make you feel separated from them, they did you a great disservice.\n\nYour sister is an AH. In your family's shoes, I'd be ashamed to be biologically related to her.", "I'm guessing sister always wanted to be the last born and she blames you for your parent's choices,,, you've every right to be angry but also give your parents some time to explain why they never told you", "NTA \n\nOp your family did you dirty by not telling you. By not telling you, they ran the risk of you finding out in a nasty way. Also other people knew but not you, which is not fair. \n\nIn families with adoption sometimes some people try to establish a heiarchary and your sister was trying to use information she had, ABOUT YOU, against you. It seems nasty that your family kept the family secret about you, from you, then your sister wanted to abuse info about you that you should have known but didn't, to hurt you. So she hurt you by flexing on you that you'd been left out of the circle of knowledge and she wanted to make sure you discovered you were the last one to know. \n\nIt's not just you being adopted and not being told about it that's rude, but everyone else knew a secret about you except you and everyone was fine with that. And they eventually used it against you in a nasty way. Nobody wants to find out there's a huge family secret, about themselves, by having someone spring it on them spitefully, to make them feel not included. She's made a big display, of you not being included, in which the implied reason is because you're adopted. \n\nNobody adopted enjoys being placed in a family heircharchy based off blood because it's an insecure situation to be in and you're born that way and it's not your choice. Other people impose it on you. \n\nAnyways regardless of anything, it's your life. You are allowed to be angry or feel hurt. They can't tell you how you should feel. They don't know what it's like to be the family secret, and to be excluded and lied to by omission. They don't know what it's Iike to have their whole world and everything they thought they knew to be true to vanish before their very eyes and to be othered. \n\nYour sister can't know this because she can't know what it's like to be you, but finding out you're adopted in an ugly way like this also opens up a lot of personal identity questions, things she will never have to wonder about, like who are your biological relatives and what happened so that you became separated. She doesn't know what that's like and she doesn't realize how nasty it is to put that on you, in the way she did. \n\nSo now not only do you have your family make you feel bad, revealing that they've been secretive about you, but also you get to deal with the new emotions and thoughts about something that was never part of your reality. \n\nIt's a lot to think about and you're your own person independent of your family, blood or law aside, you can feel however you want to about your own situation and they can't judge because they'll never walk a mile in your shoes. \n\nRegardless of how you were born, you are here and your value and self worth isn't meant to be based off of your family associations or blood, so welcome to this earth, individual person. ✌", "is your sister ok? that’s some wild behaviour on her part. NTA.", "NTA. Everyone has a right to know who their biological parents are. The fact that your parents hid your adoption from you for your entire life (but not from your siblings) makes it especially wrong and shocking. \n\n>I got a text from my sis after 2 hrs on how I make all situations to be about myself and how I stole her limelight on her birthday.\n\nUmmm, NO. That would be your other sister who shat in the punchbowl, not you.\n\nNTA\n\nI hope that once you've had some time to process this, you can sit down with your parents and get the whole truth, and maybe some information that will enable you to get access to your biological family's medical history.\n\nI'm so sorry this happened to you. It's just wrong on so many levels.", "NTA. \nYour sister is a jealous, spoiled brat.\nYour parents should have told you the truth and it wasn't your sister's place to say it.\nYou didn't steal the limelight. You told her to be grateful and she turned your life upside down.\nYour parents need to start acting like parents and answer you back. They owe it to you to tell you the truth from their own lips instead of a look across the dinner table.", "Sorry you found out that way. It would have been hard for you to find out regardless. You’re more mature now to handle what it all means instead of years earlier. Imagine you found out 5 years ago how would you have taken it? Your parents did make a decision not to tell you because they knew they’d be uncomfortable with the situation. Your sister is ta. You didn’t ask for this. Also, your sister is beyond teaching so don’t even bother telling her what to do or how to act. Take her actions in and from her you’ll learn what not to do. There’s a saying that often gets misused: ‘blood is thicker than water’ which you would think means blood relation is more important than friends. But the full quote is actually ‘blood of the covenant is thicker than water of the womb’ which actually can be interpreted as your family are the people you consider to be family by choice not just those related to you. So your adoptive parents chose to bring you in as family of their own and that I think has a deeper meaning because you can’t accidentally adopt someone. I hope you can process the emotions that come from this and hope all the best for you", "NTA - she handed you her spotlight. She should have kept your mouth shut.\n\nEveryone has different views on adoption but I personally think that the kids have a right to know where they came from. I had a teacher in high-school talk to us about how her daughter was adopted and from the first night she came to their home as a baby, my teacher would pray to thank her parents for allowing her to be a mom. Her daughter was 7 or 8 I think when she told us that story and to that day they had never missed a prayer to \"thank\" the bio parents for choosing to let her go so she could have a better life. \n\nYour sister though, is a gaping AH", "NTA. That was not the time or the place for that conversation. I would hope that your parents understand that & will talk to you later after reeming out your sister. Seriously what a brat. Then had the audacity to say you ruined her birthday, like you were the one who brought it up. Seriously what a brat.", "NTA, OP. This is complex and you have every right to feel upset that the fact of your adoption was kept from you all this time. I suggest keeping the lines of communication open to your parents and your eldest sister and brother.\n\n25 sister is just the worst. I'm wondering if she isn't holding a grudge against you for being younger and \"stealing her place\" as baby of the family. If so, that's not on you. And you didn't steal her limelight nor ruin her birthday, she did that all on her own with her pettiness and vindictiveness. She knew you were adopted and instead of keeping it for a different day, she dealt you a punishing blow. \n\nGood luck, take your time, talk to your family, and if need be, seek therapy to help deal with the everything in positive and healthy ways. And cut 25 sister out. She is NOT good for you.", "[removed]", "Ok...so much to unpack here....\n\nFirst, you are NTA.\n\nYour sister, on the other hand, is...she is also a few other things, but let's just stick with her being the AH for now.\n\nYour parents probably should have told you sooner that you were adopted, but being adopted myself, I can understand why they didn't. My parents told me that I was adopted when I was 10. Not really a good age to tell me about that. I really didn't understand what it meant. They probably should have held off for a few years yet, but that's just my opinion. I ended up not feeling like I was part of the family for years after that. To be perfectly honest, I still feel like I'm an outsider when I am around them, but they are the ones who raised me.\n\nCurrently, your parents and other siblings are probably in shock about how this all came out. It may take some time to process. Give it time. If possible, maybe go to their house and talk with them in person. Text messages and phone calls are no substitute for in person communication. Let them know that you still love them and will always consider them to be your family. \n\nThe only person who I would recommend that you actively avoid is your sister. At least for now. She sounds a bit toxic. \n\nGood luck OP.", "Your sister is a cruel person, and I'm really sorry this happened to you.  She seriously sucks. \n\nWait for final analysis til you talk to your parents.  NTA.", "[removed]", "NTA. That's a lot to process and I'm sorry your sister is such a little spite troll. Her reaction to her boyfriend's gift is very telling of how awful she is. And the fact that her text to you wasn't an apology but to continue to harass you and further twist the knife speaks volumes. You didn't make the day about yourself, she forced the spotlight upon you by doing what she did.\n\nBut let's not gloss over the AH behavior from your parents who kept you in the dark and are now not responding to your texts. You deserve answers. I hope you're able to sit down with them and get the full story.\n\nBut no, you're not the AH for having a very human reaction to very big news.", "Your parents were stuck with her. They picked you over and over again without ever making you feel adopted. That may have fucked up the endgame but there is a lot of love there for you, for who you are, and not because they “had to”. That’s worth something in all this.", "Your sister is the only villain here, your parents didn’t tell you because one they raised you from a baby. Secondly, your biological parents might have specifically said they don’t want contact or for you to look for them. \n\nIt happens, it sucks, but it happens. But don’t punish your parents, your sister is the only one that needs to fuck off.", "If you want family talk to me I'll be here and I won't treat you like that. Blood doesn't make family. Your better than that. Your gonna do great. Love yourself no matter what.", "NTA\nYour sister is.  She's also classest and trashy/tacky. \n\nShe made her birthday about you the minute she opened her big mouth. So that's her own fault.  You're likely adopted,  and your sister has internalized that. I have the feeling she resents you becoming the baby of the family based on her spoiled bratty behavior.\n\nYou (your family,  and your sisters bf) deserve better.", "NTA of course not. Your sister is.\n\nI would almost say your parents are for not telling you all along.  You shouldn't have been the only person not to know something so personal about yourself, especially  considering it left you open to the truth being weaponized against you. But cultures vary and since English isn't  your first language possibly you're from a country where adoption is looked down on? In which case they were trying to protect you. But have your parents or other siblings reached out to you,?", "NTA\n\nOP, I'm the parent of an adopted child and a bio child. Our adopted child has always known she was adopted and it's been a very normal part of her life. In fact, my younger (bio) child decided, when she was little, that she was born in Egypt to a Chinese mommy's tummy. I think she wanted to be like her big sister. Another couple we only slightly knew chose to never tell their twins that they were adopted. It did not go well, when one teen found out from a 'friend' who was a lot like your sister.\n\nSome adoptive parents do make the mistake of not telling their children the truth early on. It destroys the child's sense of trust in their parents. That doesn't mean they didn't/don't love their adopted child, only that they made a terrible mistake.\n\nYour sister has clearly had unresolved anger about your adoption from her childhood. Your parents ignored it and never helped her resolve it. That's too bad for her, but it's her problem now to get past or not. And your right to protect yourself from her. She will always find a way to blame you, but she is wrong.\n\nI don't understand what your parents are doing now. Not reaching out to you?!? It seems that maybe they are severely limited in their ability to deal with conflict/the truth of how you came to their family/something... Seems like your older brother and sister are the closest to emotionally mature people. Maybe talk to them.\n\nI'm sorry you found out this way. And I'm sorry your sister/parents have some emotional challenges that are causing you harm. I'm glad that you did have a pretty normal upbringing to get you to early adulthood. You may find it helpful to access some counseling support (through your school if you are in college) or through your employer/insurance if you are working. Keep your distance from your troubled sister. And get a sense of what your parents' limitations are or whatever is going on with them. Your priority is you. I hope you find some support in your brother/sister and/or extended family and in your friends. Good wishes.", "Its because they had you , that they chose me .", "NTA. i just found out i was adopted not too long ago aswell, though it was me looking for answers after getting hints. it was a big revelation and i imagine finding out in that context being yelled at by an AH didn’t help either. sending hugs", "NTA. I knew I was adopted pretty much from the get-go. Your parents are infinitesimal a-holes.", "You and your sister are assholes.  Maybe she's a bigger asshole than you but compared to other people you guys are both pretty gaping.  Your life would have probably sucked if you weren't adopted. What do they owe you exactly? So what would you rather, have grown up in foster care or have found out you were adopted? Why isn't it taken as just something you can't handle considering your sister the one that spilled the beans and clearly your parents who love you weren't ready to tell you? Cuz can't you realize that it's a good thing? You wouldn't tell somebody you did something good for them if they wouldn't see it that way", "NTA, the sister is lucky you only stormed off, I would've thrown hands. It's not like being adopted is a bad thing but it wasn't her concern to be the one who told you", "NTA.\n\nThat's why it is a law in some countries that adoptive parents tell their children right from birth that they're adopted.", "Just remember that your adopted parents love you very much. You have some stuff to work through with this revelation, for sure, but don’t fracture your relationship with your family over this.", "NTA, your sister quite literally sounds like a sociopath who enjoys inflicting pain on your.  I would go full on no contact with her forever, or atleast for  along time.", "NTA yours sister is a horrid horrid person. I hope your parents ripped her a new one. May she be infertile. That may be over the line and harsh but lord she needs a dose of karma. \n\nYour parents should have told you. Being told like that is god awful.", "NTA. Your sister was horribly cruel to introduce the discussion the way she did. It was the responsibility of your parents to share with you and answer any questions in a calm and safe space.", "Lol your sister ruined her own day. What is wrong with her", "Search LDA (late discovery adoptee) and find resources to help you navigate this new revelation.", "I would love to break your sisters legs for you.\n\n*E- hug*\n\nEdit: remember, it's hard being a parent, and they make mistakes too. They probably debated whether or not to tell you and went with the lesser evil, or so they thought. Forgiveness is medicine.", "[removed]", "No, SHE is the asshole!", "[removed]", "NTA!  Your sister is the one who blew up her birthday.\n\nI’m so sorry you found out you’re adopted this way & that they kept it from you.  I was adopted as an infant and my parents must have told me when I was old enough to understand, because I feel like I’ve just always known.  I think all parents should handle it this way, because it will eventually come out and then it feels like they’ve been lying to you your whole life.", "Your sister is poisonous. You're parents messed up but I can empathise why. Even if it was selfish. They put you in a vulnerable position to your sister, who joyfully exploited it. You have a right to take your time and demand answers. However, your parents can restore the trust by laying down the law with your sister. They should be ashamed of her behaviour", "NTA.\nYour family as a whole are quite AH though.\nI'm a prospective adoptive parent in a European country.\nHere, a couple MUST take classes and have a certain number of meetings with a social worker and a psychologist appointed by the competent court, and undergo checkings that involve also the extended family, to be deemed suitable to be adoptive parents. During all courses and meetings, they continuously specify that, BY LAW, you are required to tell your children that they are adopted and you must do so immediately, even in the children are very young. And since the family is (also by law) checked regularly by social services, it's easy to check if the parents are lying to the children about their past.\nThere are several reasons behind this law, trust being the main point, and I'm shocked that in your country it is possible to lie like this.\nI'm also very sorry for you, I imagine you traumatized and sad you must be now that you know that all your family lied to you.\nWhat makes my blood boil, though, is the way your parents and other siblings let your sister use your adoption against you, which is especially horrible since you didn't know about your origins. I feel for you for this, too.\nYou and your parents should probably go to family counseling both to rebuild trust and to work out the issue with your parents enabling your sister's attitude towards you.\nYour sisters sound too entitled for her own good (her reaction to the sweet gesture her boyfriend did with the flowers says it all).\nHope you can find a new equilibrium and reacquire your serenity soon.", "NTA what is your sister onnnn😭😭", "adoption can be a wonderful force for good, but there tends to be trauma on all sides. \n\nop, that sister of yours does not deserve another moment of your energy. \n\ni hope your parents are just trying to deal with the drama after all the years they hid it, for what possibly seemed like good ideas at the time. i hope they get over their embarrassment or whatever, soon. \n\nbut go nc on the sister, she’s not worth it.", "You deserved to be told in a way that made you feel cared for and safe- not shamed in a group setting. You are absolutely right in your feelings that you should have been told especially as the rest of your family knew. I'm sad that your parents let your sister throw it in your face all those years and never felt compelled to protect you by talking to you directly about it.", "So your sister is not your family. She is your bully. She was the one who created a scene by sharing that you were adopted SHE made it about you. It’s time to ditch the bully. If the rest  of you family deserve it then keep them on the condition that you do not have to have a relationship with her. Prepare a list of all the shitty things she has done to you in the past so you can make a point of what she is. \n\nAnd take time to process this and think about what you want to know and what questions you feel you need to have answered. NTA", "Cheap? \"Sister\" thinks adoption is cheap? All your parents did to have her was sex. Thats free. \n\nNTA", ">I got a text from my sis after 2 hrs on how I make all situations to be about myself and how I stole her limelight on her birthday.\n\nThe ah she is, she CHOSE to shine it on you. Then gaslight you into making you feel worse about this whole ordeal? NTA at all. I just KNOW she is getting fckn shredded by everyone for her actions right now. Let her burn in that fire.", "I am adopted and was told at a very early age, so no surprises for me. Many years later my adoptive parents had a biological child. When she was about 14 she mocked me, saying that HER parents loved her more than me because I was only their adopted child. I smiled at her and calmly stated: \"they *chose* me, they had to take potluck with you\". Shut her right up. She let me know later in life that she didn't consider me 'real' family by keeping my share of my father's estate and taking the lion's share from my mother's estate. \n\nEdited to add:\n\nYou are NTA, the remainder of your family has been very much in the wrong. Perhaps when you are feeling more calm, you could approach your parents and ask they why they hid such important information from you. The likelihood of finding out one is adopted is very high, and it is obviously much better to hear this information at a young age and from a loving source. Count yourself lucky that you aren't biologically related to your very cruel and hate-filled sister.", "NTA. \n\nthe fact that your parents never let you ever experience the feeling that you were adopted speaks volumes. so dont take it as a betrayal. maybe they didnt want to feel any different. \n\nyour sister on the other hand. she is a massive AH. you can already go NC with her without any worry. but not the rest of the family, who seem to love and care for you so much.", "NTA. What a horrible way to find out you're adopted.", "NTA, your sister is psychopathic or a narcissist.", "NTA.  Your parents should’ve let you know about your adoptee status when you were very young.  My parents did, so it was never a big deal.  There are online groups for late discovery adoptees you might want to look into.", "NTA \n\nThat is a horrible way to find out. If this was me. The next time she said or did something mean I would tell her “thank goodness I’m not blood related to you.”", "Paragraphs please. Nobody wants to read alphabet soup.\n\nAnd yes... YTA - parents are the ones that raised you, not the ones that ditched you.", "NTA. Your sister sounds like an ungrateful, materialistic word I can't say.", "OMG have Mercy stop the Bad fiction. You realize people believe what you write not because it's good, but because it's supposed to be true. Because of the Reddit aita bias..", "NTA\n\nYour sister made her birthday all about you. Call it instant karma for her spitefulness and wish to hurt you.\n\nI see it on here so often. Parents who refused to tell their child they were adopted. And they expected that the child would never find out when it was an open secret and there are ancestry tests.\n\nYour parents fucked up badly. You should have grown up with this knowledge. Every expert says that.\n\nI'm sorry you were spite told information that should never have been kept from you. Your parents have some explaining to do and owe you a huge apology.\n\nNTA", "Let me tell you- the first thing I taught in resource parent training was that you tell kids from the gate that they are adopted. Your whole family is full of assholes. NTA. I suspect it’s going to be difficult to repair your relationship with them.", "NTA. Your sister is, though. \nI understand how you feel. I found out right after my dads funeral that I was adopted. I was in my 20’s, too. Like you, I wasn’t angry that I was adopted—my parents were wonderful, and I’m sure I would have lived a different life if I had been sent to an orphanage. But I was hurt and sad that I didn’t know sooner, so I could have thanked my dad before he died for adopting me and giving me a good life. Anyway, I’m sorry you had to find out in such a terrible, dramatic fashion. When the anger fades a bit, go see your parents and talk to them.", "We need to continue to normalize the idea that we, as individuals, get to CHOOSE who we call family. OP you're definitely NTA, and the fact that your parents hid the info of you being adopted is concerning. Your sister is the real AH in this situation by forcing the situation and having the emotional range of a teaspoon (shout out to Hermione Granger). I would give your parents a chance to explain, without any other siblings present, but even then your feelings regarding the situation are valid. I wish you the best OP.", "NTA. Your sister was being really mean, and finding out you’re adopted is emotionally intense at the best of times. So yeah, leaving so you could sort out your feelings without your sister yelling at you was a fair move.", "NTA! OP’s sisters are way too freaking old to behave this way. They suck. Also I’m not sure what their reasons may have been to hide this from her, but how terrible of the parents to not respond or check up with OP after it happened.", "NTA. You were telling her to be more grateful for the gift she had been given and she made the get-together about you, by revealing something that your parents didn't want to discuss with you. That's a whole separate issue, but your sister is definitely the asshole, here. She doesn't get to complain about you being the focus when she made you the focus.", "As an adoptive mother holy hell are you NTA.  Your sister and Parents have a lot of answer for.", "NTA may your sister always shit hedgehogs.", "Your sister (25F) is horrible and either blood related or not she is not your family. NTA OP.", "[removed]", "NTA. \n\nNext time it happens, remind your sister that you being adopted means your parents actually wanted you.", "your parents suck here for hearing all these jokes over the and never doing something about it(correcting her horrid attitude, telling you the truth, etc)\n\nBy ages, she was 3(when you came to family) so her understanding that you were adopted?  Seems like it was mentioned to her when she was older also(while kept secret from you).  They could have just told her the stork brought you(at 3--she probably believed in Santa Claus too)", "Your parents haven't responded to your texts?! WTF. NTA. THEY however are massive ones for leaving you hanging about this. And your sister accuses YOU of stealing her limelight?!  And even bigger AH than your parents. If you have good friends or a partner, gather them around you now and let them comfort you. As for your family--forget them until they are willing to come crawling back full of apologies for their awful behavior.", "There are many assholes here and you are not one of them.\n\nYour siblings knew you were adopted and you did not. This was not something they should have known and you did not. But regardless you should have grown up with this information.\n\nWhat were your parents thinking?\n\nYour sister is just foul. What a thoroughly nasty piece of work. She made her day about you and then blamed you. This is not one off behaviour and your parents should have dealt with it. \n\nNTA", "NTA. You were surprised at finding out something that could have been shared lovingly earlier in life.  You handled it beautifully by getting up and leaving.\n\nGo talk to your parents. Just you and them. Ask them why they didn't tell you.  And then just listen.\n\nBoot the drama mama sister in her a$$. \n\nGood luck to you.  You have more dignity and adult behavior than most people. Trust your heart.", "NTA you sister is the AH and it was very ignorant and idealistic of your parents to not tell you making them the AHs too", "NTA. Your sister is an AH.\n\nAlso, I never understood why any parents would hide the fact their kid is adopted. They will find out eventually and be heartbroken. Why would you not teach them this from day one?", "NTA\nYour sister is a horrible narcissistic person. She will never be happy. She is jealous of you.\nIt is obvious you are a good person. Nothing will ever be good enough for her. Love your family and start the healing with your parents, cut ties with her, and decide if you want to do a DNA search for relatives. \nYour parents made a horrible mistake, though they love you.", "[removed]", "NTA. Your sister is defiantly an AH though. She kept on bringing it up, using against you from a child, dehumanising you in her eyes. And she’s a brat for behaving that way over flowers, I really hope karma hits her hard and he ends their relationship.", "NTA—your adopted sister made her birthday about you. She made it about hurting you.", "You are NTA and I'm sorry the news came to you this way. Your sister was already being a brat about a thoughtful gift and she shouldn't have unleashed her anger on you. And your parents were wrong in not letting you know from your childhood about this; there has been so much proof shown that it does the child no good to hide information like this from them. You had every right to storm off.\n\nMy mom was in a similar situation where everyone in her life except her knew she was adopted. She only found out in her mid thirties after both her adoptive parents passed and she received a letter in the mail from them. Apparently her older sister (not related to her nor the people who raised them) tried to [redacted due to not knowing subreddit rules] her life when she found out that she was adopted that my mom's parents decided it'd be best not to let my mom know the same thing. I was only 3/4 when she found out so I don't remember it but it messed her up for a bit. Please take care of your mental health and confide in those you trust to help you get through this. Good luck if you decide to search for your birth family, but know you don't have to either. And good luck if you seek to repair the relationship with your family, if you choose to.", "NTA.  Your parents should have told you long ago and they should have called your sister out for being so nasty all these years.  Your sister should get blocked and go no contact.  I would seriously consider going that way with the rest.  Your siblings withheld it from you as well and they are all adults.", "NTA. \n\nI am an adoptive parent and my heart breaks for you. I expect your parents were doing what they thought was best for you in not telling you, but that doesn’t mean that it was the right thing to do. You should have known this a long time ago. \n\nIf you can, I suggest finding a therapist who is experienced with adoptive clients. You need to be able to process this information and a therapist can help you through that. \n\nI also hope your parents are willing to talk with you and provide you with all the information they have about your birth parents and where you were born. You have a right to know who you are and where you are from.", "NTA. First of all, for your parents to hide it from you when clearly everyone else knew is hurtful AF.\n\nSecondly, your *sister* made it about you by bringing your adoption into it when you simply made a comment about a hand-picked bouquet being nice.\n\nThird, if your parents knew she was targeting you like this, they should have dealt with it *much* sooner.", "NTA your sister and parents are TA, I have a half brother and to be frank we both used adoption as a way to get under eachother's skin but we never saw the brother from another mother thing, like as an actual point of insecurity, at most we never mentioned it and kinda related it to Drake and Josh, I remember one time I called him my step brother and my mom yelled at me, and that day I learned what a half brother is, before that point I thought step brother was the only other type of brother other than a full brother I never really heard the term half brother in media before drake and Josh.", "ESH. \nYour sister first and definitely is the worst. This is life-altering info and the manner in which she had it sprung on you is awful. I feel for you for that. \nYour parents next because you should have been told a long time ago. I am both an adopted child and have adopted a child myself and my only thought is that, to your parents, they love you with every bit of their being as they do your siblings and they perhaps didn’t see a reason to tell you. But this was complicated because your siblings knew, so that plan was never going to work out. \nFinally, you (but just a very little bit.) I don’t blame you for being super angry at your sister and to a degree your parents, but you really need to at least hear your parents out and understand their viewpoint. If you have nothing to do with your sister, I don’t know that anyone can blame you there. I hope you and your parents find a way forward.", "That was a painful situation. You are so fortunate that your parents' love shaped you into a kind person. Thankfully, you are you and are not your sister. This news, painful, especially that siblings knew this fact before you, none of this can take away a lifetime of love from your parents. They must feel pain that their oldest daughter was vicious toward their youngest child.", "NTA - Parents should have told you a while ago which makes them AHs. Sis is a major AH though by weaponizing your adoption against you. Also you didn't ruin her birthday by making a scene and taking the limelight; she ruined her own birthday by weaponizing your adoption yet again and forcing your parents to have the difficult conversation.", "NTA. Your sister is a mean one though. And your parents for not stopping her.", "NTA. Your sister and parents are mega AHs. Get away from them and start a family of your own, if that is what you wish", "I gotta ask. How on planet earth did you possibly think you were the asshole in this situation? It feels like you didn’t need reddit to tell you you’re not an asshole in this situation.", "NTA.  In fact, your sister is a huge A, and needs to be yeeted into the sun.", "NTA. They ALL are.", "NTA. Your sister is a hateful creature. Making you feel awful was probably her best BD present. Your parent's behavior is inexcusable. First, they kept this from you when everybody else knew it. Now they aren't even talking to you to explain themselves and reassure you of their love.", "You are NTA, but your sister is a raging, warty hemorrhoid clogged one. My GOD what a toxic nasty thing she is!", "NTA, sis is a monster.\n\nYou found out you were adopted by someone **trying to hurt you**.\n\nShe's shit.", "NTA Your sister is an asshole. She made her day about you and she sounds like an entitled, selfish person. I'm APPALLED at your parents that haven't responded to you.  You deserve a conversation at the least.", "NTA. Your sister is claiming you made her birthday about you? I think she forgets that was HER 'power move', not yours. There's nothing wrong with adoption, so I am confused as to why it was hidden from the one person who most needed to know it.", "The fact that only the ah sister has reached out (to berate her) is telling", "So they hid it from you, allowed sister to make that \"joke\" all your life, then ghosted you when you found out? Solid parenting 👌 who let them adopt 🤦🏼‍♀️ NTA", "NTA - Wow, that’s a lot to digest…", "NTA, your sister is way more than an AH in my opinion. Entitled, stuck up amd just outright disgusting to be around with the sounds of things. She's a major asshole.\nAnd your parents are too, why hide it this long? Also its seems like they haven't even tried to stop your sisters absolutely disgusting behavior and enabled it. From my point of view they created this monster of a human and you just seem to be her target because she knows she can hurt you like that. \nYou deserve way better than this OP and honestly my heart goes out to you.", "Nta! Your sister is! So are your parents actually!  Your sister has been saying this to you for years. She’s wicked! Your parents should have told you a long time ago! Such a huge betrayal of trust! Thing is it’s not bad to be adopted but for your whole family to have a secret so huge about you and kept it quiet all these years is just awful. I’m sorry you found out like that and honestly walking out was probably the best thing to do.", ">Parents should have told you sooner.\n\nParents should have raised OP with that knowledge from day 1. Literally  every expert on adoption says this. I say this as an adopted child. I always knew. It didn't make my bonds with my parents or brother any worse.", "[removed]", "I hope she steps on a triangle lego every single time she has to pee in the night.", "Yeah OP’s parents should have told her *years* ago. This essentially shattered her trust in them and I don’t know if it’s fixable. Also, being adopted isn’t a bad thing and for the sister to act like otherwise is such a jerk thing to do.", "Parents are horrible for letting her leave without talking to her. They could at least contact her after the reveal and see that she is ok. And get that awful sister away from her. What are they? Puppets?", "NTA. But I want to mention that in some cultures, it’s not common to tell the adopted child about it. But parents are AH for not being stricter with the horrible sister throughout their life, since it seems to be a common theme.", " Yep her sister is the \"black hole\" of AH's, trying to suck all the light out of the universe.", "Her siblings knew because they are older. They were 8, 6 and 3 when she was adopted. How were OP's parents supposed to explain to the older siblings bringing a new baby home without telling them OP was adopted?\n\nOP, talk to your parents about why they did not tell you.\n\nEDIT: typos", "That's why they are hosting her. They don't to fix this. NTA", "Yeah, my kids are adopted and have known since they could talk. They don’t know all the specifics yet (foster care adoption, it’s messy) but it’s an massive disservice not to tell a kid. They deserve to know their story", "I hope that boyfriend wakes up and dumps her like week old shellfish.", "[removed]", "Parents are also a-holes. To sit there are let one sister denigrate and insult the adopted sister, that is shtty parenting. I don't care if the kids are now adults. Someone allowed the sister to become this entitled.\n\nOP is NTA. It is huge news, and removing herself in order to process it and come to terms with it is understandable.", "> Your Parents are AH's for not telling you\n\nYes. But they are even more the AHs for allowing sister to bully OP with being adopted for apparently many years. The fact that OP didn't know this was actually true and so brushed it off changes nothing there. OPs parents should have long ago stepped in and had a good talk to the sister. Adoption is difficult on siblings and the parents should have dealt with sister's resentment ages ago.", "TBF, the sister was the only one who was honest with OP. In my book that makes the parents and other siblings more AH than the sister.\n\nin any case, OP is NTA", "Especially when shitty sister has been blurting it out for *years*. \n\nOP, next time that wench sister of yours says something about you being adopted make sure you remind her your parents *picked* you but drew the short straw and got stuck with her. NTA - you have every right to be upset. They should have told you a long time ago instead of letting you find out in such a crappy way. Oh and I hope your sister’s bf breaks up with her ungrateful self.", "I don’t think the rest of the family are AH, everyone deals with adoption differently and they dealt with it by not mentioning it. That’s not to say they weren’t planning on telling OP at some point (hopefully soon given OP’s age but who can tell, someone stole that from them). They have also treated siblings completely equally and it sounds like they lovingly filled the parent role.\n\nSister is a major AH, I’d be furious with her if I were OP. It sounds like she’s always been a brat and never thought of OP as an equal. I’d cut her out completely, she doesn’t appear to have any redeeming features. \n\nOP I’d reach out to your parents to discuss it with them, they may have a good reason for not telling you sooner. Hopefully they also side with you on this argument and offer you the support you deserve.\n\nEdit to say parents may not have reached out yet because they feel like OP needs space, they obviously deal with situations passively or they would have told her she was adopted sooner", "I’m on board with the sister being a major AH but why exactly are the parents AHs for not telling her.  She is her daughter to them in every way but genetics.  OP should focus on that — her parents don’t care about the genetics and neither do her other 2 siblings.  She is part of the family to everyone but the AH sister.", "The sister has gone full mask-off in this situation and she's only just begun to unleash her attacks. She took the opportunity OP provided by disagreeing with her to try to blow up OP's relationship with their family. And it worked, since OP left reeling from the revelation. \n\nNow, she's taken it directly to OP by reversing the scenario to make her the victim and OP the offender while OP is still coming to terms with their newly realized status.  Sister will spread that narrative to the rest of the family circle and expand on how 'hurt' she was, bringing in past situations (that she probably also manipulated) as evidence that OP is an overall terrible person.  \n\nOP is on the path to NC/LC with the rest of the family and I think they should've been NC with sister yesterday, if not earlier.  Once this mask is tossed away sister won't stop until someone intervenes and forces her to stop/get help.  Be on your guard, OP. There will probably be more to deal with, and from other people roped into the drama, too.", "Adopted son here. Adopted kids are not \"step\" kids, they are as much family as their siblings.", "Agree with this comment. It sounds to me like they considered you their own and didn’t feel that the way you became family didn’t matter.", "I understand the reasoning, but in this day and age it’s better to just have it out there. For one, it’s been proven that when a person finds this out as an adult, it causes more trouble than it’s worth.\n\nThere’s also the issue of medical safety. If it happened to be that OP got an illness, or got into an accident, she might need to know her family’s medical history. She could say that no, no one in her family has ever gotten breast cancer, and that could put her in more danger because maybe her bio family has had a history of breast cancer, for example.\n\nNot to mention the whole DNA testing kits that are so popular. They couldn’t have predicted those when OP was a child, but they definitely should have at least sat her down a couple years ago and explained to her on their terms that she’s adopted and the reason they kept it secret and that nothing would change.", "I'm trying to imagine myself in their situation, and, while I'm in favor of honesty in adoption, I have no idea how to confirm being adopted to a child who is actively being bullied over the concept, without giving the bully more ammunition. It would be very easy to dither your way into a dead end of inaction in the name of \"waiting for the right time\".", "Sister needed therapy when they all were younger.\n\nNTA, but I'm thinking this family doesn't like to talk about difficult situations. (It happens.)\n\nOP was adopted young enough that she didn't know she was adopted. But older bitch sister was only 3 years older, so old enough to know that her new younger sister was adopted, but young enough to 1, not understand the situation at all, and 2, to be very resentful about being \"replaced\" as the youngest child.\n\nFrom the sister's (very young) POV, all of a sudden she's replaced by a new sister that would most likely have been showered with affection and told that she has to be nice to her \"new sister\".\n\nResentment is VERY common in that situation ..... in young children. The solution would have been to have honest, appropriate conversations with ALL the children and to help bitch sister to overcome her resentment and let her know she's not replaced.\n\nInstead, they never told OP and let bitch sister be resentful her entire life towards the \"usurper\". And the parents let her bully OP instead of facing a difficult situation.\n\nAnd that dinner was the result of sweeping it under the rug.\n\nThe parents had to fess up to a lifetime of lies. The bitch sister erupted in 20 years of unresolved resentment. And OP learned that her entire family had been lying to her... except her bully.", "Therapy can't fix evil. That comment about liking cheap things because of where OP came from-just shows that the sister is inherently rotten.", "It sounds like he needs therapy to get over this and your parents should have dealt with this behavior when you were a child!", "nothing will fix that .. thing.", "I think its more from the narcissism", "Trying to protect her from her sister by obscuring the truth about her own life would probably be the biggest mistake of them all. It sounds like they’re still not willing to check the sister despite her awful behavior.", "I mean, Harpo Marx was born in 1888, and he told his kids from the beginning. He even had a bedtime story about how they searched for Billy and were so happy when they found him, and then they searched for Alex, and so on.\n\nIt's foolish to hide it, because there's always been a chance it could come out, even before DNA testing. But I don't think it's usually malicious.", "The advice to tell the adopted child they're adopted is NOT new.  I'm in my 50's and for as long as I can remember I know I was adopted.\n\nNot telling an adopted child they're adopted is a HUGE betrayal.  The people they should be able to trust, the parents, withheld important information that everyone else around them knew.  It's awful.", "Adoptee, I’m in my 20s. \n\nThis is not relatively new advice. \nAdoptees have been saying for decades that they should It’s always been in the best interest to tell adoptees the truth.\nNow it’s just advice that is hard to ignore because adoptees are able to speak up and have the platforms to educate people about adoption.", "Mmm, it's not terribly new. We adopted a couple decades ago and were advised THEN that raising them to know were adopted (and is normal) was the norm, as was/is open adoption and had been for a while even then.", "That's what I thought too.  The sister should get over.  If she wanted the title so bad, I would've called her-- CRYBABY.\n\nNTA", "OP can be mad at the parents for not telling her earilier and, obviously, mad at the didter for being a downright monster of a human bring.  Different levels of anger twoards them of course, but she can be upset the parents didn't tell her directly.", "Jealous she is no longer the youngest anymore", "Nah if they decent loving ppl they would have told her the truth", "ZING!⚡️", "That's why you don't wait. You incorporated it into their story from the very beginning. There shouldn't have to be a big reveal.", "The right time to explain to a child that they are adopted is over their lifetime. It's not some big news you break to them. It is something that is explained to them and something they grow up with for their entire life.\n\nI don't remember my adoption, I was too young. But my siblings do. And even if they hadn't had memory, our adoptive parents would have made sure we knew.\n\nEvery year we celebrate our adoption anniversary. We go to dinner and have a party, and on the big major years we go on family vacations.\n\nIf you start young, it's very easy for a child to conceptualize. It's really a lot easier on a child than adults lead themselves to believe.\n\nThere is no reason to hide it from a child, and then wait until they are older to shift their entire world. It's much easier to grow up with knowledge, facts about yourself in your life. Rather than have the rug ripped out from under you when your family tells you facts that you should have already known.", ">when she didn't ask for your opinion.\n\nThen don't bring things up. It sounds like you just want to talk *at* people.\n\n>I mean you were told repeatedly throughout your life that you were adopted. \n\nI mean, kids do that a lot, are you suggesting they're all actually adopted because a sibling said so?", "Not everyone has a driving license or passport, and those wouldn’t necessarily have any information on that would let OP know. It’s quite possible that she may also not have seen her birth certificate, especially if her parents handled the paperwork for passport/driving license/other stuff when she was a minor and they haven’t needed renewing yet.", "I’m an adoptee. \n\nAdoption actually allows for the legal changing of the birth certificate. As in the adoptive parents can put their names as the birth parents on the birth certificate. \n\nAlso depending on the place, the original birth certificate can be sealed from the adoptee for years or even until the death of biological parents.", "You are the worst type of human being there is.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Yeah, the sister is a AH but what the fuck are parents doing ghosting OP? Sounds insane to me.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Don't invalidate, that's really tacky and unkind.\n\nOP's adoptive parents hid the adoption from her for her whole life but not from her siblings. OP has EVERY RIGHT to be outraged for as long as she needs to be.\n\nAdoptive parents aren't saints. Many are AHs.", "But they haven’t answered OP’s texts or reached out. They suck.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA\n\nHow in the world would they ground her, she's 25...", "I doubt the parents will ground a 25yo", "And poops out a hedgehog/cactus kinda poop that gives her ring sting for at least 12 hours.", "That's precisely the sister's problem, it seems, she can't get over the fact she wasn't enough for her parents", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "They let her sister use her adoption as a weapon against her. For years. And they sat silently by. Those parents suck.", "Her sister is a jerk for sure, but for the whole family except for OP to know is awful. I can't begin to understand how this poor young woman is feeling, the betrayal must be awful.\n\nEdited", "Yep. My mom told me I was adopted when I was 13 and it shattered my worldview then. I can't imagine not finding out until I was an adult...", "I think telling OP wasn’t as necessary as disciplining the 25f sister was. She should have been more sensationalised right from the beginning.", "When would be a good time? I am sure they wanted to but could never find a good moment so they put it off. I think there parents loved them so much that they didn't want to hurt her or make her feel less.  It's not right but I understand where they were coming from.", "[deleted]", "I feel like if you adopt a kid, you should **never** keep it from them. I think it just makes the child really not trust you.", "That's what I thought. They should've gone after her to make sure she's ok. The fact that they didn't and won't respond to texts from OP plus no other siblings reaching out speaks volumes. NTA", "maybe they don't want to respond because the 25F is clearly the golden child and that they gave OP silent treatment because OP was quite frank in criticising the golden precious little girl who gets favoured by her parents.", "In Western countries it was also common not to tell adopted children until relatively recently. Largely due to child rearing books that theorized the child would feel more integrated if they didn't know. Only in the last couple of decades did it become frowned upon", "Same. He was a part of the \"ceremony \" when he was five. He is seven now, but still really does not understand what adoption is. Someday he will understand, though, it is not a secret.", "But she was only honest to insult OP...???", "Except her honesty was a weapon she used to intentionally hurt and insult OP so, no she's not the hero of this story she's a major AH whose spent her entire life looking down on OP and treating her like crap because she's adopted.\n\nAs for the parents I'm cutting them a slight amount of slack because adoption is tricky yes, I believe it's important to be open/honest about adopting, but not everyone feels that way. Some parents are afraid that kids will leave, or won't feel like part of the family if they knew, and to me that's not good enough reasons but I won't hold it against someone completely for making this error in judgment because it's a difficult/nuanced decision. \n\nThe other siblings knowing is tricky some were at an age where they were old enough to notice mom wasn't pregnant, and  were informed of the adoption, and as siblings talk might have passed that information on the the other siblings. Them not telling OP is tricky too, they didn't treat her differently, and they were in a difficult position because obviously their parents told them to keep it a secret. \n\nParents and the siblings aren't necessarily ahs they just messed up, that other sister is horrid and the only good thing to come of this is OP being in no way related to that harpy. Once OP comes to terms with this massive shift/ existential crisis she cam speak with her parents, maybe get information about her bio parents, and hopefully the scenarios is that OP was loved/cherished and chosen by her adopted parents. \n\nNTA", "Some people do adopt step-kids and I think the OC was speaking from experience.", "But doing that has repeatedly shown to cause an identity crisis when the adopted person eventually finds out. IMHO parents acted selfishly and not in alignment with adoption best practices.", "And that can happen with birth siblings, too. My aunt resented my father until the day she died.", "[removed]", "That's true in the US/Canada but likely isn't in other parts of the world. Keep in mind we are in many ways socially ahead, moreso twenty years ago before most places were connected online.", "OMG, that is the sweetest thing!", "I agree with you on principle, but I should point out that there have been different schools of thought when it comes to adoption and how and if it should be revealed to the adoptee. \n\nWe think NOW that an adopted person should always be told, but for many many decades, not saying anything was a preferred and a strongly suggested method by literally all the professionals involved in adoptions. Doesn’t make it okay and I think modern approach to telling adopted children (who can’t remember it themselves) early on is a much better way, but countries are very different in culture and how adoptions are handled is also VERY different. OP doesn’t speak English as a native language - we DON’T know what country she is from and we don’t know how culture in that country is. And culture makes a HUGE difference - not everything works the way things work in the US; not every cultural behavior is the same elsewhere as it is in the US nor how these cultural behaviours change. It used to be very common in the US too not to tell adopted kids anything - now it’s common to talk early and a lot about it because studies show that adoptees themselves want and prefer it so, including those who wish they would’ve known. But there are still plenty of countries that are very old school about adoptions and change isnt easy.", "Agree, I was told at 4, and it just became part of the family narrative. For me, the message that my parents deliberately \"picked\" me was, and is, very powerful.", "Well, I mean, my friend's child is 3, and mommy is her world. How exactly does one tell that mommy isn't mommy, real mommy left her to rot in her own diapers and starve?", "Yea tell the adopted person how their take on another adopted person's situation is. The sister in this situation is a ln asshole as well. But acting like a 4 y/o throwing a tantrum and running home is the wrong attitude to have.", "How ya figure, I'm adopted, I can speak on the topic. My ass is grown with a healthy view of my situation.", ">Adoptive parents aren't saints. Many are AHs.  \n\nLet us disagree, they certainly are on Saint hood track when taking an unwanted kid to a safe place. {In the Beginning}", "If she's still acting so childish, she'll be treated like one.", "There are such things as Adults Groundings… they’re just not called that. They’re usually called timeouts, they can be brief or they can last for however long the person continues to act out. When someone acts egregiously, they are not invited until they apologize, fix their behavior, and or act in a civilized manner. The same way as if you were dealing a toddler in a public setting…they either fix their attitude or they go home. The door is still open for communication, but boundaries are set in place.", "Not only that, but to then blame her for taking the limelight from her birthday when THE SISTER HERSELF was the one who shoved the limelight onto OP?! That’s some serious victim blaming if I’ve ever heard it.", "At least op can console herself with the knowledge she’s not actually related to her b#tch of a sister", "As someone who was adopted and who’s biological siblings were adopted by different families, I can assure you that adoptions IS NOT  nearly always a good thing. Adoption is trauma. \n\nThat being said, overall OP was lucky enough to be adopted by loving people and their children (minus one). However, her parents are absolute AH who raised a child who is even more of an AH.", "[removed]", "It's not \"nearly always a good thing\". It's traumatic for a lot of people.", "And for the sister to have weaponized it all their lives and parents not to do anything! Like, wtf is wrong with them??? I don't blame OP for leaving or not knowing how to handle this", "How do you sensationalise somebody?", "The best time to tell a child they’re adopted is … immediately. The earlier, the better. Tell them, & frame it positively: “we *chose* you to be our child. We worked so hard to claim you. We are so lucky to have you.”", "The sister had been throwing it in her face for years though. At some point the parents needed to step in and explain things.", "The best time is as early as possible.   Many parents say they want to wait for the right time and it blows up in their faces as it did here.", "Except, in this case, there was already an older child weaponizing the fact OP was adopted when they fought as children. OP’s parents should have corrected the older kid for that early on and then found a way to speak to OP to let them know they were adopted putting it in a positive light to contrast with the AH behavior of their other child", "I can think of many reasons why it might be a difficult conversation, but not any that means they shouldn't know. Well, some, but they're only in the parents' interest, not the child's.", "It is the right take.  An adoptee has every right to know they were adopted, and, in general, it's best they are told as soon as they can understand teh concepts.\n\nI'm not denying your own experience, us adoptees all have our own reactions and feeling on the matter.  For you, it worked out well.   I was told early, and I was fine with it being that way.\n\nFor many of us, finding out decades later does feel dishonest and hurtful.  \n\nHonestly, bud - glad it all worked out for you.  But, we can't assume what was good for us, is the same for everybody else.", "That's really interesting to know! OPs parents probably raised her with this line of thinking.. but that sister ruined it all :/", "My kids were at the ceremony but too little to know what was going on. For now, I just answer questions as the they come up but at some point I’ll likely need to give them the whole story.", "How do you know what education the parents received when they adopted op?\n\nIt’s wild that you’re so comfortable declaring they are selfish, when you have no clue or context to why they didn’t tell op \n\nIn my family, people would not be told they are adopted, till they were much older. Because adopted kids were seen as “less than” by outsiders in our community so the kids were simply never told, till it was deemed that they could accept it. \n\nIt’s quite gross that you jump to judging these parents who by all accounts made one “major mistake” - they haven’t told their 22 yo she is adopted and have just accepted the child as their bio child instead.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I can't think of ANY reason that would justify lying to your child for 22 years. Yes, there can be very difficult birth stories, but you explain it in child friendly terms once it becomes appropriate. You don't keep a very basic fact hidden.", "There is professional support available for adoptive parents, I really hope your friend is using it. It's not like taking home a new puppy.", "You don't tell them that. Why would you even go there? You know that's not the answer.\n\nYou read them adoption books and discuss it in a positive manner. You tell them how grateful you are that you get to be their mommy. You discuss it in an age appropriate manner.\n\nEdited \"I say this\" as a legal guardian raising a child that isn't mine biologically. I say this as a step-parent adoptee. I say this as a relative of several adopted people. I say this as a person that has an older brother placed for adoption.", "Im all for petty revenge. Op you need to steal the bf and make sure older sis catches in the act.", "Yes!! That was my thinking exactly! She is ridiculous to blame OP when she brought this all out. \n\nAnd why aren’t her parents responding to her? This seems really mean on top of everything else.", "And that unlike sister, she was chosen; parents had no choice with sib.", "She now has an excellent reason to cut her off for good.", "X 1 million.\n\nNTA-your parents should have told you, there's nothing at all wrong with being adopted.\n\nAs for your sister, karma's coming for her. Hope her BF finds out what she had to say about his gifts somehow....", "^^^^^^^^this", "It would be very easy to dither your way into a dead end of inaction in the name of \"waiting for the right time\".", "Silver lining identified!", "Sorry, another adoptee here and many of us *absolutely* do not see it as a ‘generally positive choice’ as it was rarely a ‘choice’ of any kind - would suggest leaving pros/cons about it to those of us affected by it. \n\nBut as to the issue here, the family are all raging AHs, not OP.", "It has become clear that often true, and foster care can also be bad.  What are the alternatives, though - a difficult question.", "Guessing they mean sensitize? As in instill some compassion.", "By having a talk with them, trying to understand why they are being this way. Remember I’m talking about doing this when she was a kid and still forming opinions. If nothing works, they should have taken professional help. Allowing their biological daughter to bully their adoptive daughter is not an acceptable parenting.\n\nEdit: I have been using the word wrong my whole life. 😭", "[deleted]", "\"It’s wild that you’re so comfortable declaring they are selfish, when you have no clue or context to why they didn’t tell op \" no but we can see how they did fick all to stop one of their kids from tormenting the kid they adopted growing up. To the point she repeatedly told her she was adopted growing up in hopes of doing exactly what she did here.", "Yeah, I am adopted.  I don't remember when my parents told me, because they told me so early that I feel like I have always known.  My brothers and I sometimes joke about it in front of other people for shock value.  The fact that we all know has made it a complete non-issue.\n\nIt is really dumb to hide it from kids.  Because they almost always feel betrayed when they find out.", "Maybe she’s the result of a raped family member and they were trying not to embarrass. Maybe they know the mother and don’t want to shame her in front of her friends or family. Adoption is complicated man, and telling someone they are a rape or incest baby is something I would see a lot of cultures not diss us sing within their family. I had a Chinese friend that found out they were adopted under those circumstances because they did a 23andMe and the asked their parents about the results. They also planned on never telling him. So I think there is more localized culture at play here that we understand.", "Nah, I'm just angry because I'm worried about breaking that kid's heart, knowing it is sort of inevitable given all the stories I've seen on reddit. It's been on my mind since my friends started worrying about what to do. There is going to be a crisis of emotion and feeling weird at any age. I think you're right though, incorporate those types of books with normal bed time stories? Maybe explain it better to the older kid who won't suddenly understand that her sister is actually her niece but also her sister", "Wow, this is priceless. That's right. Parents chose OP because they want OP in their life. Sister? They probably wish there was a receipt.", "Probably adopted her after having to deal with that horrible sister. Wanted to end on a better note.", "OP is NTA but technically the biological ones are also a choice because you coulda either aborted or decided to keep the baby and give birth to it and you choose who you have sex with which means choosing the genetics of your biological kids unless there was SA but I didn't see any in the post", "NTA and OP, if your parents love you and gave you their hearts and a home, it may have been a mistake to not tell you for this long but not worth destroying the relationship IMHO.  The sister, on the other hand, if this story isn't made up, sounds like a genuinely despicable, evil human being who you should never be around if you can help it and certainly not speak to.", "I want to mention that in some cultures, it’s not common to tell the adopted child about it.", "I found out that my sister & I were adopted by our mom's 2nd husband when I was about 10.  She remembered our bio-dad, but since I was less than 3 years old the last time we spent time with him, I didn't remember.  If I even remembered the day, I would probably have thought they were just babysitting us.  Mom wouldn't tell us anything about him until we were adults and after adoptive-dad had passed away, but I always felt very loved & well-taken care of, so I never pushed.  I finally met my father when I was about 24 after having established phone contact after my 1st child was born when I was 22.  His family got together and flew him to the city where I lived and we had a nice long weekend together, then he eventually moved there.  We spent a lot of time together for the 5 or so years that he lived there, and again for a couple of years at the end of his life when he moved to live in an assisted living facility in a nearby city.  Sis and I would go pick him up & spend lunch & the afternoon together every 3 weeks or so.  I feel very blessed to have had 2 dads & families that I loved.", "It's pretty obvious that they're talking about it as a choice for the people doing the choosing, aka the parents.", "But OP’s parents haven’t given her their reasons for not telling her.", "See mine was the opposite. I was reminded daily to be grateful somebody wanted me. I was also told what terrible people I came from. It left me with always wondering wtf actually happened. My own son is not emotionally mature enough to handle being abandoned, it doesn't matter he was adopted. The abandonment still hurts. Nor are his bio parents people we can say nice things about. To put it bluntly, there is not a good way to tell anyone that their parents didn't want them. Or are bad people who shouldn't be around kids. On the contrary,  my neighbor found out he was adopted as an adult and he was happy he never noticed the difference between him and his siblings treatment.  And by that point his family was just his family.  It was irrelevant information by that time.", "Not exactly the same but my mom didn’t have the same father as her siblings. She knew that from the time she was young. She always says that knowing that information is probably what majorly prevented her from having an identity crisis. There’s no reason to hide it if it’s not a big deal to you. The parents are acting like they did something wrong by adopting her and I never understand the logic.", "The parents didn't need to provide any specific details beyond a simple, 'you're adopted' until adulthood. And even if it's localized culture, that doesn't make keeping it a secret okay.", "There is always trauma with adoption. Even the \"best\" scenario involves trauma. It's best to always be honest than to wait. It only gets harder. Kids understand this stuff more than we give them credit for. \n\nIncorporating them into regular bedtime stories is a great start.", "Personally, I love the fact that the sister is complaining OP made it about herself when it was in fact the sister who made the day about OP by continuing with the adoption topic, even after literally everyone else told her to drop it.  \n\nThe twit ruined HER OWN BDay, not OP.\n\nNTA, OP.  \n\nAnd just to rub salt in(if you have a petty streak, that is) remind dear sister who it was that brought up the topic and kept it the topic at hand.  LOL!!!  And then maybe go NC with her right after.  He he he.", "Serious question:  But in those cultures, do they tell the rest of the siblings, even though they are this close in age?  I find this part odd.", "Heck, OP could get really petty/nasty and add in the fact that their parents chose her but were obligated to keep sis.\n\nNTA, OP.", "Your parents are the ones that raised you. The sperm donor and woman who gave you away don’t matter any more today than they did when you were adopted.", "So, your sister is a colossal AH.  Selfish, cruel, entirely devoid of empathy.. truly you should be happy you don’t share DNA with her.  No, you are NTA for how you reacted to life altering information being shared with you.  If your sister didn’t want a scene at her birthday she shouldn’t have caused one 🤷‍♀️", "I found out I was adopted (bio mom, adopted dad) when I was 15. Everyone knew except for me. The pain in my Dad’s eyes as he explained the truth to me was something I’ll never forget. I assured him he was always my Father and we moved on… kind of. It always stuck in the back of my mind. My biological father is a real estate tycoon who was my mom’s high school sweetheart. His family pressured him into leaving us and he did as requested. His loss imo.\n\nSorry, this comment wasn’t supposed to be about me. Your sister is a massive AH and you are 1000% NTA here. She likely has deep resentment towards you and the attention you got that she felt should’ve been hers growing up. That’s not your fault. It’s hers. She should be ashamed of herself. Your English is wonderful btw.", "Those in your life are AHs not only for not telling you but for allowing your sibling to treat you poorly for it. She’s a real P.o.s", "Send the whole text she sent you to a family group chat and let them know how you feel. Get your emotions out because your parents don't know or refuse to answer you.\n\nNTA", "You are NTA, your sister is a major one. You reacted in a completely reasonable way. God your sister seems unbearable. Good luck", "NTA.", "Hey fellow adopted kid here.\nYou are NTA, your sister made her day about you by insisting on getting a reaction out of you even after everyone told her to drop it.\n\nComing from someone who had known all their life they are adopted, I can understand why your trust may be broken with your parents and other siblings and I think you have every right to be angry… just don’t let it toil over you and remember they only did what they thought was right, even if it was very wrong.\n\nInstead just be mad at your bitch of a sister for trying to guilt you for something she did to herself.", "NTA but your fam is assholes for not telling you. Your sister is downright cruel for her comment to you though. They shouldve told you a long time ago,but your sister is cruel for her attitude towards adoption and children who are adopted.", "this is day was always meant to come", "NTA Your 2 sisters have behaved terribly. I am astounded that they revealed your adoption in such a terrible manner and then had the hide to send you such an unempathetic text message. If this is a pattern of behaviour, consider going no contact. They are adults now so they definitely know what  they are doing.", "You aren’t the asshole! In all honesty your sister is and your other siblings are too by association I would’ve been smacked the shit out of her or tried to put her in her place. And to be hella fucking petty I would tell her bf to dump her materialistic ass. She literally used that shit your whole life ?? Who tf does that ?? People are weird asf man.", "On top of that her sister claims OP stole her limelight for her bday.  She did that to herself dropping such a bombshell just to get back at OP for making an honest observation.  She showed how silly she is saying she wanted bought flowers instead of her BF taking the time and effort to pick out flowers himself.  Any normal person would find that much more special than just buying $25 pre-arranged flowers.  It's a much more thoughtful gift.  OP's sister just wanted to hurt OP and that was all the ammo she had against her.  Of course that's going to cause a major issue and \"ruin\" her bday.  Very childish.", "Yes yes, the mature thing after finding out you are adopted is to turn it into a joke,roast. Wow 😑", "Agree and disagree. The sister did indeed go full mask off but I really don’t think it will result in LC/NC. The rest of the family will likely have to confront what they already know about the sister. In no way will they blame OP for reacting the way she did. The will blame the AH who insisted on rocking the boat. \n\nIt will take time, but there is a path forward now that the secret can no longer be used as a weapon. OP’s family genuinely loves her.", "the sister is a friggin monster. holy cow. i can't believe people behave this way.", "That depends on whether or not OP was a baby.  If she was a newborn, then maybe the 8 year old would notice that mom's belly didn't grow like it did with the younger siblings, but that could be explained by the truthful (if not situational) statement that sometimes babies grow in a way that it doesn't really show.  We aren't that far away from a time when pregnancy wasn't mentioned at all in polite company in the US.  Kids usually weren't told they were getting a new sibling.  The baby just appeared one day.  I'm sure many kids figured out that mom's belly growing meant a baby was coming, just like the adults understood even when no one talked about it, but some were surprised every time.  It would be easy to add a baby to a household without explaining.  It would be much harder if OP was a young toddler or something though.", "Yep. Some people are just evil malicious fucks that exist to create and multiply misery. \n\nBest to cut all contact with such toxic entities.", "Honestly, I truly hope you're right.  However, being forewarned is being forearmed (pre-armed? not the part of the body, obviously, lol). If the sister backs down at this point, after years of antagonizing OP about it, I'd be pleasantly surprised. \n\nUnfortunately, I've read about and witnessed this situation too many times. It doesn't always end well and anything OP can do to prepare is better than sitting back and letting it happen.", "You’re right. I’m just saying they obviously love OP and the relationship can be saved. Idk about that sister.", "It gets harder to keep it a secret all the time.", "Why would you ever think that's what you would tell a child? Have you never spoken to a child? You're supposed to tell them things on their own level.\n\n\"You see honey, your first mommy was very very sick. She had a sickness inside of her that made it so that she could not take care of you. Sometimes when mommy's and daddies get sick, they are too sick to be able to take good care of their babies. \nAnd I wanted a baby more than anything in the whole wide world. So I decided that I would be your mommy. I will always be your mommy, and I love you more than anything in the whole wide world.\"\n\nThat's a real easy way to explain it, isn't it? \n\nAnd anytime the kid brings it up, you tell them the same thing. I am your mommy, I love you more than anything, you will always be my child.\n\nThis is something that might be helpful. Even though the child is a little bit older, this is something that really helped me as a child and I cherished it a lot as an adopted kid.\n\nWhen I was adopted, the organization that housed me took my photo and gave me a poem. The poem read: not flesh of my flesh, nor bone of my bone. But still miraculously my own. Never forget for a single minute, you did not grow under my heart but in it.\"", "And now she has a great comeback, she can say \"well at least they wanted me\" It's what my friends adopted sister would respond with when she said that they should ship her back where she came from and it shut her right up!", "Unfortunately, my little guy comes from a very sad story of neglect, abuse, and his story is chronically through the news. That is not even the worst past. We are starting therapy with him. The story will be life altering and the little bit he experienced is already showing up now.", "Some cultures are big on not talking about embarrassing situations.", "The kid has been with them since a few weeks old. I think I'll encourage them to look for some professional help. Although it's not my place to decide if 3 is too young. I don't want to have that responsibility on my shoulders goodness", "maybe the parents arent sure about what the OP is going through and giving her space. it is big news to process and maybe they are trying to make sure that OP has all the time that she needs after which she will get in touch with them.", "For infant adoption, the alternatives are providing support nets for moms (including, particularly, healthcare).  I used to follow a group called \"Saving our Sisters\" on Facebook.  They helped moms who were planning on giving up their babies but didn't want to.  It's probably gone up some because of inflation, but they said the average mom they helped only needed $500 and a mentor to call when she needed help.  That was it.\n\nFoster care is a different and much more difficult question.  We need to start by paying for more social workers so they have  small enough caseload to get to know each child and be able to more effectively advocate for them.", "That's a different matter, though as pp said, offering the pregnant person financial support, housing and subsidized day care like in many (most?) European countries would probably be a good start. However, even if there were no alternatives, it's OK to say that adoption is often traumatic and most certainly not \"nearly always a positive thing\".", "You need to look up the word \"sensationalise\". It does not mean what you think it does. \n\n&#x200B;\n\nBut at least you did not kill my father...", "Did ya catch the part where she said her parents aren't responding to her?? Why would they not? Why would they not have snapped on their bio brat and followed her to her room and sat and explained and consoled her??? They made a giant mistake in not telling her... and now they go mute and won't respond to her texts??", "About the parents it is true that IF their hearts were in the right place there would be a point to preserving the relationship. But since they are not not responding to OP's emails I'm taking that as a VERY big IF at this point.", "May be true, but then telling OP that way is still an AH move", "Just what I was thinking!", "But she said she had texted them -- She is reaching out to them but they are not responding. That's what I thought I read.", "I'm in favor of a great safety net, especially when it comes to children.  I really do not understand how so many people can be so unfeeling and downright unpatriotic as to now want to care for our children. (I don't have any of my own.)   We need more social workers or counselors to help people navigate the system - they don't know what's there.\n\nThanks for telling me about the organization, that sounds like a good idea.\n\nETA: corrected to unpatriotic", "I'm all for offering more people more support, even if they aren't pregnant, but it's a tough sale to a lot of people.", "Vizzini didn't kill Inigo's father either.", "Probably they are crying, hugging and try to figure out how to tell OP the truth", "They will notice their mom wasn't pregnant. You know what ''adopted'' means?", "True.  Too true.", "Perfect!!!!!", "NTA. What she did was cruel to you and disrespectful to your parents who deserved to decide whether and when to tell OP that they were adopted. \n\nThe parents also have a lot to answer for. They shouldn't have let any of their older three kids know that their youngest was adopted or - if not possible - ensured they all understood that it was their right to choose when and how to reveal this to OP but then should have done so many years previous, especially as I doubt very much that they weren't aware of OP's sister's teasing about adoption on the past.", "NTA but holy crap your sister is an AH and your parents are just being complacent in her behavior.", "NTA and ur sister sounds toxic AF", "NTA. I am so sorry that you had to experience this in such a horrible manner. Obviously she is a spoiled brat narcissist. And seems to be jealous. And an AH. \n\nHopefully your parents can admonish this person for her actions. And apologise for keeping something so important from you and for the manner in which you found out. \n\nI hope you can work through this, I can’t imagine how you are feeling now but I am here any time you need a chat 💕", "NTA\n\n1st she was complaining about flowers her BF picked for her?  Any normal person would like that much more than bought flower since it takes extra effort and thought.  Then she freaks out like a child with your comment.  Your comment was just an honest observation about her being ungrateful/picky.  Then she just HAD to get back at you the only way she knew how.  \n\nYou had every right to be upset.  You were in shock and needed to step away to process something so huge.  She said you took her spotlight away?  No way.  She did that herself when she brought up the adoption thing to get back at you for small comment.  She was raised in the same family but she thinks you have \"cheap\" taste because you were adopted?  How does that even make sense.  She sounds classist (if that's even a word?) too.   She just wanted to hurt you.  \n\nAbsolutely NTA", "NTA\n\nYour sister is wild .. to put it mildly. I'm certain that behaviour isn't new, so your parents doing nothing against it is kinda AH. \n\nI think the actual AH part is that they don't respond to your texts. Like, if I were in their position I would have scolded the living hell out of your sister and comforted you asap.", "OP,NTA, but everyone else is. Parents still haven’t responded, MAH’s. Sister cut loose. Sorry you had to go through this.", "NTA, but your sister and parents definitely are. There's nothing wrong with being adopted, but you should have been told as soon as you were old enough to understand. My mom was adopted, and her parents told her from the start that she was, but that it simply meant that they were able to choose her and how much they love her. She has no issues about being adopted because her parents were open about it from the start.", "This behaviour disgusts me. As an adoptive mother, I can't imagine hiding my daughter's biological culture/heritage/birth story etc from her. I also can't imagine how evil, hateful and vindictive a sibling would have to be to share such life changing information like this... catastrophic is an understatement. OP, NTA by a long shot. You have dome incredibly difficult decisions to make, questions to ask and I'm profoundly sorry this is how you found out. Adoption is complex... it can be beautiful, sad, complicated, heartbreaking, necessary and wonderful among so many other things... I'm so very sorry. Sending love and strength your way.", "NTA but your sis and your parents are.  I knew I was adopted by the time I was seven. There is no reason why, at 22, your parents have not yet told you. I hope you find out the truth behind this situation, and your parent don’t lie to you about it. Fingers crossed, but remember there is no shame in being adopted. It’s most likely one of the best things that could have happened to you.", "As an adopted person who has known my whole life that I was adopted, this is in no way your fault. NTA.\n\nYour sister sounds like a real bitch who wants everything to be about her. Pardon my language.\n\nYour parents should never have kept this a secret from you, but that choice is one that many parents face and there's not really a right way to handle it. I've got all sorts of traumas from growing up knowing I'm adopted, there's even more that come from just the fact that I was adopted, whether I knew it or not.\n\nTake the time to heal. Don't talk to your sister anymore, or at least limit contact. She's habitually shown how she feels about the situation, throwing it in your face while you grew up is not healthy. Talk to your folks about it. They are the only ones who know why they chose to adopt you, and they may know a part of why you were given up for adoption.\n\nI hope you find healing.", "NTA.\n\nStorming off and taking some time to absorb the information is a pretty normal and logical response.", "NTA- sweetie you did nothing wrong. You were upset and you left. Your sister is the one that brought it up to begin with. Your sister seems like a complete AH. Your parents may be upset themselves and unsure of what to say at this point. Make sure when you talk to them that you explain that what hurts is the lie not the adopted part.", "your sister is fucking repulsive. holy sh\\*t.\n\nstay tf away from her. \n\nyour parents are both a.h.s for not responding to your texts. there's no excuse for their disgusting behaviour either.\n\nNTA.", "NTA. Your sister is an asshole. Your parents and the rest of your fam are AHs too. I would take some time to process the news, but I would cut off your sister who seems like she never wanted you in your life in the first place.", "Your sister is the AH not you", "First, NTA  \nI'm adopted, so is my brother (we're not biological sibs, just, y'know, sibs  ) . He and I always knew we were adopted- chosen- for our whole childhoods.  \nWe had other family friends growing up, 2 different families who also had adopted kids but never told them they were adopted. It blew up on both families...I just don't know how that being kept secret can be a good thing. It's always going to come out, and trying to rebuild trust after that is hard work.  \nPeople do dumb stuff for what they think are good reasons. \\*shrug\\*\n\nOn the other hand, your sister is a psycho b\\*tch.  \"Me me me MEEEEEE he didn't get me this/that/other thing wahhhhhhhh\"  \nThen she gleefully throws what she KNOWS is going to be a major bomb, messy and destructive and hurtful.  And wonders what happened.  \n\"Wait, it's MY BIRTHDAY why are you paying attention to Her-Whom-I-Just-Bombed!  Sister Bombee, why you gotta make it all about you? WAHHHHHH!!\"  \n\n\nI'm sorry your parents haven't responded. I suspect they have no idea where to start. Not an excuse, just...people.  \n\n\n\" That's right. Parents chose OP because they want OP in their life. Sister? They probably wish there was a receipt.\"  \nThat thing someone said about choosing you to end on a high note?  That.", "OP I am so, so sorry. This never should have been hidden, and you are completely justified in anything you are feeling. You are allowed to feel anything you need to, right now. And you are allowed to take all the time in the world to sit with these feelings and analyze them and be hurt and angry and question anything. Reach out to some Reddit communities with adult adoptees, find a good therapist and know that you are a million times NTA.", "NTA. Your sister seems pissed off but who knows why and who cares when she acts like that - in the meantime, talk to your parents and try to understand that they were likely terrified to tell you, fear is powerful and sadly can lead to a lot of hurt. \n\nGood luck with everything and I hope you and your family can heal well from this, hopefully with a quieter and less petulant presence from your jealous sibling.", "OP you are NTA and I encourage you to use the search term \"late discovery adoptee\" to find resources / information / support for yourself going forward. There are websites and support groups specifically for folks like you. I am an adoptee and have always known, yet even so I have found a lot of support and help from adoptee support groups online. Being adopted can be a traumatic experience, especially for late discovery adoptees. My best wishes for you going forward and I'd suggest taking a long break from your interacting with your sister. You didn't ruin her birthday, she did.", "NTA she’s complaining that you made the situation about yourself even though she’s the one that brought this up. how dense can a person be. she sounds exhausting to be around", "NTA.  The entire clan is SICK.  Your sister purposely inflicted emotional distress and the \"parents\" were fine with it. Get in therapy and sue your \"parents\" to pay for it.", "NTA  \nYour sister is an abuser but dont worry, these people always get what they deserve.  \nYour parents are idiots, dont seem to be malicious though but you deserve more.", "I honestly don't know who are the bigger AHs here, the sister or parents.", "None of the other siblings have contacted you either? YNTAH", "Your sister sucks.\n\nNTA", "NTA and your sister is the one who exploded and made it about you. \n\nyour sister is the one who made the fuss. and your sister is the one you need to tell to f' off.\n\ntalk to your parents and ask why they never told you.", "NTA - and on the bright side, at least she now knows she’s not actually related to the AH of a sister", "The 25 yr. old sister is old enough to tell her to Get OUT & never come back.", "NTA.", "NTA - You had every right to react however you want to such sudden news that was told to you in such a horrible way and means that your family lied to you for so many years.  You are absolutely entitled to be hurt and I would truly suggest counseling to help you process this situation.  Many years ago it was considered the “right thing to do” to lie about adoption to “protect the child”, but most experts understand that honesty is way better for the child than the possibility of a sudden betrayal as you have experienced.  \nMy heart goes out to you and I wish you love and peace.", "YTA\n\nStop writing fiction posts.", "YTA.  Not for storming off because that witch of a sister deserved it, but your parents didn't tell you because in their eyes, you are their child. They may not respond to texts about something  this big.  Maybe they didn't want you to feel less than their other kids.  Now that you know, what will you do with this information? Will you track down the donor sperm and egg incubator?  That may have been their other fear, the fear of losing you.  You storming off pretty much confirms their fear.", "They're also AHs for not stopping sisters disgusting behaviour. That is gross", "“Decent loving people” don’t react to this crisis by not answering OP’s texts after this happened.", "I’d say, rather, that both the sister and parents are AHs.", "Same, I'm adopted and always knew - if anything it made me feel more secure with my spot in the family, cuz they didn't act like it was some shameful thing to hide lol", "PLOT TWIST: Sister’s bf leaves her for OP.", "If OP is texting them and they aren’t responding, they realize she doesn’t “need space.”", "Facts.\nThis is…\nBeyond AH.\nThe sister is very evil for that. \n\nPrayers for you OP.\nNothing is your fault.", "I’m a parent through adoption of a 17 year old and we followed the advice we were given and our daughter has always known her story.  My mother was adopted in the 1940’s and her parents were told to never tell her or if they did, to say her parents were killed in a car crash.  They didn’t follow either suggestion and she new most over life, fortunately.  Things have come along way!", "Exactly. I didn't grow up thinking it was weird. Just different. My family is my family, regardless of shared DNA or not. My family would have never been able to hide it though. My parents didn't think they could have kids after years of trying, but one day my dad got the phone call from my mom \"we have been approved for adoption, we pick him up in 30 days........AND I'm pregnant\". Plus, I'm like 30% filipino (just found this out after a dna test) and my parents are 100% Minnesotan Scandinavian. Lying to me would have never worked.", "Yiiiikes, shitty take.  You should probably listen to adoptees about this before you put your foot any further down your gullet.  \n\nWhy would you even say that?", "I am older than OP, and my parents always told me I was getting a new sibling when my mom was pregnant. I even remember one of my mom's miscarriages. OP is 22, she was born in the early 2000s, parents then absolutely told their children if they were pregnant. They did not just come home with a baby one day. So it doesn't matter if OP was a newborn or a toddler. \n\nThe older siblings knew because they were old enough to remember OP joining the family, and were old enough to see their mom had not been pregnant. \n\nOP should talk to her parents. She needs to understand the circumstances of why she was not told. \n\nBut I do not think it is fair to paint it as her siblings were maliciously in on a secret she was not. They were just older then her and remember her joining the family. That's not malicious, that's just factual and life. \n\nThe 25f sister, she is an AH. She clearly holds resentment towards OP, which should have been handled 2 decades ago. She was the baby of the family before OP, and she clearly has not gotten over that. That does not justify her actions, she just needs therapy.\n\nEDIT: typos", "A kid is only a step-kid if they're not adopted by their step-parent, if they are adopted by their step-parent in full, they belong adopted children and the now parent gets full rights over them, more so even than their biological parent in some cases.", "Even the worst situations can still have a silver lining. I had a college friend who found out in his adulthood that he was an affair baby, and his gut reaction was happiness at the fact that he wasn't related to one cousin on his dad's side of the family that he despised.", "Absolutely!! Hope the rest of the family makes sure to tell her nasty AH sister that.", "Op's parents CHOSE her. They were stuck with big sister.", "I wasn't trying to say that it was common not to tell children about pregnancy in this generation.  I was just saying that it's not all that long ago that it was that way and many kids never connected the dots about Mom's belly and babies.  It might have been weird for the older siblings to not have been told in advance, but the middle 2 probably would not have noticed or connected that mom wasn't pregnant at 3 and 6.  The 8 year old might have, but that could have been explained away.  The alternative, expecting young children to keep a big, important secret from their new sibling, was the worse option than pretending to the kids that the newborn just came home from the hospital and the parents just kept this baby a secret.  The best option would have been just telling OP too, but if that wasn't the best choice for their family/culture than lying to their other children was the only other reasonable option.  In either case, the parents should have handled the bullying a long time ago.", "Social classification: step-kid\n\nLegal classification: adopted child\n\nI've known a fair amount of adopted step-kids in my time and they still refer to their adoptive parent as step-dad/step-mom because it's what people understand, especially if the step-parent looks nothing like the kid.", "Should I be speaking to my friend about this? Recommending having therapists involved, or to have straight through out answers for when the day comes? They keep saying that God will handle it. And I admittedly (as you can tell) am a bit heavily emotional about this situation. I feel like no matter what this child is going to feel abandoned and \"different\" somewhere along the line. \n\nDo they ever tell her the truth? When she wants to meet her mom, do they tell her why they took her away?", "Yeah I know. I was evil. I'm just angry", "Yeah, a good line is \"My parents CHOSE me. They got STUCK with you!\"", "They might do that because the adoption isn't 100% their choice, every step child I knew that was actually formally adopted called their parents mom or dad, and their parents would just call them daughter or son.\n\nEither way, with the exception of step kids being adopted against their will, for every real important purpose, an adopted child is an adopted child. They aren't automatically downgraded just because they have one biological parent that still cares about them.", "Since the parents aren’t responding to OP’s texts, I’d say they’re nearly as much AHs as un-dear sister.", "A similar line that works for all biokids is:\n\n\"mom/dad were not happy with how the first/oldest turned out so they kept trying until youngest sibling was just right.\"\n\nSource: I am the oldest and say that about my siblings.", "I'm using this one with my brother.", "So the thing could be: “you were not enough for them, so they chose me” I am petty I know", "Saving out sisters sounds like a loving choice for women that want to parent, but are just poor.\n\nMany don't want to parent. With (effectively) abortion bans in many US states, adoption is a far kinder choice than forcing a reluctant parent to parent\n   \nNothing good comes from forcing unwilling people into parenting", "Not to mention she ruined it by being an ungrateful brat about the flowers…", "They're all older than her, it doesn't matter what you do or don't tell them. They have eyes.", "While that's true, more woman than not do want to parent.  They are often just broken down by a system that pushes them to think they aren't good enough to parent.  Adoption is sometimes a good thing.  It just isn't \"nearly always a good thing\" which is the statement from which my comment followed.  (As a note, many argue that option is never a good thing.  They argue that children should be placed in kinship care whenever possible and then with a willing permanent guardian when no safe family members are available, but that permanent guardianship is different than adoption.)", "It's probably never going to happen in the US. It's just insane to me (as someone from a Northern European country) that the solution to poverty is to give your baby away.", "They should, at this point, stop making anything about them and their feelings....they lied for over 20 years and allowed their Satan's Spawn of a daughter to hurt her like that.", "I agree.  People keep acting like this is a bizarre, experimental idea, when it's common in so much of Europe.", "This seems a bit unsafe, right? If the biological family has a history of hereditary ailments, I’d want to know about them instead of being misled by my adopted family’s history"]}