{"id": 2753, "submission_id": "yzlh7q", "title": "AITA for deliberately scaring a lady who was stalking us?", "selftext": "Two days ago, I(25M) went grocery shopping with my friend Will (25M) in which we got more than we bargained for. While we can get a majority of our groceries easily that is not the case for alcohol. We both are very picky when it comes to it and only really drink certain brands. Unfortunately, these brands are not available locally and must be purchased in another province an hour away. To save gas and money we will both tend to bulk buy what we like.  I typically buy 48 cans of Alcopop while Will does the same with beer.  \n\n&#x200B;\n\nThis trip was a bit different as Will rode with me and my girlfriend wanted me to grab some things for her. This was no issue and while in the store we decided to consolidate everything in one cart. While we were in the cooler section grabbing our stuff we were approached by an older woman.  From the start, she was questioning us and upon seeing that she didn’t work for the store I told her to mind her own business.  She didn’t like this and left in a mini huff however afterwards, we noticed that the lady would repeatedly stare and was following us around.\n\n&#x200B;\n\nAfter being carded and paying for our stuff the lady kept following us even while we were driving. Before leaving the town, we decided to stop at McDonald’s for lunch in which we saw the lady pull off and go to other side of the parking lot. While we were eating, she came back, and I caught her trying to get into my truck and taking pictures of it. This is when we had enough and decided to confront her in the hopes of settling things once and for all. When we got outside, I told Will I would take care of her and did so using my skills as a former Warrant Officer under the cadet youth program. \n\n&#x200B;\n\nHaving previously led drill exercises and parades I used the same tone/volume to shout “Ma’am, what are you doing to my truck?!”. This scared the sh\\*t out of her and she dropped her phone. The moment she turned on us and tried to do the same as she did in the store but I had none of it.  She then tried to go off about her phone. While using still using the parade voice/volume I gave her two options: Either leave us alone or sit her a\\*\\* down and wait for the cops as I am done dealing with her.  She ultimately chose the first option while cussing us out as she left.   On the way back Will and I got into a mini-debate on how I handled the woman. He thinks I am an asshole for how I handled the woman as I could have talked to her normally or could have called the police.\n\nAm I an asshole for how I dealt with her?", "created_utc": 1668890259, "permalink": "/r/AmItheAsshole/comments/yzlh7q/aita_for_deliberately_scaring_a_lady_who_was/", "score": 261, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > After having had enough of a woman's stalking, I used my parade skills from the cadet program to scare her. As a result, she dropped and presumably damaged her phone.\n\nI may be an asshole as I could have just documented her actions, called the police or have confronted her in a better way.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n> I could have talked to her normally\n\nYOU DID.", "NTA- not even in the slightest, she was warned to leave you alone.", "NTA\n\nThat is how you deal with people like that. Give them a dose of reality before they do this to the wrong person and get much worse.", "NTA. She was being a really creepy stalker, and had no business doing what she was doing. So you handled it well.", "NTA\n\nDid she tell you what her problem was? What exactly did she think she was documenting? What questions was she asking? Like... I'm so confused.", "NTA - I need a buddy like you who deals with people like this for me", "NTA. What kind of lunatic follows someone out of a store? Then follows you into a McDonald's?  A whacko lunatic. I'm sorry that happened to you. I believe you handled it well.", "What did she actually want?", "NTA..she shouldn't have been acting the way she was.", "NTA, but I'm so curious as to what she was asking, what her excuses were.", "NTA. You did talk to her normally the first time.", "NTA. What was her problem? She doesn’t sound stable mentally. She deserved what she got for being so intrusive so definitely NTA.", "NTA, the audacity of that woman, Jesus christ", "NTA, you should have ran over her phone this would have taught her an expensive lesson not to follow people and try to break into their vehicle. \nNot even sure what the issue is as there is no law in how much alcohol people can buy.", "Wow, being a warrant officer in the cadet youth program sounds bad ass.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nTwo days ago, I(25M) went grocery shopping with my friend Will (25M) in which we got more than we bargained for. While we can get a majority of our groceries easily that is not the case for alcohol. We both are very picky when it comes to it and only really drink certain brands. Unfortunately, these brands are not available locally and must be purchased in another province an hour away. To save gas and money we will both tend to bulk buy what we like.  I typically buy 48 cans of Alcopop while Will does the same with beer.  \n\n&#x200B;\n\nThis trip was a bit different as Will rode with me and my girlfriend wanted me to grab some things for her. This was no issue and while in the store we decided to consolidate everything in one cart. While we were in the cooler section grabbing our stuff we were approached by an older woman.  From the start, she was questioning us and upon seeing that she didn’t work for the store I told her to mind her own business.  She didn’t like this and left in a mini huff however afterwards, we noticed that the lady would repeatedly stare and was following us around.\n\n&#x200B;\n\nAfter being carded and paying for our stuff the lady kept following us even while we were driving. Before leaving the town, we decided to stop at McDonald’s for lunch in which we saw the lady pull off and go to other side of the parking lot. While we were eating, she came back, and I caught her trying to get into my truck and taking pictures of it. This is when we had enough and decided to confront her in the hopes of settling things once and for all. When we got outside, I told Will I would take care of her and did so using my skills as a former Warrant Officer under the cadet youth program. \n\n&#x200B;\n\nHaving previously led drill exercises and parades I used the same tone/volume to shout “Ma’am, what are you doing to my truck?!”. This scared the sh\\*t out of her and she dropped her phone. The moment she turned on us and tried to do the same as she did in the store but I had none of it.  She then tried to go off about her phone. While using still using the parade voice/volume I gave her two options: Either leave us alone or sit her a\\*\\* down and wait for the cops as I am done dealing with her.  She ultimately chose the first option while cussing us out as she left.   On the way back Will and I got into a mini-debate on how I handled the woman. He thinks I am an asshole for how I handled the woman as I could have talked to her normally or could have called the police.\n\nAm I an asshole for how I dealt with her?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, how fucking creepy!", "NTA. You were doing nothing wrong. She was stalking you.", "Nta direct confrontation can be the best route", "NTA that's creepy af", "NTA", "NTA.... Who knows how many people she has terrified.  She deserves it.", "NTA. Act like a psycho, get treated like a psycho.", "In the store she started demanding our ages and to see our IDs . When we said no to her she went off about how we shouldn't be buying that much.   At the McDonald's it was the same thing but with the addition of being accused of using fake IDs.", "There was a post from someone a couple of days ago that had a \"hire a hardass\" side business. They negotiated sales agreements, etc. It sounded wonderful.", "From what I read, she thought they were minors buying alcohol, even after they showed her their IDs. She thought they were fake lol.", "Dude, that lady clearly is having some issues. Speaking normally wasn’t effective, and it never would have been.", "... that's so weird.", "fake id's to buy McDonalds food?", "Filet-o-Fish, 21 years and older!", "probably to buy alcohol, but it was only brought up later at McDs", "[removed]", "NTA. You were awesome", "NTA. \n\nbut like, WTF was her problem?", "NTA.  You did a great job of getting rid of the stalker.", "It is strange that none of you wandered why that woman followed you.", "NTA. I think you’ve dealt greatly with this situation. You didn’t do anything disrespectful towards her, just established your boundaries in a firm way and it worked.", "NTA\n\n...I don't get what she was suspicious of, and whatever it was, why she didn't just call the cops?\nBut your response was fine.", "Had a friend who would have referred to that as \"trauma training\".\n\nGood on you.", "ESH", "I do this at work. I work in a professional environment, so calling someone a complete moron is no-go. The dumber they get, the more polite I get. Think sir or ma'am said in a sharp but not loud tone, along with formal language. It very clearly get point across. They'd look insane if they complained that someone was being too polite and courteous.  Which is the point. \n\nMy boss is well aware of it, and seems to appreciate me not swearing or screaming at people even if they are morons. The majority of time, it's for vendors, not employees of our company.\n\nProblem is, my coworkers start laughing like drunk hyenas because they know I'm on the phone with a moron.", "Well I did tell some kids yesterday at the library that it was bad form to repeatedly swear, loudly, in a public place.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Ah, the customer service voice, I know thee well.", "I saw that one! That lady is a genius", "I'd really like to ask that lady why she cared that much.", "Yeaaa. Normal talk definitely wouldn’t have worked. Parade talk clearly did though.", "Damn, I knew Mcdonalds was full of shit with the freshness claims but 21 years old?", "Tee Hee Tee Heeeeeee yuk yuk yukk"]}