{"id": 27548, "submission_id": "16qytva", "title": "AITA for laughing at my gf's pyjamas?", "selftext": "Throwaway for obvious reasons\n\n&#x200B;\n\nI have a girlfriend. We are both in our early twenties. We have been together for a few weeks. Recently when I was over at her house I was supposed to spend the night (first time we've had a sleepover) and when it was time to change into sleepwear I couldn't help but to laugh at her outfit. Like it was a full on Scrooge type outfit with a night shirt and a night cap. She called it \"grandpa core\" and became defensive when I told her she looked super silly. Like she really looked like she was a cartoon character. \n\nNeedless to say it was awkward after that and when I went home in the morning my mom asked me how she was and how our evening was and I told her about the pajamas and both mom, dad and my little brother said I was mean to laugh, and my brother told me that I am weak for being so offended over \"scrooge-core gf\" (i told him about the granpa core comment) and my mom said that I should apologise to her but that is only really because she finds my gf super sweet.\n\nBut fr, am I the asshole for laughing at someone who looks like an old man to bed? ", "created_utc": 1695565033, "permalink": "/r/AmItheAsshole/comments/16qytva/aita_for_laughing_at_my_gfs_pyjamas/", "score": 233, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I laughed at her and my family are telling me that it was mean and perhaps it was, but I also think it is natural to laugh at that\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Involuntary laugh of surprise?  Not an AH.\n\nTelling her it looked silly? Giant AH.\n\nTelling your family about it?  For real dude?\n\n***YTA***\n\nAlso, good luck ever getting sex.", "Initial snicker? Fine.  If you'd said \"That's a good name for it\" when she called it \"grandpa core\" and left it, fine.\n\nTelling her she looks silly? I guess you don't want the relationship to last, do you?\n\nTelling your family about it?  Holy shit, not cool. Some things are *not* their business, and this is one of them.", "YTA - if you were trying to laugh at her and shame her out of wearing her PJs. Jammies are comfy time outfits. Beauty is secondary during jammie time! Sometimes the most silly old man PJs might be the most snuggly and relaxing to wear. Don't hate on the jammies man. Embrace the comfort and consider trying your own comfy wear to hang with your GF", "Yep. Yta.\n\nKnow what those pretty, frilly, lacy, nice lookin' \"sexy\" jammies really are? Acidic piles of ant-bite inducing discomfort wrapped up in chenille. Your gf was comfy, who cares what it looks like? Especially considering the goal in most relationships is to get the jammies off as quickly as possible. Somehow I don't think this is going to be achievable for you for awhile...", "Yes yta and obtuse", "Some things look off to me:\n\n- you call spending the night with your new partner a \"sleepover\"\n\n- you change into sleepwear before going to bed\n\n- after the sleepover is over you head home to mom & dad and tell them all about your adventures\n\nAre you sure you're not 10 years younger?", "YTA. People wear what they feel comfortable to bed. I’m pretty sure you have your own strange quirks people will find hilarious.", "YTA. She should be allowed to wear what she wants ALL the time without being insulted by her partner.", "Yta, and must not like getting laid.", "Yta for laughing at her reaction with your family once you saw it upset her", "YTA, let people be comfy damn", "YTA.\n\nLaughing with your family about your girlfriend's sleepwear is a fast track to being an ex.", "YTA. Laughing a little when you first see it is fine, but why double down and be a dick about it when you could have said, \"That's so cute\"?", "YTA. You've only been together a couple weeks and you think she looks silly and not cute?  The things that make her HER aren't endearing to you?\n\nNone of what you said is that awful if you had meant it affectionately, but you were making fun of her in her own house after she agreed to sleep in a bed with you for the first time.  This was a key moment in your relationship and learning about the other person, a moment of vulnerability and developing trust.\n\nThis relationship is not the one for either of you. She made herself vulnerable and you mocked her so she's probably done, and should be done.  And you are either unnecessarily critical and need to work on that before dating anyone, or you're just not that into her.  If you think you really are into her, you've got some impulses and ways of connecting to work on, urgently.  \n\nI would not have a casual encounter with someone who mocked something about me right as we were about to engage, let alone be in a relationship with someone.  \n\nI'm wondering your age and hoping it's 18 and not 23.", "“I have a girlfriend” No you DON’T nice try larper", "You're in your early twenties, but still so judgmental of your partner's pajamas?  Like, everyone has quirks that society at large might not deem to be \"cool,\" but if you can't accept those kinds of things about your partner without mocking them to their face, you aren't mature enough for any romantic relationship with anyone.  Is it quirky or strange?  Sure.  It is harmful to her or anyone else?  Not at all.  Does it make her happy?  Seems like it does.  So why is this so hard for you to support?  You told your family in hopes they would join you in mocking her, and even your brother called you out for your crappy attitude.  YTA.  \n\n\nAlso:  prepare to never get laid again when you mock your partner in the comfort of their own home.", "YTA- The only way to fix this is a matching grandpa-core jammie outfit.", ">> my mom said that I should apologise to her but that is only really because she finds my gf super sweet.\n\nThis sentence says so, *so* much about how little you actually care for your GF. Hint: It’s ok to be single if you don’t even like your partner. She probably deserves better anyway. YTA.", "Yes.", "Odd. I am sure I saw this on an episode of How I Met Your Mother.", "YTA\n\nAn involuntary chuckle is okay.... but you lowkey insulted her *and* told your family about it. Your whole family is right, you screwed up.", "Surprised she let you stay for the \"sleepover\". And telling your family ? YTA.", "YTA", "YTA. As a general rule if you’re making fun of your significant other you’re the AH.", "FFS, I’d probably laugh out of surprise if my gf wore her Scrooge cosplay to bed, but I definitely wouldn’t mock her to her face or tell my family with the intention of mocking her behind her back. YTA.", "Listen, I might have laughed as well if she had on one of those long sleeping caps. Night shirts are no big deal and worn by many. Once I found out they were serious I would have inwardly chuckled and told myself it was endearing and not made a fool of them so yta for making a fool of her", "YTA why tell your family about it after. Let the poor girl wear what she finds comfy", "YTA.  Should have kept it to yourself. Maybe she was trying to do a sexy Scrooge like how some girls can pull off a sexy (Mrs) Santa.", "I’m gonna go against the grain here and say NAH. You had a little laugh about the state of the PJ’s but it’s not that big a deal for her to be getting wildly defensive over it.", "NTA She knew she looked daft. And if she didn’t, she does now…", "Nah y’all are wild NAH. She called it “Grandpa core” she knows it’s silly and if I was you I wouldn’t said the same thing with something like “damn you a gilf” assuming she was either pulling a prank on me or that even if she was serious she still knows it’s funny. I think you should apologize bc you clearly upset her but you’re not an asshole", "Your mom asked you how she was?? Ew.", "YTA. Call it a lesson learned. Don't laugh at your girl's fashion choices. She'll return the favor by not comparing your abs to <name of her celeb crush>.", "YTA she is wearing a nightgown that is pretty common. The hat is weird as hell", "YTA.  At least it's only been a few weeks.  She has no real investment in you and both of you can go your separate ways.", "YTA\n\nBuddy she is your girlfriend in my opinion you have to respect her life choices and even clothes.", "YTA - You should have never said anything about the pj's to her. If she asked why you were laughing, you could have played it off any number of ways. But to sit in her house, in her room, and make fun of her sleepwear is really just rude and unnecessary. That was a big asshole move over sleepwear that isn't as uncommon or ridiculous as you think.\n\nYou should be thanking your lucky stars to even be in her bedroom. \n\nJust what were you expecting her to wear anyway? I thought we were past this idea that women had to truss themselves up like chickens for their partners in itchy and ill fitting outfits that are more ridiculous than anything you were laughing at.\n\nGrow up. Your family was right. You should apologize to your girlfriend.", "NTA sharp as a bowling ball though.", "You really typed this out, hit post and still don't see how you're the shitass? Jesus christ.\n\nYes, YTA.\n\nIt costs literally zero dollars to not make fun of your *partner*, the person you supposedly care for. Why is her comfort clothing something you feel comfortable actively ridiculing?", "Man this is just plain disrespect. I get laughing at something cause it uncommon or unconventional. But then you apologize and show some decency. To laugh and then mock her for it and then laugh ab it too your parents is juvenile. YTA", "Wow not only did you keep laughing and call her silly you also decided you needed to tell your family how silly you thought she looked.   \nYTA  \nGood luck making it up to her, but I doubt she will stick around since your other comments makes it clear you arent mature enough for a relationship", "YTA Honestly if my partner and or friends would wear it i would be amused and call it cute. I feel like with your whole tone of the post is that your comment on how silly it looks was not lighthearted but meant in quite a mean way which is unnecessary judgemental. Let her enjoy grandpa core, it's adorable! Sorry she has awful taste in guys but not in clothes. Looking like a cartoon character is awesome. Your family is right, you are weak if you can't let your girl have fun and be a bit different. Good job at making her feel self-conscious .-.", "Yta\n\nHeads up for future relationships (cause lets be real this one isnt going to last) dont bring bullying into your relationship, laughing at your partner and making them insecure is always going to make you the asshole", "You're not mature enough to be in a relationship. YTA", "imo nta shes too sensitive", "NTA for laughing, but def YTA for telling her she looked silly. A word to the wise: telling someone they look silly in their pajamas is the most unlikely path to sex, if that matters to you.", "YTA for making fun of your GF.\n\nBut seriously, wrf is up with your family where you tell your mom all about your \"sleepover\" at your girlfriend's house?  Did she ask how many times you fucked while she was at it?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nThrowaway for obvious reasons\n\n&#x200B;\n\nI have a girlfriend. We are both in our early twenties. We have been together for a few weeks. Recently when I was over at her house I was supposed to spend the night (first time we've had a sleepover) and when it was time to change into sleepwear I couldn't help but to laugh at her outfit. Like it was a full on Scrooge type outfit with a night shirt and a night cap. She called it \"grandpa core\" and became defensive when I told her she looked super silly. Like she really looked like she was a cartoon character. \n\nNeedless to say it was awkward after that and when I went home in the morning my mom asked me how she was and how our evening was and I told her about the pajamas and both mom, dad and my little brother said I was mean to laugh, and my brother told me that I am weak for being so offended over \"scrooge-core gf\" (i told him about the granpa core comment) and my mom said that I should apologise to her but that is only really because she finds my gf super sweet.\n\nBut fr, am I the asshole for laughing at someone who looks like an old man to bed? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA - maybe \n\nIf this had happened to my husband and I even back when we started dating I would've laughed too. However, the biggest question isn't what you said but HOW you said it. The way I picture it in my head, you guys will get past this and laugh about it after some time.", "YTA and I think she's probably going to solve the problem of you EVER seeing her pajamas again for you very soon.", "Lmao", "NTA but for the sake of not being single she seems to find this very upsetting so be more understanding and sit down and apologise to her. Tell her you think she is amazing and looks beautiful no matter what she wears.", "I 100% do not understand this comment thread.\n\nWho wants sex with [this](https://images.app.goo.gl/s7upsL26SuxaoNB97) — like, ever?", "honestly perhaps I should embrace the Scrooge core when you are framing it like that", "Grey sweatpants>frilly lace pjs everyday.", "tbf I dont even like the frilly look, if she was wearing a tee and sweatpants I wouldn't have laughed. It was just the Scrooge flannel look that was so shocking to me that I thought I was being pranked.", ">you change into sleepwear before going to bed\n\nTotally random question sorry, but what is wrong with that one? Do you wear the same clothes you wore during the day to sleep?", "Ooh really?\n\nEDIT: this one?  https://youtu.be/Jmg4xveJoUs?si=C8VBIRM2xpyA7xax", "not in that way lol, more if she was doing good and if she was well and what she's been up to in the week", "You wouldn’t want to have sex with someone who sleeps comfortably? Weird", "10/10 would bang", "Presumably you because you’re dating her", "Well, there are 8 billion+ people in the world so, presumably, lots of people back in the day had a lot of sex. So.", "sleepwear is traditionally for sleeping, not sex", "Amazingly when that was the norm, it was also normal to have 5-10+ kids. So I think it’s safe to say that plenty of men wanted sex with that like all the time.", "Next time bring flowers and a matching set of Scrooge Jammie’s and apologize for how you acted. Lesson learned, you seem young. It will all be okay.", "Scroogewear isn't even how your grandparents dressed for bed. It's how your grandparents' grandparents dress for bed.\n\nWhat kind of reaction did she expect? \n\nThere's no playbook for this. Nothing is out of bounds. Not even laughter.\n\nNTA", "\"shocking\" \"pranked\"\n\nAre you 12", "You’re still an asshole", "I fail to see why this was such a shocking choice of sleepwear. Most people wear this in some form, albeit minus the nightcap. \n\nWhat did you expect her to wear?\n\nAre you one of those guys that still thinks that girls have sexy pillow fights at slumber parties too?", "I don't get the downvotes. I know exactly what you're talking about and it's contrived and pretentious.\n\nIt's no harm no foul if the flannel nightcap doesn't turn you on. It would be more alarming if you did find \"grandpa core\" arousing!\n\nShe needs a guy who's into steampunk/time travel/cosplay or whatever. If that's not you, it's fair to say so.", "No, surely not, but we're talking about a new love in high-hormonal ages, at that time there were no clothes to be seen anywhere near the bed.", "Why are you getting downvoted for responding💀💀 Reddit is a joke", "I can only assume they haven't had many relationships if the idea of comfy clothes is that repulsive. He'd be horrified to see my \"not leaving the house wanna be comfy\" clothes.", "Wut 😂", "Yeah. I mean there was no TV back then or even electricity. Leisure time options were pretty limited.\n\nThis girl has to compete with TikTok! Which is probably where she got the idea in the first place, let's be real.)￼", "Telling your parents about it and inviting them to laugh at your GF is way out of bounds.  We know this because his entire family thought it was out of bounds.", "He did call it a sleepover", "Regarding the nightcap, was this actually just a bonnet to protect her hair during the night?", "It’s sleepwear my guy. You’re making a mountain out of a molehill.", "She's trying to SLEEP, not turn him on\n Get over yourself", "I thought you were the OP, sorry\n\nI’m saying that he’s going for “sleepovers” (cringe) with his girlfriend, and presumably wants to be engaging in sexy time during said “sleepovers”, but his actions during said “sleepovers” are definitely not the way to obtain said sexy time", "How do you figure? This sleepwear was very common in black and white TV shows that were depicting the popular styles… even in some color TV shows.", "Then went home to tell his mom and dad about how it went ...", "well tbh that is literally what it is... he's sleeping over, it's a sleepover.", "His actions are the turn off? *His*?\n\nDid you click the link?", "Uhhh, yes. If he doesn’t want to look at the grandpa pajamas, initiate sex and remove them. Laughing at his girlfriend’s clothing in her own house is a sure fire way to lose that ability to remove said pajamas", "Please. Looking at my partner and seeing my grandpa would shut the option of sex right down with a quickness.\n\nDisrobe *that.* As if.", "Well then you break up. Simple as that. Instead he’s whining on Reddit whilst presumably still with this grandpa-girlfriend", "YTA.\n\nPajamas are meant to be comfortable and fun, so feel like bereting someone for wearing something that isn't a Victoria's Secret prototype is a very prickish thing to do.", "YTA. Not for the initial spontaneous reaction, but for doubling down and being unnecessarily mean about what she likes to wear and feels comfy in.", "YTA and need to learn how to act around others", ">I have a girlfriend.\n\nnot for long", "Hey I might laugh too.  But there is a difference between a spontaneous reaction(which GF seemed fine with) but that you then told her she looked **super silly.**\n\nYeah, so what.  If she's comfortable, then she's comfortable.\n\nEnjoy not having sleepovers or not having a GF because unless you find a way to make up for being an insensitive AH, then you shouldn't be surprised if you lose the benefits of having a GF.", "I started sleeping in a long satin nightgown and also wear a silk bonnet for my hair - definitely grandma-core - *but:*\n1) it's super comfy\n2) I'd like to think my partner and I could laugh about it and then drop it\n3) there's a reason a lot of our great grandparents had lots of babies", "damn... and this is why so many girls are insecure about how their partner perceives them when they get undone", "YTA -- she was being a bit silly, she was making a joke out of it, and you made her feel uncomfortable.\n\nMocking your girlfriend and making her feel bad about herself for having a sense of whimsy is pretty terrible behaviour. So, yeah. You say sorry. Why are you taking this to a forum when your GF did nothing wrong but get upset you were mean to her?", "I too find it way too funny, but judging by the other comment im in the wrong here.", "You don’t have sex often, do you", "NTA", "Honestly dont feel like it was worth as much as op is getting. It was a somple joke that somebody decided to take offense to. If i looked goofy i wouldve been glad if somebody let me know.", "NTA", "Well that sounds like probably cute although weird that one would actually wanna wear all that\n\nYTA but not all that much", "I wear a moomoo with penguins on it to bed nightly and my partner and I get down and dirty in it, YTA", "Nightshirts are super comfy... Used to get Dad's handmedown ones. And, they are unisex!\n\nI do know that laughing a a BF's or GF's choice of clothing is likely to result in no longer having said BF or GF.", "Yta", "That sounds unattractive, but not as unattractive as telling your parents about it. What a strange behaviour. Plus you can't expect to share a bed or a home without ever seeing your partner in something \"unsexy\". \n\nWhat do you wear to bed? Or for lounging around in the evening? Probably not anything super sexy.", "Yes you are", "So one of the differences between banter and bullying is knowing when to stop.\n\nGiven that your girlfriend made the \"grandpa core\" comment, I'm guessing that at first she was laughing along with you, but then you took it too far and she got upset.\n\nIf you carry on a joke until someone gets upset and don't immediately drop it and apologise you're a bully.\n\nYTA", "Your a big ass. Literally finding it funny there’s no problem in that but you made fun of her. Big mistake. laugh at it for a little bit then reassure her that’s it’s no problem and that she looks adorable. It probably would have gotten you some brownie points", "YTA\nIt may have looked silly but sometimes thoughts should be inside thoughts and you clearly hurt her feelings. You also probably shouldn't have told your family about it. \n\nJust apologise to your girlfriend dude this is a pretty silly thing to dig in about and come ask the internet.", "*had a girlfriend", "I have to assume this story was written by someone in middle or high school who is imagining what it would be like to spend time with a new partner at night. But forgot adults don't go home to their parents and they definitely don't tell them how it went at their girlfriends place that night.", "Damn, ion wanna say it but you might be the asshole. The initial snicker was fine, if she laughed even better, everything after that especially when you noticed she wasn’t on the same page you should’ve kept the rest to yourself, she was comfortable enough to be herself around you and you might have tarnished that a bit. Get her some food or a favorite thing of hers apologize and ya should be good, this is kinda minor grand scheme", "My partner had a wicked streak. For years she got the ugliest night gowns she could. She got a sense of pleasure from knowing she could seduce the shit out of me wearing horrible granny nighties with clashing patterns and no flattering aspects. \n\nDoesn’t matter. She could wear anything at all, or nothing, and I would want to be physically present for her.", "Nta for laughing but you're the asshole for telling her she looked silly . We all are different people who like and prefer different things.  Everyone has quirks . Doesn't make them stupid or silly.  Don't get offended when she thinks something you do is silly or stupid becsuse I'm sure there's definitely a few things", "Yes, YATH.  She should wear whatever she wants, especially when inviting you into her bed.  Apologize appropriately, immediately, and never speak again of whatever she chooses to sleep in.  The hat is smart, as it retains heat.", "No, but not the smoothest move on your first night.", "> my mom said that I should apologise to her but that is only really because she finds my gf super sweet\n\nNo it’s because you’re a raging AH.\n\nYou’ve been together a few WEEKS and you’re already trying to determine how she should dress. You said in a comment that if she was wearing a shirt and sweatpants you wouldn’t have laughed.\n\nIf I were you, I’d just leave, she deserves better anyway. Time to grow up, champ, you’re in your 20s, you’re not 12 anymore.\n\nAlso, racing home to mock her to your family, and then having them defend her is so funny. You’re really on your own here.", "YTA and got some damage control to get to if you plan on being with her.", "So I'm curious. \n\nWhat's the deal with the nightcap? Is it winter in your part of the globe right now?", "NTA - It it's funny it's funny. I wouldn't I sult her for them but for the first time seeing them and laughing? All good. \n\nLong term wouldn't recommend it much unless you like sleeping alone and on the sofa", "I'm not sure what a 'core' thingy is though I know the scrooge part.  NTAH for laughing at them though, that's not what you'd expect a young woman in her early 20's to wear to bed.", "YTA.\nI laughed when you described them and then with the \"grandpa-core\". You should have laughed and dropped it. \nNow swallow your pride and apologize before you are a single as Scrooge himself", "yea shes going to sleep comfy not wearing tight ass \"sexy pyjamas\" like you think", "YTA but thanks for making me laugh too, it's cute. Also really comfortable and good for her hair probably.\n\nThe fact that instead of just apologizing, you instead have continued to mock her and then told your family and now reddit makes you a giant asshole. You're the one escalating this. You hurt the feelings of someone you care about. You lose nothing by apologizing.", "Sounds like two little kids at a sleepover", "YTA\n\nYou laughed, okay, it was a surprise.\n\nBut then you insulted her.\n\nI hope she doesn't waste anymore time with you.", "Yeah, YTA.\n\nDo you want her to find one of *your* insecurities and tell *her parents why you're such a joke?*\n\nCause that's coming. And it's coming because she's going to leave you when you keep doing this to her.", "Idk i sleep naked so that outfit is fcking weird to me. I would laugh too", "I do appreciate that his family also think he is an AH.", "i so feel this i wear these same hello kitty pjs to bed almost everynight because there comfy", "It's real life \"I just had sex\" by the Lonely Island. LoL", "the first two things are so normal what??", "Yeah, OP is....interesting.", "Good point! In his opinion his mum couldn’t possibly have disagreed with him and is only telling him to apologise because she thinks gf has a nice personality? Mum said this or he assumes this in his little-boy-trapped-in-a-man’s-body brain? \nAlso, “because *she* finds my gf super sweet” vs “because my gf is super sweet”. Telling.", "missing details and male ignorance could mean a lot of things here. like maybe it’s a bonnet and a nonnegotiable for her hair situation", "It sounded more to me like she was defending herself in saying that. And it’s not that he laughed, it’s that he carried on about it after then told his family expecting them to laugh with him.", "When someone says \"Hi, how are you?\" at the grocery store, do you think they're asking how you fuck?", "found the dumb ass lmao", "You know when you take off the night gown, she's naked underneath? And she's even the same girl she is that you started dating and thought was hot?\n\nThis is like object permanence 101.", "Someone who appreciates easy access. Duh.", "Clothing usually comes off when you have sex. So no matter how stupid their nightgown is you can take it off. This is not a major barrier.", "In my experience sex has very little to do with what the other person is wearing. Ya know, since most people have sex naked.", "Put a cute girl in her early 20s in that. She would look adorable. But doesn't sound like you're getting any sex anyway.", "Found the pick me lol", "I like it on the ladies. A lot.", "Me,", "It’s not like she’s never gonna wear anything else ever. Are you okay? Are you not aware people can change clothes? Are you thinking she’s gonna be stuck in that permanently and never wear anything that might be sexier?", "If you don't like what your GF wears to bed, you just need to leave a loose fit T shirt around after wearing it for a few hours.  \n\n\nNo woman has ever resisted the temptation of using her BF's oversized T shirts to bed.  \n\n\nOnly con is that your oversized T shirts will now smell like girl shampoo.", "There’s also a level of entitlement here that you think she should dress for you to sleep. Weirf af", "It’s a nightdress. Some prefer wearing them to wearing pj pants, due to the physical feel. And a nightcap can protect the hair. The bigger change is that men don’t wear nightdresses any more, not that some women do.", "Good luck getting any. Seriously, dude you EFF'ed up big time.", "I agree with both of your points but I was focused on the latter. I mean, look at the language used: his mother finds his GF super sweet. He describes her as silly and “someone who looks like an old man to bed”. Those are literally the only descriptive phrases he uses for her. What. The. F-ck.", "That crossed my mind too. Tons of women I know sleep in those silk caps. That would be hilarious if OP is this clueless", "Yup.", "Are you OP's alt account or something?", "Yeah but it got grandpa to pay them bills.", "TONS of women wear bonnets to protect their hair at night.", "I totally know what you're saying. In a kid sleepover, there's a point at which we say, \"pajama time!\" and everyone changes before bed.\n\nThis story has a similar vibe. I don't know if I've ever gotten around to putting on pj's when I'm staying over at a new partner's place lol", "There are comfy clothes, and then there is an actual night cap. I have never seen one in real life. I have never seen one for sale. It is a VERY specific choice. If I went to bed dressed like a football referee, I would warm someone ahead of time.", "I was just going to say this - it's really common for people with curly/afro hair to wear a silk bonnet for bed, I've even wore one as a white woman with wavy/straight hair just to reduce split ends and keep my hair oil from getting on the pillow. Dude is acting like she came out with a candle holder and started honk shooing in her sleep", "Women does something that isn’t for OP pleasure and OP is shocked.", "My folks keep their house a toasty 60 degrees F at night in the winter, so I wear a fleece watch cap to bed. It really helps me stay warm and sleep! But, yes, I think it looks a bit funny and I absolutely laugh at myself for wearing it.", "Those TV shows showed couples sleeping in separate beds. You really think that was the hot trend, too?", "Should have asked the parents to pick him up from the sleepover :)", "No. Adults don't refer to staying the night at their partner's house as a sleepover. You might be sleeping over, but it's extremely childish to call it a sleepover.", "\"Honk shooing\" hahaha I didnt know what you meant by this until I said it out loud a few times and died laughing", "I've slept in cold weather with no heat, I get it. Wearing a winter hat to bed sometimes makes sense. But you weren't cosplaying Victorian England for no reason.", "Adults parents also don't ask them how their \"sleepovers\" at their partners went. That was also weird.", "\"Hey son, how did it go in the sleepover? Had good sex with the gf? Good, now drink your chocolate milk and eat your cookie!\"", "Yep. Super weird. Like they're all just sitting around the breakfast table as a family wanting to know whether their son/brother had sex the night before and if the sex was any good. It's normal to ask how a date went if your family member started seeing someone new, but asking how the \"sleepover\" went is fucking creepy. \n\n\"Did you get laid last night, son? Don't spare us any details. We want to know ***ALL*** about it.\"", "If that's enough to break your libido, then I recommend you find some medications that help with that.", "Motherfuckers with 290k comment karma talking about preferences to what a partner wears to bed, as if they have a partner. Cmon, bud. You ain't gotta lie to kick it.", "what the fuck are you talking about, it’s a new relationship and the parent wanted to know how the night went, weirdo."]}