{"id": 27560, "submission_id": "16r9acc", "title": "AITA for refusing to play grandma with cookies and free childcare", "selftext": "I am a young grandma, I am still working and our youngest still lives with me and my husband. My son never married the girl and I have never met her. They lived together for a while but she disappeared. My son needs to step up and be a parent especially now that he is a single parent.\n\nHe made it very clear that her family is better than our family since he believes we are white trash. Now that he is a single parent he has a new opinions on this. He wants me to be grandma which includes free childcare and classic grandma stuff like homemade cookies.\n\nWe had this conversation over the phone and he wanted me to watch the kid when he is at work. I told him no and it started an argument. He told me it is the least I can do but I disagree.  That I should be a proper grandma. My youngest told me to post here.", "created_utc": 1695590739, "permalink": "/r/AmItheAsshole/comments/16r9acc/aita_for_refusing_to_play_grandma_with_cookies/", "score": 660, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Son wants free childcare now that he is a single parent. I  don’t want to play grandma which could make me a jerk.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You are literally still working, does he expect you to quit your job to watch your grandkid? Tell him maybe you would if you could pay her what you'd make for your current job if not more. It's one thing to bake cookies occasionally, if baking cookies is a thing you tend to do, it's a far another thing to think you should quit your job to care for *his* child.", "NTA\n\nYour son had his child at a young enough age that you aren't yet retired.  You need to be working to pay your expenses and prepare for your future.  If you were willing to become a full-time childcare provider, your son would need to pay you enough to cover the loss of your income and benefits.  \n\nAlso, in this day and age, it's pretty rare for grandparents to be the full-time childcare for their grandchildren.  That was much more common in generational households than in the modern Western household.  So, even if you were retired, you still wouldn't be obligated to give up your time to babysit for free.\n\nAs for cookies, tell your son that you'll let him know next time you're making some so he can bring his child by to get some.  (I mean, what the heck, like \"making cookies\" is any measure if anything, right?)\n\nBasically, what your son is really complaining about is that being a parent is hard and expensive.  It sounds like he might qualify for government support.  Please recommend that he look into his options.\n\nAnd if you and your family can do so, offer to take the baby occasionally (like once every couple weeks for an afternoon on a weekend) so your son can get a break.  This isn't something you owe your son, but would be a kindness.", "NTA. \n\nGrandparents, regardless of their age, are not obligated to provide free childcare. \n\nDoes he expect you to quit your job too? And if so, how does he justify you losing that income since it’s not like he plans on paying you. \n\nMost grandparents do not, in fact, provide free full-time childcare. Some do, but the majority do not. They may babysit from time-to-time, but childcare is the parent’s responsibility. \n\nYou son is delusional and unrealistic expectations.", "NTA at all.  Your son's life choices are not yours and you shouldn't be forced to be responsible for them.  Buy him a pack of condoms and move on.", "NTA.  He is wrong.  The least you can do is absolutely nothing.  Which is what you need to start doing until he changes his attitude.", "NTA, You've raised your kid and now he's old enough to raise his own, so his child is his responsibility.\n\nJust because your son has a Disney based idea of what a Grandma does, you aren't obligated to follow it. Realistically, you still have to work to keep a roof over your head and food on your table and you've earnt the right do what you want with your free time now you've raised yours.", "Nope. His life choices are his own. Free childcare and bakery services are not owed him. NTA", "NTA\n\nHe needs to be a \"proper\" parent.  End of the story.", "NTA The least your son could have done was worn a condom but that ship has sailed. He's a parent. It's his responsibility to take care of his child and find reliable daycare for the child when he is working.", "NTA, and your son sounds entitled and like a bit of a misogynist. If he needs a sitter, he needs to pay one, and if he wants cookies, he can learn to bake.", "NTA. Ask him why her fancy family can't watch his child? The least you could do, huh?\n\nYou work and are caring for your child at home, suggest that he do the same.", "I'm 60F and hubby and I have two kids 30F and 27M.  I'm still working.  I don't plan on quitting my job to take care of babies if either of my kids has them soon.  Not my kids, I already raised my kids.  Hubby & I both worked and put our kids in daycare, that's what your son can do.  He can go after child support from the mother, if needed, or get food stamps or whatever he needs.  You are NTA for not quitting your job.", "NTA.  You have a life to live and a job to work.", "\"He told me it's the least I can do...\"\n\nNo, technically the least you can do is... nothing.\n\nLet him try that on for size for a while.\n\nNTA.", "NTA he can ask ‘better family’ to watch the kid. Or did they disappear too?", "NTA, your son had a child and the full responsibility is in him. There is no such thing as a 'Classic Grandma' anymore, tell your son to bake his own cookies.....", "NTA. He is a parent now and has responsibilities. You work and have one child still living at home. Let him figure it out.", "NTA. You're working. It isn't your child. It is the parent's responsibility to care for the child, so your son needs to step up his game.", "NTA.\n\nYou have a job and your youngest child still at home. Its not your responsibility to watch his kid and make cookies. He needs to be a dad and figure it out. Even if you were someone who spends most time at home, it's still not your obligation to provide him with free childcare.", "NTA.  He was old enough to make a kid so he is old enough to face his responsibility to look after it.  You are not obligated to lift one finger to help.", "NTA. \n\nYou’re not a daycare, and your son’s opinion of his family only changed when it was convenient for him and he decided that he needed them.", "Lol  it's the least  you can do?   There are no duties  to being a grandma.\n\nI didn't quit work  when grandchildren came.\n\nNTA", "\"The least I could do was raise your dumbass, and I honestly thought I did a better job then this. The answer is no, move on. Raise your own kid.\"", "NTA. You get to participate however you want in the life of your grandchild. You son seems to think that because he's stuck with being a single parent everyone needs to step in and help him out. While that would be easier for him he asked, you answered and not he needs to figure out the next steps.", "Ugh, sounds like your son is being a real jerk. You don't owe him shit just because he's a single parent now. Stick to your guns and don't let him guilt trip you into playing grandma. And if he wants homemade cookies so bad, tell him to make them himself!", "NTA. You have bills to pay and your own life to live. NTA.", "Nta you have your own life, job and your own child. They say being a grandparent is a luxury because it's not the grandparents job to raise the grandchild . Your life doesn't stop because he chose to procreate. It doesn't make you white trash either to refuse to bend to his self entitled demands .", "Why is that the least you can do? That makes it sound like he thinks you were a bad parent and you owe him this.\n\nBut no matter what, NTA. You didn't choose to have that kid, he did.", "NTA. Jfc - I’m being asked the same. I can’t afford to retire. Kids depend on us to support them bc they can’t afford living on their own and  is they want free daycare. How is that supposed to happen when we work to support everyone?!!? Hmmmmm?!! \n\nYour youngest needs a wake up call. Now", "NTA.  This is his problem to solve.  And you are not the solution.", "NTA, it is not a grandparent's job to provide free childcare and homemade cookies.  You said it best that you are a young grandma.  You and your family were not good enough for him at one point, now that he is down and out you are.  Stay true to yourself.  There is no reason you should have to quit your job to work unpaid.  He needs to grow up and man up and take care of his child.  Non-custodial mothers do pay child support, he needs to go after her.", "NTA I was/am a young Grandmother as well, and I'm not doing that stuff either lol", "NTA. My mom didn’t retire until my kids were all teens, so I never had a “traditional” grandma for my kids. I don’t even know how many of those there still are.", "Sorry, but your son is TAH. You absolutely don’t need to take on responsibility for babysitting his child. His comments to you are disgraceful. He became a parent and now has to face his own responsibility in finding and paying for child care. Not your problem. He wants you to solve his problem and tries to lay a guilt trip on you for not being the stereotypical grandma. Don’t fall for it. You should not even babysit part time. Again: Not your problem. You are definitely NTA.", "> He told me it is the least I can do.  \n\nHow's that work? Not your kid. My your problem.    \nNTA", "Where is your son's kid now? \n\nNTA. You obviously don't need to just roll over and do what he's asking, but since you raised this ~~deadbeat dad~~ struggling single father you might feel at least a bit of concern about the fate of his child.", "NTA.\n\nThe least you can do is probably to send a birthday card once a year.\n\nYou are not obligated to provide regular childcare.", "NTA", "NTA\n\nRealistically if my son got someone pregnant young I could be a grandma before I'm 40, I still have at least 25 years of working left. \n\nI get the occasional babysitting so dad can have a night off or a break, or go to appointments, but no sorry. \n\nTbh I'd be asking him why he wants 'white trash' to be watching his kid.", "Nta so he expects you to quit your job and says that's the \"least you can do\"? I don't think so.", "NTA. It’s up to you if you want to babysit. You said no. End of discussion.", "NTA. As far as I can remember, neither of my grandmothers ever baked a cookie. I grew up fine. Or maybe that is the root cause of my many neuroses but I doubt it. \nAs for the childcare thing, just no. You’ve raised your children, he needs to figure it out like all the other single parents in the world.", "NTA. If he’s working then he can afford to pay for daycare.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI am a young grandma, I am still working and our youngest still lives with me and my husband. My son never married the girl and I have never met her. They lived together for a while but she disappeared. My son needs to step up and be a parent especially now that he is a single parent.\n\nHe made it very clear that her family is better than our family since he believes we are white trash. Now that he is a single parent he has a new opinions on this. He wants me to be grandma which includes free childcare and classic grandma stuff like homemade cookies.\n\nWe had this conversation over the phone and he wanted me to watch the kid when he is at work. I told him no and it started an argument. He told me it is the least I can do but I disagree.  That I should be a proper grandma. My youngest told me to post here.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Son wants free childcare now that he is a single parent. I  don’t want to play grandma which could make me a jerk.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.  My kids think I’m white trash, too.   Not their father, just me.  NGL, that one hurt.", "The least you could do is absolutely nothing. Given how entitled he is, I suggest that's exactly what you do.\n\nNTA", "NTA. Not your child means not your responsibility. \n\nSidebar: Who's white trash now, eh DAD? The family that's \"better\" than yours or the one that's taking your calls?", ">I have never met her. They lived together for a while but she disappeared\n\n\n\nThere are 100% missing missing reasons here.", "Nta- one stereotype for another/ shouldn’t he be married and with the kids mom? See how he likes the double standard.", "“ I’m happy to make cookies with my grandchild on weekends, but I have a household to run and to pay bills I need to work.  If you can pay me my current salary, I’ll be happy to babysit for you.”", "You certainly are under no obligation to provide childcare. However, it sounds like you have a huge chip on your shoulder, apparently from before there were even grandkids involved. I don't know if that's on him, on you, or whatever. NTA for the childcare though.", "NTA. Your son chose to have unprotected sex. He chose to call you and your husband white trash. He's trying to offload the parenting onto you so he can continue to live free and easy. DO NOT GIVE IN", "NTA \n\nBut this sounds like a good job for your youngest (obviously for a fee. Maybe $15-$20 an hour) to babysit every now and then for his niece/nephew.", "Lol no. All of my grandparents were very involved during my childhood, but they didn't babysit me on a regular basis. There were only a handful of times that I remember them babysitting. Granted, my parents were together so there were two incomes, but they still had to pay a babysitter until we were old enough to go to school.", "NTA. Would I want you as a mother or grandmother for my child no. Your son absolutely needs to be a dad and take responsibility. You don't sound like you want much to do with the child or are even excited about them at all. It makes me sad for the child.", "[removed]", "NTA but maybe give him some advice like getting an attorney to pursue child support. Courts have more resources to find disappearing parents than the average person.", "NTA You don’t owe him anything. His choice of having unprotected sex resulting in responsibility are not your choices nor responsibilities. There is no such thing as a “proper” grandma. He does not get to instill his ideologies onto who you should be. If that was the case, he would be a proper son, who respected his parents and upbringing who was responsible and took precautions when engaging in premarital sex.", "Why would he want “white trash” around his child? He needs to bother the better family. /s Keep saying no, he needs to learn to be humble and not such a jerk. NTA", "You are done raising your daughter yet (I assume)! Either way, he is the one responsible for his own problem solving. He needs to go for child support, childcare subsidies, food stamps, WIC, etc to patch together whatever is needed and then humbly ask if you can assist in filling in any gaps (if you are inclined). You are definitely not a babysitter as you have another child and have to save for your own retirement. He is quite entitled for someone who needs help. NTA.", "NTA.  Calls you white trash and then wants you to work for free.  I think not.", "Interesting how his attitude changes when he becomes a single parent.  You work, you don't have time to be a SAHG for free.", "NTA. He should be a proper father. He can do this without your help.", "NTA, you lovingly tell him that “Iknow you can handle this.” And that is that.  You work.  You have a life.  I hope you want to know your grandchild and do that every few weeks on the weekend.  No way do you have to be guilted into child care.  You need to let him know that you believe in him and that he can do it.  But that’s it.  Stand firm.", "You have a job and your own child you're still raising.\n\nOccasional babysitting as a favor, okay if you want to.\n\nBeing his regular childcare solution. No.\n\nThat's what daycare is for. If he can't afford it, maybe he can get assistance. \n\nAlso, he should let the other grandparents know that their daughter dumped their grandchild. Because the daughter should be paying child support. Maybe, since that family is so much better, her parents will step up and help.\n\nThe proper reply to \"It's the least you can do\" is, \"No, the least I can do is nothing.\"", "Nta. Tell him to be a proper parent", "NTA\n\n\"That I should be a proper grandma\".  Two things about the sexist AH from this:\n\n1.  Maybe a clue as to why the GF left (tho It's terrible deserting your child)\n2. He should have been a proper man meaning he should have controlled where his sperm went.", "NTA. What is it with \"kids\" thinking that their parents should quit working to babysit? Even if you weren't working, 5 days a week is asking a lot of you. He needs to figure it out.", "NTA.  A parent's job is to help the child become a decent adult.  He has this job now.  \n\nI'm disabled, and my adult child has told me similar, even though I physically can't for more than a couple hours occasionally, and that is only if it's a good moment.  I still need help myself in my own life due to the ongoing medical problems.  I'm so hurt at his behaviors, as I'm sure you are too.  It is not our job to live up to their ideas of who and what we are.  Perhaps they should be an adult and have an adult relationship with us, their parents.", "NTA", "NTA Your son needs a reality check. Expecting you to quit your job to provide ***free*** childcare is frankly ridiculous. Even if he could pay you, it's still fairly ridiculous to expect you to give up your job to care for his child.   \n\n\nIn terms of classic grandma stuff, neither my cooking baking grandma nor my non baking grandma provided free full time childcare. Offer to babysit here and there? Sure. But your son's expectations are radically out of touch with reality. And he needs to get back to reality quickly and care for his child that he helped create and which is his responsibility to raise.", "A proper grandmother raises her own children, not her children’s children.", "NTA. Does he watch his sibling while you work? No? Well then.", "NTA. \n\nI *am* retired, and watched my (step) grandkid part-time for a year and I freaking partied when her mom found full time less expensive care. (I am still emergency sick-kid-can't-go-to-daycare, mom-has-to-work care, meaning if daycare calls I'll pick her up and watch her at her mom's house or even take her to the pediatrician, but I don't anticipate that being more than once every couple of months)\n\nChildcare is a full time job, even if they take a nap.", "He said part time would work. Just no. I’m pretty sure the mama ran since he wants someone to stay home.", "Funny how he considered his family to be beneath hers until he needs them to do his parenting for him. Absolutely comical.", "And why is \\*his\\* job more important than OP's job? OP also still has a kid at home to provide for and bills to pay, why should she be responsible for fulfilling his parenting responsibilities (or outdated gender norms about domesticity).", "My oldest sister once said my mom wasn’t very grandmotherly. Mom replied “I have one child in high school, one in jr high, and 2 in elementary school. I don’t have time to be grandmotherly.”", "IDK. Maybe it's the least she could do after raising such an entitled loser for a son?", "He should be in his apartment with his dad.", "He’s not a deadbeat dad. He’s a single father with a misguided sense of entitlement. \n\nBut feeling a bit of concern does not equate to giving up her job and raising her grandchild.", "I’m 40 and a grandma. I don’t babysit, I work full time and that’s my priority as I still have other kids at home.", "Depends what he makes and where he lives...\n\nBut if the mother's family is so much better, then They can oversee childcare expenses or do the actual childcare.", "Being called white trash can do that.", "It's interesting how expectations have changed.\n\nWhen I babysat the going fee for teen babysitters was less than half of minimum wage. (And that was for however many children there were. No sliding scale for more kids.) Now teen babysitters expect about two or three times minimum wage.", "Son knocked up a girl OP never met. Son thought his family was white trash and girlfriend's family was so much better than his. Girlfriend leaves and all of a sudden son has a change of heart and now wants a 'traditional' grandmother for his son with babysitting and homemade cookies.\n\nProblem is, OP already has a full life. She is still working and may be raising her last child depending on how old they are. She doesn't have a lot of time to babysit and make cookies. Not all grandmothers do that anyway. The son needs to either ask the other grandmother (the 'classy' one) ifshe can babysit or else make other arrangements.", "Hey, if that's the viewpoint that keeps him taking care of his own kid, I'll go for it.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I keep wondering where this fine family is now? If they're so much better how come they aren't helping out?", "If you're stateside he can apply for assistance (daycare assistance is also available) and WIC. \n\nI rarely babysit any of my 10 grands, I don't mind doing it infrequently. Now the cookie/baking thing we do as a group. But I totally understand the babysitting, I still work full-time too.", "He may not be full-on deadbeat, but he's not taking full responsibility for his child. \n\nHe needs to take the mother to court for child support, not make insane demands on his own mother.", "You have a point. OP's post has such disdain for her son, I attributed the worst to him.", "Not saying she's AH. She absolutely has a full life and can do with it what she wants. It sounds like the son isn't capable of giving his child everything they need not just baby-sitting but loving on the child like a grandma does. It doesn't have to be traditional grand mother stuff just show an interest or anything. In the end it doesn't matter whose responsibility it is to actually nurture a child just that one is going without their needs met. I don't know what would have happened to my niece if my mother had not stepped in but it could have been awful. It wasn't her responsibility but she was there just the same. No op is not an AH for not wanting to babysit but I get the general impression she's refusing to be in the child's life to punish the son for his attitude. So yeah I won't lie and say I'd want OP as my kids grandma.", "Or she's not interested in being the sort of grandma he...and you...seem to think she should be.", "NTA and did he ask his dad to quit his job and be a \"proper grandpa\" or just you?", "NTA, but it sounds like he is right about your family.\n\nThe fact that he expects you to watch your grandson all day is trashy, and the fact that you are not working together to figure something out is trashy. That's your son and your grandchild, get off reddit and figure it out.", "You reference yourself as a grandma but only reference your grandson as \"kid\"\n\nYou should chew on that.", "INFO:\n\nIt feels like a TON of context is missing. \n\nHow old is the kid in question?\n\nYour youngest?\n\nHow old is the baby?\n\nWhat do you mean \n\n>He made it very clear that her family is better than our family since he believes we are white trash.\n\n? Like specifically what has he said?\n\nBecause my family is also white trash, they're good people, just poor as fuck.", "ESH. I always wonder when parents post on this sub about some awful behavior their child is exhibiting why they rarely give the background info to build a better picture about the development of less-than-desirable personality/behavior. What kind of values did you teach him that he would look down people especially his own family and call them white trash. What kind of relationships did he grow up around that molded him to have such outdated gender roles/stereotypes. Your son may the AH now but what kind of parenting and childhood did he have that led to such poor decision making and sense of entitlement. Parents are not responsible for the behavior of their adult children but damn I would do some deep self-reflection on how my role as the parent contributed to my child's development or lack thereof.", "YTA", "NTA.   Why would he want his child to be cared for by white trash?  If her family is so much better, then shouldn't he be contacting the runaway gf's mother for free childcare?", "NTA. He’s looking for you to mother his child, not be a grandmother to it. It also sounds like he’s happy to be a part of your family if and when it suits him only.", "NTA\n\n 'proper grandma'? you mean like out of central casting?\n\nhis chidl, his responsibility and even if you were not still working, which is a major block on that, you're under no obligation to provide child care.", "NTA and I'm wondering what incredibly stupid thing he said to the exgirlfriend's \"better\" and not \"white trash\" family to call up his mom and make weird demands like that.", "Well if her family is so great he can have her mom babysit and make cookies. Oh wait, she skipped out. \nNTA", "NTA my mom and mother in law watch my kids a few days a week for free so we can work. I think they are going above and beyond for us. They are doing us a huge favor. We are not entitled to free childcare from them. To make it easier, I stocked their houses with baby gear (pack and plays, swings, bouncers) I supply all the clothes, diapers, and formula. When they come to my house I have meals ready for them and their favorite drinks and snacks on hand. Your son has the wrong attitude about it.", "NTA\n\nHe needs to sue his baby mama for child support.", "NTA. That was a whole lot of attitude and disrespect from someone who was asking you for a favour.", "If her family is so great why don't they babysit?", "Tell Him to go to the state for childcare assistance like many young parents do.", "NTA.   Put your foot down & tell your son he is the dad & he needs to figure this out on his own.  You are not responsible for caring for a child he brought into this world.   He needs to start adulting & arrange his own childcare while he's a work, because you & your husband have your own jobs. \n\nPersonally, I would raise the level of pettiness & tell him that since you've always thought we're such white trash anyway - why aren't you contacting the family of the tramp you left you high & dry for help......", "NTA you need your insurance and retirement will he pay for that? I’m a gen Xer my grandparents watched us occasionally  (some summer visits or the occasional day) but never provided free childcare. \n\nIf your son is still living with you, I suggest you break down for him how much it costs to rent a room, his share of the cable and the grocery costs. Tell him that is your gift to your grandson and he has a year to find a stable job, a home and childcare… then if need be you will evict him. \n\nIt sounds like your son wants to dump his parenting duties on you, don’t let him. This is between the mom & him to figure out. \n\nThe cookies? Buy store bought cookie dough in a tube, let the kid add magic sprinkles and bake.  😉 I just use the joy of cooking recipe with dark chocolate chips & pecans when I could eat nuts. There is nothing wrong with semi homemade. Besides as a kid using the cookie cutter or cookie press or the roller plus the sprinkles are the best part to the kids.", "NTA \n\nSo you should take an income hit to look after his kid?\n\nHahahahahha\n\nNo", "In 1980, when my first child was born, my mother let me know she worked all week, and when she wanted to babysit, she would schedule the time with me. This is how it was. She would pick times and schedule ahead. We would plan our outings around these dates and times. She also would let us know when she heard of good daycare or babysitter, passing on phone numbers and info to us. We considered her the very best of grandmothers, no one better. Her grandchildren adored her. Fun, fun, fun, on her scheduled free time.", "NTA\n\nMake it clear to your son that you have a job, which is not working in daycare. If he doesn't want to put his child in daycare, then he can pay you a slightly higher price than the daycare would charge. As long as it's more than you make now of course.", "Nah OP you're nta, as a single parent sure one could sympathize with him trying to find a way to save money but once you said no and made it clear he needs to figure out another childcare situation or offer to pay at least if you're willing to watch your grandchild for payment. And I'd get that in writing with a signature so it can't be argued with if he tries stuffing stiffing you or any other bogus stuff", "NTA\n\nHe just wants you to step in as a mom/house-spouse, that is not your job.   \nEspecially with his low opinion of your family, I wouldn't help him beyond emergencies.   \nMillions of single parents raise their kids just fine, he needs to get his shit together.", "NTA", "NTA, where is his responsibility in all this. Suddenly you're a better fit than her family. You've raised your family, done your time and you still work. NOPE. Unless he's going to match your salary and it's for no longer than 9 hours per day, including school hours, I wouldn't entertain it. Occasional treats and babysitting is doing plenty.", "NTA  I can see why the mom left.  He probably told her it was her job because of the body parts she was born with.  What a gross pig.  I bet she didn't even want the baby and he either forced her or told her how AMAZING it would be.", "Smh. NTA. Why do young parents to be think they can pawn their kids off on their parents and their parents won’t have an issue with it? Not all parents want to watch/hang out with their grandkids part time or full time. Your son needs to step up and figure it out. His situation sucks but nonetheless he chose to keep the child from the jump so be the parent you wanted to be. Also, if my kid decided that we were “trash”, he most definitely won’t be getting any help from me.", "You should encourage him to have the baby adopted by a loving married couple.  It doesn't sound like either one is parent material and you don't mention their ages, but I bet they are too young and immature to be parents.  Its in the baby's best interest to get adopted by 2 parents who love it before especially as a infant.  The novelty of having a baby for immature kids sounds great, but pretty soon they get tired of their responsibility.  Did you tell him to use a condom to make sure this didn't happen???  Sounds like you should have...", "Absolutely these recommendations. \n\nLook to assistance and where he can go.\n\n**Momma needs to pay child support.**\n\nGiving him a schedule for your assistance and telling him to stick to it would aid him recovering. Something smaller like 1 weekend a month of possible. Nothing weekly until he shows gratitude.\n\nHe was young, dumb, and he's still broke. At the end of the day though he hasn't given up his child for adoption or cps. If you suspect he's going to dump the kids and not come back you can contact the authorities yourself. The only real victim here though is grandbaby. They didn't ask for dumb parents.", "This right here. Yes, OP is younger and still working, but even if she were retired, she’s not o located to devote her retirement to raising her grandchildren. Help out, sure. Respite care can mean the world to an exhausted parent. But dad is responsible for raising his child, not OP. NTA", "Suggest he contact the mother's family for grandma duties, since they were superior before they must still be now.", "Honestly, I think it depends on the grandparents.  I've known some grandparents who have never pressured their kids to have kids which sounds like OP.  Then there are the grandparents who actively pressured there kids to have kids like my MIL. There the ones who say they will help all the time. The problem is they don't always follow through. I can see why some kids feel cheated in the latter.  End of the day the parent is responsible.", "Lol! So what, he thinks your living expenses changed when he impregnated someone? Bwahahahaha! Wow.\n\nSo where is this sense of entitlement coming from? Is this because his grandparents took care of him when he was little or is this just out of the blue? And how come the “better than us” fam isn’t the go-to-ask for childcare?", "Did her parents disappear too? He can drop he baby off with them. NTA", "Honestly depends if the mother can be tracked down when it comes to going after her for child support. OP said she disappeared, my guess is she’s likely changed her contact info and her family/friends either don’t know or won’t tell OP’s son her whereabouts. I think if he knew where she was, he’d have been showing up to try and pass the kid back to her.", "Might have something to do with inflation and thr minimum wage not having been increased in years?", "I'm getting \"it takes a village\" vibes.... it used to be a positive thing, but is widely used by entitled people these days who want others to do for them", "It's not that hard to find people as long as they're not missing person missing. If she's missing missing their should be resources available to him- it's finding them that would be the hard part.\n\nEither way a lawyer should be able to get him started.", "It is possible that she only had the kid because he wanted it. If that is the case, the reasons for that are…varied. \n\nThere is a lot of missing information because it is abnormal for a woman to birth a child, give it to the father, then split town.  However, it is likely that OP’s son may have other ”charms” beyond expecting his mother to drop everything and care for his kid.", "And they have the money for that from...?"]}