{"id": 27595, "submission_id": "16rosjr", "title": "AITA for telling my sister that this isn’t her room anymore", "selftext": "10 years ago, my mother bought our house. She was recently divorced, so she said she would prefer not to have the masters bedroom, and said it was between me and my sister on who gets the biggest room. I told my younger sister that she could have it, I wouldn’t mind getting a smaller room.\n\n Jump to 2022 my younger sister said she wanted to move out, I had told her multiple times that she should just stay with us and keep her money (2200 for a room). She went on and got an apartment with 3 of her sorority sisters back from college (6000 total). \n\nWhen she left, I naturally moved into the big room. I told her, and she seemed “okay” with it. But she gave me a “stipulation” that I was not allowed to touch her stuff, and for the most part she still has many clothes and items here, it is more or less a storage unit.\n\nShe had been living with them for about 3 months when she decided to visit us, when she saw me sleeping in the bed, she told me to get out of “her” room. She told me she wants to stay in the room for the rest of the day, as she feels exhausted being in her new apartment and that she doesn’t get privacy (she does have her own room in the apartment, but she tells me she feels like she needs to keep her room open, as it is rude to not make conversations and greet the other girls, so she feels like she is always conversing and it makes her tired)\n\nI remember rolling over and telling her she can sleep beside me, but that I didn’t want to move. \n\nThis led to a huge argument. She said she feels that she has no place to call home now, and all she was asking was for me to get out of “ her room “ for a couple of hours where she can “de stress” alone. I told her she can stay in the room with me, but that it is now “my room.” She insisted I still leave.  And that she would do this a couple times a month, and that I could have the room back when she is finished. She insisted I was being unreasonable as I could have the room all the other times she is not here and she is at her apartment. \n\nUsually I’m very kind to my younger sister but this type of “argument” really annoyed me. I explained that she willingly left this house, that I explained to her multiple times to stay to save money, that she had a “home” but that she decided to leave. When she left she left ownership of this room, and that if I wanted to stay in my room, she would be allowed to come and stay as much as she wants. But her telling me to leave and wait, and decide for me on a dime when I can and cannot go in the room, was a big hell no for me. \n\nWe haven’t talked much since, it’s been a year and other then small talk, we haven’t really spoken.\n\nAITA?", "created_utc": 1695639377, "permalink": "/r/AmItheAsshole/comments/16rosjr/aita_for_telling_my_sister_that_this_isnt_her/", "score": 577, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I understand that she needs her privacy. She told me that when she goes home to the apartment she does have her own room, but that she feels oblige to have to make a conversation and keep her door open. \n\nI told her she doesn’t need to do that: that she pays a lot for rent and she is allowed to act and feel the way she wants to.\n\nOn my side of the coin, she has to understand she cannot literally go in and out of this room, and throw me out whenever she feels like. She cannot mark this room as her own, when she doesn’t live here anymore! She left willing, no one forced her. I’m a human being. And it’s not right for me to do everything based on your beck and call.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You need to take all her stuff and carefully dump it into your old room and stop living in her storage unit. It’s *your* storage unit now, she moved *out*. \n\nShe can come back to her family home whenever she wants, but the room she used to occupy has been taken and will not be relinquished. She can stay in your old room-where all her stuff is- and she can *like* it. NTA", "NTA. Your mother should have shut this down immediately and told your sister to move her things to the smaller room.", "NTA\n\nShe moved out.  Its not her room anymore and certainly not some kind of elaborate storage space for her stuff.  \n\nJust move all her stuff into your old room or just box it up and put it in the attic.  \n\nShe doesn't live their anymore and needs to understand that.", "NTA\n\nshe moved because she wanted to. Doesn’t make sense that she wants to have her room untouched if she doesn't even lives their anymore.\n\nI think you and your mother should set some boundaries and just use your old bedroom to be her “storage”", "NTA \n\nThis is part of growing up. When I moved out my parents immediately painted and turned my room into a craft room. \n\nClear all of her stuff out and make it you own", "NTA. She’s an adult. She has a home that she pays for.", "NTA. Where is your mom? Your sister is absolutely out of her mind.", "NTA.  \n\nThe problem here is that your mother has checked out.  This is her house, there is a major problem between her kids.  She needs to step up and get involved.\n\nYou already said everything that needs to be said.  Your sister left home.  There is a housing crisis in every English-speaking country right now, where Boomers and their parents hoard housing and everyone else has to pay more than they can afford in rent.  The point is, it is simply not reasonable for your sister to expect her room to be preserved for her like a shrine.  She moved out.  It is not her room.\n\nThere should always be a place for her at her mother's house if she needs it.  It sounds like there is enough space in the house to set aside the smaller room.  However, it is not reasonable to let the large room stand empty when your sister no longer lives in the house.\n\nIt seems like she is dealing with conflicted feelings about leaving home.  She DOES have a home; it's where she currently lives.  It sounds like she is also lucky enough to have her mother's house if anything goes wrong with her current residence.  But the bottom line is that she has moved out and she needs to be mature enough to understand that her conflicted feelings are not your fault.  She needs to work through her feelings without bugging you.\n\nYou need to ask your mother to step up.  This is your room.  Your sister should move her stuff to the smaller room and stop bothering you about the situation.", "Nope, you are correct and are NTA.  When she left, it was no longer her room, she has her own apartment.  If her stuff is in her old room, she needs to box it up and bring it to her current apartment or move it into another room in your mom's house.  I can't believe she's the younger sister and got the biggest room for 8 years (if I did the math right) and is now complaining!  I'm the youngest of 3 girls and always the oldest got the best room, that's life.  Your mom should be telling her this, not you.", "Nta - this isn’t sustainable. It’s your room now, move her things into the smaller room, make the bigger one your own. Don’t be a doormat to your sister.", "NTA. She moved to an apartment and needs to sort the stuff she left behind, move it to your old room or take it with her.", "NTA I hope you’ve moved the stuff she left behind to your old empty room", "NTA. Your sister is childish  And she can set boundaries with roommates.  If you need alone time, close the door. She should be comfortable in her own apartment/ home.", "At the end of the day you're right but if your sister hasn't talked to you over this for an year I don't think it was only about the room. You're \" nta \" but what can you do if she doesn't want to talk to you anymore. Unless she antagonised you or picked more fights with you over this she didn't do anything terribly wrong either other than being unreasonable, maybe she was feeling lonely and wanted the comfort of her \"home\" at that time. Maybe it was just a selfish request. I would have let her sleep there alone that night and set boundaries the next morning. \n\nYou can try to re kindle your relationship with her or just maintain being amicable maybe that's best for you too. \n\n>that she had a “home” but that she decided to leave. When she left she left ownership of this room\n\nOne thing though only if your sister didn't have a history of selfish behaviour and if you guys had a good relationship till that incident--- she might have taken these words to heart, misunderstood this as you telling her that's not her home anymore as she chose to leave it. Im just guessing but if you're looking for reasons as to why she stopped talking to you this could be one.", "NTA  FAFO", "NTA", "‘The smaller one is not even your room either. It’s the spare room’ 😄😄", "Nta your family raised a brat. Move her stuff and take ownership of the room or give it back to her but stop this half in half our mess.", "She moved out. Take her things out of your room and put them in the guest room aka your old bedroom. She has a home that she's paying $2200 a month for. Definitely NTA.", "NTA, she voluntarily moved out it is your room now. Get a lock on the door and take all her stuff. Put  it in the smaller room. She has no right to make demands of you, she can have the smaller room", "NTA se has moved out and expects the best room in the house to be 'hers' for when she comes to visit?", "NTA and you should move all her crap to the smaller room. The big room is yours even if she moves back. She is unreasonable.", "✋🤯 ✋", "NTA  Have you packed up all of her things she left at the house and put them in her new room? Do it? And make sure all of your things are in your new room.", "NTA\n\nShe moved and has her own apartment. Ridiculous to keep \"dibs\" on the room", "I'll go for NTA. BUT, It can be incredibly difficult to see your old room being used by someone else - yes. Happened to my oldest sister - I didn't understand at that point and later happened to me, too.\n\nHowever, she's making unreasonable demands.", "NTA she left. She has NO room. She doesn’t even contribute to the bills!", "Somehow all I could while reading this was wonder what kind of secret hiding spot she’s worried about being found. Anyways, NTA.", "NTA but take her stuff out of the room.", "NTA, when I went to university I gave my older brother my room because I knew he would get better use of it. I moved out, it's that simple. However, it does seem a bit extreme to not talk for almost a year over an argument like this. Sometimes the best way to patch things up is to own up to all the ways you might have been shitty and apologize. That way it creates a space for her to do the same.", "NTA. Your sister seems to have an odd attachment to a room that it no longer hers! Whatever is left in the room that belongs to her needs to be moved to the smaller room. That can be her refuge if she has an issue and it can be her new room when she moves back \"home\". The master is no longer her room and she needs to figure that out!!", "Why isn't your mother sorting this out? It's her house", "Your sister is an entitled child with an outsized sense of self. She willing left that place and can’t keep claim to it now that she’s left. She made her bed. NTA", "Aaah nothing like some sibling drama! I've two siblings and can relate. Honestly, I think there's two important notes here.\n\nFirst, I totally agree that it makes sense to get the bigger room now that she's living elsewhere. My sister got my bedroom when I moved out. Honestly, I didn't really mind, I was happy to see my little sister all excited (she's considerably younger than me). I don't stress too much with what she chooses to do with it, it's her room. But also, and that's my second note... there's a tiny part of me that kind of feel sad when I come visit and the room is a mess 😮‍💨 She kept a lot of the paintings I made on the walls, but somehow that makes it worse! It kind of makes me miss my room and how easier life was when I didn't have to pay so many bills lol\n\nYou said she's feeling stressed, I guess she could be feeling something similar. Maybe try to find a empathic way of asking her to see your side too and empty her old room. You could offer to help her set her new room in the smaller one, a safe space where she could relax. Maybe put some stuff that helps with that, it can be cheap (like candles or a cozy pillow, idk). A compromise that solves the problem and makes both of you happier.\n\nNTA", "Your sister is spoilt. She can always put her things in your old room and then she has somewhere at \"home\" too. \n\nNTA", "YTA\n\n> I told her, and she seemed “okay” with it. But she gave me a “stipulation” that I was not allowed to touch her stuff, and for the most part she still has many clothes and items here, it is more or less a storage unit.\n\nShe very clearly wasn't giving the room over to you.  How does one give up their room while expecting everything they've left in the room to be untouched?\n\nAt the very least, you needed to be much more clear about what you wanted, and confirmed that she actually agreed, not just 'seemed' ok with it, despite her stipulations (which you put in quotes for some reason.)\n\n>  When she left she left ownership of this room\n\nSo, to confirm, your name is on the title of the house?", "She’s AH for thinking she can dictate what happens in a house she moves out of.\n\nYou are AH for letting her.  Why is her stuff in that room at all?\n\nESH", "Contrary to common opinion here, but soft yta and also she should have have stood up for herself more from the beginning. Your younger sister is a young adult, very much still figuring things out. If possible she should definitely still have space in your moms house. I honestly wouldn’t even call what she did “moving out”. If she wants to experiment for a year with having an apt while also keeping a safety net behind her at your moms house, who are you to try and stop her? It’s not like you needed the space, and it sounds like you’ve got two rooms now at your moms house while she’s got none, because her stuff is ‘stored’ in your ‘new’ room, while I bet all your stuff is still in your old room. With some understanding that your sister probably didn’t know what she was doing, she probably should have told you from the start that while she was trying out this new apartment arrangement, she wasn’t ready to give up the safety of her old room", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n10 years ago, my mother bought our house. She was recently divorced, so she said she would prefer not to have the masters bedroom, and said it was between me and my sister on who gets the biggest room. I told my younger that she could have it, I wouldn’t mind getting a smaller room.\n\n Jump to 2021, she said she wanted to move out, I had told her multiple times that she should just stay with us and keep her money (2200 for a room). She went on and got an apartment with 3 of her sorority sisters back from college (6000 total). \n\nWhen she left, I naturally moved into the big room. I told her, and she seemed “okay” with it. But she gave me a “stipulation” that I was not allowed to touch her stuff, and for the most part she still has many clothes and items here, it is more or less a storage unit.\n\nShe had been living with them for about 3 months when she decided to visit us, when she saw me sleeping in the bed, she told me to get out of “her” room. She told me she wants to stay in the room for the rest of the day, as she feels exhausted being in her new apartment and that she doesn’t get privacy. \n\nI remember rolling over and telling her she can sleep beside me, but that I didn’t want to move. \n\nThis led to a huge argument. She said she feels that she has no place to call home now, and all she was asking was for her me to get out of “ her room “ for a couple of hours where she can “de stress” alone. I told her she can stay in the room with me, but that it is now “my room.” She insisted I still leave.  And that she would do this a couple times a month, and that I could have the room back when she is finished. She insisted I was being unreasonable as I could have the room all the other times she is not here and she is at her apartment. \n\nUsually I’m very kind to my younger sister but this type of “argument” really annoyed me. I explained that she willingly left this house, that I explained to her multiple times to stay to save money, that she had a “home” but that she decided to leave. When she left she left ownership of this room, and that if I wanted to stay in my room, she would be allowed to come and stay as much as she wants. But her telling me to leave and wait, and decide for me on a dime when I can and cannot go in the room, was a big hell no for me. \n\nWe haven’t talked much since, it’s been a year and other then small talk, we haven’t really spoken.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, but all that stuff needed to be boxed up by the sister long ago. Move it out of the room, preferably in free boxes if she won't do it.", "NTA.  She moved out & you took her room.  Isn't your old room now hers?  She doesn't get to kick you out of your room bc she's home.  She has her own place & her own room there.  Her reasons for not hiding out in her room at her own place are ridiculous.  She doesn't get to come home & tell you what to do.  It is your space now, she needs to get over it.", "NTA she doesn’t live there anymore", "NTA. But for dogs sake, mover her stuff into your old room and get a lock for your door.", "NTA. In fact, you should move your sister's stuff into your old, smaller room. And that will be her room for when she visits home. That's what I did in college. I moved to the smaller room and let my sister have the bigger one. \n\nAlso, for your sister: It is time to grow up and learn to advocate for yourself. It is not rude to close your bedroom door so you can have privacy when living with room mates.", "NTA, but get her to move all her stuff out.", "NTA. She is not paying rent for your room, she has no say. She wants both places? She wants a place where she can distress, that’s what she has an apartment for. Stop giving up your room", "NTA - but by leaving her things in there because she told you to is kinda still giving her some control. If its your room now tell her she can move her things to the other room herself or youre going to do it for her. If she refuses, move her things, end of story.", "Wait...doesn't anyone else get pissed off with posts like these? It just beggars belief the lack of emotional intelligence in people these days...wtaf..OP is NTA..", "why are you paying rent to your own mom wtf is this crap in america..", "NTA but I don’t understand why you didn’t actually move in there and switch your stuff with her stuff and put her stuff in your old room?", "Exactly this. By allowing her to dictate what goes on in the room, after she's moved out, OP is essentially acting like she's renting the room from her.\n\nThe sister's stuff needs to be moved to the smaller room last month (three months ago, actually). Who tries to keep control over the big bedroom after moving out? That's not your house anymore.\n\n**EDIT:** Just wanted to add that OP may want to inform her sister that there's nothing rude about closing your bedroom door in a shared apartment. I don't know if this is a \"sorority\" thing but, presumably, when these girls want privacy they're closing their doors. The sister should feel free to do the same.", "Yeah, in my old house, once people moved out - then moved back - it was understood that if you left, your room was forfeit to any other enterprising sibling. It was the musical chairs of room assignments.\n\nWhile you might find a few boxes lingering in the back of the closet, the hangers with clothes where moved, the bureaus emptied, and your sheets may or may not be used - as they were owned by the house as a rule.", "LOL, after I moved out my mom started trying to clean out our attic and put piles upon piles of boxes and junk into my old room- to the point you could barely get the door open.\n\nIt's their house, their room, and I don't mind at all, but lord is it funny.", "Agreed. I took my older sisters room when she moved out. Hers was bigger and had an actual closet. She was irritated at first until my parents reminded her that my room was significantly smaller and it didn’t make sense to leave the bigger room empty. When I moved out most of my things were put in storage so the room could be used as a guest room. It’s the natural cycle of homes as people change their needs of the space.", "I agree with this but also that the person living there full time should get the larger room anyway. Move her stuff out, respectfully, and let her know that she has a room waiting for her whenever she stops by . . .", "[removed]", "> where Boomers and their parents hoard housing\n\nSorry, totally off topic, but this is bugging me, \"Boomers and their parents\".  How old do you think a Boomer is?  My parents are Boomers (born 1945-1964) and in their late 70s.  /Their/ parents aren't with us anymore.  Do people my age (40s) get referred to as Boomers?  That's....that's just really bizarre to me.  I see a huge difference between Boomers and Gen X.", "You're right omg, people are treating this as a black and white issue, what about expressing each other's feelings and understanding them more? I wouldn't lose a relationship with a sibling over a room", "Quite frankly, she doesn’t want to be involved. She did input her opinion that I should just let my younger sister have her way, (she said like oh she’s only going to be at the house for a couple of hours, just let her have her way — and then you can have the room again) but this input of opinion caused me and my sister to fight more. So after that she backed off.", "what a delusional take on the situation.", "I'm sure OP would happily clear out the smaller ro for her. They were even willing to share their bedroom with their sister.", "Yup. Did you come from a larger family too? There were ten of us after my mom and stepdad decided to live the Cheaper by the Dozen life, and nothing was sacred- even clothes were fair game. House rule was whoever did the laundry got dibs. When I moved out, I even helped my little sister paint my old room.", "Same with my kids.  One you moved out you got the left over room of you needed to come back", "Lol \"my\" room is now a guest bedroom/storage room/home office/walk-in closet. I don't complain, but I definitely make jokes about this room and it's many, many purposes.", "I am going to say her, as OP refers to younger sister and she belongs to a sorority,", "People seem to forget about the silent generation and Gen X quite a lot. I see a lot of people call Gen X boomers or millenials.", "I'm a millennial and I have seen kids refer to me as a boomer. I think it just means \"people older then me I don't like\"", "Boomer is a floating identifier, it seems.", "\"There is a housing crisis in every English-speaking country right now, where Boomers and their parents hoard housing\"\n\nI have a huge issue with this statement - how is owning your own house \"hoarding housing\", WTF???  Am I morally obligated to rent out my spare rooms to strangers?  I can't have a guest room for family members who come to visit?  Should I make them sleep on the floor?", "They're probably referring to the 60s end of that scale. My mom was born in 64, and her mom is still with us (although she's not in the best health)", "\"I asked my sister if I could have her room, she said 'you can't touch my stuff' so I moved in and now she's mad.\"\n\nThat's the situation.", "I think we are called \"Boomers\" when we are the lame parents/bosses/customers in the story, and \"Millennials\" when it comes to our 80s/90s pop culture.", "No, it's just the modern synonym for 'square' or similar.", "Especially since it is rental COMPANIES that are snatching up all available houses where I live and turning them into overpriced rental units.", "Yes, you should downgrade to a 1-2 bedroom condo the instant your kids move out.  Especially if it's in a nice school district with parks and other resources.  I mean, why do you need it?  Doesn't matter if you've invested decades into your home and have worked hard for all of it.  Get out! Make room!  /s", "Yep same.  My goodness it's not the fault of people who own their homes that there's a housing crisis.", "The fact that this is your response means you're not actively hoarding housing, congrats. Hoarding housing isn't about having your own house to live in, it's the general attitude that most boomers kept their \"starter\" 2 bedroom houses as vacation or rental homes as a free income instead of releasing the home back onto the market for the younger generations to buy after they upgraded to their absurd 4+ bedroom houses.", "Something feels weird about the 5-bed & a backyard neighborhoods filled mostly with older couples while young American families are stuck renting places too small for them.", "Doesn’t make it any less of a delusional take on the situation.", "Yeah, we, Gen X, are still the red-headed stepchild.", "This I totally agree with, the rental prices are ridiculous!  How is anyone supposed to save for a down payment with the cost of rentals.", "Hope this was sarcasm", "I know multiple people in their 30s who are doing this. I find it super weird. I’m not against holiday homes overall - but keeping your starter home as an investment / rental property feels rough.", " Kids move out of state and need a place to stay when visiting mom & dad.   \n The grandkids need a place to stay during the summer visits, Thanksgiving and Christmas gets crowded. \n\nThey worked hard all their lives to buy that home, made 50 years of happy memories in the family home, I don't find it weird or selfish that people don't want to just toss all that away to downsize just because the kids grew up and moved out.\n\nOur mom and dad needed us to move back in to care for them because they could no longer care for themselves, they were able to live out their final year surrounded by their happy memories.", "Sure, but it's not really \"hoarding\" to say that you want to stay in a place you bought and paid for (and are possibly still paying for). Especially when the housing market sucks for *everybody*.", "My dad felt weird about having a 5 bed house after kids had left and my mum died. He now has two refugees living with him! They are a father and teenage son - it’s super hard to find accommodation for men because a lot of women, or families with kids, would prefer other women or families.\n\nI’m sure he won’t do it forever, but it’s been nice."]}