{"id": 27610, "submission_id": "16rs8ca", "title": "AITA for blowing up on my boyfriend after his sister had a miscarriage?", "selftext": "So my boyfriend and I get hotels sometimes. Almost every time something comes up and he has to leave for hours with barely any updates or answers, and he takes my car. Last night he got a call that his sister was bleeding a lot and possibly miscarrying her baby. I heard her on the phone. I jump up and offer to drive him. He says ‘there’s no where to go’. He then wakes me up and hour or two later saying he wants me to drop him off to see his sister. I realize I’m not really sober and I was hella tired from work, so I told him just to take the car because that would be safer than me driving. Apparently he tried to update me but it wasn’t going through, he’s been having phone issues. But I blew up on him. I told him I understand this situation but every other one? And his sister should’ve had her husband there, in my opinion that I voiced. Like why wasn’t HE there? And also when I was in the ER a few months ago he ‘couldn’t make it’ when I was super sick with 10/10 pain and a burst ovarian cyst. \n\nSo, AITA? My friend says no, he obviously thinks I am, but I want more opinions.\n\nEDIT: won’t let be edit the title but I’m not actually sure if she had a miscarriage officially", "created_utc": 1695648784, "permalink": "/r/AmItheAsshole/comments/16rs8ca/aita_for_blowing_up_on_my_boyfriend_after_his/", "score": 53, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got angry at my boyfriend and the catalyst was his sisters possible miscarriage\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Your BF drops everything, including you, for his family.  However, he can't make time with you when you have an burst ovarian cyst.\n\nEvery time you get a hotel, he has to ditch you for some family emergency.\n\nFace the music, you'll never be as important  to him as his family.  Do with that information what you will.  NTA", "Info: why couldn't he make it when you were in the hospital?", "You are being played.   His emergencies are made up lies.   You can do better.", "You are very low on his list of priorities.\n\nhe disappears on you when you have plans. \n\nWhen you are sick he isn't there  bit he is for is sister.\n\nWhat are you actually getting out of this relationship?\n\nNTA", "ESH. The communication in this relationship sucks. It seems like you have this really bothersome history with him of feeling unsupported and like he kind of disappears repeatedly - that is super valid and should be addressed! But trying to criticize his attempts to support his sister during a crisis is going to be like the LEAST effective time to address the real need you have, which is that he leaves for hours at a time with your car. \n\nSeparate the situation with his sister entirely. Keep your nose out of whether he husband was there or not, etc. Bring up your concerns and issues relating to his lack of communication (again, OUTSIDE of the situation with his sister), disappearing for hours at a time, taking your car, etc. Assess if this relationship even has what you want.", "I think you might be the side chick.", "Uhhm. To this man, family always comes first, and it seems like it always will. You are put on the back burner and I believe that is what you saw recently. The very last person that I would call during a miscarriage would be my brother but that's me. It is strange that her husband was a no show for this traumatic experience but you didn't need to point that out for your boyfriend. I am sure that he recognized it too. Your timing is bad so ESH.", "Let me get this straight - he left you in the hospital alone when you had a medical emergency but dropped everything for his sister? I'd drop him. NTA", "NTA\n\nBut girl… you are the side chick….", "You can't rely on him for support when you need him, and he picks everyone and everything else over you. \n\nNTA but think about if he's really worth this. I've been in relationships like this before and it sucks.", "*<when I was in the ER a few months ago he ‘couldn’t make it’ when I was super sick with 10/10 pain and* ***a burst ovarian cyst****.>*\n\nNTA", "NTA If you didn’t hear the sister on the phone… I would have said that is very suspicious behaviour.\n\nTbh I would have dumped your boyfriend over the cyst. You deserve better.", "NTA\n\nWhy are you still with this AH", "I’m going with NTA. Seems like things got bottled up and that’s never healthy. More honest communication would probably go a long way.", "WOw, YTA.\n\nSeems like you want to dump on him for many things and opted to have it manifest at this particularly stressful and sad time for him/his family. Learn to communicate already.", "INFO Was he with you in the hotel when he got the call or not? Because you say he tried to update you but it wasn't going through...but you also said you offered to drive him when he first got the call, so presumably he was with her? I don't really get what's happening.", "NTA. And is even being truthful every time he takes off for hours on end with no communication? I seriously doubt it. Sounds  like he is cheating. Maybe not in this instance, but all the other times? Have u ever verified where he went the other times? And taking your car.. obviously you can't go anywhere and catch him if he has your car. Classic cheater M.O.", "NTA", "YTA.  You literally offered to drive him, and then told him he should take your car when he decided to go.  I realize it’s frustrating not to get updates, but it sounds like that was beyond his control.  To then pull a bait and switch where you communicate that it’s fine if he goes but then later use it as a launching point to vent months’ worth of pent up anger is really destructive to a relationship.", "YTA - obviously you shouldn’t have driven, but I couldn’t imagine letting my partner tackle a situation like that alone. Much less pass out drunk and miss the calls. \n\nDisregarding all semantics of the situation, you answered the question yourself. You blew up on him. So you’re faded, didn’t offer any support, missed calls, and then blew up on him?\n\nIf you reread how you wrote this out, it’s a series of you falling short, followed by how you justify it. The mistakes, they’re minimized. And on top of all that, you felt like you needed to drag in a scenario that is entirely separate from this situation to try and strengthen your ways of justifying it. \n\nIf you have to start pulling in incidents that are directly related to the situation, it’s a subconscious cue that you feel you le argument is weak. If you justification was good. You wouldn’t have to make a reach like that at the end.\n\nWith all that said, the relationship sounds pretty toxic, and I’m sure he handled things about as well as you did. Adults in healthy relationships don’t lose their temper and ‘blow up’ on each other \n\nYou’re probably both assholes, but going off what you gave us,  I can only confirm that YTA", "ESH\n\nStrictly in relation to the specific question you asked, you’re the A, because your timing is awful and your BF was doing the right thing by supporting his sister at a traumatic time for her.  Yes, her husband should have been there for her, but his failure to be there is not your BF’s fault, and you’ve lost any moral high ground you might have held by choosing this time to go off at him.\n\nWith all that said, your BF constantly disappearing on you in the middle of time you’d planned to spend together, with minimal contact and for hours at a time because “something came up”, is sketchy at best.  Unless he’s like, the CEO of a major business that demands his constant attention, this is the behaviour of someone who doesn’t care for you all that much and is up to something - he’s acting like a drug dealer, drug user, serial cheater, or some combination of the above [EDIT: or a caped crime-fighter - thanks waterwitch009].  Honestly your whole relationship sounds like a weird toxic mess and unless there’s some MAJOR context that explains him constantly abandoning you, then it’s probably time to move on.", "Yta- I think the part that really pisses me off about this thing is that you're upset that he went to support his sister. Complaining about the sisters husband. Like- that his sister. Soo what if her husband is t there, he's gonna support his sister is a terrible time.", "YTA.  Would you please point out how you *don't* think you're an asshole here?\n\nYour boyfriend is also an asshole for not supporting you in the ER and for disappearing when you're trying to have a night out together, but those are both separate issues.  In this specific instance, where his sister is having a major medical crisis and your boyfriend is trying to support her, he was doing the right thing and you were being an asshole.", "ESH\n\nI am sorry but a miscarriage or possible miscarriage isn't the same as a cyst. Playing the which is more important game is unfair to both you and sister.  \n\nIf he needs to rely on other people for him to be there for you when you need him then he doesn't deserve you. Also, hospitals still have phones that people can use so he had the ability to get in touch with you but chose not to look for a reliable way to do so. \n\nIf he can't be trusted to be responsible with the car the sad reality is that he shouldn't be allowed to use it. Which is ultimately just more unfairness to you. You aren't his parent and it's not your responsibility to be one but that's the position he is putting you in.", "YTA", "You both sound weird af. You both get 'hotels sometimes'? Often enough that his issues for disappearing affect your hotel time together? Are you guys homeless? Do you guys have your own home? Do you live with your parents?", "YTA for the question you actually asked.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo my boyfriend and I get hotels sometimes. Almost every time something comes up and he has to leave for hours with barely any updates or answers, and he takes my car. Last night he got a call that his sister was bleeding a lot and possibly miscarrying her baby. I heard her on the phone. I jump up and offer to drive him. He says ‘there’s no where to go’. He then wakes me up and hour or two later saying he wants me to drop him off to see his sister. I realize I’m not really sober and I was hella tired from work, so I told him just to take the car because that would be safer than me driving. Apparently he tried to update me but it wasn’t going through, he’s been having phone issues. But I blew up on him. I told him I understand this situation but every other one? And his sister should’ve had her husband there, in my opinion that I voiced. Like why wasn’t HE there? And also when I was in the ER a few months ago he ‘couldn’t make it’ when I was super sick with 10/10 pain and a burst ovarian cyst. \n\nSo, AITA? My friend says no, but I want more opinions.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. Read this over and over please. Your boyfriend will drop everything for his family but nothing for you.", "ESH", "Do we know if he's usually leaving to see his family? Other than this time where he supposedly went to see his sister, it just says that he disappears for hours at a time. Yet, when OP is hospitalized, he says that he \"can't make it\". That is absolutely absurd. \n\nHe's also telling her that he's \"having phone issues \" and his updates just aren't going through. But, that seems pretty suspicious, as well, esp since he's always taking her car, preventing her from being able to leave or confirm anything he's saying. \n\nI am curious if he is actually visiting his family, at all. When his sister called with an emergency, he sounds like he was pretty nonchalant about it. Then, hours later (and coincidentally once OP was asleep and no longer sober), he all of a sudden has to take her car to run out to see her? \n\nOP you are definitely NTA. Idk what your bf is doing when he disappears. But you may have blew up bc you have a gut feeling that he is lying to you. Whether this instance was legitimate or not, he was acting very dodgy, which seems to be a regular occurrence.  \n\nI hesitate to speculate on what he could hypothetically be hiding. Obviously, cheating, money, and drugs are pretty common secrets, but it could honestly be anything. You'd know better about what seems most likely. Just know that this shady behavior isn't something you should have to put up with. \n\nStop letting him use your car. Tell him that it's an auto insurance thing and that they told you that you aren't allowed to have anyone else drive the vehicle (which is probably true, unless you've added him to your policy).", "Because his sister, his only mode of transport besides me, wouldn’t take him", "I agree. Too many emergencies where your bf has to take your car and disappear for hours in the middle of the night.", "He makes her go to the hotel so he can bring his side piece into his house bc he doesn’t not want the side piece know she’s the side piece", "I think it’s a side chick.", "Seriously.  The number of emergencies in life where you have to leap up and drive somewhere while on vacation are incredibly rare.  Either his family is prone to fits of high drama and he enables them or something else is going on.", "scammers always have a bs excuse and it's your fault.\n\nalways", "Thank you for your honesty, this is actually very helpful", "I never said I want to dump him?", "He was with me at the hotel when he got the call. We only had one vehicle with us, mine", "Funny his calls go thru when it's not her trying to reach him", "I offered him support before I went to sleep the first time, he didn’t want it. And they didn’t want me there at the hospital", "And he was also drinking", "Maybe he’s Batman.", "I told him specifically that it wasn’t about tonight. Maybe my timing was bad, yes. I just sent him some text messages basically saying I don’t appreciate him leaving for 6 hours every single night we spend together.", "Are Ubers or taxis not a thing where you live? Or public transportation?", "I don't think you're an asshole at all, he is though. Did uber not exist? His sister not wanting to take him is honestly a pretty flimsy excuse, especially when he just dropped everything for her.", "lyft or uber will", "Uber anyone?\n\nPublic transportation anyone?\n\nFriends, family, neighbours, ANYONE?\n\nIf he really wanted to, he'd have found a way.\n\nALSO, is that the SAME sister he's rushing to and leaving you at the hotel for?\n\nShe didn't want to drive him to you, and you're lending your car so he can get to her?\n\n&#x200B;\n\nYou really need to communicate about all this with him.", "Sounds like he is dating the car. I am so sorry that he couldn't support OP in hospital though.", "Yeah I was super confused by the framing. “My boyfriend and I get hotels sometimes”? What does that mean? Definitely sounds like he needs her out of the way for something, could be another woman or some other illicit dealings he doesn’t want her involved in.", "I was thinking drugs.", "Sorry you didn't understand my comment: dump **ON** him.\n\nWhich is not the same thing as dumping him/breaking up.", "You should though. People think he has another girlfriend or a drug problem. Think about it. He receives the call, let's say the situation with his sister is true. You offer to drive him. He says no. When you're unable to drive, then he wants to go and does go. Then he's not able to keep in touch with you. \n\nNow think of all the other times it's happened.", "Girl. He has a gf and you are the side chick…", "Despite my response intended to highlight the actions that are making most people call you and asshole, you immediately did it again 😂 I honestly think this is soemthing important for you to hear, I hope you read this.\n\nSaying ‘he was also drinking’ is not relevant to this conversation at all. You asked if you were the asshole, right? By saying ‘he was drinking too’ you’re trying to imply that you’re less of an asshole, because he is one too. That’s not how things work. Jsut because he is an asshole, doesn’t make you any less of one. It’s pointless thing to say, because it doesn’t change anything about you.\n\nIf you guys both robbed a bank, you got caught, he didn’t. Saying ‘well he did it too’ woudknt mean they just let you go. They would just arrest him too, it wouldn’t change you situation at all. It jsut makes you a tattletale on top of Being an asshole. \n\nThat’s exactly what you just did, it’s just trying displace accountability for your actions. That tattle tale move is soemthifn you should have learned doesn’t work in like, middle school. It would serve you well to change how you handle things.\n\nBeing an asshole isn’t and end of the world thing. We are all assholes. It’s fine to be one. But like, own up to it. At least then your a honest asshole. Those people are dicks, but we tolerate them. What people don’t tolerate is an immature stubborn asshole.\n\nI can tell by how you wrote the post, that you’re not dumb. How you said ‘I blew up on him’, almost\nHad a dramatic emphasis on it. I know that you know, there was a better way to handle it. And if you knwk you coulda handled it better, there’s probably a little bit of guilt, knowing there was a better way than what you chose to do.\n\nJust own it.\n\nHe can still be an asshole that deserved it, but you can say ‘I coulda handled that better’ then it’s his turn to man up and own the things he coulda done better. That’s how you fix a situation, and going forward, now you know how to handle it. That’s growing up", "You told him to take your car even though he too was not sober? YTA.", "Thanks - edited", "Yeah your timing is what makes you the asshole.  Even if his sister and her unborn child end up being ok, hectoring your boyfriend while he's trying to comfort her is a major asshole move that makes you come off as unhinged and narcissistic.  It's totally reasonable to be upset your your boyfriend keeps disappearing when you planned to spend time together, but *not when there's an incredibly good reason for it*.", "They in fact are a thing here", "A side chick he's doing drugs with obviously", "Oh my bad", "I mean I thought HE was sober by then, I’m just a lightweight", "So his sister is not his only mode of transportation."]}