{"id": 27634, "submission_id": "16s4f14", "title": "AITA for getting my SIL to take my daughter to watch me race, given what was going on with her son?", "selftext": "One thing that was always important to me as a parent was my kids seeing sport as a desirable thing that they get to do. A big part of that is them seeing me and their father do sports and enjoy them. \nUnrelated to that, is that my sister in law's son (10M) is having some trouble with his weight and they can't convince him to exercise. It's been coming to a head recently as they just found out he's been skipping PE at school, and doing the bare minimum.\nMy husband and I had a half marathon race last weekend, and my MIL was booked in to bring our daughter (4F) along to watch. MIL then had a last minute emergency and couldn't do it, SIL very kindly offered to do the same. \nThe night before, SIL called to say that instead of waiting on part of the course to see us run by and the meet us at the finish, as she was also looking after her son (and the fact she thought it would be stressful with 2 kids) that they would do something else that morning and then meet us afterwards.\nAs I want my children to get exposure to sports events, I had to insist they watch the race and gave her my reasoning as SIL just didn't understand. Edit: I insisted that the plan with my daughter was to go to the race, and my brother could do it if she didn't want to anymore. She said it was fine and took the kids along, but I have now been told she's really upset that I'm rubbing in my parenting styles when she's going through a tough time of her own. \nI want it clear that I could not care less how she parents her kids, she's an amazing mum and I have zero opinion on what's going on with her son. I've never given her reason to think that either.\nAITA here, for (my angry MILs words) not being emphathetic when their family is going through a rough patch?\n\nEdit: I want to make it clear that I never have and never will force my kids to actually do sport. I'm just hoping my efforts mean that they want to do it by themselves, and not see it as a chore. I will be happy if they do enjoy moving their bodies for their health, and I will be happy if they end up not enjoying it, that's their choice.", "created_utc": 1695677049, "permalink": "/r/AmItheAsshole/comments/16s4f14/aita_for_getting_my_sil_to_take_my_daughter_to/", "score": 29, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole as I knew what was going on with their family, and could have just let it slide that one time.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA\n\nYour SIL was watching your child as a favor. I understand wanting to impart a positive association in your kids about sports. Surely, though, missing part of your race to have fun with her aunt and cousin wouldn't derail her entire development. It's not a huge deal, but insisting was a bit rude, considering you were receiving a favor.\n\nAdditionally. You may actually believe you aren't judging your sister in laws parenting but I highly doubt that's true from the tone of your post.", "YTA, but this has nothing to do with your parenting skills or her son. \n\nYTA because your SIL jumped in last minute to help you, and your priority was not to at least try to minimize the stress on her, but instead contribute to it due to your ideals. \n\nI think you owe her an apology and a coupon to a really nice day spa nearby with the offer to watch her son, so she can relax.", "YTA\n\nShe’s doing you a favour and you put her in a position she wasn’t comfortable in, she suggested a reasonable alternative to accommodate everyone (while still doing YOU a favour), but you shot her down so….a four year old could watch strangers running in a group waiting for her parents to wave as they passed by?\n\nSomehow I don’t think standing on the sidelines watching people run is going to inspire any 4 year old. \n\nIf you want to impart exercise ideals on your child, try doing something that involves them in actual activity. Kids watching sweaty strangers running without purpose is not exactly an inspiring activity.", "YTA. She’s doing you a big favor and not seeing you in one race is not going to undo all the other times your kid has seen you be physically active.", "YTA\n\nYour sister in law was doing you a favor, watching your daughter. You might try acting like it.", "YTA, frankly you sound rather narcissistic; why must YOU be watched, and observed at all times?", "Yta. \nShe’s 4. I was dragged to “watch” my dad and step mum do triathlons all through my childhood. I promise you, I wasn’t watching them, I was bored stupid. We know you run and compete. Seeing you at the finish line is a great compromise. My husband does ultra marathons. The only one our kids went to was his first one, and we spent the day at the lake before going to the finish line. She’s doing you a favour ffs", "YTA\n\nYour SIL was doing you and your husband a favour by looking after your daughter.\n\nYTA for demanding she does what you want to do, with her free time. You had no consideration for how much you were inconveniencing her, when she was doing you a favour.\n\nIt really does sound like you were rubbingyour parenting style in her face.\n\n\nIn future, if someone does you a favour, say \"thank you\" and be grateful that neither you or your husband had to cancel your run.\n\nYou've probably burnt a bridge there. I can't imagine your SIL ever volunteering to babysit for you again.", "Your daughter is 4, I recommend mommy daughter sports. There's classes out there and otherwise online vids. Immersion tends to work better. Enjoy! As for the OP NTA", "There are a few things I didn't quite understand.\n\nFirstly, if her son is overweight, I don't see what that has to do with him being a spectator in a sport, it's supposed to be a fun activity for a child. If SIL doesn't like to bring her son along, or if he's uncomfortable about coming along, it points to a much more serious problem : how the hell did they manage to get this child to have such a poor relationship with his body, and for a fun activity to lead him back to weight problems. Your SIL shouldn't relate everything to her son's weight, it's very unhealthy for both him and her.\n\nMy second point is that your SIL said she found it stressful to have to manage two children. I understand her and I think you shouldn't have insisted, she's already doing you a favor by looking after your daughter and agreeing to come, you forced her to do something she wasn't comfortable with and now you're surprised she's upset.\n\nYTA", "YTA for insisting on your SIL take your daughter. It inconvenienced her and it's actually very odd that you feel so strongly that a 4 year old absolutely can not miss an opportunity to watch you run by them in a race. It all sounds forceful and toxic to me. I'm a runner,  my daughter comes along in the stroller with us for 5 km runs all the time. This weekend we did a 10km at a very busy event.  We could have taken her as a \"family experience \" but she would have felt overwhelmed.  So we left her with our in-laws. Life it about balance and reasonable expectations. You are not role-modeling that well at all.", "NTA everyone here seems to be skipping over you offering SIL an out of something she OFFERED to do by saying your brother could bring your child.", "Yta.", "I say NTA. \n\nYou had a specific plan in place to have the kids brought to the race. It's no different than if she had promised to take them to a restaurant or the park and bailed at the last minute because it was \"too much\". \n\nShe had the right to do so, since she's the one watching them, but you, as the parent, have a right to have your plans followed through. Her trouble with her kid is her own thing, it has nothing to do with you. However, if all this seems too much for her, then I would avoid asking her to watch them in the future.\n\nAnd to all those saying she's \"nitpicking\" about free babysitting, it's not about that. She didn't just want someone to babysit, she wanted someone to take her kids to the race. If she can't do the thing they agreed upon (again, not saying that's SIL fault, just an unfortunate fact) then they have the right to find a new babysitter who can follow through.\n\nAlso, your bad childhoods do not mean that her children feel the same way. Don't assume you know their home life. Everyone (and therefore, every child) is different (just like some kids feel forced to go to church and others actually enjoy it).", "NTA. She offered, you said no to her wanting to change the plan AND told her that someone else was willing to do it if she didn’t want to. You did nothing wrong. Wtf is with all the y t a? It’s not the woman had no choice.", "Holy sh*t you’re not the asshole.  Please don’t think you are despite the resounding amounts of votes that say otherwise.  You asked for a favor and someone obliged, that was the deal.  Additionally, seeing some healthy activity would be good for your nephew, whether you’re judging him or not.  Furthermore, your own child is statistically proven to be more likely to lead a healthy and active lifestyle when witnessing a parent lead by example; those odds increase almost 30% when both parents are active.  Please visit r/running or r/ultrarunning to see the studies and discuss the positive aspects of sport.  Lastly, if someone kept my child, or anyone special frankly, from seeing me at a big event like you described, I’d be livid. Your family puts in just as much work during training as you do, even if they’re not running - and most people don’t get that.  They deserve to relish in your success just as much as you.  They’re the lazy asshole, not you.   NTA", "YTA", "YTA", "YTA.  Hope she learned her lesson about helping you out.", "YTA...SIL is doing you a favor but you have the nerve to insist how that favor is done, lady you're extra.", "NAH\n\n&#x200B;\n\nSIL had the option of saying NO and she did not. So everything is fine.", "Well, NTA I guess. Imo you’re a healthy example for her kid and perhaps he should be watching too. I strongly dislike parents who subject their offspring to obesity so I might be a little biased.", "NTA her fat kid needs to run and see how it’s done.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOne thing that was always important to me as a parent was my kids seeing sport as a desirable thing that they get to do. A big part of that is them seeing me and their father do sports and enjoy them. \nUnrelated to that, is that my sister in law's son is having some trouble with his weight and they can't convince him to exercise. It's been coming to a head recently as they just found out he's been skipping PE at school, and doing the bare minimum.\nMy husband and I had a half marathon race last weekend, and my MIL was booked in to bring our kids along to watch. MIL then had a last minute emergency and couldn't do it, SIL very kindly offered to do the same. \nThe night before, SIL called to say that instead of waiting on part of the course to see us run by and the meet us at the finish, as she was also looking after her son (and the fact she thought it would be stressful with 2 kids) that they would do something else that morning and then meet us afterwards.\nAs I want my children to get exposure to sports events, I had to insist they watch the race and gave her my reasoning as SIL just didn't understand. She agreed and took the kids along, but I have now been told she's really upset that I'm rubbing in my parenting styles when she's going through a tough time of her own. \nI want it clear that I could not care less how she parents her kids, she's an amazing mum and I have zero opinion on what's going on with her son. I've never given her reason to think that either.\nAITA here, for (my angry MILs words) not being emphathetic when their family is going through a rough patch?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "INFO: is this the same brother married to your SIL?  Did you ask him?  If either your kid or her kid are a handful it may require both parents on deck or maybe he really needed a day off.", "INFO: does your daughter seem like she enjoys watching you race? Does she have fun?\n\nIf she does seem to enjoy being part of the atmosphere and see you finish a race, N-T-A because you did give your SIL an out by saying your brother could take your daughter instead.\n\nIf you daughter doesn't care, is oblivious to the event or is bored at sporting events, Y-T-A. You could give your daughter and SIL a break.", "I am going to defend you a bit OP but don't get your hopes up, I still vote YTA.\n\nA race CAN be a very fun and exciting time for a 4-year old. I have cheered friends at dozens of races and in some cases have been there with their young children. We yell and scream at random people. We have cowbells that they can shake to their heart's content. It is exciting for them when they finally get to see their parents. So it is OK to want your kids to see you race.\n\nBut guess what OP... life happened and things didn't go the way you wanted. Your SIL jumped in at the last minute to help you so just suck it up.", "YTA. The kid is 4 get over yourself", "NTA\nWhen she wanted to change the plan you offered to have someone else do it. She declined and then is mad about it. That’s on her.", "I’d say NTA because SIL offered to do bring OP’s daughter to watch her race. She then thought it would be too much. OP wanted to stick to her plan and her brother could take her child to go watch her race instead. SIL reconsidered and went to do it anyway and then is upset over it. I mean I wouldn’t offer to babysit a child in a specific way if I didn’t want to do it that way.", ">Somehow I don’t think standing on the sidelines watching people run is going to inspire any 4 year old.  \n>  \n>If you want to impart exercise ideals on your child, try doing something that involves them in actual activity. Kids watching sweaty strangers running without purpose is not exactly an inspiring activity.\n\nThis is my take too. Wouldn't you play games and do activities with the kids if you want to teach them that being active is fun? \n\nOP is framing this as a thing that's being done for the kid's future but it's really just all about OP having people support him at his race. Which is fine, but I don't think OP should act like they're God's gift to the human race for being athletic. \n\nYTA for being obnoxious about running OP, your family is happy to support you but you need an ego check. Actually do a fun activity with your nephew if you want to encourage him to be more active, play some football or go swimming. Don't expect the family to just bask in your athletic aura and be magically as into fitness as you are.", "OP just wants the accolades and attention. And apparently has no idea that a 4 year old is not going to become Sporty Spice from watching her parents do sports.", "I get why it come across as that, but I more wanted her to see the race a whole, and me and everyone else having a good time (overall!)\nI wasn't raised this way and it took me ages to embrace sports. I saw them as a punishment. And we don't compete in mass races often due to lack of time to train and race, so this was a one off. \nI also believe thats kids absorb so much when they're young.", "She kindly offered to look after our daughter, and we specifically the plans were to take her to the race and then see us afterwards. My brother would have done it if she didn't want to do that - she asked once if they could do something different, I said I'd rather the went to the race, otherwise my brother could do it, and she said that it was fine to carry on with the plan.", "This needs to be so much higher! Did the story get edited or did everyone miss that part? I'm so confused by all the Y T A votes.\n\nNTA", "Did you miss the part where when SIL kinda hesitated, OP insisted", "She tried to say no and OP still insisted.", "I couldn't wrap my head around how it's supposed to be educational and inspirational for a four year old to watch a race. BORING! It's like being the parent standing next to the merry-go-round waving every minute or so when your kid comes around yet again, which is still more fun than standing surrounded by strangers watching people huff and puff and sweat as they go by (and also, I am not a fan of bringing preschoolers to crowded public events. It's really hard to keep track of small kids in crowds - especially if they aren't yours).\n\nGoing to the science museum and seeing the science of the schoolyard? Absolutely FUN. Going to the park. Going on walks in the woods with someone who knows about the local flora and fauna and maybe a story or two? FUN Apple picking? Fun!", "Do you think you’re maybe swinging things a bit far the other way then? Because as a kid who was forced to spend my weekends at marathons and triathlons, I became extremely resentful of it all.", "I don’t think anything is happening at a half marathon that’s going to make a 4 year old see that as fun? I say this as someone who has never done a marathon but used to run cross country and has done 5 and 10ks….nothing about it is going to look like a good time to a 4 year old.", "I know a lot of people who enjoy physical activity but get bored watching it. And frankly marathons bore me to watch. They aren’t n interesting spectator sport. \nForcing a four year old to stand around and not participate or be able to do anything is nothing like encouraging them to do sport. If it was just being there to see you cross the finish line then that would be different. \nWhat activities do you do with your child? If you normalising doing something together - age appropriate - such as playing chase, throwing a ball, playing in the water, that’s going to do more than having her stand there watching you do something while all she an do is watch. \n\nAnd expecting your SIL to wrangle two kids with nothing to do except wait for you to finish and apparently tell you hiw fun that was, is really selfish.", "Your child is going to observe how you inconvenienced others for your beliefs. You can roll-model healthy and fun physical activity in so many ways. You didn't have to double down on this instance.  You just wanted to find another reason to show off the fact that you did do a race.", "Your idea is fine. The key is you “wanted” your daughter there. You had a childcare crisis. When someone helps you in a tough situation, you say thank you. You don’t make demands. There will be other races. \n\nI vote soft YTA. I vote this way because if I were SIL, I’d have told you I’d keep the child, but would not attend the race due to family issues that were my priority.", "I think you're going to get a wave of YTA because you didn't specify that in your post, you just said you insisted and it looks like she did it reluctantly.", "Yes, she KINDLY OFFERED.  Don't expect it to happen again.", "OP told her SIL that her brother could take the daughter to the race if she didn't want to. The SIL could have let that happen if she really didn't want to come to the race. OP wanted her daughter there but did NOT insist that her SIL be the one that do it. She gave her an out after SIL changed plans she'd already agreed to.", "It can be LOTS of fun for kids, if you set the right example for them. Give them noise makers, do lots of screaming and cheering, they'll have a blast."]}