{"id": 27663, "submission_id": "16su9ta", "title": "AITA for refusing to give half the money I will give my parents to my ILs?", "selftext": "2 years ago, I suffered an accident at work and recently reached an agreement with the company, it was a huge amount. For example purposes and to make it clear that these are not the real values.\n\nI received 100k, I decided to divide it as follows: 30K for me, 30K for my wife, 25K for emergencies and 15k for my parents.\n\nI am the main breadwinner at home and my wife and I split the bills 25/75 (I don't know if this is important).\n\nWell, my wife wants me to divide the money I'm going to give to my parents in half and share it with my ILs, because it's money that would help them too.\n\nI refused, saying that this is money that is up to me to decide how to use it and that if she wants to help her parents, she is free to use hers as she wants.\n\nTo be clear, her parents are financially stable and my parents have absurd expenses because my father has several health problems and basically this money would cover a year or two of his medicines, they are struggling financially even with my help monthly.\n\nShe said that this money should be a joint decision and that I was being selfish in deciding its destination without listening to her.\n\nReddit, AITA?\n\nExtra: She and I are financially stable, childless and this money is not needed to pay our expenses, so it will be used for other things", "created_utc": 1695749514, "permalink": "/r/AmItheAsshole/comments/16su9ta/aita_for_refusing_to_give_half_the_money_i_will/", "score": 3080, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1 Refusing to give half the money I will give my parents to my ILs\n2. My wife said that this money should be a joint decision and that I was being selfish in deciding its destination without listening to her.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but as a former insurance adjuster, I would assume that if you're not committing insurance fraud, but getting a large settlement, that you actually have some kind of substantial injuries which might require some kind of follow up care in the future - even if it doesn't seem like it now. In most cases, this is a final settlement - you're not getting more regardless of what might develop in the future. \n\nMy vote? Don't give *any* of it away. Do the smart thing and put it in a savings / investment account.", "You were hurt at work.  Has it affected your ability to work? Will it in the future?  What are you going to do if you are forced into early retirement and you’ve spent all the money?  I know multiple people who blew a settlement and now live in poverty as a result.  You have to think long term.", "NTA, but I wouldn’t give any funds away. If this was a work accident, then only give funds to people who helped you during your injury or illness to make them whole. It’s not a windfall, it is a settlement. I’d tuck that away for your medical expenses or to make up for loss in wages. If you mingle it with your spouse’s money, then those are community funds and they can do what they want with those funds. Put it into a separate account and transfer when your family needs it.", "NTA\n\n>2 years ago, I suffered an accident at work and recently reached an agreement with the company, it was a huge amount.\n\n>She said that this money should be a joint decision and that I was being selfish in deciding its destination without listening to her.\n\nYou were right injured. It's your settlement. It's  your money. You may disburse it as you chose.", "NTA - she has 30k for essentially no reason. She didnt suffer any accident so she can use that 30k to help our her parents. Why is that your problem?", "INFO\n\nWhy are you splitting the money at all?  It was awarded for you to help ***YOU***.", "YTA to yourself.\n\nThat is blood money, not fun money. It's money to make up for your lost earning potential and any potential hospital bills as a result of that accident.\n\nI hope for your sake you have thought about your long term financial position, including your new extra costs and loss of earning potential.", "YTA for not keeping the money for future necessities, health care or income supplementation against possible later effects of your injuries.", "OP,  you do realise why you got such a large settlement?  Most of it will be due to the cost of medical care, whether that be past, current, or future.  There may be an aspect of the money given for suffering, but 98% is likely to be for medical bills.\n\n&#x200B;\n\nBe very aware that you may have some huge bills ion the future.  How will you pay for them, if you have given your money away?", "Maybe not an AH, but an idiot for giving away money that is allotted to you because you may NEED it in YOUR future.   Please read ALL these comments.", "NTA\n\nIt's *your* settlement money and you're already being very generous with it.", "NTA\n\nI think it is fair for you to make the call on how to distribute the money.  The flip side is that as a married couple, one view is that the money is equally both of your and she should have equal say so it's arguable though.\n\nI think the fact that her parents are financially stable and your parent are struggling with medical expenses should be a big factor in deciding.", "NTA. Stop right now. Keep it all for yourself. Who was in the accident? You were.\n\nWas your wife? \nYour parents? \nYour in-laws?\n\nWhy do these beggars have their hands out?\n\nYou're getting ripped off. \n\nTell your wife to share her portion with her parents.", "NTA. WTF? You didn’t win the lottery, you were injured on the job. That money is intended for you and only you. How are you going to pay for your medical bills if this injury flares up again in the future? Personally, I’d invest it and put it aside. Why do any of your relatives think they’re entitled to your injury settlement? Sheesh.", "This money was for a personal injury. It was given to you. You may distribute it as you wish. I'm shocked and amazed that your wife would even consider asking you to share some of it with her parents! I'm even MORE shocked and amazed that she thinks it's ok to do so and thinks it should be a joint decision! \n\nNTA", "That money is supposed to be for your expenses", "Don’t give any of it away.  Can you still work and earn a comparable income to what you previously earned?", "Your money is for your Healthcare, its not frivolous spending money for the wife and family. I agree with other comments, you didn't win the lotto, you should be saving that money.", "NTA.  As you said, she’s free to give then her share.", "As long as your wife is trying to give away your money on the grounds that it would help other people, could she also give me some? It would definitely help me.\n\nNTA", "This isn't a lottery win. Put it away for future medical expenses.", "NTA. I assume this settlement was between you and the company not you, your wife and the company? If so, then you can split it up however you want.  Since it sounds like you and your spouse do not share money to start with, this would count as \"your\" money. If you share finances as a married couple, then I'd say she has more of an argument about how it's spent.", "NTA I don’t see why you would randomly give them money.\n\nI would tell my SIL no if he tried to give me money", "NTA. I don't understand why you're only putting 25k in an emergency fund... in the grand scheme of life that's not a ton. That part aside, money given to extended family should be based on need not on \"fair.\" They aren't your children. You aren't responsible for them. Your wife's parents expecting just because they want it money is asinine. No.", "Hey, have you heard of investment? It's this thing where instead of spending money you save it towards the future. You could buy a house and put it up for rent, or buy indexed funds, and then you can use the moeny in the future. For example you could retire earlier.\n\nIt's great thatyou want to support your family. But you're probably not helping anyone by giving your dad money. For some health issues social medicare will first make sure you have no assets before they help you. So it may make more financial sense to not help them with medical needs for now, invest that money, ensure a suitable lifestyle, so medicare kicks in sooner.", "INFO: Why are giving away your settlement? That's supposed to be used for your care for your lifetime. You don't get to go back and get more if your condition worsens. You should put that money away and not use it until you need it.", "NTA- the fact you are splitting it to anyone is more than you have to do.", "Info. It was a lot of money you say. I think it’s a fair assumption that if the money is substantial so was the impact of the accident. How much did this affect your family?", "NTA: Generous enough to be splitting it at all", "NTA. Your parents seem to have actual need rather than a superfluous gift it seems it would be for the ILs", "NTA. This money is as a result of an injury that happened to you, not her, and covers off both compensation for your loss/injury, as well as cost of care (past and future). Your ILs have nothing to do with this. It’s not a windfall for them. \n\nWhile your wife could provide input on how the money is divided/spent, this isn’t matrimonial money (until you mix it into your shared bank account).", "Tell your wife to give a portion of her share to her parents. NTA.", "NTA. She can give her parents money out of her own share.", "NTA - if she wants her parents to get money she can give them some of hers. \n\nDid you remind her of your father's medical costs? And point out how they actually NEED the money rather than how it would just be nice to have the money. Either way, your money your choice.", "NTA\n\nIt sounds like you have sufficient resources for yourself and her parents are also not in need. This accident happened to YOU, you suffered because of it and have this renumeration because of what you went through. You should decide what is to be done with it. Your wife's parents don't even enter the picture.", "Everyone is treating this like a straight work comp claim. We don't know if that is the case. \n\nIt could be a wc/negligence case. A wc only case would only provide money for future medical. A negligence claim provides pain & suffering and emotional distress. \n\nExample - one employee leaves a stack of 2x4s (or books, or files, or a trash can) on the ground. Other employees complain about almost falling over them. The boss does nothing to stop it. Then an employee does fall, down a flight of stairs, and breaks both legs. \n\nThe broken legs can be paid through work comp. Future medical would come from work comp. The pain and suffering, and emotional distress suffered from being immobile for 4 months comes from general liability insurance, not the work comp! This is repayment for having the injuries in the first place. \n\nOp does not need to save the money if it is not for future medical. \n\nBut I also think her demand that he give some to her parents is asking a lot, specially when he is the one that suffered. And they do not need it. \n\nIn the long run, the money comes from both of them, it is not just ops because they are married. She is right to say he should discuss what to do with it. \n\nIf it were her parents that needed the help, would op still help them, and not his own parents? That question would need to be answered in order for me to judge fairly. \n\nIf op is a ass for anything, it is for not using the money for something desired by both him and his wife. Sure, it would be nice to have $30Gs to spend however you want. But a nice vacation for two weeks is also good. A new car, a new pool in the yard, or an rv would be nice too. Better your life with the money. \n\nNot sure why, but I just get the impression that op has been eyeing a Rolex, or other status symbol, and wants the $30Gs to but it without feeling guilty. Hence the \"giving\" to all that are important to him.", "Are you Filipino by any chance? Only Pinoy will behave this way. I mean, giving away money like you won’t need it in the future. And also, your wife’s attitude on this.\n\n-I’m Filipino.", "NTA", "I suppose this depends on your relationship. If you are married with shared assets the money is very likely *not* yours. It belongs to both of you. If that's the case you should have consulted with her.\n\nIf you are not married or have a prenup that prevents these kind of income to be counted as shared assets, the money is all yours and you can do whatever you want with it.\n\nConsidering you wrote that you gave 30k to your wife I'm going to assume you are not in a shared assets marriage. That would make you NTA.", "ESH There's an old saying: \"Happy wife, happy life\". Tell your wife you'll donate $5k of your $30k to her parents, if she'll do the same. Really, I agree with you: your injury, your job, your payment, your decision. However, she is your wife, and in a divorce, she'd probably get at least half. Make a gesture, it won't kill you, and hopefully it will make her happy. If she's not willing to give up some to help her own parents, THEN you can say, \"hey, I offered\".", "NTA.  Have her give it out of the money you're giving to her.", "YTA\n\nYou really should be putting all of this into an investment account.  However, you're married and $$$ decisions are joint decisions.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n2 years ago, I suffered an accident at work and recently reached an agreement with the company, it was a huge amount. For example purposes and to make it clear that these are not the real values.\r  \n\r  \nI received 100k, I decided to divide it as follows: 30K for me, 30K for my wife, 25K for emergencies and 15k for my parents.\r  \n\r  \nI am the main breadwinner at home and my wife and I split the bills 25/75 (I don't know if this is important).\r  \n\r  \nWell, my wife wants me to divide the money I'm going to give to my parents in half and share it with my ILs, because it's money that would help them too.\r  \n\r  \nI refused, saying that this is money that is up to me to decide how to use it and that if she wants to help her parents, she is free to use hers as she wants.\r  \n\r  \nTo be clear, her parents are financially stable and my parents have absurd expenses because my father has several health problems and basically this money would cover a year or two of his medicines, they are struggling financially even with my help monthly.\r  \n\r  \nShe said that this money should be a joint decision and that I was being selfish in deciding its destination without listening to her.\r  \n\r  \nReddit, AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA and she’s correct. When you are MARRIED then decisions like that should be made together. I would personally tell her to take 15k of hers and give it to her parents. It’s weird though that you’re married and didn’t say “we keep 60%” instead of dividing it between you. It sounds like there’s more issues at hand", "[deleted]", "I can't quite tell if YTA or NTA. This seems like a more complex problem. It seems odd to me that a married couple needs to split the money in such a way to begin with, so it make me lean to YTA, because you are keeping track of what your wife brings in financially. NTA to give your parents more because they are in greater need, but that should be something your wife knows and YTA to withhold any, of what seems like a windfall, from your wife's parents if she thinks they should get something as well. You don't \"take from her cut\" so to speak. The money is both of yours. An accident doesn't mean it's \"earned\". That is essential to marriage. If anything, your wife should be able to use the shared money. The emergency fund is taken from the top. Whatever you give is taken from both. There should be no keeping score when it comes to this", "You’re married. It’s half her money, no matter how you “earned” it. Tread lightly or she might get a little more than half.", "NTA It is not a joint decision.  It is your decision because it is your pain and suffering money. Your parents are in pain and suffering, therefore it is appropriate to share it with them. She needs to sit down. This is NOT a joint decision.", "NTA, it's insane she getting any of the money. She lives with you and will see some benefits. There is no reason she can't give some to her parents if they need the help.", "NTA ....and my oh my....what a 'wife' you have....", "NTA.", "Nta It’s your Pain that allowed this money to come into your pockets. But if she so badly wants to help her parents and since it’s both your money take out half of hers and give it to her parents.", "NTA\n\nOp, you were the one injured and awarded the money, you're giving her 30k, so if she is that concerned about her parents I would tell her to give them a part of her payment.", "Nta", "NTA. It's your money, and you decide how to share it. It is very generous of you to want to share it. Your wife is funny. She wants you to give your parents less to give her parents some, but she didn't consider sharing her amount with them instead. If she wants to be generous with her parents, she can do it with her own money.", "NTA.  She can give some of her share to her parents.  She is not free to decide what you should do with your share.", "NTA. I was going to vote N A H until she started in with the name calling. If she just asked if you could help her parents out and accepted the no, it would be fine, but she’s being a jerk about it now. \n\nYour money, your decision what to do with it. You don’t even have to share it with your own parents if you don’t want to.\n\nWhile I agree your wife has a right to have a discussion about such a large sum and be included in conversations about how it will be used, she doesn’t get to make the ultimate decision.", "NTA, tell her if she feels that way then all of the bills need to be split 50/50.", "NTA. It does sound like maybe she has told her parents that you will be giving them money and didn't expect you to be opposed to it.", "NtA", "Why are you giving any to the parents at all?", "NTA - but as others have said, if you and your wife have separate finances and this is intended to help with your medical bills as a result of your workplace injury, I wouldn't even share any with your wife.  Put that whole amount in your emergency fund, invest it in a CDs or something.  If your parents are really struggling, they are the only ones who should benefit and you should make it clear this is a one time windfall", "Nta. Your money your choice.", "NTA if she wants to give her family money  it can come from her share.", "As others have said. Ease your wife’s anguish and tell her you’re keeping it all. You need that long term. Save it all. God willing, you won’t need it for health purposes and down the road you’ll have a helluva lot more than your $100K or whatever the actual sum is. \n\nOtherwise, it’s your money. You suffered the accident. No one else is entitled to one thin dime.", "NTA you’re giving her money, she can give some to them. That’s the most logical thing instead of expecting you to be the gifter for some reason.", "Nope. This is *your* money because of an accident *you* suffered.  It's not just \"Oh, boy! Free money!\" \n\nTypically I would say money decisions should be shared between spouses.  But in a case such as this or an inheritance, that is not so.  You suffered the injury(ies) and you get to be the sole decider as to what you do with it.  It's not a lottery win and it is not a joint decision, as your wife seems to think.  She is wrong.  You are NTA.", "NTA tell her if she wants this money to be a joint decision she needs to get hurt like you did.", "I would advise you to keep it all. It's kinda noble you want to share the sig sum you gst, but this money isn't a lottery win. It's money that is supposed to pay for current and future costs that come up becajse of your accident at work, be it physical or mental health, accomodating resulting disabilities etc. So unless you committed insurance fraus you need the money for yourself, even if you can't see it right now and you won't get more money later on if your health declines later in life as a result of the work accident.", "NTA. She can split her share with her parents.", "NTA I can see your wife's point but, you dad has medical issues, and that money would help them a great deal. The money needs to go  to your parents", "NTA. First of all you're being taken advantage of as is. Secondly that is your money, it isn't up to your wife how you spend a single dollar of it. She should feel lucky you're even given her a cut. I'd be taken aback if my generosity was met with greed and entitlement.", "The whole amount you are getting is money for the marriage. You and your wife decide where it goes. That being said, if your IL dont need the money and your parents do, then your parents should get it just because of need alone.", "Im sorry but don’t be dumb. Why on earth are you splitting this money? This is for your health now and future. This was your accident, not your wife’s. She not entitled to it and she’s also acting entitled. It’s def def def not her parents money. I do understand you want to help your parents and you should. So buy your dad his medication. But that’s it. The rest you need to save or invest. Do the right thing for yourself! If down the line your wife needs some money for her health, by all means help her. But do not give her a chunk of it. Be smart! Good luck!", "YTA This money should all be for you.  If you use some of it to help your family cover medical expenses fine but this is not the intent of the injury award.", "Info:  When you suffered the accident, how much did she support you?  Did she make sacrifices?  While yes, it's yours, that may be something to take into account.  Ultimately I tend to believe in distributing based more on need, so it sounds like your parents are the better call ultimately.", "NTA\n\nPerhaps you keep it in an account that is not co-mingled.\n\nAlso don't give money to your parents if you don't want money to go to her parents.\n\nI would just keep all of the money for emergencies/future health care", "NTA - but this isn't the lottery, its an award for injuries received. Why are you handing this case out like its a gift. It's not a gift. You should be saving it. It's also odd that you specifically say you get some and your wife gets a separate amount. I It really seems like you should rethink all of this and save this cash for future health issues that could occur.", "NTA your wife is being greedy", "What happens when you need that money for a health reason in say 10 years time? You literally just gave all the money away that is supposed to help, or did you suffer a limb loss then there is no health issues that could pop up ?", "NTA.  15K for your wife 15K for her family.  Now she'll be happy since everyone got the same amount.  You're being generous to not put it all aside for you in case the accident has lasting effects.", "NTA, but you should not be giving any of this money away. It's not party money, it's money to compensate you for injuries. After watching a very close family friend pass away a substantial settlement only to have effects of his accident interfere with his ability to work. He really could have used that money for bills.", "It's your injury, you're money.  Since you seem to have separate finances, it isn't her concern at all, IMHO.  You could, but especially since they are stable financially, I think it's far from necessary.  Now if you combined your resources, it would be different, perhaps.  Honestly, I think splitting it with your wife and family is generous.  She's getting as much as you.  She can share her windfall if she feels strongly about it.", "NTA but you should save your money for future medical expenses. Your wife doesn't get to decide how to allocate your personal settlement", "Maybe 1/2 and 1/2. \n\nYes, the money is yours, but in a marriage everything is shared equally. This would mean she would have a say so in the finances. However, I would not downgrade the amount you are providing your parents.", "That is your money to compensate you for the trauma you suffered.\n\nI don't understand why you are giving it away. It's not a lottery win. It is compensation.\n\nWhat if your circumstances change? E.g. you could be sacked, you could develop health problems either as a result of the accident or simply through aging. (Last applies to your wife as well)\n\nWhat if your wife blows her gift from you on luxury items,  a new car or new furniture and then develops a life threatening illness?\n\nWhat if you both require carers and live to a very grand age?\n\nIt is lovely that you can help your parents with their medication costs but do they need 15%?\n\nNTA", "NTA \n\nBut you're stupid for giving any of it away. BTW, there's a limit on the money gift size you can give any one person before Uncle Sam gets involved...", "The money is for current and future medical expenses it isn’t a windfall.  You may find yourself 10 years from now suffering after affects of the injury.  It’s not hitting the lottery.", "Regardless, money is yours you don’t have give a penny to anyone you being generous by sharing.", "NTA for not giving it to the ILs.\n\nI would seek financial advice as what you got is not the lottery. I have encountered quite a few people who have splurged their accident payouts and then are in a position of having no money to cover their care. If you’re permanently not able to work at the same capacity as before then think about your future.", "She can split her half and give them to her parents. It’s your money that you got for YOUR accident that YOU suffered from. You were generous enough to even give her a cut.", "NTA, this is your money that you received due to your work accident. Why does you wife think her parents are entitled to this money ? Did they help you while you were injured? \nIf your wife has an issue with this I would honestly use her portion of the money for your ILs.", "NTA. Keep the money please. ALL of it.  \nIf that money was received due to some health issues resulting from company, you might need it in the future. For yourself.   \nIt IS indeed your money, none has a say in it - but tbf if that's an issue with your wife although she knows the situation, I'd just store and lock it somewhere.", "Nta YOU were the one in an accident, you should decide how to use the money.", "Yta for giving your money away when you don’t know what the future holds and the medical care you might need in the future due to this accident.", "She’s greedy af. Tell her to use her portion you gifted to her parents.", "YTA\n\nThe settlement is for your future and benefit.  Why are you giving the money away?  Are you so sure you will have no lasting effects from your accident you may not need that money in the future?\n\nYou really should think about this as what it is and not just some short-term windfall.  Do you REALLY think $25k is enough for emergencies?  What happens if one of you becomes unemployed?  You need a new roof on your home?  You lose your medical insurance?  \n\nVery short sighted toward your wife and yourself.", "Give zero to parents", "Do not give any of it away! For insurance purposes.", "NTA. Your wife can give a portion of her money to her parents if she wants. \n\nIt’s your money from a work injury that you went through. You can do whatever you want with it imo since it appears you and your wife are splitting expenses 25/75.", "A payout like this is like an inheritance. Your wife actually has no rights to it at all, so gifting her 30% is a rather large gift to my thinking.\n\nI would tend to think - max out money for both of your retirement savings (at least 8k - 2k ira/2k roth for each - maybe add an additional year to make it 16k), 15k for your parents, 25k for emergency savings, and split what's left.\n\nNTA for not gifting in-laws though.", "NTA but you are being quite dumb. This is not free money like winning the lottery. You shouldn’t give any of this money away. It needs to be put into a savings account and not touched unless it’s for health problems. If you have any health problems associated with the accident in the future your health insurance won’t cover the costs.", "Nta\nYour wife can share her 30k.", "NTA.  You are right, if she wants to help her parents then she can give them some of her money.", "You are not selfish to keep this money and put it in a very very stable high interest yielding account. This money is meant for you and you’re going to need it as you get older. Investing the bulk of it will mean in 10 years you’ll be able to be a little bit generous if you want to.\n\nUnless your family has lent you significant amounts of money to Live before the settlement came in, then please do everybody a favor, and be smart with it.", "This is what I don’t understand. Why give money to your wife? Aren’t you a team? If I was you any money I keep for myself is automatically my wife’s. There is no my money and her money, it’s our money. When my father passed away I was left with about $250k. I paid off our house, our debts, bought a car with her input  and bankrolled our savings account. Never a 2nd thought. When I see this splitting of finances with a married partner I always assume they don’t trust each other. And with her bugging you about sending some to her parents I’m probably right.", "Came here to say the same thing. I have family members in the legal profession so these kinds of hypotheticals come up all the time over dinner and stuff. That money is for future medical care for the rest of your life. This is includes physical and mental health. It's not intended to be given away and spent on non-essentials. I really think you need a financial advisor here and a discussion with your medical and legal teams. They gave you a large sum of money for a reason. I'm concerned that you don't understand the full implications of your accident.", "I’m glad to see this response. I have a very close friend who worked both in workman’s comp insurance and in mass tort/class action law as a plaintiff‘s attorney, and I’ve heard enough of their (very common) horror stories. Not saving the majority of the settlement against future health issues is not the smartest move here.", "I was thinking the same thing. My dad was in a similar situation and blew through his money. Then, years later. started having medical problems and needing surgeries and couldn't work. He had nothing saved.", "Agreed! I'm in a country with universal healthcare and benefits through work and I still just dropped almost $1000 on medical treatment that isn't covered but I absolutely need. Save your money OP!", "Agree. OP's arrangements would maybe make sense if this was a lottery. But these are for past present and future medical expenses and should not be shared as if it's a windfall from heaven to make everyone else's lives easier. It is compensation for their accident.", "100% of this. Current Adjuster here. \n\nThis money is meant to cover everything to do with this injury forever. You could run into issues when you are older if Medicare gets wind of it. Put it away for anything to do with your injuries. \n\nKeep it separate from your joint finances. Use it to cover any FMLA time, medical treatment, etc. That's what it's for.", "I agree with putting it away for future need.  If OP insists on dividing it, tell your wife you are 100% ok with her giving a part or all of her $30k to her parents.", "That was exactly my thought. She's daft for doing anything except save / invest it. This wasn't a lottery win...", "I also worked in workers comp for awhile and agree with this post. (Not a lawyer, not legal advice).", "This. Why are you giving your wife a huge chunk of money for a presumedly traumatic injury you suffered?\n\nIf you are Already paying for your parents expenses, i guess it makes sense to help them with this if you’re paying for their stuff regardless. But this isn’t fun money", "This is a good advice. \n\nA friend of mine had breast cancer. She had a good life insurance and it payed  out a lump sum. She used it for treatment and covering life expenses while she couldn't work. Thankfully, everything went fine and she is healthy at the moment. She decided to spend the leftover money on a new car for her 18 year old daughter, and all along I am thinking how she can't get such good insurance terms with her cancer history anymore and what will happen if it comes back. Tried talking to her about it, she shut it down immediately saying that she doesn't appreciate the \"negativity\".\n\n Oh well...I apologized and let it rest and hope everything will be ok, because if it isn't, she'll be in lot of financial trouble.", "Great point. OP, this is a payout for an injury, not a lotto prize or casino winnings. Don’t be foolish. Put the money in savings and *leave it alone until you need it*.", "Unless the given numbers have a missing zero I don't understand why they believe there can be a 3-way split.\n\nI do believe money received for lawsuits for injuries aren't automatically community property.", "Not only this, this is your money, put it in an account that is yours and yours alone. Meet with a financial planner and tax advisor to ensure any gifts you give don’t place tax burdens on your parents. It might be better to pay some bills for them as a financial gift may cause issues with disability or Medicare.", "Its a settlement though not an insurance claim. Maybe his injuries aren't significant but the PR damage fron the accident made a settlement worthwhile.", "Especially if you’re a Medicare beneficiary, you’re required to report yearly spending to them as well.", "Agree. You can always convert his medication costs as they occur, which would give you the flexibility to pivot if you did indeed need that money in the future.", "He’s getting $100k. As a plaintiffs attorney, this seems really low. I wouldn’t assume he had on going medical issues with a settlement this low. Doesn’t mean he doesn’t, I just would not assume that.", "I wonder if it's like OP was minorly injured but could have easily been greviously injured because of some gross negligence, and this is hush-hush money.", "\"It's my money and I want it NOW!\"", "Not true. He’s married, got hurt while\nMarried. It’s half her money no\nMatter how he “earned” it.", "Yup and her parents are doing good financially whereas Op's are struggling", "Exactly, and I don’t understand how she can take such a chunk of her husbands settlement money. If this happened to my husband and he offered me that money, I’d be telling him I don’t need it…it’s for him. I’d be making dam sure he was keeping hold of that money and investing it for possible future problems. I can’t even imagine having the audacity to demand he give some to MY parents for an injury HE sustained at work.", "Because it's his money to do what he wants with and he sounds like a reasonable person?", "Why are there so many comments making the assumption that OP isn't financially responsible and are the making a judgment on their own assumption?", "Only OP was injured and has to live with that. I think it's fair the injured party decide what to do, married or not.\n\nThat said. They need to save money for future expenses related to the injury", "do you just walk around with your hand held out all day?", "Wrong! legally and morally speaking, the money is his and he can do what he wants with it. He gave her 30k already. She can give that her parents if she wants to.", "I mean, she wasn't injured either, was she.", "25K for emergencies, ie savings-  that’s 55% for her and him.", "The money is ops and ops along, legally, mkrqlly, and otherwise. His wife couldn't get a dollar of it in divorce. It is from an injury settlement, it is the most \"earned\" money anyone will ever receive.", "That's actually not true.  Earnings, yes.  Lotteries, yes.  \n\nBut personal injuries are not so cut and dry.   It's similar to inheritance.  It's personal not shared.  It's money for OP due to injuries OP suffered.  \n\nThere are different buckets of money that are legally shared or not shared.  This would fall into \"not shared\".\n\nShe would not get a cent of this in divorce.", "Yes. A huge settlement (depending on the location of OP) usually includes past and future medical, past and future pain and suffering, loss of earning capacity, loss of ability to enjoy life, etc. Several of these factors come into play in the future and OP needs to be cognizant of them now. If OP had surgeries, often scar tissue forms and combined with natural aging, creates problems down the road, even if he \"healed well\" at present. Were pins/rods placed, they can become displaced. So many factors. Had his wife incurred substantial losses due to his accident (again, dependent on location), she would have had a separate claim for loss of consortium.", "Its literally blood money in exchange for a pound of your flesh. It is not to be distributed by anyone except you, the way that you want it. However you should save it for future problems as others have already pointed out. Remind your wife of what has been lost.", "30,000 here. Public system wouldnt do anything till it got worse. I spoke with surgeons who said it will get a lot worse and could take my mobility if I did not act now.", "He said at the start of the post that's it's not 100k. He did not say what the amount it, just that it was a large amount. The 100k was just used as an example to explain how he was dividing it up.", ">it was a huge amount. For example purposes and to make it clear that these are not the real values", "I have a structured settlement but I need cash NOW! \nWay to bring me back to childhood daytime TV.", "Call J G Wentworth. 877 Cash Now! lol  \n\n\nI hope whoever created that jingle was paid extensively. It's probably the most remembered commercial ever haha", "Nope, not how it works.  This is more like inheritance.  Not all things are legally shared in marriage.", "But usually the awarded amounts are for repayment of costs and to offset future costs.  It actually sounds irresponsible to not use it for that purpose.  It should entirely stay under his name and he should use it as needed.   If his parents need money then he can help them along the way.  His wife shouldn't get any unless she paid into the costs.", "idk why you are downvoted. he does seem reasonable. he literally says he is financially well. he is the breadwinner. he give shis parents money monthly. he's keeping aome of the money for himself, which he can still invest. these aren't even the real values so who knows he might be having even more money. whatever happened, it didn't damage him financially from what he states. I do understand the point of saving money for future inhury caused from the intial one. still, its OP's money.", "Because they aren't making the financially responsible decision.", "Plus they split the bills so they keep their money separate.", "[deleted]", "[deleted]", "That's what I'm afraid of! I'm less than a year into my injury, quality of life has decreased and I'm told I'm \"too young\" to start having surgeries. So in the meantime, I get to pay thousands of dollars every 6 months until I'm \"old enough\" to have surgery.\n\nI hope you find relief soon. A life with pain and poor mobility is soul sucking", "something something mesothelioma", "I dislike you at the moment because all I can hear is that damn jingle now. Ps, the commercials still come on occasionally. \n\n877 CASH NOOOWWW", "Head On would like a word, lmao", "This isn't legal advice, you can be legally an asshole. \n\nHe received an injury settlement. If there's complications down the line requiring money to take care of him, she be an asshole to not share the burden. But he could also be an asshole if he giving away that money prematurely to just his parents.", "The awarded amount could have also just been to avoid other penalties, there is no need to assume.", "Ah, I wasn't aware you had an intimate knowledge of OP's finances. Okay, carry on then", "households dont go to work, and personal injury sums are not considered marital property in the divorce.  the money is literally for the pain and suffering of one specific person, who is already sharing it more than they have to.  this isnt a lottery ticket.", "I mean, if some of it came out of her share of the household budget, that's why she got $30k.\n\nSeparate finances are a bad match for this kind of situation, but I don't think her parents have any sort of claim on the money.", "Always consult with two/three different specialist, always have than more one opinion to go on. If you can go private and skip the bs", "Call the Law Offices of James Sokolov.\n\nThanks to Mr sokolov, I will always remember what mesothelioma is.\n\n\"Mesothelioma is a rare, malignant form of cancer, in the lungs, usually associated with exposure to asbestos.\"", "Life alert.", "> This isn't legal advice, you can be legally an asshole.\n\nYeah, so don't tell someone they have to share something in a marriage when the difference between that and dating is ***legally*** being intertwined.  \n\nSo if we toss legality out the window, he wouldn't share with a GF either.\n\nThe money should go towards what was spent then whatever he wants it for.", "We're running with the information given. The information was that op was given money for a settlement due to an injury. The money is for lost wages and current/past/future medical expenses due to the injury, and op is giving it away. No matter the finances, that is not the responsible move to make objectively.", "The fact that they got a windfall and then want to hand out huge chunks of it instead of saving it for future medical care indicates they may not be the most financially astute, and you don't have to know their finances inside and out to deduce that.", "You may be entitled.", ">We're running with the information given.\n\n\nYes, and that's the problem because then you start projecting and making assumptions. OP isn't even asking for a judgment on his finances, just how he distributes money that he doesn't seem all that concerned about. You guys lost the plot entirely.", "but he is the breadwinner, is well off, and literally give shis parents money monthly. I don't think OP had a problem w finances here.", "More assumptions. This place lol.", "There's a sub for that.  ;-)", "I never made any assumptions or judged anything. I simply stated what the settlement money is for and the financially responsible choice is to use it for personal/medical expenses. You asked why everyone is saying they aren't financially responsible. I replied with why. I didn't give a judgement on finances, or on the post in general. I answered your question.  Throw around the word projection if you'd like, but it does not apply here. Have a nice day I guess.", "The question wasn't if they have a finance problem, it's if op is using the settlement money responsibly. It's not money to give away like they won, it's money for medical expenses and income lost. Giving it away isn't really a great investment when OP has no idea what future medical issues due to the injury might happen. Especially as the primary breadwinner, it's important to have that security in case that accident takes OP out of commission and suddenly the primary source of income for the house is gone. The settlement helps provide that security, especially because most settlements are final and once that money is gone there's no coming back for more.", "What assumptions are being made here?", "You're responding to someone who is responding to someone who is making a YTA judgment and defending their statement. I don't know if you're intentionally obtuse or just don't understand that your opinion doesn't matter because there is no actual context.\n\n\nBut you can go on giving people advice they're not looking for.", "YTA to yourself. \n\nPut in a retirement account and don't give any of it away. You can't throw enough money at your parents to help them. They are running at a negative and will continue to for the rest of their lives. They are headed to filing bankruptcy and any stopgap you provide will disappear with no real benefit. Let them get to bankruptcy faster, which will help more than you ever can. Then they can get rid of debt, protect their home, and get public assistance. \n\nGetting a big chunk of money doesn't happen ever for many, and for a few only once. Invest it wisely and forget it exists. Don't touch it until you are ready to retire. With luck, you can retire early with this boost - like a decade or more early. Giving this money away or spending it on things is screwing your future. Take out a few grand and take wife on a nice vacation, but absolutely don't touch the rest.", "NTA\n\nShe's getting 30k (per the example) that she can choose to spend. \n\nBut I will second the top response to not give ANY away. I've also worked for Workman's Comp benefits, and I can tell ya- of it's health related, you may find care harder and more expensive than you thought later on down the road.", "Hey OP, when I was 20 I was in a significant car accident (fatalities, massive injuries, etc)  After hospitalization I went on with my life.  It's now 40 years later and my spine is messed up.  I won't go into details, but I can not possibly work for an income to pay my bills.  It'd be nice to have a nest egg to rely on.  Just my 2 cents worth.", "Don't set yourself on fire to keep other people warm. Use the money for it's intended purpose: to support yourself financially given that you will likely need it down the road. The money is meant to cover your losses and expenses. It's not a lottery jackpot. It's not for your parents, much as you want to help them. Nor is it for your in-laws.\n\n>I was being selfish in deciding its destination without listening to her.\n\nYou aren't taking care of yourself enough if you want to give it away. She's right, in a sense, if you are going to give money to your parents, you may as well give it to hers as well, because you are already not using it for it's intended purpose.", "YWBTA if you did anything but bank this money for future medical issues. You didn’t win the lottery.", "Big mistake.   Don’t give a lump some to anyone, including your wife.  This is entirely non-marital money.  Put it in a trust account.  Give some money away in the right circumstances, taking taxes into account.", "NTA. Not even a little bit.  \nYour injury, your suffering, your money, your choice!! You are 100% on target, if she's so hell bent on her parents reaping the benefits of your settlement she is free to share her portion. It's important to know that your parents can use the financial help and hers don't need the help. She just wants them to get their \"fair share\".", "NTA\n\nYou are helping your parents with medical expenses at a time of need.\n\nYour IL are stable and do not have the same needs.", "My sibling used her payout years after a terrible injury to pay off her husband student debt, then he left her. Never give away money to relations like that, invest as a family, not in individuals.\n\nBUT dad's health expense sounds incredibly reasonable here", "YTA - This money is because of injury. Assuming you have your own medical expenses and will probably have future medical expenses you should distribute any of the money. It should be saved. The way you are planning to distribute the funds looks as if you won some sort of lottery prize. \n\nIf you have that large of a settlement, I suggest consulting a financial planner/advisor for advice before doing anything.", "*<I suffered an accident at work and recently reached an agreement with the company>*\n\n*<her parents are financially stable>*\n\n*<my parents have absurd expenses because my father has several health problems and basically this money would cover a year or two of his medicines, they are struggling financially even with my help monthly.>*\n\n**INFO: Is your wife also contributing monthly to help YOUR PARENTS financially ?**\n\nIf yes, you can share the money with her parents as well.\n\nIf no, there is no reason AT ALL why you should give money to her parents.\n\nAs you help YOUR parents financially, she can help HERS, and share HER SHARE.\n\nNTA", "NAH.\n\nIt is your money, but I understand why your wife is upset: by giving x to your wife, y to yourself, and z to your parents, you created the impression that the funds were to be distributed amongst your loved ones. Giving nothing to her parents says you don’t consider them close loved ones but your parents are, and when you merge families it’s generally best to avoid favoring one spouse’s parents over the others unless there’s a specific reason to. She feels like you don’t see her family as real family, and that’s understandably hurtful. She shouldn’t be telling you what to do with what you got, but you also could have been more sensitive.\n\nIf I were you and had decided not to save it in case of later complications from the accident, I would probably do one of three things:\n\n1. Divide the money between you and your wife 60/40 (or you, wife, and emergency fund 50/40/20, or whatever), then from your portion give some to your parents. Then she can decide whether to put some towards her parents from her share, rather than feeling you have your parents a cut from a “to be distributed amongst close loved ones” from the start.\n\n2. Instead of putting some “towards your parents,” put some “towards your parental medical bills.” If her parents don’t have medical bills to deal with, then this creates a clear reason why you’re not doing the same for her parents. It also may be more helpful for your parents to have a fund to turn to for medical expenses, rather than a lump sum up front that they may feel obligated to put towards other things.\n\n3. Set aside a good chunk that goes into a high-yield savings account “to help with parental emergencies.” Put the interest towards helping with medical bills, and when emergencies arise you can dip into the principle. This way it may last longer, especially as it may be more needed in future than it is now. Medical challenges rarely get easier with age, and interest can accrue faster than people expect.\n\nOverall I’d find a way to diminish the impression that your parents are more important than hers. You’re married, and that dynamic could become a real sticking point in your marriage.", "Devil's advocate \n\n> I am the main breadwinner at home\n\n\n> I suffered an accident at *work*\n\n\n> I split the bills 25/75 \n\nSeeing as it's a settlement for a *work* injury 75% would fall into the 'communal' pool, 25% to do with as you please. The other part is up to you and your wife to decide on.\n\n\nOn the other hand, maybe use the money to move to a country with better healthcare together with your parents so that the money lasts longer for your dad and you to enjoy, and simply divorce your wife?\n\nNAH i can see why your wife wants her parents to benefit as well as in her eyes you have been supporting your parents already and now are giving them a lot of money, whereas there's never been money for her to give to her parents.", "  YTA   Yes, you should have made this decision with your wife’s input. That’s marriage. You stated that it was YOUR MONEY AND ITS UP TO YOU TO DECIDE HOW ITS SPENT! Really?! Ridiculous buddy. I understand why you want to give your parents the money but you should have discussed it with your wife and you should definitely give her parents a nice chunk of said money. Stop being a controlling ass and share. GEEZE!!", "15k for your parents makes sense if it's truly going to help them and theyre struggling. I would hope if your wife's parents were really struggling youd do the same (but they arent currently) The rest I don't understand. If I came into that much money I wouldn't divy it up at all/blow it unless I really needed to. Im not sure why you wouldn't keep it as a nest egg or save it/invest it. I could see you using some towards something mutually beneficial like paying down debts, a unique trip, future plans, etc. Even if I had the money to give my spouse I wouldn't give them 30k just for shits and giggles unless it was going to something very needed", "NTA\n\nLet  your wife give half of HER money to her parents.\n\nBTW, this settlement is YOURS, not hers in any way.\n\nGood Luck", "NTA!!! You are correct that she can use her portion to help her parents if that is how she feels.", "NTA My husband got a nice bit of cash a while ago. If his dad were still around (he was strapped for cash, as we found out when he passed away) and he decided to give some of that money to him, I would not expect him to give any to my parents! My parents are financially stable and I don’t think they would even accept the money, to be honest. If your wife feels that her parents need some money then I guess she should give them some of her’s!", "NTA", "YOU GOt HuRT. YOU DECIDE", "NTA - but dont give them the money just use it to cover the medical expense. You could always do a holidays fir inlaws", "You could divide the money 30K for you 25K for emergency fund 15K to your wife 15K to your parents 15K to your IL", "NTA. She can share her split with her parents if she wants to. Stick with that statement.", "NTA", "Invest the money. You can give some of the dividends to your family every year instead of a one time lump sum.", "NTA\ngirlie is being a bit controlling", "NTA. I think you need to talk to your wife and figure out exactly why she wants to give her parents some money. Especially if it's not obvious on why they would need the financial assistance like your parents.\n\nIf my husband and I were in you and your wife's shoes, I would ultimately respect my husband's decision on what he wanted to do with the money. Especially if it came from a settlement where he was the beneficiary. I would at least expect him to consult me and tell me before he does anything crazy.", "NTA.  She can split her portion if she wants to give money to her parents.", "Also, I'm guessing you might have to pay taxes on this payout. And you might be responsible for the whole nut, not whomever you gift it to. 20% of 100K is substantial. I would look into that before you give anything away. You might not have what you think you do. You could end up screwed in April.", "NTA, you're the one who was in the accident and your parents need it more than hers. If her parents ever need financial help you can cross that bridge when you get to it", "If you are married , invest wisely and use the return to either grow ur investment or your expenses. This money is not to be distributed to your wife, ILs or parents. Help your parents they way you are helping them. Don’t give a chunk of this money to anyone. Keep it in your name. It’s not an income And tomorrow if you were to get a divorce, which may be very well from how you distribute or chose not to distribute this money, this money may be contended by your wife’s lawyers. You could have this money distributed to you over next few years if that’s an option.", "I don’t often admit it, but I am a lawyer and I agree 100% with the comments urging you not to give your money away. Too many times, I’ve had clients put in terrible situations by family members who have unreasonable and unearned expectations, and it usually doesn’t end well. They run out of money and expect more from you, or you run out of money and don’t get any help. I’m used to defendants asking for confidentially but it also benefits the plaintiff. \n\nNot totally on point, but if you haven’t received the money yet, talk to your lawyer about whether it is possible to receive a structured settlement. Basically, the defendant buys an annuity instead of making a lump sum payment, and you receive regular payments.  You could tell your extended family that the settlement had to be paid out that way, so you won’t be able to make the lump sum payments. \n\nI think it’s a good idea to never tell family too much about what you have coming in. They think it’s like lottery money and believe they have an equal claim to it. You can help them, but for some people it’s never enough and leads to different problems down the line. \n\nFinally, it’s possible that some of the settlement could be considered community property if: 1) you live in a community property state; and 2) it’s payment for lost wages. Given the suggestion that there’s a lot of money coming in, make sure you talk to (or get) a good CPA asap. \n\nAlso, even if you are free to do what you want with your money, it’s probably a good idea to make these decisions with your spouse. Get too hung up on whether it is community or separate property as an abstract principle, you could undermine your relationship in unexpected ways. If it really is a lot of money, then your partner may feel threatened and may not consciously realize it. \n\nIt’s potentially a big change, and if you like what you have going right now, keep your spouse involved with the decision making. You may have already factored this in with how you agreed to split it with your spouse.\n\nAlso be careful with potential gift tax issues. If you are giving someone in excess of $17,000, you and they may have to report it on your taxes.", "NTA\n\nIf she wants to give her parents cash she can donate it from her portion. You have zero obligation to give your in laws part of your settlement. Even giving some to your own parents is being super kind IMO.", "NTA. The money belongs to you and you can distribute it as you wish.", "Zero to parents or inlaws.", "This is an insurance settlement that came about as a result of some kind of injury. You should settle the arguement by putting every penny of it into a long-term investment so that when you have future issues as a result of those injuries and need to retire early, you will have money invested to enable that early retirement. NTA - but I don't believe you are thinking ahead well enough.", "LMBO @ “joint decision”!!! Unless you two were *jointly* physically injured, your wife is dead wrong! Divide the money as you see fit, if she wants to help her parents; she can do so from her cut. \n\nSeriously, WTF were some of you thinking when you chose your spouse?!?!", "I would take back the 30k and divorce her", "I have to imagine that the total has something like two zeros added on. So something like $10m. \n\nI assume this because in order for it to make financial sense to divide it like this, it has to be way over the amount of actual expenses he may incur because of the accident.  That would be the $2.5 m he put away for “emergencies”. \n\nIf he and his wife had already split finances, it would have just gone into a joint pot, but because they divide proportionally, they decided to split it, because the punitive damage component really IS a windfall, and the couple as a couple have been dealing with the injury. Yes, he may be the one who was physically hurt but she was likely there supporting him during the treatment and trial, etc., picking up the slack, doing all the errands, keeping their lives together. Not that she wants applause or that she feels “entitled” to a payoff, but that as a couple, they may very reasonably feel that the  “windfall” aspect of it should be shared (but because they don’t actually “share” finances, it will be split). \n\n(Reddit people seem to hate their spouses and see only ulterior motives and gold diggers; keeping all the stuff together when someone is seriously injured plus taking care of them and ensuring they stay on track in their recovery takes so much energy, commitment, work and usually, love.)\n\nSo NTA but I hope it really is so much that you have already purchased long-term medical care insurance for you and your wife, and have put aside enough to more than fund any medical fallout from your accident and both of your retirements before you go around dispersing it for fun.", "This plan sounds like a great way to plow through the money and have it gone quickly while also establishing a precedent that you will be a piggy bank for your family. You note 30k for you and 30k for your wife, but you are financially secure what are you doing with your share? Save that $; retire early, build a portfolio, buy a second home. Do anything but chunk it out.  I am going softly say EHS. Feels like everyone knows about this windfall and you are trying to appease all.\n\nEdit for grammar", "NTA it actually isn't a joint decision considering this is a settlement based on your accident and injuries. you're already being generous and the in laws are not entitled to any of it", "NTA but If your ability to work has been affected I would encourage you to invest ALL of that money (that you don't need for expenses) and give away nothing.", "NTA. You are the one who got hurt. It's money for your suffering which means you get to decide what to do with it. Your wife needs to sit down.", "You shouldn’t have given anyone anything - would they have given you money from a settlement they had won due to getting personally injured? Your wife is out of line.", "NTA. If I may, the money might be useful to you for caring for yourself if your injury is causing issues in your life. That is the purpose of the money. \n\nYour parents clearly need the money more. Tell your wife that this is the reason you’re giving it to your parents and not her parents.\n\nShe’s right that it should be a joint decision, however a joint decision would be if it actually affected both of you, and right here, you received a bunch of money, and your parents need it.\n\nDo you have split finances?", "Save it! Make sure wife has no access to it, and leave instructions in a will what percentage each get of the leftover if needed. You’re wife will try to use it for her parents.", "NTA your parents need help and her's doesn't not. You got the money by being injured, it's your money not her's. She can spend her allowance on her own parents", "NTA. She didnt share in the pain/injuries so she doesnt deserve any of the money. She should be made to understand this. It isn't money gifted to the two of you, it is monies for YOUR pain and suffering along with potential future medical expenses. Why should she get any? \n\nI would see this as a red flag. Look closely at this relationship. Your relationship wouldnt be the first one to have a problem in a marriage when greed kicks in. And dude, insurance guy here, you may need that in the future because if they paid out that much you must have been severely injured and YOU DONT KNOW IF THERE WILL BE MORE EXPENSES RELATED TO YOUR INJURY. Show some foresight and stick most of it in a savings account and then give a little out. \n\nKnow that that amount will not change anyones life. Just maybe let them pay a few bills but financial status is more defined by ones ability to live within their budget and salary, but motly budgeting. My brother at one point made 3 times what I make but he would spend it as fast as he made it. Giving him a large chuck of cash would not have changed anything. \n\nAlso, you might want to reduce that amount a little because the most you can gift without them paying taxes is $17K per person and if you give them more, the govt will take their 10%-30% as it would be taxable income for the parents and ILs.", "NTA. OP instead of giving your wife 30k just give her 15k and tell her you split the portion she would have received with your ILs", "Don't pass the money out to anyone. It's a settlement. You'll need it later. People always do this crap and end screwed later and the people they passed out money to are no where to be seen. \n\nYour wife is an asshole here.", "Why would you give any of that to anyone?  That’s crazy.  It was awarded to you for compensation for your injuries. You can use it for your immediate family’s benefit, for instance, buy a house but it’s not meant for other people to go on a spending spree.  The smart thing to do with it would be to invest it.", "NTA but TBH i wouldnt share it with anyone.  Just invest it safely with the ability to cash something out in emergency and if they want some, they can beg you for it.\n\nIt was your injury, why should you pay them at all.", "NTA - keep her 30 for yourself now", "It's your money, do with it what you wish.  It's not up for a vote here.  If your wife wants her parents to have some cash she can give them some of yours.  NTAH.", "NTA", "NTA. You got the money because you were injured and you very generously are allocating the same amount for your wife that you gave yourself. You don’t even have to give her any of the funds since she wasn’t the injured party. She sounds very greedy and ungrateful", "If you are in America, that amount of money is NOTHING when it comes to covering medical expenses. Keep it for yourself.", "Get legal advice so you avoid doing anything with the money that will make it marital property. Invest it. If you want to dole out part of the proceeds (while still reinvesting some), divvy that payment up. Even at a very conservative interest rate, you would still be able to help your parents a little at a time if you wanted.", "Did your parents help you recover from said accident?  \nDid your inlaws help you recover from said accident?  \n\n\nhow would she respond if you told her you'd give them 25% and your parents 75% just as you split the bills?", "LMFAO!! NTA. What is wrong with this woman for thinking her parents are entitled to your money? 🤣", "Put ALL of this money into savings that earns interest or other investments. Only spend the interest and save the principal. You can still help your parents out that way and it will last much longer than just giving it all away at once.", "NTA and keep as much of the money as you can-you're young enough that both of your parents are alive, and your injuries were serious enough that an insurance company paid up a lot of money. Don't treat this as a windfall and go crazy; by all means help your dad out with medical costs if he needs it, but the X for you, X for your wife etc is a bad idea. And BTW-it's only a joint decision if she was in the same accident with the same injuries.", " NTA. this is your money from something that happened to you not your wife. If she wants her parents to have something she can share the generous gift you gave her.", "She wants her parents to get money she can take it out of her share. You're the one who was injured, not her.", "YTA- this money is not a windfall. They calculated damages and lost income potential and paid you that. You think a company gives you more than they have to?\nStick that into a ROTH IRA and forget about it.", "A close friend of mine got hurt at work, had several surgeries along with phycal therapy and knew he'd have more surgeries down the road but wasn't worried because workman's comp would pay for it. A few years later the law changed and his attorney dropped the ball and his file was closed, and was unable to get his case grandfather claused in. He now self medicates and is a shell of the person he once was.\n\nPut the money in a conservative investment account, and use the interest to help your parents, but don't split the principal because you may need it some day.\n\nNTA.", "I was gonna say you shouldn't give shit away especially if you had a big work place accident gonna need to pay for any future medical bills", "What are you thinking? Save all of it. Presumably you got a large settlement because it’s a severe injury. You’re going to need it in the future going forward to look after yourself.", "NTA", "NTA. It is your money to do with as you wish. I would never have the audacity to tell my husband what he will do with money he received due to an accident. Your in laws don't even need the money either. You brought up the best point as well- if she really wants them to have the money she can take it out of her portion.", "NTA, its your money. If she wants to give money to her parents, she can earn more.", "NTA. Your parents have greater need, and it was your injury that prompted the settlement, so that is literally blood money from your blood. \n       \nAlso, by giving your parents a lump sum and allowing them to plan and have the medications your father needs, it could reduce the cost of his care over a couple of years because he won't be having to figure out how to pay his bills.", "Isn't the whole point of that money to cover whatever future expenses you may incur as a result of your injury? Like yeah, maybe you're OK now, but you end up having to leave the workforce 10 years earlier than anticipated because the back/neck/brain/whatever injury will make it impossible to continue working. If anything, it should go 100% into a long term investment that you can pull out as needed so when the day arises that you cannot work, you have access to the settlement money, plus whatever interest you have. I can't imagine it was much of an injury if it resulted in a six figure settlement yet will have no long lasting effects. NTA, because it is your money, but it seems like you may not be thinking long term.", "Why are you giving money to your parents? If they need help with bills, I can understand that, but it seems odd to give a specific percentage to them. \n\nIt makes sense to put away some of that money for retirement and stuff, but your logic here seems weird. Not sending money to the IL's because then are financially stable is fine, but you have created a fight with your wife. \n\nYou have an unbalanced way of sharing bills with the wife. And I bet she took care of you when you had your work accident. You should pay off all your household bills, including what your wife normally covers. Get your house out of any debt first. Then put money in the bank.\n\nHonestly, why are you thinking of just spending it all by allocating it all out. A little spending cash between you and your wife is one thing, but you are not thinking responsibly. You need to have a good talk with your wife, because this is how marriage works, and figure out how to make sure your household can use this money responsibly, or just bank it while you guys progress: Home improvements, bills, kids college fund, long term retirement funds...", "I wouldn’t give any money to your wife, and maybe instead of giving it to your parents maybe handle their expenses. Thinking about the top comment. But definitely your wife is being greedy", "Dear idiot,\n\nThe money is only yours to compensate you for your injuries. When you run out of money, you will kick yourself. Invest what you can. Those amounts are not large amounts. Don't fool yourself.", "Don't give any of it away to anyone!!! SEriously why are you even considering giving any to your folks or in-laws or anyone??!!!  That makes zero sense!  That money is for your future care and maybe you and your spouse to use ONLY!!! \n\nI'm thinking you committed the first mistake of windfall and that is telling others how much you got. Worst of all, you told your family didn't you? Now they have their hand out. \n\nDon't give anyone shit and don't offer it either. \n\nSeriously!!!!!", "NTA - It’s your money, not hers. Spend it or save it how you please.", "NTA. DON'T give anyone your money. If you'd like to let your wife get herself some nice things on your tab or help your parents with some expenses, by all means do so. But you should keep 100% of the lump sum and spend it as you see fit. End of story", ">I suffered an accident at work\n\nNTA. This is YOUR money. Even though you are married, you are the one who suffered the loss here, not your wife. You are correct, if she wants to give HER money to her parents, she is free to do so. You have no obligation here. She really has no input on this. It was a legal settlement you received to compensate YOU for YOUR loss.", "NTA. You're not divvying up a pie and denying her parents their fair cut. You are considering giving your parents some help with their medical expenses, on top of the help you already give, because you can now afford that extra bit of help.\n\nThat said, I agree with the majority that the majority of this should be going into your emergency fund, instead of being regarded as fun money or a windfall. It may look like a huge amount now, but they weren't carelessly generous towards you.", "NTA but confused… \nI don’t understand why you are allocating any of it to anyone but your potential future needs. This money was to help you and nobody has any claim to the money if they deemed that was the appropriate amount to compensate YOU for your injuries.", "Maybe suggest she can do that out of the 30% you gave her", "NTA. I was going to say exactly what you said; you gave her 30k, if she wants to give money to her parents, she can do that.", "NTA, but for a settlement that large, I imagine you suffered substantial Injury that may make it hard for you to find equal work in the future.\n\nAs such, giving away ANY of it is a foolish move.", "You are handing her 30k she can split that with her parents what a selfish beeyatch!", "NTA your wife certainly is. She can give any or all of hers to her parents. Wtf is wrong with her.", "YTA. Not because you left out the in-laws, but because you unilaterally made the decision.  You don’t have a marriage, you have a roommate.  In a marriage all assets are shared equally and all decisions are made jointly.", "It sounds like you have a selfish woman. I have never had 1 scenario where my wife would do something like this. You are making the right decision.  Why doesn't she use her money you GAVE her ? You may have a bigger issue than OP", "What if she got a settlement would she listen to you how to spend it?", "YTA. Completely in the right legally. But why be married and act kind this? Of course YTA. The only question is if you are okay with that or not. \n\n\n\n\nI'd give my in-laws zero. But I am fully aware I'm an AH.", "you should give the money to whomever will be paying your medical bills for the next 50 years", "Before you go and give any money away: the 2023 gift tax limit in the US is $17,000.00.  This means you can give up to $17,000 to any one person without having to report it to the IRS.  Something to think about, especially if you're talking a large settlement.\nOther posters have it right: this is to compensate you for a life-altering injury.  Keep it in an investment vehicle like an IRA until you need it; you might as you get older.  Consult with a financial advisor who can inform you of your options.\n\nSource: I work for a trust department of a bank.", "NTA. That's your money. She can give her parents half of what you generously gave her.", "Info: Was it a brain injury? If so, could these people taking advantage of you? Are you always this generous?", "NTA you are the one who got hurt, not her. It’s you who earned the money through physical pain.", "Don't give away any of it.  It is your compensation.  Has your ability to work been affected? Could you have future medical bills?  Keep kt.", "It’s your injury, your money. I would be giving money to the people who actually need it. You can take your entire settlement and put it into your own bank account. Your wife is not entitled to that.", "NTA she can take from her 30k", "NTA - Its your money and if you can and want to help your parents , you do it", "You shouldn’t be giving any away. Not smart IMO.", "NTA... what is a fair split is not an equal split. Everyone here has different circumstances.  The most important detail is that this money is given only to the individual harmed. If this was my husband, I'd like some input but I'd want him to have satisfaction in what was a long case. I'd not be upset with this reasonable split", "Y T A. Not for not giving it to your in-laws, but for the settlement in general. The amount of a settlement is based on your damages & need. It’s not some lottery jackpot you won. It’s to cover your current & future expenses from the accident. You may need it in the future. Invest it if you don’t need it right now, so it will be there for you later.", "NTA, but I'm going to jump the bandwagon and advise you invest/put it away.  The insurance money/settlement was given to you for a reason.", "YTA. This money should be held for your health needs now and down the road, rather than distributing out to others. A big payout is for a big reason...unless you're committing insurance fraud.", "Stop 👏 giving 👏 money 👏 away!!! Save/invest it. Then help others as necessary and as you see fit.  But don't let people know you suddenly came into a lot of money, they'll bleed you dry. Tell your wife if her parents need life saving medication or treatment AND they can't afford it, you can help them the way your helping your parents.  But yes, the moment you start giving money away, family will feel entitled to a part.\n\nNTA", "NTA.  It’s your money because you were the one injured, not anyone else.  If you choose to share your settlement, how you do so is entirely up to you.  Period, end of story.", "Why are you dividing it like that?  It should be to pay off the bills you incurred and then go into your savings for your future care.", "Where's the huge amount?", "NTA for making the decisions on where the money goes, but you could be the AH to yourself and your wife if you don’t just invest the money for any future issues that may come up. Do not just spend the money!", "Dividing this up like you won the lottery seems like a bad idea. Unilaterally deciding who gets what seems like a bad idea. But neither makes you an AH.", "NTA \n\nYour reasoning is sound. Your parents are your priority. Her parents put hers. She can share her money with them if they’re so important to her. It always amuses me when people tell you what YOU should be doing for others while doing absolutely nothing of the kind when they have the resources and ability.", "NTA. Your wife who has not given you any children basically wants you to support her parents instead of your own. You were the person who sustained the injury and YOU should decide what you want to do with the proceeds.", "OP, please create a trust and invest the money to pay the benefits to a Trust.  What happens if you need long-term care?", "Are you sure you are keeping enough for future medical expenses?\n\nI wouldn't be giving amy of it to anyone.", "WTF? An injury settlement is not winning the lottery. If you've been given a big settlement it is because you've suffered an injury that will have ongoing impact on YOU and your ability to function. You may well need that money for support down the road. I don't understand why you're giving ANY of it away. Unless of course, you committed fraud, but let's not go there.\n\nYTA but not for the reason your wife thinks.", "I don’t understand why 100% isn’t going to you. Will you have medical issues down the road that money could be used for? You generous to give some to your wife and parents but you aren’t an ATM. I’d be understanding if it was lottery winnings but it isn’t. YTA.", "NTA", "NTA", "Tell her to give her parents some of her money and that'll make it even....🤔🤔🤔", "Nta", "Do not do anything with this money other than to keep it for yourself for any future medical needs. You are foolish to do anything’s else with it.", "Exactly!  He is playing with fire by passing out the money.  If he is getting such a large settlement surely they are assuming he will have future expenses due to the injury.", "Good thought. Friends of mine (married couple) were in a freak accident about 10 years ago and after a few years of litigation received a large settlement. NO ONE knows the amount they received except for me and the wife's mom (and neither of us have need for their money). Because it was settled out of court, there is no public record of the settlement. They held on to every cent, not only because the knew if people in their life knew how much they received, there would be a line around the block of people with their hands out, but also because their *permanent* injuries are going to affect them the rest of their lives and likely necessitate an early retirement for one or both of them. This money is funding their future.", ">My vote\n\ngive this guy a vote!!", "this was my exact thoughts why give any of it away, you didn't win the lottery.", "An added thought is that having that money might disqualify them for govt. help. You should keep it all for a safety net/retirement. and you could help your parents from your income discretionary/play funds.\n\nNTA", "Great take. Makes me wonder what the injury was to award a big settlement and how it will affect OP's future earning potential/ health.", "Best answer!", "True, OP may feel like they've mostly recovered now, but years from now whatever the injury was could have repercussions.", "This is not a lottery win! Invest it for your future because you WILL need it for your future healthcare or home adaptations. \nNTA, but with reservations.", "TY. That was my first thought. Large amounts of money shouldn’t be divided up into pittances and squandered.", "Came here to say this and glad to see someone else already did. Also, OP should consider formalizing the funds’ specific purpose so that it isn’t absconded with and used for something else by someone else…", "Thank you! I was wondering why on earth he was giving it away! What about medical bills and money to pay for living expenses?\n\nEverything may seem okay now,  but this could be something that creeps up later.", "All of this ⬆️\n\nIf you were seriously injured, you’re going to need that money later OP.\n\nBut if you insist on giving it away, your wife can split HER share you gave her. She’s the one being greedy. \n\nMake sure you lock up the rest of the money tight at the bank so she can’t give it to her parents behind your back. \n\nNTA.", "I was about to say this too. Medical bills are no joke! They might need it in the future. If I got a settlement that would go into savings.", "his giving money to his father. his family, for medicines. what kind of heartless comment is this? man western culture is insane.", "I work in health care and it’s VERY common for complications or pain to show up years later, even though you think your injuries have healed", "Agreed!!  My husband broke his leg at work and ended up with a payout in the low five figures. Fairly simple injury right?  Nope! He has been through 4 years of hell and even though the Worker's Comp covered his follow up surgeries for 2-3 years, now all kinds of other illnesses / disabilities that were aggravated by the injury and the recovery time are showing up. And there is no way to prove this, and he already made the final settlement.  \n\nThe OP gave an example of $100K as a payout.  My husband's medical bills are around $78K  Every. Single. Month.  That is just short of $1,000,000.00 per year.  Luckily his insurance from work is pretty good so he only has to pay his copay and deductibles, but he learned very quickly what that \"Maximum Annual Out Of Pocket\" quip means in your insurance booklet. \n\nOP would be insane to give any of this money away to anyone!!", "I 100% agree with this", "As a retired personal injury lawyer AND serious injury victim I absolutely agree. I had to have one of my surgeries five years after the car wreck.", "While technically true how do you think they paid their bills while he was unable to work? Workers comp doesn’t just automatically pay out. Most claims are denied and claimants go without pay for long periods of time before they get money and then they might get like 40% of their former pay until the settlement. Lots of people lose everything waiting for that money.", "In my experience doing work comp in Massachusetts, most settlements include future related medical expenses, for whatever that’s worth.", "or the parents aren’t begging but that OP WANTS to give them something. Honestly I’d give my mom 15k too. I wish I could give her a billion", "Bro his parents are struggling and his dad is having health problems what are you on… sorry he is such a nice son and wants to make sure his dad can get his medicine and they are not on the street… jeez did you like leave at 18 and show up only for the will reading for your parents or were they like abusive?", "No, settlement for an injury is not a marital asset. If they were to divorce today, she would not have a claim to that money.", ">money is equally both of your and she should have equal say so it's arguable though.\n\nYeah...no. *She* didn't get hurt at work, so NONE of it is hers. He is choosing to share, but definitely does not have to.", "Damn bro loves his parents and doesn’t want them to be out on the street and he is the bad guy for giving 15% to his parents so they can live comfortably without having to worry about medicine for 2 years. What an asshole", "Bro wtf frivolous? It’s for his father’s health conditions sure the 60% they have should be saved, but the 15% isn’t frivolous that’s such a fucked up thing to say. Frivolous would be giving the ILs money when they don’t need it", "You are right so why are they splitting the money between them in the first place?", "Incorrect. In settlements like this is does not matter if there is a prenuptial or not it goes to the person who was injured and cannot be claimed as marital assets", "Yeah why did they split their’s up anyway? Either the wife is a total B and made him do it and is making it fun money or they have split finances meaning it wouldn’t be a joint decision or they are just weird I’m going to it’s just weird but I can see the wife being a B as a close second as she would rather the money go towards her financially stable parents then his sick and struggling parents. Actually writing down that last part I think the wife is just a B and wanted fun money", "Because one joint account and two separate accounts just makes sense?", "… I mean I think it actually isn’t a joint decision as I think they have split finances otherwise it wouldn’t of gotten split between him and his wife. Also why do the ILs get money when they don’t need it, you don’t just randomly give your family money when you win it unless they are struggling or if it was a very large amount of money. His parents need the money hers don’t. And she has 30K if she wants them to have a good chunk 15K seems pretty good. I mean this whole story is just weird with the split 30K 30K instead of just 60K.", "Wrong.", "yup. if OP was given that big a payout, that's how much the injury is expected to cost them long-term. I'd expect it to be on the low end, in fact, because companies are cheap. best to keep the money.", "So sad in American getting sick can lead to you ring homeless.", "I can attest to this. I have practiced worker's compensation law for most of the past two decades. It is often tragic to watch people treat their injury settlement as if it is lottery winnings. The settlement amount is typically calculated to cover your anticipated loss of income and ongoing medical expenses. OP really should not be giving this money to relatives. He will need it.", "You must also submit annual spending reports to them if you get Medicare benefits, in particular.", "Yep, my mom got a WC settlement and a good chunk of it sits in a savings account for a future surgery she might need. Insurance won't cover it because it's already paid for since it's a pre-existing injury. She leaves it alone, even though it is a significant sum and would wipe out other debts.", "For what it’s worth the money isn’t to pay medical expenses if part of the settlement is that the insurance company continues paying for medical care ongoing which is standard in most work comp settlements.", "I agree thay OP shouldn't give away money that's basically intensed for future medical expenses. However, if we're looking for people to give it to and he was married/with his wife at the time of the accident, she probably took time off work and spent a lot of \"free\" time taking care of him and covering his responsibilities. Especially if they have separate finances, she likely makes the most sense as a person to give it to.", "If the parents helped out with bills and stuff right after the accident then paying them back makes sense.  but don't just hand out this money.", "Preexisting conditions can’t be taken into account for insurance rates any longer in the U.S. can they? I thought that was a big part of the affordable care act legislation.", "This is pretty much how I read it. Used to work with a guy that had a bunch of water heaters fall on him. Some safety procedure wasn't being followed. Insurance covered the jaw surgery. He has a scar on his cheek, but other than that, his earning potential wasn't affected. Still got about 90k if memory serves.", "It’s hypocritical of OPs wife insist on treating the parents the same despite their different financial positions, yet accept that OP and his wife should contribute to their own expenses differently based on their income.", "This is the right idea. They shouldn't be spending any of it on anyone. Invest it for when they need it for complications, and if that never happens, then retirement.", "I would take it but put it in a separate \"do not touch except for hubby's medical bills and inevitable funeral\" bank account, that way if hubby goes \"oh shit, I need this surgery but can't afford it right now\" I can say \"well actually,\" or if hubby dies unexpectedly that money is there and one less thing to stress about because it's in my account and I don't have to worry about the paperwork to access his money or insurance. (We only use our joint account for passing money back and forth)", "Because OP is making a wildly irresponsible financial decision based on the info given. There's no need to make any assumptions, beyond the assumption that what he says in the post is true.", "Because Op isn’t making the financially responsible decision. What would be smart is to meet with a financial advisor and put the money into a trust and use the dividends for themself, spouse and parents. This ensures that OP will always have a stream of money coming in regardless of what happens in the future.", "They are giving away their settlement money which is a final payment. It is to make up for lost income and medical expenses. If his injuries affect his ability to work in his field, his employment options will be limited. That is the purpose of the settlement.", "There is an episode of Hoarders where the hoarder evokes this and the music played over the top is damning and horrifying and wow how could she say that?!\n\nShe was quoting a commercial, stop acting like she wasn't lmfao", "Depends on the state, but most states do not consider settlements community property.", "Exactly. This is not debatle and its a huge red flag that OP's wife is acting like this.", "I’m just pointing out that money is sometimes considered community property between spouses, I wasn’t necessarily agreeing with that", "Damn, bro, he’s injured and may never work again.  If he gives his $100k away, he may be out on the street, bro.", "Not sure where this particular comment comes from. Seems to have little to do with mine. I said I sympathize with his feelings, and agree that it's his decision. I simply suggested that to maintain peace with his wife, he make the offer. If he doesn't want to, it's his money, but she might be mollified by the gesture. In the end, he's gotta live with her.", "Its crazy to me that people think that if you are legitimately hurt and get a large settlement *all* of it is just profit basically. You don't get 100k from slipping at work and getting a sprained ankle. You get that from major long term injuries that at least have a decent chance of being debilitating or get worse and will need more treatment for later.\n\nThe only time you get \"profit\" is if the company engages in ridiculous malicious ways so much the court says \"fuck you, you're going to pay a lot more for your bullshit\". A classic example is the McDonald's coffee case. No mention of something like that happening with OP.", "Seriously, this isn’t some kind of lottery jackpot. This guy doesn’t seem very smart by dishing it all out like he just won a scratch off ticket.", "Would you feel the same way if the wife spent a substantial amount of time and energy helping OP with his recovery? What if it resulted in OP being in a wheelchair (permanently or temporarily)?", "Could be pain and suffering too, but he should keep it- all of it. Wife should get none. Parents should get none.", "There may have also been some negligence on the company's part that increased the amount of the settlement.\n\nBut regardless, putting the money in an investment account is the smart play.", "The scar tissue build-up happened to my sister after her back surgery and instead of the herniation pressing on her nerves, now it's the scar tissue!", "This this this. I’ve never needed an insurance payout but I’ve injured myself in a couple ways that didn’t show lingering effects until 15 years later. It fing sucks.", "Totally. I’m making some assumptions about the things that were left out.\n\nIf they took on any debts or either of them lost income due to his injury, then that should absolutely be recouped from this money. However it sounds like he’s just divving it up to people he wants to share with, which explains why his wife wants her parents in on it.\n\nImo it should be used to lay back any debts (including to his wife as you mentioned) and then put toward shared savings for any repurchase one down the road caused by this accident", "That’s health insurance, but she’s talking about life insurance. I believe they can still use an actuary to guess how long you will live before they quote you a rate for a life insurance plan.", "Actually our last president reversed some of those protections, and in some cases some preexisting conditions can in fact be held against you in the US.", "The problem is that OP pays for 75% of the household costs.  If there's even a slight possibility that his condition could worsen, then they would need the money.  \n\nTo be clear, I'm not saying to not help his parents.   I'm saying to not give her any funds.  This is money to offset his earning potential and costs.  He needs to use it for what he would normally use his funds for.  That can include helping his parents.   That shouldn't include giving her part of it.  It should be what he spends his normal earning on, or saved if the funds aren't needed.  \n\nAnd if he normally gives money to his parents then he should.  Otherwise it helps to cover his portion of expenses, not hers.", "Exactly", ">wildly irresponsible \n\n\nWell that's dramatic.", "Call JG Wentworth! 877-CASH-NOW!", "Childhood nothing, I saw that commercial like 6 months ago lmao", "<Empire Today enters the chat>", "It was two years ago and the edit says they have stable income 2 years later also he makes 75/25 two years later I think he is fine. He also (if combined with wife) still has 85% including a emergency to make sure he is not on the streets. He didn’t give 100k away if we go by his filler numbers he has 30k his wife has 30K and they have 25k in emergency I think he can give his parents 15k to keep them off the streets if he wants to.", "Eeee no the McDonald’s coffee case was legit. That poor lady had third degree burns all over her pelvis and that coffee WAS in fact wayy too hot.", "YTA for not saving the money for upcoming needs, healthcare, or income protection against the long-term impacts of your injuries.", "When I was a kid a guy at my church suffered a horrible accident where he broke his back on the job. He was able to walk but not well & could no longer work. He got 3 million- which was a lot of money back then but physically he was never the same. He needed more for medical care & his wife practically had to quit working to take care of him. It seems like a lot but he lost a lot.", "Yea, quite stupid.\n\nHe'll need that money for future medical expenses, and his wife wants to blow his medical expeses on a spending spree.\n\nWhen OP needs money for medical expenses, she'll think about leaving him due to lack of money, earning opportunities.\n\nShe'll also leave him when he misses his medical appointments and becomes disabled, completely forgetting about the time he gave all his money away.", "There’s no pain and suffering in workers comp. For the record. Lost wages and medical expenses are the only real factors.", "\"too young\" for surgery is an insane concept. bad things happen to all people at all ages. i'm sorry that's happening to you.", "The way he's thinking of the money is just weird to me though. If its a legit claim he's basically giving it away like he won't obviously need it for future treatment if that money wasn't so much because of punitive damages from the company fucking up and basically lying and purposely ignoring court orders and shit.\n\nI'm imagining someone I know doing this, getting horrified and yelling at them to not be stupid.", "Oh! Gotcha. Thanks for clarifying.", "Then it would still be awarded because of his body being harmed.", "$100k is by no means a huge amount. That's the first clue that OP is not money smart. If they get a crappy $35k a year, that is still not even 3 years of pay. Whatever injury OP had, it is coming back as a chronic condition, guaranteed! He will make less money while he's sick and the medical bills will be coming back. Even if he keeps all the money it will be eaten up in 5-7 years by him trying to stay up to date with his bills.", "It IS wildly irresponsible. Because large sums of money aren't given as compensation unless there is strong reason to believe there will be wages lost and medical expenses in the future as a result of the injury. If you are not earmarking the funds received for that now, you are risking future stability and financial security for a very minor upside.", "877 CASH NOW!", "Nooooooooooooooooo! That dude’s voice always creeped me out, then they made him an even creepier cartoon character like with Bob’s Furniture.", "Call 800 588 2300 EMPIRE!\n\ntoday", "And iirc McDonald's had been told repeatedly to stop serving coffee at 190⁰F (I'm not sure, but I think that was the temp). They continually ignored the warnings. They rightfully paid that woman what she deserved. Poor gal.", "If this is a Worker's Comp case, it really depends on the jurisdiction. Some states stipulate that settlements are reserved for the indemnity portion of the claim and that medical is covered for life by WC as long as the doctor establishes a casual relationship between the treatment and the original work place injury.\n\nI agree with you though, he should definitely put most/all away for future income protection.", "It's pretty common. I have early onset arthritis due to auto-immune stuff, but can't get hip and knee replacement surgery that I'd need to address the issues because I'm too young. Realistically those replacements wear out and require more replacements eventually, and there's only so many times you can do that so they don't want to do the first one early.", "Thank you ❤️", "Harmed yes. But we don't know if they are lasting injuries or something that will impact his quality of life.", "They said they’ve set $25k for emergencies aside. What if they are paying off debts with the other $ so that they have more monthly income to save? They may have an accountant helping them. Lordt.", "You should probably work on your reading comprehension and re-read OP's post.", "Not necessarily. If he lost, say a finger, due to improper equipment he could well have received an extremely large settlement but a missing digit is unlikely to require much additional costs or result in loss of income in the future beyond initial medical bills.", "Thus why I asked OP why he would share it.  But if he does share it, then it would be by his choice after all costs have been settled.  \n\nSo her parents wouldn't get any anyways unless they owe her parents money.\n\nShe pays 25% of expenses but he's giving her 30% of the awarded money.  She can do with it what she wants.  She's getting her share that he doesn't even have to give her, and she's getting more than what she pays in.", "The actual premise of this AITA is about giving away 15%~ ish of the money...", "I reread. What do you think I am missing?", ">Thus why I asked OP why he would share it\n\n\nWho knows, maybe because they're financially comfortable and he wants to support his struggling parents.\n\n\nBut now I'm making assumptions. Either way it's irrelevant.", "That's what gets me too, he is keeping the majority in the family still and helping his family who is going through difficulties.", ">For example purposes and to make it clear that these are not the real values\n\n\nI get it, reading is hard for some people.", "Yes it is irrelevant.  Thus why I don't get what you're posting about.  \n\nI asked OP a question.  Unless you have the answers directly from his brain, your comments are totally irrelevant.", "I think considering he normally gave his parents money anyways there's a better argument for him to give it to his parents. If he was expected to support them it isn't so unrealistic to continue to support them with a payout like this. It's presumably making up for lost revenue.\n\nThe rest I think he should honestly keep for himself and then he pays off individual debts  incurred during his care. Presumably if his payout is that large at some point down the road he is going to probably need more care down the line. I know it's going to sound odd but I actually think it'd be irresponsible to give that much to his wife unless it's to repay her. The rest should be saved for the future, but without knowing exact figures it's uncertain if any of this truly matters or if it's like squabbling over 2% of a lifetime of earnings or 20%.\n\nI think it's potentially responsible but it's potentially irresponsible. We just don't know enough, but we at least know he's giving away a good portion of it without clarification if this is meaningful or the most money he's going to have for a while.", "OP is simplifying his math for a quick post. It's safer to assume that the true amount is something like $115k rather than $2.05 million or whatever. We still don't know how much he earns and he is still giving huge proportions of it away, regardless of the amount. We can still see that OP is making a mistake.", "Why give your wife 30k?", "Wife asian?", "Nta, you just gave her 30k. If it mattered that much, she could easily give them half, but we all know she won't", "How long did It take your wife to recover from your accident? \n\nThis is your money. You gave her the same amount as you gave herself, which is extremely kind and generous. She can do as she wishes with her money. If she chooses to bless her parents with some of it, that would be very generous of her. But that's up to her.\n\nMedical expenses are no joke. I can't imagine how much relief that money will give your parents. \n\nNTA.", "Why are you giving away any of your settlement to anyone? Save and invest it in case you have any future health issues related to your accident down the road. YTA to yourself if you decided to give away any of this settlement.", "NTA. Why are any of the in-laws getting anything? This money is being given to you for a reason.", "What you should do: The pot is 75k. You take 37.5k, your wife takes the same.You share what you want with your parents, she shares what she wants with her parents.", "You are not the asshole. It is your money from your injury. You are kind for sharing it in any way.", "NTA but if they gave you 100k it's because they think it'll cost you 200k so treating it like a lottery win is probably not your best option.", "NTA for how you distribute your money but the concept that you and your wife's finances are split is crazy to me.", "You can invest or save the money for early retirement.\n\nIsn’t that more valuable in the long term than treating it as fun money?", "YTA. It’s not a lottery win. Put it in a savings/investment account to cover the lasting consequences of the incident you received it for.", "NTA. She can give half of her portion to her parents.", "Ask her did she get joint injured", ">She said that this money should be a joint decision\n\nYour injury, your money.  I don't think  you should be handing it out like you won the lottery, and why isn't it going into a bank account, instead of splitting it between you, your wife, your parents and emergencies?  NTA for not giving her parents money or discussing it with her.  Same applies with inheritances.", "YTA. you’re also a dumbass. If you were injured so badly at work that were awarded a huge settlement due to the injures; that money is to be used for your ongoing and future medical expenses.\n\nIt’s not like you won the lottery and have plenty of money to give away. The lawsuit winnings aren’t meant to be spent frivolously. You also have to consider how your age now and how much longer you can work, if at all, and plan on living.\n\nYou should be saving that money for your future in case these injures force you to not work later on. Or god forbid something happens to your wife, and she can no longer work.", "If you received money for an accident your medical insurance may not pay for care for that issue.", "Given there's not equal need by the parents, giving the unhealthy ones more is reasonable. Sure, you should discuss it and listen, but the proposal you made seems like a more reasonable one than splitting it equally between parents independent of need.  \n\nThere's no social expectation of giving financially stable parents any money; family money is supposed to flow towards future generations not to the older generation.", "NTA not your parents", ">selfish\n\nStandard shaming bullshit from anyone making a demand they have no right to expect.   I think you need to seriously reconsider whether you need this woman in your life.\n\nNTA.", "NTA she can divide hers with her parents. And it isn’t a joint anything you split 25/75 not 50/50", "EsH you should save most of that money for any future medical complications that you may have later from this accident. Maybe you you think you are fine now, but as you get older, you will have more mobility issues than expected or whatever based on what the injury was.\n\nAfter maybe paying off some bills I would have made sure that $80k was set aside on different CDs or a thousand in a health savings acct. And then revisit the money on a year.\n\nMy mom was injured at work and 15 years later she needed her knees replaced . She recovered and was \"fine\" but the damage the injury caused creeped in as she got older.  She ultimately also had to stop working. If she had gotten a big settlement it would have gone to retiring early after she could no longer keep up", "NTA the compensation is like inheritance - its yours and not shared asset.", "I mean her argument doesn’t hold water since you guys… split up your money anyways? \n\nI don’t get the whole 25/75 thing. You’re married. Money goes into account for you all to live. Outside of like money stashed aside for gifts for the other person, it makes no sense for money to be not together. If you don’t want to equally share your money and wealth with each other then clearly they’re not worth sharing a life together as life partners. 🤷🏻‍♂️\n\nYou guys really should find other people. I’m a very little bit of information there are major red flags.", "I think OP is being foolish giving any of it away. \n\nMy litigious MIL sued her church after she stepped into a deep hole on the church grounds and damaged her knee replacements. She got a large settlement, and turned around and gave the church 10% of it. They took it too. So did all the greedy relatives who lined up with their hands out. MIL had to get a second knee replacement and has very little to live on now.", "NTA. This is not a joint decision because it isn’t a joint payout. You were the injured party. You get to decide how that money is divided. That she would rather your parents, who truly need the money,  receive less so that her parents, who don’t need the money, receive a share, is a huge red flag IMO. 🚩", "NTA. If this is a work injury in the U.S, then this money is what you're given due to your injury for you medical care needs along with whatever issues that the injury gave you. She has no say in it.", "She wants you to give away more of **your** money, but not the large sum she just received to HER parents? NTA.", "Be aware of the gift tax which will be imposed if you give over a certain amount to any one person. You need to consult an attorney to find out what the amount is", "My friend was in a serious car accident years ago. Took years to settle. She decided to keep the money and it was a good thing since she later had some health issues and actually needed the money.\n\nIt's generous of you wanting to help your parents. Depending on where you live there might be programs to help with their medications. You still shouldn't give them the money.  Continue as you have been giving them monthly money.\n\nYou also should not be giving money to your wife. Again this money is to cover future medical bills you may have later in life.  Also insurance may not cover costs for an injury you received a payout on - check with you insurance. \n\nTo make everything \"fair\" tell your wife that you decided its in your best interest  to keep the money for future health issues originating from the accident in case. \n\nYou may have flare ups and even if you health insurance so cover there a huge deductible you'll be responsible for if you live in the US. You'll need that money. \n\nBe wise. Put that money into an account in you name only.\n\nNTA for deciding what to do with the money.  Plus your parents and get parents financial situation completely different.", "NDA thats a red flag", "Your wife has some nerve. She can have an opinion but this is not a joint decision. NTA.", "NTA but I wouldn't ever give it to your wife I would put the 25k in saving help your parents and the rest in retirement", "NTA, but why are you giving any money away? This isn’t the lottery - you received that money for a reason. I suggest you speak to a financial planner to find a way for the money to work best for you long term, rather than giving the principal away.", "Not necessarily. Maybe the accident also caused him emotional damage and it cost him money from being able to do his side jobs. I know a dude who got hurt at work and they gave him 2 million and he has great health insurance. He can do whatever he wants with the money.", ">Don't give   \n>  \n>any  \n>  \n> of it away. Do the smart thing and put it in a savings / investment account.\n\nExactly!", "My brother works at a bank. He was telling me a guy got a settlement about 200,000. He kept going to the bank every day to take out large amounts. They tried warning him but he kept it up and went though all that money within 6-8 weeks. That just blows my mind. That’s light changing money if used correctly.", "Yes!! Only this is a McDonald's coffee thing, or a lawsuit to prove a point and is frivolous money, be has no idea what he needs in the future", "Yup OP needs to read this over and over again.  He should not share any of the money.  This settlement is to secure him for any further problems that may occur down the line.  Because he isnt going to ne able to go back and say 'woops i need more' because he gave it away\n\nJust because OP is financially stable today doesnt mean that tomorrow things wont change.  Most people who win the lottery are broke within a few years", "Its like greed isn't it. \n\"Your parents are getting money so mine should too! BEcAusE tHaTs fAir\" \n\nI hate when people try to use the fair argument when they're obviously being so stupid and disregarding other very important factors or just ignoring them and claiming its fair to ostensibly seem like the reasonable and just one. \n\n\"You want fair? OK you get nothing and I decide ill give 45k to my parents as its my own compensation for my accident. It would be unfair for you to get anything now that I think about whats really fair.\" - If I were Op", "Its his blood money. He said he’s financially stable and childless he’s not doing anything wrong.", "OP says the amounts are examples and not what he got of a large settlement.  So for me that added a zero.  Don’t take the amounts as real.  Could also be half, can’t say from the post,", "Yeah, OP kind of snuck that part in about his parents struggling financially even with his MONTHLY help. Was that expense also a joint decision, I wonder.  \n\nAnyway, I also think he needs to bank that cash and not play Daddy Warbucks with it.", "Not going to lie, I’d like to be a fly on the wall when he says he’s keeping it all.", "Actually , one component of the award is bodily injury, another component is lost marital earnings.", "They cannot use preexisting conditions to determine health insurance rates, but the comment referred to cashing out of her life insurance. She would have to pay through the nose to get life insurance of any kind with her history.", "“IF YOU GET LONGTERM PAYMENTS AND YOU NEED CASH NOW”\n\n“CALL JG WENTWORTH, 877 CASH NOW!”", "It was the best commercial too - they were singing an opera with viking horn helmets!", "*DIABEETUS testing supplies*", "I'm quite sure his wife was affected by his pain and suffering if it was serious enough to result in a huge insurance payout.", "That McDonald's Coffee case was not what you think it was. Almost all of the money she won actually went to medical bills, reconstructive surgery, therapies, etc. It is an urban legend that she had basically no injuries and just won a huge frivolous lawsuit.  \n\n\nTo be clear - the initial award of 2+ million was reduced to several hundred thousand, which was not the actual amount she got as they ended up settling out of court.\n\nHad she gotten the press-worthy millions of dollars, it would have been what you are alluding to. But in reality, it was not.", "Yeah back surgeries are terrible. I’ve never met a patient who’s only had one.", "Thank god you’re here to tell him what he ‘needs’ to do with his money…", "\"Third degree burns all over her pelvis\" kind of undersells how terribly she was injured, because most of us can't readily visualize third degree burns (thank God). The coffee was so hot it *fused her labia together.* Yeah your morning cup of joe should not be able to melt flesh.", "That was the point.  She got a large payout because McDonald’s was behaving maliciously after the event.", "His wife is not the one on the spending spree. He decided to give away the money, she is asking him to split what he's giving his parents with her parents. It sounds like his parents need it more, but that's a separate issue.", "They didn’t though they appealed them settled. I think the lady died a year or so after.", "Poor woman. I've had 3rd degree burns on my hands. I wouldn't wish it on my worst enemy. It's unbelievably painful. Your mention makes me glad I don't drink coffee", "You know that the women admitted at one point to asking for extra hot coffee then placed it between her legs? I know that most cars didn't have cup holders back then but... There is so much more to that case then anyone knows except for the lawyers, judges and the platiff herself. It was really screwed up all the way around.\nThe reasons it was settled was because of that. Now cars have cup holders everywhere and all hot items are labeled as hot. But as for op he is being the asshole to himself by not locking that money in an account for future use.", "I assume you mean *causal not casual", "oh okay, that actually does make sense. thanks for explaining, and I hope you're able to find some kind of relief for your pain <3", "Do you know that you are a victim of McDonald's propaganda machine?\n\nShe did not ask for the coffee extra hot. McDonald's was requiring their franchisees to keep the coffee at 180°-190°despite the accepted standard being 140°-160°. At the temperature that McDonald's was serving their coffee, it would cause third-degree burns within three seconds of contact. At that temperature, it couldn't safely be consumed. In fact, food served over 130° will burn the mouth and throat. Also, it came out during the trial that in the 10 years prior to this incident, McDonald's had received 700 complaints of injuries caused by too hot coffee.\n\nMs. Liebeck was a passenger in her grandson's car. The car did not have cupholders. After purchasing the coffee, her grandson pulled to the side of the road so that she could open the coffee and add cream and sugar. As she pulled the lid toward her, it came off suddenly, spilling the coffee on her lap, where it caused third-degree burns to her genitals and buttocks.\n\nMs. Liebeck went into shock and had to be taken to the emergency room. She was admitted to the hospital where she stayed for eight days. She had to receive skin graphs, and was permanently disfigured, with among other things her labia fused together. She lost 20% of her body weight, weighing only 83 pounds on discharge. After leaving the hospital she required care for three weeks which was provided by her daughter.\n\nShe sued McDonald's for $20,000 to cover her $10,000 medical bills, ongoing care, and her daughter's lost wages during the time that she was caring for her mother. McDonald's refused to pay it, which was why it went to court.\n\nThe enormous judgment was the result of McDonald's intentional disregard for food safety standards and the callous way they treated Ms. Liebeck. \n\nThe opinion of the general public that Ms. Liebeck is responsible for her own injuries, and that her case is an example of the tort system run amok, is the result of a deliberate campaign by McDonald's PR team to forestall future litigation.\n\nhttps://www.grunge.com/180272/the-dark-truth-about-the-mcdonalds-hot-coffee-lawsuit/"]}