{"id": 27674, "submission_id": "16swnq0", "title": "AITA for telling a bounty hunter where to find my brother when he apparently lied and listed my address on his paperwork to the bail bonds company and then skipped his court date?", "selftext": "My (22M) brother (35M) has spent his life in and out of jail. He was arrested again a couple months ago for god knows what. He posted bail through a bondsman and was released. \n\nLong story short, I just happend to be sitting in my dinning room eating dinner, when there's a knock on the door. I open it and it's a man wearing a bullet proof vest . He looks confusingly at a piece of paper, and asks, \" is ____ here right now\". I told him that ___ is my brother and he dosent live here, the man then proceedes to tell me that my brother missed court and the bondsman is out for $25,000, and they're looking for him. He asked if I knew where to find him\n\nI gave the man an address for a friends house that my brother goes to 90% of the time for parties, drugs, etc.\n\nWell they caught him there and now his bail has been revoked and he's back in jail. No bail bonds company will lend to him now and no other friends or family can afford to give him the money. I'm sure as hell not giving him anything after the stunt he pulled. He'll just have to stay in jail untill his trial now.\n\nMy mom, aunt, sister, and grandma have all been blowing up my phone the past few days with messages on facebook about how much of a \"terrible person\" I am for \"getting my poor brother in trouble\".\n\nI'm starting to feel a little guilty now, but I don't appreciate him possibly getting me arrested or worse by lying and using my address. \n\nAITA?", "created_utc": 1695754882, "permalink": "/r/AmItheAsshole/comments/16swnq0/aita_for_telling_a_bounty_hunter_where_to_find_my/", "score": 2294, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I told a bounty hunter where to find my brother. Because he lied and used my address on his paperwork and then skipped court. \n\n2. It might make me an asshole because he has no other way to get money to stay out of jail durring his trial.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. All the problems your brother has right now are all his doing. Do your family really thought he could hide forever, or that lying and involving you in his illegal activities without your consent was somehow ok ?!", "Im not going to sugar coat this. Fuck him and the family that enables him. I'm sure they're not upset with him for missing his court date or for lying about his address to avoid getting caught. NTA.", "NTA\n\nHe tried to conscript you in his attempt to obstruct justice. Had you played along, you wouldn't ultimately have helped him - virtually no one gets away forever - and you probably would've gotten charged yourself. He had no right to force that on you.", "NTA…. As someone who also has a problematic brother who caused YEARS of stress, strain, money (so much money spent for his fuck ups) and pain from all his shitty stupid choices, you did the right thing. Ur brother needs to own up to his shitty life choices which are ILLEGAL ONES THAT HE CONTINUES TO ACTIVELY CHOOSE TO MAKE. Its time for him to face some damn consequence for his actions instead of having ur parents bail him out time and time again. After years of putting up with my brothers shit, I did something of the same as you and he spent years in prison and now has finally cleaned himself up so stay optimistic that ur efforts might do the same. 🤞", "Nta\n\nYou didn't get him in trouble, he got himself in trouble and you refused to get yourself in trouble for him.", "NTA - You didn't do anything, your brother is the one that skipped his court date.", "NTA\n\nYou could have possibly been mistaken for him and that could have caused you problems.  Your brother should have shown up for his court appearance.", "NTA, and somehow I don't this one is on you: \"getting my poor brother in trouble\".", "NTA\n\nYour brother involved you in his ridiculous dramatic life of crime. He should have left you out of it. He played around and he found out. It wouldn't have been hard to not involve you, but he did. He never asked you beforehand if it was okay or anything. Oh well. He gets what he gets. That'll learn 'im.", "NTA How do you get someone who has been arrested, charged with a crime and released on bail pending a court date in trouble for failure to appear and bond jumping? Your brother was already in trouble as a result of his own stupidity. His bond was going to be revoked because of his failure to appear and he was going to be remanded. He was either going to get picked up by the police or a bondsman. Either way, he was going to be remanded and have to cool his heals in the pokey until his trial.", "NTA. He dragged you into his shit by getting you involved. This is all on him.", "NTA - he lied and put you and anyone in your house in danger. We've all seen the reports of bounty hunters getting aggressive and even deaths, so if I were in your shoes, I'd have given them the information as well. You didn't do ANYTHING to get him in trouble, he did it all on his own.", "> \"getting my poor brother in trouble\".\n\nYour poor brother got into trouble all on his own, they are more than welcome to shield him in the future if they want to antagonize the the Dog the Bounty Hunter types that show up looking for him.\n\nNTA", "NTA. Your family has coddled your brother long enough. They are enabling his unethical selfish and illegal behavior, and they ought to be ashamed of themselves.\n\nIt's crazy that at 22, you're already more of an adult than the rest of your family, but it happens.", "NTA, you can be charged with aiding a fugitive if you get in the way here.", "NTA.  The problem is your brother makes terrible choices and it sounds like your family enables him.  I'm guessing they have bailed him out repeatedly.", "Your brother put this on himself.  It was his actions, his lying, and his not showing up to his court dat that caused this situation.\n\nIf your brother had showed up for his court case, the bondsman's would never have come to your address and you would never have known of his lying.  \n\nYou told the the truth when you were asked a question.\n\nNTA", "NTA. If he used your address without your consent, he deserves everything he gets out of this. Also, everyone who intentionally skips bail without leaving the country is an idiot.", "NTA- 1. Your brother is the one breaking laws and getting arrested. 2. He or the people he is around is the one listing your address as his on his bond sheet. Making him the one lying.", "Dude…just cut contact with these people, they’re clearly all trashy people.\nWhat did they expect you to do?\nLet this guy take you instead?\nNTA your brother belongs in prison and the rest of your family belongs FIIIRMLY in “no contact”", "You did not get \"your poor brother in trouble\" - your idiot, criminal brother brought that on himself. I'm sorry your family sucks (based on what you've written here).\n\nNTA.", "Laughing at the thought of your 13 years older than you brother, who was on bail for $25,000 and your family think YOU are the one getting him in trouble.\nNta he did this to himself.", "Dude, just set a boundary and walk away from that shit.", "YTA", "Yes, you're the asshole. You knowingly gave false information to a bounty hunter, which led to your brother getting caught. Your brother may have lied about your address, but that doesn't excuse your actions. You should have handled the situation differently, perhaps by contacting the bondsman and explaining the situation instead of resorting to deception. Your family's anger is justified because your actions directly contributed to your brother's predicament.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (22M) brother (35M) has spent his life in and out of jail. He was arrested again a couple months ago for god knows what. He posted bail through a bondsman and was released. \n\nLong story short, I just happend to be sitting in my dinning room eating dinner, when there's a knock on the door. I open it and it's a man wearing a bullet proof vest . He looks confusingly at a piece of paper, and asks, \" is ____ here right now\". I told him that ___ is my brother and he dosent live here, the man then proceedes to tell me that my brother missed court and the bondsman is out for $25,000, and they're looking for him. He asked if I knew where to find him\n\nI gave the man an address for a friends house that my brother goes to 90% of the time for parties, drugs, etc.\n\nWell they caught him there and now his bail has been revoked and he's back in jail. No bail bonds company will lend to him now and no other friends or family can afford to give him the money. I'm sure as hell not giving him anything after the stunt he pulled. He'll just have to stay in jail untill his trial now.\n\nMy mom, aunt, sister, and grandma have all been blowing up my phone the past few days with messages on facebook about how much of a \"terrible person\" I am for \"getting my poor brother in trouble\".\n\nI'm starting to feel a little guilty now, but I don't appreciate him possibly getting me arrested or worse by lying and using my address. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA and depending on what crime he committed, you could be charged with accessory after the fact or aiding and abetting.", "NTA!He made his own bed, let him lay on it...\n\nHe is the one who decided to lie to the bail bond company and then miss his court date... how are you responsable for any of it??...\n\nYour brother and your family allowing him to play victim are the ones in the wrong here... not you.", "NTA my friends and I have a deal that if ever there's a bounty we contact one or all of the others to organize turning the person in so at least someone gets the reward money.", "NTA, All Day, All The Way, All Week, All Month", "NTA your brother did the crime and now gets to do the time", "NTA. “Your poor brother” got himself in trouble by breaking the law, skipping out on bail and lying about his address, etc. If you interfere you could get in a lot of trouble. I’d suggest you remind your family of this but I get the feeling they wouldn’t listen. Don’t let them get to you. You didn’t do anything wrong here.", "NTA your family are shits for guilting you.", "NTA. He's an asshole for getting you involved. Someone showing up at your door in a bulletproof vest, probably with a gun, expecting to find a runaway criminal could've ended badly. Your family needs to get it together and stop blaming you.", "NTA - Tbh I would have cut those family members off already", ">your family really thought he could hide forever, or that lying and involving you in his illegal activities without your consent was somehow ok ?!\n\nI honestly don't know, \n\nthey act like he can't do any wrong.\n\n He was never disciplined as a child, and now that mom can't save him when the law gets involved it's somehow my fault", "Thank you, \n\nMy mom has probably spent tens of thousands of dollars over the years on my brothers legal problems.  Now that she can't help him anymore, he was never disciplined when he was younger. Our mom has always coverd for him no matter what it was, but now it's supposedly my fault that she can't help him anymore?", "NTA-  it’s not just the bounty hunters. If he used OP’s address here he would have used it other times to get out of trouble.\n\nThere are many stories of innocent people being killed because someone thought the person they were after lived at a certain address.", "I don't know about walking away, \n\nMy mother is a nice and kind woman, it's just that she's always let my brother get away with any and everything thinking that it makes her a good mother.", "I didn't know he used my address. I only told the agent a place that he hangs out all the time. My brother dosent even have a house, he just crashes on couches of friends and family.", "What was the false info?  Sounds like it was true to me,  what if the bondsmen was one of those jerks that would have busted in and shot OP?  Sounds like you have something in common with OPs brother, maybe.", "The judge already revoked his bond and issued a bench warrant. Why do they think the bondsman wanted to pick him up?", "Yeah, I understand the love a parent give to their child, but damn they need to see that he is not a good person and that enabling him by protecting him won't fix his issues.", "Your mother is not nice and kind. She is dragging you deeper into this mess, and blaming you for the mess, that she created.   \n\n\nHow is her telling you that this is all your fault, her being nice and kind?", "The person you're responding to didn't understand your post and thought you lied to the police. I have no idea how they came to that conclusion.", "The details don't matter to my family when it comes to him. It's been this way since we were kids. He can do no wrong, end of story.", "Sounds like they may be the brother 😁", "What some people don’t understand would fill a large number of very large warehouses.", "NTA, at all. Ur brother is making horrible life decisions, and is facing the consequences. Ur family sounds like mine with my cousin: the dude is nearly 40, has been in and out of jail for years and has cost the family probably over 100k over the years, and yet my aunt and uncle (and formerly my late grandma) insist on bailing him out every time. Some people are just incapable of separating emotions from these situations.", "That was a dick move on your brother's part.\nSome bondsmen offer a reward for capturing a bail jumper. Contact the bondsman to see if he'll slide a few bucks your way.\n\nNTA", "NTA My younger brother did this exact same thing to my older brother and I. Our house was raided multiple times for months. It was annoying as hell to deal with. Screw him, he made his bed now he will have to sleep in it.", "NTA. Look up the laws in your area for harboring or aiding and abetting a fugitive. He could have given the address of any other family member, I wonder why he chose you?", "NTA.      but how did your family find out you gave out the address? If you told Anyone, YT A  to yourself for them blaming you.", "NTA. Your brother is a 35 year old MAN. He’s old enough to make his decisions and your relatives reactions and how non-seriously they take his poor decisions and behavior is the reason he is the way he is. They’re just enabling his bad behavior. They didn’t have any comments on the bail jumping or him trying to drag you into his mess?", "NTA\n\nYou're probably not going to win on this one.  The guy is almost 40 and it's absolutely not your job to cover for him.", "The bonds place didn’t verify the address ?", "NTA, your brother played a stupid game and won a stupid prize. If your family is that concerned, fund a GoFundMe.", "NTA  If he didn't want you involved, he should not have used your address without clearing it with you, and he definitely shouldn't have skipped his court date.", "NTA.\n\nJust food for thought...\n\nYou're lucky he knocked. People have been killed by police officers executing no knock warrants searching for people.", "Nta", "NTA. I would be livid if anyone knocked at my door asking for a person that doesn't live with me nor crashed on the couch.", "NTA.  You didn't get him in trouble. He was already in trouble and still digging. That a-hole nearly SWATed you.", "NTA, sorry your family sucks.", "NTA. Honey, cut ties with your whole messed up family before it's too late. Walk away, don't say where you're going, and don't look back.", "NTA.  Let go of any guilt.  Your brother put you in jeopardy.  Just because he wasn’t there that night does not mean the bounty hunter was never going to knock on your door again.  They were going to continue looking for him until they found him.  They’re also would be likely to assume you were covering for him.  So they were going to come back.  \n\nRepeat this over and over…”I am not required to set myself on fire to keep my deadbeat brother warm.”", "NTA and maybe your brother wouldn't be a career criminal today if he didn't have family who kept trying to protect him from the consequences of his own actions.", "NTA. He potentially put you in danger. Interactions with bail bondsmen sometimes go wrong and turn violent. Your brother sent that potential to you. Screw him like he’s the slowest sheep in Montana.", "How did they find out that you were the one that ratted him out?", "NTA. I have someone in my extended family who is 21 and headed this way. He is diagnisable as a sociopath (F60.2). You msy with to consult this and see if it fits.\n\nhttps://www.theravive.com/therapedia/antisocial-personality-disorder-dsm--5-301.7-(f60.2)#:~:text=Introduction,considerations%20of%20others%20without%20remorse.\n\nIf it's this, he needs to find a reason to stop ... religion, love, a belief in the merits of doing the right thing.", "NTA, you could have ended up in a cell next to him for \"helping\" him hide out.  Worse scenario is the cops kick in your door looking for him.  As he did his get an order of protection against him.  If he somehow gets out, he will not be allowed to use your address.", "NTA but I don't know why the fuck you would tell anyone you did this, honestly.", "Nta.\n\n Tell your family\n\nI am bad for getting him in trouble? What trouble is that? The trouble that got him arrested in the first place. The trouble that made him skip his court date. Oh hiw about the trouble of lie of where he live to the bail bonds. Oh maybe it is the trouble of being terrified when people in bullet proof vests come banging on my door. Is that the trouble you mean? Or maybe the cost of 25k for whoever put that up they would lost because he skipped court. \n\nIf you feel those are me getting him in trouble. That its acceptable to do whatever he did to get arrested. Lie. Avoid the consequences. If that's acceptable to you and acceptable to place me in the middle of it which could get me charged with aiding because of it. Then maybe you need to look long and hard at yourself. Look at what you taught people about this. To blame me for him doing all that means you taught him the bad habits. Maybe it's best if we take a break on any relationship because I do not want to be family with people who don't care about what it caused me or could have caused me.", "NTA full stop.", "NTA. You saved people from your brother. Your brother is going to jail FOR A REASON, and he will be punished for what he did. It is never an AH move to tell the truth if you know where a person is hiding from the law. Good job OP!", "NTA. Your brother potentially put you in danger, bounty hunters aren't always known for knocking first. He made his choicea and he can live with the consequences.", "Hiding your brother is a serious crime.  You did the right thing.  NTA", "NTA - have you ever heard the phrase \"Don't do the crime, if you don't have the time\"?  Well, your brother is living proof of that. He's the one who skipped out on bail and missed his court appointment - basically, he fucked around and found out. It's his own fault, not yours.  Block the family for the time being. From the sounds of it, they have no idea of the consequences of actions.", "NTA\n\nBut how did the family find out you told the bounty hunter where he was?  Did the bounty hunter stupidly tell the brother?  What a dumb asshole.", "You're NTA, if you want to put a stop to it, go on the attack. Tell them every time they bailed your brother out of trouble, they were implying that what he did was okay, that it wasn't a big deal so he kept on doing illegal stuff that got him arrested. That a big reason he's in jail right now is because of them. You have the right to protect yourself from being dragged into the mess that they and your brother created. \nIt's time to stop being nice about this. They don't have any problem blowing up your phone or trying to shame you on facebook. If they keep at it, reply on facebook with what they've done to create the mess your brother is in. If they start to feel the shame, maybe they'll think about if they should change. Otherwise this is just going to keep happening until they go broke or he does something really awful.", "Did you break the laws? Did you miss your court date? Did you attempt to steal from the bail bonds guy? Uh, no. So no, you did not get your 'poor' criminal brother in trouble. He managed that on his own. NTA", "Tell your family that this behavior is why he is in this spot to begin with. Tell them when he involves them in his crimes they can go with it and become an accomplice.", "YOU got him in trouble? HA! He's right where he belongs. NTA!", "As someone who's brother has been in prison (for armed burglary with the homeowner in the house) and my parents still treated him like the golden child and as someone who has had a bounty hunter show up to my home TWICE looking for a person I have never heard of NTA. Your family needs a reality check.", "NTA Do the crime, then be prepared to do the time.", "He tried to get you in trouble.  You only reflected his own trouble back to him.  \n\nNTA", "NTA.  The reason your brother is in jail is for getting arrested then failure to appear.", "NTA.  Your 'poor' brother got himself in trouble,  twice (at least). Not your problem. Maybe some time behind bars will teach him a lesson.", "Nta. You didn't do a single thing wrong op. Your brother got himself into his legal trouble all on his own. Don't respond to family, just block the whole lot and move on.\n\nYour brothers consequences are his to deal with, and all from his own illegal activities. Might be time to go no contact with the whole lot of them I'd this is their normal behavior.", "Your poor brother got himself in trouble. You didn't break the law for him.\n\nNTA", "[deleted]", "Nta.u didn't get him in trouble his shitty behavior got him In trouble", "Oh yes you a \"terrible\" person because you turned in a criminal . Btw can't you get in trouble if you don't inform them of his whereabouts", "YTA Stabbing a family member in the back at drop of a hat is beyond horrible. I get it's not really cool for him to use your address like that but this is taking it way too far. It sounds like your brother is going for a real rough time right now and you just made it worse.", "NTA\nThis should explain how Trump got 80 million votes and is the GOP front runner.", "NTA but you are a snitch", "NTA for not bailing him out but AH for giving them his address. Could have just said he doesnt live there and you dont know where he is. That would have been suffice instead of being petty and gave out, not just his and someone else's address. You didnt like it when he listed your address but you are just like him, giving out addresses without permission.", "YTA. You couldnt have been arrested or anything worse. Your whole family should disown you.", "ESH\n\nShould your brother listed your address as his, no.\n\nBut why did you give info to the bail bondman? You could've said \"I don't know where he is.\" and extricated yourself from the situation, instead you chose to give him up? And for what reason? Because you're dumb enough to think a bail bondsman is going to arrest you because you're brother listed your address.", "NTA. If anything, your family's enabling of him was a contributing factor as to why he ended up like he did.", "NTA- if people expect you to cover for their lies, they should at least give you a heads up. Did the bounty hunter give you a cit at least?", "NTA. Your family should be offended on your behalf that your older brother would put you in jeopardy.", "Are bondsman this trash now. Posting a bond with zero proof of residence? Lol", "No", "NTA.  The women in hi s life never holding him accountable is half the reason he's like this. Your brother would sell you out for a nickel.", "NTA for letting them know where your brother was. However, you shouldn’t have let your family know that you were the one who told them.", "NTA OP.", "NTA.\n\n\"No, he got himself in trouble. And then made it worse by failing to show up in court, and then tried to involve me somehow by pretending my home was his. I don't know what he was thinking or why, but I do not want my life tainted by the stain of his crimes and lies.\"", "NTA Your brother got himself in trouble. Tell your family to stop enabling him and maybe he will turn his life around.", "NTA. Your family’s response is probably why he keeps yo-yoing in and out of jail in the first place.", "NTA\n\nI’ve always failed to understand the situational ethics that people use when they justify letting someone lose $25K because someone skips bail, or to justify not paying child support, or other things like that. You did a good thing. I’m sorry your family doesn’t agree.", "NTA at all, your brother made his bed, not you.  He skipped bail and now has to do the time.", "NTA. Ask your family if their reaction would have been the same if you lied to the bounty hunter and got arrested for aiding a fugitive? You didn't get your brother in trouble. He got himself in trouble. He lied by putting down an address he knew was not his and from his history, knew would be the first place they looked. Your brother is 35, not 16. He needs to be an adult and face the consequences of his actions.", "NTA", "He got in trouble cause he committed a crime and ran from the law. No guilt. You may be the only one in your family with a backbone. Be proud of it.", "NTA.  You didn't commit the crime for him so you couldn't have gotten him into trouble.  He managed that all on his own.", "Lol he got himself in trouble and pulled you into it. You just set the record straight. He can stop doing illegal shit if he doesn’t want to get into trouble. \n\nNTA", "NTA your loser brother got himself in trouble, and the people blowing up your phone are his enablers. I would separate myself from them all, because they are toxic.", "NTA. He had it coming for falsifying his documents and skipping court dates. Are your family members just dumb or something thinking he would get away with skipping court date?", "NTA", "So unfriend them on FB and ignore them if they text or call you.  NTAH.", "You getting him in trouble? Nah, these were the consequences of his actions. NTA.", "NTA …. ‘Getting him in trouble’ ?!?   Are these family members dense?  He committed a crime, lied to get released, missed a court date - I would say he got HIMSELF in trouble.  Did they think if you had not given that address his troubles were over???", "NTA. He put down your address without your knowledge or consent. That's all there is to it.", "You got the criminal into trouble? Ok, boomers.", "Your family is mad at you for getting your brother into trouble? He was ALREADY in trouble.\n\nNTA", "For getting your brother in trouble, remind me again how you made him make bad decisions?  NTA", "NTA - this is a him problem not a you problem.", "Nta just block their numbers for a while and let them know you will not be lying to any law enforcement at any time on behalf of your brother.  If he doesn’t want to be jailed he has the choice of not committing the crime in the first place", "NTA. But family sure is.  Next time he can list them, and they can have a man with a gun show up during dinner.", "NTA\n\nA huge reason why your brother has continued on his path of self destruction is because your Mother, Aunt, Sister and Grandmother all think that he is your \"poor brother\" and someone else has been getting him in trouble.\n\nHe got himself in trouble and now he has to pay the consequences. If all the women in your family continue to harangue you about this, you might want to consider blocking them - temporarily at least.", "NTA. He’s an adult who made an adult decision. \n\nComing from a person who’s brother is very very similar, it’s not your problem.", "It’s not like you went out looking for cops to snitch to. Your brother essentially sent them to you. So it sounds like your brother got himself in trouble. You just didn’t stop it from sticking. NTA.", "NTA. If your brother was willing to use your address for a bail bond—what other financial transactions would he be willing to put under your name and address? Your decision was a good one. Keep your distance.", "Tell them, next time he needs bail, they can bail him out. I didnt agree to let him post my address without asking.\n\nNta.", "Nta. What's to stop them from kicking your door or being planted outside of your house 24/7?", "If that’s your family’s attitude, I can see how your brother came to his complete lack of accountability. NTA", "All of this would have happened if you helped the bounty hunter or not.", "NTA. Your brother could have avoided all of this by showing up when he was supposed to. If your mother wants to lie to people as a matter of course, I guess that is her business, but if you don't want to lie to people as a matter of course, that is your business.", "NTA, “family sorry you feel that way, glad you are volunteering to help, I heard that you can put your house up for the bond if you actually want to help bro, if not fuck off”", "Honestly he didn't give you a heads up about using your address or skipping bail you have no fault on this if he didn't get permission or even give warning NTA", "NTA your brother fucked up.", "I mean, if it was my brother, I wouldnt of grassed him in. Hes sounds very much like yours and  I havent spoken to him for years. Get that he gave you details, which caused you a minor inconvenience, but theres no need to give any info IMO.\n\nESH", "NTA", "Nta. He dragged you into the situation by lying and whatever he did to be in trouble. That's not your responsibility", "NTA. You didn't 'get your brother in trouble', it sounds like your family are horrible enablers. Be careful to avoid falling down that hole.", "NTA\n\nYour family sound like a bunch of morons and your brother is determined to drag them all down with him. Good on you for doing the right thing.", "NTA.  But how did they know you gave the address?  I would have made sure no one knows.  Half the problems in this forum are because other people know about things they shouldn't know about.  Keep your affairs private.", "Your family is a bunch of enablers. Your brother made a commitment to show up to court and he didn't follow through on it. YOU did not get him in trouble. He got himself in trouble. NTA", "NTA. It’s not your job to “protect” your brother from the reckoning he has coming.", "NTA. Your brother got HIMSELF in trouble. And, yes, he could end up getting YOU put in jail. \n\nMy ex's brother used my ex's name and SS# during an arrest, my ex got pulled over for speeding, and ended up in jail for the warrant. At court a few days later, he is there and the original officer is there, who says my ex is not the guy he arrested. My ex showed a pic of his brother, and gave the court his brother's address.", "NTA!! He’s the one who keeps doing dumb shit like getting arrested, skipping court and bail! Using your address with out even telling you is messed up!! I feel like you may be saving him from himself. From your families reaction it seems they enable and coddle him then run to his rescue that’s why he keeps doing this! Good for you putting your foot down and not letting him use you like he does them!!", "NTA", "NTA, he got himself in trouble, and had the audacity to list YOUR ADDRESS. Meaning YOU get hassled when he disappears.", "NTA. If he had done even the bare minimum, he wouldn't be in this situation. You're aiding and abetting a fugitive wouldn't have helped him. Sometimes folks need to hit rock bottom and suffer consequences to begin changing.", "NTA I’d do the exact samething", "If you're going to give a false address then there are two ways to do it.\n\nThe first way is to give the address of somebody you know, and give them a head's up.\n\nThe second is to pull a random address from some place you've passed by before, preferably an uninhabited building or some apartment complex with a high turnover rate. \n\nYour brother failed to do either thing. If you want your relatives to zip their lips when they see the bail bondsman on their doorstep, you have to at least have the courtesy to inform you that you're using their address. Talk about a violation of the social contract!\n\nNTA.", "NTA, he involucred you giving your address, fuck him and amy family member who supports his doing", "Nta your family sucks for enabling him for so long", "NTA - he FAFO, sucks to be him.", "NTA! Don't let yourself feel guilty over this.  \n\nI had a relative like this.  In and out of jail. Always bailed out. Always gave out our address and phone #.  Strangers calling looking for him because he owed money, was in trouble, etc. My dads family was like \"Poor guy, everyone is out to persecute him.\" Always an excuse till one day ended up with 20 yrs for threatening to kill the judge and a whole list of other things.  He told the family his ex got him in jail for not paying child support and other stories that they believed.\n\n When he got out it started again. Eventually he got his act together and stopped the alcohol and arrests stopped, but it took 40 years.  He is still a screw up and depends on others and never  does what he needs to do, plus asks for money. \n\n I went NC with him because I didn't want that burden to be passed on to another generation and all the negative childhood memories were more than enough.\n\nIf your brother dies, you will be the one completely responsible in their eyes. \n\n For your well being go LC with your family and cut him off completely.  He will never learn as long as they keep bailing him out and never letting him be responsible for his actions.  You will be the one they blame, & the one they ask.  Also, keep your ID on you, he might give your info again or even use it if he gets in trouble.  \n\nIf anything, you should feel pissed that they are treating you like this.", "NTA\n\n>  \"getting my poor brother in trouble\".\n\nHe did that to himself.", "You are NTA. The bigger problem is, is not only your brother, but your family for enabling him. Hate to say it, but the best thing for him, is for him to stay in jail for awhile", "NTA. Looks like you’ve got four good leads as to why he’s like this, and why he thinks he can still get away with it.", "OMG!! NTA, not even a little bit. You're lucky you didn't have a much worse experience with the bounty hunter.   \nYOU did not get your brother in trouble, he was already in trouble. It was just a matter of time before they caught up with him. There is no excuse for him giving your address to the bail bondsman. Tell the family that had he not lied and sent them to you then you wouldn't have been in that position. Once again, his doing, not yours!", "NTA. You didn’t get him in trouble, he stuck both feet and arms in well before this and face planted when he skipped out.", "NTA but next time don't let anyone know you ratted him out. \n\nHopefully he won't be using your address again though.", "Do not feel guilty. Your brother put you in a very bad situation.\n\nAt least the bounty hunter was good enough to ask questions before acting. That isnt always the case if they have a listed address. If you look enough like your brother, and they decided to take you in, that could very well be a situation where you get injured or more.\n\nYour brother cant be trusted, and he set you up for a possible bad situation. Tell your family this, and if they dont like it, they can pay his bail (if he ever gets it again), and see how that turns out. \n\nYour brother betrayed his family (Specifically you, his own brother!!!), so make sure you lead with that any time the conversation comes up.", "NTA-You’re family is trash.", "NTA to your brother, but why in the everlasting fuck would you ever tell anyone that you gave the address?! YTA to yourself for that.", "You didn’t get him in trouble.  He got himself there.  NTA", "NTA\n\nYour brother broke the law and Skipped his court date. Thats on him. He is also the one who put your address down. HE put you in the position to potentially have to lie for him to a (probably) intimidating man in a bulletproof vest who is standing at your door looking for him. If he put your address down as a residence they would probably keep coming back to your place til they find him. \nYour family is crazy for blaming you.", "NTA. He put you in actual danger by giving the bondsman your address. They’re not always as polite as that one was. If he doesn’t want to go to jail, he should stop doing crimes.", "NTA - your brother got himself in trouble. Ask them who did the illegal act, you or him?", "NTA you could’ve gotten in so much trouble, not going to sugar coat this but ur brother sucks for almost screwing you over and so does ur family for enabling his actions without taking into account how it could affect you", "NTA too many get bail when they shouldn’t anyway", "NTA", "NTA.  Brother got his own dumb arse in trouble. Tell the family there is no way you are going to lie for him.  You did not break the law, he did and screwed the bail bondsman out of $25K.  Brother needs to quit screwing up, it is not your fault", "NTA, but out of curiosity, what did he do?", "This title alone gives me whiplash NTA", "NTA \nYour brother is an addict and a jailbird. Jail is the safest place for him.", "Getting your poor brother in trouble??  Oh please. He got himself in trouble. If he hadn't used your address you would never have become involved. It's his own fault. And the fact that the rest of the family continues to enable him is probably why he's continually in trouble. You have nothing to feel guilty about.", "Why would you tell people it was you?\n\nAlso you should have ask for a cut for doing the hunter's job", "NTA, but I'd ask that bounty hunter for a finder's fee/tip. 😊 He easily made about $2500. Surely, he could come up off $100 or so.", "You didn’t get him in trouble. His consequences just finally came around.\n\nMy sympathies for having such a shitty and enabling family attacking you for doing the right thing.", "NTA your brother made his bed now he has to lay in it", "NTA, i cannot find a single reasons why you would be. Crime Culture wouldnt even say youre a snitch because he tried to throw you under the bus first by using your address. In every sense of the phrase, you were in the right", "NTA\n\nYour brother INTENTIONALLY gave your address, knowing he wasn't going to appear. He knew bail enforcement would show up at your house and that things could go badly for you when they did. Point that out to your mother when she's blaming you for his catastrophe of a life. If things had gone wrong and you had been injured or, God forbid, killed , who would she blame then? Tell her that, she needs to hear it.", "With lots of priors and a $25000 bond, he's going to be doing some jail time eventually for whatever crime he's currently in custody for.  More now that he'll be convicted of bond jumping.  The time he spends in there now will just be credited toward his sentence, which will almost certainly be longer.  Besides, he can't seem to manage on the outside anyway, so he's probably better off.\n\nYou didn't get him in trouble, he was already in trouble.  That's why the bondsman was there.  If you didn't provide any info, they would have found him eventually anyway.  At best, you saved them a few days.", ">possibly getting me arrested or worse by lying and using my address.\n\nYou're good, this is on him not you. You did exactly the right thing though by telling them where to find your brother. And you need to impress upon your family members that it was YOUR BROTHER that got HIMSELF in trouble by not showing up for court. Try explaining to them that the bondman would be out $25K if your brother wasn't re-arrested. Is it fair for him to have to pay for your brothers misdeeds? If you need to block them for a time, so be it. \n\nNTA. Thanks for doing the right thing.", "'mom, aunt, sister, and grandma' can pay his bail.\n\nNTA", "100% NTA.", "NTA. You actually did him a favor. He needs to be held accountable for breaking the law.  Maybe he’ll get the help he needs in jail.", "NTA.  To me, you must obviously protect what is yours first and foremost.  Sometimes when family members who live on the edge get into troublesome situations, it can be difficult to choose a prudent course of action.  I assume you know your brother well.   If you know his heart is in the right place, then help him whenever possible short of putting yourself or other family at risk.  If, however, you feel the opposite is true then cutting him off may be the best approach.  It's frustrating and certainly doesn't feel good to do especially to a sibling.  I've had to do it myself with some family and it was a struggle to do and still is.  The phrase 'easier said than done' most definitely applies here.  Make a decision, stick with it and always stay true to your convictions.  Good luck.", "NTA", "NTA. Your \"poor brother\" got himself in trouble when he broke the law got bailed out, and then broke it again by skipping court.", "I come from a similar family dynamic. You're nta and don't be guilted into believing anything different.", "I have a brother just like yours, NTA. Do what's best for you, and the home you worked hard for. You family are enablers and  only make the problem worse for him.", "No", "Your brother got himself in trouble, and tried to pull you down with him.  \n\nNo thank you!\n\nMom, auntie, sis, and granny's willingness to look the other way and refusal see your brother as responsible for his own actions may well be part of the problem.\n\nPerhaps there are some \"terrible\" people in your family.  But you're not one of them.\n\nNTA", "NTA- He could have gotten you arrested or seriously hurt because of what he did. Ask your family why they don't care about that.", "NTA This is on him, his entire life has been on him. No one forces him to do drugs or the likes, his stupid stunt by listing you on his bail? You should never have no loyalty to a man who would screw you over by getting bounty hunters on your ass.", "NTA. He’s the numpty he is right now because your family coddled him instead of holding him accountable.", "NTA", "NTA.", "Nta. As long as you didn't get a cut for the Bounty it's his problem.", "NTA. YOU did not put your brother in jail. He did. He made the choice to skip his court date. That is 100% on HIM. The bail bonds man would have found him eventually. May have taken a little more time, but they would have caught up with him, and he would be jail anyway. He still would his bail revoked, no one would have any money for him and he would no better off than he is now. The only difference is your family wouldn't be blowing up your phone, so let them know that in one message sent as a group chat. Then let them know to knock off the BS or your going to start blocking people and letting them remove themselves from your life, because your not dealing with their nonsense and ridiculous idea that it is perfectly acceptable to commit crimes, run, hide from police, and expect others to pay for it help you do.", "I mean if he's been in and out of jail his whole like do you really think once more is going to help? Also jails are full of COVID so...", "So if this had been a rogue bounty hunter--he could have shot first, asked questions later.  Or maybe just roughed you up.  You don't know what all could have happened.\n\nThis is almost a form of swatting(because the what if police had decided to look for your brother at YOUR address?)\n\nYour brother committed a crime(or is accused of doing so) and by skipping bail, which I'm pretty sure is a crime in itself--so your brother committed a 2nd crime and tried to hide behind you to do it.\n\nStop feeling guilty, he got himself in trouble Both initially and secondarily.  And with any luck he'll go \"no contact\" with you because you don't need this trouble in your life.\n\nSorry you are getting guilted by your family, but they weren't the one who's lives were endangered by his actions.\n\n&#x200B;\n\nNTA", "Nta. Let them say whatever they want, he did it to himself. I’d be going LC with the fam. It’s not like you can take back what you did, he’s stuck in jail lol", "Obviously NTA. Your brother got himself in trouble, not you. Unfortunately he dragged you into this by giving your address. Not your fault either. Sorry you’re dealing with his problems.", "NTA. You didn’t get him in trouble. He got himself in trouble. And then he missed court. So he would have been arrested eventually anyway.", "NTA. Your family has not done your brother any favors by enabling him. He’s never going to change if there are no repercussions for his actions.", "NTA. Your brother made this bed and now he has to lie in it. He should not have left your address as his.\n\nYou're going to get a lot of blow back from your family, but I (a stranger from forever away) believe you have done the correct thing. Stay strong.", "Yeah YTA\n\nDon't talk to bounty hunters.", "NTA.\n\nYour brother is a criminal who belongs behind bars.\n\nYour family is a bunch of enablers and apologists.", "NTA, play stupid games win stupid prizes. Your brother just got a harsh dose of reality. There are consequences to actions, he's a grown ass adult and needs to act like it.", "That’s so weird how they’re all enabling his crappy illegal behavior. How is it your fault? You didn’t make him do those things.", "NTA. Many of us have that family member. Most of my family actually prefer that ours stays in jail because then we know that he’s safe and not high or dead somewhere. Your brother got himself in trouble, he’s a big boy that needs to get his shit together.", "Nta - he created these problems himself, not you.", "You:  NTA\n\nYour family and brother:  AH's\n\nHow did they know you gave the info?  If you told them, you shouldn't have and should be very careful in the future what you share with them.  Also, I believe it would be illegal to not give that information if you know it (abetting).  I'm sure someone here knows more about that.  He also may have committed perjury?", "NTA bc he knew what he was doing regardless of how others felt especially when it’s repetitive. If everyone continues to bail him out every time he gets in trouble he won’t ever grow up and learn.", "NTA. They could have gone after you and your house since he listed your address. Sorry but I wouldn't save him either. If the females in your family are so concerned they can put their house for bond for precious golden child and see how great he is when he nails on that bond.", "Nta my late brother was like yours, difference is that we after trying and trying kinda  checked out after him repeatedly stealing from us and neighbours and decided to help police to teach him a lesson. That his actions has consequences, he won't be welcome if behaving the worst. \nDuring short jail time, he managed to make a certificate and got his qualifications higher in finding a job. \nUnfortunately one day highly intoxicated his friend was a driver and they were overspeeding and the driver hit the bridge killing my brother and his pregnant girlfriend. \nI am telling you this bc:\n1. In jail there are rehab programs helping people gets straight\n2. In the way this is going, unless your brother is stopped he may end up killing himself or hurting you- your family even unintentionally. \n3. Enabling only gives him thinking he is above the law and no consequences for him. Break the sick circle.\n4. If needed send your family this post to make them see your perspective and people's comments on it. Send a message this time he has endangered you. Next time it may be your mother, grandma, aunt.", "NTA", "NTA. Could you have been hurt or had your property damaged? Your brother endangered you with this stunt. Your family needs to STFU. I doubt they would be happy if the bail bondsman had knocked on their door, either.", "Do not feel guilty. What if the police raided your house because he used your address. He would not care about you and your family. NTA", "No, NTA. His fault for lying, and maybe jail is right where he needs to be.\n\nIf I can add something personal, my stepson got bailed out of jail last week by his deeply codependent wife, and he just OD'd about two hours ago. (Still alive, last we heard.) I wish he'd stayed in jail. He might have gotten help if he'd stayed in.", "NTA, that asshole could have gotten you shot.", "LOL on getting your brother in trouble.  Nope, he did that!  My husband has a half-brother that was arrested a boatload of times for various things (usually drugs) and after his fourth time in jail for 8 years, he got out of jail and is (for now) still out for the past 3-4 years.  Your brother doing stupid things has nothing to do with you and your family has to stop blaming you and start blaming him.  Of course you needed to get the bail bondsman off your property, you brother was TA to give your address.", "Don’t feel guilty. Your brother got himself in trouble, you didn’t.\n\nSoooo NTA, but your bro and family members are.", "Nta, 100% your brother fault", "Also, the only thing OP changed by giving out the address is how long the brother would spend 'on the run' before going to jail.  Every other consequence (bail revoked, forfeiture of the bond money, no bondsman taking his business) happened because he missed court.  On that day the judge issued an arrest warrant and all of those consequences were waiting for the defendant once he was picked up, either by a bondsman or the police directly.", "All of this.", "Problematic brother here who for whatever reason is also the “golden child.” 🙄 His last heinous action has made me go NC with him, and despite my parents’ wailing and gnashing of teeth, I refuse to budge.\n\nInconsiderate, selfish, entitled, destructive assholes only get so many chances in my life. And if someone chooses to support said asshole, and whine at me that I need to give a 164937393748472th chance “because family,” then they get the privilege of me going LC with them.", "Yeah, we've all seen how trigger-happy a lot of cops are.  Potentially bringing the law down on your home is a big deal.  It's not dramatic to say there's a real possibility someone would shoot first and ask questions later.", "You don't have to cooperate with a bounty hunter lol, OP could've told him to kick rocks.", "They could never charge OP with anything if he just stayed out of it and said he didn’t know anything about his brothers whereabouts. Sure he’s a fuck up but OP is a little weasel who sold out his family", "Yeah, it's like they don't realize that bailing them out every time only makes things worse, they won't correct their bad behavior if they know that mommy and daddy will swoop in to bail them out.", "The bounty hunter left me their card for the bondsman's office. But honestly, I don't even want anything else to do with this whole thing. \n\nI also don't even need or want the money. I have a good construction job with benefits that allow me cover all my living expenses and most of my wants. And I'm thankful for that", "> Either way, he was going to be remanded and have to cool his heals in the pokey until his trial.\n\nEssentially yes.  Though, having watched plenty of court streams, there is a small chance you can recover from that if you work with your attorney to surrender ASAP, have a good excuse for why you missed court, and have a fairly lenient judge.  Generally better odds if you don't have a history of FTA and the crime is relatively minor.\n\nStill, I wouldn't blame OP one bit and evidenced by the fact that the brother was hiding out at a friend's house I doubt he was ever going to turn himself in!", "Yeah, that night really scared the hell out of me. I was probably 3 seconds away from drawing my gun before I saw bail enforcement on the guys vest", "No idea, but that was a scary night. I was seconds away from retrieving my gun when I opened the door to an armed man wearing body armor. If I didn't see the words \"bail enforcement\" on his vest, that night could've ended very badly.", "He called our mom when the Bounty Hunter arrested him.", "Yeah, he would need to show proof of address before they fronted his bond.  Not sure what state this was in.", "Yeah, in my state, bounty hunters are allowed to force entry on the property listed on the bond agreement", ">He potentially put you in danger. Interactions with bail bondsmen sometimes go wrong and turn violent.\n\nYeah, you don't know how close I was to running to get my gun when I opened the door to an armed man weraring a vest. That night could've been very bad.", "Either he put 2 and 2 together or the bounty hunter told him.\n\nHe called my mom to beg for money when the bounty hunter found him", "I didn't tell anyone, the bounty hunter must of mentioned it to him when they caught him and he told my mom while he was on the phone with her asking for money", "Well said, I don't want to be on the hook because my brother owes a bail bondsman 25,000", "That's what I'm saying. I don't want to get killed or arrested because my dumbass brother owes the bail bondsman 25 grand.", "It could've been the Bounty hunter or my brother put 2 and 2 together", "How would he be in trouble?", "Then don't collaborate with bounty hunters.", "I sure can, harboring a fugitive is what I think it's called", "Bro he skipped court. Time for bro to learn how the world works, that is actions do have consequences!", "Harboring a fugitive would've put me in jail with him", "His brother is a criminal on the loose evading justice.  Do you think the hunter and law enforcement would leave OP alone forever if they hadn't caught him? They literally had only OP's address to go on.", "A. I was close to getting my gun out when I saw an armed man on my porch. \n\nB.  harboring a fugitive would in fact get me arrested\n\nC. I'm lucky the agent carried himself professionally and double checked the paperwork and didn't just haul me in and ask questions later.", ">Your whole family should disown you.\n\nWith a family like this, that would be a blessing.", "Do you think I wanted the bounty hunter coming back for me after he found my brother for harboring a fugitive?", "How is it false information if *checks notes* the bounty hunter found him at the friend’s house? It was the brother who put himself in this position and his family hadn’t stopped making shitty excuses for him yet. OP did the right thing. What if OP had company over and an over zealous bounty hunter busts in to his house thinking he’s Dog or Boba fuckin Fett? The brother was the one who skipped the court appearance, not OP. OP is NTA but YTA for doing a piss poor job of trolling.", "What are you smoking?\n\nOP gave then the address he though the brother was at and the brother was caught there.\n\nWhere did OP deceive or give false information to anyone?!", "The brother's illegal actions contributed to his predicament, not OP's.", "Nothing, they could legally do that in my state if my house is the address listed on the paperwork", "Yep", "fr, maybe hes an asshole who got himself into trouble but why are you ratting on him. dont talk to cops, especially BHs. if you felt you were in danger thats another things but that clearly not going on here", "Either he put 2 and 2 together or The bounty hunter told him durring the arrest. He told our mom when he called her crying and begging for money", "I didn't, it must of been the bounty hunter or my brother figured it out. But he told our mom while he was crying on the phone with her asking for money", "He stole a car from his boss when they fired him for giving away free food in exchange for weed and smokes.", "And what's so funny is that they were  100% going give him the 25,000, but my dad intervened.", "I didn't tell anyone. The bounty hunter probably mentioned it in passing when he arrested my brother. My brother called my mom crying and asking for the money and he told her.", "They usually do, but this time my father stopped them.", "Thanks for the advice", "They would've found him anyway. He owed the bondsman 25k, they're not letting that go. Also, you think I wanted to the bounty hunter coming back and arresting me for obstruction of justice by hiding him?", "The bounty hunter must of told my brother, my brother told my mom durring a phone call where he was crying for money.", "Out of curiosity, why didn't he put one of your family's addresses rather than yours?  They would have covered for him, he had to know you wouldn't.  Did he somehow use all of them previously and needed a new address?", "It sounds like you disciplined him by sending him to his room..... In jail 😂\n\nNTA.  Next time he will know not to put your address down.  Let Dog the Bounty hunter go to your mom's house for him", "I have a brother who had a similar nature and my parents were his biggest enablers his entire life until he not only committed a violent felony, but also then had a car chase with the police.  At that point my parents, especially my mom, couldn't wave or explain it away although my mom tried as hard as possible to find a way.\n\nI was very LC with my parents for many years and NC with my brother (and remain so).  If you need to block your family for a while to stop the blaming, do that for yourself.  In these situations, you have to put yourself first, because your family is not going to support you.  You did exactly the right thing and are NTA is any way", "Nta.  They are enabling him to death.", "NTA.  He did this to himself, & tried to get you involved.  What if the bounty hunter didn't believe you, & went and involved the cops?  Cops come back with a warrant and destroy your house.  You have to put your safety first.", "Why are you even in contact with someone that think that \"he can't do any wrong\" when this person is on the prison a lot of times? Just cut these persons of your life", "You realize the reason he gave your address right?  It is a common thing to give out an address you don't ever visit.  This means he is visiting everyone else and might have actually been caught there.", "Also, the bondsman/bounty hunter is kind of an asshole for telling the brother how he found him. Unless OP outright admitted to it to his family, bounty hunter should have simply said that he tracked him down eventually. By naming  OP (if he did), the bounty hunter is potentially exposing OP to significant risk as OP could be branded a snitch.", "I would just tell her the above and cut contact. They’re always going to be looking to you to bail him out or to blame you moving forward.", "Tell her that this was a divine intervention. She clearly NEEDED an intervention from enabling ur brother which wreaked havoc on her finances, her sanity and her relationship with you.", "She expects you to take over the care taking role", "Makes me wonder who will fund her retirement.  Tell her since she spent so much money on him, she can ask him for money in the future.  No, just go very LC or NC with her.", "Found the brother!", "And brother almost got OP shot", "OPs brother did this to himself. If he wanted to get away from that court and bondsman should have used his moms address.", "Yep, classic golden child situation. They're totally unable see that their \"precious baby\" will never get better with the way they're handling things. And that \"prayer\" isn't a cure for narcissism, addiction and decades of indulgence. Out of curiosity, is ur brother the oldest of ur cousin generation? Because that can also play a major role.", "When you cut your family off to keep yourself safe from your brothers nonsense, rest assured that they will come crying with their hands out because they lost their home bailing him out. Or wanting your support so they can afford to retire. You need to consider how you will want to handle that. If you choose to help them financially, do not put assets in their name or give them cash to pay bills, it will go to your brother.", "I do not blame you. Glad they got him, less you'll have to deal with in regards to him. Regarding your family I would ignore them. I'm sure they would have done the same thing you did. Best of luck.", "Yes, well, the least safe thing you can do is own a gun, especially one that you don't keep locked in a safe. Your odds of things ending very badly go way up, and it's a good thing it didn't *this time*.", "Your mother fucked your brother over worse than everyone else combined by refusing to do any hard work and actually parent that boy when he was a kid. Every other enabler in the family is a close second. Refusing to teach your kids about consequences is honestly a form of abuse. Tell them that next time they piss in your ear.", "You mom sounds like an enabler.", "Check peephole. Or get a porch camera.", "That would require them caring enough to take the time to prove that you knew where he was beyond a reasonable doubt. Which they wouldn’t do because they likely couldn’t do. Even the tip you gave them was a “probably”", "[removed]", "ahh gotcha. I don't think you did the wrong thing. I'm probably in the minority, but the crime itself does have some bearing on how I feel about the punishment, outside of what the law dictates. people who steal willy nilly like that seem to have a sense of entitlement that leads them further and further into trouble, and over time it seems like they get less discriminatory about who they're stealing from and what. it really sucks that he put you in that position. it sounds like a lose lose situation, and you had to protect yourself and the rest of your family.", "That bh sucks. I mean f your bro and all those enabling his criminal ass. But f that bh too. You did him a solid", "Don't talk to bounty hunters.", "You brother probably figured it out on his own. He would have known that the bounty hunter went to your house before going to the next place.", " Why he choose me? I have no clue\n\nBut my brother has never been a good long term decision maker", "Probably hoped OP would be mistaken for him and arrested.", "He probably did in the past .", "> If you need to block your family for a while to stop the blaming, do that for yourself. \n\nI am doing this right now and nobody likes it that's for sure.", ">to death\n\nThis part is literal, not foguratove, for anyone unsure about it.", "Thank you. I've just never had the heart to cut contact with her, I love her dearly, \n\nbut she dosent understand that bailing my brother out of trouble will only make him think she can save him from anything.", "It definitely wreaked havoc on the brother. A solid third of his shit decisions were probably due to mommy being there to cover for him or make them go away.", "I've wondered that too,  my parents are somewhat wealthy (dad was in finance, mom did real estate) and they have a healthy nest egg. But they don't have the money to continuously spend $10,000+ on attorney fees and bails everytime my brother gets in legal trouble.", "The next step is the brother getting arrested and using the OP's name. And getting OP arrested when the brother skips court. Happened to my ex.", "No, we have an older cousin, but he's not a trouble maker, he runs his own barber shop.", "You're right, over the years, my mom, grandmother, aunt, and sister have collectively spent well over 100,000 in bails and legal fees.", "It was in a quick access safe.", "All of this, OP.  What she's doing isn't kind to either of you.", "She is, she would've given him even more money if my dad didn't stop her", "They would return to the address as often as they think they need to.", "Wow, you're not a very nice person.\n\nI don't think you realise how uneducated you come accross by spewing such hate towards a stranger.\n\nI mean, of course you don't!\n\nAnyway your comment will probably be removed soon. I won't even bother replying to the rest.", "The bounty hunter was professional and respectful and my brother would of probably figured out it was me anyway.", "Time to start blaming them.\n\n\"Of course it's not his fault poor boy don't have no sense- y'all refused to teach him. Y'all let him get away with murder and now look at him- in and out of jail because none of you wanted to hurt his feelings long enough to teach him right from wrong. This is on all of you, not me. Maybe some consequences for the first time will help him turn his life around, because none of you are willing to do so\"", "The only error in what you did was not asking the bounty hunter for a Benjamin for the tip.  If your family is going to cast you as Judas, might as well have gotten your thirty pieces of silver for your trouble.", "Sounds like there’s more to the story, like why does family treat him like the golden child? Like ZERO discipline?", "I think maybe you need to go no contact from your family. At least for awhile. You deserve to not be harassed for doing the right and legal thing, and for not wanting to help a man who literally targeted you.", "If that’s how it’s been since you both were kids, why would you now suddenly think they were right about what you did? It seem like it’s about time he faced the consequences of his actions.", "With all kindness to you, NTA, but your AH family may very well punish you. They may cut you out of the will, badmouth you to everyone, and try to lay a blood is thicker than water guilt trip on you. I have been there, done that, got the tshirts. It was after my sister's death that I could remember the good times. She taught me to ride a bike, etc.", "That's why he is in and out of jail.", ">But my brother has never been a good long term decision maker\n\nNor medium or short term, according to what I see.", "Fair enough.  Being impulsive certainly goes with being in and out of jail frequently.", "I’ll tell you my opinion why. My best friend in high school has the same exact older brother. Used his name/ID/license number/birthday/address as a way to slip around the police. When you’re family it’s easy to learn that information. \n\nI’ve personally been sitting shotgun when Ian got arrested four different times because his asshole brother Donavan used his name/ID/birthday. I’ve had to bail him out of jail twice for things he didn’t do, which took considerable time to clear from his record that shouldn’t exist.  \n\nDo your due diligence and make sure you’re not tied to some bull shit your brother used your info for…. I know that sucks to hear but I’ve seen it first hand.", "Bro code?", "I wouldn't rule that out.", "I understand, but it sounds like everyone in your family is willing to absolutely destroy their lives/financial future’s to enable your brother’s ways. They are trying to project this on you. Also does she not realize that the reason your brothers never stopped getting into trouble is directly correlated to her enabling him?\n\n\nETA: Maybe this is a discussion you need to have with your mom. Something like “Mom, I love you dearly and appreciate you, but what you and the rest of the family have been doing is just enabling ______’s bad behavior. He never learns his lesson because you’ve never given him the opportunity to learn and grow from his mistakes. He is nearly 40 and not a child now even though he is your kid. He has caused us nothing but problems and does not learn from the opportunities we have repeatedly given him to the detriment of us all. I will have to cut contact with the family if nothing changes because I refuse to let my older brother and everyone’s blind support of his poor decisions bring me down with him.”", "And people who continuously bail out the same person for the same reason tend not to have the greatest financial acumen either.\n\nGood luck.", "Which might make it safer from getting into somebody else's hands. However, the greatest risk as a gun owner is that you will get it too quickly into your *own* hands.", "I’m sorry that they are blaming you for not helping your brother. I hope you know you have nothing to feel guilty for. He needs consequences.", "There’s another post who I thought was the  sister", ">because none of you wanted to hurt his feelings long enough to teach him right from wrong.\n\nDirectly to the point", "Yup.  My first thought was \"What was the reward payout?\"", "I have no earthly idea, definitely something that happend before I was in the picture", "It's called the Golden child. There's nothing more to think besides this. It can sometimes be too bring first born, the only girl or boy, or just random (one or both parents identify with the golden child more than others).", "Maybe?, \nBut the \"bro code\" has limits \n\nI'm not getting arrested or shot because my brother owes 25 grand to a bail bondsman", "I'll send her a text tonight,\n\nI honestly needed someone to break it down for me like that\n\nThank you", "I know. Thanks\n\n there's too many of you guys for me thank in one night lol.\n\nStay tuned, I'll make an update tommorow morning after I talk to my mom.", "Happens too frequently - one child hugely favored over another for no reason. For your sake, look into going Low contact or No contact with your family, Google grey rock technique.", "Do you have different dads?", "I’d also add-\n he gave my address without letting me know and missed court. I am not going to be covering for him and lying to a bondsman. \nNext time tell him to use your address and you can cover for him.", "No worrries! Best of luck!", "Might I recommend blocking her immediately after. She's going to try and say some unwise things she will regret later and you don't need to hear that nonsense quite frankly.", "No, our father kind of gave up on helping him a while ago. It's just been my mom, aunt, and grandmother who still think he's a \"little Angel\".", "Thanks again", "My cousin was the family's favorite simply because he was the first born. They spoiled the snot out of him and when he wrapped his car around a tree driving drunk, at least he only killed himself.", "And have they figured out why he thinks that laws don’t apply to him?  \n\nNobody is born a criminal. And he is responsible for his choices.\n\nBut they need to figure out how to love him while stop enabling  his criminal activities. Until they do that, there is no point discussing it. \n\nYour address was on that bond-  what if the cops had decided to raid your house with you in it?  Is it ok to get you shot for him?  Yes technically bond isn’t the cops, but it isn’t worth the risk to you.", "You are allowed to take a break from your toxic family and block them. It doesn't have to be permanent if you don't want it to be.", "I'll post an update with this account either tonight or tommorow", "Omg that’s awful and my worst nightmare.   Any time I see a 16 year old get a brand new muscle car I envision this.", ">Your address was on that bond- what if the cops had decided to raid your house with you in it? Is it ok to get you shot for him? Yes technically bond isn’t the cops, but it isn’t worth the risk to you.\n\nThat's what scares me. It could've been all the same if the bounty hunter forced entry and I got my gun  thinking he was there to rob me.", "good luck buddy! \n\nthis is not an unusual dynamic but it still sucks, good for you and your balls", "A bounty hunter was looking for him. That means he violated his bail agreement and a judge revoked his bond and issued an arrest warrant.  He got himself into this mess and I also would have turned him in because he's a criminal with a long history and you definitely shouldn't get in trouble for a man who would never have your back. Definitely NTA.", "NTA.\n\n\"how much of a \"terrible person\" I am for \"getting my poor brother in trouble\".\"\n\nNah, he was already in trouble before you pointed the bondsman to him.", ">much of a \"terrible person\" I am for \"getting my poor brother in trouble\".\n\nUh no. Your brother did dumb stuff, got in trouble then got into MORE trouble by skipping court. He created this mess and now he has to deal with it. I'm surprised your family made NO mention of him using your address.\n\nNTA, and your family needs a wake up call. Not always easy turning family in, but you covered your own butt.", "[removed]", "*My mom, aunt, sister, and grandma have all been blowing up my phone the past few days with messages on facebook about how much of a \"terrible person\" I am for \"getting my poor brother in trouble\".*\n\nAnd that right there, OP, is why your brother is in trouble, has been in trouble, and will continue to be in trouble. He has no chance to be better with that kind of justification and coddling.\n\nNTA. If they're so concerned, they can make a concerted effort to bail his butt off and be responsible for his actions for the rest of his life - or theirs.", "Can't you collect a reward for your tip?", "Omg, all the women in your family are cuddling this piece of work. NTA. Maybe isn't too much, but at least, he can't hurt anyone behind the bars.", "NTA. Get his ass!", "My guess is he gave the address he could remember of the one place he knew he would not be when they came looking for him. Your safety and your family was not a blip on his radar he only thought of his own hide. How your family thinks anyone but him got him in trouble is astounding. If your family wants to find a way to help him, he should be really easy to find right now. Tell them go at it. NTA", "You are not the asshole. He fucked you over and got back what he gave.", "NTA. Unless you are the person who lured him into a life of crime in the first place, you've got nothing to do with getting your \"poor brother in trouble\".", "The women in your life are delusional... If they really want to get him out of jail, they can pay the money or shut up.\nYour brother lied and then skipped court (knowing the consequences)\n\nAlso you didn't get him into trouble, he was arrested for doing something that didn't involve you.\n\nI gather your mother, sister, aunt and grandmother have been bailing him out of trouble for years and have excused this type of behavior.\n\nNTA", "YOU NEVER RAT ON THE FAMILY \n\nNah, lol, fuck him.\nNTA", "NTA achy your ties with these people. Calling you names for their inability to raise someone, not your problem", "NTA. He tried to use you and it backfired. All of this is no one's fault but his own. Your family is being unreasonable.", "NTA. That would be your brother. He must truly be entitled if your family is blaming you!!", "NTA. Your brother got himself into trouble. He has no right to take you down with him.", "NTA - I think you need to move away from your horrible family.  Let them go visit your brother in prison.", "NTA\nThis is your parents fault. As you said he was never punished as a child, and in turn that has led him down a life of \"I can do what I want and escape the consequences\" which in reality, he can't.\n\nThere are some nasty pieces of work in the bounty hunter jobs who wouldn't have asked questions. They could have beaten you bloody, shot you, etc. Unlikely to happen but still a possibility.", "NTA and from reading your comments it might be time to reevaluate your relationships with your family.  Your dad might be ok but your mom and others have created a monster.  And now they’re pissed at you?  You could’ve been killed!  You deserve better.  You’re only 22, have your whole life ahead of you, and I hope you find good friends who’ll be better to you than your bio family is. Wishing you the best.", "NTA. You're brother is an asshole for putting you in that situation. He's just going to have to suffer the consequences of his actions", "NTA, but the bail bondsman apparently is for telling your brother that you ratted him out.", "NTA. \n\nDon’t do the crime if you can’t do the time.", "Tell mom, aunt, sister and grandma they can pay up then. They can pool their money and get that 25k. Tell them that brother didn't ENDANGER THEM. That you didn't make him miss his court date, you didn't make him commit ANY crime, in fact you didn't make your brother do ANYTHING. If he ENDANGERED THEM would it be OK to say where he MIGHT be. That is what you did you told them where he MIGHT be. You gave the address of a friend where he is 90% of the time. You gave no guarantee that brother would be there. Note how they're fine with YOU getting in trouble. NTA", "Why did you tell them? I’m just curious!", "I didn't have to read beyond you (22) and him (35). He used you; you didn't betray him. 13 years your senior, he should be looking out for you, not expecting you to cover for him...especially when he doesn't even seek informed consent to do so. \n\nHe needs to sort his stuff out and grow the heck up. He's a crummy big brother.", "Time to block ppl and continue living your life or you could just shame the haters on social media", "NTA 100% NTA", "NTA your brother got himself into trouble you just stopped him getting into more.", "NTA", "Kindly let them know that they are the reason he is in jail. They constantly enable his behavior. You were asked by a person of authority where he was, all you did was give them the information your brother tried to hide from them. Did they think he was going to get less time by staying on the run? That usually gets you more time. You did the right thing. Let your toxic family deal with their toxic decisions.", "Next time, ask  if there is a reward", "NTA!  \nSounds like your brother needs to figure out some crap.", "NTA  Tell your family that your brother had no problem causing you trouble by giving your address when he knew he wouldn't be there. You're lucky that bounty hunter acted as nice as he did. I'm sure your brother was well aware when he gave your address that they seldom treat people that way. Your brother didn't care what happened to you as long as he was free.", "It doesn't even need to be a muscle car", "NTA. If you had refused to help the bounty hunter or helped your brother in any way, you would’ve been liable to be charged with aiding and abetting a fugitive. Your brother is not some poor victim; he got himself into trouble by 1) getting arrested in the first damn place and 2) missing court therefore jumping bail. He has no one to blame for his situation/predicament other than himself.", "What Will,?Golden Child will have wiped any thing out they have with lawyers fees by the time they go.", "NTA. Full stop.", "NTA! You don’t want to get caught up in his crap and shame on your family for making you the bad guy. Some people just won’t learn. You can get in trouble if you hide info. You did right and move on!", "NTA. Your brother did it to himself, and your family is enabling his criminal actions. That could get them in trouble as well, at some point. You did the right thing.", "NTA he's an adult. He fucked up and found out. They need to stop coddling him", "Nta, but next time keep your ass clean. Why does your family even know you're the one who gave him up?", "Unless you hid all clocks and calendars from him so he didn't know the day, NTA.", "NTA. \n\nHe's already in trouble with the law. You just made sure for him to face it like  everyone.", "NTA", "NTA Even if you did not interfere, I honestly don’t see how this situation was going to resolve itself without your brother eventually being taken in and the same consequences happening. Did he think he was going to successfully live on the lam for the rest of his life? That hardly ever happens.", "Don’t feel guilty. NTA.", "Your brother got himself in trouble, and fuck anyone trying to blame you for not helping him evade the consequences.  \n\nHe recklessly endangered you.  Your mom, aunt, sister, and grandma are WRONG.\n\nNTA.", "Leave that ghetto family behind and never look back.", "NTA. \n\nI used to run the streets and when I got out, I changed my number and legal address for basically the same reason. By telling the bounty hunter, you sent a clear message to your brother that it was not nor ever will be okay to use your address in any future issues with the law. I personally reported my ex for draining my bank account after we broke up because in my hurry to leave, I left my debit card... and he was **mad AF about it**. I felt terrible about it for so long until I realized that I was the first person to do that to him and he finally had to face for consequences for things he did. \n\nSo, all I can say is that you did the right thing. People like my ex and your brother don't ever learn until they have to face real life consequences for real life crimes. It doesn't make you TA because you are the one who stops enabling him. He's TA by putting you in the situation to begin with.", "NTA- Your brother involved you in a lie about where he was living- going along with that would have got you into trouble too. He'd already skipped court so he was already breaching his bond- not your fault. He's in jail where he belongs and your family are enablers who would only allow him to cause more trouble- ignore them.   \nSorry you have to deal with any of them.", "Good!  Let him sit in jail-some people learn the easy way, some learn the hard way.\n\nPlay stupid games and win stupid prizes.  Tell your family if he refuses to follow the laws in our country or the strict rules of bail bondmen,  well, he deserves to go to jail.  Their way is obviously not helping him and no bail bondsman wants to lose money- he deserves jail time.", "NTA, but You couldn’t possibly have needed our help figuring that out in this case", "NTA. Your brother needs to learn the hard way", "Are they upset at your brother for making bullet proof vest wearing bounty hunters turn up at your door? No, didn't think so. NTA OP. Your brother is not a good man, and your family is enabling him.", "No", "Your brother sent armed people to your house with the intent that something could go down", "drop him to the curb, then drop the weight for your own health, then send him an after photo.", "\"Beth, bear mace that guy! And that guy!\"", "He doesn't need a boundary.\n\nHe needs a wall.  With guardtowers.  Manned by trigger-happy guards with Gatling guns.  Maybe a minefileld or two.", "Was your last address an 8x10 cell?  Cuz that’s the ONLY reason you could think this is OP’s fault!", "I’ll repeat what I just said to another idiot.  Was your last address an 8x10 cell?  Cuz that’s the only reason you could think this is OP’s fault!", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA. But he is for giving them your address.", "I want to jump in and say that while you may think he got the best deal growing up, it seems like you were actually raised much better. Spoiling a child never does them any good and their attempts to show favoritism actually screwed him over and resulted in the current jail bird. Honestly, I wouldn't say you should thank your parents, but you were lucky you weren't the golden child lest you end up like your brother. So, if you want to take solace in anything, you ended up the better kid as a result of your trials.", "At least you won't ever see him again", "Really sad situation and definitely the consequences on growing up not reenforcing the rules and blaming on others. The mother is the main person to be blamed, the law is here for your brother to learn and your only choice is to follow the law and protect yourself NTA.", "Murder By Death has a song called [Brother](https://www.youtube.com/watch?v=vOgCzuSkRFs) that you might appreciate, considering the lyrics and your situation...\n\n> The bondsman came to my door  \n> Early the next day, he said  \n> \"I come lookin' for your brother  \n> You don't know what kind of trouble that he's in\"", "Your \"poor brother\" got himself in trouble. They just expected you to cover for him and go along with his attempted ruse. What were you supposed to do when he tried to use you? NTA", "Classic enabling and not your problem. Set a clear boundary that he is officially off the table for discussion and if they can't abide by that then you just start ignoring them - block if you need to.", "Omg I feel your pain on that one! Definitely NOT the asshole!", "> He was never disciplined as a child\n\nYour mom is far more to blame for how he turned out than you could ever be.", "Sounds like an easy NC from now on.", "If you haven't already please make sure your credit is locked down tight and check your accounts regularly.\n\nAs your brother he likely has enough information to impersonate you and I would not put it past him to try and get credit in your name once the bank of mom is out of funds.\n\nNTA", "Maybe you going NC or LC for awhile will get her attention. This would be you holding HER accountable. \n\nI know you love her but she needs to understand what your brother did could have gotten you killed. You need a break from this nonsense and you need to get her attention.", "Yeah, after he realized that you hadn't gone to jail for him because the bail bondsman was still looking for him. He set you up. You could have been seriously hurt and/or put in jail.\n\nYou need to think about going low or no contact. You are their scapegoat & no matter how much you love them they will never return that love. It will always be your fault. Take it from one scapegoat to another.", "Then the Bounty Hunter is TAH. Find him and tell him that", "[removed]", "If they thought he was covering for his brother then they could have arrested him for helping.   The charges wouldn't stick, but you'd still have it on record of being arrested.", "And maybe to OP's death.", "Oh definitely. I don't have work tommorow, so I'll spend the day checking everything out", "You beat me to it!", ">You could have been seriously hurt and/or put in jail.\n\nYeah, I'm lucky the bounty hunter was professional and didn't just bum rush through the door or arrest me and ask questions later.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Don't break the law.", "Then god decided now it’s his turn to get the short end of the deal.", "I think I can guess. It sounds like he's used to you coming second to his needs and wants. Why should this time be any different?", "Compulsory r/BeatMeatToIt comment", "Credit check STAT", "Bro code applies for bros.  You got to be a bro first, OP's brother hasn't been.", "Thanks, I'll post an update in the morning on this account. I already talked to everyone except my brother, he used his phone call to call our mom and beg for money.", "My first thought was \"Holy shit.  People die in situations like this.\"", "NTA And I do understand. Have a brother like that and my parents never let the truth or details get in the way of defending him. Committed multiple felonies that were “not his fault.” Although he certainly bragged about them! The money spent on attorneys and restitution was sickening. And yeah, I once told the cops where he was when they had an armed robbery warrant. Time in jail was time he couldn’t be stealing from me!", "I live near a small county seat. A bailbondsman got shot and killed by another bail bondsman. So they, at least around here, carry weapons and aren't afraid to use them."]}