{"id": 27714, "submission_id": "16tbldy", "title": "AITA for getting up and leaving in the middle of my first date… twice?", "selftext": "\nAITA for getting up and leaving in the middle of my first date… twice.\n\nAITA\n\nTonight I went on a first date. I matched with this guy on hinge a couple days ago, we chatted a bit, exchanged numbers and eventually set up a date for tonight. 2 hours ago. \n\nI pull up to the address he gave me and he texts me that he was going to be a few minutes late. No worries. He calls me as he pulls in and finally tells me where we’re going (he wouldn’t tell me before just gave me the address of a shared parking lot). I was walking around a little lost trying find the place as we’re on the phone when I hear him at the bar ordering a drink. Maybe I’m dramatic, but if I can’t find the place we’re meeting at why aren’t you trying to help me instead of going inside and ordering a beer????? Anyway red flag number one. Maybe number two since he wouldn’t tell me where we were going in the first place. \n\nI hang up, I find the bar, I go in, I order a drink, and we sit down at a counter next to each other looking out on the pier. We make a little conversation, and very little eye contact for about 20 or so minutes, maybe even less, while we browse the menu. He was staring out on the water and would randomly say things like “Oh we’re so lucky” “I love the water” “Isn’t this just the best”. But he genuinely did not seem like he was enjoying his time with me. Did not try to ask me questions or make conversation, eye contact, he just didn’t seem that into me. It was nothing super awkward, but definitely not vibing like we were on the phone. \n\n20 minutes in, he says “I gotta go pee, if the waitress comes when I’m gone you can order the appetizer”. Fine. Except…. five, six, seven, then EIGHT minutes goes by and he’s not back from his tinkle. It starts to cross my mind that maybe he left? He had left his card down for the drinks when we ordered, so after 10 minutes I thought, well, at least I got a free drink, I’m out. \n\nI walk back to my car and just as I put my keys in the ignition he texts me asking where I am.\n\nI told him, “ I thought you left so I did too.”\nI said “you took 10 minutes to pee” \nHe replies that “he didn’t pee but ok”. \n\nI call him and ask if he wants me to come back, he says yes, he’s still there drinking his beer. \n\nI walk back and I sit down and he’s fully engaged in the conversation with the woman next to him. Who also seems to be on a date. \nShe’s a lot older so I’m not assuming he was flirting. However, he didn’t even acknowledge the fact that I came back. I sit there for 4-5 minutes on my phone scrolling Reddit while he continues to ask this woman questions and have a full blown conversation with her.\n\nSo, again, for the second time, I gather my stuff up, and leave.\n\nI drove home and got a text from him soon after that reads “I went to the bathroom and was having a conversation so kinda think about if your reaction was justified..but thanks for coming “\n\nWhich leaves me thinking… AITA?", "created_utc": 1695791492, "permalink": "/r/AmItheAsshole/comments/16tbldy/aita_for_getting_up_and_leaving_in_the_middle_of/", "score": 237, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because maybe he did just go to the bathroom and was just having a conversation and I was impatient and quick to act? I’m not sure. Genuinely asking.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Reply to add: \n\nWhen I got up and left, I looked at him and said something like “I don’t know what your intentions were tonight, but this was the weirdest I’ve ever felt on a first date ever. This was so bizarre. I feel like I’m interrupting. I’m leaving.”\n\nAnd he just looked at me like I had 3 heads and said “Okay”.", "The fact he wouldn’t tell you where to meet up was bad enough but everything afterwards made no sense. Atleast it was a free drink.", "NTA\n\nI decided on my vote when you came back to the bar. He was in the middle of a conversation with someone else and didn't even aknowledge your presence, that's very disrespectful and you were right to leave.\n\nAs an aside, were you interested in him at all ? Did you ask him any questions ? From the way you described the situation, I also get the impression that you were waiting for him to do everything and if you didn't do anything, maybe he thought you weren't interested. Which doesn't justify his rudeness.", "NTA, dude's weird, yo.", "NTA.  He had no interest in you whatsoever.  The ten minutes he was gone he was probably contacting other people.  I am guessing he was attractive and used to women putting up with his nonsense.", "NTA, sounds like you dodged a bullet.", "He demonstrated that he is capable of having a conversation, so yeah, he's at fault for not trying out this skill with you. ~~But were YOU trying to talk to him?~~\n\nEDIT: I just saw you comment where you said you started out that way. Never mind. How disrespectful of him. \n\nNTA", "NTA. He was rude and disrespectful to you. He left you hanging twice, didn't tell you where he was going or what he was doing, and didn't seem interested in you at all. You had every right to leave and not waste your time with him.", "You had a feeling and you just followed it. He was almost testing how much you’d tolerate. He seemed emotionally unavailable and if this is how he is in public, you’d be stuck with him having conversations with other people out with him again. My ex husband used to do this. It was rude and he would act like he was doing nothing wrong. Even as a married couple it was rude at times to ignore me for either a stranger or even at a wedding he once talked to the girl next to me all night. You dodged a bullet.", "NTA - he was super disrespectful", "NTA so I've thought about it and I think your reaction is totally justified.", "NTA. People are weird.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\nAITA for getting up and leaving in the middle of my first date… twice.\n\nAITA\n\nTonight I went on a first date. I matched with this guy on hinge a couple days ago, we chatted a bit, exchanged numbers and eventually set up a date for tonight. 2 hours ago. \n\nI pull up to the address he gave me and he texts me that he was going to be a few minutes late. No worries. He calls me as he pulls in and finally tells me where we’re going (he wouldn’t tell me before just gave me the address of a shared parking lot). I was walking around a little lost trying find the place as we’re on the phone when I hear him at the bar ordering a drink. Maybe I’m dramatic, but if I can’t find the place we’re meeting at why aren’t you trying to help me instead of going inside and ordering a beer????? Anyway red flag number one. Maybe number two since he wouldn’t tell me where we were going in the first place. \n\nI hang up, I find the bar, I go in, I order a drink, and we sit down at a counter next to each other looking out on the pier. We make a little conversation, and very little eye contact for about 20 or so minutes, maybe even less, while we browse the menu. He was staring out on the water and would randomly say things like “Oh we’re so lucky” “I love the water” “Isn’t this just the best”. But he genuinely did not seem like he was enjoying his time with me. Did not try to ask me questions or make conversation, eye contact, he just didn’t seem that into me. It was nothing super awkward, but definitely not vibing like we were on the phone. \n\n20 minutes in, he says “I gotta go pee, if the waitress comes when I’m gone you can order the appetizer”. Fine. Except…. five, six, seven, then EIGHT minutes goes by and he’s not back from his tinkle. It starts to cross my mind that maybe he left? He had left his card down for the drinks when we ordered, so after 10 minutes I thought, well, at least I got a free drink, I’m out. \n\nI walk back to my car and just as I put my keys in the ignition he texts me asking where I am.\n\nI told him, “ I thought you left so I did too.”\nI said “you took 10 minutes to pee” \nHe replies that “he didn’t pee but ok”. \n\nI call him and ask if he wants me to come back, he says yes, he’s still there drinking his beer. \n\nI walk back and I sit down and he’s fully engaged in the conversation with the woman next to him. Who also seems to be on a date. \nShe’s a lot older so I’m not assuming he was flirting. However, he didn’t even acknowledge the fact that I came back. I sit there for 4-5 minutes on my phone scrolling Reddit while he continues to ask this woman questions and have a full blown conversation with her.\n\nSo, again, for the second time, I gather my stuff up, and leave.\n\nI drove home and got a text from him soon after that reads “I went to the bathroom and was having a conversation so kinda think about if your reaction was justified..but thanks for coming “\n\nWhich leaves me thinking… AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Sorry to say but he just didn't seem interested", "NTA you have a story to tell the next 1st date you go on.", "NTA", "ESH. Leaving after ten minutes is too soon. Maybe he needed to poo but didn't want to say it. Maybe he was nervous and needed a few minutes to compose himself. The point is, I think you could have given him a bit more time before getting up and leaving. \n\nMeanwhile he also seemed to be acting rudely so yeah, ESH but maybe him more so.", "I mean, what kind of dummy goes on a date when the person they're supposed to be meeting basically refuses to tell you where? I wouldn't have even went. So you don't even get to complain about that.\n\nWith that being said, do you just lack common sense? He left his card, he told you to order an appetizer, did you really think he was going to sneak out a back door? It was ten fucking minutes.\n\nESH", "Bullet dodged. Move on.", "No. \n\nYou should have kept driving the first time.  But OLD is such a dumpster fire that you end up willing to meet a guy at a location he won't tell you about until the last minute.  \n\nNTA.", "you are allowed to leave a date for any reason. he seems full of himself. nta. also protip pls do not let men give you an address for a destination that ISNT the date place ):", "NTA\n\nI'm suprised he even noticed you'd gone", "Good for you for the direct communication! Dodged a bullet here.", "I'm so glad you said that!!!", "$6 parking 🙃", "No I was kinda interested. He smelled weird which put me off but was so cute. I was asking questions at first but when he literally wouldn’t make eye contact I kinda got the vibe he wasn’t into me. Then when he left for 10 minutes I really got that vibe.", "Yeah I’m thinking the same ty", "He was very cute 😕", "Crazy because literally an hour prior we were texting and he was trying to convince me to go out with him. I wasn’t into it until he called me and we got along so well on the phone conversation flowed smooth so I decided just to meet up with him. Then I show up and like you said, all conversation skills out the window. I thought maybe he thought I was ugly in person? Which was weird because I usually hear the opposite. The whole situation has me feeling like my spidey senses need a reset.", "It’s funny because I almost left when he ordered a drink before I found the place. I hung up the phone and thought “what a rude fucker you should just go eat by yourself” but I keep thinking I’m too temperamental and need to chill out. What I need to do is follow my gut. You’re exactly right. I’m glad you made it to the other side.", "I thought the same, so why text me after?", "10 minutes is too quick? The bathroom was 20 feet away and the place was super small. Should I have texted? I think I was a little embarrassed that I had been left on a date so just beelined it out of there as quick as possible. \n\nI’m confused too whether he was rude. Admittedly, I’m the type of person who finds everything rude so I’m not the best judge. \n\nThe ordering before I got there or knew how to get there was weird, not making eye contact, not engaging with me in conversation at all really but being fully engaged with the lady next to you when I came back??? I feel all of those things are rude and I’m so mad because he was SO HANDSOME and BUFF.", "It’s a whole little “village” of places. He just wouldn’t tell me which place in the village he wanted to meet at.", "Peace & Love ya’ll are a little bit dramatic the address was the parking lot lmfao. If he gave me the address to the actual place I would’ve had to drive back around and look for parking. Annoying that he wouldn’t tell me which of the 5 restaurants or bars we were going to but the fact that he sent me the address to park at is his biggest green flag in my book.", "free drink covered the parking i guess then 😭. hope your next date has better manners, goodluck!", "But he stank.  Girl, no.", "trust your gut!", "playing stupid games. if he is interested, this was a nice preview of a whole relationship where he tries to keep you off balance, makes you work for crumbs of attention, and blames everything on you. better to just decide he’s not interested, he’s not fun, and who wants to date a dude who smells weird anyway. nta, bullet dodged.", "I think you dodged a bullet good riddance", "If I were you I probably would’ve assumed that he went to poop instead of pee and was just too shy to tell you. Either way I would’ve waited more than 10 minutes, but I get the feeling that you were already a bit anxious at this point or put off by the red flags that you had already encountered. I’m assuming your gut feeling was telling you to just get out of there and that this wasn’t going to work out anyways. Hence why you weren’t willing to wait longer than 10 minutes. I’m gonna say soft YTA. None of us were there to really know what the vibe was like or what you were feeling. At the end of the day you have the right to end the date whenever you want but it’s also not unreasonable for him to be annoyed.", "Yeah that's still a red flag. That \"surprise\" shit can be cute if it's someone you've met a few times before and have a baseline sense of if they're not completely insane. First date and they can't even be forthright with where you're meeting up? You're very lucky that this was what happened out of that.", "[removed]", "Idk, its still super super weird. If he had said “hey wanna go to x place? the parking is weird so heres the address of where its best to park” that’d be one thing. But not saying the place you’re going to at all is a huge red flag imo", "Yeah I really wanna call second date update to get his POV because part of me feels like there’s gotta be a version of these same events where he doesn’t look like a total asshole.", "I agree. It wasn’t super questionable because it was like a pier with a bunch of restaurants, cars, stores, etc. I don’t think I had any real risk of being assaulted or trafficked lol", "That is not the question nor the purpose of the sub. Thank you for the concern though, genuinely.", "Most people don't think they had any real risk of being assaulted or trafficked before it suddenly happens. Sometimes there's warning signs, sometimes there aren't.", "NTA, the bit about the bathroom was probably a bit premature, even if he did show up late and refuse to give you the location (pretty weird), but him then ignoring you to have a conversation with someone else when he's supposed to be there *with you* is definitely a line crossed", "NTA.  Wtf.  What a weirdo. Never meet up with anyone who won't tell you where you're going.  The rest is just rude inconsiderate behavior and not worthy of a response from you.", "NTA..  he should at least have shown an interest in you to keep you there..  you did exactly the right thing..", "NTA, it was pretty weird. You were nicer than i would have been.", "NTA. It was definitely justified. Wondering if you went out with an old flame of mine lol! Sounds about right.", "NTA.  Probably trying that negging shit that Incels have been duped into thinking works.", "NTA.  But I wouldn't have met this guy.  The weirdness started before the actual date started.", "NTA I don’t think that you were rude or overreacting- but, even if you were, I’d rather be rude and safe than “nice” and in an unsafe situation.", "NTA feels like you were priority n°4 in your dates mind. I fell like it should be higher for a first date. Did you have an explanation as to why he wouldn't give you the name of the bar?", "NTA - for leaving EITHER time. But NEVER let them take you to a secondary location. Agree to meet in one spot and STAY there.", "Neo... \n\nIf you get good enough you won't have to dodge them. \n\nSeriously though, what a weird dude. I have some stomach issues, so I get that all bathroom things aren't equal. Text your date and apologize. Hey I may be a minute I am truly sorry. \n\nEven worse, never ever entertain someone else for more than a minute or two if you're on a date. Sounds like you were dateing a narcissist or the king of oblivious. Either way you dodged a bullet.", "ESH He went to the bathroom for 10 minutes. Please don’t make him explain that he had to take a shit in the middle of a first date.\n\nTalking to the woman was a power move. You should have kept driving the first time that you tried to leave. He was disrespectful for not at least introducing you.", ">he wouldn’t tell me before just gave me the address of a shared parking lot\n\nNEVER DO THIS. I'm curious about your age. Still, in these modern days you should know to NEVER DO THIS.\n\nESH", "Nta and please be careful in the future.   He won't tell you where to meet up?  I'm out.   That's a murder mystery documentary waiting to happen.", "You left after 10 minutes of him in the bathroom without even texting or calling him? It didn't occur to you that sometimes people change their minds in the bathroom and have to go number 2? That's a very quick trigger, but obviously nothing of value was lost here", "You are both AH. A little bit him for not waiting and walking in with you. But more so you for All the assumptions and walking away as well as it doesn’t sound like you said anything when you came back the second time. You just sat down then went onto your phone.", "You may not be the asshole but you sound a little unhinged. He left his card for drinks so he was definitely coming back. \n\nI think you totally overreacted about him being in the bathroom for so long. \n\nBecause I have to give a judgement: YTA.", "NTA\nSo he's uninterested in you,  fails to make meaningful conversation, heads off to the bathroom to do drugs or have a sexual encounter with somebody because what elae was he doing in there? Then calsa you back in and IGNORES you??  This is not normal behavior at all. Next time a guy won't tell you where you are meeting block him straight away to save time.", "NTA , him not telling you where to meet almost feels serial killerish, safety these days is paramount. He left you to pee, but then didn’t pee? Maybe he dropped a stooge? Either way, I believe you did the right thing leaving. If he’s treating you like this on the first date, it’s clear", "NTA", "NTA\nI assume this is a drug issue, but don’t make his problems your problems", "NTA. Maybe if it was just the bathroom thing I’d feel differently but the rest was a terrible way to handle a date, starting with not telling you where you were going.", "He was on drugs. NTA.", "That was a super awkward and inconsiderate first date where he basically ignored you the whole time. NTA you don't have to put up with that kind of disrespect.", "NTA.\n\nAnd his behaviors sound like he was on drugs. Just my two cents.", "NTA. Whew! You dodged a bad bullet. He sounds awful!", "NTA. Classy guy.", "NTA and as a kicker send the AH this thread there's a lot of really honest feedback about what a shit date he was.\n\nETA scratch that he's a shit person in general", "The whole thing was weird. He never seemed to care you were there, at any point, so why does he care if you left?", "He just wasn't that into you, and you just weren't into him.\n\nNTA", "I don't think him ordering a drink or not making eye contact are necessarily red flags, but everything else is weird. It kind of seems like he was trying to neg you? But maybe he's just extremely awkward. Either way, at the very least, his behavior when you got back to the table was rude.", "I can’t believe OP would ever go somewhere with a stranger and not know where it is. \n\nThat’s “you’re going to get sexually assaulted and raped and no one you know will know where you are” territory.", "[removed]", "Same. My ex also would ignore me when we went out. Wears you down very quickly and a good red flag to avoid!", "Honestly the 10 minutes thing is the smallest flag to me. It's hard to tell someone you have an upset stomach on the first date and are stuck in the bathroom. \n\nThe talking to another woman extensively is the bigger issue to me.", "I think he was just trying to be cute, honestly.", "Shit that’s what I thought too. I wouldn’t stop my conversation immediately maybe, but at some point I would’ve looked to my date and possibly included them in on it to make them feel like absent.", "Dude you don’t physically leave your card for drinks….. he could’ve gotten it back on his way out if he did. Unhinged? I think not", "Ehhhhhh I don’t think so I’ve been around a lot of drug users this is extreme.", "Exactly. She’s more worried about being rude than being safe.", "He smelled weird? Maybe he was stoned? Could explain the lack of eye contact too.", "BUT HE STANK!! doesn’t matter how cute he is if he can’t have basic hygiene on the first date!", "Compared to phone convo going great and then date being weird? \n \n Drugs. Staring out across the water. Disappearing for ten minutes. Etc. general weird interaction. He’s using something. \nTrust your gut", "Your spidey senses did exactly what they were supposed to do. \n\nIt is not realistic to expect yourself to flawlessly clock every single weirdo within the space of a single online chat. Sometimes you really do need that in-person assessment. And that is what dating is for! You realized, on the *very first date*, that this guy was not a good match. And you acted on that information and cut things off quickly. That is a sign of healthy instincts. That is the best anyone can expect from themselves.", "It was incredibly possible for him to give you *two* addresses, OP. He could have easily said “we’re meeting at Schmili’s Bar & Grill, the best place to park is in Big Shared Parking Lot. Meet at the bar and then we’ll get a table.”", "I find that controlling. He could have told you the place and then recommended parking or let you independently rely on your own brain to work it out. Instead he leaves you hanging on a shady parking lot with no clue of where to go. This guy was power tripping you from the parking lot to the bathroom to the woman to the final text. Guaranteed there will be something else tomorrow if you have not given him the reaction that he wanted.", "Maybe that weird pickup artist bullshit? \"Pretend you're not interested so she'll be more interested\" or whatever their fucked-up logic is?\n\nFits with not telling you where you were gonna go, because that's a red flag and controlling.", "Or some other type of drug? Could explain the long toilet break?", "I would imagine she knows what weed smells like.", "Reminds me of \"Swimmers\" by Broken Social Scene.\n\n\n\"You look good...... but you smell bad\" is literally a line of the song", "Listen, apparently I have no instincts and I’m one date away from being trafficked according to the internet.", "True but I think there was a layer of spontaneity there. Where we went there’s a whole bunch of places I figured we would walk down the, very public, pier and he would let me pick! \n\nY’all are really hung up on this but I don’t find it to be the issue. \n\nThe parking lot was not sketchy, was in a very public place and was 385 feet away from the bar we went to. \n\nHe was definitely trying to be spontaneous\n\nThe conversation went something like \n\n“Do you have plans tomorrow night?”\n\n“No” \n\n“Okay now you do we’re gonnna go to the famous village pier tomorrow at 6”\n\n“6 might be too early. Call me and we’ll figure it out”\n\nThen we talked had a good convo he sent me the address to the parking lot. Not everything is a trafficking scheme people. Touch grass.", "Who takes ten minutes to poop? Especially in a restaurant bathroom?  That makes no sense at all.", "Weird take. Guy’s an oblivious ass but he almost certainly just had the shits", "I was high. I explained his smell in above comments I didn’t realize it would be such a hot topic. It was the smell of mildew and a hard days work.", "You will be a complete AH to yourself if you go on a second date with this guy. Unmatch him and if he keeps texting you block him.", "I’m sitting here going through it in my head. I think mostly trying to make myself feel better 😂 This guy lives like an hour plus away and works somewhere over here within 30 or so minutes. He got off at 3 and was possibly running errands between then and now (7PM)? He wouldn’t have a chance to use the bathroom for a few hours and definitely didn’t have a chance to shower before the date. Maybe he had nervous shits and sweats, he didn’t strike me as the nervous type tho. \nAlso, I feel like the smelly comment was so mean so many people are referring to it. \nI really like men who smell good. It’s like in my top 3 first things I notice about a man. He didn’t smell *bad*. He smelled like he left his laundry in the washer overnight and like maybe he worked all day. Not the end of the world.", "My best friend has IBS and has had to use the restroom at restaurants many times, sometimes it can take a long time. Not saying this was necessarily the case for OP but just replying to your notion that it makes no sense at all. There are plenty of people who have to shit in public restrooms.", "People with IBS who trigger poo from embarrassment or stress.", "I’m perplexed by this too"]}