{"id": 27773, "submission_id": "16u0wa2", "title": "AITA acting superior at my middle school reunion", "selftext": "Im 23 F. In middle school i was excluded and treated really harshly by my fellow classmates. I lived in a predominantly asian area and am asian myself, but i was never seen as “asian enough” by most of my other peers because i was chubby and didn’t do well in school (neurodivergent). They would constantly be passive aggressive to me and act like i was a pest whenever i was trying to genuinely be nice so i started resenting them and hanging out with the people who actually accepted me.\n\nToday i changed a lot. I lost tons of weight after  high school and i made friends with a photographer who helped me get a start up with modeling. Im no where near as successful as a Naomi campbell but i do high fashion editorial modeling. Im proud of my position and im aware that im very fortunate to be in the position i am in.\n\nYesterday night was my middle school reunion, i have a good group of friends ive known since middle school so we all went together. When we arrived i felt uncomfortable and only spoke to my group or the people who didn’t treat me like crap, whenever one of the people who used to act shitty towards me tried to speak to me i just ignored them, continuing to talk and not looking at them at all. I didn’t see an issue, they did the same thing to me, but apparently it irritated one of the dudes (this one posted my low test score to humiliate me in middle school). He came up to me and was trying to talk to me but i just ignored him. He started telling me i thought i was better than everyone else and i was acting like a stuck up prick. I replied that i am better than everyone else and that’s why i have a more successful career. We then had some back and forth because i mentioned that he treated me like crap so he shouldn’t act entitled to my time or respect, at that point my friends told me to let’s just leave. I personally feel like you dish out what you get, they all did the same shit to me in middle school. My friends were all on my side but some of them felt like i could’ve tried to be nice to keep the peace. AITA?", "created_utc": 1695860129, "permalink": "/r/AmItheAsshole/comments/16u0wa2/aita_acting_superior_at_my_middle_school_reunion/", "score": 2178, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i might be TA because i couldve just acted appropriately to keep the peace and not ruin the event\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Middle school reunion??? Jesus Christ, why???", "Not at all,  you should've seen me at my 40 year kindergarten reunion.    It was one for the ages.", "[removed]", "ESH because it’s a middle school reunion.  No one cares.  All of you need to grow up.", ">I replied that i am better than everyone else and that's why i have a more successful career. \n\nYTA. Yep, this told me all I need to know. Acting like this at a fn middle school reunion? Please. You could have handled this situation differently and maybe showed some maturity on your level. I get that those ppl treated you like shi, but you aren't helping your case by doing the same thing they did to you. You know how you show a person up who has bullied you? Not stoop down to their level.", "YTA\n\nI have read alot of dumb things on reddit… and this is one of them.", "YTA - “I am better than everyone else…” In front of everyone else, including your friends. Bet they felt awesome.", "YTA\n\nyou’re an adult now so you shouldn’t act like how those people acted when they were… middle schoolers. I get not talking to them, but telling them “i’m better than all of you” is just super cringey and unnecessary", "Who has a middle school reunion? Hmm. Interesting.\n\nSo basically, to punish the children that acted like children, you - as an adult - acted like a rude child. Gotcha. Yep, YTA.", "Look, I get that being young is hard.  But this isn't real, this is you projecting what you want to do, or what you want to happen in the future. Like a non violent revenge fantasy?.   First problem, I can tell you that a lot, and I mean A LOT of us over the age of 21 do not recall half of what happened in middle school.  We'd remember a vague ick about somebody but probably not anywhere as specific as you mentioned.  Second, there has never, ever, been a middle school reunion.  High School, College, yes.  But most people won't go.  Nobody in their right mind would ever go to a middle school reunion.  Third, you googled a famous model from like, ten years ago and hoped that would make you sound older.  You're 13, tops.  \n\nNow, if we read this the way I do, let's give you an ESH.  Yes, they suck for being mean and entitled, but you would also suck because that's a completely childish thing to do and say.  Something a 13 year old would do.  Just saying.", "YTA. For going to middle school reunion.", "this is the lamest, most pathetic shit lol", "Middle school reunion????? Is that even a thing?!?!\nYou behaved like a child and made yourself look foolish.\nWhy can't you let it go? You could have just been pleasant and polite to everyone. Why did you feel the need to be intentional rude?", "You're *still* in middle school, aren't you? Hope your actual life turns out better than this fantasy version of yourself, because they are an ass.", "ESH. Congrats you're now the bully. I'm sure if you practice harder, you can really turn it up for your high school reunion.", "ESH - you all sound very immature. Real adults move on from middle school.", "ESH - the best thing to do would be to not force yourself to be around these people. Your behavior was pretty immature.", "Yes YTA. Let me explain why. None of us are the snot we used to be in middle school. I was picked on a lot, I get it. I really do. Many years after I graduated I discovered the kids who were the meanest had really rotten home lives. They acted out at school because it was the only way they could feel good about themselves. It’s ok not to forget. Forgiving is actually for your benefit. I cleanses your heart of the anger you hold.", "ESH. The real power move isn’t acting or thinking you are better than them… it’s growing past that and realizing it doesn’t have an effect on you anymore. Bullying back won’t heal middle school you.", "YTA. If you can’t behave yourself you should have stayed away. \n\nAlso you seem incredibly arrogant for a new model. Naomi Campbell? Get over yourself", "YTA here. At the end of the day, it's middle school. I understand having a lot of pent up rage and trauma from being picked on, but your classmates have changed just as much as you have. Kill them with kindness, or just boast about your career if you wanted to feel superior.", "ESH. I will first ask if you are doing alright? I know it can be traumatic to walk into a place that holds so many bad memories for you. I'm glad that you were able to walk in with your head held high. I was severely bullied in school for many reasons. Race being one of them. I understand the hurt and anger and the need to make people feel they didn't win in breaking you. Had you just gone in and confronted him, it could have been healing for you. Instead, you just made yourself look bad by trying to act superior, and it unfortunately will probably make your bully be seen as a victim while also giving others a new reason to shun you and look down on you. This wasn't a win for you. I hope you're able to heal.", "ESH. you arent better than anyone", "YTA for writing this fake ass post lol", "You went to the middle school reunion? I was also fat with untreated adhd and they could not pay me enough to attend. The thought is ghastly. Screw those people.", "Esh.  They shouldn't expect your kindness after being such jerks but you could have left it at that rather than saying you are better and more successful than them.  Now you are at the same level they were - but you're also older and should know better.", "Congratulations, you stooped to the level of middle-school bullies as an adult. YTA", "YTA. You’re punishing people for mistakes they made as kids by doing the exact behavior that you didn’t like back then - but you’re an adult. \n\nCan also guarantee that while your friends said they were “on your side” after the reunion to your face, their side group text says otherwise and they are just afraid to tell you. \n\nPut the modeling money toward a significant amount of therapy.", "> I replied that i am better than everyone else and that’s why i have a more successful career.\n\nYTA - middle schoolers can be really cruel to each other but to be this rude as a 23 y/o is asshole behavior. I can't be on your side for acting like a 12-14 y/o middle school bully when you're supposed to be an adult.", "It's a middle school reunion, not even high school. Why do you still care what these people think?", "ESH. But that doesn't matter. What matters is there's such a thing as a MIDDLE SCHOOL REUNION?? I've never heard of such a thing.", "You turned into a bully yourself and on top of that you are just a model 😂😂 nothing more, you are not bringing change to anyone’s life and are just promoting narcissism. You have no right to be on that of a high horse.\n\nAnd yes you are the asshole for one additional reason, you went to a middle school reunion.", "YTA assuming this is real. you went there to pick a fight. Find a therapist and work on moving past freaking middle school.", "They were the AH then, YTA now.  What we do and who we are as young adolescents is entirely different than as adults.  How do you know you're more successful, and what will you do when the bloom is off the rose and the agencies have moved on?  \n\nHolding grudges over middle school is petty and immature.  You still have some growing up to do.", "If we’re just focusing on your actions at this reunion, then you would be the a-hole. I say that because I think a better response would have been, “I remember you bullying me when I was younger and it still bothers me to this day. I do not want to talk to you.” This is more mature than “I am better than everyone else.”\n\nRemember that some people may have genuinely forgotten or have not cared about those events because it has been years and people can change.\n\nI can sympathize with your feelings of past hurt and grudges. Have you ever talked to a therapist about them? Have you talked to your friends about them?\n\nedit: I could maybe see ESH since this became a multi-person conflict with the person starting the conversation by insinuating that you thought you were better than them", "There are middle school reunions now?!", "1. Who goes to a middle school reunion? \n2. If you didn’t like the people you went to school with what’s the point of going to a reunion? I never understood that. \nAll in all this sounds like a petty nightmare", "ESH for HAVING a middle school reunion. Like, what?", "You sound like a dick", "To clarify, why the hell did you go? \nOr more exactly why the hell does even exist a middle school reunion? If you've keep contact with your middle school friends, what were you expecting on going to this reunion? Just brag about your body change to your former bullies? And I would be a little bit more emphatic if this was a high or college reunion, but girl this was middle school, they were stupid teens, has already been like 10 years, people change you know? You didn't even let them talk to see if they wanted to apologize", "You weren’t the asshole until you said ‘i am better than everyone else and that’s why I have a more successful career’. Goddam that’s like peak asshole.\n\nEveryone did shitty things in school. We were kids and felt we were the victims in some ways and got a raw deal and in other ways we may have done that to others. Obviously to different degrees. \n\nDude came over to have an adult conversation. Say hi. Maybe he came to acknowledge the stuff, maybe not. To totally blank the dude is a bit on the line, without more info, but yeah. What you said was being an asshole… you have zero idea how they are now but assumed you’re better **now**? What a dick move. \n\nWas fine to stick to your middle school friends, but part of reunions are for people to acknowledge they were immature in school cos - you know - they were kids. \n\nESH.", " Why the hell would you go if you hated everyone", "I call bs on this. A high fashion model who is successful is here on reddit because she went to a *middle*school reunion and told off her former bullies? \n\nThis is clearly just a made up fantasy", "This is bullshit. No one has a middle school reunion.", "ESH. Just don't go if you're going to act like this. A modelling career isn't peak success and the way you tried to position yourself is just cringy. If you really wanted to make a statement you should have not shown up lol.", "It's a shame you never grew up.", "YTA.   It turns out you were a bully all along, you just never got a chance to express it in middle school.  Congrats, you turned into the very people you despised.", "Sorry but is this real because this reads like a shitty \"revenge fantasy\" straight from Netflix.\n\nIf real, ESH. Get therapy, you're the bully now.", "YTA - you did the opposite of what you think you did, you proved you're not 'better' than them. You obviously are quite immature and vindictive. Par for the course for most models lol", "TA  swallow your pride and move on", "The real assholes here are the ones that planned a “middle school reunion”.", "ESH. It was wrong for them to bully you when they were 11. It’s even worse that instead of using your words to talk to them about the impact of thier bullying — you decide to behave like an 11-year-old 10 years after the fact.", "Bro who the hell goes to a middle school reunion? Better yet, what type of middle school even does that.", "Is this real? \n\nIf it is, I think you have some childhood trauma you will need to work out with a professional. Good luck!", "Middle school??? What???", "It feels really bizarre to not only attend a middle school reunion, but still hold such a strong grudge over their passive aggressive behavior from when they were 11.", "YTA, let it go, let it go! A middle school reunion, jfc! Everybody had an awful experience in middle school, it’s when children are at their worst. I wouldn’t go to a middle school reunion in a million years because those people mean nothing to me.", "This is weird. It's been ten years, you changed everything about yourself but you couldn't go to therapy. I don't think you're a bad person for resenting people for how they treated you but it was definitely an AH move to directly reach out after ten years for the sole purpose of showing off, not even to get closure or something. You could have confronted them without being like them. Like you deserve to be mad but this just feels like unhealthy resentment at this point. Go to therapy.", "Why would you even go to a middle school reunion lmfao", "ESH- it’s a middle school reunion. The fact that you’re holding onto something a 12 year old did is crazy. You say you’ve matured: physically yes but not mentally. It’s kinda pathetic how you still holding onto all of this and tell people that you’re better than them. Girl see a therapist or some shit. Get a grip", "You sound like you’re still in middle school. \n\nYTA.", "Yta. You aren’t capable of forgiveness. You aren’t better than anyone.", "Honestly YTA for acting like a spoiled immature brat at mind you a middle school reunion??? Like let’s be ffr most of those who bullied you 100% wouldn’t be acting that way anymore and they’ve definitely matured by than and most probably wouldn’t even remember that time at all also did you not think any of these people would show up at the reunion? \n\nInstead of ignoring them and acting rude you could have just held in your pride talk them for a little bit (maybe about how they treated you in the past in a calm manner) and move on it’s that simple and I’m not even trying to be mean about this, I’m saying this because I’ve been where you’ve been and thought with this exact same mentality before and lemme tell you that it NEVER ends well for anyone.", "NTA. You got your revenge but now it's time to let go of this. You're only 23. Life has lots of lessons to teach you. You may see these people along the way again.", "Not The Asshole.  You treated them how they treated you. If they were your friends in middle school.  Yet you push them away.  Then yea.  That's an asshole move.  But you tried to offer them friend ship.  Yet they spat in your face.  And I'm guessing because you're more popular now.  They tried to befriend you.  you're not the asshole", "NTA. This comment section is crazy. Is everyone just ignoring the fact that this guy started it?\n\nOP is in her complete right to ignore her ex-bullies. They’re not in anyway owed her time and you have the right to ignore people you don’t want to talk to. Is it kinda rude? Yeah sure. But these people bullied her and they certainly weren’t there to apologize. I don’t blame her at all for ignoring people that trigger her.\n\nThen one ex-bully gets his panties in a bunch that his ex-victim wouldn’t engage with him and thought he was entitled to her time. Well, he’s not. And that easily makes him the asshole in the story.\n\nHe then seems to call her a prick and calls her out publicly. Again, he’s the asshole for all of this. She then defends herself against her former bully and decides she won’t let him win this time. She calls him out and says she thinks she’s better than him. I don’t blame her for that at all. This guy sounds like an asshole and he got what he deserved by starting shit over being ignored.\n\nYou are all literally out of your minds calling her the asshole.", "Middle school reunion?  Um...okay.", "ESH\n\nThough, I don't blame you. I think I would instead have been so overtly over polite and used the tone one does to a naughty child when talking to your bullies, so I'd have been an AH too.  Bullies so rarely grow up to be decent adults.", "NTA You needed to go to this reunion to show some jerks how successful you are. And you did. And you put the one who posted low test score in his place. Revenge is a plate best served cold. Good on you. I love it that you said I am better than every body else. It may have pissed people off, but that's why you went.", "Lots of former bullies in this comment I see…", "NTA. Your bullies aren’t entitled to your time, attention and patience.\n\nThough based on your story, not sure why you even bothered going.", "If this is real as opposed to the fantasy of a middle school student, I tend to cut people a lot of slack in the way they deal with their childhood bullies as adults.  Obviously, it would have been much better if you'd been at least civil with everyone present, but I'm giving you a somewhat reluctant NTA.  \n\nIf you are the middle school student described here, know that you don't have to be thin, or a fashion model, or glamorous to be worthy of respect and kindness.  Middle school is hellish for many students.  I hope you'll find a couple of friends who can help you get through it, ignoring whether or not they're popular.\n\nKnow that when you go to your middle school reunion (if such things exist), a great many people will have changed, and that a lot of people who experienced themselves as misfits will have developed romantic relationships, friend groups in which they're liked and respected, and satisfying careers.  It gets better.", "this is exactly what happened to me at the party for the 20th anniversary of my fifth birthday", "[removed]", "Esh for going to a middle school reunion", "No need to read the details. Yes acting superior makes you the asshole in every circumstance. Also, who goes to middle school reunions? I’ve never even heard of that.lol", "It’s a lot of effort to be pissed off about things that happened years ago. While they sucked as 11 year olds (children), you currently suck as an adult. But you suck mainly to yourself because the peace that you could give yourself by letting go of anger is unbelievable. \n\nPlus you’re also the asshole cause if you’re that pissed at these people then just hang out with your friends on your own and don’t go to middle school reunions making everyone feel weird.", "Middle school? high school.. I hated all of them when I was in HS why would I want to see them, 10 20 years later... I guess NTA screw them", "You seem fully convinced you did nothing wrong even though almost every answer is YTA or ESH. If you are fully convinced your NTA and have every intention of fighting all judgments otherwise then why even post here?", "NTA I mean there was no need for you to make it uncomfortable for your friends but you're right this man was not entitled to your time or respect.", "NTA\n\nThat reminded me of Janice Joplin, who got severely bullied at school. She showed them all by [becoming an iconic singer](https://www.britannica.com/biography/Janis-Joplin#:~:text=Released%20posthumously%2C%20that%20album%2C%20Pearl,a%20%E2%80%9Cgirl%20singer%E2%80%9D%20should%20act ). Sadly, she took her own life.\n\nSo fudge them!\n\nDon’t let them live rent free in your mind. Enjoy your success, and live a long and happy life!\n\nThat was probably the closure you needed.", "YTA", "Going against the crowd and saying NTA\n\nThey were bullies, fuck them. Has any of them even apologized for their shitty behaviour before? I doubt it.", "Why she should be nice to people, who bullied her? They interested in her because she is rich and pretty.\nHell, I don't even acknowledge people who bullied me. They are nothing to me. Why suddenly bullied people are the jerks for giving the samw energy back?", "NTA, bullying is abuse. You don’t owe your abusers the time of day and they don’t get to cry after getting a tiny taste, just a TINY taste of their own medicine.\n\nThe ax forgets, but the tree remembers.", "Reunions are rarely worth going to, even more so that it's a middle school reunion. You and your friends could have just enjoyed your time better elsewhere. For this situation, ESH.", "Sorry mate, YTA", "You’re not in school anymore, they people you knew in school are now adults, you’ve changed, they’ve changed. It is is time to move on. \n\nThat said, I get the desire to get revenge and give them a taste of their own medicine. \n\nYTA but I would have done the same.", "Congratulations! You became what you hated!", "NTA - They got what they deserved.", "NTA", "ESH. Them for treating you as such in the past, but also you for choosing not to be the better person and act like an adult.\n\nIt’s a *Middle school reunion*. Not a 20 year high school reunion. You’re 23 but you’re acting like you’re 3. Grow tf up", "Never heard of a Middle School Reunion. NTA", "NTA.  But just when exactly did people start having MIDDLE school reunions?", "NTA - You weren't projecting how better you were to them.  In my mind you were projecting your new after middle and high self and that you were ignoring those who treated you crappy at the time.  All good.  Why should you give the time of day to these people anyway?  Besides you couldn't just change the fact that you lost weight and look better, unless this guy was angry that he couldn't bully you anymore. Also, you were more successful because you worked hard at it and you earned your success and you should be proud of that.  Don't listen to people who only want to beat you down to their level so they can feel superior to you.  They're not just not worth your time.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIm 23 F. In middle school i was excluded and treated really harshly by my fellow classmates. I lived in a predominantly asian area and am asian myself, but i was never seen as “asian enough” by most of my other peers because i was chubby and didn’t do well in school (neurodivergent). They would constantly be passive aggressive to me and act like i was a pest whenever i was trying to genuinely be nice so i started resenting them and hanging out with the people who actually accepted me.\n\nToday i changed a lot. I lost tons of weight after  high school and i made friends with a photographer who helped me get a start up with modeling. Im no where near as successful as a Naomi campbell but i do high fashion editorial modeling. Im proud of my position and im aware that im very fortunate to be in the position i am in.\n\nYesterday night was my middle school reunion, i have a good group of friends ive known since middle school so we all went together. When we arrived i felt uncomfortable and only spoke to my group or the people who didn’t treat me like crap, whenever one of the people who used to act shitty towards me tried to speak to me i just ignored them, continuing to talk and not looking at them at all. I didn’t see an issue, they did the same thing to me, but apparently it irritated one of the dudes (this one posted my low test score to humiliate me in middle school). He came up to me and was trying to talk to me but i just ignored him. He started telling me i thought i was better than everyone else and i was acting like a stuck up prick. I replied that i am better than everyone else and that’s why i have a more successful career. We then had some back and forth because i mentioned that he treated me like crap so he shouldn’t act entitled to my time or respect, at that point my friends told me to let’s just leave. I personally feel like you dish out what you get, they all did the same shit to me in middle school. My friends were all on my side but some of them felt like i could’ve tried to be nice to keep the peace. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Middle school reunion?? Wtf?", "ESH. Did y’all even leave middle school? The way you’re all acting, the fact that you even had a reunion in the first place. \n\nI was also bullied pretty severely in middle school so you know what? I don’t talk to my bullies anymore, don’t put myself in situations where I would need to talk to them. Some of the bullying was severe enough to give me PTSD, but being petty towards my tormentors would get me nowhere.", "you’re both assholes. yta to yourself for hanging on to shit from 10 years ago 😂 time to grow up and move on, middle school sucks for most people - teenagers are shitty", "“I was bullied, so I became a bully” ESH", "INFO: Why did you go to a middle school reunion even though 1) you were bullied by a lot of people there, and 2) you still hang out with your middle school friends?\n\nWas the free food really that good? Like… just skip the reunion and go somewhere else with your friends so you don’t have to deal with your trauma.", "jesus christ, go to therapy.", "I’m sorry that happened to you but you gotta let it go. Doesn’t bring anything to your life.", "YTA \nFYI if you actually want to show people that you are better…that’s not the way. People who are happy with themselves don’t really tell other that they are better than them. Like that you just seem like an angry little 12 year old who seems to do everything to try to impress others. You don’t seem secure or happy for that matter. Just bitter and sad", "Yeah, YTA. It‘s been years, that was middle school, you’re an adult now so act like one. Particularly the “I replied that I am better than everyone else and that’s why I have a more successful career”-that is just petty and only makes you look like an ass. You’re not in your teens anymore. It sounds like everyone but you has grown up, become an adult, and was trying to be polite, leaving the past in the past.", "I was bullied badly from when I was 10 until I was around 20. For the most ridiculous reasons (for example, I cried when I got pushed off of a thing during PE that caused me 8 fractures, I got bullied because my brother had mental health issues, I got bullied because my mom had cancer...etc) So I think I know where you are coming from. Let me share my 2 cents about moving on and letting go of this type of trauma (and its a process, I still hold plenty of resentment to those people now in my mid 30s)\n\nI felt for a long time the world owed me something because of my bad experiences during my childhood. I felt \"better\" than other people because people were so incredibly cruel to me, everything bad I did must have been okay because its karma and excusable because of my trauma. Its not. Those people that bullied you were and possibly still are horrible people and you dont owe them your time. But try to take the high road and not be rude to anyone. By telling someone \"I am better than you because x and y\" you are showing them why you are not. I know.it feels good to rub your success in their faces. But letting go of those experiences is something you should do for YOU, not for them. trust me, you will feel better.\n\nnext time you can simply tell them \"you were horrible to me back in school, I dont want to talk with you\"", "[removed]", "Hurt people hurt people. You should of healed yourself before going", "Wait, middle school reunions are a thing?", "I’ve never heard of a middle school reunion. What would be the point?", "lol, as a photographer who is unfortunate enough to have to work with models regularly, I simply cannot understand how you think your career is something special. Most of the hundreds I’ve worked with are absolutely lowest common denominator people, and your “career” is over in a few years. Hope you have a backup plan. \n\nYTA", "YTA, who the heck goes to a middle school reunion 🤷🏻‍♀️", "YTA , why did you even go there? Cause your friends went and you didn't want to be 'left out', expect you were unable to muster some politeness?\nIf you're not over the bullying, go to therapy instead of the reunion!\n(Also, you're a model, you might make good money right now, but probably not for too long. Those of your classmates pursuing higher education are very early in their career and they might get further than you. They might go on saving people, inventing stuff, impacting people in a more important way than your pretty face on a billboard. So get off your high horse.)\nHonestly, there's no shame in therapy, it'd benefit most people, yourself clearly included.", "It was all good until you said that you're better than them. Like what if the person approaching you wanted to apologise? Would you be better than them then?", "YTA", "Oooof this story is a disaster\n\nThese comments aren’t quite working out the way you expected them to are they OP? Judging by your responses you’re posting to the wrong place if you wanted a standing ovation and a “yasss huntyy!”\n\nWe were all 11-13 once. Some of us were bullied some were the bullies but I’d hope by now we at least would have all grown up and matured a bit. \n\nHolding on to this is not going to help you in any way nor is looking for an apology you may never get. Do yourself a favor and focus on healing and leave this in the past. \n\nUnfortunately life isn’t a rom com where the geek gets a glow up and revenge at the reunion against the bullies and everyone claps. \n\nYTA you’ve become someone you probably would have been bullied by in middle school. The irony.", "The fuck is a middle school reunion?\n\nSidenote, I graduated HS in 2003. Both the 10 year and 20 year anniversaries were decimated by lack of attendance because... social media exists", "I mean, you do realize that your modeling career likely has a short shelf life, right? Most models retire before they're middle-aged. And as someone who is middle-aged and was also bullied by racists in middle school (and every other grade), I have to advise you that holding onto that pain you suffered back then is just going to make you suffer even more. By blatantly ignoring your former bullies like that, you're showing them that they still have power over you. So in your attempt to make yourself look better than them, all you showed them is that you're still hung up on them.", "I hope it was typo from OP but that would make it 5 year thing. Still strange. \n\nNAH: it’s still weird y’all holding stuff back when you were younger. \n\nOP let me ask you this. DOES it really matter in the grand scheme of things?", "Thos who doubt middle school reunions: I've got primary school reunions from time to time, no high school ones. It depends on whether people organising these events are able to organise xD and are willing\n\nESH\n\nIf they were normal human beings they would find 2 minites of their time to apologise during the last 5 - 10 years, they didn't.\n\nYou stating that you're better than everyone else, especially next to your friends, is more than a little narcissistic and overcompensating for the humiliation of middle school.\n\nI'd suggest either not attending reunions, cold politness or, if you want to be petty (and that's also ok) simply stating \"Unless thisnis an apology, as I haven't received one yet, I don't think we've got anything to talk about\". unless", "YTA. I was bullied in high school terribly bullied. I was the fat goth girl that was quiet and sang in choir. I went to my 10 year reunion with a friend who wanted to go. \n\nWhen the people who bullied me came up to me you know what I did? I told them about what university I went to, that I academically excelled graduated with honors, talked about my career and my recent engagement. I wasn’t petty about it cause those are all topics that are discussed at those types of events. \nI showed them that I had changed since they bullied me and was living a good life, I showed them I was better by not being petty or rude. It’s called maturity. \n\nWhat you did actively talking down to people was immature and now to them by acting that way all you have done is give them justification for every nasty thing they did to you, now they can turn around and be like “well see she was a bitch back then and is an even bigger bitch now.”", "Post written by a middle schooler with a dream lol.", "School reunions are dumb as fuck, I’m glad they’re just not a thing in the UK as far as I’m aware", "Liz? This you? Cause the quality has gone way down. You’re not even trying to make it seem believable.", "YTA. Reread what you just wrote and tell me you aren't. \nYes, they may have been TA in middle school. But this isn't 'who was the asshole'- it's 'am I the asshole' So yes, yes you are. Congrats.", "Only went to reciprocate the actions of others years ago??? You stayed within your friend group. So going to the event had one purpose. \n\nI'm afraid you've made yourself YTA material. \n\nThe fact that these people approached you would infer that they have actually progressed. If you see progress as being the worst of those you despise then you are not in the right path", "In case this post is not fake: YTA\n\n>they all did the same shit to me in middle school.\n\nThen why did you go there in the first place? To show off that you \"are better than everyone\"? In that case you really need to grow up. Tbh.... you are stuck so much in middle school time, you clearly aren't better than them.", "Fake and gay", "ESH, seems like you all stopped maturing in middle school as well", "ASSHOLE- That was back in middle school.  People grow and change.  You did!  Grow up and move on.", "YTA but I understand the reason. \nIgnoring them is fine but your ‘i am\nBetter because of my job’ makes you sound arrogant and like you base your personality on being a model. Beauty is only skin deep. I was bullied, at school and at home, I know how heartbreaking it is and you did not deserve it at all. You don’t sound happy. I may be wrong here but being happy is what we all strive for as humans and I hope you can find a way to move on from the pain in middle school and thrive. I used to be an actress and the industry can mess with your head if you’re not careful. I’ve seen a lot of beautiful people lose their way once they stopped being paid for their looks. Invest and save and build up other skills. Twenty years later I only know a few people still working in the biz.", "A middle school reunion is a crazy concept.  I don’t think we even had a 10 year HS reunion lol", "You held on to a grudge from middle school?? Ok, I won't kid myself in saying that middle school wasn't a traumatic experience for a lot of people. It can be difficult to heal from it. At the same time, you are 23 and haven't spoken to them in years. You are judging people based on the actions that took as children. Why? You are all adults now and have gone through a lot of growth. \n\nYour grudge is preventing you from knowing these people. You are free to do so but it doesn't change the fact that you are doing exactly what it is they did. You are judging them. You believe yourself to be superior to them enough that you believe it warrants you the ability to verbally mock them as you did here. All they wanted to do was talk and you openly ignored them. So what was the point in going other than to lord it over their face how successful you turned out? \n\nI do get it in part. They bullied you and made your life hell so why they assume you would want to talk is beyond me. But that still begs the question of why bother going when you could have just met up with your friends somewhere else. \nYTA", "To be honest... it's just really shows who grew up and who didn't.... just saying...", "You’re the asshole instantly just from the title lol", "I feel sorry that you're so insecure that you need to flex on people from middle school who probably don't even remember you", "Why did you even go if you weren’t going to speak to anyone?", "ESH, key point in this is they did it in middle school, you're doing it as an adult, as such the standard to which you are held is higher.", "NTA \n\nFuck em. They were shitty and you get the energy you give. Who cares if they’ve “changed” they don’t deserve your time or energy. Kindness is overrated when it comes to this “keep the peace” shit. People forget how awful bullying in middle school is. Fuck the humans saying YTA. \n\nGotta ask tho why did y’all go at all? ESP if you already hangout with those friends? What was the point other than to gloat? Gloating to bullies in my book is great BUT why out yourself back there? Just sounds like unnecessary triggering.", "I had to think for a sec but everyone is the asshole here. That reunion didn’t need to happen. Your “I am better then everyone” comment was what also made you an asshole. All in all who cares it’s not like you want to spend any time with those people anyways.", "NTA. Why spend time with people who don't deserve it?", "YTA. If you still harbour resentments towards former classmates, you are not healed enough to attend school reunions.\n\nA more general ESH to whatever group of people decided to organise a MIDDLE SCHOOL reunion. Just why? Who even remembers their middle school classmates? You were there for like 5 seconds.", "Middle school reunion?? ESH", "So.. they grew up and you didn't. Well done. YTA.", "YTA. And stuck at age 13. My good friend from high school, at our reunion, confronted a jock about how he repeatedly gay-basued my friend in the halls at school. The jock profusely apologized. I did something similar with a bully of mine. So it depends on what you want to spread more of in the world. My motto is living well is the best revenge. What did you think your ignoring these people accomplished?", "Fuck being nice to keep the peace lol", "😂 just sad", "LMAO a *middle school* reunion? Life hasn’t gotten much bigger if your highlights include “Got back at my middle school bullies at the reunion 😜.” You became a model, and that’s cool, but why bother going to this reunion to prove your life has improved? You’re ALL opting to go to a MIDDLE. SCHOOL. REUNION.", "Daaaaamn, you are still stuck in middle school. Go to therapy, embrace, accept it's part of you, set it on a shelf, let go.\n\n\nYTA", "YTA for making up this story", "YTA because you have a middle school reunion. Grow up and move on", "Yta. Basically a nobody model with no other prospects and acting as if youre a god amongst them?", "YTA let it go and stop acting like an asshole.", "YTA.\n\nMiddle school folks are children. Most people do regrettable silly things back then and then grow up. You are 23 now, still young yes, but a ways removed from middle school days. It would have been at least worth it, if you went all the way to the reunion by choice, to see if people matured since then versus still holding them to their middle school behavior.", "Someone peaked early.", "Oh, it's story time in middle school? I didn't know they let the kids post on Reddit.", "ESH because you shouldn’t have said “I am better than everyone else” based on how far you made in your career. Are you? Is this how you think when you gain some wealth and success, you’re “better” now and above conversation? I’m Asian too and I can tell you exactly what I think about people who reach a certain position in life, and act like they’re more important than people “beneath” them. \n\nYou could have said that you are better than them — as a human being. because you are a better person, and you never humiliated or bullied someone the way they humiliated and bullied you. That should’ve been your answer. But it wasn’t. So yeah, asshole thing to say and made you look classless. \n\nIn any case I agree with others that this sounds like fiction, or at least parts of it do not ring true.", "Why go if u hate others and are still frnds with the people u like anyway???", "YTA\n\nPlease get some therapy to unpack this baggage.  You seem to be clinging to this period of your life, intensely invested in maintaining your victim status.  I understand your perceptions of this bullying has shaped your life and it seems like you used it as a catalyst for change.  But you show not a glimmer of awareness that the rest of your class also has changed in the last 10 years.  And you also don’t understand that in middle school, we all are hugely self-absorbed, most of us are insecure and our behavior is usually geared toward self-preservation.  You being picked on looms large in your life.  IT DOES NOT loom large in everybody’s life.  They remember their own trauma, embarrassment or life changing relationships.  To expect them to remember, understand the impact and apologize is not really reasonable UNLESS you attempt to explain it to them.  I’m not saying you should do this.  I’m saying the lack of an apology does not prove they haven’t matured into decent adult human beings.\n\nI also think you’re focusing on the trauma of the bullying and discounting the positive experiences, to your own detriment.  You say you learned to ignore the bullying and focused on a friends group that accepted you.  You have retained these friendships through today.  Celebrate this!  Don’t let the former bullying define you into adulthood.  As miserable as you felt, you developed coping skills, created a loyal group of friends and used your perceived “flaws” as a catalyst to change.  Not everyone can re-write their bullying stories this successfully.  Please take the next decade to process the emotional damage you suffered.  Move past Middle school and embrace adult relationships. Try to approach all acquaintances (even if you’ve known them since grade school) as the adults they are presenting themselves as today.", "YTA. Just read some of your comments here, it seems that you are incapable of not insulting people. Simply stating that you are better than everyone else just shows how you are rotting from the inside while being exhorbitantly proud of your exterior. This is really sad, because looks don't last, but the way you made people feel sure does. Life looks pretty lonely and sad for you, kiddo.", "ESH\n\nI mean, normally I'd say YTA, but every single person there is an asshole so it kind of evens out. **People ever only choose to go to school reunions to show off** and earn bragging rights (that or they were dragged there). People who go to *middle school* reunions are extra petty.", "Well saying that you're better than everyone and all that is unnecessary and an AH thing to say\n\nThe stuff before that is just immature\n\nESH", "NTA. If anything, they got what they deserved, strut your stuff and get them to shut up! Honestly, sounds like a rly cool wattpad plot", "People berating you don’t know what it’s like to go from nothing to everything NTA let these people who made ur life hell feel like shit", "I think it's time to leave this sub. Middle school reunion? Fuck me.", "You could have tried to keep the peace and be the bigger person.\n\nBut why? NTA", "Life is a lot nicer if you move on from stuff but I get it. Still AH move. YTA", "[removed]", "Sounds like the whole school is/was a toilet. Bunch of turds you all sound like. You too.", "NTA. reap what you sow. i was treated poorly throughout my 12 years school education - i do not interact with anyone from back then. literally none. this is my decision, i stand by it. so should you. there is no way that couldve been handled \"nice\" because why?!", "if it's a lesson that Pa Kent taught Clark about punching down? Then maybe you might be the asshole...", "You're fine, as long as you don't up your ego as much as Asians do. Their culture is based on merit and showing people you are better than them. Why do you think these Asian migrants all come here? They want to dominate the land and show their ancestors that they could do it.", "What the fuck is a \"middle school reunion?\" In 2023? With social media being a thing?\n\nI'mma be brutally honest, by even showing up to that shit, you've shown exactly how cringe you are. This has got to be on the list of the most pathetic things I've seen on this sub.", "YTA - middle school? So you walked right in there with a chip on your shoulder about petty ass stuff that happened when you were a kid? Look I get it, you were bullied. I was too in elementary/middle/high-school. But to hold on to that anger had to of been draining for you. You're so resentful of them that you turned in to a bully. Only difference is... You're an adult. You should know better.", "There is an argument to made that what makes a person ‘better’ is that, if you’re on the receiving end of shitty behaviour, that you *don’t* behave in that way, even if it is a reflection to those who behaved like that to you.\n\nYou rise above, rather than sink down to their level where you essentially become as ‘bad’ as they were to you.\n\nOn the other hand: fuck those guys to Hades.", "I wish I had an award to give you. Indeed, why???", "Came to say this! Is it organized by people who peaked in middle school?", "If I was invited to a middle school reunion, I think I would laugh until I passed out.", "yea quite literally why definitely if she was only going to speak to the people shes still friends with and not anyone else shit was in middle school and shes still holding grudges from when she was a little ass kid 😂", ".My thoughts exactly! Middle school reunion. Such nonsense. Why not nursery/kindergarten reunion?!", "Because OP is still mentally stuck in middle school and wanted to go back to show off how cool and rich she is now. ESH…grow up folks.", "This. 👆🏼Exactly.", "SERIOUSLY. That's \\*all\\* I could focus on.", "Thats what I though.  I have never heard of that", "I was thinking exactly that too. People that peaked in high school usually attend their reunions. I can’t imagine anyone peaking in middle school and going to a reunion.", "My thoughts exactly...", "My elementary/middle school class recently had a reunion. It was wonderful. Of course my class was actually super nice and we all adore each other, so…", "This was my first thought! NTA But what kind of school has a middle school reunion?", "I’ve legit never heard of a middle school reunion before right now.", "And at only 23 too… jeez", "“Who eats glue now Gary!?”  \n\n“Lets see you smear the finger paint on my again Rachel!”", "Damn right! You show those formerly passive aggressive toddlers who's got their shit together now.", "Lol", "I want to go to my kindergarten reunion and show them that I now have a ginormous collection of crayons with ALL the colors instead of just the small box with only one row of crayons. 😄", "[removed]", "Middle school reunions weren’t a thing when I was younger. And they certainly aren’t now given that everyone has each other on social media.", "MVP", "The thing setting me off is a 23 year old “model” using *Naomi Campbell* as her marker for success. Feels extremely dated.", "[removed]", "🤣 - Brilliant.", "Pretty much this. I mean, if you're showing up to a middle school reunion, nine times out of ten, you're doing to show off and be an asshole.", "i care because i was the one who was being abused.", "Also I’m sure many of them have careers that don’t have an expiration date", "Yeah weird that a 23yo would mention Naomi Campbell and not like the Hadid's or something.", "Uhm.. I went to my elementary (k-8) reunion.  It does in fact happen.\n\n(okay folks... downvote a statement of fact...whatever)", "you know nothing about me or my life, if thinking my experiences are fake makes you feel better about yourself then go ahead. i didnt work my ass off to be shut down, and i didn’t go through internalized racism, ableism, and body shaming only for people to “forget” because apparently “most people don’t remember school past 21”. Guess who remembers? the victims of said bullying.", "why should i let it go? no one ever said sorry so there’s nothing to forgive. Im not letting go all the racism and ableism i faced, if they wanted respect maybe they should apologize for how they treated me for not being a model minority and having adhd", "No. Bullying is a pattern of abuse based on a power imbalance. She treated some people shitty for one night literally by bragging and/or ignoring people.", "If you got bullied like that I’m sure you’d do the same thing stop trying to seem like a good person", "ill make sure to practice", "🥇", "Yep. Honestly, nowadays I'm friends with a guy who bullied me in school. He has apologized a million times since. He never realized how bad it really got, and I think a lot of bullies dont. He is a nice guy, just had a hard time when his parents seperated back then.", "Her comment is shitty but not bullying", "Lol even worse, they proved they are no better than a middleschooler", "Bullies deserve forgiveness nor respect they always stay the same", "im upset that me, the victim, is put to the standard of forgiveness and graciousness, but them, the perpetrators, have automatically “changed” and “grew up” despite not ever reaching out to apologize", "You don't have to be friendly to former bullies. Bullies always stay the same, they just learn to hide it better.", "No NTA", "The fact that this is being downvoted lol. Did this post get brigaded by r/IAmTheBully or some shit?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I wouldn't go to my *high school* reunion if I was guaranteed money for going!  My best friend has even been my best friend since middle school, and I wouldn't go for her, but she'd never suggest I go.", "Yeah... High school is ok but... can we just forget what happened when we were 13?", "🏆 Here, you can borrow this one. I've got more!", "“back in my day…”", "A wild thought considering how many hit puberty *right then*", "I actually was invited to a middle school reunion, I did exactly this, I definitely had a great laugh that day.", "So Larry,...you still peeing in the sandbox?", "speaking of rachel i really hope i get to go to my 1st grade reunion if they ever have one so i can flex on that btch rachel i was so nice to tht btch and she was so stuck up i bet she wont say my shirts ugly now", "I don't get it.    I made a comment about kindergarten.", "This person was on your side. I don’t know how you were in middle school but you really did grow up to be very unlikable, didn’t you.", "Lmao “I’m the victim not a bully” proceeds to bully people all over the thread. \nDefinitely TA.", "bruh u/licknwart was on your side LOL", "I’m not surprised you were bullied, you seem awful.", "I could say the same about you :)", "You seem unlikable, maybe they were justified.", "You're the one attending your middle school reunion.  I wouldn't go around telling other's they have a sad life.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "You need therapy if you're still holding onto the actions of 12 year olds this much so many years later", "That's a great reason to MOVE ON WITH YOUR LIFE. You'll be infinitely happier. Find a therapist or something and move on.", "Also OP in your post you say “today i changed a lot” did you only change physically? how much have you grown mentally? It seems by now most people have probably forgotten what has happened, no offense OP, I think it’s time to move on from middle school abuse, I got picked on, I fought back, no one ever messed with me again, bully’s suck and we only put up with so much, everyone’s different, everyone has a different threshold, nonetheless, definitely do seek a way to express this besides reddit as if it caused you to create such a scene and think to yourself “you get what you dish out” after such a long time.. I think it’s time to let it go/move on like others have stated. \n\nBest of luck.", "So what have you proved? Some 12 yos were mean to you years ago, so now that you're an adult, you specifically showed up somewhere to make a point of ignoring them. And then turning around and saying \"I'm better than you, because of my job.\"  What if everyone had laughed because the other person was a self-made millionaire at 23? \n\nIf you were better than them, it would be through confidence and poise, so they'd regret not being friends with you. Not by acting like a kid in the playground. Either don't go to the reunion, because you have nothing to prove, and you're not interested in talking to anyone except your regular friends; or go to the reunion and act like a gracious star, so they wonder why they ever had the nerve to bully you. If you act like a 12yo among adults, the adult bullies are going to laugh at you.", "But you're making digs at their jobs when you said yourself you know you're lucky to have your job. Lots of people are smart snd kind and hardworking and aren't successful models. \n\nYou stooped to their level. Which was dumb to do because they were assholes to do it in middle school. As an adult you should know better.", "I was bullied, now Im quite successful. I got invited to a highschool reunion. Did I go? Fuck no, I moved on and have no interest to see these people. You decided to go cuz you wanted this exact same thing to happen.", "Girl it was middle school. Grow up and move on.\n\nAlso missed opportunity to be super sassy and badass with the way you talk to them and look down on them instead of playing the deaf kid. You think that was a gatchu moment but it just made you look weird af.", "[removed]", "Then don’t go I wouldn’t go near my middle/HS with a ten mile stick", "       “You know nothing about me or my life.”\n\n       Would you have said that if we agreed with you?", "From your comments , you ATH . You think you are better than everyone and stuck in this victim mentality . Congratulations you are now the bully. You need ALOT of therapy because you are saying these people bullied you yet here you are being the bully. Grow the fuck up , be the bigger and better person , drop the victim card and get therapy and help.", "You aren’t a famous model. Just stop. This is just embarrassing", "You yourself said you're better than everyone else that was there, I truly wouldn't want to interact with any of those people if you are the best there was. You're not better than anyone. Period. If you think you are, guess what? You're going to be seen as stuck up. If that's what you want, then do it,  but don't sit there and talk like you're a victim when you're doing the exact same thing your bullies did, except you're being a bully but want everyone everyone treat you like a hero. Be a jerk if you want, at least own it", "Yeah this isn't a healthy mindset. You are actively clinging to your victimhood. \n\nA lot of us got bullied. A lot of us got past it. You aren't special. Your actions are very childish and prove that you simply learned the wrong lessons; you aren't upset because they bullied you. You're upset because you didn't get to be part of the bullying, and now you're turning around and doing exactly the same thing they did. You are continuing the cycle and will be part of why they teach their kids to discriminate against people like us because \"see, look what she grew up to be, I was right the whole time\".", "You need to get some therapy or something to move past this. I'm honestly sorry you were treated so badly and it has stuck with you this long and this intensely but the only person being affected by this now is you. They likely don't even remember how awful they were as kids to you, all they would have seen at this reunion is someone who is seemingly doing well for themselves act like they are better than them all. Be a bigger better person. If you wanted to make a point then you should have just called them out on their past behavior", "Why did you go?", ">maybe they should apologize \n\nAnd how are they supposed to do that when you refuse to acknowledge them talking to you? Like the others said, if this is true then you need to get into therapy to address your feelings.", "How could they apologise if you wouldn’t let them talk to you??", "Dude..i was bullied as a kid too but you think i have resentment after TEN YEARS? No bc middle school kids are mean and are assholes. Who they are now VS when they were 11-14 are very different. Your behavior was very childish…i would be a bit awkward as well but not super standoff ish like u", "This has the same energy as \"black people can't be racist because they're oppressed.\"", "I’ll hop on the downvote train. She had a poor choice of words, she should have just stuck to “I don’t think I’m better than anyone, I just don’t want to talk to people who bullied and traumatized me in school, which is you.” Instead she said she was better than everyone.\n\nShe said ONE sentence that was out of line, and that’s equal to years of bullying? That take is a joke. Sure she was an AH for that sentence, but in the context of traumatizing children for years, she is not the AH in this situation.", "So, she's now the one with more power in this situation. She systematically ignored and belittled multiple people based on that power imbalance. Sounds like a bully to me.", "Got bullied like that for my last name, something so impossible for me to change that after 9 years I just full leaned into it.\n\nAll of the people that bullied me are adults now, and just like I made mistakes as a kid so did they. It’s easy to re-evaluate a person and give them the grace you wish you had. In fact, it’s simply the morally correct thing to do. Re-Evaluate the adult and decide if they still deserve the opinion you had of them when they weren’t old enough to pay taxes or smoke a dart.", "Damn no offense but everything you've said in this thread makes you sound like a sad pathetic person. \n\n \"I am better than you\" 💀💀💀\nGenuinely, I would have kinda been on your side if you atleast had a decent insult.\n\nOh and you might want to practice not associating being better or more content with your life to your career progression. You're going to be sorely disappointed when the expiry on yours rolls around much earlier than your middle school buddies'. Also consider actually leaving behind middle school before that happens.", "Yaaass girl practice that shit, fuck those bullies they dont deserve a second of your time", "OP, I hope you can hear this in the spirit it is written, from someone who also was bullied as a kid, and who wishes your life to be so much better. \n\nHow do you know that the people who came up to you — but whom you refused to talk to or even look at — weren’t coming up to apologize to you?  You don’t. \n\nEven if they weren’t, the way you behaved was appalling, and should lead you to realize you need therapy. \n\nI know where you’re coming from because I was bullied in middle school. That was years ago. I don’t go to the reunions (yes, there really are middle school reunions, for the doubters out there). But I have run into several of the bullies in the last few years. I’m polite to them. They have been polite to me. They haven’t apologized, but I have a great life and don’t need to be mean to other people; it would only diminish me.  I hope that they have grown beyond whatever caused them to act that way. I have grown enough to feel hopeful for that for them, and to be at peace with what happened. No, I don’t think what they did was ok, but I’m not controlled by it. \n\nWhen you not only can’t let go of past bad treatment but, even as an adult, need to retaliate against those people who bullied you as a kid, you are showing them a worse side of you as an adult than they showed you as children. You’re also showing that worse side to everyone else there. And everyone who hears about it. This is something that could hurt your career no matter what career you’re in; as someone with a public career, it’s not a good look. \n\nBullying people as an adult is MUCH worse than bullying people as a kid. Please think about this and go get some therapy so you can stop living in anger and hate.", "If you had stuck to ignoring, I would be NTA camp, but telling him you are better is always going to come off as AHish.  But you do havea lot of my sympathy, and I hate bullies. It sounds like you have made a good life for yourself.  Just maybe skip the next reunion!", "People think just because it happened it middle school, doesn't count. Bully is bully. They don't deserve forgiveness", "Didn’t go to my high school reunion. And I don’t regret it. To be fair, I also didn’t go to some weird reunion my college held. And I’ve never attended any of the odd functions my law school holds for my graduating class. Something about reuniting, as a free adult, with the same people and within the same confines created by any school grade seems harrowing and awful. If you like people from school, hang out in real life on your own. \n\nAnd that’s a good best friend :)", "We didn’t even have a high school reunion. Idk why, should’ve been last year, but I suppose it’s because no one wanted to have it.", "I'm so glad the only option to record shit when I was in middle school was a video camera that none of our parents would let us borrow. 🤣🤣", "*shameful look*\n\n...yes.", "\"Once I was socially inept with no friends and no job. I couldn't even drive a car. Well, look at me now, swanning into my middle school reunion.\"", "I mean, there were others there, too. Must be a super depressing community all around.", "Which is the proper response. Why go hang out with people you don’t like? If you show up just to make drama YTA.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "theres no need, they know their behavior because they treated me like shit in high school too, it just wasn’t as bad because when i was in highschool i began losing weight and obsessing over my physical appearance. People only respect you once they see you as something that can benefit them. I had and still have internalized racism due to their bullying and excluding me for not being asian enough. I had disordered eating because i wasn’t as skinny as the other asian girls. They knew that they were being assholes to me but now feel entitled to my forgiveness without even trying to apologize to me. They had 5 years after highschool and not one of them said sorry. I hate how im expected to be gracious because “it was in middle school” but that was one of the most important phases of my life, transforming from a child into a woman, and my self confidence was bashed because of them.", "Because YTA", "because my friends went. i ignored everyone else for a reason", "I you're at a school reunion, you're there because...\n\n* You're trying to show off\n* You were dragged there by someone else who wants to show off\n\nIf toxic people want to be toxic to other toxic people, I say let them be.", "Why do y'all always drag black people into something? Annoying.", "What a tone deaf comparison.\n\nIf you know someone stole the most precious years of your life making you misrable, why, in the absolute freezing hell, do you owe it to them to be nice or respectful? Only bullies say shit like this. It's the same ridiculous backward nonsense that people preach about \"be the bigger person\" because they are the same people who want to transgress and expect a pass and no accountability.\n \n\nShe did tbis to pekple who treated her like shit. it's more than fair. \n\n\nNTA", "What the... this is NOT the same 😂😂😂😂", "How is that “power?” She didn’t want to talk to people who bullied her. They persisted, likely because she’s attractive and felt that because they were men who wanted to speak with an attractive woman (despite their history) that she is obligated to give them attention. And you seem to think that too, which I hate to break it to you is straight up misogyny.\n\nSure she shouldn’t have said she’s better than them… but is she really that wrong about that? Most bullies who I know didn’t grow up to be great people. Poor choice of words, but suggesting that she was somehow abusing “power” by ignoring men who tormented her as a child is misogynistic nonsense.", "[removed]", "Congratulations, you are now more mature than 99.99% of people in this sub lol", "She gave him every opportunity to ignore her by ignoring him. She didn’t want to talk to her ex-bully and that’s fully valid. It’s HIM who had a problem with that and told her she was being rude by ignoring him.\n\nThis isn’t her coming into the night with an agenda to tell everyone off. This ex-bully proved he hadn’t changed and felt literally entitled to his ex-victim’s time. Fuck that shit.\n\nLike sure, forgiving and forgetting is great. But that falls apart when the person you think she should forgive and forget goes out of their way to be an asshole all over again.", "If they don’t deserve a second of her time what the fuck is she practicing for? 😂", "probably a better idea yeah no more school reunions for me", "Yup. My totally respectful NTA comment also got removed just now by the mods. Perhaps that is part of why this thread is so one sided. Fuck bully defenders.", "I did go to one reunion. And it reinforced that the people I've chosen to stay in contact with from that time are really the only ones I wanted to stay in contact with from that time. Nothing awful. Just didn't feel a need to do it again at all.", "I was soooo happy mine was supposed to be in 2020. I would have thought about going just to see people who would have went that live a bit further away but probably wouldn't have went.", "Except you didn't transform. You're still a child. Moving on = growing up, which you refuse to do.\n\nYou also refused to exercise any grace at all. Not to your bullies or even the strangers in this thread. Keep defending your terrible behavior if you must, but you'll continue to suffer, whether you realize it or not, until you admit you're wrong and change.", "You keep stating they know what they did and they knew they were AHs.... but how do you know? You haven't had a conversation with any of them? \nYou remember your horrible childhood due to them because it has mentally and emotionally scarred you, but they likely haven't given you or their behavior a second thought since school. And if they have it hopefully was \"I wasn't the best person growing up I'm going to do better\"\nChildren and teens are the worst, mostly due to undeveloped brains and hormones, but majority of people aren't who they were growing up, and you do what you need to survive when on the play ground. Seems you are the only person still being a child now", "You came to Reddit and posted on AITA for judgement but you’re doubling down on your behaviour. Why ask this question if you’re so confident in your actions?", "You are 23 years old you will have many many many more phases of your life although it seems like you're already behind a couple phases since you let some snot nosed pre pubescents live rent free in your mind for a decade. Grow up.", "I didn't drag anyone into anything, I just made an analogy that was easy to understand.", "Lil bro doesn't understand how an analogy works 🤣", "I agree, it IS tone deaf comparison. But honestly, if I didn't want to talk to 99% of the people there I wouldn't even go. It just sounds like a waste of MY precious time.", "No, only bullies say that revenge on people is a good idea.\n\nI'm an autistic nerd who was salutorian in my class dude, of course I got bullied. I've been pantsed, shoved down, had my gameboy and my ipod stolen, I literally took to carrying a heavy chain in my bag for self defense. So you can quit your BS about \"oNlY BuLlIeS sAy ThAt\". \n\nI say be the bigger person because I HATED being treated like that and thought the people doing it were scumbags, so why, in any timeline or any phase of existence, would I want to become like the people that treated me that way? \n\nIf that's what you do... well then, the bullies won. They broke you. And you'll live the rest of your life bitter and resentful while they live rent free in your head. You are actively allowing those same bullies to STILL have control over you by doing that.", "And yet this commenter is getting a bunch of upvotes. Let’s rephrase, “people who were traumatized and bullied as children, and then give attitude to their bullies later in life are similar to racist black people who think they are entitled to hate other minorities because their ancestors were once enslaved.”\n\nWhat fucking nonsense. Who are you people?", "I disagree. I was bullied growing up. As a grown ass adult you should be able to keep things civil. Decade old grudges handled in this way is bs. Especially for someone coming up and being nice to you.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "…or even bother showing up to begin with?", "I’m sure you will be missed. 😂", "People here are so biased sometimes. In every little argument they show divorce, you can't defend yourself against bullies etc.", "if they haven’t given it a second thought then they haven’t changed", "She wanted to go to show them how successful she is now. Fair enough. Many of us who were bullied in school probably have dreamed of doing the same.", "another salient point by the person not being stupid 😂", "If they hadn't changed they would have continued to bully you at the reunion rather than attempt to be pleasant", "they can’t bully me because they have nothing to bully me off on. They are sucking up to me because im now conventionally attractive and thin", "There is a million different ways to upset and personally attack someone.\nYou clearly have some serious emotional and mental issues that you need to address and deal with.\nYou may be attractive and thin in a generic typical way, but you aren't happy and clearly don't love yourself", "First of all, no one should bully you (or anyone else for that matter). That being said, just going from this thread there is plenty someone could use to bully you.\n\nJust a few stray observations: \n\nYou are socially inept to the point that your own friends would rather remove you (and themselves) from the situation than remain in the place you chose to embarass yourself at.\n\nYou might think yourself as conventionally attractive, but absolutely no one is perfect and someone could ruthlessly pick at your insecurities regarding your appearance. \n\nAlso, you are a fashion model, that is going away as soon as your youthful appearance goes away (which I'm guessing is not far away in the future) and I hope you are able to transition into something else you are just as succesful at. \n\nConsidering how highly you think of yourself because of you appearance your outlook appears to be that of a rather basic person. Because you are young I'm sure you feel you have an allure that goes beyond skin deep, an everlasting appeal, but you seem to be a shallow and vindictive person, nobody likes someone like this.\n\nYou have built your self-worth on how much weight you lost from middle school to now. The way you lash out at people in this thread makes it rather obvious that you are still the insecure person you were in middle school. You are not the victim anymore.\n\nNow, nothing of what I just said is meant to minimize the suffering you experienced when you were younger, people can be awful (and young people can be especially cruel) I'm sorry you had to go through that, but people change and get better, I hope the same for you and that you can find healing because it's obvious you are still hurting.", "Aside from the fact that this is clearly a made up story… let’s pretend.\n\nThey could bully you in so many ways. You think bullying only happens when there is ground for it? They can just make shit up. And they don’t even have to. They could say you had plastic surgery, or that clearly you didn’t earn your success but actually slept your way up ect ect ect", "Tbh you seem very unstable. I get it, they bullied you, it happens, you going to hold a grudge and be bitter your whole life? you grew up, they grew up too.\n\nYou seem to have an extremely massive ego for some reason, and you probably did come off as a spoiled brat thinking she’s the hottest girl in the world. \n\nI originally had more sympathy for you but after reading your comment replies here idk", "On a serious note. Get off social media and work on finding happiness with people who won’t hurt you. See a therapist first.", "Bullies will always find your weak point. Fine, so you are \"conventionally attractive\" now, but if they were still bullies, they could have laughed at you for how important they still are in your eyes. If you really wanted to punish them, you would have treated them as if they were forgettable. \n\nYou need to find another source of confidence, because if your self-worth relies on your appearance, you're in for some miserable times ahead.", "I really hope you are right about the fictitious nature of the post. If not there are major issues.\nI'm hoping that OP is a twelve year old and is projecting into a hypothetical future event.", "I had a prenatal womb reunion.  Kinda lonely, but I was the coolest one there.", "The whole town’s an AH for holding a middle school reunion 🙄", "NTA. You are right, people who were assholes to you are not in fact entitled to your attention or respect. Let’s be real, the bullies remember what they did perfectly well. If the first works out of their mouths is not an apology, it’s perfectly acceptable to keep your distance and shut them down if they persist in harassing you.", "I love that Reddit always blames you and calls you an AH just because, in a situation that makes you feel bad, you're not the bigger person and just let go.\n\nOP got the right to hold grudges, those people could come over to apologize instead of trying to make small talk like they were friends back then.", "YTA, why, then why would you go to a school reunion if you loathe this people? You could have just hanged with your friends somewhere else. You purposely went to this reunion to act superior and get “revenge” on those who didn’t meet your expectations of friendship in middle school.", "Your replies to the comments make it very clear this did not go at all like you're pretending it did. YTA, and an extremely juvenile at that. Grow up already", "Wtf is a middle school reunion and wtf would anyone attend?", "YTA\n\nCongrats, now you're the bully", "YTA for going to a middle school reunion…the fuck is the point of that?", "Grow up FFS", "I’d go back and show off if I am model too! 🤣", "NTA. \n\nNobody has the right to your time, your belongings nor body, nor objectification of any of these. The people at the reunion made no effort to apologize from what I can tell, so it’s for nobody but you to forgive them. \n\nPeople think time can just wipe away any misdeed, for things like bullying especially it can’t just be seen as something someone should just ‘get over’ because it happened ages ago. Otherwise abusive people who just avoid the topic have an easier time getting away with such an excuse.\n\nYou saying you are better than them is just a taste of their own medicine. You didn’t bully them or shove it in their face, they came up to you and antagonized you. You defended yourself against their own patronizing essentially.", "NTA .", "NTA.", "NTA fuck those people", "Middle school reunions are a new thing that should never have been created.  I mean, why? Old-fashioned tradition of high school and college reunions only should continue. The reasons why are obvious per your post.\n\nNo, you're NTA, because it was a middle school reunion when you were 23 years old.  You're not old enough to be able to let the past stay in the past. My advice is to skip any reunion but the high school and college, that way they take place far enough in the future that if you attend, you will be old enough and successful enough to feel confident when you go.", "NTA. Not sure why people are disregarding your trauma just because it happened in middle school. Trauma from childhood has a lasting impact. Your childhood bully confronted you so you told him the truth. That’s not bullying, that’s payback. I’m happy for you!", "NTA. The worst you can do to your haters is doing better than them. Revenge is a dish best served cold. \n\nThis happened to me. A senior in Uni would regularly bully me and say alienating stuff about me behind my back. Cut to a couple of years, he comes to my company for a job interview. I meet him there, act surprised, and take him on a tour of our swanky office (a prominent media company). \n\nAfter a bit he asks me, thinking he will get the position for sure, who will interview him, who is he going to report to. I told him his interview had already started and he'd report to me. Petty but sweet sweet revenge.", "I don’t care what everyone else says\n\nNTA this is queen shit. It’s not like you went out of your way to bully or harass your old classmates. All you did was ignore people who treated you badly (and stood up for yourself when that one guy went around talking shit about you) which is exactly what I would have done. They are perfectly free to go and talk to other people. If they’re upset at you ignoring them, it should be seen as a lesson in how to treat others. Fuck this entire thread for saying YTA.", "NTA. You just acted the way they acted back then. I don't see a problem.", "NTA. No one is entitled to your time, energy, or attention.", "This is like the episode of IASIP where they have a high school reunion except it's real.", "Why would you even go? This all sounds very lame. Grow up.\n\nIt would have been much better revenge if you acted like a happy, fulfilled and confident adult (instead of what you did, which will make everyone think the opposite)", "Hm, I understand where you were coming from with ignoring your former bullies; bullying can cut deep and for a long time, I'm really sorry you went through all that. But you didnt take into account that you were all kids back then, all of you have changed, not just you, you see them as they were as kids, not adults who have had time to reflect on their behavior. Lots of kids are shitty, I was bullied at school and still was shitty myself in some ways. Some of them maybe wanted to talk to you to apologise but you didnt even give them the chance. One of my former (and worst) bullies sincerely apologised to me and it was one of the nicest moments of my life and gave me some closure.\n\nI understand getting over bullying takes a long time, it took me well into my 20s to do so. I'm a late realised neurodivergent and it hurt to realise that a lot of my bullying happened bc of that, but I understand now that they didnt know any better, I was different and they hadnt been taught about that kind of tolerance, mostly they were struggling with things themselves. The guy who apologised turned out to be gay later on.", "ESH solely for attending an event as pathetic as a MIDDLE school reunion.", "You may be thinner and more successful, but you have not grown up.\n\nYTA", "They were TA you are now TA. At least they were kids so it's excusable. \n\nYTA", "NTA. F word the bullies. If they expect you to just forget and forgive possible traumas. Just f them and their lives. If they can't just take a hint and not speak to you, f em some more.\n\nI was bullied through all school life and if one if them came to me for help .That I was their last hope. F that and close door on face. \n\nJust F bullies. F their lives. F their everything.", "Going to a reunion to flex on people who were mean 12 year-olds isn't assholish, it's just pathetic. You're not better than them, not by a long shot.", "This is so made up omfg", "Getting secondhand embarrassment just from reading this… YTA", "YTA for trying to act cool at a middle school reunion 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂", "YTA - You already know it, you were deliberately acting assholish just to try to get some petty revenge. Why do you even have to ask?", "(*Middle School reunion* aside) First and foremost congrats on your endeavors since you were 12… I mean that sincerely if this is real, but wow I hope it isn’t. I’m a big fan of a glow up… but the way this is written? I hope this isn’t real. If something some stupid kids said 10 years ago still meant that much when you’re successful, and they’re obviously jealous? Then girl get yourself a therapist, that would be a lot healthier than posting on Reddit. No hate If real, just genuinely confused.", "Oh, it’s another “aita for this?” “Yes you are.” “Nuh uh!” post. Fun.\n\nOf *course* there was a “homely to model” glow up. Give yourself contacts and highlights and you’re basically every early 2000s teen movie.\n\nBut let’s pretend this is real. You’re still desperate for the validation of teenagers that none of you are (allegedly). You intentionally gave up more of your time to be around people you hate so that you could ignore them NOW in a way you couldn’t when you were younger. What did you gain from this? Certainly not closure.\n\nIf you want to fool yourself into thinking you’ve now got the upper hand on people who most likely still give zero fucks about you, go ahead. But I really hope you’re preparing for the next reunion. By your own admission, you’re no Naomi Campbell, so you likely don’t have many years left with this current career. You need to start focusing a bit more on developing mentally and emotionally because you are woefully behind the curve.\n\nNot expecting you to listen, but YTA", "They were children at the time. Relax. Middle school is a weird time in life.", "It’s obvious you are dealing with anger issues and can’t let go. All junior highers are assholes. It has nothing to do with who they turned out to be. Give ‘em a chance. Or at least release that anger", "Middle school reunion sounds like an actual nightmare. Why would people even subject themselves to that form of torture.", "You’re being mad at people for things they did as children 10+ years ago? Oh wow. Kids often aren’t nice but they grow up and mostly become decent people. I had a classmate in middle school who was really mean and didn’t like me. We grew up and met her again many years after school. She’s the nicest person I’ve met so far and we became friends. Just let go, especially if they treat you nicely and want to have a conversation with you. Yta", "Everyone on the f-ing planet is neurodivergent or has OCD or some other psychological disorder…according to themselves. Unless you were actually clinically diagnosed by a doctor please stop telling people you are „neurodivergent“. It’s incredibly disrespectful to people who actually have a condition.", "If you seemingly despised everyone so much in middle school, why did you go to the reunion in the first place?  \n\nIt seems like you went with the intention of not talking to anyone except the people you’re still close to…when you could have just made plans another time and place with just them? \n\nI don’t know if I would call you an AH for ignoring people you dislike, but I don’t get why you’d go and then not talk to anyone.", "YTA you're an adult, grow the fuck up. Also, being pretty and doing a bit of modelling doesn't mean you are more successful than others.", "I feel like you’re as much of an asshole, as they were in middle school. The difference is, they were middle school aged…….\n\nSometimes you just need to let the past go and give people the benefit of the doubt that they’ve changed in 10 years.  It sounds like you’ve turned into, or are well on your way, to becoming the type of person that you hated in middle school.", "YTA. You've changed as a person since middle school. They have as well. As an adult, you should behave as one. Acting snooty and superior is juvenile, high school behaviour. Congrats on your career, but it doesn't make you better than them", "ESH. When called out you should have just told him about the bullying which is why you are ignoring him and left it at that.\n\nInstead you become the arsehole when you said you thought you were better than anyone else. Also what is with escalating situations that don't need to be escalated  from 0-100 on reddit. You're not the first poster to do this.", "Can't believe I'm seeing so many E S H, and I'm personally gonna go with NTA. I mean, it's a bit silly to hold a grudge for so long imo and I think it shows more how much this (still) matters to you rather than the point you were trying to make. HOWEVER, you did not have to be nice to people who treated you poorly and being silly and having an ego moment are not crimes. You tried to be nice to them before and it didn't work, did it?\n\nAs long as you don't really see yourself as superior to other people and don't treat everyone like this in life, I think you're good to go and hopefully finally ready to move past this.", "My dude. The whole point of a reunion is to reconnect with old classmates and friends that you haven’t seen in years. If you go into it with the expectation that you’re going to hold a grudge against literally everyone there, why the hell would you even go in the first place? You just ruin the entire vibe of the reunion. And then to hold a grudge against everyone when they were 13 years old? That’s pathetic. \n\nI had my 10 year reunion in 2019. I connected with my high school bully who made my life hell. He’s a great guy now and now we are friends. I had an open mind going into it and I had a great time. The fact that you think you’re better than everyone else because you’re a model is stupid and shallow.", "This is so not a thing and you’re making this shit up. Middle school reunion is bullshit", "Middle schoolers treated you badly, so you’re reaction as an adult is to act like a middle schooler? \n\nGrow up. And who does middle school reunions? Lame. \n\nYTA.", "“Middle School” reunion? 💀", "\nMiddle school reunion lol", "YTA for being 23 and still obsessing about middle-school snubs and acting like some kind of b-movie mean girl. Good grief, move on, and don't go to any more reunions. You're supposed to be an adult.", "Your comments don’t make you look any better. ESH, middle school sucks but you’re much older now, enjoy your life, don’t be vindictive", "I’m sorry for your troubled past but it sounds like you have grown into being an asshole yourself. YTA", "This is definitely very middle-school of you.\n\nI get it. I was a smart kid, but I was poor, and people mocked me for not having good clothes and just being *different.* I would honestly never go to a middle school reunion--those were some of the worst years of my (and, honestly, a lot of people's) life.\n\nBut I've had a chance to go to high school reunions since then, and I didn't go. The people from that era who I still communicate with are the only people I'm *interested* in communicating with. The rest of my graduating class? I literally do not care what they've done with their lives, and I have no interest in recounting the events of my own to them. I'm still weird. I'm still a nerd. I still don't gaf about them, just as I wrote them off when we were classmates.\n\nYTA, but it's not a big deal. You got to flex on some of them, and I hope it helped you have some closure about how they treated you. Now go on with your \"best revenge\": Live a great life and never look back.", "Have you tried growing up?", "ESH. OP you need therapy if you are still holding onto grudge and pettiness. You need serious healing and I wish you find the serenity to accept that you can’t change the past but YOU CAN be grow as a person. If you really want to be better than them, then be the better person and spread kindness like confetti.", "YTA, you shouldn't have gone if you weren't able to be civil. You embarrassed yourself, many of those people probably do not realize how much they hurt you.\n\n>whenever one of the people who used to act shitty towards me tried to speak to me i just ignored them, continuing to talk and not looking at them at all.\n\nTotally weird, you could have just been curt or you should have addressed the issue. Or you could have acted normal.", "I know that someone else mentioned it, but when did Middle School Reunions become a thing? Who does that? \n\nBut, to your question; YTA, kids are A sometimes but growing and maturing should mean less of that. Just because someone was an A to you in the past doesn't mean you need to be one back to them years later. It shows a lack of maturity on your part.", "YTA. You are an adult taking things out on people because of the actions of middle schoolers. Granted they were the middle schoolers but just think how much maturing you and your friends have done since then. I’m not saying make these ppl your besties but at least be civil. YTA because you are vengeful.", "YTA\n\nWhat was the point of you going if you’re going to act like this? If you’re not going to talk to anyone but the group you came with then you should have just went somewhere else. Also job shaming too? Who cares about money, you were not the bigger person here in the slightest.", "I have never in my life heard of a middle school reunion. Is this a troll? I truly don’t think that’s a thing to exist.\n\nESH. They suck for being mean to you in MIDDLE SCHOOL. But everyone is shitty in middle school so get over it? You suck because you think you’re better than everyone. Guess what? You’re not, you may be a “high fashion model” so congrats, you’re objectively attractive. But that doesn’t mean you’re better than anyone. You’re bitter and need to let go.", "YTA. It seems you went to a place full of people you didn’t like just to show off and treat them the way the way they treated you over 10 years ago…\n\nIf you’re still hurt by people who aren’t even relevant in your life, that you don’t even see regularly that’s a burden you’re carrying for no reason. People change, kids can be absolute shit and grow into kind, compassionate, apologetic adults. They can also grow into bitter, rude, mean adults which is the path you’re choosing. The myth that models are better than everyone else just because they’re models can stay a myth. Just because you get paid to be pretty and that’s what success is to you doesn’t mean you’re better than anyone else which is how you were acting. Please go get some help so you can grow up and move on with your life. Sure everyone loves a pretty face but no one likes a poor attitude, one is much more valuable than another.", "YTA you’re now to bully learn how to grow it was middle school it seems like you’re still stuck in a middle school mindset", "Middle schoolers er kids. And some are assholes. Some grow up to be ok adults.\n\nI see no reason to come back at be the exact a-hole their were as kids.\n\nI actually would say that you are a bigger a-hole, because your are now a grown up.\n\nI went to my 10 year anniversary for my 9th grade class some years back. I also turned my life around a lot from being a bit of an overweight introverted kid to being in shape, a lot more extroverted and outward type. I was not bullied per se, but my class had some really nasty assholes. Some of them came to the reunion and had became chill dudes and they where allright. \n\nPeople grow up. Dont hold grudges from your childhood againts other children.", "Yta for going to a middle school reunion. Automatically.", "They suck for being bullies, but YTA. \n\nYou actually told a guy there that you're better than everyone else? Well if they're such losers why bother going? Why go if you hate most of the people there? You just went there to show off that you're a model and have an opportunity to one up them. You told them you're better than them, but the only person at the reunion who behaved like a loser was you. I can see why they bullied you tbh.", "YTA. If you were going to ignore everyone except your actual friends then why did you bother going??\n\nI’m hoping this is a middle schoolers fantasy and not a true story, because this is way too immature for an adult. Maybe you feel superior because you’re doing well now, but your clear bitterness toward these people who were mean to you over ten years ago and your childish strategy of ignoring them really isn’t a good look. Maybe one of them was going to apologize. You won’t know because you didn’t talk to them. \n\nI had a friend who was very cruel to me in high school. One of many crappy things she did was out me as gay to the whole fairly intolerant school. If I saw her now, I’d listen to her if she wanted to talk to me, then when she pauses, say “I wish you the best but I have nothing to say to you” and leave. That’s the mature way to handle people you don’t want to interact with", "YTA, but understandably so. You really aren’t better than everyone else, and you’ve now transformed into the bully. I really hope that’s not the image you want for yourself.", "I would put money on this being someone in middle school fantasising about getting back at everyone. Not knowing that by the time you are an adult middle school was a long time ago and completely irrelevant. If I am right, OP when you’re older you’ll just be glad you never have to be 13 again.", "I imagine it's written by someone who just finished middle school and is already fantasising about it xD this story is too formulaic for even Hollywood. More like Saturday morning cartoons.", "This whole thing sounds so made up lmao", "Because this story is fake", "“Hey everyone! Remember that time in our youth when we were at our *most awkward* and were dealing with bullies and such? Yeah, how about we relive that for an evening and see what that’s like? Should be an awful time.”", "because it sounded better for their made up fantasy story.", "Goes to show you the level of pettiness she will go to show all the people who mistreated OP in her earlier how “successful” she is now.  OP move on with your life and be happy.", "Exactly what is this shit about?", "It's not a thing.", "Because OP is in middle school now and is prophesying her glow up.", "My initial thought after reading the title.", "I have no interest in ever attending my reunions so I'm not advocating for them but....\n\nThere are lots of schools that are like preschool-8th grade and then you go do highschool somewhere else. So for those kids, \"middle school reunion\" is where you'd go see all the kids you grew up with. In those situations I could almost see those reunions being more important than the ones where you're seeing kids you only knew for 4 years", "Oof, I don't think I can handle mine, I might run into my ex. We got married during lunchtime one day, but the next day I divorced him because we were drawing fires, and he drew on mine because my flames weren't big enough for him.", "“Hello Hank, do you still like finger-painting?”", "Remember how you called me a booger, Helen? Do I have a surprise for you!", "Your comment has been removed because it does not address the OP in good faith.\r\n\r\nIf you suspect a post breaks one of our rules, please report it instead of commenting. **Do not feed trolls**\r\n\r\nContinuing to post comments like this will lead to a ban.\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Esh because the reason not to talk to the school bullies is because they treated you like crap and aren't interested in reviving relations, not because you think you are better than someone else now.\n\nI think", "This is the comment I was looking for", "So these are people who traumatised you for FREE during your most VULNERABLE TIME OF YOUR LIFE and the answer is grow up ? \nThis is why we are where we are, acusing victims for not shuting up and forgiving their abusers.", "Yeah this story read as very fake to me. I can understand having negative feelings towards school bullies. I will never forgive or want to be friends with my high school bullies. But I simply block and ignore.", "Years ago I had someone I went to school with message me on Facebook out of the blue and apologize for how they treated me in high school. They said that had no rights to lay hands on me. \n\nI told them they must have hit me pretty hard because I did not remember it at all.", "I doubt the post is real but I was severely bullied in middle school school and can tell you I remember A LOT of it word for word. I remember every bully’s full name and the things they said and did to me. When things are traumatic sometimes you stay clear on the details (unfortunately, I’d rather forget!).", "Just to add, to the OP: you don’t have to lose a ton of weight to be worth something. Being pretty and a model doesn’t make anyone better than anyone else. We’re all just people and we all have intrinsic worth. There are more ways to being happy than being pretty and thin.", "Depends on the type of school you went to. My dad went to a small catholic school were they even had a 5th grade reunion to attend.", "This is the comment I was waiting for.", ">I replied that i am better than everyone else and that’s why i have a more successful career.\n\nIf this story is even true, that's immature AF.", "THAT'S an understatement!", "I mean being g children is not an excuse to be a bully, if I ever saw my bully again I'd knock his fucking teeth out. She's not entitled to give them her time and attention", "Ignoring people is not bullying", "Upvoting this comment and downvoting the replies that are explaining that OP didn't bully anyone is EXACTLY why the AITA subreddit is full of people who just uses words as buzzwords or gotcha moment. What OP did could be considered shitty or rude (depending on your own opinions) but NOT bullying. As explained above, bullying is indeed a pattern, you don't become a bully because you've clapped back to someone. To add onto that bullying is an abusive pattern, being rude or thinking of themselves as higher than others one time isn't a pattern and even if they act that way all the time it still isn't an abusive pattern. People can be rude, annoying and that's ok you can just say that no need to use words bigger that actually means something. This might seem as a non issue but misusing these words actually have an impact on the way we perceive them and treat people who are abused/victims. The overusage of the word \"bully\" makes it so common that now we group people that are just bad with people that are abusive. \n\nAnd if we are talking about OP: yeah they were rude but that is nothing compared to what these people might have done to them and the consequences on their mental health. It could've been carthactic even. So NTA, for me. \n\n\\*sorry for bad english", "I agree with ESH but I wouldn’t call her a bully. It was an interaction between two adults that resent each other. Is it childish? Yes. Did she act like an asshole? Yes, but so did he and the others in the past.", "Do you know what bullying is?!", "You never were bullied yourself, right?", "Can people please expand their vocabulary? Snubbing or rebuffing someone is not bullying. Being discourteous or rude is not bullying.", "i agree, why even go LOL", "The people who bullied her were the ones who decided to approach and antagonize first instead of just accepting OP didn’t want to talk. \n\nThey were angered that they weren’t getting the attention they thought they deserved.", "She just went there to pick a fight", "Only those who have overcome the trauma should let it go. And it’s for nobody else to tell someone when they should forgive being bullied.", "I was outshined by my twin at mine, sadly 😞", "She went there, avoided people who came at her like flies, demanding her attention and then she’s the bad guy for standing up to people telling her to get over being bullied?", "Yep. Indifference—what she started with—is worse than hate. You simply don’t allow some people to take up space in your brain.", "Tell that to the people who didn’t apologize to her.", "Same except it was the 30th anniversary of my 4th bday. Or maybe it the 4th anniversary of my 30th bday. I can’t quite remember.", "I think it’s just weird cause why go to ur “middle school reunion” if you hate everyone there? Why go somewhere where u see people you’re litterally not even gonna look at. I mean at least say something to them, even if it’s an insult. \n\nIf this story is true, then I just don’t get; why go? Just to rub it in peoples faces you made you feel shitty in middle school? Have more respect for urself. I don’t think OP necessarily was the asshole but they don’t make a lot of sense to me, and I feel like if the bullies triggered them that much just don’t go. \n\nI actually have a high school reunion coming up that I will not be attending because I didn’t like a lot of the kids I went to hs with. And the kids I did like I can see on my own time. It would bring up a lot of issues if I went to this reunion and I would act like an asshole. Personally, just as someone who also didn’t have the best time in high school I just don’t understand why they even went. Also it is a bit of an asshole move to literally not even look at someone when they’re talking to you and I don’t think it’s the “dig” OP thinks it is, it’s just kinda odd\n\nEdit: also if you’re (the commenter) still in high school or freshly out of hs and that’s why you are saying this, I assure you the biggest thing you can do for yourself is to just let it go. Don’t go to high school reunions were you’re gonna see people you hated, don’t give them ur time or energy, and if you do ever run into old bullies and they try to talk to you, being civil is the best thing you can do for ur own mental health. Bullies suck and no one’s saying this guy wasn’t the asshole but if this person really is 23 and had a middle school reunion it just reads as odd that this person even went if they were just gonna ignore people", "Honestly though. These commenters must’ve been bullies themselves or still are. A victim is never obligated to forgive their abuser. (Yes, bullying is abuse.) And it doesn’t matter if the bullies had “bad home lives” either. Hurting an innocent person is hurting an innocent person. The only time it’s okay to be rude is when you’re fighting back, and that’s exactly what OP did.", "I agree but I think OP should have acted maturely because like you said it's rude to ignore people trying to talk to you. I am 23 and I act maturely whenever I encounter my high school bully, but if you have past trauma why would you go?! Just because your friends are going you should go too? That's ridiculous", "I think I’m one of the few for whom middle school was enjoyable (small school, no drama). High school?….meh, skipped that reunion.", "Yeah, this was 100% written by a child.", "Ah yeah, that makes way more sense.\n\nShit I can't even barely remember the names of the friends I had in middle school", "Wouldn't the Venn diagram of people you went to middle school with and the people you went to high school with be pretty close to a circle?  Do you have a middle school reunion because you just really can't wait until your high school reunion in another year or two?", "The only people I ever see that want to go to these, are people that peaked in middle school, people like OP that want to show off how well they did after being bullied, people that are genuinely friends with some people from high school and are using this as a way to hang out, or people that are too curious for their own good.", "I agree I'm usually quite gullible and while I acknowledge many of these are made up this one just comes across as quite fake, perhaps written by a middle schooler.", "Right like the fist supermodel a 23 year old would reference is Naomi Campbell. I'm 30 and barely know who she is", "It sounds about as appealing as sand in the eyes and hypodermic needle shoes.", "And be glad that you didn’t 😂 I’m slightly older than op, was also bullied in middle school and recently they decided to have one. I skipped that one, but it does happen sometimes", "I think it's very funny too, but I honestly think OP is in middle-school still. She just want to imagine a scenario where she's better than her current bullies.", "The problem is that everyone's experiences are different, even in the same classes and year groups. You might be fine because the things that happened then had little to no psychological consequence to you. Others have been shaped and even had their mindset on life \\*ruined\\* by their high school experiences. So don't go putting it down to grudges when it has the potential to be so much more.\n\nI went to one middle school (years 7 through 10) and it sucked a lot there, and then left to do year 11 & 12 in another high school/college closer to home. I wasn't a huge fan of either, but I did what I had to to get through. I left that college midway through the last year, once I had completed enough of the school program to get enough academic points to leave early and pursued a higher education. I told my parents not to go to the graduation ceremony and turned up by myself. I got my certificate and left immediately afterwards, not waiting until the end to catch up with anyone at all as there was no-one there I wished to talk to.\n\nI kept in contact with none of the people from high school just so I could distance myself from everything that went on and kept exactly one friend from the year above me  in college as he was an unwavering friend. A couple of years after I finished my higher education, I ended up moving 500 kilometers from there to the city I live in now.\n\nTwenty plus years later I have loosely reconnected with maybe five or six people from high school that treated me decently, but only via facebook. I am still in contact with that one other person from my college years.\n\nWould I go to a reunion for either? Not. A. Chance. I am already in contact with those I care enough for to be in any form of contact with.\n\nI asked my wife about her reunions and she has shown about as much enthusiasm for her high school and college ones as I have and the only friendships she maintains from that far back are those from her University years.\n\n&#x200B;\n\n\\[edit\\]\n\nSomeone reported me to the redditcares system? You've got to be kidding me.\n\nFor those concerned about the first part of my reply or were maybe thinking that they want to zing me by using that bot, [read this.](https://www.verywellfamily.com/bullying-impact-4157338) I was referring to studies that talk about things like this, many have been done on this subject. Just remember that everyone's childhood is their own. Even siblings can have vastly different experiences while living parallel lives, so you not experiencing something like someone else did doesn't invalidate their personal history.\n\nAs to me, I am fine, I didn't have it anywhere near as bad as others did and I removed myself from the situation and moved on with my life, grew up and harbour no resentment or hate. \n\n\\[/edit\\]", "Maybe if someone and a lot of their peer group never graduated high school? \n\nIdk I'm really stretching on this.", "Assuming for a moment that this is real and not a work of fiction. Some people brush \"school shit\" off and move on in their life. Some like myself just went through what we had to to get through the time at school and deliberately minimised interactions with others from school and either made external friendships, or were self reliant for other things. Others have absolute hell in school/high school. With bullying and other unrelenting behaviour relentlessly chasing after them and giving them little to no reprieve. Some have had psychological problems after and some have killed themselves because bullying and other experiences were so unplesant.\n\nOP should have not gone to it, and if her friends really wanted to go, gone without her. And if they started pushing for her to go, she should have just told them that if they wanted to be good friends to her, then they should drop the whole idea of her going.\n\nMe, myself, would I have gone? no way. I even moved 400+ Kilometers away for both employment opportunities and to get away from that part of my life and start anew.", "That. The other.", "But you still stick them up your nose, right? /s", "I now earn 3x more than you Helen? Who's the booger now.", "Who even goes to or has middle school reunions . I find that kind of weird tbh .", "The answer is grow up because they were in middle school and they’re whole ass adults now.  OP thinks they’re better than everyone because why?  You have a career?  Okay, welcome to like 80% of the population.\n\nThis whole post reads like OP is pathogically locked in 8th grade from the things they say to even writing this post to begin with.", "Move on there’s no point of being stuck on your middle school problems", "Were you the right person they were looking for? Or do you really not remember someone hitting you violently enough that they felt bad about it years later?", "Tbh when you’re into fashion you focus on the greats, I’m 25 and when you say super model my mind goes straight to Naomi, Kate, Heidi etc. & I studied fashion in college. \n\nI don’t think this silly story is 100% true but I also think it’s unfair to say a 23 yo wouldn’t wanna live up to the standard a model like Naomi Campbell set", "I seriously went \"who?\" ... 19yo here", "I didn’t downvote you, but those years you listed encompass way more than middle school. Sounds like you were with the same block of kids for 8 years, which makes a reunion a little more plausible. Most middle schools are only for 2-3 grades. Who tf would have a reunion for a short transition period?", "OP probably *is* a literal middle schooler. This entire thing sounds like it was written by a 13 year old describing a conflict between them and their little classmates.", "also most people are just  starting careers post college at 23 so of course everyone is gonna be at the bottom", "You'd go to jail for assault because somebody used to bully you? Please do not, lol.", "grow up", "“The would constantly be passive aggressive to me and act like I was a pest”\n\nThat’s not exactly bullying. It sucks but considering OP is behaving this way as an adult, and also is neurodivergent, it just sounds like the other kids didn’t like her and didn’t want to be around her rather than targeted harassment.", "Telling someone outright that you’re better than them because they were assholes at age 12, though?", "especially not when they bullied her. that's pretty much by the book the only real way you CAN deal with verbal bullies.", "Well, she wasn't *just* ignoring them, was she?", "Your comment confuses me. You say you’re upvoting the comment that says that OP is now the bully, but then you’re writing a whole paragraph to explain that OP isn’t the bully…🤔", "Last week there was a story where the OP was in the right until they ended the conversation with \"fuck off\". The top comment was NTA and explained that \"fuck off\" was \"literally\" the least offensive thing that could be said.  \n\nThis sub is a joke. There's no nuisance or scale. If OP was wronged first, this sub validates any and all retaliation.\n\nThe incident involved two parents picking their kid up at school. Ending a conversation with \"fuck off\" on school grounds where it's possible a principal might need to get involved is just stupid and inappropriate.\n\nWe deserve a better sub for these issues", "Nah man, OP is a bully of they think that treating others the way they were treated is a good way to respond to bullying. \n\nMost bullies are doing exactly that.  There's issues somewhere in their life, so they lash out in negative ways. \n\nIf OP had acted like the adult she's pretending to be, she would have at the very worst, rubbed her success in their face instead returning the bullying.", "you are not wrong but she's still TA", "Why are you getting downvoted you are right.\nThere was no power imbalance here therefore everything was fair.", "Was moodle school just a couch of years ago or something?", "Don’t listen to these oversensitive sugar cookies. You’re not a bully, fuck that guy specifically for humiliating you, you stood up for yourself and simply didn’t want to interact with a lower form of life such as him. \n\nIf this was a famous person doing this people would cheer (not Reddit babies of course) and say they put the bully down. \n\nAlso, they don’t understand the meaning of bully lol", "As a former bully, I've had this conversation with people who have been bullied. A bully will only remember like a 1/3rd of the shit they've done and basically only their most fucked up moments. Everything else falls through the cracks when you are being a piece of shit to almost everyone around you. So you end up saying and doing heinous shit to people that will stick with them for years, but the bully is unlikely to remember. For the bullied, it was one of the worst days of their young life, but for the bully it was just Tuesday.\n\n\nAnd some advice for people who have been bullied. The best way to get revenge against bullies is to have grace. If you act like op, all you are doing is giving the bully more power over your life, not less.", "The way someone acted when they were 11 now forever defines their value as a person no matter what?? \n\nEveryone did shitty things as kids. Some more than others but no one was a complete angel. It doesn’t make them forever unworthy of respect or decency", "Not true at all.\n\nThey do change and if they ask for forgiveness out of sincerity it should be considered (not a given but considered).\n\nThey were kids. There’s a lot of reasons why a kid would act like that, first being they’re stupid kids.\nAs they grow and mature they do realize they were wrong, they do identify life factors that made them act that way. They do grow past it and many do ask for forgiveness. \n\nI feel sorry if you are that bitter that you can’t see that.\nNot many people are the same as they were in Middle School.", "You don’t have to be friendly but you’re an asshole if you think you’re better than everyone because you lost weight and got some D list modelling jobs.", "Ofc not and I’m not saying OP is TA but I’m just confused as to why they would even go if this story is true. As someone who was also bullied in middle school and high school I wouldn’t be caught dead at my hs reunion. More than happy to never see a lot of those kids again. I just don’t understand why OP would wanna go just to get triggered by people who use to bully them", "Exactly! If I ever encounter someone from my hs who I didn’t get a long with (which happens cause I’m only 24 so a lot of us still live in the area and we live near a major city so a lot of people didn’t move far from the area) I just act as civil as I can and *that’s the biggest clap back* !!  Don’t even act like they bothered you at all. And it’s rlly not even a clap back. I learned that giving people my energy who I don’t like only fucks with me not them. Let bygones be bygones it’ll be better for ur own mental health", "Holy shit. Get over it and move on. You’re gonna be 66 years old and still hold this stupid grudge from middle school. If you can’t move past this, you have no business going to a school reunion ever again", "Massive iamthemaincharacter energy", "My friend, who I've known since first grade, and I were both in town for our high school reunion and neither of us went.  In fact the day I got the FB invite for it I texted her about it and she noped out of the reunion as fast as I did. I saw it and  declined before even looking at the date. Part of me is thinking OP is trolling bc who has middle school reunions.", "Went to my 20 year high school reunion a few years back and it was pretty cool actually. Maybe it's because I hadn't seen most of those people in that time, and you know, we're all well into adulthood at this point but it was very chill. Had a great time with people I despised and who probably felt the same about me in high school.", "I don't even know how or when I would ever attend a highschool reunion.\n\n&#x200B;\n\nI have never heard of one for my class year.", "Right? I don't think anyone was happy with who they were in seventh grade. \n\nLike imagine someone who peaked in middle school.", "Honestly I’m more confused by the excellent memory everyone seems to have. You ask me to recall the joys of middle school and I barely remember a damn thing", "It was the, \"I'm a high-fashion editorial model now\" that made it jump the shark for me.", "The town I grew up in had 8 different middle schools, 2 different high schools (public and a tech school), and then private high schools in surrounding towns. Not everyone I went to high school with was in my middle school and not everyone I went to middle school with went to my high school. Maybe OP’s situation is similar to mine. Either way, I wouldn’t go to no middle school reunion lol", "Not always, some of us went to private middle and high schools. Still wouldn't go to a middle school reunion if you offered me a thousand bucks", "\"I got a gold medal in dizzyball at field goal, a pizza coupon for attendance, and played kenickie in the middle school edit of grease\"", "I'm imagining a 250 lb man who still wears the shirt from his middle school gym uniform with pride. Sized as a youth large, his stomach could not be contained within it. Like a can of biscuits that popped open on a sweltering summer day.", "I did..someone arranged it and we all hung out as 22/23 year olds. It was nice and not weird. I think people are imagining the school gym being used as a dance floor or something but it could just be a group of people in their early 20s hanging out", "I thought that was interesting too - of all the supermodels she could have picked to mention she chose the one notorious for being mean to people.", "Yes, it was mostly the same class all through. So yeah maybe that does make more sense!", "Oooh I think you're right. It's a middle schoolers fantasy 100%.", "Oh my god. Of *course*, middle school reunions aren't a thing.", "Okay but you’ve attempted to avoid them and ignore it all night, and now they’re standing in front of you asking why you think you’re better than everyone because you don’t want to give your energy to people that once bullied you. Clearly he’s still an asshole, or he would’ve taken the hint and left her alone. She tried to avoid any confrontation, but at the point where she was forced into it, I don’t blame her for being rude.", "Kind of. But why would you go to a reunion full of people who used to bully you just stay there and \"act superior?\" It feels like there may be a bit of imposter syndrome here because the OP needs to prove something to someone. So they might not be a bully, but the dynamic is really off-balance and unfortunate. \n\nAnother question I have would be: does this person think that they are better than everyone else at that reunion because they are now modeling? Are they better than the person who is working at a gas station? Are they better than a person who is a stay at home parent? Are they better than someone who got fat since middle school? Because the answer to those questions will determine what kind of person OP is. Not actively bullying someone but still feeling in your heart of hearts that you are superior to them is just not a recipe for a healthy internal life.", "They were children, she is an adult. If the \"bullies\" continued their behaviour into adulthood then that would be different. Not saying that she had to have anything to do them either but there's no need to be stuck up about it, if you go around telling people you are better than them (without even knowing what sort of lives they've built for themselves) then you are definitely TA. There was plenty of better ways to deal with this and if she is still that tore up about how other kids treat her when she was a kid then therapy is obviously needed to work through that.", "Two wrongs don't make a right.", "they're saying the people who upvote the og comment and downvote the replies are people following buzzwords, they're not upvoting the og themselves.", "Was that the one with the “stinky Asian food”?", "I agree, this is how more bullies are formed. An eye for an eye makes the whole world blind. \n\nI think OP could have simply said to these people that she had no interest in talking to them and ended any attempt at conversation politely that way. If OP thinks that what they did to her was bullying, then by doing it back to them, she was bullying them. It doesn't make it not bullying just because you're doing it back to the bullies (or to someone else in retaliation). \n\nBut if she didn't want to talk to any of them, why did she even bother going to the reunion. Doesn't seem like it was worth the opportunity to show off", "She didn’t say it once though. she justified it by describing her job as being somewhat high fashion and she genuinely believes that because she’s a D list model that makes her better than people. If she didn’t think it, she wouldn’t have set the scene.", "She didn't just say one rude thing to one guy though. Up until that point she had been ignoring any of the people that tried to talk to her, just totally blanking them is incredibly rude and I think it would be bullying. She was doing it to get back at them for doing it to her. Why is it classed as bullying if they do it to her, but not her to them. \n\nThe reasonable thing to do I think would have been to say that she had no interest in talking to them when they tried and politely shut down the conversations.", "Yes she is. She’s a grown adult, and if you are going to be upset at a majority of people you will be around then you probably shouldn’t have went at all. I couldn’t imagine being the ignorant little AH I was as a child, I look back on my actions all the time and wonder why I would make the mistakes I had but the point is that I have passed that because I’m a complete mature person now, like most people at a middle school reunion. If you look at every adult as who they were as a child then you are just trying not to like them. Even OP isn’t the same person as when they were a child, the only thing that carried over was resentment. She didn’t try, she didn’t want to, and honestly she doesn’t HAVE to… but she’s still an AH for treating adults like they were children from over a decade ago.", "THE DEFINITION OF BULLYING IS LITERALLY A PATTERN OF ABUSE. BEING AN ASSHOLE ONE TIME DOESN’T MAKE YOU A BULLY WHOLY SHIT.\n\nAnd the black people analogy makes no sense, the closer analogy would be “bullied people can’t be bullies” but once again, bullying is a pattern of behavior.", "Most of my bullies dropped out before I did (I also changed school for the Senior years) and funny enough I did run into a few of them later. One of them ended up my local butcher, and was like a totally different person. Obviously it doesn’t apply to everyone, but for most people there’s a *big* difference between 15->25. I’m certainly different.\n\nPlus, I’m now old enough to realise they were also going through their own shit. For eg. I remember how they had a school-wide ‘reputation’ ‘earned’ by hanging around with older boys (spread by said older boys). I’m 99.99% certain that I never personally spread any crap about them, but I have some pretty definite memories of nodding along as others were…less than feminist. Because I hated them. Which is vile on its own, and still gives me the stomach-ache of shame.", "Well I was bullied for being shy for years, and still up to this day I can’t talk to the person who bullied me. I can act indifferent around him but I will never forget all the damage he did to my selfesteem, all the nights I cried bc I thought all my friends were against me. If this person greets me I greet him with indifference, if he tries to talk about something I respond coldly and only if needed. I can’t bring myself to ignore all the damage he did specially when he has never apologized for it. This is the exact same thing this girl is doing and you all are invalidating her feelings, her pain through the years, how much that may have affected her personality.", "OP already mentioned it in her post. She went to meet up with her old friends. And she didn’t give people she didn’t like her energy, she ignored them because she didn’t want to engage with them. It’s her former bully who confronted her. Everyone is different and it’s very natural and healthy to wanna get even with your former bully.", "I slightly regret not going to my high school reunion, but that's only because of the chaos that happened. I have no idea what exactly happened, but I know the fallout:\n\n1. Three people were rushed to the hospital with alcohol poisoning.\n2. Four people were treated for stab wounds (but refused hospital transport; that poor triage nurse was beside herself after her shift when she told me)\n3. Seven people were arrested--including two of the people with stab wounds\n4. There were almost three thousand dollars worth of damage to the building\n5. A \"truly insane\" number of cars were vandalized (no idea on the actual number; I heard all of this third hand after everything was said and done, lol) \n6. The state's version of SWAT was called, and they came with lots of dogs (and several of the officers, who were shopping at the store I worked at, said that they hadn't had enough time to grab actual dog treats for the good boys).\n\nThere are less than two hundred people in my graduating class, and at least five (including me) didn't go. I both kind of wonder exactly what happened and am glad I wasn't there to be caught up in it.", "Closest I've come to attending a reunion was a wedding where a couple of the guests I happened to have known from high school. Zero interest otherwise, not least because I'm on the other side of the country.", "I probably won’t ever have a high school reunion, since like a third of my grad class is divorced from the other third.. things would be messy.", "I went to my 20 year reunion and actually really enjoyed it (I had skipped the prior reunions - only because the dates when they were held I had other commitments). \n\nIt was nice to see some old faces and catch up with some people I went to school with for many years (many of my HS classmates were also my K-8 classmates). But, it also made it clear I had already been making time for the classmates I cared about (I maintained friendships with three of my classmates, one of whom has since sadly passed away) and the rest were really no more than people I knew or acquaintances. Nice to see them and catch up on their lives, but I had no interest in maintaining any kind of relationship with them. \n\nI definitely didn't need to do another reunion - guess others felt the same as no one even bothered to organize a 25 or 30 year reunion. I think social media will pretty  much put an end to class reunions!", "I just went to my 20th high school reunion. Walked in like I owned the place and everyone was waiting for my presence, and waved with a “heeeeey”. Fun fact: a classmate owns the place. I didn’t care. I knew I wanted to walk in as myself today, not the me from 20 years ago - insecure, no self confidence, and no idea who I was. It was good time, genuinely.", "When my 10yr high school reunion was coming up, I started getting Facebook friend requests from some classmates. I promptly deleted my FB account and created another with an alias and no identifying info. No looking back.", "My 30th reunion would have been this year. I have no idea if it even happened and I've never been to any of them.\n\nThe only people who care about going to those things are people who can't wait to compare lives. Boring, sad, depressed people.", "I definitely say f you to law school reunions too. They treated me like shit when I was there, I don't have any intention of revisiting them.", "They have kindergarten graduations now, for Pete's sake. \n\nEverything must be noted and celebrated. Like it or not. I'm a not, and do not go to ANY reunions.", "I wonder if it was a private school which was just a middle school?", "Our 20 year reunion was canceled due to “lack of interest.” I graduated in 1991; Gen X is all about apathy. 😎", "Omg that’s so oddly specific and I can imagine it 🤣 over here, middle aged balding men be squeezing into their too tight school polo tees and reminiscing the ‘good old days’", "Good ol times!", "He is clearly still an entitled ah. If I ever bullied anyone (I didn't) as a child, if I saw them as an adult I'd either be too embarassed to talk to them or straight up apologise as soon as I saw them. I certainly would not be demanding their time and attention.", "Many people who were bullies continue to be bullies as adults. A few do have a come to Jesus moment, but most just get better at hiding their true selves.\n\nBut I'll say this - OP should not have gone. She knew her old bullies will be there. She knew she cannot act as if they were all chummy chums and they did not leave a major impact on her psyche.\n\nPrecisely the reason why I never plan on attending my primary school's class reunion. The very thought fills me with anxiety and fury at the same time.", "It's not being stuck up to not want anything to do with people who made your life hell, however many years ago. Why should she talk to them? What does she actually owe them? Nothing, not even a hello.", "Ah thanks!", "Again, the response you don’t make when you’re with people you actually like and people you don’t like is the affirmative “I AM better than the rest of you, because why? I said so. I don’t actually know any of your current situations but i feel as though I’m superior”. Thats TA. If OP ignores and then brushes, puts the topic on “you all treated me poorly when I knew you and I don’t want to talk to you now” not only is the message stronger it is also not validating the former bully.", "Nobody is invalidating OPs right to feel any way, they’re are saying the response was the wrong one. \n\nAs to your personal story, you’ll never get an apology if you can’t confront the person. The same way we often change between our school age years and adult ones, we can also simply disregard (unintentionally) the value of an apology for actions which seem so far behind where we are now.", "Yea my thing is just catch up with those other people at another place. Idk me personally I wouldn’t feel comfortable subjecting myself to old middle school bullies and I frankly don’t see the point. Again not saying Op was an asshole just doesn’t make much sense to me. But whatever it’s not that deep. \n\nEdit: Also OP didn’t say they went there to meet up old friends, they said they’re close to a group of old friends and went their *with* their friends. Implying that they already saw those friends still regularly, they also mentioned they were uncomfortable as soon as they got there. Again simply not sure why they went", "Now even I have FOMO for missing *your* high school reunion", "I have so many questions about what on earth happened at your high school reunion", "What sort of school did you go to? School for emotionally unstable hitmen and assassins?", "Christ. Where did you got to high school? Attica?", "That's quite the story. Did you ever learn who did what in these tales? Curious if it matched your prior impression of these individual school mates. That's insane!", "I’m sad I didn’t go to your high school reunion", "I hope it was all filmed. Where on earth did you go to school?? Was it like that then? Insanity", "This is like the plot of Grosse Point Blank 2, 😂", "Omg I wish I would have been there 🤣 (safely - at a distance of course lol)", "High school so 16 17 years old. What age were reunion age people. Sounds like a bunch of drunk kids", "I went to the 10 year reunion, it was the disaster I predicted. The 20 year was last weekend, didn't go to that one but my best friend did and says it was also the disaster I predicted lol. No regrets.", "Same. I only went because I thought I would regret not going when I'm older. Yeah, I'm good to NEVER go again lol", "My 30 year should have been in 2021. I was thrilled that it didn’t happen.\n\nThey did some sort of make up gathering last autumn. I skipped that, too. There is literally one person from school who I still have contact with. Absolutely no desire to see anyone else.", "> They have kindergarten graduations now, for Pete's sake. \n\nThey had kindergarten graduations when *I* was in kindergarten, back in 1988. This isn't some new trend.", "They had 30 somethingd year last year cause 30 years was during covid. Yeah, not sad I missed it. All I have in common with them is that we were once stuck together in the same buildings 30 years ago. Also matriculated 1991.", ">Many people who were bullies continue to be bullies as adults. A few do have a come to Jesus moment, but most just get better at hiding their true selves.\n\nCmon, that's just silly. Most kids are arseholes because empathy is learnt as you grow, the idea the majority stay that way unless they find Jesus is ridiculous. Plenty stay that way, sure, but most? Nah, most people grow and change and develope, some don't, they are just more noticeable.", "Let's be honest, she went there to show all the bullies that she changed, and she's successful. That's why she was ignoring them when they spoke directly to her, instead of just telling them something like \"Hi, sorry I don't have time for talking right now, I'm with my friend here.\" or even just \"I don't feel like talking to you unless you'd like to apologize for bullying me in the school\".", "Would you care to read the part where I said she didn't need to have anything to do with them, even a \"I have no interest in talking to you\" would have been fine. You don't get to go around acting like you are better than people you don't know though. Children get leeway, adults don't.", "1. The fact that he used black people randomly as an example is annoying considering the fact that we had nothing to do with this post. Why was that the first thing he jumped to?\n2. Racism isn't a good analogy for ignoring an old bully anyways \"lil bro\".", "She said she started feeling uncomfortable when she got there so I’m guessing that she didn’t expect the effect it would have on her. I mean, you can’t predict and avoid everything. Bullies are all around us. Running away when you’re being insulted by a bully (or former bully) can be a horrible feeling; like nobody wants to be controlled by shitty people. It makes sense to me why she put the guy in his place.", "Well even if we think that's fine what about the comment of I am better then everyone else this doesn't sound like an ah to you.\nI'm not saying she should just forgive she can choose what she wants but this comment is definitely an ah comment.", "Right? It must have been *epic*, but it's become one of those things \"we don't talk about what happened,\" lol.", "Me too, u/smallsaltybread. Me too.", "Lol, I wish. No, my high school was just normal rural, agricultural high school.", "Nah, just a farming community. I mean, when I was in school the biggest debate was over whether or not one farmer owed someone actual money in addition to a percentage of the crop hauled in (both farmers had equal claim to the land, but only one of them worked it).", "I never did. Shortly after the reunion happened the whole town pretty much adopted a \"we don't talk about it\" attitude towards what happened. I strongly suspect I'll never know what actually went down.", "Well, at least you weren't poisoned, stabbed, or arrested, lol.", "Disaster in what way? I’m genuinely curious. \n\nI graduated high school in 1979 so waaayyy before social media or the internet. If you didn’t have someone’s landline number then you fell out of touch. And good luck keeping in touch with people after high school or college graduation when people were moving around and changing landline phone numbers. \n\nBack then a lot of people (not all) looked forward to the 5, 10, 15 year etc reunions because you could actually catch up with people you lost touch with. I’m not kidding when I say sometimes we got in touch with our friends parents to get their most recent contact info. Again … landline phone numbers or addresses! It’s kinda hard to imagine at this point. And my kids think it sounds like the dark ages!\n\nI didn’t go to my most recent high school reunion in 2019 because of scheduling conflicts. I wish I had gone though especially with the Covid lockdowns happening in 2020. My class was generally pretty nice. Although there’s always one or two people that I’ll not go out of my way to talk to.", "It's ok, they'll get to analogies in high school.", ">The fact that he used black people randomly as an example is annoying considering the fact that we had nothing to do with this post.\n\nWow, it's almost as though an analogy is \"a comparison of two **otherwise unlike** things based on resemblance of a particular aspect\". Wouldn't be a good analogy if black people had something to do with this post.\n\n>Racism isn't a good analogy for ignoring an old bully anyways \"lil bro\".\n\nIt's a totally fine analogy actually, perfectly conveys that just because one is a victim of something (racism/bullying) does not mean that they can't also be a perpetrator of that thing. Where's the issue with this analogy?", "I used to dream about it quite often, maybe even as late as college. But I'm almost 30 now and realize it's just not worth my time. We were kids. I grew past it. I hope she's able to heal and do the same, because it doesn't sound as if she has and it's just not healthy.", "I will never not have more questions.", "Normal??", "Yea I think high school reunions were far more valuable before the internet. Now I’m 2023 they just kinda seem pointless because the people you want to keep up with, you probably have a way of reaching out to them online. Other than that seems useless", "I'm assuming they never got to reading comprehension in your high school huh?", "\"Wouldn't be a good analogy if black people had something to do with this post.\"\nAnd like I said, we get brought up all the time for no reason. It's *annoying*. Do you know the definition for that word?\n\nBut OP wasn't becoming a \"perpetrator\" of that thing. She simply didn't want to talk to them. So like I said not comparable.", "Well, my perception of \"normal\" may be a bit skewed. \"Quiet,\" anyway.", ">But OP wasn't becoming a \"perpetrator\" of that thing. She simply didn't want to talk to them. So like I said not comparable.\n\nThis is what I mean by you not understanding analogies. The analogy is not meant to make a point, the analogy is meant to illustrate that point, to help you understand what the point being made is. If you disagree with the point being made that's fine, but that does not reflect on how good the analogy is. He could be completely wrong and the analogy would still be a valid one.\n\n>It's annoying. Do you know the definition for that word?\n\nI do, and I can completely understand why it might be frustrating to someone who doesn't really grasp why it's being used as an example."]}