{"id": 27952, "submission_id": "16wcfyh", "title": "AITA for refusing to pay this fee for surrendering birds?", "selftext": "During a recent storm, some trees were knocked down, and while cleaning up the debris, I discovered a nest with four young european great tits (a native species on my area). Realizing they were too small to fend for themselves, I decided to take them to a nearby wildlife rescue center.\n\nUpon arrival, I explained the situation to the staff member, who confirmed the species and informed me of a 20 euro charge for surrendering the birds. I was taken aback by this fee, as I hadn't heard of such a practice before. I questioned it, mentioning that their online page didn't mention a surrender fee. I then asked if they received state funding or were a private organization. The staff member clarified that it wasn't a surrender fee but a donation to cover the birds' food and care, and while they did receive state funding, donations were crucial due to the high number of animals they care for. They said they will not take the birds without me paying the fee.\n\nI declined to pay and said that they should write about the fee on their web page. As I started to leave with the birds, the staff member got kind of defensive. She expressed the importance of financial support, and asked me what I was going to do with the birds (but in a very condescending tone). She suggested these birds were now my responsibility and warned me that since I touched them, I could potentially be liable for wildlife disturbance charges. That made me mad since I felt like I didn't deserve this after trying to do a good thing. I told her to mind her own damn business and that I will find some other home for these birds. She told me to not come back to this place since apparently me telling her that ment I had an attitude. I left, called around and eventually found a local pet store willing to take in the birds.\n\nI feel quite unsettled about the entire situation. I recognize that the people working there are likely volunteers and facing financial challenges. However, I believe that I shouldn't be unexpectedly burdened with hidden fees while simply trying to do a good deed. It also seemed like the staff member's response was overly harsh.", "created_utc": 1696094469, "permalink": "/r/AmItheAsshole/comments/16wcfyh/aita_for_refusing_to_pay_this_fee_for/", "score": 17, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. Not wanting to pay\n2. Because they are raising money for a good cause\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. You should contact someone higher up in the organization and ask for clarification. I'm wondering if the person you talked to was either confused or overly zealous. I can understand asking for a donation, but not refusing to take the birds without one", "I would have left the birds on the counter and walked out lol", "NTA.  \"We would greatly appreciate a donation to help us care for these birds, if you are able.\"  The volunteer needs an attitude adjustment.\n\nYou can catch more flies with honey than vinegar.", "NTA\n\nBadgering you and guilt-tripping you to make a donation is ridiculous. Yes, financial support to organizations like that is very important, but that's *not* how you get support.", "NTA, if it’s mandatory it’s not a donation, it’s a charge", "NTA. You tried to do a good deed and got attitude from the staff member. I would have no issue with reporting that volunteer to the organisation.  She was completely out of order", "NTA \n\nI’ve seen places in the US that have suggested donations, but not mandatory charges. Check r/wildliferehab and include your location for more suggestions.", "NTA.  I rescued three baby bunnies last summer and took them to a center that could care for them.  They took the bunnies, thanked me, and I left.  No mention of any sort of money.", "What is stopping you from leaving the birds and walking away?  \n\nPersonally, I always leave money when bringing in an animal to wildlife rescue.      \n\nJust because the worker was rude shouldn't make a difference in whether or not the birds get care.  \n\nESH", "You probably donated a nice meal to a snake.", "Nta. A donation would be you willingly give the funds. This is a straight up fee.", "You were putting in an effort to do the right thing.\n\nIf they are government funded, do they even have the right to turn animals in need away if the person bringing them in can't pay the \"surrender\" fee?\n\nThey weren't even yours!\n\nWho will bring in any animals if you need to pay a \"surrender\" fee?\n\nYou should leave a post about it on their website.\n\nNTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nDuring a recent storm, some trees were knocked down, and while cleaning up the debris, I discovered a nest with four young european great tits (a native species on my area). Realizing they were too small to fend for themselves, I decided to take them to a nearby wildlife rescue center.\n\nUpon arrival, I explained the situation to the staff member, who confirmed the species and informed me of a 20 euro charge for surrendering the birds. I was taken aback by this fee, as I hadn't heard of such a practice before. I questioned it, mentioning that their online page didn't mention a surrender fee. I then asked if they received state funding or were a private organization. The staff member clarified that it wasn't a surrender fee but a donation to cover the birds' food and care, and while they did receive state funding, donations were crucial due to the high number of animals they care for. They said they will not take the birds without me paying the fee.\n\nI declined to pay and said that they should write about the fee on their web page. As I started to leave with the birds, the staff member got kind of defensive. She expressed the importance of financial support, and asked me what I was going to do with the birds (but in a very condescending tone). She suggested these birds were now my responsibility and warned me that since I touched them, I could potentially be liable for wildlife disturbance charges. That made me mad since I felt like I didn't deserve this after trying to do a good thing. I told her to mind her own damn business and that I will find some other home for these birds. She told me to not come back to this place since apparently me telling her that ment I had an attitude. I left, called around and eventually found a local pet store willing to take in the birds.\n\nI feel quite unsettled about the entire situation. I recognize that the people working there are likely volunteers and facing financial challenges. However, I believe that I shouldn't be unexpectedly burdened with hidden fees while simply trying to do a good deed. It also seemed like the staff member's response was overly harsh.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I suspect the person is applying their policy for surrendering pets to injured wildlife, which shouldn't be the case.\n\nDefinitely NTA.", "I think this is the way to go. Thank you for the advice", "They have security cameras. I don't want to  potentialy risk being publicly shamed on their Facebook/web page. Plus I don't know what they will do if I don't pay.\n\nAlso, I clearly stated I found them a new home so I don't get your last part.", "Omg I didn't think of that, just wondered what a pet shop could do to help, since they close at night and fledgelings need regular feeding.", "They said it was a donation.   Donations are voluntary.    \n\nIt's a wildlife rescue - that's their job.  \n\nUnless there is a sign out front or on the counter that states there is a fee, they can't legally come after you. \n\nBut I am not a lawyer.    Local regulations apply   \n\n\n\nIf you feel shame, then you must have done something wrong.  If you feel justified in your behavior,  where's the shame?  \n\nFuck facebook.  \n\n\nThe last part  just means to try and not let someone else's bad day  ruin yours.    If they're rude to you it doesn't have to change your behavior.    \n\nYou an just say you don't have any money to spare and you're just trying to hip the birds - which in the end  you did.   \n\n\nIf they try to shame you you can shame them back.    It's not a good look to say they won't take animals in need if you don't cough up the cash.", "They also said they wouldn't take the birds if OP didn't pay the donation, so it wasn't voluntary."]}