{"id": 2797, "submission_id": "z054ny", "title": "AITA for yelling at my son for using my daughters makeup.", "selftext": "I (32m) have a daughter 14f. She loves beauty,makeup,clothes hair,nails. She’s your typical girly girl. My son 12m has been interested in makeup recently. He likes watching my daughter put makeup on and sometimes she would do his makeup with permission from her. Recently he has been using her makeup without asking which is getting annoying for her. My daughter buys her own makeup with the money from babysitting her niece also from a little side job at her aunt and uncles bakery. She told me and my wife that he’s been using her expensive makeup pallets and expensive Dior lip oils. \n\nThe other day I noticed him taking her makeup while she was out with friends. I yelled at him for stealing her stuff. He proceeded to guilt trip me by saying how I’m denying him from expressing himself. I don’t care him using makeup but he can’t take his sisters when she actually works for it. I grounded him for a week. My daughter asked for a lock for her room and I bought her one.\n\nApparently according to my Wife I was to harsh. So AITA?", "created_utc": 1668953599, "permalink": "/r/AmItheAsshole/comments/z054ny/aita_for_yelling_at_my_son_for_using_my_daughters/", "score": 582, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I probably was a bit too harsh on him as he just wants to use makeup but he has to pay for himself\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA.\n\nThis isn’t about a young boy using makeup. It’s about a young boy using his sister’s makeup without permission and being told not to use it. Yes, that is stealing.\n\nAnother thing to note is that sharing makeup is NOT a good idea. This is because of germs and/or facial conditions being spread out from person to person. It’s a hygiene issue! \n\nOP tell your son he can have his own makeup and he can buy it with his own money just like his sister.", "I think you may have been a bit harsh but I would still say NTA for a couple of reasons.  \n\nYour son is 12 which is old enough to know what stealing is, regardless of what something cost.  He stole, he got caught, he got punished - good life lesson.  \n\nAnd he tried to guilt trip you - you are not denying him anything except access to his sister's makeup which he shouldn't have without her consent.  His manipulation didn't work so maybe he will learn not to use it which could be another good life lesson.", "NTA. It's good to teach that taking from others is not appropriate behavior. Grounding him was a good choice. But I do think you should ask him if he would like some makeup himself after he is no longer grounded and maybe have him earn the money with chores or odd jobs around the house so he can earn his money and buy it. That way, he can see the value of buying his own things and no longer take his sister's stuff.", "NTA. Sharing makeup is unhygienic.  Buy him some drugstore stuff for the holidays.", "This is not where I thought this was going, but maybe offer him chores to earn his own money to buy it. I don’t think you’re an asshole for yelling at him for stealing. I think you’re awesome for allowing him to express himself", "NTA. I’m assuming this wasn’t the first time you, your daughter, or your wife have told him to leave her makeup alone. And I’m assuming that if there were behavioral conditions that has his mental age younger than 12, you would have stated that. 12 is definitely old enough to know that to mess with other people’s property without their permission. \nAfter his punishment is over, discuss with him steps y’all can take for him to get his own makeup. If you don’t buy it for your daughter, you shouldn’t buy it for him either.", "NTA. You stopped your son from stealing and shut down his manipulative defense. Sounds ok. Now, how will your son get his own makeup? Can you provide him with reasonably priced options?", "NTA, he’s 12, but playing that kind of card to get away with theft is low, and he needs to learn that its wrong to do that. If he wants to use makeup, he needs to ask or buy his own. Your daughter is right to be upset, it’s expensive and I can’t imagine she makes a ton of money at 14. I don’t think grounding and lock for sister is overkill, but to show you do support him, maybe some supplies of his own would be a nice Christmas gift.", "NTA. Your son is plenty old enough to know better, in fact, he *clearly*  understands that he needed to sneak around to access her makeup after she told him \"No.\"\n\nI'm sure you have plenty of chores needing to be done in your home that are age appropriate for him to do to earn an allowance from you in order to purchase his own makeup.\n\nPlus, the holidays are coming up, he should put some of the makeups he likes/wants on his gift list.", "honestly, NTA. but, as a compromise since all of you are open to him experimenting with makeup, i'd offer to buy him his own as a starting kit. Him trying to guilt trip you is wrong, but he's also only 12. I think both of you (you and wife) sitting down with him and explaining that you'll always support him BUT that 'borrowing' without consent is wrong , not a full 'you're grounded for a whole week'    \n\n\nI think this would be a good learning opportunity for son. Explain how money works, explain how sister is getting upset (not because he's using makeup, but because he's using HER hard earned makeup from working). Is an allowance an option for son if he does chores? that would be a great way to teach him monetary value & he'd be able to buy his own?", "NTA, but can you buy him some cheap pallets until he can buy his own? This is going to keep being a problem otherwise.", "NTA.  12 is old enough to know you don’t take other people’s stuff without asking them first. It doesn’t matter what it costs or even what it is. This stuff belongs to his sister, not him. He should apologize to her for taking her things. However, after the punishment, it’s time to solve the problem & help your son get make up of his own.", "NTA. At 12, if he had decided to \"borrow\" from a store, he'd end up dealing with law enforcement. He's not a toddler, he knows full well that what he was doing was stealing. Then, when caught red-handed, he doubled down and played the victim. \n\nIf mom wants makeup to be shared, she can share hers. \n\nOthers have commented that you are unfair, because he can't get a job to earn money to buy his own expensive stuff. I'm sure you can think of several extra chores he can do around the house, for neighbors, etc to earn some money. The 9-13 year old boys around my neighborhood do baking, leaf raking, pet sitting, car washing, etc.", "You're not asking him not to wear make up you're telling him not to steal his sister's make up without her permission.  One would make you the AH the other would not.  A 12 year old is old enough to see the difference.  I hope you made it clear he is free to earn his own money to buy his own make up.  \n\n&#x200B;\n\nNTA.", "NTA but maybe offer to get him his own, or give him the opportunity to earn money to buy his own. For everyone saying he's \"just a child\" and shouldn't be yelled at, get over yourself. A 12 year old knows what stealing is, he clearly waited until his sister wasn't home to take it. And then when confronted about it, tried to argue that he was being suppressed? That's manipulation, it sounds like he has never been anything but encouraged with his makeup curiosity. The older sister was kind enough to share her stuff, now she's expected to just hand it over whenever he wants? Either y'all don't have preteens or never had siblings.", "NTA\n\nYou and mom need to talk to him. Self expression happens on your own dime. All he's expressing is thievery.", "Buy them both some more make up, him so he has his own, her to help replace what he's taken and to treat them equally.", "Okay but why can’t I with my job at 25 still can’t think about buying dior lip oil and the 14 year old with her baby sitting money is buying it 😭", "NTA. \n\nLet him use your wife’s makeup then.", "INFO: have you bought him any of his own stuff?", "NTA. Your son is old enough to know that stealing is wrong and deserves to be grounded for it. At the same time, make sure he understands that the stealing is the issue and not the make up. With the holidays coming up, maybe this can be a present.", "NTA! I was worried by the title but you’re a good dad! He’s stealing his sister’s stuff, regardless of how expensive it was, and he’s old enough to know better. He can either ask his sister or mum or buy his own make-up in future!", "NTA. That makeup belongs to your daughter.", "NTA he's old enough to recognize you have a problem with people stealing, not boys in makeup. Does he have chores/allowance that he can buy his own things with?  You sound like a great dad", "NTA. It is time you take him to the store and start buying him make up. It is gross to share makeup even with siblings.", "NTA, at all!!!!!!! This is NOT about gender expression, it’s about respect for other people’s property. You win parenting. 🏅", "NTA. He's 12. He didn't ask his sister permission to use her makeup nor did he ask his parents to buy him a set. He took it without telling her. It's perfectly ok to punish him for that although grounding for a week might be harsh. Try to talk to him about why he was wrong and what he should have done. Then take him to a drugstore and buy him makeup.", "Why not buy your son some cheap makeup to play with instead of making this a bigger deal than it is.\n\nNo judgements here.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (32m) have a daughter 14f. She loves beauty,makeup,clothes hair,nails. She’s your typical girly girl. My son 12m has been interested in makeup recently. He likes watching my daughter put makeup on and sometimes she would do his makeup with permission from her. Recently he has been using her makeup without asking which is getting annoying for her. My daughter buys her own makeup with the money from babysitting her niece also from a little side job at her aunt and uncles bakery. She told me and my wife that he’s been using her expensive makeup pallets and expensive Dior lip oils. \n\nThe other day I noticed him taking her makeup while she was out with friends. I yelled at him for stealing her stuff. He proceeded to guilt trip me by saying how I’m denying him from expressing himself. I don’t care him using makeup but he can’t take his sisters when she actually works for it. I grounded him for a week. My daughter asked for a lock for her room and I bought her one.\n\nApparently according to my Wife I was to harsh. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.", "NTA. He is stealing her property that she paid for. If he wants to express himself, he can buy his own make up.", "NTA. He wants to act like you're a bigot? Tell him he's being a misogynist thinking he's entitled to her stuff, two can play at that game.", "NTA - two things can be true at the same time 1) You allow him to express himself and 2) you don’t allow him to steal. Good job on doing both!", "NTA.  Christmas is coming.  Throw some makeup samples in your son's stocking, after he's apologised to his sister for using hers without permission.", "NAH but i would get your son a little cheap makeup kit from your local drug store or something so he can play with it and express himself that way :) he’s a young boy so he’s bound to be curious. this way everyone stays happy ! good luck OP :)", "NTA - with a sprinkle of y t a for yelling. Yes he wants to express himself which is all well and good when he has permission, but he's now using expensive products without permission. Some consequences are appropriate and I think its awesome that you're helping enforce your daughters boundaries by getting her a lock. \n\nIt might be helpful to take him shopping for his own makeup so that he can a) learn how much some of these products cost and b) use it whenever he wants.", "NTA.  Respecting personal property is the issue.  Of course, get him his own make up would alright.", "NTA.  Your son is being rude and entitled and a little thief.  He needs to ask for or buy his own makeup if he wants to use it outside of the times he does with his sister.\n\nEdit: a word/tense", "NAH. He can't steal his sister's stuff. Either take him to pick some out, or get him and his sis together in a common room with her makeup and see what colors he likes and pick up some cheapos in those colors. Sis may even be able to help with this.", "So why dont you buy him his own pallette?\n\nWhy dont you get him to do some chores to earn some pocket money to choose his own?", "but why yelling, do people not understand you can scold without yelling. do people think its less effective or something?", "Buy him some! Problem solved. \n\nIt definitely is wrong for him to steal hers, but he might be too embarrassed to ask you for his own. If you get him some, it’ll show that you support his self-expression and just want him to leave his sister’s for her. \n\nFor now, tentative YTA because he seems to feel he has no other way to get any, which likely means you haven’t offered him some/told him he can have some when you can afford it.", "YTA for grounding and especially grounding for a week. What is this going to teach him - resentment, frustration and boredom. Likely to create more problems. Young people need to get out and mix with others. \n\nA more fitting response would be for him to do chores to earn money to pay for the make up.\n\nAre you sure you are not trying to punish him for wanting to wear make up?\n\nNTA for reprimanding him for taking/stealing his sister's make up.", "Slight YTA - I don’t see a reason for you to yell at him over this if you hadn’t spoken with him about it prior. Grounding him seems appropriate, especially considering the guilt tripping, but I don’t think yelling was.", "A week so too harsh. A consequence is fine but a week is over the top. He wasn't stealing just borrowing. Doesn't sound like he was taking it to hide it, but use it. A lock makes sense. And telling him he can't use his sister's stuff without permission..but 1 full week of being grounded for using someone else's stuff is excessive. Would he be grounded for 1 week for eating a few of someone's Oreos? Probably not. \n\n\nBut, you have a bigger problem. You son feels like he isn't being allowed to express himself. That could turn out badly. Ask him if he wants his own makeup for the holidays. This way you are communicating respect for his desires while also setting a boundary that he can't just take his sister's stuff.", "INFO. Was he warned not to take her stuff without permission?  Because if he wasn't, and you jumped straight to grounding, I can see why he's pissed.  They were already sharing the makeup since you say she would put it on him.  If he wasn't told it was hers alone and he couldn't use it without explicit permission, he probably didn't think it was a big deal for him to use the stuff (like using the same shampoo bottle, or hand soap) and it would seem like the problem was him putting it on, not taking it without permission.", "YTA for yelling (not that I'm not guilty of that myself!  We're all AHs sometimes...)\n\nI agree that he needs some kind of consequence for stealing, but it also sounds like the kid needs some makeup of his own.  Why don't you get him like a starter set or a gift card or something?  \n\nBefore anyone jumps on me, I'm not suggesting it as a reward for stealing.  That is a separate issue for which consequences are called for.", "I'm 50/50 on this one you being YTA. Yes, stealing is wrong and at 12 he knows it. But at that age when kids are trying to find out who they are lines get blurry in their eyes.  \nWhat you should have done after the first time is take your son make-up shopping.", "[deleted]", "YTA for yelling. He’s 12, he can’t get a job and earn his own income legally. He shouldn’t be stealing her stuff but take him to a dollar store and buy him some cheap make up. You could avoid this problem for under $50…", "Buy him his own.", "YTA you don’t have to scream at him, he is a kid. You could’ve told him without screaming. Is your daughter your favorite child? Why don’t you buy him some makeup?", "YTA if youndont want him using his sisters makeup facilitate him buying some for himself", "YTA. You could've handled this way better. You don't have to yell at your kids right away once they do something wrong. Especially when it's to this scale. Should he have done it? No, but you should've seen it coming as well considering he's expressed interest in it. Not to mention the fact that he's 12. He's still going to make mistakes. \n\n\nThe best course of action in my opinion would be to have asked your daughter to share one time to see if it's still interesting to him. Give them a chance to bond as brother and sister. Yes, makeup is very expensive, I'm fully aware, but, it would've been a better outcome than this, and with Christmas around the corner, you could've gotten some gift ideas for both of them.", "Info: I’ve bought my son his own palettes so he doesn’t mess with his sisters. Have you done anything to help him get his own makeup so he leaves hers alone? Or are you just punishing him for wanting to use makeup?", "A week is too harsh. I good talk about ways he can earn money to buy his own makeup is better. He for sure shouldn't use his sister's makeup without permission, but your punishment far outweighs the 'crime'.  A day or two would be sufficient. Also, figure out what he wants and maybe it can be a Christmas gift.", "NTA", "NTA, but work out a way for him to get some make up of his own. It’s not ok for him to steal other peoples stuff and there need to be consequences for that. However, it seems like this is an important issue for him. \n\nMaybe a set of chores to earn himself a basic makeup kit of his own, like lawn mowing/ car cleaning/ windows cleaning etc. Then keep the discussion open and let him explore. He may want to branch out into clothes etc, and his sister is completely reasonable in feeling annoyed when he takes her stuff. Best to head that off before it becomes an issue- give him ways to earn his own clothes and makeup.", "NTA.  Thank you for standing up for your daughter and reinforcing the fact that her brother can't just steal from her.  I get that he's 12 so he probably doesn't have money from a job like his sister, but does he get allowance money, and would you take him to the store so he could purchase the makeup he likes (or you pay for half or all of the makeup, etc., depending on the situation)?  From now on, consider getting him Ulta, Sephora or Target gift cards for part of his birthday or Christmas gifts.", "NTA. Talk to your son. Tell him he can spress himself with his own makeup, but he cannot stole another persons posesiones. Christmas its Soon, you can give a makeup.", "NTA- but given it’s something he really wants access to can you help him with a plan on how he can save and buy his own?", "NTA. It sounds like you were clear with him that this behavior of taking his sisters things or using them without her permission is wrong and he will be punished for it. So he did it and he was punished. Consequences are important.\n\nYou did the right thing by giving your daughter a lock so she can protect her stuff when she’s out of the house. That was great. \n\nIf he wants to express himself, he has every right to go to Sephora or order online and buy his own makeup,  just like his sister did.", "NTA, he's stealing. You'd be just as upset had it been expensive books he was damaging or roughly using a video game consol, ect. The manipulation needs to be shut down. If you're wife is ok with him using his sister's, then she can offer up her makeup. \n\nThere's also a level of sanitation that's being ignored. You shouldn't use other's used brushes/applicators and never things like mascara or lip applicators. Look up some articles about the dangers of it because at best they could share a cold or light infection at worse a staph infection or cold sores.", "Nta", "Fair enough, anyone touching my expensive makeup or skincare gets bitten.\n\nYou need to talk to your son about the stealing but also the ick factor of sharing germs and infection and stuff.\n\nMaybe you could give him extra chores to “earn” a basic palette?\n\nNTA (also bonus points for being so relaxed about your son’s love of makeup)", "NTA\n\nMakeup is very expensive, especially the brand products your daughter buys with her own money. This is not about your son not being allowed to express himself, but about your daughter having boundaries too \n\nMaybe he can buy himself a cheap make up set to experiment.", "NTA, it's not \"denying expression\" its preventing theft. Maybe he needs his own makeup now? He's 14, that's usually the age girls get their first sets of makeup, at least in my family, maybe he needs his own set.", "What option?", "Buy him his own damn makeup, or he can buy it himself.\n\nNTA", "Nta. His free to explore make up all he wants but asking to borrow, by buying his own or asking you to buy him some. \nHe shouldn’t be taking without permission.", "NTA - he shouldn’t be using someone else’s make up without permission.  Not only is it stealing but it’s also highly unsanitary.\n\nHe can express himself freely with his own make up. And if your wife doesn’t seem to take issue with him using someone’s make up, she should let him use hers.", "NTA does your son get an allowance? He can use his own money to buy cheap makeup like his sister uses her money to buy makeup.", "NTA.\n\nCould you gift him his own makeup perhaps?", "NTA. He deserves punishment for stealing from her. Maybe give him some options to do extra things around the house for some cash to buy his own?", "NTA- him trying to twist this into a discrimination is pretty messed up. He definitely needs to learn that he can’t just used ppls things/steal. Stay firm on the punishment and talk to him about his actions? Then later.. Maybe buy him a pallet for Christmas?", "NTA. Sister bought her makeup with her own money and told him he couldn’t take it. It’s also very unhygienic to share makeup. With Christmas coming up have him make a list of things he likes and gift some make up for his own.", "NTA \n\nBut it might be helpful to sit down with him and explain that it doesn't matter what the item is, it's that it's his sisters belongings and he can't take it without asking. This is a boundary and respect point for others, you're not entitled to someone else's belongings because you want them. You can use this as a great teachable moment. \n\nMaybe he can mow the lawn or shovel snow for a little pocket money, and you can take him to the store with his sister and she can make some recommendations for his own stuff? You have an opportunity here to help mend their fences which, as someone who had a younger sister who constantly took my things I paid for with my job as a teen who faced zero consequences, I can tell you it is really important to maintaining a healthy sibling relationship.", "NTA\n\nGender doesn't come into play here.\n\nOne child is taking your other child's things without permissions, and he knows he's being sneaky whi h is why he's doing it when she's out.\n\nTell him he's more than welcome to buy his own, or ask for it for a birthday/holiday present.", "NTA \nWhile I do agree that he should have a consequence I think bring grounded for a week is excessive. He should have to do something to benefit his sister like doing her chores for a few days.\nI also think you should provide him with some basic makeup (ulta often has great starter sets in Black Friday for super cheap). I usually provide my kids with a nice foundation because I think quality is important for that. Plus a few small cheap basics like from Elf. Anything nicer than that they have to buy themselves. They started to learn what was worth splurging for and when a budget item can do the trick . Maybe help him find an opportunity earn some money? He can decide if what he earns is worth spending on makeup or other items.", "if your wife thinks you're too harsh she can share with him her own expensive make up. If he wants to use it he can buy it himself. he is just spoiled and very disingenuous exploiting the real suffering of real victims of transphobia and other forms of hate to keep using his sister's stuff", "NTA He needs to buy his own makeup and leave hers alone. Makeup is expensive and she buys it herself. Your son is actually stealing and needs to learn to ask for permission. I doubt he is using the best hygiene practices either.", "Grounded for a week, for stealing?  That's... not harsh.  At all.  It's a pretty standard consequence, for inter-sibling bullshit.\n\nYour son needs to learn that, while he's allowed his interests (and it seems you're plenty supportive of that) that has no bearing on the fact that there are consequences for poor choices.  Like stealing and ruining his sister's belongings.\n\nThe only thing I'd suggest is taking some time, over this week, to talk to him.  Explain that, while you support his interests, what he did was unacceptable and *why*.  And come up with some suggestions, where he can *earn* the supplies he needs, himself.  Chores, small (age appropriate) jobs, etc. to earn the money.\n\nNTA.", "NTA\n\nHe knew by age two that if you want something of someone else's, you ask.\n\nMake clear the issue isn't that he wants to use makeup, it's that he feels entitled to someone else's stuff without their permission, and that doesn't fly no matter what the stuff is.\n\nBuy your daughter a makeup box with a lock.\n\nAnd offer to take your son shopping, to pick some stuff of his own, but h LP him plan his budget. (She's invested in some pricey makeup. There's a reason he wants hers. But she saved for it. If he wants similar, he has to put that effort in, or ask for it for gifts and hope folks get the right things.)", "NTA. Get her the lock and take both shopping for drug store make up together. It's not as expensive as luxury brands, they can explore a little more and maybe bond over a shared interest as siblings.", "NTA but buy him some makeup. He’s 12 he doesn’t have a money or a job", "NTA but totally get your son a giftcard to Target since Ulta makeup is now sold in store there! Then he can grab what he wants to experiment with and have fun. Definitely encourage this creativity!", "NTA.\n\n\nThis is a magical time time of year where all the drugstore chains sell giant makeup kits for around $20-$40. Get him one for Christmas.", "NTA. He can have his own makeup. It’s expensive and when my siblings got into mine, I had to just do without because I couldn’t afford to replace.", "NTA. \n\nYour daughter paid for decent makeup, so it's hers. Your son  should keep his hands off her stuff and get his own. \nMy brother used to steal my art supplies to experiment with. It made me crazy.", "Nope. And kudos to you for letting him express himself! However he doesn't get to express himself with other peoples makeup! Give him a gift cert for Sephora or Ulta for Christmas and let him pick out his own and get color matched at the store. Jeffrey Star and Teporchuchis have some great makeup tutorials.", "NTA for telling him off using his sister’s stuff. Maybe for Christmas he could get some of his own, it’s only a month away.", "NTA. \n\nHowever - please buy your son his own makeup. He’s only 12. If it’s about “working for it” give him some chores to earn some cash. He has no right to steal from his sister, and he needs to be taught how wrong that is (which you’re doing). But I’d suggest sitting down with him and talking out a way he can have his own makeup to express himself so he doesn’t feel the need to encroach so much on his sister.", "NTA remove the word make up and replace it with some other noun like cloths , toys, shoes , jewelry and so forth. You should be able to see where it is going. The lock was a great idea!", "NTS. It's not about him using makeup. It's about him stealing the makeup. \n\nHave you considered getting him cheaper palettes from a dollar store?", "NTA\n\nHe can ask for some of his own for Christmas, or pickup some little jobs to save money. Stealing is wrong.", "Nta. He's stealing, flat out. \n\nBuy him his own makeup or help him find ways of earning money to buy his own", "NTA - stealing is not self-expression.  He can buy his own.", "NTA. \n\nHe needs to ask permission to use things and be educated on how easily it is to spread bacteria and germs across make up if it’s shared. \n\nWhat can be working for one person and another person uses the item that person has it now becomes contaminated and should be thrown away. \n\nSharing make up is not healthy! If you want to help him express himself get him his own make up and maybe he and his sister can bond over it.  But make him replace the stuff he’s contaminated. Use his allowance or have him do chores to cover the cost cus it’s not cheap.", "NTA but take him to the drug store to get some simple stuff of his own.", "NTA. \n\nIt sounds like you are perfectly okay with him expressing himself and experimenting with makeup. It seems the issue is with him stealing his sister’s products.", "NTA, it doesn’t really matter if it’s make up, clothes, headphones, or anything else. If your daughter has told him she doesn’t want him to take it (especially w/out permission) then he should get a talking to.", "NTA\n\nYour son: you’re like keeping me from expressing myself. It’s not “stealing” if I’m LGBT+", "NTA - your daughter has a right to set the boundary with her makeup and have that boundary respected but I also like what other people are saying help find ways your son can start earning some money so he can get his own maybe once he has his own he and the sister can have a new activity together and bond over sharing tip on how to use or what products they each like and why it works for them maybe when your son has his own money she take him shopping and show him different things", "NTA. He was stealing. Whatever you provided for her when she started wearing makeup, provide one for him. Get a palette from target for him to experiment with.", "NTA\n\nIt's not preventing him from expressing himself, It's stopping him from stealing.\n\nHe should apologise and start saving up for his own at this point.", "NTA. If he wants make up, he can buy his own.", "NTA your son is a thief. \n\nTell him he can use his own money to buy his own makeup.\n\nPlus maybe tell both him and your daughter just how bad for your health the sharing of makeup can be. Yes you Can actually lose an eye or go blind.", "NTA.", "NTA. She is a young lady working to pay for very nice products. They are HERS. \n\nAnd he needs a clear understanding of health risks like pinkeye from sharing makeup. \n\nBoth these reasons apply to everyone, male or female. Don’t let him distract you from the two main points.", "NTA . He needs his own makeup and not use his self expression to manipulate you.", "You’d do the same if a younger sister had stolen the things, right? \n\nNTA", "NTA. Good for you, OP.", "Nta. But you should give him the opportunity to earn some money of his own. And take him to get some. I'm sure you don't mind him wearing makeup, it's that he's stealing from his own sister and that's just not cool. He'll understand more when he has to buy his own and sees how expensive it is", "NTA\n\n&#x200B;\n\nYou are protecting your daughter and keeping her stuff from being stolen.\n\n&#x200B;\n\nBut since he is 12, you should pay for his cosmetic needs as much as you paid for your daughter's at that age.", "NTA but buy him his own - there are inexpensive but nice palettes out there.", "NTA - you are objecting to your son being a thief and protecting your daughter's privacy. As an aside, sharing makeup is a health concern because of contamination. That said, perhaps you or your wife can take your son shopping for his own, cheap makeup that is his to play with.", "NTA.... the make up isnt the issue... its the entitlement to it. He can find a side job to buy his own makeup!", "NTA \n\nthe fact that’s he’s purposefully trying to get out of trouble by saying that you won’t let him express himself is actually really sad and honestly, it makes a mockery of other people who actually are in that position.", "NTA - Maybe just buy him his own. It doesn't have to be super expensive but then he doesn't have to use his sisters.", "NTA he’s old enough to know not to use other peoples things without permission and I see he’s learned how to gaslight too. You’re doing right by your daughter he can earn money to buy his own makeup instead of using up hers. Your wife sound like an enabler too", "YTA, my sister and I stole each other makeup and clothes all time . Part of growing up", "The 12 year old boy might be embarrassed to go buy his own makeup himself.", "NTA. your son is stealing and disciplining him for that makes sense. He may be feeling insecure about this even though he wants to explore wearing makeup. \n\nA conversation would likely help just laying out that you have an issue with the stealing, not him wearing makeup and maybe set up a system where he can earn his own makeup.", "YTA for yelling at a child.\n\nThis was a time to sit him down and explain why he can't take his sister's things.\n\nWhat's with all the YELLING on Reddit these days? Have we become a society of uncontrolled screamers?", "NTA but I would take painstaking efforts to make it perfectly clear that it’s not about him using makeup and only about taking things that do not belong to them.  Maybe offer to buy him makeup from the dollar or if he is dead set on using the expensive stuff, give him the option to earn money for it by doing chores around the house.", "NTA but I feel like a week grounding may be a little overboard if his behavior has been fine otherwise. He's young and at this stage of development has a hard time with empathy. Explain to him that what he is doing is stealing and that he needs to face consequences for that and he will be having X punishment. Then tell him if he wants to wear makeup he needs to have his own, especially for hygiene purposes. Since he's a bit young for work offer chores in exchange. \"I will get you x amount to start with and then you can earn more through chores and good grades.\" \n\nMake sure you tell him that you don't mind him wearing makeup but he can't and won't be allowed to steal. He's feeling judged but focusing on the perceived abnormality he has of a boy wearing makeup rather than the actual problematic behavior.", "NTA\n\nIf he wants this, he needs to get his own stuff. Maybe, to not give him the feeling of not supporting him, buy him some standard make up stuff. It doesnt has to be the expensive ones.\nI hope you can get what i'm trying to say xD", "Info: does he have an option to have his own make up? It's a twelve year old child. He can't really work. (in fact where I'm from your daughter wouldn't be able to work either) Does he get an allowance or money from family instead of gifts? Have you offered him to buy him make up? Because the main info is missing - he might steal, because there is no other way for him to try makeup.\n\nAlso teach your daughter meaning of money. Dior for a 14 year old? Come on.", "No you did fine.", "NTA. He’s stealing from his sister and being unhygienic. He can do chores and buy his own makeup.", "NAH I think you punishing your son for stealing from his sister was the right choice. I would suggest buying drug store makeup for him to express himself still when the punishment is up. When he has his own money one day he can buy more expensive makeup if he chooses, but I was able to express myself just fine with drugstore makeup until my 20s", "NTA, but I think you either A) need to take your son on a shopping trip with the money he has (assuming he has an allowance, if not maybe nows the time to start? Itll help him realise that people dont like when you use their stuff when he has his own stuff) OR B) buy him his own makeup maybe?", "NTA, OP!\n\nThis hasn't got one single thing to do with anyone's take on boys using makeup. It's about not stealing other people's property  and about not using their property without their permission! This is as true for makeup as it would be for a PS5, baseball bat, hockey goalie's mask, car, etc. *You do not use or take other people's property without their freely given permission!*\n\nOne more point about this specific case: It is NOT considered hygienic or safe to use other people's makeup - infections can be spread that way! You son can and should buy his own makeup, but he should not be using anyone else's.", "YTA. Let me be clear: I'd be fuming if people would be taking my stuff without my consent, sure. BUT! This is not how parenting is done. You should've talked to him and your wife. Xmas is coming, if this is real interest of him, why not having him pick some inexpensive things for himself as a gift? He sure doesn't need  Dior pallets to learn. Also tell him to start saving his pocket money (he's getting some, right?) to buy his own stuff, than go to the shop or online and buy it for him (he pays for it and give you cash). But yelling? YTA", "NTA - Buy your son some makeup. The lock is a good call.", "Nta, he needs to learn that just because he likes makeup and stuff doesn’t mean stealing from his sister is ok. I think you made a great decision", "Xmas is coming up. Get your boy some makeup. Ask what he likes. You're nta for protecting your daughters things by getting her a lock. And it's not right for your son to be taking things without permission.  I'm glad this was about stealing and not homophobia.", "NTA. Children need to learn the value of money. And if son can’t earn money, he shouldn’t be using anything belonging to someone else without asking or being given the item to use. He’s 12 - he can walk dogs, shovel snow, weed gardens, mow lawns, even babysit for cash to buy makeup if he really wants.", "NTA. Yelling wasn't best response. But telling him he's not allowed to use other people's belongings without permission is appropriate. Explain to him why we don't share makeup. Give him chores to earn money,  first to replace at least some of what he used then to buy his own.", "NAH. Your daughter has the right to decide whether he gets to use her makeup. OTOH, he's 12. Now that he's been punished, allow him the opportunity to earn his own makeup.\n\nedit: changed my mind lol", "NTA. your daughter earned money to pay for her own makeup. Her brother is stealing. It’s not about him wearing makeup. It’s about him taking what isn’t his.", "Did 14f write this?", "Nta\n\nYou need to sit down with your wife and explain that their have to be consequences for theft. He needs to work for his own make up and not steel. You wife can’t be enabling theft.", "NTA, you are saying you have no problem with you using makeup, the problem you have is that he is stealing from his sister, and he's being unsanitary. That's her makeup, her not knowing that he's contaminating it is a big deal.\n\nI'm glad you bought her a lock for your room, and it sounds like you should have a conversation with your wife about why she thinks this is harsh. Why does she think your son should be allowed to steal from your daughter? If he wants makeup he should start mowing lawns or something to get the money to do it. \n\nIt really sounds like the big thing you should do here is figure out what makeup he used, and then him have him buy replacements for his sister from whatever his own wallet is. He can keep the damaged ones that he contaminated, but brand new fresh ones need to be bought for her. Maybe that would better teach the price of theft", "NTA. Your daughter has the right to have her property not messed with by your son. He was told no and still did it. Maybe take him shopping and he can buy makeup with his allowance.", "NTA but please buy your son his own makeup", "NTA- you’d be upset with him for stealing and want to teach him that lesson is wrong regardless! You never yelled at him for self expression. Maybe give him the opportunity to earn some money to buy his own makeup or gift him some for the upcoming holidays if you celebrate.", "NTA - He’s old enough to understand stealing is wrong. Maybe have him do some extra chores around the house to pay for his sisters makeup he stole/used without permission. Once he is done with that, help your son get some of his own makeup and maybe gift him some for holidays/birthdays", "NTA", "NTA You aren't stopping him from using make up all together, just from stealing his sister's belongings.", "NTA but this can be easily fixed. Offer to buy him his own beginners makeup kit to experiment, or have him help out around the house for money so it's equal with your daughter who actually works for the money.", "YTA. You need to teach him first. “Hey buddy, this is your sisters, and you didn’t ask. If you want to use her stuff and she’s not here you can’t just take it. If you like make up you need to work like your sister did to buy your own.” Tell him nicely and constructively. Then help him do that, facilitate him making that money- or say he can ask for make up for his birthday. If he continues after that, then you can punish him and not be an asshole.", "nta, but maybe buy him some makeup so he wont have to steal.", "You should be very careful how you go about this. If your son enjoys make up, don’t push him away from that. But he absolutely shouldn’t be using ANYTHING that isn’t his if he doesn’t have permission from the owner. Ask him if he can work like your daughter so he can afford his own makeup.", "NTA, but I would ask him if he wants his own makeup set so he doesn't have to keep using his sister's", "Meh. You probably didn't need to yell, that rarely resolves anything, but I get the frustration. Just sit him down and explain that makeup and hygiene go hand in hand, and no one should be using anyone else's makeup without taking precautions like a make-up artist would (clean brushes for every client, never cross contaminating a palette, etc). NAH, let him pick himself out some things at the drugstore in exchange for doing some small chores, and tell him it's not ok to take his sister's things.", "Slight YTA, but only because this could have been fixed easily when he first started showing interest. You should have just gotten him a cheap makeup set (you can get stuff super cheap at Kruidvat) and sat him down to talk about how his sister pays for stuff herself and he shouldn't touch her things without permission.\n\nOn top of that, men who use makeup still receive so much backlash, as a parent it should have been obvious that grounding him here would come across as grounding him for self expression. I get that maybe you don't see it that way, but as a parent we should be aware that kids who do things considered outside of the norm still receive a lot of hatred. Because the nature of the topic your approach should have been much gentler. This isn't simply \"he took her things\" this is \"he felt this was the only way to practice makeup\" and instead of having a conversation you got angry and grounded him.", "Low key YTA for yelling but Ill give you a pass. \n\nAre you giving him an allowance. Tell him to buy his own makeup. \n\nYou're NTA for grounding him.", "YTA never yell to a child", "YTA what your boy did with stealing is wrong and should be punished for that but obs this is really important to him so why cant you give him some paid chores to do as hes to young to get a job and he can buy his own make up?", "Are you upset at the theft, or at him using makeup? If it’s about the theft, then he should have to work to pay his sister back. That’s fair. He can work, earn money, and 50% goes to pay back his sister, while the other 50% can go to buying his own makeup supplies. \n\nBut if you’re upset about him using makeup, then you’re being a jerk. There’s no way around it. AH all the way. \n\nSo, ask yourself this: does your son KNOW why he’s in trouble, or do you ASSUME he knows because it’s so clear to you it must therefore be clear to him.  If you haven’t taken the time to explain how taking her things is wrong, and then told him how he has to pay it back, BUT ALSO how he can have his own things, then you’re messing up big big.  \n\nProvisional NTA, because it does sound from your post like it’s probably about the theft, but there’s enough unanswered that it could be you being upset that he’s not being enough of a “boy” for you.", "He needs his own, really. Take him out after school, and let him choose some.", "Buy him some makeup", "NTA - But maybe circle back and ensure you son realizes it's not *what* he's doing (experimenting with makeup) but HOW he's doing it.  Explain the costs, how she buys her own stuff... Help him come up with ways to get his own supplies; save his allowance, ask for stuff for bday or xmas, find ways to earn some money like sis does.   Heck, sis might be willing to give him things she is 'done' with.  Or even say, a 'maybe I should have been more clear before grounding you, how about we head to the store and pick up a couple items for you to experiment with while you're grounded'.  At 12, I'd probably do the shopping at a dollar store or 5Below kind of place vs. Dior (even a 14 year old doesn't need to spend that kind of money!!", "NTA for teaching him not to steal, but it sounds like your kid might be going through something, maybe a little more sensitivity on your part wouldn’t go amiss. I am a gay woman, and when you are young and insecure it’s easy to take things like this in a way that you don’t necessarily mean it.", "NTA; you're teaching your son not to steal. If your wife has a problem with that it says more about her than it does you.", "NTA, your son is a thief.", "NTA assuming he knew you were comfortable with him using makeup on his own. I am giving him the benefit of the doubt for this. Did he take it because he was afraid to ask for his own? Regardless he was told before and a punishment is needed in some form and making sure he understands the punishment is for stealing not for wanting to wear makeup. I think he needs to do some of his sisters chores as a punishment as well. He can earn his own money for some makeup. I do want to applaud you for being open and supportive of his desire to wear makeup and express himself.", "NTA. Have you thought about paying him an allowance for house chores? I agree that he should earn money to buy his own makeup, but it might be hard to get a legit job at 12 vs getting one at 14.", "Nta, he needs to learn to ask permission and to not feel entitled to his sisters stuff just because. He’s also 12, so maybe the yelling and grounding for a week were a bit much. Maybe since he’s not old enough to work, you can think of ways he can earn extra money around the house so he can buy his own palettes. (Makeup revolution makes great products for pretty inexpensive)", "NTA\nYelling at someone is always going to have a negative reaction. whatever you said during that scolding probably came off a lot harsher than you intended. \n\nHe was definitely wrong for using her makeup but he's 12, he's going to be defensive. I think you should just apologize for your delivery but reiterate that he needs to get his own makeup, not sneak around using his sister's.", "Esh. He shouldnt take what doesn't belong to him, but you could buy him makeup to facilitate his self expression.", "honestly you should just buy him his own makeup, yes a lock is a good idea but getting him his own stuff could’ve easily prevented this when he first showed some interest", "You’re NTA for getting on to him but why haven’t you gotten him his own yet? He’s 12. Is he supposed to buy it himself? Take himself to the store to get it? Maybe yell less and get him his own set up", "NAH. \n\nSince your son does not seem to have directly requested otherwise, I will be using he/him pronouns. \n\nExisting in a gender/sexual minority can be a life of constant distress. If he is experiencing dysphoria or just attempting to find who he was born as, it is understandable, but not entirely excusable, that he would take makeup from his sister. Even a moment of gender euphoria can be enough to get insight into what feeling whole is. Imagine what it is like for your son to look in the mirror everyday and not see who he is. If makeup gives a reprieve of that burden, then taking it might have seemed like his only option.\n\nIt was wrong of him to steal, but the issues seem to come from a deeper place than that, especially if he didn’t know his family would be a safe space. \n\nHe needs to compensate his sister for the stolen makeup, whether monetarily, doing her chores, or another repayment decided as a family. If he doesn’t have a way to earn money outside of the house, find a way he can contribute more for an allowance. \n\nMakeup is expensive and both kids have been negatively impacted. Do this right and not only will you show your children unconditional love, but you could also help your son navigate adolescence, including how to manage his time and money.", "I agree, younger brother shouldn’t be taking what his sister bought and paid for herself. The holidays are coming, maybe the son can make a list of some makeup palette’s he’d like as gifts. And you’re absolutely correct about not sharing makeup items. I’ve seen pinkeye spread this way through shared mascara.", "What own money though? He’s 12.\n\nOP should buy the son some makeup.", "He’s 12. His dad can buy it for him I think…", "Although regardless of gender he is 12 so check his school rules as well. At 12 he may be in elementary school still and they ban make up. \n\nHe may be in middle school and then it's 50/50 if make up is allowed.\n\nIf the school doesn't allow it due to age then make a rule that he can wear make up just not to school.", "I agree, NTA, it would be no different if it was a 12 year old sister stealing her make up. Unfortunately there are some dad’s that still wouldn’t side with the older daughter in that case.\n\nMake up isn’t cheap, she’s probably had to work hours to afford that stuff so no doubt she looks after it carefully\n\nI agree with those who are saying that buying him some for Christmas would be good, or getting him some vouchers for Ulta or Sephora or wherever is local to you, it shows that you’re being supportive of his self expression because that’s important.", "This right here, like I feel like you should be harsh with him because he's trying to be so manipulative. Him trying to turn this around and frame you as a villain when he's stealing from his sister would be a terrible point to back down. Cuz it would tell him that that works", "Yes also teach him about how it’s very unhygienic. Like tell him what happen when people share makeup. Also maybe get your daughter some isopropyl alcohol spray to disinfect her makeup. \n\nNTA", "places like 5 Below and Dollar General have decent makeup pallets for little money, take him shopping for what he likes color wise", "I'm just thinking what if they had him buy unused versions of the makeup he stole for his sister, and then he can have the used ones. That way sure he's getting makeup, but she's getting fresh makeup that hasn't been touched by him and he paid the cost", "This is the one, I would punish him for being manipulative and stealing and tell him specifically why that is wrong. Work for what you have, liking make up or being different is not an excuse for shit behavior. Be yourself and be a good person.", "Agree with giving his son an opportunity to earn money that he can spend how he likes. OP makes it clear that he does not buy his daughter's makeup - she earns the money to buy it for herself so he shouldn't buy for his son to virtue signal acceptance. 14yo is roughly early high school, which is a reasonable age to allow children to explore/normalize makeup, but not sure 12 (6-7th grade) is - but maybe times have changed as I'm an old fashioned mom.", "What do you think is a fair punishment for stealing?", "No that wouldn't be fair because then he would get free makeup while she had to earn it", "maybe because you know better than to buy stuff just because it has a logo on it? Only thing I splurge on is my under eye cream. I'm 40 not 14 tho.", "Yep, when mom realizes that her makeup and beauty products are being depleted or stolen, she’ll change her mind very quickly (if she also chooses to use them). As a former pro-MUA and now just a fellow makeup enthusiast, that stuff is expensive even with the pro-discounts I still receive. Not to mention there is an ethical issue with your son stealing and using his expression as an excuse to justify his stealing to avoid accountability.\n\nHolidays are around the corner and if you celebrate with gift giving, maybe buy some inexpensive items for him so he has his own? Or even a gift card so he can choose his own. That way you can still support his expression, but he’s not likely to steal from others. NTA", "It is very unhygienic to share makeup.  Acne, cold sores, and staph infections can all be spread through makeup.  Also it was definitely stealing, makeup is a consumable product, other people using it consumes it faster so you don’t get the full use of it.  With a single stick of lipstick from Dior costing ~$38 to a lip kit ranging up to ~$250 I’d be livid if someone “borrowed” it without permission.  Makeup is an expensive hobby.  Plus, she paid for her own so it feels unfair for him to just get some for free after stealing from her unless its a Christmas gift or something.", "Why should he get some bought by OP when the sister had to pay for her own?", "if i take something from a store without paying, i am not stealing, just borrowing…", "The proper response is that he can use his allowance to buy his own make up, not OP buying it for him. Can you imagine if you saved up and bought some thing you really wanted and then your parent just bought it for your other sibling without them even having to try to save up?", "So the daughter has to buy hers but the son gets taken out and have it bought for him? That doesn’t seem fair.", "What if her younger sister was stealing it? It's the same as that.", "While he is a kid, why is it okay for the daughter to buy her own makeup from the money she earns babysitting, but not him? The dad isn't trying to suppress his son. 12 is plenty old enough to know better than to steal. Do you think this kid would just got up a store and expect no consequences? I'd wage not. \n\nThere are plenty of age appropriate chores he could do to earn the money to purchase his own makeup.\n\nAnother solution (at least to start) would be to ask for various types of makeups for the holidays as gifts. You can get some really nice stuff out of family during the holidays.", "He's more than old enough to understand not take someone else's things and to accept the consequences of his actions.", "He’s 12 he understands when things aren’t his and he definitely understands when he’s been told not to use someone else’s products. He’s not a baby", "> then dont give him an option to do that on his own which resulted in stealing. \n\nYou think theft is justified? So if he really wants a car, grand theft auto is OK?\n\nWhat other crime are you OK with? Rape? Murder? \n\nIf he wants makeup - or anything else - 12 is more than old enough to use his words and ask for chores or an allowance or makeup of his own. \n\nTheft is not OK.", "He’s 12 not 2", "He's 12, old enough to know what he did was wrong, but he chose to do it anyway. I have taught toddlers to not touch my makeup without my permission and even they could understand that.", "He’s got his own money", "The daughter saved money and bought her own. What might be more fair is helping him find ways to make money and buy his own? Like extra chores for money", "He’s twelve. Twelve year olds know what’s right and what’s wrong", "I'm sorry, but no? I agree, they should encourage him to earn some money, but he can't just take from his sister because he doesn't have any, and should face consequences when he proceeds to steal from her.", "Yeah. You're missing the entire point of this post.  Kid is taking stuff that doesn't belong to him.  Doesn't sound like parents have denied access either.  They just want him to respect other property", "op doesn’t buy daughter make up, she buys with money from her work, son tries to steal and, as consequences, gets new make up?\nyes, fair fair", "Read the whole post.", "If you read the post, OP says that his daughter has shared with her brother, but now he’s continuing to take her makeup without permission. \n\nOP probably shouldn’t have yelled, but I don’t think he did anything wrong by reprimanding his son for taking his sister’s belongings without her permission.", "Because asking a sibling to share after the other sibling has already stolen from them is such a great idea…. Yikes 😬", "They both get $10 a week for chores", "Why do you assume the child does not have that option?", "I started getting an allowance for doing chores around the house at 8 years old by 12 my sister had a kid and I occasionally babysat that kid for money… he’s 12 not 5 there’s always things he can do to make pocket change. \n\nMatter of fact my 5 year old nephew gets 5 bucks for vacuuming the backseat with a car vacuum every Sunday.", "Birthday money, christmas money, allowance, extra money earned by doing chores. \n\nAlso, if he wanted make-up, why not go to his parents first and request it, rather than steal it from his sister? For all you know, mom and dad would've been perfectly fine with buying him some cheap basics to experiment with (or come to some sort of chores for make-up deal) if he had actually asked.", "I started earning money at 9 mowing the lawn, washing the cars and polishing my dad's work shoes. You can teach young kids the value of money and personal responsibility without a \"job\".", "I started babysitting when I was 11. I was buying my own makeup at 12. Or maybe he gets an allowance he can use.", "Not sure the son should be rewarded for his theft by OP buying him what he's been stealing.\n\n12 is old enough to start babysitting or mowing lawns or doing yard work for some cash, like his sister.", "He can do chores and make money at 12.", "Please I had a job a 12 and had my own money.  He can mow lawns, shovel snow, rake leaves and any number of other things. Stealing in never ok and rewarding it by gifting items similar to what was stolen is not a good thing to start.", "His 14 year old sister has been buying hers with her own money, so it wouldn’t be fair to buy him his own and reward him for stealing the things she’s bought with her own money.", "My biggest concern would be sexism by the school (ie makeup is banned but they turn a blind eye to girls or only allow girls to wear it). Good to allow him to wear it other places within reason.", "No school bans makeup here.\nYou can wear makeup in kindergarten. \nWhy would parents ban makeup in school if he buys it himself?", "I agree.", "he's 12, not 20. a fair punishment is doing extra chores, an apology to sister, replacing her missing makeup if he has an allowance, ect.", "Punishments don't induce change, they create feelings of shame and resentment. There are plenty of ways that this behavior can be addressed, but isolating a human from their support group and hoping they come to the right conclusions on their own is lazy parenting. There is no easy answer; children aren't dogs to be Pavlov'd into \"good behavior.\" It requires a long-term commitment to being consistent and understanding. My daughter is currently testing boundaries with truth telling, which is developmentally appropriate at her age. In response, we withhold rewards (no dessert after dinner or no tablet time, for example), we talk about the importance of boundaries, we brainstorm what it would feel like if other people were to tell us fibs and how that would make us feel, and we collectively agree on future expectations. This is super important because instead of punishing when a bad behavior appears, we withhold rewards for not meeting the agreed-upon expectations. It sounds like the same thing with extra steps, and it kinda is, but that's like the whole point. Parenting is about the extra steps.", "She buys herself Dior (lip oil $38).\n\nHe can get some elf (lip oil $6) until he can work and get whatever he wants.", "he’s only 12, it’s not like he can get a job. op should get him some cheap drugstore makeup as a christmas gift or something", "Then make it his Christmas present for this year", "Haha, skin care> makeup any day though. Well as an adult you do have investments to make so.", "I believe you misunderstood me. She brings out the makeup so dad can sit with him and find out which colors he wants to experiment with, then they can go to the Dollar Tree and get items approximating those colors for him to experiment with. Sis can identify what the colors are. I'll bet Dad can't. \n\nBut you're right. Which is why kid can't steal his sister's stuff and should get punished for it (Dad's not an AH there), Sis is understandably upset and is right to demand a lock if little bro won't respect understood boundaries (she's not an AH), kid almost certainly has no clue about any of the cost or health issues, and wasn't necessarily ready to get a tube of lipstick, just wanted to experiment and wanted to hide it being 12 and all - should know better, but with understandable fear of having to admit he wants to experiment combined with being a kid, I'm not going to call him an AH, though I agree he should get grounded for violating his sister's privacy and stuff, and Mom is defending him, just the wrong aspect of the issue so she isn't an AH either.  NAH.", "He’s 12.", "I honestly have no idea how much makeup costs, but I assume just getting the basics might be too big a chunk for a 12 year old to swing fast.  That's why I suggested some kind of starter set.  If I'm wrong about that assumption, then ignore my advice.", "He's 12.", "[deleted]", "That makeup to murder pipeline sure is a problem.", "Well spend some quality time with him and take him make up shopping, I’m sure he would love you showing interest in his hobbies and getting to spend time together!", "But he is his child? Why can’t he buy him something that he likes? I don’t get it", "He is just using makeup its not like he’s destroying it. Yeah it’s not cool and he shouldn’t take it but again There was no need for him to scream at his kid over something so small.", "I should've read more thoroughly, you're right. You're also right that he should've reprimanded him, but yelling was too much, is more or less the main point I was getting at.", "He's 12. How is that a yikes? The situation could've been handled better. He needs to learn to ask before taking, yes, but you are acting as if he's a 17 year old kid with a fully developed moral compass and is doing it with the intent of harm and taking their expensive makeup. The kid wants to experiment and learn for himself. Please elaborate how that's a yikes.\n\nEdit: If the daughter doesn't want to share, that's one thing, but we're not discussing that.", "An allowance would be a very good solution for this dilemma, since the issue is arising from the lack of makeup the boy has. I think it will help to set boundaries regarding personal items if the boy can understand what it is like to have his own things.", "Me too. Lol, there's always the paper round if wants to make money. Surely he can ask aunt if he could work at the Bakery too?", "This. Even if he doesn't work for someone else, he could earn money through taking on more responsibility at home.", "Sure maybe the kid is old enough NOW to earn money, BUT do you think the parents waited until their daughter could afford to buy their own makeup to let her get some? They should sit down with the kid and explain that using without permission and sharing makeup is a bad idea. Then they should buy him his own kit. They should have done this the first time he was complained about. Not ignoring it, not supplying the makeup, and punishing him for it later.", "He should learn to code.  Plenty of free resources out there.", "[deleted]", "What? That doesn't make sense. If someone steals a shirt (many people don't have a real need for extra clothes), no more shirts as gifts... indefinitely? Does it make a difference to you if makeup wasn't involved, or is it more scandalous because this is a boy?", "My third youngest grandson is 12 and is in his last year of elementary school. The school enforces a strict no make up ban on both girls and boys. I can understand that as he is in a K-6 school. Next year he goes to middle school where both girls and boys are allowed make up. \n\nI agree if it is a gender thing it is wrong but I'd also hate to have the kid get in trouble because no one checked school rules.", "It isn't the parents who ban it.  It is in the student handbook under dress code.", "Not sure where you're from, but a lot of schools in America ban all kinds of things like this.", "I mean, he's 12, not 5. 5 year olds know stealing is wrong, products cost money, parents shouldn't have to tell you more than once to stop stealing things from your siblings without permission, etc.", "but grounding is too much? 12 is plenty old enough to know stealing is wrong", "Do you know how expensive makeup is? lol", "He can do chores or work in the neighborhood (mowing lawns, for example) to earn money. He’s 12, not 5.", "Ohhhhh my bad, you’re right I did misunderstand. I thought you meant like she’s your sister, borrowing makeup isn’t stealing (which is something my dad would have said).  Also that the living room thing more of a trying on makeup rather than a looking at makeup sort of situation.  I think finding a neutral ground to do that is a great idea, as long as the sister is willing and there is a parent present to mediate.  Sorry I can’t read evidently lol", "The sister is 2 years older and still a minor and has been working for a while… so why should he get things that she’s not allowed", "Do you see how OP specified the son was using the expensive makeup? If son wants makeup, he can choose how long he wants to save up. Cheap drugstore makeup will probably be a week or two of allowance depending on how much he receives. The kind of makeup that’s mentioned - like DIOR LIP OILS? That’s going to take him a while, but that’s his choice.", "She’s 14…..", "Then he can buy it himself like his sister does can’t he", "It doesn’t matter how much it cost. He wanted something that wasn’t his so he took it. He’s 12, that’s plenty old enough to understand that’s not ok, regardless of your reasoning. If he wanted to express himself, he could have asked his sister or his mum or even his dad from the sounds of this post.", "Just because you don’t know how expensive something is doesn’t excuse stealing and it doesn’t matter if it’s Dior or dollar store the owner said no", "Murderers gotta start somewhere,  it's not like they go for the jugular first.", "This stemmed from the son taking makeup from his sister, so by buying his son makeup to stop him from taking his sisters it is rewarding that behaviour. \n\nMaybe taking both out to buy both some makeup, and making it a family thing and opportunity for daughter to share her knowledge and son to learn might be a positive way to do it.", "He’s using his sister’s makeup that she spends her own money on", "Paper round? Oh sweetie, I have something to tell you, but you may want to sit down first...", "Christmas is coming up (and other gift giving holidays from other cultures).", "No, they should not respond to complaints about their son's theft by buying him gifts for no reason.", "He didn't have to steal, period. For all we know the kid gets an allowance and he blew it all on other stuff, or else his parents are going to get him some for Christmas. Hell we don't know if he even *asked* his parents for any makeup. Besides, 12 is *plenty* old enough to know not to steal someone else's stuff when they've told you no. And he's only grounded for a week, which isn't even super long, just long enough to make the point. He's experiencing natural consequences for his actions, he's not entitled to take his sisters makeup just cause he doesn't have his own yet.", "Did mom and dad ever buy make-up for the daughter? If yes, then it is fair to buy some for the son as well (though he should've asked before stealing, now he has lost that privilege). But if they never bought make-up for their daughter and she has always funded it herself, then he can do the same thing.", "Op didn't mention him asking for make up.\n\n\nParents don't need to guess what their kids want at that age. \n\n\nWith every new interest you have to slowly start collecting your stuff for it. \n\n\nAlso how unfair would it be if the daughter had to save, use birthday wishes and work for make up and the sons just gets it?", "Eh, no 12 year old needs to wear makeup to school anyway. Maybe like a lip gloss, that's it. Save the makeup for after school or weekends. Girl in my hs used to sit through the entire class putting on foundation, over and over and over. She was sooooo orange.", "Reread the comment I replied to", "Not the United States. \nWhere is OP from?", "Most punishments, including grounding and extra chores, have downsides that parents should be cognizant of. Regularly assigning extra chores as punishment can cause people to associate cleaning with bad feelings, which ironically turns them into slobs.  Overuse of grounding can emotionally and socially stunt a child because their friendships get disrupted by it. \n\nYelling is just pointless. There's a plank in my eye, there, I was a big time yeller until my mid-30s.  Doesn't accomplish anything, traumatizes people, makes you look like an asshole.  The first time I saw a friend doing \"gentle parenting\" with his son I was so *impressed.*  I deeply regret that I missed the opportunity to do that with my own children because I somehow thought yelling was a good parental behavior.\n\nApology and replacing the makeup is the best option for punishment imo: it directly repairs the harm caused by the misbehavior.  The lock is good, too (any teen should have a lock on their door anyway.)", "He's 12, it should be illegal to allow child labour.", "true, i didn’t think of that. i didn’t grow up in a neighborhood, i just lived on a semi-rural main road with no sidewalks or friendly neighbors, so i didn’t have those opportunities.", "No worries, I reread and I wasn't clear. 👍😁 But yeah, was looking for neutral ground, an adult there to actually purchase the experimental makeup, and the owner of the real makeup who can help adult figure out what colors will be similar to what the kid wants.", "[deleted]", "But it’s something that they both like so i don’t get it why it would be such a big problem. They can still sit him down and tell him that his behavior is not okay and that he can ask his parents if he want’s something or if he is interested in something. Like i said in my other comment, there was no need for OP to scream at his son over something so little. He is 12 i don’t expect a 12 year old to work so he can buy something that he likes.", "Okay? I get that and i said that it wasn’t okay but still doesn’t make it right to scream at him", "My niece does a paper round. They do still exist.", "Yep! Paper rounds are being done by people with cars and have been for decades!\n\nAlso people don't really pay twelve year olds to babysit, let alone twelve year old boys. There's a niche for male babysitters. But not twelve year old ones lol.", "I'm 60, and doing a paper route wasn't a way for me as a kid to make money. It was all people in cars then. My older brothers did, but they were 10 years older.", "If it is in the student handbook that students can't wear make up then the parents need to back up the school rules and say no make up at school. \n\nIf the parents feel strongly the rule is wrong then they need to fight to change the rule but respect it until they succeed in having it changed.\n\nIn my grandson's case he is old enough to understand and only wears his make up on weekends and after school if he is going somewhere. \n\nLearning society has rules and we have to follow them isn't a bad thing. The school system says he is not old enough to wear make up there. Therefore regardless of who bought the make up he can't wear make up at school.", "a week isn't going to do social damage\n\npunishments are consequences of wrong doing, like stealing\n\nsorry you got off to a rough start parenting but that's not on OP", "Thank you for realizing yelling is pointless as a parent! I have ptsd reactions  to being yelled at due to my step mother yelling at me in my teens.", "Yeah all you’re doing is excusing his behaviour because of the price like that somehow makes a difference it doesn’t", "But the 14 year old has too? \nWhy should the brother get rewarded for stealing her things by OP buying stuff for him when she has to pay for it herself?", "So what do you think should have been done", "Lots of walking paper routes for kids in my city and I started babysitting at 11.", "So you know what school the OP's son attends?", "Congratulations on not reading the first paragraph.", "[deleted]", "Hmm how about they sit him down and tell him that what he is doing is not okay?", "They told him no his train of thought was he was going to do it anyway. His sister is entitled to her privacy and her things and he was stomping all over that but it’s okay because he’s only trying to express himself well it’s not okay it’s just excuses", "You mean like they’ve already done and yet he continues to do it?", "[deleted]", "They didn’t? Where does it say that in OPs story? He only says that his daughter told him that but he didn’t mention that they talked to him properly about it", "He didn’t guiltrip him for using makeup but for stealing because that what he did he stole something he was told is not his and he didn’t ask for things to be bought for him did or use his money to buy his own makeup. He CHOSR to go into his sisters room (breaching her privacy) and then used her things when he’s been told not too (stealing) but it’s okay because he’s only expressing himself right?"]}