{"id": 27977, "submission_id": "16wrs06", "title": "AITA for leaving my sister and her daughter homeless?", "selftext": "I (f32) live in a  European country,  I won't say which for privacy. When I was 6 my mother died in a car accident, he grieved heavily, but eventually he moved on, he remarried when I was 11 to \"Mia\" who had a daughter from her previous marriage \"Zani;\"  Zani's father died of stage 4 pancreatic cancer, very rapid onset.  Which was why my father and Mia bonded very quickly.\n\n&#x200B;\n\nIt was hard for m e, but I accepted the family blending, I thought it could only help after the void my mother left. However soon it became clear who was the favorite. Zani was the golden child, my dad was really vulnerable after my mom passed, he always gave the benefit of the doubt to Zani. She could throw tantrums and cry for whatever she wanted. I was never really neglected but whenever their was a judgment I was on trial as a girl who should do better and she was a poor victim who lost a parent. As if I didn't either.\n\n&#x200B;\n\nFast forward I got into college on a scholarship, and I lucked into a job because of one of my summer internships. Thanks to that connection I was able to get a decent apartment in my city. I was LC with my parents recently but I wanted to tell them I got my own place. They seemed really pleased with me. Then I got a call from Mia about how I have such an amazing place in our city (it's not amazing just a decent part of the city) and how I must have so much space. I tried to respond noncomitally but she started to insist  Zani could stay there for a few days and I could help watch her kid. Apparently Zani had a baby recently but as the child grew it was clear her husband was not the father . She said it was the right thing to let her stay over, but I said no, I wasn't equipped for that and I can't be expected to take care of a an 8 months old She started screaming at me saying how we were family and this what you're supposed to do but I hung up.\n\n&#x200B;\n\nMy parents called a few times, but I left them to voicemail.. AITA for not letting my sister stay with me? I just don't feel I should automatically give in\n\n&#x200B;\n\nEDIT: I should explain Mia cannot take Zani in because because Zani is an addict and Mia uses benzos on prescription.", "created_utc": 1696135154, "permalink": "/r/AmItheAsshole/comments/16wrs06/aita_for_leaving_my_sister_and_her_daughter/", "score": 2858, "replies": ["NTA. A college student is hardly the obvious person to take in a relative with a baby. Why aren't your parents taking her in?", "NTA. Mia can take her in, the benzo’s are just an excuse. She can hide her medication easily enough. \n\nYour step sister is an adult. If her own mother won’t house her for a flimsy excuse but expects you to? That speaks volumes, imo.", "Mia could take Zani in if she chose to.  She want to shift the problem of drug addicted Zani onto you.  Don’t let her.  NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f32) live in a  European country,  I won't say which for privacy. When I was 6 my mother died in a car accident, he grieved heavily, but eventually he moved on, he remarried when I was 11 to \"Mia\" who had a daughter from her previous marriage \"Zani;\"  Zani's father died of stage 4 pancreatic cancer, very rapid onset.  Which was my my father and Mia bonded very quickly. \n\n&#x200B;\n\nIt was hard for m e, but I accepted the family blending, I thought it could only help after the void my mother left. However soon it became clear who was the favorite. Zani was the golden child, my dad was really vulnerable after my mom passed, he always gave the benefit of the doubt to Zani. She could throw tantrums and cry for whatever she wanted. I was never really neglected but whenever their was a judgment I was on trial as a girl who should do better and she was a poor victim who lost a parent. As if I didn't either. \n\n&#x200B;\n\nFast forward I got into college on a scholarship, and I lucked into a job because of one of my summer internships. Thanks to that connection I was able to get a decent apartment in my city. I was LC with my parents recently but I wanted to tell them I got my own place. They seemed really pleased with me. Then I got a call from Mia about how I have such an amazing place in our city (it's not amazing just a decent part of the city) and how I must have so much space. I tried to respond noncomitally but she started to insist  Zani could stay there for a few days and I could help watch her kid. Apparently Zani had a baby recently but as the child grew it was clear her husband was not the father . She said it was the right thing to let her stay over, but I said no, I wasn't equipped for that and I can't be expected to take care of a an 8 months old She started screaming at me saying how we were family and this what you're supposed to do but I hung up.\n\n&#x200B;\n\nMy parents called a few times, but I left them to voicemail.. AITA for not letting my sister stay with me? I just don't feel I should automatically give in   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nDon't let any of them over your door.\n\nFind friendship and comfort elsewhere.\n\nThe last thing you need is an addict with a baby.", "NTA - time to go from low contact with your dad to vvvvlc.\n\nMia and Zanni are not your family, due to no fault of your own and now they need to own their choices of behaving badly to you. They’ve never treated you fairly, so why should you take on the responsibility again of your stepmom’s cheating addict daughter with her bastard and possibly addicted child?\n\nThis is the consequences of their actions, not yours. Protect the life you built with your own hard work, they had all the chances being the favorites.\n\nAlso beware your dad getting involved: he’s their enabler, and he is just as bad as they are.\n\nI would send this text. \n“Zani and her child will never live with me. End of story. This is the consequences of her actions. Any communication bringing this up will be be immediately ended.”", "NTA - your house your rules. Your step mum could have taken her in.", "NTA, she isn’t your sister. Just cuz your dad married her mom, doesn’t make her your family / responsibility. 🤷🏻  It’s her mother’s problems, not yours. \n\nTough, don’t yell at someone you’re asking to help you. If u didn’t want to help before, definitely don’t help now. She’s already being demanding and wild, imagine when she moves in. It’ll only get worse!", "NTA\n\nDo not give in and do not take her in. EVER! you will regret it and never get rid of her.\n\nYou need to concentrate on your education", "NTA. You have no responsibility over your stepsister. She dug her grave and since she is the golden child, she can go love with her mother. I feel for you that your father is acting this way with you. You deserve more. Go low contact or no contact.  They are loosing an amazing person.  You only need to prove your worth to yourself.", "[deleted]", "NTA!!!! No no no no please under no circumstances accept this. If they continue to push you on this, tell them exactly what you told us! Make your father extremely aware of how they made you feel as a child who lost their MOTHER! you are LC anyway, so what's the harm? They may validate your feelings. They probably won't, but you've lost nothing. Wishing you all the luck in the world!", "NTA at all, your parents can take her in if they're so concerned. They've enabled her shitty behavior for years and you shouldn't be punished for that. Do not let her move in. And I think this is your cue to go from LC to NC. They are only fAmILy when it is convenient for them.", "Your life your choice. Why feel bad? If you really want to help, help a real homeless person with no one to rely on.", "Your edit is critical, btw.  NTA.  Zani's not a sister or friend to you, you didn't even know she had a baby so you aren't even really acquaintances anymore.  DO NOT let her stay with you, she will disrupt your life and dump her baby on you, and you will be stuck with them both.  \n\nMaybe your LC with your father and his wife needs to become NC.  If you do choose to talk to your father, let him know you only called to tell him you were doing well and had your own place.  But instead of being happy for you, he and his wife see it as an opportunity to unload the irresponsible Zani (and her baby) on you.  Let him know how hurt and disappointed that makes you feel.", "> she started to insist Zani could stay there for a few days \n\nA few days? From your title, Zani + baby would be moving in with you. Which is it?\n\nEither way, NTA.\n\nShe cheated on her husband. Sheʻs an addict. Sheʻs a thief. Youʻre supposed to be the baby minder even though you work and it sounds like Zia doesnʻt. (So what does she need a baby minder for?) Who wants that in their home? Even if you had a relationship which it sounds like you donʻt.\n\nGo back to being low contact with your dad and step-mom. And I really hope you didnʻt make the mistake of telling them your address.", "NTA- \n\nYou're not leaving anyone homeless... your sister has a spouse, has a child, has an entire life... entirely without you... she does not need you to provide a home to all three of those people... and she certainly doesn't need you to do that when you literally cannot afford to. You have a new job you just started and a small place. You can't afford to support these people and you aren't at all an AH for stating that you can't and won't financially support, provide them with free child care, and house these people.", "I'd go no contact\nYou're NTA they all are", "You are undoubtedly TA. NO QUESTION.\n\nYou should be able to provide for anyone at your stage in life. Stop buying lattes and save a little money on the side. I can send you my uber referral link.", "NTA", "NTA. Protect your lifestyle and your home. They never treated you well, and you shouldn't feel bad about caring for yourself. You've had to do that growing up, and now isn't the time to stop. I hope no one has your address!", "NTA... your sister made her own mistakes.  It's not your fault.  And I'm guessing that if you let her in your home she will never leave", "NTA.\n\nFirst off, not to get into semantics too much, but she's not your sister, she's your stepsister, who, from the sound of it, you've never gotten along with.\n\nSecond, this is not about 'leaving them homeless', as they can just move back in with Mia and your dad, right?\n\nThird, they don't just want you to provide them with a house, but with (free, I'm assuming) babysitting duties as well.\n\nLong story short: Your house, your choice who you'll let stay there or not.", "NTA - you are under no obligation to take anyone in, it doesn't matter WHAT the relationship to them is. Your sister has made her bed, she needs to lie in it. Or, since she's such the golden child, she should live with your parents, and they should deal with her and help her take care of her child.\n\nStay strong, OP, and go back to LC/go NC with your parents - you'll be better off in the long run.", "NTA. Not your circus. Not your monkeys.", "NTA. Your dad and stepmother can take her in and babysit", "NTA they make narcotic safes.", "NTA\nYou are fresh out of college and you are expected to house and probably help take care of your half sister and her baby? She is probably just pressuring you because she doesn't want to have to help", "She's a known thief, she stole my engagement ring, she is not a child who you can fool. So I don't want her here", "Her father", "The father.", "If you kept reading, you could easily have figured out it was her father.", "It's not how pronouns work *in English*, which almost certainly isn't OP'S first language. It may be how pronouns work in their language It's also very clear from the context that the 'he' is OP'S dad.", "She *had* a spouse. Who just discovered she cheated on him and had another manʻs baby.\n\nHence her need for a place for her and the child.", "[deleted]", "Well if Mia always kept her meds with her… 🤷‍♀️\n\nPoint is, it’s just an excuse to pawn her onto you with no regard to how it will affect you. \n\nJust so they don’t feel guilty!!!!!\n\nIf she’s already stolen from you and presumably your parents (dad/step mom) the benzo issue is a very weak excuse. \n\nYou are not the AH and I pray you hold your ground.", "The problem they created is not yours to fix.", "Yes. This.\n\nSuggest this if they contact you again. Hell, Iʻd buy a lockbox and send it to them along with a note saying, \"Now you can house Zani and the child.\"\n\nEDIT: You can buy a narcotics lock box for less than $20. Please do this. Send them the lock box and the note. Let me imagine their faces when they open it.", "[removed]", "Yeah, you should totally let her move in so she can steal all your stuff and bail, leaving you with the baby. /s\n\nOh, and NTA", "NTA- enjoy your life. Their poor behavior is not your problem.", "NTA plain and simple", "\"I should explain Mia cannot take Zani in because because Zani is an addict and Mia uses benzos on prescription.\"\n\nNAH - Mia seems to a narcissist. Screaming at you to take on her own headaches. Go NC", "NTA. Nope. No way.", "NTA! \n\nMuch as my heart breaks for the baby it isn’t your responsibility to house an addict and their child when her own mother won’t house her!\n\nI’d send this to your dad - \n\n“Dad, I will not be housing Zanni and the baby, ever. Additionally, Mia, Zanni and the baby are not welcome at my home, and you wife is only to contact me if there is an emergency pertaining to you. Whilst I understand you were devastated when mom died, so was I - she was my mom! \n\nIn the years since I have been very obviously sidelined and treated differently to Mia’s daughter and you were complicit in that. I am now an independent adult and therefore if YOU, and you alone, want to have a relationship with me you need to reflect on what I have said and make positive consistent steps towards rebuilding my trust in you and our relationship. \n\nLosing mom, and everything that has happened in the years since, has made me realise that I may want you in my life but I don’t need you in it. The stress Mia and Zanni cause is too destructive to me and I will no longer allow it. When Mia states she cannot house her daughter because of her addictions why the hell should I? Maybe Mia should ditch the benzos or get a secure safe. I am not a free babysitter and Zanni is no relation to me. \n\nI want you to really think about what I am saying because you know I am capable of everything I say. You need to decide if I am important enough to you to have a proper relationship with or not.”\n\nBe prepared though, he may choose them. But at least you will know and you can block them and move on with your life 💜", "NTA.  Do not take anyone in.\n\nYou are not responsible for Zani or Mia.  In fact, your dad is way more responsible for them than you are.  If he doesn't want to adjust his life to care for them as a husband and father, he needs to think about that long and hard.\n\nBut they aren't your problem.  Keep your distance.", "NTA - don't give in to the pressure, these people seem like they want to take advantage of you. They want access to your assets, but they don't want to nurture a respectful and decent relationship with you. This situation is not something you have to solve, and taking in a person with addiction problems and a young child is something that could throw your own life into chaos. Take care of yourself first and foremost, and this is not in your best interest.", "First - NTA \n\nWowwwww the narcissim is strong with your stepmother....imagine having to take responsibility for the child that you indulged and raised spoilt instead of passing her off to her step sibling to sort out. \n\nAbsolutely not, you keep those boundaries OP, a few reasons:\n\nYou cannot help a drug addict who doesn't want to be helped, the fact that her mother is begging and not Zani approaching you directly, means Zani has no desire to change her lifestyle, she simply wants someone to palm her baby off on whilst she continues on in the same way she always has. \n\nThey don't get to pick and choose when they are part of your life. You excuse your dad somewhat but he should have had the spine to protect you. You were a child. He was the adult. Kudos to you for shaking it off and thriving but you owe them nothing. \n\nFamily? Your stepmother says. Yeah I don't see any family here, biological or otherwise. \n\nAs for the benzos, get a lock box, keep them on you and take accountability for the monster you helped to create Mia. \n\nYou may have to say goodbye to them to protect yourself, but do not under any circumstances, let your sister and baby into your home. They will never leave and your sister will destroy your life by lying and stealing. \n\nGood luck OP.", "NTA.  \nIt sounds like that door should stay closed...? They **immediately** tried to dump their spoilt-rotten \"golden child\" addict and her baby on you. You've been low contact with them for how long? And the *moment* they felt you could be the perfect doormat, they tried to spring your stepsister and her child on you. They didn't even try to do minimal pleasantries and \"rebuild\" the connection first. It was *never* going to be just \"a  few days.\" \n\nAmazing that this is \"what you're suppose to do for family,\" meanwhile Zani cheated on her husband and is doing... *what* for her child, exactly? Your stepmom can take in her grandchild, if necessary, and lock up her benzo medications to the highest degree possible if she decides to take Zani in as well. \n\nThey should be looking into some kind of program for Zani though, not shooing her away to your house. If she had an affair and is an addict, assuming these overlapped at the same time, there is probably deeper things going on that none of you are equipped to help Zani with.", "If you’re LC with then why did you need to tell them you have your own place? You were being stupid", "Zani should move in with her own mother if mommy is so concerned \n\nAnd your dad needs to grow a pair and tell these people to back off", "NTA, you’re not responsible for the baby and honest about not equipped for it.", "Send Mia a locking prescription box and tell her you have solved the problem and Zani and HER grandchild shoudl be safe in Mia's house now", "NTA \n\nWhat benefit would it be to Zani to move in with you for a few days? Can she fix her mess of a situation in a few days, find a new apartment, a job, in a few days? \nNo. \nThey lied to you in order to get Zani through the door and once she's there she expects to stay. \n\nStand your ground. Say no. You're LC anyway and they just proved there's no value add in your life by re-establishing full contact. These people will continue to take until they've taken the last shirt off your back and then they'll cry it's the wrong size.", "NTA.\nPoint out that Mia and your dad can seek custody or foster the baby if they at least care about her being safe.", "NTA - Its your place and  if they are concerned they need to step up. Plus an addict to boot . She will definitely dump the kid on you and steal from you", "This is not your problem. Once again they are prioritising your step sister over you. \n\nZani is an addict. So they want to move an addict and her baby into your apartment for you to pay for and take care of. Nope right out of there. \n\nNTA a thousand times.", "NTA\n\nDo not let them move in, they will NEVER leave.\n\nI'd probably suggest no contact with all of them for your own sanity.\n\nYou're just useful to them, no real love.", "So they want the addict to stay with you? The addict with a baby? \n\nYeah, no. Even if she was not an addict, you would get stucking watch a kid that is not yours. The fact that she is means the chances of you becoming a full time caregiver are even higher. \n\nPlus, she is not homeless. She can go to her parents. they just have work harder to safeguard the drugs. \n\nNTA", "NTA. An addict? Oh hell no.", "So your father and stepmother want you to take a drug addict and her baby into ‘your’ home? \n\nIf you do, you need to realise that you’ll be supporting them both financially and probably the baby physically as well. \n\nYour ‘parents’ are trying to dump the responsibility of Zani from themselves to you. Stay firm and continue to say no. \n\nNTA \n\nBtw, isn’t it weird how often it is that the golden child is often the one to falter and fall etc", "NTA. Hold fast", "Nta. If her mother can’t take her in dearest father surely can. Go NC with them.", "NTA- none of their issues are your problem. Once they’re in your house you will be stuck with them.", "NTA. It's sad to see, but clearly this is just about taking advantage of you and your success. Stay away, set a boundary and hold it.", "Nta - zani should be getting her daughter (not your sister) into a rehab clinic. Whilst she’s there, zani can look after her own grandchild. Not your hot potato to hold!", "NTA. Those \"few days\" will turn into \"indefinitely.\" You'll end up having to care for a baby you just learned the existence of, while your step sister is who knows where, doing who knows what.", "NTA just forward this thread to your dad with the message “You failed me as a father. This is your mess to deal with.”", "NTA.\nDon't let this person in your home to derail your life. Mia can buy a narcotics safe and take care of her own daughter.", "NTA. It's sad but you aren't in any position to do it.", "NTA and with the edit even more NTA her mom needs to wake up and intervene if not for her daughter’s sake for the baby’s", "So basically because you're pretty much the only put together successful adult you're now expected to drag your drug addicted family members along with you and let them leech you out of your success?? Nah. You owe them nothing.", "So Mia can't take Zani in, so she tries to push her and her baby onto you instead. Saying you are 'family' after all those years when you were treated very much as second best is salt in the wound. You have made a nice life for yourself;do not jeopardise it for Zani. If you let her in for 'a few days,'  there is little chance she would ever move out. You are NTA, but Mia is.", "if Zani is an addict, she won't look after the baby and she would probably steal for from you. All addicts steal. Giving the benefit of the doubt to Zani and giving into her tantrums have created a an addict and Mia is continuing the same strategy. You should write to Mia about it and close the conversation.", "NTA. If you haven't told them your address, DON'T! And prepare to turn Zani and child away at your door. Do not, even for a moment, let them into your home; they'll never leave. And probably block your entire family and go totally no contact.", "this “sister” is an addict who cheated on her husband, had a child by someone else and rather than helping her sort out how to straighten up her life they want you to take them in and help care for an infant that you weren’t even aware had entered the world and a “sister” you’ve never had a sisterly relationship with? are you also supposed to be helping manage her addiction?? NTA. they will completely disrupt and take over your life and my money would be on her leaving you with that baby. don’t do it.", "NTA! Mia is entitled. She didn’t consider your situation even once and that’s easy to see. Zani having a child shouldn’t be your problem and it’s within your own rights to reject Mia and her Ahole daughter. \n\nMia is weaponising the fact Zani has a child to guilt trip you. Don’t give in.", "You don’t even talk to them enough to know she has an 8 month old? No, you have no obligation here.", "Go NC at least for a while, and don’t reveal personal info again. As soon as you did they started harassing you. NTA", "Say you use Benzos too. NTA", "NTA. Maybe Mia can't take her daughter in, but she can take in her grandchild if she wants to give her daughter a break.", "NTA. Mia can take her in. Mis can keep her prescription hidden - this is not a big deal.", "NTA - It should be Mia who takes in her daughter or at least helps with baby! What a bad excuse about the benzos! You could offer to buy a safe for her pills and her jewelry! \nGood luck!", "OP, you mention an engagement ring but no fiancé in your decent apartment?. Did Zia steal your fiancé too??", "NTA\n\nEven if things were good, your space is your space and you can say no. \n\nThe fact that things are bad makes you wonder why they would even ask.\n\nI would go from LC to NC.", "NTA, this is your stepsister.  This will not be just for a few days, but it will be forever.  You will be stuck raising this child and supporting her and her habit.  As it is not her child, he has either kicked her out or is in the process of kicking her out.   Do not even let your dad and stepmom in your place or they will open the door and move her in.", "Nta they want you to take in your addict step sister with an 8 month old kid while she is probably going through a divorce, after you were low contact. Gotta change it to NC and hopefully you didn’t tell them your full address", "NTA", "Congrats on your  job, your degree, and your nice apartment.  \n\nYou earned them ..\n\nYOU earned them .  You have a nice life. You worked for it, you got the grades, stayed on the good path, and now have your own place.  You need not listen to family telling you ( gaslighting you) to let a lazy self centered sibling  into your home with a baby.    They can take them in", "NTA, You didn't even had time to put the phone down or the vultures where calling you to make you share your good fortune.  Ofcourse, firstly to be socially sweet before demanding or voluntelling you what to do with it. No good ~~deed~~  news goes unpunished.   \n\n\nDon't let them know your address or she will ding-Dong ditch her kid on your doorstep. People sounding that entitled can do weird things so it's in your best interest to not share any information to family. It's best to stay LC or NC for the time being. I don't trust your father and step-mother at all at that point.  \n\n\nBe careful in giving out information about yourself.", "NTA\n\n&#x200B;\n\nSo they tried to push their addict daughter and her child on you.\n\n&#x200B;\n\nYou were right to set a boundary.", "Absolutely NTA. Crazy they even dared to ask you, I’d also consider at least a temporary NC. It’s not your responsibility to take in an addict and care for her child (when should you do that anyway, you’re working!). Her mum can take her in and figure out the benzo issue herself. Or they can help her find a small apartment, a women’s shelter, a rehab - whatever.", "NTA\nIf Mia won't take her own addicted daughter and her grandchild in, why in the world would you?!", "NTA, not your problem whatsoever!", "Mia not your parent and your dad is whipped and not a good one to you. Imo, I wouldn’t bother with the your dads wide or her child. They sound trashy", "How many similar stories per week in here…", "She's not your sister.\n\nShe's also not your problem.\n\nNTA", "No, I am not a nanny, I have my own life. Bye...", "NTA!!!!! Go nc with all of them, stay away from people like them and enjoy your life, you earned it.", "NTA. Family or no, you don't take an addict into your home. You can help them find a place to stay, but you don't let them in the door. Things, medications start going missing. She'll never leave. That baby will become your baby. I have friends who have addiction problems, who have never been inside my home. Protect yourself first.", "NTA you’re being too hard on yourself in your headline. You didn’t “leave them homeless” she’s homeless because of her own choices. Even if you had a blood relation or better relationship it’s not on you to deal with this.", "NTA. Zani is Mia's responsibility not yours. A drug addict with a baby they will probably neglect? Hard pass.\n\nEta: I hope Mia doesn't actually know where you live.", "NTA\n\nAvoid this shit show and these low quality people.", "NTA go no contact. Block their numbers and if she ever turns up at your door call the police\n\nAlso so what she takes benzo's on prescription - she can put them in an actual safe in her bedroom.", "More like you're racist and insecure to attack OP. So maybe instead of call them an a.h. point that finger to yourself.", "Why can’t I upvote this a thousand times?!", "Send this to him", "Great articulation, to the point without being malicious (when she has every right to be) and leaves the ball in his court.", "You worded that beautifully and I hope OP sees this and uses it. So well said.", "Wow. I think I love you 😂 please come do this for every person in my life", "Couldn’t have worded it better!", "Well said.", "Facts.  This is the weirdest housing arrangement I’ve ever seen a parent ask of their kid.", "Wow, what an asshole", "Mia can get a small safe for meds. Very inexpensive. And you go NC for a little while to reestablish the LC when and if you want to after they all settle down their entitlement", "**NTA** \n\nMia is just trying to bully you for a free place to park her thieving, cheating, drug addicted daughter and grandchild. \n\nIt is good that you are now in a situation where you can say no to her gaslighting.", "Yeah and it won’t be for the “few days” like she said.  Zani will move in and you won’t be able to get her out. \n\nPlus Zani wouldn’t have had this problem if she wouldn’t have cheated.", "Listen to this OP, it's great advice.\n\nAlso wanted to give a sweet nod to this sweet phrasing:\n\n> These people will continue to take until they've taken the last shirt off your back and then they'll cry it's the wrong size.", "Dude/Dudette. Latte's are not the magical answer to money problems. I don't buy lattes and I have saving problems because of health issues. (Don't send me your uber link because I can't drive due to said health issues).", "\"a few days\" almost certainly means \"until you have to evict them\"", "Just because it always needs to be said AGAIN.   \n\n#DO NOT LET AN ADDICT MOVE INTO YOUR HOME.\n\n  If her own mother can't let her stay in the parents' house because of the addiction, no way should OP let Zani ever step foot in her house.    \n\nShe will lie.    \nShe will steal.   \nShe will destroy your home.    \nShe will destroy your SANITY.", "I think it’s just step sister & her baby: she cheated and it doesn’t seem like she’s with the husband coz if that. OP don’t let her in your place!", "A locked wall mounted key box is available at any hardware stores. It’s an excuse, both my brothers were addicts; I understand what you are going through but enabling her will not help her", "That is what I thought... she would!! steal from you.", "I would allow one conversation with your father on the condition he didn't say a word until you have said all you need to say to him including the fact that Zani might have lost her father but you not only lost your mother but HIM (your father too) to the moment he started to prioritise his stepdaughter over you, his child. Due to HIS CHOICES you were orphaned emotionally.\n\nIf your father does not handle YOUR reality well, then you will know how you need to proceed contact wise. Put your mental health first and at minimum go NC with your steps.", "That might be worth adding to the OP - she's had a history of stealing precious things from you. What does your fiance/husband think of having her move in? I can't imagine he'd want an addicted theif living with him? He has a right to feel safe in his home, as do you.\n\nI personally wouldn't let her over the threshhold - you don't get on and it doesn't sound like you ever did; you had to make your own way because your family wasn't very supportive.\n\nStepsister's situation is entirely of her own making; she and her mother can deal with it and leave you out of it. Enjoy your job and apartment.  NTA.", "Did you ever get your ring back? Did she pawn it for her substance issues? NTA", "You’re no more obligated to her than I am, she has never treated you like family and this extra information confirms you are definitely NTA. What happens to Zani is not your problem to sort out.", "All the more reason not to let them in. NTA", "Did you get it back?  Is your dad aware that Z stole from you?", "Then she has a baby daddy", "Unless you mean literally in her pocket at all times, that ain’t gonna help. 100% Zani is gonna just wait until Mom’s purse is unattended and just snatch them. She needs a lockbox in a secure hiding place.", "As a recovering addict, I can tell you that lockbox would still be opened. Never underestimate what an addict will go through or do to get what they want. The only thing I couldn’t get open was an actual heavy duty safe with an electronic keypad lock on it. But I still tried every chance I got.", "Going cold turkey on benzos is one of the rare circumstances where going cold turkey can be directly harmful (even fatal) not just unpleasant.\n\nShe could likely still work it out if both reducing/eliminating dependency *and* taking them them in were priorities, but going cold turkey on a physiological benzo dependency is not a good idea.", "No offense but if she’s at that point of addiction still, is the baby even safe in her care? Even more the reason for the grandmother to have them under close eye.", "Absolutely. My mom and brother were/are (my mom passed from unrelated issues) recovered addicts. When they're here, I lock my medications and keep the key in my bra.", "100% this! Yeah Mia should put her child and grandchild as priorities but you can't just stop taking benzos. That's a big part of why doctors hate prescribing them. I need sleep aids and we are trying everything possible before those because I don't want to risk having yet another medication I can't just choose to stop taking. (I have one that's not \"addictive\" but if I miss a dose, about six hours later I start getting dizzy, sick, and get brain zaps. Not fun)", "NTA. A \"family\" that treats you as such only when it's convenient for them or you can assist them, is not a family. They are now reaping what they sowed. Do not upend your life for Zani, her child, or anyone else. Hold fast to your boundaries and if necessary, go minimal to no contact or change your number.", "NTA also don’t give then your address or your place of work and block them on social media. I worry they will confront you there. If your apt. or work has a front desk person tell them not to give any of your info to anyone asking (like work hours). \n\nUnfortunately addiction is a disease but you are not responsible for anyone else’s wellbeing but your own. You have to prioritize yourself and your own mental health and happiness. You’ve worked hard and deserve that.", "NTA. They are not your responsibility, period. Congrats on your success, I hope you live a big life! 💕", "NTA. \n\nAnd I highly suggest if you are going to hero the lines of communication open that you start grey rocking. Don’t give them any information that allows them to find you or use against you", "Why would they be homeless if you’re simply refusing to take them in?\n\nIf Mia can’t live with Zani, she could help her to rent someplace, it doesn’t need to end with homelessness.", "NTA. your parents fucked her up. They can deal with it. Life your life!", "NTA\n\nAn asshole would record her screaming over the phone and play that back to her any time she called.", "Nta. Go from LN to no contact.", "NTA \"Behavior like this is why I stopped associating with you before. Welcome to exile. Blocked.\"", "NTA. Why on earth would you want an addict living with you? If her own mom won't sacrifice her drugs to help her daughter then why should you have to sacrifice your home to help her?", "NTA, they refuse to take her in, but expect you too. Pure hypocrisy", "NTA - Zani is an addict, a thief, and a liar.  You’d have to be insane to allow her into your home.  \n\nTime to go LC with your parents again.  They are just continuing the cycle of prioritizing  Zani’s needs over yours.", "Nta, Mia should get a medical lockbox installed to a wall and have her kid move in with her. Yes it may be inconvenient, but its not your responsibility, why should the inconvenienced one be you?", "NTA, she can always lock up her meds in a fire safe box I'm her bedroom and lock the bedroom.", "NTA. Nope completely out of this situation. It will only cause you headaches and misery.", "NTA - Her mum can house them if she wants - but she doesn't, so she's passing them on to you. Don't give in, or you'll end up raising the baby on your own, while your sister makes your life hell.", "NTA. He married Mia. You didn't marry Mia. Nuff said.", "Nta, you did exactly the right thing. She surely would have pulled on your heart strings with the kid and all that. Not your problem that she cheats on her husband and needs a place to stay.", "Nta your not obligated to house her and her child. Your also not responsible with what ever happens to them either.\n\nZani can ask the child's father to help her out. Mia can house her but chooses not too. If Mia her own mother won't let her live with her then she has no right to tell you let her move in. \n\nIf Mia doesn't want to see her daughter be homeless then she can step up allow them to move in and help watch the baby and hide her medicine from zani.", "NTA. Funny how your stepmother wants to play the family card now that her golden daughter isn't so golden. Her kid, her problem. Do not, under any circumstances, tell them where you live.", "Oops..LC", "It legitimately sounds like Zani will wreck your life if she moves in. It's a really difficult call, though, because Zani's child doesn't deserve to pay for their mother's issues, either, nor should Zani automatically lose access to her kid. You're NTA but I think maybe Mia and your father's reaction is baked into their fears for the grandchild.", "NTA. Lol for the level of entitlement by your family.", "Dude NTA, they would make you the baby's second mom while your step sister is out getting high. Also guaranteed your \"amazing\" place wouldn't stay amazing for very long because your step sister would definitely trash it. I can't imagine she would pull her weight with housekeeping and her most likely absent parenting would lead to her kid being uncontrollable as they grow into a toddler. Also depending on the tenancy laws where you are, if it turns out to be a disaster (which it absolutely would be) you may not be able to get rid of her.\n\nSure the baby will get the short end of the stick and that's not their fault, but none of this is your fault either. Your sister made her bed\n\nSo I think its safe to say you can't tell your family about shit that's going on with your life, not even your dad. Don't talk about promotions or new jobs, don't mention schooling, definitely don't bring anything nice like clothes or a new car around them. Your step mother and sister see you as a gravy train to be exploited and your dad will do nothing to protect you.\n\n Never talk to them again and don't feel bad about it\n\nETA; there's also the very real possibility your step sister's drug problem will become your problem if she brings drugs or sketchy people into your house. Do you want to deal with the possibility of waking up to a police raid or violence in your home in the middle of the night?", "NTA\n\nYou have no obligation to do anything.", "Of course NTA. None of this has anything to do with you. \n\n>She started screaming at me saying how we were family and this what you're supposed to do but I hung up.\n\nYou barely have a relationship with any of these people and it's just the same pattern from when you were a child. Just go NC.", "NTA\n\nInteresting how your father’s wife thinks it’s all well and fine for you to take her drug addicted daughter into your home along with the 8 month old baby but she won’t as she may take her drugs. \n\nNope.  \n\nYour stepsister’s mother could certainly take on/fight for the baby and let her daughter address her demons.  \n\npandora840 had a great example of a communication you may wish to send to your father.  \n\nRegardless live your life as you want.  And if you don’t have a security system that allows you to see who is at your door before you open it yiyr might consider getting so you aren’t surprised by a visit from Mia with Zani as well as the baby along with their crap. \n\nAlso depending on where you live you might wish to consider getting a will if you don’t already have one so anything you have goes where you want it to.", "NTA.  There is no reason to let a drug addict and thief live with you.\n\nHopefully they don't know your home address because it wouldn't surprise me if they showed up on your doorstep one day demanding entry.  If they do know, you may want to relocate once your lease is up and not tell anyone in your family where you are living.", "NTA, do not, under any circumstance, let Zani stay with you. If her mother doesn't want her in her home, do not let her into yours. An addict will cause you so much distress. Where was Mia with all this we're family when you were growing up? Might I suggest you go NC with Mia, don't let any of them know your exact address, please.", "NTA.", "NTA Mia can lock her meds up. Nuff said.", "NTA\n\nA written, email or snail mail letter to your father might be best. Require him to give a written letter in reply. Ant time you have doubts you can always re-read those letters.", "NTA DO NOT let your drug addict thief sister stay with you. You shouldn't even have to ask us this.", "NTA, not your circus and not your monkey.  \n\nHow much info on your place did you give to your parents? Hopefully not enough for Zani to track you down and just show up. You said it's an apartment-if there are doormen or any kind of staff, let them know about her and ask for their help. If she shows up, have them say they don't know you/have never heard of you and oh hell no we aren't letting you into the building. And whatever you do, don't invite your father and Mia over to dinner.\n\nGood luck.", "NTA you don’t have the capacity so there’s nothing you can offer.", "NTA. Princess Z needs to figure her life out. It’s not your responsibility.", "Nta. No ma'am. Nobody is invading my sanctuary", "NTA because I think they have no intention of having her stay there for a few days. They want her to stay there a lot longer, maybe indefinitely, and you'll be expected to support them financially. The fact that your stepmother started screaming right after you said no suggests that she's desperate to find a place for them to live; this doesn't sound like a vacation.", "Definitely NTA. But as a “just in case” preventative measure, if you have a building manager/doorman/friend or neighbor who has a spare key in case you lock yourself out, inform all of them that Zani is NOT welcome at your place. She may try to show up and play the sister card to get into your place.  If they don’t know better that you two are estranged, they may let her in.", "NTA... you dont welcome chaos into your home.", "This is absolutely, positively, not your problem. I thank the tech Goddess DAILY for the blocking feature on my phone! Utilize it well, and enjoy your home and your peace.\nNTA", "NTA. You are not responsible for another adult's decisions. Zani has made her and her child homeless. You are not trained to take care of an addict and a baby.", "NTA", "Nta and tuff luck to them. They got what they deserved", "NTA ! If her own mother won't take her in why should you have too .", "NTA.  Not your circus, not your monkeys.  You're expected to take care of an addict and her baby?  Nope, Zani's mother and your father need to keep you out of their problems with Zani.  Looks like Mia and your dad will need to subsidize her apartment or childcare if they won't allow her to live with them.  I hope you don't feel an ounce of guilt for saying no.  Your thinking reasons are solid!  Stand your ground and block Mia and your dad's phone numbers if they harass you about this.", "NTA wow. Don’t budge. Their problems are not yours to fix.", "NTA .   \nI think that the comments speak for themselves but there was a reason you were also LC. Do not let yourself, your hard work, and your future be in jeopardy for someone who has already caused you a lot of pain.", "Zani is 100% not your problem, back to LC or NC and go build a beautiful life NTA", "NTA\n\n\"A few days\"??? No, you will never get that addicted leech out of your apartment and she will continue to steal from you without remorse. \n\nDo not let them guilt you into taking Zani in. You have a job already. You do not have the time, desire ir capacity to \"help\" watch her baby. \n\nStay strong, remain LC and I'm very sorry about your own mother.", "Nope you are fine. Keep those people out of ur place", "Yes", "NTA; not your problem.  Your step-mother is an entitled AH and so is your step-sis.  You shouldn't have to put up with this behavior.", "You made the right choice. Don't let anyone guilt you into letting her stay with you. Say no and stick to it. It doesn't even matter what her issues are.  She made her choices. You not wanting her there is enough and valid. \n\nNTA", "NTA this is not your problem. Your not Zani parent or spouse.  Plus this would be a disaster. She would no doubt steal from you freeload and pawn the care of her child onto you and do nothing but make your life miserable. She's an adult she needs to save herself.", "Wait. You started working and she wants you to take care of an addict and a baby?\n\nWhy don’t have a talk with your father? Is he really willing to ruin your life just to make his wife happy? Is that really what his late wife would want?\n\nI was a SAHM with my first child and taking care of a baby is not easy. Taking care of a baby, a drug addict and working is so much harder.\n\nNot give in. Don’t ruin your life for stepsister. Cause that is  whats going to happen. Most countries in Europe have a good welfare system. Let that take care of her.\n\nThis is your life now. Btw, I don’t know about you, but I would be careful letting someone with low morale like your stepsister in your life\n\nEdit: NTA", "NTA - Excluding how she was the golden child and messed up your childhood, would you invite a friend like her into your house? A thief, an addict, with an 8 month old child, and I assume no job?", "NTA  If stepmother doesn't want her in her house she can pay for apartment for stepsister herself. You have no responsibility to her. The fact that having a baby around would be disruptive to your studies is in itself reason not to have them move in. Remind dad and stepmom that she isn't your sister that she became your stepsister when your mother died.", "Absolutely not! Addicts (former or current) are users and once you let them in they will use you and never leave. Then they’ll use your niece as a way to make you feel guilty about thinking of kicking them out. Your parents are shoving the burden onto you and it’s completely wrong. Hold your ground, even if it ruins your relationship with your family.", "NTA . Zani is Mia’s daughter. Sounds like stepmom wants to unload her new trouble child on you. \nYou’re right not to give in. Just don’t . If you have to, go LC with all concerned.", "NTA.\n\nRun.", "NTA. The parents can make her their problem, you don't have to accept her as yours.", "NTA. Her parents won’t take her in because she’s an addict. This “golden child” got knocked up and is addicted to substances. She clearly can’t hold her own space responsibly. If you let her into your life, she will make all of those things your problem. You won’t be living your life on your terms at all and be stuck living your life adjusted to HER problems. Again. I understand you don’t want her child to suffer, who would?, but if the safety and stability of her child is in question- your PARENTS should be doing something about that (ie taking the grandchild in, reporting it to some kind of social service for aid etc) not YOU.  It sounds to me like what you have on your hands is two people who won’t do the responsible thing that parents are supposed to do because they want to be done with it, and they want to toss it on to you because “family”. You can have compassion and concern for a situation, and not take it on as your responsibility.  If you feel like you have to do SOMETHING, then I recommend looking up programs in the area that could help your ‘sister’ with the issues she’s having, making a list of the numbers and emailing it to her. If she won’t take the steps to help herself, at the very least for the sake of her own child, then that’s on HER and not you. We all make choices in life. I say that as someone who had a baby suddenly very early with no intention of being a mom. I handled my shit and have continued to make the choices I needed to. That’s not your responsibility or concern.  Live your best life <3", "NTA. That’s a boundary. Plus once Zani gets a foot in the door I promise she’s not leaving. You don’t deserve to only be thought of when you’re good for something that someone else needs. No one does. Sometimes the toxic people ARE family. Also, I’m really sorry you lost your mom. I lost my dad when I was 16 and resonate with the feeling of losing 2 parents. My mom was never quite the same after that", "NTA but your steps are. Wow, what's up with cheating on her husband and make him think it's his child?", "NTA. Not your child and definitely not your problem.  Time to go no contact with the lot of them.", "Surrender the child to the foster care in your country.", "NTA", "NTA they played a role in which you were the expendable child growing up and made to be the one all fault came down to. She won't be homeless. She just wants to work for as little as possible and have free housing and use you.\n\nShe wants a setting she was already confortable in as you both had a clear role in the family dynamic and she likely remembers that she benefited a lot from that growing up. \n\nDo not take her in. If anything maybe direct her to a woman's shelter or maybe have your parents actually parent and help her find an apartment of her own. You are not the parent and have no responsibility towards your step sibling.", "NTA.", "NTA. No way should you let her stay with you.", "Nta- mia needs to take care of her child. If she has prescriptions she needs to get a safe in her room and make sure her door is locked at all times. It’s not your responsibility", "Or mia needs to take in her grandchild and send her daughter to rehab.", "NTA - She wants you to let the addict who steals move in with you?  This one is a no-brainer.  Mom can buy a safe for her benzos to keep them away from addict daughter.  Addict daughter can take care of her own kid.  You worked hard to get a scholarship and succeed.  You deserve the benefits of your labors.  You don't deserve to be guilt tripped by irresponsible relatives.", "This is the parents problem.  No excuses, just say it won't be possible.  NTA", "To be honest I would have send a „I’m so sorry your daughter cheated and got thrown out because of it and that her addiction is such an issue. Since your daughter likes to not be responsible why don’t you take the kid. And since dad is such a good sport about your daughter make him support her, since she can do no wrong in his eyes either. Also don’t call me family, I never was more then a black sheep to you. Bye bye <3.“\n\nI mean it sends a message but also you would get shouted at and blamed for a lot so I would not recommend it. Also it would be a little childish but sometimes being an A is fun. Especially if your just returning the energy.", "NTA, not even a little bit!!", "\"She started screaming at me saying how we were family and this what you're supposed to do but I hung up.\n\n​Mia cannot take Zani in because because Zani is an addict and Mia uses benzos on prescription.\"\n\nLololololol!!! So now, the Golden Child is a drug addict who cheated on her husband and had someone else's baby, and you're the bad sister for not letting them both move into your home and take over your life. Time to go back to NC! Mia might want to take this opportunity to buy a medication safe and actually parent her child, who should take this opportunity to parent THEIR child. Good on you for not falling into the roll of the doormat people pleaser. \n\nEnjoy the life you worked so hard to build. You've earned it.", "Block them all.", "[removed]", "NTA. Let Mia take then in because either isn't your responsibility. It makes me sad she's screaming at you to take in a liar, cheater and druggie. You'll end up robbed and stuck with the baby all the time while Zani runs around doing whatever she wants.", "NTA. Stay very LC with your parents. She's still their golden child and won't care if and how she hurts you.", "Inviting Zani and a baby into your home would make you the single mother of an addict and a neglected baby.  So only do that if you want to destroy your life. NTA", " NTA, not your kid, not your responsibility.", "NTA\n\n Why on earth should you take in a girl who is not related to you, who's a drug addict and with a 8 month old?? Seriously asking. Girl, go live your life and tell them to fuck off. You don't owe them anything. She can take her daughter in and keep her meds locked. Either way, their problem, not yours.", "There’s a saying I live by, “Not in my damn house.”", "NTA\n\nBlock your dad and step-mums numbers and cut all contact. Your dad and step-mum want you to set yourself on fire to keep Zani warm. They don’t care about ruining your life as long as Zani gets a free ride to destroy your life and everything you’ve built. \n\nKeep them all far away from you.", "NTA and hold your Ground!", "Oh so they want her to be your problem. NTA. Don’t do it and stay LC. Don’t give them your address or tell them where you work.", "NTA, don’t take her in, she’ll never leave. YOU didn’t leave her homeless; she’s an adult, she’s responsible for her own housing.", "NTA Zani reaps what she sowed. Why is being nice so far beyond so many people", "NTA. You don't owe them anything, and let's be honest... your whole life is going to be screwed if you let her in the door. Cuz once you do, she's not leaving. And she'll mooch off of you, pawn the baby off on you, you'll get no sleep, she'll have her baby daddy in your apartment and probably your bed, etc.", "NTA.  You are actually free to do whatever you chose. It sounds if the best thing would be to continue LC or go NC with your family.", "NTA, and you're not leaving them homeless.  Your sister has made a series of bad decisions and wants you to bail her out.  I'm sure they won't be on the streets.  I'm also sure that it's time for your sister to realize that she is accountable for her situation.", "NTA. Taking in an addict is enabling. Period. And with a baby? Absolutely not. Many ppl think it's heartless, but I learned how not to enable addicts after my best friend overdosed and died. Not to mention, what are squatting laws like in your city? I've heard many nightmare stories of a kind soul letting someone stay with them only to be unable to get rid of them when they overstay their welcome.", "Nta\nthere are locking medication boxes, safes, any number of ways for mia to keep her medication safe from her daughter. You are under no obligation to let a known thief into your home. \n\nIs it sad that she has a kid, and that the kid is suffering for their moms actions? Yeah, they didnt ask to be born or have a shitty mom. But if you want to help for the sake of the kid you didnt even know existed for the first 8 months of their life, there are other ways that dont involve opening your home to some one who hurt you (idk what they are. I dont have kids. I just know that theres gotta be AT LEAST one other thing you can do)", "NTA. You’re not obligated to take in anyone else’s child especially an adult one. If Zani can’t take care of herself & child that’s not your problem. Also how dare Mia not only volunteer your home for her daughter but volunteer you as free child care. She needs to get over herself. If she is soo concerned she needs to take them in or make arrangements for them on her dime.", "NTA - Sounds like they just want to USE you. The parents are responsible for how Zani turned out because rarely does the \"golden child\" turn out well and I agree with you that you should not open your home to them. Don't tell them anything and just close the door on that part of your life . . . it doesn't sound good.", "NTA\n\nMany post point the finger at your sister, but she is stuck in the behaviors of a currently using addict. She is trapped, and everyone else in your family is trying to enable her. Note that they have been doing this since she was young. Their sense of boundaries is messed up. Now, they are trying to throw responsibility and consequences of her past behaviors onto you, enmeshing you in their screwed up dynamics.\n\nIf you do this, you will be locking yourself into your past relationship dynamics with her and your parents. You will not be helping your sister, but only opening yourself to getting screwed over again. Once she moves in, your only way out will be to move, and many of your most valuable things will be lost. Eviction take a long time. You may be responsible for both rents in the meantime. Your name is on the lease/rental agreement.\n\nI was caught in this situation, and my relative retaliated by ripping out the copper pipes and wiring to sell the copper. That cost me $20,000, for her to sell $5-10 of copper. Addicts are very unpredictable, and the potential damages can be immense in ways that you will never suspect. Should anything like that happen, your sister is lawsuit proof. She has nothing. You will be held responsible.\n\nOne suggestion. Watch the dynamics as your parents and your sister plays various manipulative games of being angry, or promising that it will never happen again, or whatever else that they pull. These are their go-to patterns to cope and the manipulations that they are caught in, too. If you do not go full NC, these patterns will be important in the future.", "Saw the edit, still NTA. Stepmom can take her kid in and find away, but is choosing not to inconvenience herself. Sounds like they may both have substance issues", "Hope they don’t know your address", "NTA.\n\nMia can get a medication lockbox. Tell them that your place is small, and your schedule’s full. You don’t have room for Zani, or time to help watch her kid.", "NTA", "Well, I'll just assume your country has some kind of support for people like your stepsister. It's probably shitty but for her that should be enough. I'm just sorry for the baby, it has that mother and she probably wasn't sober during the pregnancy, this is willingly disabling your child (many of those children have learning difficulties, have emotional and growth problems, not to mention they are born addicted and will always be more prone to addiction).", "Not your kid, not your problem. That is her problem. They don't care about you and just want you to bail her out. Enjoy you place by yourself. If they happen to just come unwelcomed, call the cops and have them escorted off property and trespassed. Or whatever you can do to stop them from causing you issues.", "Nta", "Easy NTA. Stay away. This drama isn't your problem.", "as an addict myself I can promise you nothing is ever hidden well enough when you know it must be somewhere and also. Even only the thought that it’s there and you know it makes you want it and think about it so much you’ll have to get it. Just wanted to make you understand that one thing.\n\naddiction is a very intense and serious illness and precautions (as such) are ALWAYS the right thing to do\n\nETA: that said. Of course **NTA** !! bye sis - out of my sight, out of my mind I’d say! Enjoy your new home and your future without them", "What you said!", "This is an excellent script.", "very well said.", "wow perfection! I hope OP sees this and just copies and pastes in to a text to her dad.", "You barely have a relationship with any of these people and it's just the same pattern from when you were a child. Just go NC.", "Then mia or op's dad can take them in.", "Lol, what??", "Listen, a latte is not going to put you in debt. Why should OP have to provide for them? Why don’t you send the sister the Uber link?", "Lol whaaaaaat?! How does not wanting to provide for her addict stepsister and her illegitimate child an AH?!", "What?? Why would she provide for a drug addict??", "Why is she responsible for her addict sister?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "NTA, but I wonder why you are even asking.\n\nYou know your dad and Mia favor Zani over you.\n\nYou know Zani is a thief and drug addict.\n\nYou know that you have no obligation to (1) take in a thief and drug addict and (2) watch her child for her. You also know there will be no end to demands for you to bail out/support Zani.\n\nYou seem to be pretty clear-eyed about all this, so do you really have any doubts?", "NTA, please, for the love of yourself, stand your ground. As the child who worked my butt off through my teenage years and young adulthood with no help from \"their\" parents to achieve success while \"my\" sibling's success came from what was handed to them, please don't allow \"her\" parents to steal your hard work and again, reward her.\n\nHere you are today, a successful, responsible, and independent woman through your hard work.  Let's see how she turned out as the golden child, a drug addict with a child she can not take care of (their granchild). A child who is a thief that they don't want in their home.  Her mom is probably on this medicine because of her daughter.\n\nHer mom called you (not her) because her mom has always done things for her as she \"expects\" everyone to take care of her regardless of who it is.  What absolutely shocks me is they (her mom, her NOT your dad, and her) all know how they treated you.\n\nLastly, if you wanted to take care of a baby, you would have had one?  Let them solve their own problem, and you continue to forge your own path.  This is their grandchild, and they are so selfish to pawn her and the baby off on you, relieving them of their mess to be your nightmare. How much more can they crap on you?\n\n.", "She can literally get a safe with a code, fingerprint, key, all three, it's exceptionally easy to keep your prescriptions from an addict. She can't magic her way into a safe. She doesn't want her addict kid that she coddled into being a narcissist with a kid that she won't look after staying in her home so she wants you to do it instead.\n\nThe meds are an excuse, she can 100% take her daughter, she just doesn't want to.", "She's already stolen from you... why do they think you will have her in your home, where you keep all your things?", "And that is totally fair. Sometimes family can't be helped, and trying will just drag you down.", "NTA.  This isn't your problem or responsibility.  She's a grown woman, she can figure it out.  Why would you want a known thief living with you?  Family members don't steal from other family members.", "Alone for stealing the ring I would never talk to her again until she gives you the ring or the money back.", "NTA.  I’m 52-married 32 years 4 kids have lived and seen some things. You’re not wrong here at all", "Benzos are Mom's excuse. Thievery is your excuse. NTA.", "Zani is an addict and a thief? Why are you even discussing this?!  You should not waste another moment feeling anything about this.", "If she stays \"for a few days\" she'll never leave. Batten down the hatches and fill the moat. Protect your sanity and the sanctity of your home.", "Well said!", "So I think its safe to say you can't tell your family about shit that's going on with your life, not even your dad. Don't talk about promotions or new jobs, don't mention schooling, definitely don't bring anything nice like clothes or a new car around them. Your step mother and sister see you as a gravy train to be exploited and your dad will do nothing to protect you.", "OP this here. Meet your father and talk to him. If you can’t, write a letter and give it to him. He had to finish the letter before talking to you.", "Came here to say this. He ignored you as if you didn't lose a mother either. He needs to hear from you all the trauma you hid while zani threw tanrums because her dad passed.", "I am sure that stepsister with low moral would hit on fiancé. \n\nEdit: Alone to finance her addiction.", "Yeah but that is the AH's problem not OP.", "Ouch. But yes", "Nta.  Dumb actions have consequences.", "NTA.  It sounds like they raised a child too savage and uncontrollable to keep in their own home but expect you to keep her in yours.     \n\nIt's very smart of you to not accept any part of this premise.", "Mia was just buttering you up so that she can pawn off her drug addicted daughter and granddaughter. Good on you and no you’re NTA.", "Send dad and step mom one email where you say, very briefly, why you will not allow Zani to stay with you. Don’t bring up the past, focus on the present (she steals, you are in college and can’t focus on zani nor her child, she is a current addict, etc etc). Tell them Zani is their responsibility and you are now done talking about it.  \n\nThen block Zani and stepmom (for all time lol) and do same with dad temporarily if he tries to keep taking about it. Dad might stop talking about it if you set your boundaries and follow through with temp NC each time he tries to bring it up.  \n\nUnder no circumstances allow Zani anywhere near you.  It will ruin your life and sadly you are the only one who cares about your life right now.  NTA", "Seems like there are two addicts in the family. Mia and Zani. I'd keep NC with your family. Your dad is a spineless wimp when it comes to those that are not his actual blood. Cut your losses OP, you'll be much happier.", "NTA. Plain and simple.", "NTA, and stand your ground. Do not let them in or you'll never get rid of them, and it's a time to be riddled with more of the same: stealing, drugs, etc.\n\nThis is not your responsibility whatsoever.", "NTA. There is no way I would say yes to this situation. Not one part of this is your responsibility   Stay firm.  Especially given the addict angle.", "LOL NTA, if Zani ever sets foot across your threshhold she'll never leave. NC now, and consider a restraining order if she shows up uninvited and tries to get in - because that's totally going to happen. Zani is also likely to abandon her child at some point and they will try to foist that off on you. Honestly it could help if you don't think of them as parents. As in, you don't have \"parents\" - you have one remaining parent, your weak dad, and his user/abuser wife. Because you were abused, whether you want to think of it that way or not. Don't cling to these vestiges of family. I'd block them and make a better family for yourself, can consider moving away if you can.", "NTA\n\nShe’s being very presumptuous and the “that’s what family does” excuse seems to only be valid when it benefits her.", "NTA. Good for you OP, enjoy your life free from your toxic father and his new wife and her daughter.", "NTA\nKeep it up!", "NTA. Why won't your father and Mia take her in? If Zani really needed a place to stay, she would ask you directly. Don't let your MIL guilt you into this. This is your own life and you can choose to live it your way.", "NTA. You shouldn't be expected to take in your addiction stepsister and her child. That wouldn't be safe for you because drugs aren't the only things addicts steal.\n\nYou also don't need to come home to find that she od'd. You have no obligation to house these people with whom you have no relationship.", "NTA. She wants you to let an addict and known thief into your home? Hilarious. She’s the mother. Her addict daughter is not your problem.", "NTA. Yeah stay away from that crazy train. You know what would happen she gets full blown into her addiction and you'd be taking care of a baby. And you know grandma's not going to take the child. They obviously don't want her in their house with that baby and addiction. they want her out and they want to make her your problem and get their life back. So I really hope they don't have your address cuz I expect she's going to show up on your doorstep. If she does don't open the door and don't let her in. And let your building management know that she is not to be let into your apartment because you do want don't want anything to do with her.\n\nOh yeah grandma could lock up her prescriptions to make sure her own daughter didn't steal them. Or keep them on her at all times so daughter can't get them and baby can't get them.", "NTA nope nope nope and nope.", "NTA.  Mia can take the baby in only and make her daughter go into a long term\naddictions program.  That’s her kid and grand kid and thus her problem and not yours.", "NTA. And quite frankly, NOT YOUR PROBLEM!  \nMia and Zani need to figure that one out on their own. Simple as that.", "To hell with the step golden child and your parents. Where was the equal treatment for you as a child? It’s not your fault your step sister is a loser. Do not, in any way, help that girl. She’ll rob you blind and stick you with her child. I hope you haven’t given your folks your address because they may send her doors up ass to you. Stand your ground. Everything you have you worked hard for. Your parents just want to be rid of her.", "NtA", "NTA. Your home. Your rules.", "NTA, but even so, I would want to make sure the baby is housed.", "Not the asshole. Protect your space. You are not obligated to support her or her child at 100% to you. If she needs a home she can stay with Mia who is a grandparent. But sounds like Zani need to get herself some help.", "Tell your dad that junkie thief stole your precious engagement ring! He needs to know what kind of people he has around him! How do you know that Mia and the bizzare junkie thief stepdaughter aren't robbing your Dad? Don't let this come from you. Get a cousin or someone tell your Dad! UK 🇬🇧", "nta always feel bad for saying NTA on these when there is a baby/kid involved but it’s understandable why you don’t want to. parents should take her in or give her money for a place", "Don’t do it once she gets her foot in the door you’ll have an instant family to take care of, Zani can find her own place to live. I don’t think you want a repeat of your childhood this time taking care of Zani and her child and possible the father. Live your own life it’s time.", "NTA\n\nYou worked hard to graduate college and get a great job!\n\nYou don't need your entitled step-sister ruining that.  Having a baby in your house KILLS your concentration.  you won't be able to do a good job at work with a baby in the house.  It's why EU countries give months to a year of paid parental leave.\n\nZani is a thief.    Zani doesn't get to steal your safe space from you.\n\nDo NOT give your parents a code/key to your place.    If they visit the city, they can rent a hotel room and you can see them for dinner at a restaurant.   I don't recommend having them over to your place for a few years -- at least.", "NTA. Mia would be an AH expecting you to take in Zani as a houseguest and help look after the baby; she is many, many times the AH expecting you to take in an addict since she is not willing to do so. How awfully sad for her, and Zani, but it is not your problem. \n\nShe doesn't get to play favourites for decades and now expect you to do giant favours because 'family'.", "You don’t need to have an addict in your place either", "NTA. the drug excuse is silly. it sounds like the zani situation is unmanageable for mia, which is very sad and im sorry for her but it doesnt give her the right to offload that responsibility on to you", "NTA, the child and her mom are your responsibility. If you let them move in it will just mess your life up and you will never get them out. Let your parents figure something out for their daughter and grandchild. I wouldn’t even let them know where you live or let them visit. One day you’ll come home and her and the kid will just be there and you will be stuck. Please don’t let them push you into this, you’ve worked hard and deserve your life and freedom.", "NTA.   Not your child. Not your responsibility to watch.", "I think you're NTA.  You're in college and need to attend class and study.  How would you have room for an adult and a baby and whyever would you want to take care of said baby that is not yours?  Particularly since you're not close to the mom, you didn't even know she had a baby!  Why can't they stay with Mia?", "NTA\n\nIt wouldn't have been \"a few days\"", "Few things I learned about housing addicts are addicts are persistent in looking for drugs; it’s difficult to change their behaviors; and it’s extremely difficult to get rid of them. I feel sorry for the baby but whatever happens to Zani and her baby isn’t OP’s problems. OP also needs to focus on establishing her life as well. So NTA and don’t feel guilty for their manipulative tactics!", "NTAH", "NTA.  Even if she was your 100% biological sister you would not be obligated to take her in & care for her child.", "Not your circus, not your monkeys.\nNTA.", "NTA, cut all contact with your toxic family, try to make new bonds with positive people on your community.", "NTA \n\nYour families excuses for not taking her, but pushing her on you are weak. They just don’t want to deal with her, but they also want their conscious clean. So they’re bullying you into giving them that without them actually doing anything. You don’t owe her a place to live, you don’t owe her your material items (that she’ll inevitably steal), you don’t owe her free childcare, you don’t owe her an easy life. \n\nHer problems are self created; you’ve busted your ass despite all of the emotional neglect, and favoritism. You’ve worked your ass off to get where you are just for her to come a benefit off your labor while giving you nothing in return but headaches. Don’t do it, if they care so much they should accept their own platitudes and “do what family does” and help her. They don’t get to give you shit for not doing what they themselves won’t. Especially when they’re the ones that have a responsibility to help her (your parents). \n\nEven your sister doesnt owe her, but considering they have a closer relationship.. if any sibling had any responsibility to zani it’s mia. I’d send a mass text and tell them all that your decisions been made; that all them harassing you into changing you mind is going to do, is cause them to lose all contact with you entirely. Then don’t respond, not until they bring up normal topics again. If they try to spark up normal conversation, then change the subject back to her..stop responding and put them on DND/or block them. Do this until they get the point. \n\nP.S. You’re smart to set boundaries, but you need to enforce them too. Also as a former addict you don’t know what danger you’d be putting yourself in either. Fuck the stealing, lying, and disappearing & leaving you with the baby. Addicts will always finesse dealers to let them borrow drugs they can’t pay back it’s an inevitable thing and it’s dangerous for you to be around. More so because you’re a woman.", "NTA can you look into housing for her? Is there sober housing in the country your in? Can you put the leg work in and find her place with only paying a minimal amount? I think that’s a good compromise. I would pay a deposit on a place and maybe the first month. Then help her search for jobs at her new place. Might show her some free online places to learn some skills.", "Agreeded! Atp instead of LC with family OP needs to go NC with family! Enjoy your life OP and focus on you. There's no point in continuing to water fake flowers.", "Honestly, that baby needs to be removed from Zani until she has both housing and sobriety for a long period of time. Mia should take her grandchild in, get a combo safe for her medication and jewelry for when Zani visits for supervised visitation with her baby, and make a plan with short term goals and long term goals. Mia is responsible for her daughter because her parenting is partially to blame for the person Zani has become. If she can’t take responsibility for her grand baby, they need to find a safe and stable home for this innocent child.\n\nDoes this country have a foster care system? Do they have sober living facilities(which can suck but are an option if available)? Is Zani actively using drugs, especially because she is going through consequences to her infidelity so she’s higher risk to relapse?\n\nOP, you do not have to do anything. It’s not your responsibility. Family favors is things like a ride to the airport, emergency babysitting, or watering plants while they’re on vacation. Housing an addict with an infant is not a familial favor.", "This should be the number 1 comment. Nicely stated", "Everything you have and are are strictly the result of your hard work with no help from them.  You don’t owe a single one of them anything..  live your life the best you can and cut them all out of your life.\nNTA", "Her tongue should have fallen off", "There was a story on the news years ago about a maid they couldn’t evict because of that!", "Either way. Not your problem. Mia wants to foist her addict thief and grandbaby (probably special needs to because addict moms often  have addicted babies with a plethora of health and develop issues) on yiu because she doesn't want to deal with them. Benzos an excuse. She could keep her meds on her at all times . she could keep them securely locked up. She is choosing not to because she doesn't want Z or the baby in her home either", "Stealing is bad, but I would worry more about Zani running off and leaving you to take care of the baby for the next 18 years.", "So she’s ok with her stealing your stuff?", "And please keep her out. Your father and Mia spoilt her now they can deal with it. Mia could get a safe for her\nMeds they just don’t want\nHer now", "NTA keep her far away from your place and anything you have", "You have really valid reasons for not wanting contact with your step-sister. Did you register a police report for the theft of your ring? I’ve be seriously considering getting security cameras that you can view any time for your apartment, and a ‘ring’ style doorbell so you know who is at the door. I think I’d also speak with police about feeling at risk of Zali breaking into your home and what your rights are. Be well prepared.", "Probably needed the validation. Even when you know that you're right a lifetime of conditioning whispers doubt in your head.", "Sorry, Zani.", "She may not even know who the baby’s daddy is.", "True. Good reminder.", "100% agreed, when I said “she needs a lockbox,” I was referring to Zani’s mom. None of this is on OP.", "NTA.", "NTA.", "NTA. you really need to put the edit in the beginning. Straight no.", "I am sorry for what you went thru growing up.  It is a great accomplishment what you have achieved so far.  You are correct to stay Low Contact/No Contact. Your stepmother should take in the grandchild and take Zani to rehab. They are NOT your problem (they have caused enough issues in your life). You are correct to protect yourself.", "NTA. Tell mom to lock her benzos up. That is a weak excuse not to let your child live with you. It sounds like mom doesn’t want anything to do with her and is more upset that she can’t pawn her off in someone else.", "A gun safe with fingerprints lock would solve the drug issue for about 100$.", "Nta. No is a complited answer …", "Your story is difficult to read.  Portions of sentences are missing.\n\nPlease edit it to make it more legible.", "NTA: doesn’t even matter if you two got along well. The stealing, addictive behavior, and babysitting is enough for a “No.”", "NTA! You do not want Zani to stay with you if she is an addict! Mia has some nerve!", "NTA\n\nMia can hide her benzos, her jewelry and everything else. \n\nGet a door camera", "Sounds like none of these people bring you joy. NTA, go NC permanently and find your new family.", "NTA and do not under any circumstance allow them to stay in your place. If it was me, they would never even set foot there. If there is security in the building, make sure they are aware.", "First things first. Change your language as it is making you feel guilty.\n\n**You did not leave anybody in any condition whatsoever**. By *their* actions, they have worked themselves into a position that you have no responsibility for.", "Nta. Mia can take her in,she just doesnt want to give up the pills. She could also put them in a locked safe. She could pay for an apartment or better yet, for rehab.  Taking an addict & baby into your home is a huge deal. What happens when baby gets ahold of whatever she has? Or she gets hurt? It happens. Every single day.", "Well done for doing so well for yourself even without their support. Zani is not your problem (and not your sister either),  Mia is just trying to dump her problems on you. Don't let them. NTA", "NTA   If they came, for even one night, you would have hell getting rid of them. You would be paying for everything, Zani would probably disappear constantly leaving you with the baby and making it impossible for you to get to work. Addicts let other addicts come over, so you would have to worry about your apartment and your belongings every time you left the house. She has no where else to go, so her and your parents would fight to keep her there indefinitely. You deserve to be happy. You earned this. You survived losing your mom, a blended family, college and now your working. Enjoy your life. You don’t need the burden of an addict and a baby.", "Not all addicts steal but I agree in this case Zani probably would and I agree she wouldn’t look after the baby and would leave it to OP.", "You of course have the right to accept or not accept whomever you wish into your home, but not wanting a thief to be staying there is especially never A H behavior. NTA.", "NTA. If Mia doesn’t trust her, then why subject you to her? Tell Mia to lock up her benzos and take her in.", "you would have to be such a addict.. if your addicted to benzos you have a script. benzo withdrawal can be fatal. and its not common to be chemically depndent on this without being perscribed.\n\nand as a opioid addict on a script. no1 is getting my pills. there is no unattended time\n\nthis is like the worst excuse i've ever heard ."]}