{"id": 27992, "submission_id": "16wsuc4", "title": "AITA for refusing to spar with somebody because it’s a girl?", "selftext": "[removed]", "created_utc": 1696138710, "permalink": "/r/AmItheAsshole/comments/16wsuc4/aita_for_refusing_to_spar_with_somebody_because/", "score": 101, "replies": ["NTA\n\nI actually don't blame her for asking, as I have been in martial arts classes populated with guys who actually were too sexist to partner with women at all. But she should have accepted your explanation once given.", "Reminded me of this [post](https://reddit.com/r/AmItheAsshole/s/0wGkWv2cg7) from 2y ago.", "NTA\n\nYou were clear about your boundaries, and your choice is in no way negatively impacting this woman's ability to participate in the activity. 'No thanks' is more than enough in the first place, and I can't imagine having the audacity to confront a stranger in public over that.", "Didn't we already have this exact scenario a few months ago?", "NTA, report this to the instructor. This girls clearly doesn't understand what \"sexism\" means. Feminine empowerment doesn't mean women should always get their way even when someone has a perfectly valid reason to not acquiesce to their demands. Her ignorance and sense of entitlement doesn't trump your desire to have a safe place to train.", "NTA\n\nKeep away from her. At the very most charitable, she's ableist and doesn't believe in psychological trauma, at the very worst she may very well be the sexist one in the room, and believes as a man your trauma isn't legitimate or you should just stuff it down and let her have what she wants out of you. Either way, not a good look, and not someone you want to interact with lest she create drama.", "NTA: It's not that you have some kind of sexist idea that girls can't fight or something - you have trauma and a boundary you expressed respectfully.   \n\n\nIf someone doesn't want to fight with you... stop pushing (in a street fight, in a verbal fight, in a martial arts studio... just in general).", "NTA\n\nInitially I wasn’t on your side but that’s actually a completely valid reason for not wanting to spar with a woman. Tell the instructor that you are having an issue with this student.", "NTA at all. End of discussion.", "NTA..  think she just wants to make a drama of it instead of just accepting your explanation and moving on...", "NTA.\n\nyou are within your right to choose who you want to spar with. you had already mentioned that to your instructor as well. dont bother about girl. she is just being judgemental and throwing around words like sexist rather than actually being sensitive towards your trauma.", "NTA. You explained to her that you have past trauma, and she, being TA, made the leap to you being sexist. That's not your fault.", "No.  NTA.  Trauma is a real thing.  I hope your therapy gets you the help you need.", "NTA but from the sounds of it you should have been!", "NTA- YOU explained it- SHE just didn't want to accept the reason, so went to the standby of being sexist.", "Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I declined to spar with a girl because I have trauma about touching women. This might make me TA because the girl I declined to spar with thinks I’m sexist\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Unfortunately some women don't know how to listen. It's often always about their feelings. If you don't conform you are sexist.. misogynistic and all the other buzz words. You are not in the wrong here. Don't let anyone tell you any different.", "SHE. she's a girl.\n\nother then that, NTA", "You want to get over the fear and therapy isn't working. Sometimes you have to face it to conquer it and she is your chance. Unless you're afraid she'll beat you.", "Give her what she wants and don't hold back", "NTA.\n\nBe aware though: Even if your intentions may not be sexist, the effect it has **is**: You're choosing to spar of not spar with someone based on no other factor than their sex. So NTA, but you are being sexist here, even if not by choice.", "NTA-not sure how you would think otherwise, are you gonna traumatize yourself?\n\nBut she probably genuinely doesn't believe you, I've never heard of anything like this, so kinda N-A-H.\n\n(HI-YAA! hehe)", "Info. What is the trauma?", "Just one question; What is this trauma?Otherwise, NTA. She should respect your boundaries, as you respect hers.", "[removed]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI train in a martial art, have been doing so for 4 years now. Recently I’ve moved across the country for college, and have been on the lookout for a new place to train. I found one that seemed promising, and went in for a trial class.\n\nFor reference, I have some trauma in the past that makes me uncomfortable touching women. I am in therapy for it, but that’s not an instant cure, so that problem persists even though I’ve made good progress in other aspects. \n\nAt my old gym this was understood and respected by everybody, and I hoped the same would be true here. I told the instructor beforehand and he was okay with it. When it came time for sparring, a girl asked if I wanted to spar with her. I politely said no and found another partner.\n\nAfter class she walked up to me and asked why I didn’t spar with her, so I just explained I had some trauma about touching women. She got angry and said that I was being sexist and an AH. \n\nAm I in the wrong here?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA", "NTA in the slightest, but she is for not accepting your answer", "Before I read the entire story I was like yes yatah, but no your not. Literally the only reasonable non offensive reason for not sparing with her. \n\nShe can be disappointed or upset at the situation but your NTA", "NTA. You don't need an excuse to not spar with anybody.", "NTA and good on you for breaking the stigma of men not going to therapy and working on yourself!", "NTA at all, but  you shouldn't have to explain that you're dealing with trauma to anybody. \n\nThis girl is not entitled to know your private details, she's not owed an explanation. When it comes to close physical contact, you can choose to spar or not spar with anybody for any reason. \n\nYou have valid reasons, it's not sexist. You should complain about her to the instructor.", " NTA. There is a difference between sexism and trauma. She overreacted.", "No, she is.", "NTA - but at the same time not everyone is gonna understand your trauma or care (harsh but true). She was wrong and as and I hope the others understand and treat you w respect.", "Yes period", "Exactly, it’s ridiculous she expects me to set aside actual trauma for her convenience", "How is it sexist to not want to partner with women", "This is a common post, I've read similar before and definitely haven't been on reddit 2 years.", "No is a complete sentence is one of my favorite things to say in situations like this.  I can see why she might be curious and even think sexism as a gut reaction, but a simple \"I'm not comfortable with it\" should be more than enough.", "Will do so", "He has trauma surrounding touching women idk how your comment would solve anything", ">Even if your intentions may not be sexist, the effect it has is\n\nNonsense, if OP were a woman, you would be backing them.", "I think intention matters here too", "Sure, if you look at the definition of sexism in its most barebones face-value way. But unfortunately people don’t tend to lack critical thinking all too much, surprisingly.", "You’ve never heard of somebody being uncomfortable with touch due to trauma?", "How does knowing what the trauma have anything to do with judgement? No one deserves information on what another persons trauma is. If they didn’t feel comfortable enough to put that in the post then that’s Ops decision.", "I’m not comfortable disclosing that, sorry", "No one is the asshole for having PTSD or being a survivor.", "Are you dumb?", "Kinda curious about this.  \n\n\nI trained in an MMA gym for a while.  I'm 135 lbs and this was back when MMA wasn't quite as mainstream.  And there weren't any comparable sized men in my classes.  So I would either grapple with larger men and get ragdolled and not learn anything or get paired with women.  It wasn't' a sexual thing and I certainly had all the respect in the world for the abilities of these women (who were all advanced compared to me), but I simply didn't enjoy it.  It was hard for me to do things like pin a woman to the ground and try to choke her.  And that pause/mental block while grappling with people without those inhibitions made it dangerous for me.", "It's kind of mind-blowing that you gave her what might be the only good and non-sexist reason I can think of and she just... kept going.", "Turn that thought around. It's ridiculus for her to have to deal with YOUR trauma in a public place.", "Say it again, but slowly", "Explain to me why you don't want to, without being sexist, for any reason other than trauma.", "Sorry for the hate you’re getting, I’m with you. I simply don’t want to hit women, even within the context of sparring. Not sexist at all. Don’t judge people who are comfortable with it, just don’t feel comfortable with it personally.", "[deleted]", "I’d absolutely be backing them, but also be calling them sexist, because they are too. Unless they don’t want to spar with men who are much stronger than they are but are good with sparring with men who are on the same level of strength, obviously, because then it’s not about sex.\nEDIT: And as you can see, I'm also backing OP here, I said he's NTA.", "That's why I'm saying you're not an AH, but your actions are sexist.", "With being touched yeah, not with touching.  I realized I'm a dumbass and this doesn't make any sense in the context of a spar.  Anyways.", "With touch yes, with a specific sex? On here I have heard it a few times. I would probably be surprised but respectful irl but I also have some strange triggers. Someone who hasn’t experienced those things probably wouldn’t think about that.", "You shouldn't have to. I don't see how it's even relevant. You share what you want, you don't owe anyone an explanation about that. But *she, not it.", "It sucks when people ask questions they really don't want the answer to, they just want to have a go", "this might be the dumbest fuck comment I have read on here  \ni wish we still had awards on here and there was one for dumbest fucking shit because your profile would be full of em  \n\n\nshe isnt dealing with his trauma, it is not effecting her in any other shape or form than her not sparring with one specific person. that does not impact her lesson or her training as there is a whole fucking class full of people she can spar with but she wants to throw a BF about the ONE single person she can't spar with?  \n\n\nshe's not dealing with jack fucking shit other than being an asshole and this comment is so far beyond out of fucking touch I can't even", "[removed]", "username checks out", "What if I’m in a relationship? I’m not about to be dry humping a woman in her guard and getting an involuntary boner from contact because I’m forced to partner up with someone", "It depends on the reason why? \n\n Being devil’s advocate, is it not a lack of equality that you wouldn’t spar with a woman but you would a man. That’s not equal treatment. Or do you not see them as a worthy opponents? Why wouldn’t you spar them? \n\nAnd for what it’s worth, I’m a black belt in karate and I’ve sparred with lots of women. You usually aren’t trying to knock them out, just find a gap in their guard and make contact. You aren’t aiming to hurt, it’s not the same as hitting someone in anger.", "Don’t be sorry it’s one of those silly only on Reddit type things. In this case I’m referring to jui jitsu where you are literally in somebody’s guard missionary style. Men frequently get involuntary erections from the contact and people in here who have no real world experience do not understand that it’s uncomfortable and embarrassing for both people. It is a huge problem with the teens and for people to say you are sexualizing woman for an involuntary act is the same as saying a woman enjoyed the act of getting raped because she was wet. Sexual arousal is involuntary and everyone screaming sexist for not wanting to put yourself in such a situation is a keyboard virtue signaling warrior.", "What if he was raped by a woman. What if op is smaller than your average male? Like wtf womens trauma is respected but mens trauma is…. Sexist ok got it", ">And as you can see, I'm also backing OP here, I said he's NTA.\n\nNice try at having your cake and eating it too.", "You don’t know what sexism means. It’s based on feelings of superiority towards the other sex", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "> without being sexist", "Oh look it’s the sexism!!! And treating women as only sexual objects. Thank you for proving the point.", "You'd get aroused from a sparring session with a woman? But not a man? Dude are you sexualizing women fighting and training?\n\nSo not just sexist, but also predatory.", "if you only get involuntary boners when sparring with women, its not just \"from the contact\" its because you are sexualizing the act of sparring with a woman.", "It's a simple reality that someone can do something that is sexist - as in, it's discriminating people based on their sex - without being an asshole.", "I know, right!?", "how is he treating them like objects if its involuntary? if anything hes refraining from that by not sparring with them", "if hes straight then yeah it would be from a woman and not a man lmao", "You should definitely put your name down for the \"mental gymnastics\" event at the Olympics.", "If you can't spar with a woman without dry humping them you are an oversexed sexist.\n\nSparring isn't a sexual act.", "Sure thing, I'll sign you up for \"content-related responses without devolving into personal attacks\" while I'm at it.", "i dont think he meant actual dry humping them, he meant the sparring leads to a lot of contact which causes involuntary things, which he doesnt like, which isnt sexist", "Then they shouldn't spar with guys either, lots of contact there too right? Oh yeah, its because they view women as something that turns them on, and the touch of a women, even in sport, is enough to make them horny.", "its more of a personal thing to the guy than something that can be said about all guys. why do you think hes objectifying women when its literally something that he isnt able to control. its involuntary. he doesnt wanna do it so he doesnt wanna do it, its not sexist"]}