{"id": 27991, "submission_id": "16wyyfv", "title": "AITA for suggesting to my friend that she should shave?", "selftext": "My (29f) friend, let’s call her Emily (32f) is an amazing person - she’s fun, adventurous, intelligent, super active, a fantastic cook, outgoing and just a great girl to be around. A few years ago she decided not to shave anymore (legs, armpits, female areas) out of protest to the patriarchy, resulting in her having very long dark hair everywhere. \n\nA few days ago, we were having a beer and she told me how sad her dating life was, that she kept meeting guys and having very fun dates but never got a call back or when she tried asking for a second or third date, got rejected in a very generic manner. Now after telling her “you’re so gorgeous and wonderful, the right man will come don’t worry” multiple times, I decided to go out on a limb and said something along the lines of “I know this is a very superficial thing to say, but do you think it might help a little if you would shave?“ \n\nShe was very taken aback and told me she was disappointed I would suggest she change her appearance for men and that I was the reason so many women were suppressed. I immediately apologized but the evening was pretty much ruined. I texted her the next day apologizing again for hurting her but she hasn’t replied.\n\nI really did not want to hurt her but I also don’t quite see how my comment was that bad so I am not sure how to phrase my apology. So decided to take it here and ask people here how big of an AH I am.", "created_utc": 1696160522, "permalink": "/r/AmItheAsshole/comments/16wyyfv/aita_for_suggesting_to_my_friend_that_she_should/", "score": 5897, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) I suggested to my friend that shaving her body hair might help her dating life.\n\n2) In doing so, I criticized her appearance, which hurt her feelings.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. Way to internalise misogyny.", "YTA she doesn’t need to shave if she doesn’t want to. Plenty of men don’t care. Dating just sucks no matter what. You should’ve been supportive.", "NTA. If she doesn’t want to shave that’s cool but you gave her an honest opinion. That’s a real friend. Some of these responses are unhinged. Don’t take them personally.", "NTA\n\nShe needs to know the reason why she is not getting 2nd dates.", "YTA. If she doesn’t want to be judged by men or society for shaving why should she start shaving for men and society? She wasn’t asking for advice from the sound of it, just seeking support. In the future ask someone if they want your input before providing unsolicited advice against their values.", "She can either stand against the patriarchy by rejecting conventional beauty and grooming standards \n\nOr she can appeal to men by adhering to conventional beauty and grooming standards\n\nShe lacks self awareness. She wasn’t lamenting a lack of open minded men she was acting confused as to why everyday conventional men aren’t pursuing a visibly non conventional woman. NTA but the truth hurts.", "NTA, you had good intentions and you're not wrong. A lot of guys would be turned off by that. I would suggest that you tell her to look for a different kind of guy. Like guys at climbing gyms are much less likely to be turned off by body hair for example. There are plenty of guys who don't care or even like the unshaved look. She will find someone (if that is indeed why she's not getting to date 3.)", "NTA | You gave her advice, good advice tbh, pubic hair is one thing, but letting the forest reclaim the ENTIRE land is a deal breaker for most men ( and women ).", "She is. She heard something that she knew was true but didn't want to hear. You were trying to be a good friend by letting her know why guys weren't interested. Double down on your statement. Explain you weren't trying to be mean just  honest. She should want an honest friend not one that tells h her what she wants to hear.  That's not a real friend", "Yes, YTA and she's right.", "NTA.\nI don't have a strong opinion on it, but we know lots of people do.\nSo it becomes a numbers game.\nIf you as a friend can't give an inconvenient truth or ask a sensitive and though question, who can?", "NTA. If her choice is that important to her, she should have prepared herself that dating might be tougher. Not trying to my an AH myself. That’s just reality", "YTA\n\nI think you’re going to get some angry responses because a lot of people in this subreddit assume everyone posting is a man so of course you’re going to be accused of supporting the patriarchy.\n\nI think you’re probably right that some of the guys she has gone out with are put off by her body hair. However, she likely doesn’t want the kind of guy who would see body hair as a dealbreaker. She also didn’t ask for your advice. It sounds like she was just venting. Let your friends vent and just listen. You don’t have to offer advice. You can just offer support.", "YTA but you're also right.", "YTA not shaving is a value statement. She is looking for a partner in life that has the same values. By telling her to shave you are telling her to change her values just to get a man. Instead of saying “don’t worry you will find the right man”, why not say “it’s better that these wrong men are screened out than be with one of them that doesn’t value the same things you do. Now that would be miserable compromising your values”. Being single is not the end of the world.\n\nEdit: Typos corrected and grammar improved for clarity\n\nEdit to add: Not shaving is a value statement for OPs friend as per OP her friend stopped shaving to stand up to the patriarchy. Not shaving is not a value statement for all those that do not shave.", "YTA. It sounds like she was just venting, and wasn’t really asking for advice. She has already made it clear that she doesn’t believe in changing her appearance to please men, so your advice was just not helpful.", "NTA, you said it in a kind way and you only wanted to help her. She deserves to be a little upset that your rasling her to change, but it was only meant as a suggestion to help", "Yta. Typical response from aholes when women don't alter their appearance to please men.  Go back to the 1940s where you belong. You are an idiot.  How could your friend be attracted to a man who would only date her if she shaved her legs.  I could understand how someone like you would like this type of man.  Your exfriend is lucky to have seen your true personality and dropped you.  Now leave her alone and crawl back under your rock.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (29f) friend, let’s call her Emily (32f) is an amazing person - she’s fun, adventurous, intelligent, super active, a fantastic cook, outgoing and just a great girl to be around. A few years ago she decided not to shave anymore (legs, armpits, female areas) out of protest to the patriarchy, resulting in her having very long dark hair everywhere. \n\nA few days ago, we were having a beer and she told me how sad her dating life was, that she kept meeting guys and having very fun dates but never got a call back or when she tried asking for a second or third date, got rejected in a very generic manner. Now after telling her “you’re so gorgeous and wonderful, the right man will come don’t worry” multiple times, I decided to go out on a limb and said something along the lines of “I know this is a very superficial thing to say, but do you think it might help a little if you would shave?“ \n\nShe was very taken aback and told me she was disappointed I would suggest she change her appearance for men and that I was the reason so many women were suppressed. I immediately apologized but the evening was pretty much ruined. I texted her the next day apologizing again for hurting her but she hasn’t replied.\n\nI really did not want to hurt her but I also don’t quite see how my comment was that bad so I am not sure how to phrase my apology. So decided to take it here and ask people here how big of an AH I am.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Do you think she wasn’t aware that she hadn’t been shaving, that you felt the need to point out to her something she had consciously decided to stop doing due to her beliefs? Do you think she had forgotten? Or do you just think she’s not very clever like? \n\nYTA.", "Good friends do that and make suggestions.  I don’t think you are AH.", "NTA. Physical appearance and attraction are a  core part of dating. If she's not willing to work on hers in any way, especially one that is easily fixable, she can't fault men for their complete lack of attraction to her.", "Is your friend having sex with these men on the first, second, or third date? If not, then how would they know she does not shave? \n\nYour friend may come across as anti male or too progressive for a lot of men's taste. That might be the problem. And her question of not wanting to make herself attractive to men is maybe why she is not attracting men.", "You're not the asshole. She is going to have a hell of a time finding a man who wants to run his hands up or down a pair of hairy legs. If men wanted to do that we could do it to ourselves.\n\nShe can't have one with the other, unless she finds that very specific man.", "[removed]", "YTA. she didnt ask, and the \"right man\" will not GAF if she shaves.", "YTA. If she meets her mr right he won’t care if she shaves. Shaving might help ger get second dates but it won’t help her find the right guy for her. \n\nWhat I tell people I know who are struggling is you don’t need every potential partner to like you. You just need to find ONE. And that can be hard but it’s not impossible not matter how “niche” you might be. \n\nIt doesn’t sound like she asked you why she isn’t getting second dates nor what she can do differently. No one likes unsolicited advice.", "NTA, she asked and you tried to help. Her wokeness is her undoing tbh......", "what is happening on a first date that allows the man to know about her shaving habits? Legs, armpits, etc, are not visibly obvious", "I would hate so much having friend like Emily, if you can't be honest with your friends what even is the point?\n\nI'll get downvoted for this but it looks insanely dramatic ngl, she asked multiple times and you did the kindness to answer honestly despite the backlash you knew might happen (with your \"I know it sounds superficial\", it is but, appearance matter so much in this dating world, I would know).", "YTA \n\nI have leg and arm hair, and I am in a loving relationship with a man who is holding me as he's sleeping. If I would have listened to you, I would have been making myself uncomfortable for someone who doesnt care one way or another. \n\nA more supportive thing to say would have been: \"you'll find someone perfect for you, just keep working on yourself and the rest will fall into place.\" She definitely wasn't asking for advice, just wanted some emotional support from a friend. The world tries to pressure women into conforming to shaving, and I'm sure it hurt to hear a friend also try to do the same.", "NTA\n\nYou just suggested the reason she may be having problems with dating.\n\nYou are also probably correct. Of course she is free to do whatever she wants with her body and they may not meet others preferences, which means they may not want to date her.\n\nThis may mean they miss out on a great person for superficial reasons but that is a choice they are free to make.", "NTA - you didn't say it's gross or something. You just said that it might help her, yeah. Cause most man doesn't like body hair, you can be angry, that's a fact.", "NTA. However, can I ask how her hygiene is? Or if she knows proper trimming/grooming?\n\nMy sister stinks of BO if her armpit hair grows out too long despite the amount of deodorant that she puts on. But, strangely, she doesn't smell it herself. It got to a point where she and her bf fought because she refused to shower before bed and her bf gagged because of how she smelled.", "NTA she was lamenting about why she doesn't get a second date. You gave her the honest reason.  You didn't go about it rudely or mean.  You basically worded it in a question form. As in do you think that this is the reason? \n\nIt's on her if she wants to change but it seems obvious that she doesn't. She needs to accept that most men don't want to date a hairy female.  Not saying all men are like that but a big majority are.\n\n And instead of wasting her time and theirs. She should make it known thst she refuses to shave because she is fighting against the patriarchy.\nThst way she cuts out getting the generic not going to happen spiel.", "YTA... if body hair is a deal breaker for a man, it's not going to be a guy she would want to be with. You wouldn't tell a friend to lose weight too \"get a man\", so any variation of those is AH - wear makeup, shave, wear less makeup, wear different clothes, not those clothes the other ones....\n\nPeople are entitled to their preferences - liking a beard on a guy, long hair, short hair, whatever. That is fine and not what is being judged here.", "NTA- But I think her sour personailty may have just as much to donwoth rejection as hwr hairy armpits.", "YTA and she seems to have listed the reasons for you. What she does or does not do to her own body is her own decision. You shouldn't have provided unsolicited advice that was ignorant and sexist, when it seems all she was doing was venting to her friend. This happens to women all the time, where people just constantly tell them what's best for them and that experience is probably what's making the hurt worse for her. Apologize profusely.", "NAH.\n\nIt really depends on the tone etc in how you delivered it.\n\nIf its is as you described, not the asshole for pointing out the mammoth (hairy elephant.lol) in the room.\n\nI don't think you were an asshole, but I don't think she is either, she may be nieve or in denial, but not an asshole", "NTA:  Do women fix their hair for a date, put on make-up, make some effort relative to what they're going to wear...and why?  So as to appear attractive to the other person.  If you want to make a stand for feminism on the whole shaving thing then that's your prerogative...just acknowledge the consequences.", "NTA. I think you did what any good friend would do and told her the truth.\n\nThe reality is that there are very few people that are ok with total body hair growth and absolutely no grooming in that regard. Of course, there are also men that expect absolute perfection with body hair and don’t hold themselves to the same standard, and those are the assholes that should definitely be avoided. But the vast majority of people are in a reasonable middle ground. She’s really limiting her options by taking this to such an extreme.\n\nAnd to be fair, yes women’s standards are much higher and a bit ridiculous, but it’s not like most women would find a man who didn’t groom his beard attractive. Along with ear, nose and other potential body hair in odd places.\n\nPersonally, I also expect my husband to keep his lower area and pit hair trimmed because I find that much cleaner and more attractive. I do the same for him on myself and I also help him with his beard strays, shoulder strays, nose, brows, and ears.\n\nManaging body hair is a pretty normal expectation for both genders. We deal with more as women, of course, but it’s not like men don’t have hair to manage either.", "NAH. You delivered the message in a kind manner. She’s going to have a tough time finding a man that likes hairy women and wants to take down the patriarchy. Most men do things they otherwise may not do to be found attractive by women. That’s just how dating works.", "Soft YTA. You could have raised the point that maybe some men are rejecting her because she doesn’t shave without suggesting that she _should_ shave. Any man who would reject her for this reason is not likely to be a good match for her anyway.", "NTA \n\n\nEvery choice we make in life has consequences. She has made a choice that works for her and this is the consequence.", "NTA. I think it depends on how you said that to her, whether it was in a sarcastic way or if you said it kindly. But, she was wondering why she wasn't getting dates and her body hair could be a very large part of it. I think that it wasn't wrong of you to point that out to her because as a friend, you're trying to help her improve her dating life. You're not wrong for pointing out something that could be stopping guys from asking her out!", "Info: did she ask for advice or was she just venting?", "YTA she clearly does not want to find a man who is bothered by body hair and wants her to change it to fit misogynistic societal expectations. \n\n\"why don't you just alter your appearance in a way you don't want to attract men you don't share values with\" is bad advice. It's a stupid move, like trying to appeal to people by pretending you like things you really don't (like pretending you are really into fishing or supporting a certain sport you actually detest, to use less politically loaded examples, to try to appeal to more men). Then you are stuck with someone who thinks you like and value something you actually really don't. A relationship based on a lie.", "I’m going with NTA, IF it went down the way you said it did and she was wondering out loud why she couldn’t seem to get past a first date.  Her ego is just bruised because you suggested a possibility to her that she doesn’t want to think is true but in all probability is.  \n\nYou could send her a text (even better, leave her a voicemail) that you fully understand and respect her decision to not shave, to protest the unfair double standards the majority of society expects women to abide by.  THAT BEING SAID, point out that the conditioning of society beauty standards runs deep, and if she’s having problems finding a partner that will be empathetic to that, then maybe it’s just a matter of finding a different route to go when looking for a partner. I would gently suggest that she merely start being more forthcoming about it from the get-go… (perhaps posting it in her dating profile). The men who find that superficiality a deal breaker will weed themselves out, saving them from wasting their time OR hers, and she’ll have a clearer view of who the quality guys are who can look beyond that superficial aspect. I don’t think she’s fishing with the wrong bait; she just needs to fish in the right pond. \n\nGood luck, sister! Hope she’s able to come around and appreciate your input for what it was.", "Yta. This is solely your opinion. Body hair on a female body is beautiful.", "I'm saddened by the number if N-TA here and the lack of reflection on our own socialisation into cultural gender norms. I have read the post twice and no where does it suggest OP's friend linked it to body hair or that OP has surveyed all these dates and found out this is the reason. You made a judgement based on your own prejudices. Maybe your friend is picking the wrong men or is a boring date??\n\nI know many straight women who don't shave (I have never shaved my pubic hair and no man has ever complained nor have they had any issues if I haven't shaved my legs) and they never seem to have trouble attracting a male partner.\n\nyou assumed it's due to not shaving but your're just projecting onto men you don't know prejudices they may or may not have\n\nYTA", "NTA. you said you suggested it, meaning you asked her a question, did she think not shaving might be the reason (given the beauty standards in society). \n\nAs others have pointed out, she can do whatever she wants with her body, and the men have every right to not be attracted to it. \n\nIt sounds like you were trying to be helpful. It's not your fault the beauty standards are what they are.", "YTA.  You're suggesting she change something fundamental about herself to attract a partner.  That's like saying a woman who never wears makeup should always get made up before a date to attract a guy.  It's BS.\n\nAlso, I find it weird to assume that a date is seeing her body hair on the first date.  Unless she's always wearing sleeveless tops and skirts, it's not noticeable.  I don't shave either, and it's really not noticeable most of the time.", "NTA. Some people cannot be saved from themselves.", "NTA. A lot of people of either sex and/or sexual preference don't like bodily hair in abundance. And no one is going to fall in love with your personality on a first, or even third, date. Physical attractiveness is important, but even more important is the impression that you're well groomed not only for your personal liking, but also of the potential partner.   In the case of your friend, there could be some feature that is putting prospective partners off her. I don't say there is, necessarily, of even that it certainly is the body hair. But it is wise to think about it or even adress it with a good friend. Indeed, you'd be a bad friend if you'd never say anything just to be \"nice\".", "NTA", "NTA\n\nTruth hurts. I'm fine with some hairs but long, dark hair everywhere? *shudder*", "Gentle YTA. You were just trying to be helpful, but she’s obviously not interested in someone who wouldn’t love her and the way she presents herself as is. The idea getting rid of her body hair just wasn’t useful. \n\nI’d say n a h except you were telling her she could have more success changing herself to suit male societal expectations, rather than supporting her finding someone who loves her for her. I get that it’s frustrating to listen to her not find someone, but the solution isn’t suggesting she go full Miss Congeniality.", "NTA. “I’m not suggesting you “change your appearance for men.”  I’m pointing out that you’re not entitled to their attention or affection, and that if you’re unhappy with the consequences of your choice, maybe you need to decide what’s more important. Your body, your choice to shave; their bodies, their choices to want to give those bodies to any given person, for any reason.”", "I knew a girl once that had everything going for her. Pretty, smart, great figure.  She couldn’t keep a guy long enough to have a relationship with.  She would wear low cut tops revealing some chest hair. I never brought it up to her and was always curious why she didn’t realize the men she was dating didn’t like seeing that.  It was really the only physical reason I could guess that men didn’t continue to date her. If you’re only dating men that don’t like body hair, your results will be disappointing.", "NAH", "She has the right not to shave, and the men she dates have the right to think it's gross. People are attracted to what they are attracted to. That's just reality. If she wants a man who doesn't mind that she doesn't shave, that will be a much smaller percentage of the male dating pool and it will be more difficult for her to find a partner.\n\nIf she was asking for your advice and you were trying to help her, then **NTA**. Especially because you are likely right and the hair is the reason the men are not staying. I think it's silly that she is mad at you for just stating the obvious truth.\n\n&#x200B;\n\nEditing to add: After thinking about this more, I am thinking that yes, the guys don't like the hair, but the fact that she has it is probably really a symptom of her personality and outlook on life and general opinions, and those things are probably the even bigger turn off for these guys.", "NTA. \n\n\nI would want my friends to tell me the truth I don’t want to hear rather than sugar coat things for me. You did her good by telling her. \n\n\nTbh I associate excess body hair with hygiene. At least armpits and private areas need to be regularly trimmed (not necessarily shaved). We all know that with excess hair bacteria thrive and therefore BO. I (f) would be bothered if my partner (m) would not trim regularly. I don’t even have to ask him, because it comes naturally to him. \n\nI think it could be also that they simply think she has poor hygiene.", "YTA.\n\nDo you think she hadn’t already thought about that? Clearly she has made her decision. If she changes her mind, she will shave. All you did was try to make her self conscious about it.  Would you have said this to a friend who dyed her hair pink or got a nose ring?", "YTA A lot of men do not care", "And when a friend is constantly complaining about something, op or whoever as a friend, has a right to tell the truth.  The friend has a right to not want that kind of guy in her life, but all these dates have a right to their physical preferences in a partner.  Being a good friend also means being honest", "The same old 'venting' grows wearisome after a while and friend, a true friend, eventually should point out the obvious.  She doesn't want a guy who sees that as a dealbreaker?  All well and good, just keep in mind how few those guys are in American society.", "While I agree with what you said, I'd place a NAH. \n\nHer intent wasn't malicious. Everyone needs an honest friend (when asked!!)", "She didn't tell her to shave, though.  She suggested that not shaving significantly reduces her dating pool and if that is important to her, she may have to make a choice.   \n\n\nAnd neither choice is wrong.", "exactly! even IF this is the reason she keeps getting rejected, this is who she is and there are men out there who dont care if you shave. shes supposed to subject herself to time consuming and uncomfortable hair removal processes she doesnt even want/like in the hopes she might attract a man with antiquated and misogynistic views on female body hair? so she can get married and be forced to shave every day for the rest of her life?", "This. She's not looking to date men who are only interested in women who shave. Telling her to shave is not going to help her get good dates, just *more* dates. And those dates would likely be the type of person she won't be interested in. She's right in saying that OP told her to change for a guy, it's just that OP didn't realize that's what they were doing.", "This is ridiculous, she was trying to give her advice to open her dating pool if you value not shaving and it’s something you just won’t compromise on the reality is that your number of potential partners is reduced greatly.", "She did not tell her to shave. Full stop.", "This is it. I sometimes shave. I like the way my legs feel when they're smooth. But it's a pain and there's absolutely no reason to do it, so I often don't. I have very very thick dark hair. My partner and I have been together for almost 10 years and he has absolutely no problem with it (I've always been like this, so he definitely saw/felt my hair before we got serious). \n\nThere are so many people saying she's \"gross\". Unless you're the type of person who also expects men to be hairless, the only thing that's gross is the double standard.\n\nSimultaneously, it's totally fine if someone doesn't find it *attractive* and wouldn't date someone who doesn't shave. Attraction is important in a partnership. However, not being attracted to a person is not remotely the same as thinking they're gross. I think people who don't shower are gross. I'm not attracted to people who have topknots (no kenders allowed).", "Kind of a rude response...\n\nOP didn't just make an unsolicited comment about her friend's body hair. Her friend was upset because guys weren't asking her out and she didn't seem to understand why. OP was pointing out something that could be stopping guys from asking her out. I don't think body hair is gross by any means, but if her friend was upset about guys rejecting her, maybe she should consider why.", "you can get as mad as you want, it's not going to change the fact that over 95% of men would probably not even consider dating a hairy woman.\n\nit was good advice, it was just unsolicited, which does make OP the AH in my opinion.\n\nbut your response is unhinged lol", "Typical response from people who get offended about everything. \n\n>s lucky to have seen your true personality and dropped you.\n\nWhat true personality ffs?? Op just gave her an advice. \n\n>crawl back under your rock.\n\nI wish you would.", "Tell me you have blue hair without telling me you have blue hair.", "This just proves that I don’t care enough about their genders to actually read that part and instead judge on the facts told by OP", "I don’t get it are you insulting OP because he said what he thought when he was asked a question", "Wow, that was a bit harsh.", "No but really you are telling OP he shouldn’t have answered his honest thoughts to his friend because she might’ve known and only wanted him to say you’re unlucky? What’s the point", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I agree. If not shaving is important to her, then she wouldn’t want to find a man who’s only interested on the condition that she shaves anyway.", "it's not an honest reason unless OP has canvassed all of these men to find out -otherwise it's just a projection\n\nThe idea that not shaving is something which a person should declare as if it's a really big deal.", "Was it really unsolicited? They were discussing her dating life and she seemed confused as to why she was getting rejected, so OP offered a possibility?", "How is \"some people don't like body hair\" ignorant and sexist?", "I agree completely. I hate the feel of body hair on myself,  even pre- puberty with the baby hairs. I couldn't wait to be old enough to shave. I would never suggest anyone, though, alter anything on their body they didn't want to or weren't comfortable doing. Also women aren't the only gender that shaves. I know plenty of men who trim, shave, and even wax to keep themselves looking neat and show that they care about their appearance as a point of pride.", "This is exactly it - what matters more to her, natural appearance or a relationship? That’s the real question she needs to decide.\n\nI also feel like the way OP presented this - as a neutral question and not a statement that detracts from Emily’s appearance - is key too. OP just raised a possibility. Emily took offense to that and seems to have overreacted a bit in the process. NTA, OP.", "Even with men who don't mind body hair, a lot of them have their limit, y'know ? Even women are not equal in how they grow body hair. Some have rather thin, blond hair that aren't really that obvious, and some have thick dark hair that are instantly noticeable. Some grow a bit on legs, pubic area and armpit, some grow stach stuble, arm hair or even chest/back hair. And I do think that most men who don't mind body hair will still draw a hard line there.\n\nAnd sadly, according to OP's description, I would tend to think her friend is on the more obvious side of body hair growth.", "OP doesn’t say the friend asked for advice. Sounds like she was venting.", "Also let's face it, there's a big variation in \"hairy\" that OPs friend could explore without feeling like she's giving in to the patriarchy. I suspect hairy armpits is where most men would draw the line but a bit of leg stubble and a neatly trimmed bush would probably be okay (especially if the men have been in long term relationships before and know that there's times where their womenfolk really can't be bothered to shave their legs and leave them for a few weeks).\n\nPersonally I find my armpits smell worse if they go too long without a shave (still use deodorant of course) so if OPs friend is having the same issue then that can't be helping.", "I can’t believe I had to scroll this far to see a ‘YTA’ comment. OP’s friend is comfortable in herself and her body and does not conform to society’s standard of ‘beauty’ and I applaud her as she’s everything I aspire to be. OP pointed out about her body hair and that could completely destroy everything that made her feel comfortable in the body she’s in. I also hate the entire society standard of men wanting women to be BALD all over, which is essentially what pubescent girls look like. It’s gross. Body hair is normal and no one should be ashamed for what their body naturally looks like.", "If the venting is tiring, she can stop hanging with this friend or just change the subject. The friend made a deliberate choice to stop shaving because she didn’t want to support the patriarchy. That friend is undoubtedly aware that lots of men don’t like body hair. It doesn’t really need to be stated unsolicited.\n\nAlso, there are plenty of guys who actually don’t mind when women don’t shave. Depending on how the friend is meeting these men, she might just be going after the wrong type of guy.", "If the friend had asked for advice, this would absolutely be a NAH.", "“Do you think it might help you a little to shave?” Is not the same as “Not shaving decreases the size of the dating pool to those that do not care if their partner shaved. I wouldn’t be surprised if that makes it harder to meet people. Dating is hard even if you play into the patriarchal conventions. I am here for you if you ever need to vent”", "Well the point of the matter is that she can’t find any of the men that don’t mind copious body hair.", "'OP didn't just make an unsolicited comment about her friend's body hair.'\n\nBut she did\n\nFriend didn't say - men won't date me due to my hair - if she had said that maybe you're right but you assumed as did OP, that body hair was the deciding factor here. We don't know that at all from the post", "Citation on that percentage claim? Or did you make it up.", "Like women all dream of a bald guy who has hair from his neck to his butt crack.....\n\nIt just gets overlooked if that guy is just, I don't know.... Wonderful in all other respects.", "I can guarantee you the number is no where close to 95%.", "OP is a woman.", "What is up with people in this sub assuming every post is written by a man, even when the person identifies themself as a woman in the post?", "I agree with user. Her body hair is a valid reason as to why she probably wasn't getting asked on second dates, and OP was simply stating something that could be the issue.", "it's about understanding gender socialisation and why women in some cultures are expected to remove body hair (and in others they are not)", "It could be that other people are telling her the same thing OP is saying.  She might not want to accept this as a factor.  If everything went great on the date and then they don’t ask for another date, is almost what else can it be.  Shave or dont shave is her choice but she shouldn’t be surprised that people don’t ask her out again.  I have seen or heard about to many men that like hairy women among the people I know.", "So your suggestion is that she ends the friendship rather than being honest?", "We actually don't know if that's the point of the matter. Maybe she's actually a super shitty person and the people she dates pick up on it. We're only getting it from OP's POV", "made it up", "Your point being?", "Because most women don't treat each other like thaf", "I don’t really see how the gender matters and don’t really look at it I wrote he cause as a French speaker I use he as default", "how do you know that?  just projecting.", "I gave two suggestions. I don’t understand why some people don’t get that being honest isn’t always necessary. She didn’t ask for her friend’s opinion. She was just talking.", "Reading comprehension is important?", "Nah, plenty of women treat each other like that.", "What are you talking about? Plenty of women police each other’s appearance.", "Men are men. They have something against body hair. I'm a woman and I know how men work and it's unfair to us, but it's a fair reason. OP's friend has a lot of amazing qualities but it is a possibility that the body hair is what's ruining it. I'm not saying that I know why she isn't getting asked on dates, but OP just offered a possibility.", "Some people don’t want to hear people talk about the same thing over and over again. And if you can’t have a conversation with them about it, it’s a monologue\n\nEdit: and your 2nd suggestion to change the subject could lead to her being like “why won’t you listen to me”", "And personally judging people based on their gender is not something I would be so proud of that I would tell others when they aren’t", "Right? Half the time I feel like women are worse about this kind of stuff because they’re more aware than men are of the ways in which women are expected to perform being feminine.", "🙄 I don’t see how it’s judging someone on their gender when you’re just asking people to not misgender others.", "I mean if you find her gender to be so important that you need to tell others they misgendered when their answer has got nothing to do with OP’s gender, it seems pretty judgemental to me", "https://reddit.com/r/AmItheAsshole/s/pP8nnFfzsR I did?\n\nBy the way, I don’t need to do anything. This is Reddit. You don’t even need to respond to me.", "Damn so rude while being so wrong", "#This is now a Proctologists Only Orifice\r\n\r\nWhen a post is in [POO™ mode](https://www.reddit.com/r/AmItheAsshole/comments/168bzq8/title_aita_monthly_open_forum_september_2023) only users with enough subreddit comment karma are able to comment. If that doesn't include you, no worries! Check out [/new](https://www.reddit.com/r/AmItheAsshole/new) for other posts that are still open for comment. \r\n\r\n##[Be Civil.](https://www.reddit.com/r/AmItheAsshole/about/rules)\r\n\r\nPlease review our FAQ if you're unsure what that means. Thank you for reporting content that you believe violates our rules and helping keep posts out of the POO by abiding by our rules.", "Also there are plenty of men who goes completely nuts for body hair on women", "Should have left it. She needs a man that doesn’t find her body hair a turn off, because that’s clearly the type of man she wants. Her body hair is weeding out the incompatible men, so she should keep it.", "INFO - did she ask for clues as to why this is happening, or is this unsolicited judgement?", "I don’t shave and no one I dated had an issue with it (that i am aware Of). The older i get, the less prominent it has become.", "Dating is a nightmare in any scenario even if you are completely “perfect” and it’s about meeting the right person. Changing yourself to fit a mold to meet someone that wants that preference will often lead to unhappy relationships. In the olden days of my dating, curly hair was considered “unattractive” by many conventional men so, against my personal preference, I would dutifully straighten it to meet men as that was the stated preference at the time. It was such a small thing that “opened my dating pool” but made me feel worse every time.  I finally stopped and decided that I’d rather be alone worth my crazy big hair then change a part of myself I felt strongly about. I can’t make a judgement but my gut reaction is that if she did shave to date it and it “worked” she’d end up feeling worse about herself in the long run.", "You are NTA. As someone mentioned, she has a certain outlook on life and society, to each their own. She has every right to look “natural” but she has to understand most men won’t find it attractive. She needs to understand that “friend” means you will tell her things that she doesn’t want to hear- that is your role as her friend.\n\nSince she has this type of outlook and since most men seem to be turned off by it, she is probably talking to the wrong kind of men. She needs to find men with the same type of attitude or thinking about western society that she has. I would venture to say these won’t be your everyday “typical” guys. \n\nShe sounds like she could possibly have a more hippy/hipster/anti-establishment mindset and these are the types of men she should be trying to connect with.", "NTA- if she’s going to complain to you, you have the right to state your thoughts.  And I’m sure you’re probably right.  Culturally, most men would find this unattractive.", "Your friend was kind of putting you between a rock and hard place tbh :/ it’s probably true that men aren’t staying cus she’s not shaving, but it’s also probably true that she doesn’t want to be with someone who has a shaving-mandatory policy. \n\nNTA, this is a misunderstanding.", "NTA", "NTA. You mentioned that she has very dark hair. I did, too, but I shaved my legs & pits. As for men, I like hairy men and I'd definitely not prefer one that shaved their body. To me, that's gross. It's all personal preference.", "NAH. \n\nYou were trying to be a good friend, but she misunderstood the intent. \n\nShe has the right not to shave, as much as men have the right not to date her because she doesn't shave.\n\nThere might be a man that doesn't mind a woman with hairy legs and arms, but it's going to be like finding a needle in a haystack.", "NTA, it's a valid reason", "NTA. All you did was tell her what you thought might be preventing her getting second dates. At the most, the only suggestion I can make to change what you said is that you could have asked her if she made it clear in her profile that she does not shave. Very clear.\n\nShaving is a widespread, expected practice in America, where I assume you live, regardless of its origin. Men will expect her to be shaved *unless she states otherwise in her profile*.", "NAH.\n\nYou can say what you think is the truth. You are her friend and you owe her your honest opinion. Right or wrong. They're your opinions and you owe her your honest assessment. \n\nShe has a right to do with her body what she wants, including growing a beard and walking around like she has leg warmers on year round. She also has a right to be mad at a patriarchy that oppressed her so badly that she can do whatever she wants in the world, have whatever job she wants, go wherever she wants, and nobody tells her what to do. Poor, oppressed, friend...\n\nShe can do what she wants. Men she wants to date can do what they want, including escape from her vicinity. \n\nPersonally I think it's her personality and attitude more than the physical manifestation in the hair. \n\nAlso remember, to those who say she is weeding out the men... she is actually weeding herself out. \n\nShe went on dates. She wants repeat dates with the men. When she asked for second or third dates, she gets rejected. \n\nShe wants these men. She didn't weed them out. She weeded herself out.", "Stop telling her how awesome and beautiful she is and how shes not the problem, all this positive reinforcement has conditioned her to ignore any criticism and shorthcomings she has. \n\nNTA but also the asshole for not keeping it real always", "NTA.\n\n> A few years ago she decided not to shave anymore (legs, armpits, female areas) out of protest to the patriarchy\n\nThis, if her actual reason, is genuinely pathetic. Men don't want you to shave because 'the patriarchy' - we want you to shave for the same reason women want us to not walk around with neckbeards and massive overgrown bushes. Its just standard hygiene and self grooming. \n\nIf I went on a date with a woman and upon closer inspection realised she wasn't grooming herself, i'm going to make a bunch of other conclusions as well, like, she probably doesn't properly clean her vagina or teeth or her asshole. \n\nIf I then heard her reason for not grooming herself was as pathetic as 'da patriarchayy' i'd have all the information I needed to dip and block her ass.\n\nPut the shoe on the other foot. You go on a date with a guy, he hasn't shaved or trimmed or groomed himself in years and when asked why, he tells you \"im so sick of society telling me i should groom myself\" \n\nNOPE.\n\nPart of being in a relationship means making yourself visibly presentable and intimately enjoyable for your partner. Men do and should clean themselves up for their dates and girlfriends and wives. Its a sign of basic respect that you won't attach yourself to someone while looking like a mess. You are a flashing neon red sign that says \"i am a slob and i won't look the part when we're together\" - some people don't mind that, but those people, in turn, are probably going to be slobbish as well. The solution here is to either groom yourself appropriately, or accept that you're only going to attract messy, unkempt and overweight men who have zero interest in how they or you look.", "Women have only been influenced to shave since the 1920-40s it had to do with wanting to recreate the look of nylon stockings during a nylon shortage due to ww2. It was Gillette that first began brainwashing the masses that womens body hair is gross and unhygienic. Before that people would shave too across cultures but that had to do with other cultural or practical reasons and not directly about body hair being unfeminine. So thanks Gillette, for brainwashing the public with your advertising so well that we have these situations to the modern day where everyone believes it is unfeminine. It hasn’t even been 100 years but people are so susceptible to conditioning, and this is the world we live in.", "I have a friend who doesn’t shave and she has a great boyfriend who is also pretty attractive. so if he loves you he will not care !!", "I shave some parts, some times, but I do or don’t do it for myself alone. I’ve had friends suggest it, and it doesn’t anger me, but I think it’s sexy either way, so I just tell them that. The right person for me will also think it’s sexy.", "I won't make a judgement but I can imagine she would have really mixed feelings about  your comment.  The fact that women are expected to shave their body hair or they won't even get a second date is frustrating and angering for many women.  If you polled women there would be quite a number would would prefer to stop shaving.  \n\nThe idea that a friend would suggest you just go along with this social pressure would be even  more frustrating.  \n\nYou might suggest that she look specifically for people who also push back against social norms about appearance /. the patriarchy   when she is looking for dates.   Maybe in her on-line dating profile if she has one, or  in other ways, wha could be looking for people for whom female body hair was not an issue.   \n\nIt might also be worth her asking some of the dates she had fun with if there was a specific reason for the lack of interest.  \n\nI'm quite sympathetic to her position but I can also see that it might be having an impact on the dating pool that would be attracted to her.", "NTA - she was continuously venting and you pointed out the obvious. Wether you agree with the current societal standards or not, the fact remains that since the change in her grooming habits, her dating options have contracted significantly. Don’t ask questions you don’t want honest answers to.\n\nOP - you’ve already apologized (which wasn’t warranted). If she’s still all butt hurt, let her be.\nNo need for that negative energy", "Probably NTA. I do see a lot of women in the USA going “no shave” and it is a little shocking since we have been groomed to “know” that females shave their parts here. But, females in other parts of the world don’t shave and still find love. I would tell your friend that you didn’t mean she SHOULD shave just that that may be the issue with the men and she just has to find the right one. Then let it go- friend should come around when she realizes you were being a good friend. Good luck!", "YTA. She was venting her frustration & instead of being validating you gave unsolicited advice  -unsolicited advice that goes against her values. Double whammy.", "YTA. I’ve dated men that don’t care about hair, they are out there. She’s meeting base men and you’re telling her to change for them?", "YTA. \n\nShe wasn’t asking for your opinion and she really didn’t need it considering she had decided to not shave due to her own beliefs and what she wanted to do so you telling her “hey maybe if you shaved your dating life will be better” is completely undermining her values and what she wants. And considering her thoughts on the topic you saying that is supporting exactly what she’s against so yeah. YTA.", "YTA\n\nMy wife shaves less than I do. Ask me how much I care or how much it detracts from her beauty, I dare you.\n\nSeriously - I shave my head, trim my beard, and remove my underarm hair. My wife? Nada. She loves my beatd and lack of hair, I love her fuzziness - because I see her, and love all of her body because I love her. Right from the start.\n\nYour sister is correct. The rightman for her is someone who doesn't care about whether she shaves or not and frankly someone who would want to see her again because she does, and wouldn't if she didn't, is not worthy of her anyway. Maybe tell her that, instead of propogating this sexist bollocks.", "YTA. \n\nI shave but if I didn’t and I was losing men for their superficial beliefs about shaving, then I would clearly be filtering through the dating pool much more efficiently than average. My boyfriend really could care less about any physical choices like shaving.", "NAH. \n\nShe understandably was offended by that but you made an honest suggestion that you know deep down is probably what’s causing the issue. It was to try and help your friend despite the risk of them taking offense. I think it was a comment made out of friendship and came from a good place, but she certainly is understandable for rejecting that idea and being hurt, especially if she thinks deep down you hit the mark.\n\nDon’t listen to the dumb fucks saying Y T A they don’t get it.", "NTA some times friends need tough love and giving your honest opinion on what might be the cause doesn't make you TAH. It's perfectly fair to want to never shave or groom, but it's also completely reasonable that that will limit the pool of applicants who find it attractive. It is what it is.", "NTA. You made a simple suggestion and it obviously hit a sore spot. It’s petty to just ignore someone because they upset you instead of just talking it out.", "NTA - I understand both sides. Was there a better thing to say? Most likely. Like changing up the type of men she seeks or changing her online profile if she uses that. But was it out of line to explain the probably obvious? Not with the context of the conversations and how you phrased it. That was fine.\n\nETA - I say this as someone with similar values to your friend. I don't shave. I don't care for changing myself so someone else will like me. But I would also understand if I was venting to a close friend if they were to maybe say the same as you.", "NTA. Just giving good advice.", "NAH", "NTA she was looking for advice and you gave it. She might not like the answer, which is fine, but she can't be mad at you. \n\nPersonally, I think men and women should both shave.  Proper hygiene is very important.", "NAH I never used to shave my body hair, I kept it all trimmed and chill but it wasn't something I really could afford to do in my 20's and I am a ginger so it didn't really matter. But when I was trying to date and not having success I started shaving again because I cared more about finding a partner than something shallow like body hair. \n\nI eventually found my amazing partner who actually prefers that I don't shave! But ultimately it is up to me what I do or don't do with my body and as long as I'm hygienic then whatever. \n\nBut being offended doesn't make the friend the asshole either. She could just be bummed about the state of the situation. Like you are totally not wrong, OP, and she would be more likely to find a partner sooner if she just weighed the pros and cons of things like this. All I'm gonna say is the body hair isn't a hill worth dying on.", "NTA.\n\nYou literally said “I know this is a very superficial thing to say” you were already considering their feelings and just said it as a suggestion. Everyone who says YTA are just people standing on their own soapbox about their preferences. \n\nEveryone is entitled to do what they want with their body and everyone is entitled to their preferences and everyone has the right to respectfully voice their opinion. \n\nThat doesn’t mean every opinion can’t be criticized, but there was nothing wrong with what you said. They just need to get thicker skin.", "NTA - whilst I agree it's up to her what she does, some guys aren't going to be into body hair. I personally prefer less but if it's there whatever.  \n\n\nThe bigger reason she's not likely finding success is that most guys are going to pick up that she's \"against the patriarchy\". Whilst people can do and think what they want and whilst I am an egalitarian, people who fight the \"patriarchy\" are just tiring and cringey.", "NTA - you made a valid suggestion about something she's having trouble with. She probably knows the lack of shaving is part of the issue but hasn't accepted it, you pretty much confirmed that in her eyes and is in denial.\n\nSo many people in the comments are arguing but the truth is, the majority of men like it when women are shaved. Do women HAVE to shave? No, but both men and women do things in order to look more appealing to their partner, and to potential partners.\n\nShe can protest the idea of that, but that choice comes with a struggle.", "Soft YTA\n\nThink about your \"the right man will come\" statement. Followed by \"it might help if you shave\" which kind of translate to \"no man would like you with your hair. Therefore there is no right man. You should just change and date someone that doesn't really like you*\n\nObviously that's not what you meant but do you see the dichotomy between saying she will find the right man one day, but also to change her appearance so a man would accept her ?", "YTA", "YTA here because she didn’t ask for advice and you just randomly threw something out that you find off putting about her. Plus why should she diminish herself to fit someone else’s idea of attractiveness? She doesn’t want to and instead of finding it admirable you find it gross.", "I literally don’t shave and have never had a man have an issue, I don’t think the hair is a problem and I don’t blame her for not responding. She was just venting and you gave bad unsolicited advice.", "I think that we all come from very different backgrounds. For me, this would be an insane thing to say and almost every woman in my day to day life would be shocked (whether they specifically shave or not). But I do know that I have a different life than a lot of others and that for many others most women they know shave.", "She has every right not to shave. \n\nAnd men have every right to be superficial and have \"preferences\" where women resemble children. \n\nBody hair is natural on all adult humans, and a lot of men think it's gross. That's a them problem.\n\nUnfortunately this is going to mean that she's going to be going on dates with men that are like this, because this is just how men are. There's not much to do about it. But maybe next time instead of suggesting she change herself for men that prefer child like women, reassure her that she doesn't need a relationship to be happy and that there \\*are\\* men out there that prefer adult looking women.", "Posting as someone who is not into shaving myself. I feel like if you are dating in the general population a lot of cis het men are not going to be into body hair due to cultural programing and our general social norms...she doesn't have to shave but it does mean it's going to take longer to find someone who is a right fit and that a lot of seemingly \"nice guys\" who she has a good time with may turn her down due to something superficial. This isn't a bad thing, why settle for someone who doesn't have the same values? To avoid wasting her time i'd suggest including in her profile or somehow showing in her photo that she's not into shaving...then the guys with different values won't go out with her in the first place resulting in her not feeling as hurt?\nI feel like having a dating site for people who aren't as main stream would be helpful.", "I don't think ur an AH as I don't think u said it maliciously  (at least I hope u didn't). But she shouldn't have to change her appearance in order to meet someone, she doesn't seem like the type of person who would even want to date somebody who was grossed out by body hair anyway. u should apologise as it's not really ur business and sometimes friends just want to vent without input. I know that I would get upset too if my friends critiqued my appearance regardless of whether they meant to me malicious or not.", "Imagine what happens when a guy says they actually like the hair, will she shave it then?", "If you stand back from all this, there is a bit of silly stand being made. Our life is a serous of compromises. Pick and choose what you want to do, and understand that you are giving up other options to do it. \n\nYou are not the A - hole for having an honest conversation about her options. Wether it is right or wrong she is limiting her dating options, with her lack of shaving and just has likely here militant views on the patriarchy.", "NTA. Long hair under arms and is just gross. Hairy legs are a turn-off for many men. \n\nAnd what if she goes on a date with a guy that doesn't shave and never gets a haircut? Or does this only work one way?", "Your friend definitely has a right to not shave, but to then be clueless about why nobody ever calls her back is just plain not believable. She has to have some idea. I don't think you or anyone else is doing her any favours by not voicing your opinion. \nMaybe tell her to try it out \"for science\" and compare the results. Otherwise she should prepare for a life of disappointments (probably).  Even worse is she will just keep blaming external and not see the true reasons.", "INFO: Was she asking you for advice on how to get people to date her, or was she just wanting you to encourage her?", "NTA. And your friend, and anyone who thinks like this are lying to themselves if they say that they won't change their appearance for anyone.\n\nBecause almost every single person chooses their appearance to make themselves more presentable to the world around them. Whether that be for employers, clients, social groups, or romantic partners.", "NTA. the opposite. a true friend tells the truth, as you have done.\n\nit's probably all the feminism bullshit that turns them off though lol - or maybe she's too easy/loose", "Nta. I would of told her that tree planters might be into it.", "Your friend, of course, can groom herself as she wishes. What she does may affect her dating pool. The important thing, however, is that she should not get made at you for telling her the truth.\n\nOne of the benefits of having close friends is that they will be honest with us when we need to hear honest opinions. In this case you weren't cruel to her. You just pointed a fact out about her that would explain how her dates keep turning out. You are NTA, but your friend is for taking your legitimate comment/advice as some sort of attempt to get her to submit to the patriarchy.", "NTA I don’t see how your comment can make you an asshole", "NTA - She might be embarrassed by what you said so that might be why she’s not responding. Sometimes people need to be told the truth. It might be hard to hear but eventually she’ll realize that you were just trying to help. \n\nThat being said, if she doesn’t want to shave that’s her prerogative. She just has to understand that her dating pool is a lot smaller than the average person. \n\nShaving is a personal preference just as anything else. Somewhere out there is another Bigfoot searching for their mate.", "YTA. \n\nYou’re literally saying you showered her with compliments right before you told her that, kinda fucked up and sounds like you were building her up with backhanded compliments just so you could get your little jab in. I’m a woman too, I’m not unaware of how we think and speak and the fact that you’re trying to play it off as if you didn’t know it would hurt her feelings; stop being dumb. You one hundred percent knew what you were doing and saying.\n\nWeaponized incompetence is not cute.", "I'm going to say YTA based on the fact that it sounds like she came to you to vent, not asking for advice, and how one keeps their body hair is *extremely* personal - based on her reaction this doesn't seem like a topic you two have spoken about it as casually as your bringing it up here would allow. \n\nand even though you're right, shaving her body hairless may *increase* her dating pool, it isn't really the kinds of superficial guys she's interested in being with. and what would you suggest she do after shaving? shave just long enough to attract a partner into a committed relationship? then she can start growing her hair wild and free again? you know that would come off as manipulative on her part. or just compromise on her values for the rest of her life to attract and keep a partner? hair removal takes money, time, and effort, compounding over a lifetime - which is why people opt to spend even more money on painful, more permanent hair-removal treatments. even as a person who shaves, I see Emily's point and admire her commitment to her values. it's gross to think about the fact that I've been conditioned to see my body in its natural state as in need of correcting, manly, or what have you and opt for making it look more like my pre-pubescent state.\n\nyou crossed a boundary here. I wouldn't keep pushing her to talk to you again, and when you do apologize I would acknowledge that you crossed her boundary and that your suggestion was uninformed and unhelpful to say the least.", "YTA. \n\nYou know her views on shaving, patriarchy and what she looks for in men. She is probably smart enough to know that some (many?) men are repulsed by them for cultural reasons. \n\nThere is a difference between saying :\n« Yes the fact that you decided not to shave probably eliminates a certain number of men that don’t share the same values as you anyway. But you will find someone for sure » (statement of fact, totally respectful) \nAnd\n« Don’t you think it would help a little if you shaved? » meaning that you are implying that she should probably shave if she wanted to have more options with men who don’t even share her values. It proves that you do not understand her views and also this is a bad advice in light of what she is looking for in a relationship. \n\nYou did well apologising", "YTA. She made a choice of how she wants to live her life. It very well may be true what you say, and it’s likely the friend knows her choice is not a “societal norm” (whatever that means, saying in BIG AIR QUOTES). Honesty is always a good policy, but there is a thin line that can be easily crossed into being rude and it needs to be towed carefully. Should have kept it at “there are many fish in the sea and keep being your true authentic self and you will attract the right person.” She will come to her own conclusions to determine if she needs to change something or not. Unsolicited suggestions usually don’t go over well.", "NTA\n\nWhile she has the right to grow her body hair out if she wants to, it's going to be a turn off for lots of people. The men that she's been with have actually been really polite, and you were perfectly reasonable and possibly even doing her service by bringing it up when it would have been taken even worse if they did.", "NTA\n\nWhether it’s her rejection of the patriarchy or not, it still doesn’t fall into the society that she’s a part of as generally socially acceptable\n\nIf she wants to quit wasting her time she should tell them up front she doesn’t shave. Or create a dating profile with that explicitly mentioned.", "Your not wrong though. NTA", "NTA.", "NTA. You are correct,  even if she doesn't like it. Shaving will open up her potential.", "I changed my mind between the title and the end, but NTA. You didn't tell her to shave. You just brought up the point that it may be a factor in her dating scenarios. She doesn't need to change her appearance for men but, at the same time, needs to understand that not all men will find that choice attractive. Pointing that out isn't suppressing women, just acknowledging a fact. It is becoming more accepted for women to not shave, and more and more guys don't care, but depending on the dating scene, you're still more likely to find men that don't.", "NTA, advice given, overreaction response", "NTA and you are probably right about your statement and she knows it.", "NTA but she sounds negative af.", "Woah, yeah this is so important to the context. I still don't think it's proper \"advice\" or a solution to give. But good context to know.", "This is what I was going to ask. OP doesn't mention that she asked for advice at all, just that she was saying how sad her dating life was.\n\nIf she wasn't asking and OP just said this it's not a great look. It would almost sound like OP had this loaded and ready to go already.", "Random convos at the bar don’t start with ‘I’m just venting let me talk’ or ‘this is super serious and I only want legit advice.’ That’s just not reality. If a friend is constantly complaining about the same thing over and over - it def reads like they want advice on it.", "Unsolicited advice to strangers is an AH move, but if you're legitimately years long friends with someone, offering advice when they vent about a problem is the good friend thing to do.", "OP said that she complains more often about her (sad) dating life. If that is the case, I think it is legit for OP to give some advice. Hearing the same complaints over and over again is annoying. Yiu can complain, but then you should either do something about the situation or make peace with it. It is not fair to burden your environment with the things you don't want to work on.", "Is she advertising that on her dating profiles though? The right men won't be matching if that's what they're looking for, and the wrong ones will sign up to be disappointed.", "This is terrible advice and I keep seeing it. YES give your friends room to vent, but within reason! Your friends are not free ventilators that you can spew all of your fears, doubts and negativities into…especially if you do it repeatably and don’t want to hear any attempts at a solution. That isnt how you treat a friend, thats how you treat a therapist and even they dont like it. No ones the asshole but your friend isnt being entirely realistic. I also don’t conform to societal standards, but it has killed my dating life and I accept that. Its going to take more time and luck to find a great partner that appreciates their eccentricities.", "Women can and often do support the patriarchy. No assumptions needed for that in this case.", "Yeah, I'd say YTA since it sounds like she was venting, and probably doesn't need the *obvious* stuff. Like, think about it - she probably knows that some men are shallow and can't get past the hair thing. You're not gonna rock her world with that news. So... Maybe not useful advice, hey?\n\nPlus, sometimes people just want to vent, they don't need you to solve their problems. Step back and figure out what the other person wants from the conversation. If you're not sure just *ask them.*", "Totally agree! \n\nBack when I was single and dating I was in a no-shave phase (and had been for about 5 years). I found that \n1. It didn’t really hamper my dating prospects at all and \n2. If a guy seemed like he couldn’t handle an adult woman having some body hair then we clearly weren’t a good match.\n\nNow I’m married and am in more of a shaving phase, but I know that I’m making that choice because of my current preferences and if my preferences change again or if I just slack off and don’t shave for a week or two my husband won’t care, because I already know our values and attraction align in that regard.", "This. She’s sad she cannot find someone who likes **her**. Of course she knows she can change and more men would like her but then she’s changed something important to her for them to like her, so that’s a hollow victory.\n\nThis sub will say you’re not the asshole because a lot of people are just fine with being part of enforcing cultural norms. But if you want your friend to be okay with you you need to recognize that she’s *sad because she cannot find someone who likes her WITH HER VALUES*", "This.   Also, my little sister is the only one of us with dark hair; everyone else has blonde.  She tried shaving etc. but in order to “keep up” she has to shave twice daily.   Absolutely no reason to put oneself through that.  Normalize body hair.", "I agree. I shave my pits and my legs, but that is for my own comfort. My SO could care less. My arms are still pretty hairy. It's because I'm white and have rather dark hair that stands out against my pale skin. I take the time to do this, even though I probably shouldn't.\n\nI also don't shave my 'bush' so to speak, because it's actually grosser if you do. Shaving ladybits leaves them open to infection and I'm immunocomprimised.\n\nGentle YTA to you OP. I know you're trying to help but she's not looking for a man who cares about her hair.", "100%. I don't shave. Tbh, it hasn't really affected my dating life, because a core element of my dating life is that i am looking for a man who doesn't give a fuck if I shave and respects my bodily autonomy there.\n\nI don't WANT to date the guy who freaks out over a little hair!", "oh thank goodness i found a good answer, i was ready to have my blood boil after seeing the top comment which said something along the lines of \"men have the right to think it's gross\" like jeez, way to go missing the whole point.", "Seriously. Why would she *want* a dude who would lose attraction over one thing like that? Having some aspect that goes against what we’ve been taught to think of as attractive is a great way to weed out shitty people. \n\nAlso sometimes people just want to vent without unsolicited comments about their appearance. \n\nYTA", "Also, why would she want to go out with any of those men if her having body hair that is totally normal and likely clean is a deal breaker. YTA", "YTA — exactly this! Especially because you don’t know if it’s because she doesn’t shave, I haven’t shaved in 4 years and it hasn’t hurt my dating life at all.", "I 100% agree with you. I can't believe all the n t a comments. First, her decision not to shave is none of OP's business.  Second, if she shaved only to get a man, she would go against her values. It's much better being single.  Hopefully, one day, she will find someone who respects and shares her values. Or who doesn't care about body hair maybe. What you said is what OP should have said.  \n\nYta op.\n\nEta: corrected misspelling due to autocorrect", "YTA.\n\nMen who agree that women should have bodily autonomy will NOT be put off by a little body hair.\n\nHowever, maybe that's not it. Just because OP assumes it's the body hair, what if it's not? What if OPs friend was wearing jeans/pants and a shirt with even short sleeves to where you wouldn't notice the body hair? \n\nThere are so many variables to dating. Maybe OPs friend just comes on way too strong. Maybe she does something to indicate her insecurities about dating, or comes off clingy, or otherwise spooks these men in literally any other way and for any other reason. It's really a whole fucking shame that OP jumped to body hair as her conclusion and speaks volumes about the seeds the patriarchy has sewn in regard to (*entirely natural*) body hair on a woman.\n\nSo yeah, OP. YTA. \n\nBushes everywhere!\nBurn the patriarchy to the ground.", "And especially if this was a vent to a friend conversation and not a what can I do different conversation. Sometimes we just need to vent to a friend and aren’t looking for a solution. OP, YTA and you likely have one less friend now too.", "This is the way. YTA", "This is the answer, OP. You should add this to your apology so she knows you understand why she was hurt.", "This should be the top comment", "Exactly. If OP wanted to be helpful and believes the hair to be the issue (if advice was being asked for), then she could have suggested that her friend makes it clear by pictures in her dating bio that she has body hair so she weeds out those who don't match her values straight away. Plenty of men accept body hair, but given the reality of the world we live in, she may need to work a little harder at finding these men depending on the circles she tends to be with", "This is absolutely ridiculous. I can guarantee you the body hair is not why these fools stopped coming around. You assume that is what's wrong with this situation. OP just saying what she personally thinks Because that is how she thinks about herself.... It had absolutely nothing to do with why these guys aren't coming around? FYI they just wanna hook up.", "Yeah if a guy breaks it off because of her hair or wants her to shave then he is not the right partner for her. Shaving her hair to have better success in a dating pool of guys who will now appreciate her because she abandoned a marker of her values is dumb. She needs someone who shares her beliefs and doesn’t care about the hair - contrary to popular belief there are PLENTY of these guys out here", ">By telling her to shave you are telling her to change her values just to get a man.\n\nTotally. And I say that as a man.\n\nIt's not the shaving or not, it's the reason behind which is important. She could have a taller dating pool by shaving but what's the point if she met someone who not share her values ?\n\nHer body, her choice and I think she already knows that it can be an issue for some men so she just have to find the one who loves fluffy girls.", "Imagine if we said something similar about another physicality like…’maybe if you got implants you’d have better luck’ or ‘maybe if you dyed your hair’ that would be BONKERS. Same applies, OP is absolutely the AH", "Exactly. It would be one thing to say “I’ll be honest, some guys are probably turned off by the not shaving, but that’s good, you’re weeding out the ones you don’t need to bother with up front.” But suggesting that not sharing would HELP rather than be counterproductive is the AH move here. YTA", "I highly doubt that someone who rejects this girl for having body hair would be a great person in this girl's eyes.", "I know Reddit considers physical attraction to be an afterthought in a good relationship, but yeah I certainly won't date someone who I'm not attracted to, and hairy armpits gross me out on people of any gender. I'm not entitled to ask anyone to shave for me and they're not entitled to my presence in a relationship.", "Yeah it’s a bit bewildering to me that she can act like OP is insane for even suggesting that. Obviously it’s wrong that so many people can be judgemental over something so inconsequential, but OP (assuming they’re being honest) wasn’t trying to say that the friend was wrong for not shaving or wanting to speak out against the patriarchy. They were just pointing out the very real possibility that not shaving is what’s unfortunately turning a lot of the guys away. NAH", "okay as someone who just dyed her hair pink AND switched my nose stud to a ring/hoop I'm feeling oddly called out rn lmaoo", "And then change the topic because listening to someone complain over and over and not wanting any advice is incredibly annoying.", "Agree that OP shouldn't make herself uncomfortable, but disagree with giving anyone advice that they'll \"find someone perfect for you\". Some people don't ever become partnered, even though they wanted to be.\n\nRather than platitudes, it might be more helpful to dig deeper into what exactly it is that bothers her about being single, and what exactly is missing from her life. \n\nIs she worried about her financial future? It is more expensive to live as a single person. Are all her friends partnered and does she dislike being a 3rd wheel all the time? Or maybe it's just about sex. \n\nBy encouraging the friend to explore her feelings, it might reveal gaps she could fill in another way, without a partner. \n\nI have two friends (both f) who are now in their 60s, neither was ever in a serious LTR, both are in a HCOL area. One bought real estate on her own, the other was waiting to buy real estate when she married. The one who was waiting for that \"perfect for you\" man to show up is in a much more precarious financial situation and regrets having put off living part of her life while waiting.", "“Working of yourself” implies there’s much more “wrong” with her than some body hair. This sounds infinitely more insulting!", "OP DID say that, clearly it wasn't working.", "I have leg hair and armput hair and only use a trimmer to cut down on my labia and butt hair occasionally.  I have never run into any issues with men because of it. And I have been with some very attractive men both physically and as people.  I am in a relationship with someone who loves me and they have never negatively commented on my body hair.\n\n I don't understand why the internet makes it seem like hair on a woman is this crazy thing. I've been luke this for almost 10 years and it's been a real non issue for me.", "Might honestly be easier to find a dating partner by ruling out people whose values don't align with hers. Sounds like she would just be wasting her time dating people who are repulsed by body hair.", "Is it the obvious truth though? I have never had a man who was interested in me turn me down when he realized my legs weren't shaved, and I've been around the block and am now married to a man who couldn't give a toss if I shave or not.   \n\n\nI think we hear about how disgusting men think hair is disporportionately to how much men actually care about or are disgusted by hair.", "As someone who doesn’t shave my legs, men normally don’t give a shit, and if they do, they are not the kind of person I’d want to date in the first place. I think it’s a little insulting for OP to assume that her not shaving is the major issue causing her dating problems. Especially when it sounds like she just wanted some sympathy.", "It sounds like she was looking for sympathy, NOT advice. The friend decided to make it about her appearance instead of providing support. YTA", "Any man that actually gives a crap about that stuff anyway is not somebody I would want to date and I shave. I can’t imagine a grown man calling a woman’s leg hair ‘gross’. Yuck what a double standard and a immature mentality.", "As a dude I'm having a hard time wrapping my head around shaving being such a massive deal breaker that it's causing a whole slew of men to reject her. OK, if it's facial hair but leg hair? Nah, it's got to be something else.", "Damn, that edit though. Really sad to see a woman ripping on another woman for being anti-patriarchy.", "I just don’t understand how it’s gross on women but not men apparently just stupid", "Wait, is your edit saying that her not shaving probably means she is a crazy feminist and that turns me off or something? Because is so, you are the gross one.", "'Gross' is such an overstep, and such a double standard to boot. Nothing is gross about body hair. You can prefer shaved or not shaved, that's fine.\nBut seriously? Gross? So sick of this bullshit. Men do not get called gross when they have body hair so I have noooo idea why women should be.\n\nEDIT: because apparently we have some thick ones out there, no, as men, you are not held to shave your legs or armpits to the same standard. Just stop.\nMen get bullied, I understand that.", "It’s blowing my mind that everyone is acting like this is the “obvious truth” as to reason OP’s friend isn’t getting second dates. That feels like an incredible leap, both from OP and from commenters here. MANY, many dates do not result in second dates. We know nothing about OP’s friend’s personality, conversational style, etc. but somehow everyone seems comfortable assuming that her armpit hair alone is so revolting that nobody wants to go out with her a second time based solely on that. The fixation on the hair as the only possible reason is a perfect example of the patriarchy OP’s friend is pushing back on.", "You had me until your edit. I’m a woman and I prefer to shave, but our default state is having body hair. Her having body hair is a symptom of her body’s natural processes NOT her personality. We’ve only been conditioned to think it’s unnatural and if you think about it, that’s honestly ridiculous.", ">a symptom of her personality\n\nThat's a very interesting way of putting it. Women existing with natural body hair is equivalent to a *symptom* of an illness? Sure is a sick world.", "I disagree that men have the right to think hair on women is \"gross\". I mean they let their pit hair grow out so long that it sticks out even when their arms are down. Guys who groom their bush are fairly rare too. I've met one in all my years who actually shaved it. So they would be total hypocrites - women are also mammals, mammals have hair! I haven't shaved my armpits in over 20 years, only trim my bush, and leg shaving is occasional. And I'm a huge slut lol (well, was... I'm married now). Exactly one person has had anything negative to say in those 20 years and he was a dick. Where is she finding these guys that are so shallow is my question?", "I don’t shave anything either (except my head for a while) and when I was dating no one ever had a problem with it. Men really don’t care about body hair as much as people think.", "Being a feminist is a turnoff for men? She probably doesn't want to date them then.\n\n\\*not saying not shaving cannot be a turnoff for some men - just generally being a feminist SHOULD NOT be a turnoff for men. Good riddance if she repels them with her \"opinions\". \n\nWhile technically she didn't ask for your advice - a good friend might state that this might be an issue - really depends on the person and relationship. It's probably how it is framed, how close you are, and how you think your friend would digest this news.", "> Editing to add: After thinking about this more, I am thinking that yes, the guys don't like the hair, but the fact that she has it is probably really a symptom of her personality and outlook on life and general opinions, and those things are probably the even bigger turn off for these guys.\n\nNah there's plenty of guys that like women like her, its just going to take a bit more effort to find those guys.\n\nYTA op.", "“Men have a right to think it’s gross” isn’t a great way to approach that point. There’s nothing inherently “gross” about having body hair, and the idea that men have a “right” to think women’s bodies are intrinsically disgusting is an impediment to changing that attitude. And if a man is sufficiently grossed out enough that he can’t handle someone shattering the illusion that women are pristine, hairless beings, then I doubt that man would have been compatible with OP’s friend anyway.", "The fact that she has hair that naturally grows on her body is a *symptom of her personality?*\n\nYou have to be kidding.", "Men who do not shave their legs do not have a right to find it gross. They can obviously do whatever they want but doesn’t make them not the asshole", "Wow. I did not know that refusing to adhere to an outdated and arbitrary gender standard is a “symptom of a personality and outlook on life and general opinions” that are a big turn off to guys.  \n\nAre women similarly turned off by men who don’t expect to be the sole breadwinner in a relationship?", ">The fact that she [has body hair that doesn't conform to the societal standards that I deem appropriate] is probably a symptom of her personality, and outlook on life in general.\n\nWhat in the everlovingfuck is your problem? Your internalized misogyny is off the charts.", "Honestly she's probably looking for men in the wrong places and so meeting much more \"traditional\" types. I don't think OP is the AH though you are right in saying that it's likely more of an issue on personality and political views.", "No offense, lady, but the honest answer is the guys she's met just want a hookup. They don't GAF about body hair, they just don't want a relationship.", "I have to disagree. Speaking as a man, dumb opinions and annoying outlooks on life are much easier to ignore than body hair.", "Yea women who don’t shave must just have bitchy personalities so no one will love them /s", "Let's assume OP knows her friend and gave the suggestion with appropriate consideration and context, in which case NTA.\n\nIf a good friend of mine offered a suggestion that I do not agree with, I'd simply state that and move on.  Based on friend's response, the friend seems overly sensitive or reluctant to hear any suggestions that she doesn't like.\n\nThis may also be an explanation for her dating experience.", "I thought the exact same - a symptom!", "issue is it doesn’t sound like she was asking for advice, it sounds like she was venting and OP expressed her bias unprompted. also, you’d be surprised how few people care about that kind of thing, there’s any number of reasons why first dates don’t work out, and to assume it’s over something as trivial as body hair is literally exactly why her friend stopped shaving it in the first place.", "This is what I was looking for.\n\nNone of the men OP's friend dated gave an indication that not shaving was the issue so it seems OP suggested it as SHE has her own prejudices and assumed the men would have the same.\n\nIt like thinking your friend doesn't meet a certain beauty standard and instead of telling them that they will find someone that will love them no matter what (it's just hair after all and no indication of cleanliness) or that it's better to be single than change yourself for a someone else, OP told the friend to change their values to attract someone who they'd probably be incompatible with for the sake of getting into a relationship.\n\nSoft YTA as OP wasn't malicious but I can see why the friend was hurt.", "I have somewhat hairy legs and men still hit on me \n\nYeah OP should have kept her mouth shut. YTA OP.\n\nAlso, it's quite funny how the men here are saying leg and armpit hair are gross. They need to look in the mirror..", "These are good points. OP could have asked something like, \"Have you asked them why they didn't want to continue?\" OP may have been overstepping by making an aesthetic assumption, but I don't fault them for wanting to \"wrap up\" the conversation. \"Well, maybe it's this.... next topic.\" That's how I interpret it. Not that that justifies OP's assumption. OP should have been more upfront about their annoyances rather than making assumptions", "Say it LOUDER for the people in the back!!! OP was projecting and actually judging her friend by saying this. Def YTA behavior.", "I have absolutely suggested that friends hit the gym when they can’t get a gf. I’ve hit the gym and lost weight when I wasn’t getting dates. Everyone has preferences, but you’re more likely to find a partner if you’re more appealing to the general population. I don’t think it is reasonable to expect potential partners to accept all less appealing traits, especially before you’re in a committed relationship. Of course a little leg hair doesn’t matter for someone you love, but I think most people would be a little put off if their date didn’t bother to shave their legs before a date. There are gentle ways to say this, and it sounds like OP did say it gently. \n\nIf the friend is morally opposed to being with anyone that doesn’t accept all body hair, they’re just going to have to accept being in a smaller dating pool.", "I would absolutely tell someone to lose weight to find a partner easier lol", ">You wouldn't tell a friend to lose weight too \"get a man\",\n\n\"go to the gym\", \"get a haircut\", \"wear nice clothes\" is all pretty standard advice for dating.\nMaking yourself more attractive is part of dating.\n\n\nA yougov study shows that 66% of men think hairy legs on a woman are unattractive (and 62% of women feel the same way about hair on women).\nSuggesting that OP's friend would increase her chances if she'd shave is perfectly valid.\n\n\nIf someone didn't shower due to a lifestyle choice of wanting to be closer to nature or some BS, would you say it's out of line to tell them that being stinky might be contributing to them not getting second dates when they complain about not having luck dating?", "Of course you can tell a friend they need to lose weight to get a man. What kind of dishonest relationships do y'all have with \"friends?\"\n\nThis may come as a shock to much of Reddit but physical attraction is a huge part of relationships. And many men don't want to be with women that are as or more hairy than them. That can go both ways obviously, I wouldn't think twice of a woman expecting a man to groom themselves either.", "This is something that I'm only just recently started to grasp. My default reaction to someone complaining about something is to jump into ideating on solutions and try to help them to \"fix\" the issue. I now realise that with very close friends and family, that not only is it not helpful, it's also not what they want. I have now stopped offering advice unless explicitly asked. My relationship with my sister for example has improved immeasurably.\n\nHowever, 1 caveat: I can now no longer tolerate acquaintances and colleagues who want to moan about things. I just don't have the time nor patience for them and I am quite blunt: \"is this something you are looking for my help or advice on?\" If not, I'm just not interested in hearing their negativity: that's what their close friends and family are for.", "I was wondering too if the friend is ever up front about how she doesn’t shave and her reasoning.  That may be a way to find potential partners who are more aligned with her.", "Absolutely this. \n\nThere are a lot of comments about judgements, but we all judge someone as soon as we meet them. It's human. \n\nIf a man turned up to a date unshaven and looking like Mr Twit, it wouldn't matter if he just saved 16 orphans and their puppies from drowning, that first impression would have already been formed. I know that's a massive exaggeration, but you get my drift. It takes a little time to get to know a person no matter what they look like.\n\nI'm interested to find out if the friend got second opinions.", "Those saying YTA seem to be projecting a moral high ground, and being friends with them is gonna run you into a wall. Instead of telling you the truth they would instead bend backwards to cuddle your feelings.", "lol if OP said this to her friend she'd be an even bigger asshole. did the friend at any point say that any man is obligated to find her attractive? did she ask for OP's opinion on why men don't like her? no, it sounds like she was just venting her frustrations on how difficult dating is, which she should be allowed to do without being told she should shave if she wants to find a man (which is absolutely what you're doing btw). \n\nfeels like all the NTAs are people projecting their personal dislike of women's body hair onto this situation, and defending it even though no one was actually attacking anyone for not liking body hair. it sucks that it's often hard to find a partner with compatible values; it just sucks, and a good friend would just *let it suck* and sympathize, instead of telling you you should consider compromising on your values to find a partner.", "Where is the entitlement to male attention of affection? She was venting. She wasn't saying she was owed anything, just that she was feeling frustrated with dating. \n\n>maybe you need to decide what’s more important. Your body, your choice to shave; their bodies, their choices to want to give those bodies to any given person, for any reason.”\n\nThis sounds insane. You make it sound like she's demanding sex from men who aren't into her. Or like her decision not to shave her body is less important than the ability of men to find her attractive.", "Why would she want to be with a man who wants a woman to be shaved clean? That's not she wants. You're pretty much telling her to change who she is for a man....\n\nDo you guys even think before typing this stuff?", "Maybe she doesn't want to be with someone that would reject only because she has body hair.\n\nJust try and think it through for 5 minutes.", "If she was fine with the ones who didn't call back and saying \"who needs them anyway\" I would've agreed with you. But she wants them to call her back and gets frustrated when they don't. So she wants their validation. She didn't say \"I wish societal norms were  different\", she complained that they didn't call her back. It does sound like she's in denial about the reason.", "\"I refuse to please men\"\n\nshortly followed by\n\n\"Why can't I get a man?\"", "Its ok to offer advice to legitimate good friends when they consistently vent to you. Being single is clearly wearing her friend down, she's offering practical advice, not insisting she change her ways.", "I’m in my mid 30s and I’m embarrassed to say I’m only just learning this. Most of my friends are the type who want advice but lately I started making some friends who vent just to feel heard and receive some empathy. It’s hard to adjust sometimes but if you care about the person it’s important to try your best to give them what they’re looking for from a friend, and sometimes advice isn’t it. It’s a harder adjustment to make than you’d think but there’s no reason to actively resist it like some people are saying.", "i mean OP did say they provided validation like “the right one will come you’re beautiful!!” etc already, so to me it reads like the friend didn’t want to hear that and OP was like maybe she needs some actual feedback- which people should be able to receive from their friends, and it doesn’t sound like OP was abrasive or mean about it either\n\nalso of course she has a right to not shave, but she also can’t be upset when her personal decisions are seen as off-putting in the culture she is living in, where it is against the norm. she can’t act like she doesn’t know this. \n\nim a woman and i don’t care for the patriarchy, but shaving for me personally wouldn’t be my hill to die on. it’s fine if it’s hers. i can imagine that if she tells someone on a first date that “i don’t shave because i hate the patriarchy” many men would see that as a red flag, even if they are men who don’t conform to traditional/patriarchal gender standards in a relationship (cooking /cleaning / all that kind of stuff) i can imagine it feels like the tip of the iceberg to them, and they’re afraid she will come to resent them just for existing as men.\n\ni don’t care for the patriarchy but i also don’t care for a SJW, which it sounds like she might be selling herself as\n\nNTA", "Was the friend asked? It seems she just wanted to vent, there’s no mention of asking for advice", "Exactly. My advice to a friend like this would be to state this in their dating profile so that the guy has a fair heads up and it’ll weed out many who find out this fact on the first date and then leave her wondering, while very possibly narrowing the dating pool to more men who don’t mind.", "This sounds like unsolicited advice though which is something that always makes YTA. I get that people venting over and over about the same thing gets on your nerves at a certain point but then it's on you to speak maturely about the issue instead of trying to \"fix\" the friend's problem.", "Agreed. Assuming it went down like OP said, it sounds like she wasn’t trying to be malicious or cruel, just trying to offer some advice. And frankly the fact that her friend jumped straight to “gah you’re the type of people that are the problem!” makes me wonder if she makes it her entire personality. Obviously she’s not wrong one bit for being against the patriarchy, but if she’s the type to launch into full tirades about it on the first date then that could also be a contributing factor. Or she could just be a bit unlucky and get stuck going on dates with guys who are turned off by the body hair", "I wonder how clear the friend was that she was venting and didn't want any advice. I imagine that may get tiresome if that is a frequent topic of conversation. OP can also let their friend know that they don't want to keep having this conversation over and over.", "I agree and I'd add that if you vent about the same thing numerous times to the same person, you are implicitly asking. IMO you can only unload on people about the same thing so many times before it becomes an emotional burden for that person to keep their thoughts to themself. That said giving feedback to people is a skill. Honest feedback can be delivered in ways that hurt less and I think if more people developed those skills there would be fewer posts on this sub.", "No. She's TA. It would be one thing to say that men may be being put off by her body hair and help her set expectations. It's another to say she should shave to attract somebody. The first one is being honest about a trait she has that will act as a filter. The second is implying that she needs to change.", "You can be honest without being and AH. You can tell a friend \"a lot of men might have not shaving as a deal breaker, so your dating pool is going to be lower, it sucks, and you could maybe try shaving\" or you can tell a friend \"men aren't dating you because of your leg hair\" - two totally different ways to handle the same honesty. One shows compassion for a friend's views, other stomps all over their views.", "OP makes no indication that the friend has often complained about this-which doesn't mean that isn't the case, but I would think OP would mention it if this was something the friend frequently complained to her about. So while I agree that repeatedly listening to the same complaints gets annoying, if that wasn't the case here, I don't really see a need for OP to speak up yet. \n\nOP is also assuming that the friend's body hair is the issue, but jow would she know? The friend said she can never get past a first date, and I know we just got done with summer, but does OP know this friend always wears clothes that revealed her armpits or legs or both? Does OP know if the men the friend is going out with are just interested in hooking up and don't want to bother with someone looking for more? Does OP know if the friend has some other behavior that turns them off, or they talk about dealbreakers on the first date that reveals their incompatibility?", "The only \"truth\" that was revealed here is that OP is (bizarrely) bothered by her friend's decision not to shave. That's absolutely the only thing that OP's friend learned from that conversation.", "The way the OP described this makes it sounds like this might have been their first time discussing this subject", "Except none of what OP said was something they know for a fact? They're literally just out here guessing and also basically telling their friend that they should change their values to get a man.\n\nHonestly, makes OP seem like a dick more than anything else.", "Does she even know it's the truth? She took a random guess at why she's struggling with dates and it could have absolutely nothing to do with body hair. \"Honesty\" is not always \"truth\" and you best check your own biases before asserting it", ">There are so many people saying she's \"gross\". Unless you're the type of person who also expects men to be hairless, the only thing that's gross is the double standard.\n\nGosh, so perfectly said. I get so disgusted anytime someone makes a statement otherwise. Who would have thought that such a little thing would serve as such a good filter for the actual grossness in the world. I'd hate to think what traits they would look over to secure this kind of superficiality.", "Name 3 things women get shamed for:\n\nHair\n\nBirth\n\nBreast feeding\n\nNow name common traits of mammals?", "Same, I shave my legs and trim my crotch for my own pleasure, my partner doesn't care. The only shaving I keep on top of is pits - I have some strong sweat odor and hairy pits make it worse. And that's a self-assessment, not something other people have told me.", "There’s a lot of internalized misogyny cope in this thread lol. I say this as a woman who shaves (when I’m not lazy). It’s definitely bullshit we have to do it to be valuable to the majority of men. And honestly trailblazing women like OP’s friend will likely make it so our daughters or granddaughters don’t have to go through massive time-consuming routines just to pretend that being hairless is somehow more feminine than their natural bodies are.\n\nWe shouldn’t discourage these women. We should empower and support them. They shouldn’t change, men should change. It’s just hair and they’re already covered with it.", "She's saying she's having a great time and not getting invited back and is sad about it, so clearly she does want these guys. This reminds me of when I stopped wearing cargo shorts after hearing feedback about how bad they looked. Guess what, when wearing khacki shorts without cargo pockets women were more into me. The ones turned off by cargo shorts weren't bad people, it just wasnt a good look to a lot of them. \n\nWill plenty women not give a shit if I wore them? Sure, but if you are single and complaining about being singe, you should be open to moves that will increase your dating pool. Otherwise, dont complain about being single.", "But it would be BAD for OP to find a guy who requires her to shave. She’d have to shave the rest of her life and she doesn’t like to. That’s a waste of time and energy.", "If your good friend is constantly lamenting about their dating life, it’s 100% normal to have a convo about it. Part of which may be ideas on why and potential solutions - which is exactly what happened here. \n\nOP didn’t bring it up out of nowhere as a direct insult meant to hurt, no need to reframe what happened that way.", "I don’t shave and I have never had any issues in dating. It’s been comparatively very easy for me compared to many of my friends, including those who do shave. 🤷‍♀️", "Yea but it sounds like the friend maybe just wanted to rant a little and wasn't soliciting feedback. I have a hard time knowing when someone wants problem-solving advice or is just looking to rant, but I find most often people just want generic supportive statements while they get things off their chest. \n\nI think giving advice on a specific aspect of someone's appearance is tricky. It's just a bit rude, unless friend specifically asks for it.", "Yeah this \\^\\^\n\nIf you're putting obstacles in your way then STFU and stop whinging about it.\n\nSure, you can do you, but if you're going against 'the norm' then you have to accept the consequences that less people are going to like it.", "It’s all relative.  I have a friend who had a ton of facial piercings and wanted to find a woman to settle down with.  As it turns out, a lot of people interested in heavy piercings aren’t often the type to build a stable life at that stage of life.  He ended up removing a few and he quickly found the person he married, who did joke over the years that she probably wouldn’t have gone for a second date if he looked like his old photos.  Sometimes you have to compromise on your personal values to achieve goals.  There are certainly guys who are more feminist but still don’t dig body hair.", "I agree. She keeps complaining to OP about guys not wanting more dates after the first one though. OP just pointed out the possible (and truthfully probable) reason.\n\nShe can do or not do anything she wants with her body but shouldn't be surprised if that doesn't meet others'preferences. Of course she shouldn't change to suit them but should be aware enough that this will be a deal breaker for many.\n\nNow if she was venting about how superficial these guys were over body hair and OP said well maybe you shave, it would be a different judgement.", "True, but that’s also part of the info we don’t have in the post. Does OP’s friend have a “type”? If she’s attracted to buff gym jocks, those guys don’t have a lot of Venn diagram overlap with guys who are ok with hairy women. She needs to look for a partner in social circles of liberal anti-patriarchy people. That’s where she’s likely to find a partner.\n\nIf the friend is already searching granola circles and can’t find a guy, then she maybe just needs to deal with the fact that the patriarchy in this regard is very deeply rooted, and she has to choose between her desire to take a stand and her desire to have a partner.", "Yeah it's clearly not a \"superficial\" reason to this girl. \n\n\"Hey I know you're vegan for ethical reasons, but have you considered eating meat anyway? It would make it easier to get a date.\"", "💯", "My guess would be that it's not so much about the body hair, as about the reasons why or more specifically how they're presented. \n\nNotice how OP never states that the friend prefers having long body hair. It's always presented as a protest against The Patriarchy, and that the only purpose of shaving/grooming is to make men happy and ~~oppress~~ suppress women. \n\nWhile I'm on board with her working toward women's equality to men, this kind of language is a red flag. I don't want to be in a relationship with someone who views me as their oppressor because of how I was born. I don't want to be in a relationship with someone who views my accomplishments as being unearned or tainted. This sort of language would make me worry about whether she would casually or purposefully use hateful or derogatory language about men, which I don't want to deal with - especially in my own home. \n\nMaybe it's just my life experiences, but I would be wary of her viewing me as an equal partner in a relationship. \n\nBut also, it seems weird that her idea of a political protest is something that only affects her and her romantic partners, and isn't visible to anyone else.", ">OP’s friend is comfortable in herself and her body and does not conform to society’s standard of ‘beauty’\n\nMaybe she isn't comfortable but gets out of her comfort zone to push back against beauty standards regardless. Imagine how much more that would make it hurt hearing this type of unasked for dating advice from a friend. Just a big fat no from me. Always ask people if they want advice before giving it and never assume it's looks/superficial things that get someone rejected. I'm praying OP doesn't have a visibly disabled friend who also struggles with dating...", "It’s more balanced out now. About every other comment is YTA from what I can see. \n\nThe comments that are saying NTA are, imo, missing the point that OP gave unsolicited advice her friend would definitely not have liked to hear.", "Exactly! If it's that important to her, it's okay if it's a deal breaker for her. It definitely does narrow her search but it wasnt a bad thing for me. It just helped me gain focus on the person who loved me for me, even when I wasn't at my best", "I agree! I should have clarified further, I also think that friends and loved ones can classify as people being 'perfect for you.' Anyone who pushes you to be your better self while still loving you is the person you're supposed to be with, that could be romantic, platonic or familial. I also know people who are more satisfied being a parent or giving back to the community than in the pursuit of love. Regardless, I think cultivating one's relationships, romantic or otherwise, nourishes the soul. My best friend isnt interested at all in dating but always has a variety female friends that occupies her time almost as much as a partner. She's happy, and that makes me happy. But it sounds like OP's friend wants to be partnered, which is why I suggested gentle comfort and encouragement.", "I was more thinking 'continue to work on yourself and build up self esteem'. There is nothing wrong with her, I had to work on my confidence and living my life the way I wanted to, regardless of whether people where disgusted with my leg hair. Everyone deserves to feel comfortable and confident in their own skin. Work on yourself can  mean exercise, self care, spending time with friends. I learned that it's far less healthy to focus on people who dont find you attractive than it is spending time nourishing yourself.", "Same tbh. Most of my relationships didnt work out because of a lack of chemistry, not my hair. Heck, I've been with people who PREFER body hair. OP's line of speculation is not helpful and just hurtful. I've met a lot of women who shave who are just as unlucky in dating", "Agreed. She doesn’t want to be with someone who is repulsed by hair in the first place, so no point catering to that.", "Yep, the body hair is a filter, and I think its a pretty good one too.", "Yup, better advice would have been to recommend that her dating profiles have pictures where the hair is visible, for example, to weed out anyone who would be silly enough to not want to date on that basis.\n\nSeems unlikely to me that the body hair has anything to do with it tbh. But if it does then saving her from wasting her time with these guys would be more useful. \n\nTelling her to change a decision that she made about her own body on principle, so that she can attract men who she disagrees with about said principle, is just terrible advice. \nYTA", "Any way you look at it op's comments should be helpful though. Even if shaving isn't the answer, it appears her friend truly isn't aware this is why she isn't getting second dates. \n\nShe's frustrated/angry she's not getting second dates. She's angry at guys for not wanting hair. She transfers that to op for mentioning the link between the two.\n\nShe can embrace it (mention it in her profile if online dating?) so she's not wasting her own time since it's important to her.", "she should check out hairy people dating sites", "Yes, but at the same time it does limit your dating pool a lot if your standards are very specific. You can either have really high standards and specificity or you can have a large number of potential partners. The more qualifiers you add the fewer options you have and the more compromises you’ll have to be willing to make elsewhere, especially if you aren’t a top tier desirable catch.", "I honestly think the people kicking up the most fuss about body hair are either very young or have their own deep-seated body issues they're dealing with. The young ones just don't have as much experience with humans living and dealing with their own meat suits than older people do. Once you are in a place of relative peace with your body, you think someone being a peace in their own is really freaking cool.", "> I think we hear about how disgusting men think hair is disporportionately to how much men actually care about or are disgusted by hair.\n\nI suspect it's like unsolicited dick pics; most men don't send them, but the ones who do send thousands. The guys who are loudest about what they \"don't like in women\" aren't representative of the majority at all.\n\nIf they were, they wouldn't have to sell it so damn hard.", "Agreed. Highly doubt body hair is what is preventing her from getting a second date. Yes, a lot of guys “prefer” shaved body hair but in actuality I’ve never known a guy to have an issue when there’s a real woman in front of them. I didn’t shave for my entire dating life and even guys who have a preference were fine with it \n\nAnd obviously who would want to be with someone who pressured them to look a different way? OP really shouldn’t have made that comment. Her friend KNOWS she’s going against the grain", "I have never shaved and, like you, I wouldn't want to be involved with someone who would shame me for that. I'm *supposed* to have hair.", "Agreed here. Not OP, but it's never been an issue for me. Unless we're talking some ridiculous arm-curtains*, why would that be the primary tip. Presumably she's hygienic, and normal body hair seems a weird hangup for those dudes.\n\n *I have to trim my own arm-pits as a man, it just flows like Aragorn's hair.", "One of my best friends doesn't shave anything and always had boyfriends before settling down with her husband. Good boyfriends too. I doubt its the hair that is the issue. Maybe something more personality-based, but I've found plenty of men who literally do not care about hair, especially if you are pretty/have a good personality otherwise.", "yeah honestly I've seen way more judgment from women and gay men about hair then from men. \n\nI remember being in a mixed gender social setting where a woman was talking about how disgusting leg hair was on women and she trend to the men saying \"you'd never date a woman with hairy legs, right\" and they were like \"uhhhhhhh\"", "Same here. Only few times someone cared they turned out to be very bad people overall. No thanks :)", "1st mistake: asking a bunch of redditors how they would handle a social situation", "Probably armpits. People get really weird about women who don't shave their armpits.", "Everyone has the right to like or dislike as they please.", "Let’s also consider that dating is rough for the majority of individuals. Suggesting someone change who they are when they confide in you about their struggles in the wide world of dating is not the way! It’s just tough out there, especially if you’re looking for true connection. For all the people coupled up, imagine going back out there and dating again. You wouldn’t want to.\n\nFWIW, I stopped shaving when I was very young and enjoyed many years of being single and living life my way. Nobody cared about my body hair. I made sure I had at least one photo that showed armpit hair in my dating profile, so it was clear that that’s what they’d be meeting. I figured I didn’t want to hang onto with someone who cared about it, so let that photo filter those people out.\n\nWomen shaving was marketed to sell men’s razor blades to a wider market. It is a capitalist invention.", "In 1915, a beauty magazine started advocating for women to shave their armpits and legs. Why? So Razor companies could sell more razors. Anyone so shallow as to turn down a second date because she doesn't shave her legs, etc. isn't worth her time anyway.", "Women do call men gross for \"too much\" body hair. I've been on the receiving end of that and I've seen other dudes get that same reaction. My own wife has also been watching a show and seen some ultra hairy chested guy and just say \"that's disgusting\". I've even known girls to like guys who are not just clean shaven but full body shaved save for the hair on their head. It DEFINITELY exists towards men as well it's just not nearly as common but there are still LOADS of women who find hairy guys gross too and will tell them or ignore them. Again, everyone has their own desire in what they want their mate to look like.", "There was literally a whole thread yesterday if a man posting that he wanted to grow a beard and his wife said beards are gross. Plenty women in the thread agreed.", "Two things:\n1. What an individual considers ‘gross’ is entirely up to the individual. You may not find body hair gross, others do. It’s a personal preference that you do not get to define.\n2. Men do get called gross for having body hair, and so,e women will not date hairy men.  And some men do shave body hair.", "….. I think men who don’t handle their hair are gross. I’m a woman. Preference/gross they’re the same. In fact I think men’s hair is a lot grosser than women’s when looking at partners. I personally would not get involved with a man that didn’t take care enough to at least trim their shit. \n\nNot sure why the cultural norms change personal preference to you", "I'm a woman and I definitely find excessive body hair gross on both men and women. It's a massive turn off and a deal breaker for a new partner.", "Men get called gross all the time. One of my friends looks like has a carpet on his back and he’s had a few instances of getting flat out rejected for being unkempt by not shaving.\n\nAbsolutely many guys would think a woman having a full on beard would be gross. That’s not an incorrect word, just not a feature I would want in my wife nor would I want my daughters to have to deal with.", "It's not as common but men absolutely get called gross about many types of body hair. Big carpets of chest hair that pokes out above their t shirt collars, backs covered in hair, hair growing out of their noses and ears, beards running down their necks untrimmed and untamed - these things all get called gross by people who don't care for that look.", "Plenty of women reject men for body hair. I like it/don't mind it but sooo many women have been mean to men for body hair too. I'm not saying it's right to body shame but we are socialized to think it's gross when it's normal so it's not surprising someone thinks that.", "I think your personal taste is your personal taste. If you find anything gross, it’s gross", "Gross is an opinion. You might not think it’s gross, but others do.", "“Men do not get called gross when they have body hair.”  Yeah they do - not by everybody, but they do. AND some people, men and women, think it’s gross when women don’t shave. You may not like that they feel this way - but that’s your problem, not theirs.", "you need to get out more and see how things work in the world. men get called gross for that all the time. humans are superficial creatures that live life with vision as our most powerful and used sense. people are going to judge things based on appearance. it is just a fact of life no matter how angry you get at it. but people get judged all the time for how they look. and if you think it is just women that get judged for body hair then you obviously dont open your eyes to the particular fact that men have to shave beards every day", "Gross is a subjective term. Is eating insects gross? Depends on your culture.", "I would reject a man for body hair. Back hair is a no for me. A huge beard? No. Man bun? No. \n\nSorry, it is the truth.", "I'm a man and have absolutely been called gross for my body hair. To be fair, I have a lot. It grows _everywhere_. I can't help but feel self conscious about it.\n\nHaving said that though, I find women with natural body hair more attractive. Probably because they accept that human bodies are just hairy.", ">Men do not get called gross when they have body hair\n\nIt's a preference, as a woman I personally find body hair gross on both men and women. If you don't find it gross that's fine but why do you care so much about others' preferences?\n\nEdit: ofc I wouldn't insult anyone with body hair, just saying my preference is little body hair (especially in the private areas & chest)", "I’m a woman. I find body hair gross. People are allowed to feel things are gross. I hate body hair. That’s absolutely fine.", "Men can get called gross for excessive body hair, lying doesn’t help your point", ">Men do not get called gross when they have body hair so I have noooo idea why women should be.\n\nAhhh. I've been guilty of that. I feel bad about it now. I was on line for the movie theatre once and I was wondering why this guy way in front of us was wearing a damned sweater in Summer 90 degree F heat and I made it a topic of conversation among my group. Then the line snakes around and we got closer and I realize dude has a black tank top on, he wasn't wearing a sweater, it was just his body hair. It was so thick and covered all of his arms and back up to his neck. I was maybe 18/19 and we said some really unkind things amongst ourselves. I wouldn't judge him that way now, but I would not be interested in dating him.", "I was on Reddit the other day and read about a husband who wanted to grow a beard but his wife said they are gross.", "I think a lot of times with men, when they first see a woman who opts not to shave they take it as the woman not caring about appearance (not saying that is true, just their perception). In the winter and colder months, I rarely shave because it’s a hassle and my fiancé is always like so what! whenever I bring it up as joke like ‘yikes look at my legs’ But I feel like if I had tons of hair on my legs when we first met he would take it as I either didn’t care about putting any effort in for him, or I just don’t care in general. As far as pubic hair, I do see why some people have preferences with that. I personally will shave right beforehand if I need to because I don’t like it, but I do think ‘gross’ is a harsh term. It’s just hair 🤷🏻‍♀️", "I think uncut men get called \"gross\", and thats body mutilation so yeah double standard do exist...", "This is all part of the weird infantilisation/rapeculture/paedophiliac/belittling of adult women. Adult women have hair! Get over it. \n\nAs an enormous homosexual I like big hairy men - I.e. men who are sexually mature I like to think if I were heterosexual I would like big hairy women. Someone who can only deal with a stripped/hairless/smooth barbie doll have issues! (Obviously no disprespect to those women who are pretty hairless…personally I have three strategic patches just to confirm you’re not a paedo and my arm and leg hair is negligible).", "Take this from a bi girl. i want my man and woman shaved. I will shave. Do I think it is gross? Yes, only if you i am having sex with that person. in case of someone with whom I am not sexually related, then definitely no. Idc what one does with their body hair, unless i am getting involved sexually with them. Also its not like they have to shave it everywhere. i just want it shaved in specific body parts.", "Thank you. Looking like an adult is perfectly okay.", "Idk the vast majority of men I’ve dated have at least trimmed their pubes. I think that’s fairly common these days, especially since it tends to make their dicks look bigger", "So let me get this straight, you’re going to say men can’t express their opinion on female body hair, in the same paragraph expressing your opinion on male body hair, and you don’t see anything wrong with that sentiment? Can we just cut the “you can’t have an opinion because…” talk and just say that however you identify you have the right to whatever opinion you want when it comes to the topic of body hair?", "Men have the right to think anything is gross, just like women have the right to think anything is gross. You're not entitled to other people's preferences, that's just wrong.", "I think this comment is gross", "It’s huge “I’m Peter Griffin and here are my demands: no fat chicks” energy.\n\nAnd it’s why there’s retaliation happening in the dating world. Because as another poster said: you can’t police others’ preferences. But you can surely put your own out there.", "> I disagree that men have the right to think hair on women is \"gross\".\n\nLet people have their preferences, if a woman finds me gross for having something natural like a foreskin then who tf cares, she's just not for me.", ">. Guys who groom their bush are fairly rare too.\n\nToo funny and true. And no hypocrite here. Lol", "This is a weird take.  Anyone can find anything gross. You can't dictate people's personal preferences.", "You reqlly think you have the right to tell men what they have the right to think is gross?", ">I disagree that men have the right to think hair on women is \"gross\".\n\nI mean, they are though, and they do.", "Yeah but she doesn’t want to date that 66%. So it would increase her chance of getting more first dates, but not of finding someone actually compatible. \n\nAlso, you can’t compare not shaving body hair to having bad hygiene, they are not remotely the same. Body hair is natural and healthy, and shaving it is purely an aesthetic choice. It’s also a double standard between men and women.", "I am 110% in that same boat. It had always been hard for me to not offer advice when someone is complaining until I realized I didn’t like it when people offered advice when I just wanted them to listen. It became a “yes I know how to fix it and will, thanks. I just want to feel heard right now.” And then it clicked that others are probably thinking the same. I ask “are you in vent mode or solution mode?”\n\nI also very much so understand not wanting to take on emotional weight when you feel like the person doesn’t want help. I will say, though, that sometimes just being the sounding board and validating their frustrations can be the help they need to have a solution click in their mind so you ARE helping. But you don’t owe anyone your emotional space really so it’s always up to you if you want to engage.", "You could ask instead ‘are you looking for emotional support or advice’ so you don’t cut yourself off from people and their problems. You’re 1000% entitled to protect your peace, I’m just saying sometimes we all need to vent, and if you can’t handle it some days, telling your friend in a kind way can seem less hostile.", "Yeah-- I agree. It's clear that enough people like her enough (at least initially) to meet up. Perhaps her being up-front about her body and her choices might ensure that future partners are aligned prior to meeting", "I think mr twit is the reason I hate hairy men. I can’t believe Rohl Dahl created my preferences", "I completely agree. I have seen that look. I was told a guy had showed up to a first date wearing sweats and a ratty t shirt and flip flops. This was  from my SIL's dating history. And I was like Eeek..\nShe said he was a amazing guy. But that first impression killed her.", "Upvote for the Twits reference!", "Like I said, I saw it more as venting than asking for advice. \n\nObviously she could meet more guys if she conformed to beauty standards a bit more. She’s aware of this. Women who don’t shave are very aware of the fact that a lot of men don’t find body hair desireable. But to her, a man who expects his partner to shave isn’t the right man for her. And if she shaves just to meet more guys, she’s going to be meeting guys who don’t see eye to eye with her on these issues. \n\nShe’s just frustrated that she can’t meet a good guy for her, and was venting to a friend. She didn’t need the advice of “just shave”.", "How many times do you have to let someone vent before you’re  allowed to have an opinion? I get offering support, but no one is a never ending support punching bag", "How many times does your friend need to vent and say they \"just dont understand why\", before you bring them back to reality?", "She talks about multiple dates. So you can assume it's frequently..", "I’d be interested to know what physical attributes she prefers in men and off she steps outside them.", "I for one believe amphibians to be the most feminine of all the animal kingdoms.", "this is so cool! and so well written. women only started shaving when razor companies targeted them bc men were away fighting in WW1 and they needed someone to be buying their products!\n\nif women were never told there was anything wrong with their body hair they’d never think to be ashamed by it and shave it off.", "I have no hair on my legs and arms due to medical reasons so I never shaved (I also barely have hair on my head so I wear wig daily lol, fair trade idk?). I remember back in highschool when my friend got super angry pointing at a girl and saying \"does she think we can't see the hair on her legs? We can see she doesn't shave! That's gross\"\nI was so puzzled as to why it was such a big deal? Definitely sounded like jealousy that this girl didn't mind having body hair and didn't feel like she needed to shave. I wish people didn't care about this.", "Yep. I'm an older millennial woman locked in the shaving mindset. But, I associate body hair with body odor, gross stuff getting caught in it, etc., for myself. I shave and wax regularly. For me, I prefer my hair to just be on my head, and I'm okay with that, even if the origins of that preference are not great. But, my stepdaughters are not nearly as worried about shaving as I am. They'll sport hairy legs & pits whenever they want, and I'm absolutely behind that. Recently one made an offhand, but rueful, comment about not shaving because she's too lazy. I said something about how she certainly doesn't have to and that if she doesn't want to, there's nothing wrong with it. Not shaving is not for me, but others should feel free.", "I am a woman who doesn’t shave my legs or armpits, and it’s honestly so cool how body hair is a sensory organ! I can feel how my body moves through space in a completely different way to when I don’t have hair in those areas, and my husband doesn’t gaf about my hair :) I am a truly lucky person ☺️", "I agree with everything you said, but I also think it comes down to the individuals personal preferences, as well; i.e. I’m a woman and not currently dating or in a relationship with anyone but I still shave because I don’t like the way it feels when my body hair gets too long. I especially hate wearing jeans when my leg hair is passed a certain point. \n\nSo I don’t think everyone is doing it to be more desirable. I mean, sure, when I first started shaving in my teens, I started because I thought “that’s what women do,” but now I just do it because I like how smooth skin feels better. If I had never started, I guess I wouldn’t know the difference, though lol.", "Its not gonna change.", "Yeah they are the same, if you aren't so hyper sensitive that you need perfect phrasing and careful eggshell-stepping every second of the damn day", "It should be.  They were speaking in the context of her finding suitable partners.  \n\n\nAnd if she REQUIRES that kind of crafting of words in casual conversation amongst friends, that is probably as much of a reason she can't get second dates as not shaving.", "LMAO\n\nAnyone who needs the response phrased so robotically has waaaay more problems than men who aren’t into body hair. I’d be kicking that Sensitive Sally to the curb and finding friends who are able to process casual conversation.", "It is the same, if you’re capable of simple extrapolation and critical thinking.", "To make it clear: I don't think OPs friend should feel like she needs to start shaving to find someone. That's her choice. All of that being said:\n\n> But it would be BAD for OP to find a guy who requires her to shave. She’d have to shave the rest of her life and she doesn’t like to. That’s a waste of time and energy.\n\nWhile finding a guy that \"required\" her to shave would absolutely be bad (because that sounds demanding and fucking controlling), I think it's important to mention that dating and relationships are very much a matter of compromise. Everyone does things to be more appealing to potential matches, men and women. Sometimes, those things might not be to their normal preferences.\n\nIf deciding to shave opens up a much larger dating pool, it might be worth it. Or it might not be, depending on OPs friend. At the end of the day, it's up to her to decide how important the issue is to her. But I think it's silly to act like we don't all make compromises on certain issues when dating.", "My mom has never shaved any part of her body and has had four husbands. I sometimes shave my underarms and legs in the summer but not often and I have a much easier time dating than pretty much anyone I know. I also have zero interest in anyone who wouldn’t want to date me because of my body hair, 9/10 those are the same men that think going down on women is gross.", "I was 28-32 in college, stopped shaving anything, and wore shorts and tank tops all the time. The hair was visible. Still had guys hit on me and ask me out. No one cared.", "Right? I (Mediterranean level hair genes) had a few dudes I dated for months before I found my husband and I never shaved anything except my unibrow, lol. I’ve had long term relationships actually request I stop shaving when I was younger and thought men like hairless women. A lot of men find it a turn on. \n\nI’ve noticed a lot of American men have a hairless preference. Pretty much any dude I dated from another country was the opposite.", "Same !! It literally just never comes up (it's also clear when you meet me/on profiles so I guess they self select out?)", "Yeah. That’s the irony.  This entire thread became a rumination on hair and misogyny, when it’s *really painfully clear* the issue is the friends personality\n\nThe guys are breaking contact after *multiple dates*\n\nIt’s absolutely not the hair. The friend does sound exhausting honestly. That’s why these guys are like “hey no hard feelings, but this is….. a lot”\n\nShe’s gotta be who she is, but she probably needs to date a fellow revolutionary.  Most people burn out on even righteous rage at some point", "Same", "Congrats on being attractive? I swear this thread reads like all the participants are highschool \"mean girls\".\n* \"Real friends show support for each other no matter what\"\n* \"Even when that means pointing out harsh truths?\"\n* \"I said show support, you don't have to actually care DUH you are such a square\"\n\nLooking past the humble-bragging -- different people have different issues with body hair. I'm picturing an elven lady telling a lady dwarf with a full beard \"of course you don't need to shave your body hair to attract a handsome man\".", "It's not unsolicited, if her friend has had multiple times of her complaining that dates go nowhere, which is the case. Eventually just saying the generic \"oh you'll find the right guy eventually\" gets old and is unhelpful.", "Yup. The dating world has endless options now, especially for women. There are more potential dates than you could meet in your lifetime. It's not like in the old days when there were 5 guys in your hometown and you had to appeal to them and hope to get the good one. Sorting through the masses to find a good match is the challenge now. It's best to put your peculiarities on display as much as possible, so you attract people who like them.", "Yeah, NTA. It’s not what the friend wanted to hear or how she wants the world to be, but it is how it tends to work.", "I go back and forth with shaving. I like the feel of my legs when they're shaved in particular, but sometimes I just don't feel like it and kind enjoy seeing the growth. If a partner had a strong preference either way to the point that they wouldn't be with me, they can hit the dirt.\n\nBut, I'm also 39 and in the years I've been dating, both men and women have generally eased their stance on body hair. I think both age and general cultural acceptance have made it easier.", "That analogy cracked me up, thanks.", "I wish you could see how hard I laughed. Take my gold 🥇", "That's like asking a bunch of virgins what they're favorite sex position is...\n\nOr asking your dog if it likes first class, business class, premium economy or economy the most.", "In the puzzled words of J.D.\n\nWhere do you think we are?", "I actually didn’t shave my pits for a while and some dudes find it hot. The legs were a no-go for anyone though.", "Those same beauty magazines are coming after men now with increasing pressure on men to look a certain way.\n\nThose moisturises, razors, accessories, waxes, fitness, clothes aren't going to sell themselves.\n\n\"Fashion is such an ugly mistress that she has to change her face twice a year\"", ">Anyone so shallow as to turn down a second date because she doesn't shave her legs, etc. isn't worth her time anyway.\n\nMeh.\n\nI remember one lady I went on a couple of dates with who did not shave at all. Full natural legs and pits—the works.\n\nBeing the progressive feminist type that I am, I tried to ignore it and not be \"shallow.\" But I couldn't help that it was a big turn-off that gave me the \"ick\" even though I didn't want it to.\n\nIs shaving entirely a cultural construct? Of course it is. But I was raised in that culture and it is deeply embedded. I can't *choose* to find hairy legs attractive just because I know, on an intellectual level, that it is irrational.\n\nAll of that to say that I don't think it is fair to call people shallow because arbitrary things turn them off. \n\nEveryone has turn-offs and they're mostly all arbitrary.", "People like what they like, no need to put people down for having preferences. It's her right not to shave, it's their right to not like it. That's free will.", "Tbh I don’t think anyone should be saying “gross” or “disgusting” when talking about another’s body. That is a human inside that body with thoughts and feelings and if you’re too simple minded to express your preferences with different words, that’s a *you* problem.", "Well sure but women aren't going up to young boys in middle school and saying they have to shave their whole bodies or else they'll be ostracized by anyone and everyone.\n\nIt's just not the same, at all.\n\nConsidering pretty much all girls in the western world shave and all boys don't, you'd think that would be pretty obvious!", "As a big hairy guy it's 100% a thing. Some like it many do not, especially in the age of things like more fem looking men being the more model male. Like Justin Bieber and Kpop, they have certainly affected a lot of what many women see as acceptable body hair", "you can have basic hygiene without being completely hairless?", "Preference and gross are not the same, at all.  I prefer taller partners, I don't think shorter partners are gross.  I've dated mates who shaved clean, kept trimmed, and others who did nothing, and while having preferences, never thought \"gross.\" That is an absurdly reductionist attitude.", "Think there's a difference between grooming and believing someone should be clean shaven everywhere or they are gross", "Yeah I’m a dude and I’ve been called gross by women because I have back hair. It happens, I’m a hairy dude. (This is a response to the poster that said guys don’t get called gross for it).\n\nMy wife likes it, and she helps me groom areas like that, since we live in Florida and I don’t need to be getting yeti/Sasquatch sightings called when I go shirtless in the springs and beaches. \n\nPoint is your preference is totally valid, totally ok, and I don’t blame women one bit for not liking body hair. I love it when my wife shaved her legs, so I assume women enjoy it when dudes groom some stuff too.", "“Handling” doesn’t mean shaving. Unless I am misunderstanding and you are saying that men with any body hair are also gross. I would disagree, but you are right in that it’s a personal preference. Either way, the word gross sounds extreme regarding a woman not shaving. It doesn’t mean she isn’t keeping herself clean or neat.", "Women shave because Gillette wanted more money back in the good old days.", "That's called grooming, and you can do it without shaving.", "lol. you wouldn’t exactly know if your preferences were shaped by cultural norms. hint: they probably are.", "That’s not the same as society expecting women shave their arm pits or legs for no beneficial reason other than to please men.", "Do you date men with shaved legs? It doesn't sound like she's dirty, just that she doesn't shave and instead trims", "I think all body hair on everyone is gross, but I know that’s just a me-thing.", "What would you say if someone said \"i think dating the same Sex is gross\" Would you then also proceed to say we'll thats just a preference?", "men are not expected societally to do anything about their leg or armpit hair. don’t pretend it’s comparable.", "The fact that there are so many manscaping products shows that men are trimming and shaving now.", "Omg thank you. I always feel like I'm the only person. Body hair always annoyed me on everyone, I kinda wish it was standard for men to shave too. \n\nThat said.. I don't mind a tidy bush but I don't wanna fight through a jungle", "I think it's strange when a man's preference is for a woman to look pre-pubescent and hairless to be honest. Naturally women have hair. Children however, don't have the same. Strange that some prefer women to look like children", "I find it gross when men do shave their body hair", "Yeah, a man with a back covered in hair is gross to me(47f). And shaving isn't going to fix that.", "Guys aren't waxing their nipples for other guys, generally. There's plenty of \"old gross dudes\" in movies, and largely they've got chesthair like a sheep, it's a stereotype.\n\nMale body hair is just like female body hair (all hair really) - it requires upkeep to be aesthetically pleasing. I'm not rocking a mountain man beard even when it's acceptable. Just looks unkempt.", "Dude I had back hair and spent lots of money on hair removal because I hate it and it’s gross. Commenter above is delusional.", "I'm guessing it's the what makes too much that's more the point?\n\nLike a guy has leg/arm/armpit hair way less people will call him gross than if a woman had the same.", "Yes, the common insistence that the only non-gross sex partners are the ones that look like prepubescent children is unnerving at times.", "It's pretty daft when it gets to the point of 'you're not allowed to have a sexual preference'.", "While people have a right to their preferences, we would all benefit from a willingness to examine where there's preferences come from.\n\nIt's absolutely fine to say out loud that you like the way shaved skin feels or that stubble irritates your skin when a partner touches you with it. But, it's ridiculous to not acknowledge the fact that beauty standards for both men and women are the result of advertising and familiarity.", "What they mean is it's a disgusting and unfair opinion. No one is saying the thoughts should be brain-zapped out of them or that they're illegal. They're saying they don't have a MORAL right, which I agree with. It's a stupid, fucked up double standard and you know it. Don't try to hide behind justifications by saying \"technically he's allowed to think whatever he wants!\" okay? And people are allowed to say \"hey, you're a shitty person and a hypocrite for thinking this.\"", "For what it's worth I don't think people should have the right to say a natural dick is \"gross\" or to cut that part off their babies either.", "It certainly seems she does want to date that 66% because she is upset she hasn't gotten a call back after the first date. \n\nWhich means she is upset that some of the 66% hasn't called her back. Of course she might just have a shit personality, or other issues. But given the info in the OP, we can assume based on the fact that she had fun on the dates, that that isn't the case.", "It’s also a possibility that she has a personality quirk that makes her less unattractive. OP is her friend and likes her, but maybe when she’s on dates she has a behavior that men don’t like. Some men don’t mind body hair on women, but it does seem like an obvious possibility so OP really just kind of pointed out what a lot of others would be thinking, as you say.", "To me, it sounds like this was the first conversation on this topic where she was venting and OP said multiple times reassuring things then switched up. Plus I doubt the friend wants someone who places such high value on hair on women", "There's also the factor that clothing showing off those body parts was becoming acceptable. Prior to the 20s you generally didn't see a woman's legs unless you were a family member.\n\nI'm not saying there wasn't a market motive, but the fashion shift can't be ignored", "I go through phases where I shave because I like the feeling. Then I don’t want to and don’t for a few months. I’m married and, while my husband likes it better shaved, he doesn’t really care and supports me doing me (and it doesn’t affect our sex life at all).\n\nI think that’s the ideal, really. Do whatever you want. But there’s a LOT of social pressure to shave. And I think a lot of my preference to shave is subconsciously routed in that. The sensation of shaved legs is nice sometimes, but the effort to keep them that way is great. And honestly you’d never have even grown a preference for it if it wasn’t for the societal standard in the first place.\n\nIf the standard was for women to shave their heads for the past 100 years, then there would be a lot of women then claiming they prefer it for whatever personal reason. They love the breeze on their scalps lol I dunno. But it’s still just an arbitrary removal of body hair. You can shave whatever you want for whatever reason but it’s def not something people arbitrarily prefer the feeling of in a perfect vacuum.", "I feel the same.  I agree that plenty of people shave because they feel pressure to, and I wish that weren’t the case.  Your body is beautiful no matter how much or how little hair you have!  However, whether it’s for aesthetics, physical sensation, or whatever, there are people whose hair removal isn’t about what other people think or say.  \n\nFor example, I’m neurodivergent and have sensory difficulties.  Hair in certain areas can make my brain go *RAWR*.  I shave even for backpacking trips alone in the mountains.  I’m not worried that pikas and black bears are going to notice the hair under my merino leggings and judge my femininity.  I just know it’ll add unnecessary stress to my life.", "It literally changed to get here. Standards are in a constant shift. You have the limited perspective of your lifetime. I have friends who don’t shave. I frequently don’t. I’m married with a kid lol. Times are definitely a-changin. As they always are. It’s natural.", "Yes.  At what point have we gotten to that we have to construct the perfect sentence to have a conversation with good friends. You should be able to have an honest conversation as long as you are respectful.", "A suitable partner for her would be one who doesn't care about body hair. OP wasn't talking about her friend finding a suitable partner for her, she was talking about her friend finding any partner.", ">if she REQUIRES that kind of crafting of words in casual conversation amongst friends, that is probably as much of a reason she can't get second dates as not shaving.\n\nBingo. That would be a deal breaker to almost any healthy person.", "literally. ppl are always like ‘omg no one asked for ur advice’ like u complain enough about ur situation to me imma give u advice", "Endless options to fuck, not endless options to get into a monogamous relationship with. The number is still the same. Just cause a guy wants to bang you doesn't mean they want to date you lol", "Yeah, I used to worry so much about body hair but I'm your age and neither me or my husband can be bothered worrying about it.  He worries way more about his body hair than either of us worry about mine.  Sometimes, I shave because I want the look and feel with an outfit.  Most of the time, I'm pretty fuzzy.", "I just wish everyone took the time to examine their personal \"preferences\". Like you, I live in a humid climate and prefer less body hair on myself for comfort reasons. It's a little different than men wanting to have sex with me if I let my leg or pubic hair grow out. Too many people are unwilling to admit that a lot of our preferences are simply the result of what's advertised to us rather than a purely internal decision.", "It's not okay when it happens to guys either.", "Florida could have a real sasquatch roaming around and it would be no big deal compared to the other crazy sh*t down there.  Because, yeah, FLORIDA. For real though, it's all about preference and comfort. You do you Boo. Hugs from the other sunshine state, aka dry Hell, aka Arizona.  For the record, my partner keeps his down there tidy too, because as he says \"nobody likes schweady b---s\"", "My grandpa is super hairy and my grandma gives him a full body groom with clippers every 3 months 😂 I think it's so cute", "My partner is hairy from head to toe too. I actually prefer that he doesn't shave his back/shoulders, mostly because it's then prickly. I think he's okay with it either way (though I did get the sense he was shaving it for my benefit).", "I LOVE back hair. And if I do, there’s a tonne of people out there who also do because I am bang smack average!", "Fucking upvote my fellow Floridian going shirtless in the springs!!", "Xactly. There's many reasons people don't shave. Comfort, sensitive skin, allergies, and religion, to name a few. But, you can still trim and maintain a well manicured 'lawn'.", "Shaving is also grooming. I shave my face because my girlfriend likes it. Otherwise I would just trim 90% of the time.", "... part of grooming hair is cutting it though", "Feels like collective gaslighting. I thought it was widely accepted that everyone knows shaving is an unfair expectation put on women, and that we don't really have a choice. You HAVE to when you are in school, or you won't have friends, you HAVE to do it to be accepted in society unless you are hiding it by wearing pants all the time. \n\nWhy are there so many people pretending that that's not the case? Men don't have to shave like this and they know it. So why the willful ignorance and all the fake analogies acting like men and women have the same expectations put on them? It's like people denying the moon landing is real. It's absurd.", "If it helps, the original reason we all started shaving our legs was because a company wanted to sell more razors, so they aimed the ads at women. 🤣 It wasn't really to tell us men liked our legs naked better.", "And I am not attracted to women or men who don't have pubic/leg hair. I can't stand stubble, and I just don't like the feeling of \"smooth\" legs. Pubic hair is hot. \n\nI also know I'm the outlier with this opinion!", "Not just you. I even hate my own body hair.", "A lot of men don’t like having hair around their crotch area due to excessive sweat that can occur while doing activities and during hot and humid weather….it’s definitely not pleasant", "Body hair annoyed me as well. That’s why me and my wife are completely hairless everywhere!", "Gym dudes are doing it for the look. I have been asked to shave a buddy's back before. I do like hair on my partner but I get icked at older dudes in my hot tub. I shouldn't but I do. It's not voluntary", "Grow that mountain beard, then braid it! Lol", "Wait do people really wax their nipples? I am a female, I wax my brows and shave, and I have never once heard of this.", "[deleted]", "no, she doesn’t. she wants to date SOMEONE, and unfortunately “im ok with body hair” isn’t a popular dating profile addition", "Honestly that was my thought. The problem with women who are \"fighting the patriarchy\" by not shaving are usually obnoxious in certain personality traits. I'm a woman, but I've seen a whole spectrum of what I consider unpleasant behavior from them. \n\nIn extreme examples I've heard one of the antipatriarchy feminists talks about how terrible ALL MEN ARE to some guys in a bar. If you hate the patriarchy and all men are garbage... Why are you trying to date one?  \n\nI'm just speculating (of course) since I have the same few paragraphs of context everyone else has.", "OP literally says in the post she has been heard this before and has given the same generic statement of reassurance .", "you wouldn’t see a man’s legs either, would you? so why did it become acceptable to see a man’s hairy legs while women’s had to be hairless?", "Yeah, I agree, that’s why I made the comment at the end saying “if I had never started, I guess I wouldn’t know the difference, though lol,” I just wanted to add a different perspective, but I honestly wish the sensation of longer body hair didn’t bother me because it is a lot of work, so I don’t blame or *anyone* who doesn’t shave, for whatever reason (:", "I use an epilator on my legs because I get “strawberry legs” when I shave. I also use the epilator on my armpit hair because stubble hurts. I groom the downstairs to help reduce odor buildup (I’m a paraplegic and hair holds odor) and I just do my own thing. \n\nWhen winter comes, I go full Wookie and call it my winter coat. It takes about 2 weeks for my hair to get long enough to epilate again but as I get older I’m less interested in keeping myself hair-free. There’s no difference in pit odor between hair and no hair. I don’t much care about leg hair but my skin needs extra moisturizing. \n\nFun fact: You don’t sweat below the spinal injury level and as such your body doesn’t produce enough sebum and other natural skin conditioners. I hate how the extra thick and oily moisturizers I use get in the leg hair and trap it so it lays flat. It can be irritating to skin. If that wasn’t an issue I’d let the hair grow and let it do its own thing. Maybe even bleach and dye it to match my head hair! 😂\n\nI honestly don’t care if my legs and pits are plucked clean or not as long as my body is comfortable. Sometimes I even joke when my pit hair is long and doing it’s own thing, gently wafting in the breeze on a warm spring or summer day! \n\nNow, my eyebrows are a whole other thing. If they’re not plucked and trimmed regularly they look like two drunken caterpillars ready to have a throw down.", "Yeah, I absolutely understand! I mentioned in another comment that I have fibromyalgia and it can make some people super sensitive to certain sensations; ever since I started shaving I’ve always hated the way long leg hair feels under pants/leggings, even before my fibro diagnoses, but *after* my diagnosis, I started getting really irritated with the way particular fabrics felt against my skin and I ***especially*** hate the way my (head) hair feels once it starts touching my shoulders. It drives me batty and I have to start pulling it back at that point. \n\nSome people are just particularly sensitive to certain sensations, regardless of societal norms. So like you said, there’s lots of other reasons people shave! (:", "This sub reinforces this kind of stuff bc if posts aren’t perfectly crafted all the comments will go off the rails talking about one word instead of the actual situation", "Her friend was asking why all the guys she's interested in, don't want to see her again. She wasn't asking why she isn't meeting anyone she likes. Clearly, she abstains from telling early-on that she doesn't shave. Ffs just putting it in her bio would fix her problems", "Right. Also just seems like a lot of people feel the sexism benefits them, so they don't want to acknowledge it.\n\nShaving your beard because your gf likes it is not the same as having to shave your legs and to a lesser extent your armpits from age 12 to be accepted in school, society, and by friends and family, and even in the workforce. \n\nIt's one of the most simple examples of the disparity in expectations between men and women, and we can't even talk about it without dozens of folks chiming in to be like \"actually, it happens to men too\" or \"actually, I shave my beard and it's the same thing.\" No... it's not. This is something really shitty that girls, particularly in the US are socialized and practically forced into doing from a young age. Why are so few people here able to grasp that? I'd say it's not ignorance, but they want to willfully ignore it and act like it's a non-issue since they feel socializing girls this way benefits them.", "Absolutely. And it's fine to have those preferences, regardless of them being culturally ordained, but I think it's so awful that people freely toss around words like \"disgusting\" to describe non-conformist body hair. I feel this way about hairy backs on men, too, but let's face it: women get far more of this kind of judgment.", "For the first few months of the pandemic I was living alone and not going anywhere, and I learned that I really do shave my legs because I prefer it. Turns out I don’t actually care about deodorant though, that’s for everyone else’s benefit 😂", "my balls get way way *WAY* sweatier when I shave my dick and ball area. Tell your partner to use baby powder or something similar- justake sure it's not 'medicated' or 'cooling' because then it'll have menthol in it and it can get.... cold spicy if you catch my drift...", "If it's for religious reasons, you probably wouldn't trim at all. I remember a story about a Sikh woman with PCOS (which can cause excessive hair growth in females) who got made fun of online for her facial hair years ago, she had a great attitude about it and used the opportunity to educate people.", ">Comfort, sensitive skin, allergies, and religion, to name a few. But, you can still trim and maintain a well manicured 'lawn'.\n\nXactly.", "Sure, but why are so many folks pretending the disparity doesn't exist? Can you really not admit it's vastly different?\n\nIf your gf doesn't shave very very few men would date her at all. And frankly, not shaving for women leads to social ostracization. That doesn't happen for men. I doubt women would even get chosen for most jobs if they wore a professional skirt but had unshaved legs.\n\nWhy are people pretending these are the same thing? Why can't you acknowledge the pressures you face are different? You don't have to shave your beard in general to be accepted. Your gf does have to shave at least her legs to be accepted by people.", "So men that don't shave are gross?\n\nBecause the other commenter is saying you just have to \"handle\" hair and suggesting that shaving is handling it as well. You are both implying men have to shave to be considered desirable, but they don't.\n\nBut the whole point is that only women have to do that. It's not gross when men don't shave. Only women. Feels like folks are being purposefully vague to get around the whole issue and pretend it doesn't negatively only affect women.", "Not necessarily", "Better shave your head then", "Not really though… you can braid it  and that is grooming", "It comes from people who don’t think the patriarchy exists, or don’t understand what we mean when we refer to it. It’s not just us saying “men bad”.", "I hear you and agree with the sentiment but I’m not sure it’s a collective belief. Some shocking percentage of Americans (25%?) think it should be a legal requirement for women to take their husband’s name when they get married. I’d be willing to bet an overwhelming majority of women in this country find the idea of women not shaving legs or <gasp> pits fringe (no pun intended), shocking and/or ridiculous. Not that Ann Coulter should be quoted, but I do recall her once referring to “hirsute lesbians” or something to that effect. Also, given the whole cis-het white men are an oppressed minority movement these days, I for one am not surprised when I hear/read that “one woman was turned off by my back hair” as being equivalent to enforced hairlessness.\n\nI was on a sub recently looking for help with numbing for electrolysis (I have been blessed with a socially unacceptable facial hair problem since I was in high school). If you want evidence of this double standard, look no further than male-to-female transition and the near full-body electrolysis that they have to endure in order to “look” female. (Is there a stronger word than endure cuz eff me if that isn’t one of the most harrowing things I can conceive of).", "This! Learned about this in film school.\n\nIt's actually insane how many truths we hold that were just built off marketing. Carrots being \"good for eyes,\" pink being a girl's color, shaving, cigarettes, all of it.", "Yes and no. And who made the product and those ads? Men.\n\nhttps://amp.cnn.com/cnn/style/article/why-women-feel-pressured-to-shave/index.html\n\nIt’s no secret many men prefer their women shave - some even prefer a bare downstairs.", "I’m with ya!", "Not at all! I love love love love love love hair in the pubic area.", "Not at all! Pubic hair is gorgeous. Treasure trail -yum!", "Same! Love bush, love soft fuzzy legs, I even like hairy armpits!", "Not sure I think pubic hair is 'hot', but I know that NO pubic hair looks really weird and creepy to me. Like a doll, or a child, yikes.", "So do I - and I'm a dude. (It might be healthier to not dislike one's natural body so much. Then again, part of living in society means that we do things that aren't natural, like using plumbing. Shaving doesn't really hurt anyone, and if it feels good, why not, after all.) I would never presume to tell anyone else what they should do with their body, and my preferences aren't binding on anyone else. \n\nStill, if you're interested in courting people, it makes sense that their preferences might factor into your decisions. As was noted above, it seems likely that this woman's issue is not just that she doesn't shave; it may well be that the same attitudes that militate against shaving for her also cause her to express herself in other ways that might deter suitors. But that's purely speculation. There are plenty of men who will agree with her ideologically, we can hope. In any event, NTA for just suggesting the possibility.", "Yeah it’s a game changer to keep that stuff trimmed if you live in the south. Not a full shave because stubble hurts with humidity, but trimmed helps.", "It can really hold on to odors, or accumulate them quickly, especially if a guy is getting hot and sweaty on the regular.", "Um you still sweat regardless of whether there's hair there.", "did he purr like a walrus when you shaved his back?", "I used to because I had a spouse who told me I “wasn’t UNattractive but if I wanted to BE ATTRACTIVE…” and had a whole laundry list of items. Being hairless and making sure ALL STRAY HAIRS (including anything near/on my aerolas) were removed was part of that list. (I stopped shaving and waxing after I got divorced)", "Yes, and people are allowed to be put off by it. You’re just agreeing with me?\n\nI really don’t care if you have a preference, but going around calling women gross and ugly for it is fucked up. I don’t go around calling men gross and ugly for having hair.", "Yeah that’s why I do like seasonal shaving haha. Best of both worlds.", "I mean, being transparent on your bio about all the things (kids, political positions, not shaving, LGBTQ+ status, etc) would solve an awful lot of 1st to 3rd date problems.", "The majority of women don't want to admit that they were forced by socialization into shaving. Because that means shaving is not really a choice, so not actually empowering or beneficial in any way.\n\nMen don't want to acknowledge it because they don't want to admit that misogyny is actually a real problem that they benefit from.", "Mmm.. where I grew up, I will attest that unshaven pits were much, much less acceptable than unshaven legs.", "I remember that. And I believe the man who took the pictures of her even apologized to her.", "I am so Sikh of those Sikhs being good peeps!", "Literally this lmao. I’m a woman, I do shave and wax and pluck and I was shamed a few times by men AND women for not waxing my arms. FFS.", "After penning several responses, and deleting them all, I've come to the conclusion that you are 100% right - the disparity DOES exist.  I'm not sure why, or what the causes are, but yea - it sucks.", "I haven't shaved since I was 19 and have dark body hair and I have never had a hard time attracting men or keeping them around.\nIf you have to shave your legs to be accepted by people than those are not people you should want to be accepted by. No one who matters cares.", "I live in a small hippie/rural community, so this is skewed from my lived experience— but I promise, most of the men around here wouldn’t care. A *lot* of the gen X/millennial/gen Z women in the community don’t shave or only shave x body part.\n\nNot my personal preference but good for both parties for not condemning it.", "Lol wtf\n\nI don't shave, haven't in almost two decades now. It has never had an impact on my career or social life. I was actually told once by a new friend that she didn't even notice that I didn't shave until I told her. And we went to the gym together and everything. \n\nWomen being told to shave their legs to be \" accepted\" is such bs when men are never told the same thing. Which is exactly why OPs friend has stopped shaving. It's hypocrisy and we're f'ing tired of it.", "I gotta say, as a \"woman\" (nb) who doesn't shave, I've never had issues dating or getting laid...\n\nIn professional areas, I follow the same dress code as the men, because if they can't show unshaved legs, fair enough that I can't either.", "You’re right", "I’m not understanding the need for people to deny that this particular double standard exists. It’s odd how this is the hill some people have chosen. There’s definitely a double standard.", "I think you’re exaggerating. I never noticed any difference in my dating life when shaving vs. not shaving. I’m not saying it won’t be a dealbreaker for some people, but it’s not such a drastic thing that you will never get a date if you have body hair. And you definitely won’t be “ostracized” for it, you kidding me??? 😂\n\nFor the guys/girls that care that much about body hair, we probably wouldn’t have been compatible anyways.", "I trim my body hair with clippers and don’t shave it off entirely cause I don’t want to deal with razor burn and ingrown hairs, and it’s way faster. I’ve never had any issues getting laid. But yes there’s definitely a lot more pressure to manage it, especially for things like facial hair or nipple hair, which plenty of women have but remove.", "Yes it’s a double standard and people know that it still doesn’t change that that’s why she’s not getting calls back", "I have multiple skin problems that react very badly to shaving and waxing alike and let me tell you, I feel like an outcast from society itself sometimes", "I work in a very professional firm, located in a VHCOL area. It may be because we are scientists but many of the women and NB, staff and managers alike, don’t shave. Tattoos and non natural hair colors are also common. I am a high level manager in charge of a division, wear knee length skirts most days, and shave sometimes. I do it when I feel like it - I get shaving rashes easily but also when it goes well I like the smooth. No makeup is also the norm in my office. I feel liKe in my world if a guy hates women’s hair that much, a woman who didn’t want to shave wouldn’t really have much in common with him, or else they aren’t a good match anyway. But I guess there are social circles still where hairy ladies are so uncommon that it would seriously impact your straight dating prospects, which is kind of sad. This girl seems cooler to me than her friends and surroundings.", "I have never had a problem finding a man due to body hair. In fact, when the trend was complete pubic hair removal, most men I was with commented extremely positively that I had a more natural look.", "I disagree that only women have to pluck and shave to be desirable.   \n\n\nI don't find back hair attractive on men, nor neck beards, nor excessively hairy arms or chest hair (ala Robin Williams), nor unibrows.", "Lots of women do think it's gross when men don't shave. \n\nLots of women find bald men unattractive. Do you know how many men get hair transplants or wear wigs, for fear of being found unattractive to women?\n\nShould we expect large numbers of women to change their preferences to find bald men attractive? That's not how attraction works. If it were, gay people would become straight to avoid the discrimination that their innate sexual preferences often lead to. \n\nHow about this: Women who don't like to, don't want to, or will not shave their body hair find a partner who doesn't find it unattractive?", " A little bit of hair helps with a little bit of sweat too.", "Hair is an insulator which makes the area retain heat which causes sweating ya dingaling.", "Who does this??? Your arms?", "I really appreciate this, honestly made my day a little better!\n\nI really don’t mind that guys prefer shaving — I mean we all grow up in the same world, they can’t really help the conditioning either — but calling women gross for having hair is an instant dealbreaker, and just sad. Some people honestly hate women that don’t shave.", "Yeah I got the bad luck genetics that I can shave in the morning and have sharp dark prickles on my legs by the evening.   Just not worth it to worry.   I do wax before special events where I'm wearing a dress but most of the time I don't worry about it and no one notices or cares.", "My hometown and college town were both hippie/more natural mountain towns and I would never do a double take seeing an unshaven girl there. It would be seen as pretty lame and superficial to judge a girl for having armpit hair. \n\nI moved for work to a larger city and the culture is so different, I think you’d probably get dirty looks if you had on a tank with unshaven armpits. There is a big “finance bro” culture that’s basically like frat boys 2.0 that would be assholes about it. But tbh, why would you want to be with someone who is judgmental or feels that way when accepting people exist… Seems like a value mismatch & incompatibility. \n\nBut I could definitely see this depending on what city/part of America the OP is in.", "I think there's also something to be said about lighter people who also have lighter coloured hair and when they don't shave it's not as noticeable.\n\nI'm personally a brown woman with black hair but the hair on my arm is very fine and I don't shave that, my pubes and leg hair grows quite wildly though. I trim my pubes for comfort purposes but my leg hair I let grow until it starts to bother me and then I shave. But my leg hair is defo noticeable and I still don't have issues getting laid.", "And the more common it becomes for women to not shave, the more accepted and normalized it will become. Wanting to shave should be a personal preference and not something you feel you must do or else people will think you’re gross.", "I love that they're treating it as some sort of new zoomer thing as if women in the 60s and 70s didn't do the same.\n\nI know women of all ages who don't shave and men of all ages who DGAF.", "I see men wearing professional shorts in my field all the time. It's not about showing unshaved legs at all, idk what is up with the culture of some men only being allowed to wear pants. But you know it's not about body hair (in general, for everyone) because plenty of places men wear shorts with hairy legs -- but women aren't allowed to do that. If women started showing hairy legs in the workplace, they'd probably put a blanket ban on shorts and skirts because it's considered so incredibly offensive for women to not shave.", "I unironically admire you. \n\nI grew up in a different time and what the other kids did to me when I didn't shave was... *very, very bad*. I can't go without shaving now.", "My work place allows men to wear shorts when it is hot, so I would feel as if all of our legs are allowed to be exposed at work with sensible shorts.", "I have to say, I'm kind of surprised by these answers.\n\nI met one woman who didn't shave. She is a friend of a friend and we met at a wedding. She was a bridesmaid.\n\nShe rocked the dress, she looked gorgeous, and while I noticed the hair because it's not standard for women to have, it didn't make her look \"gross\" at all. Actually, the confidence made her seem pretty badass.\n\nShe WAS \"conventially attractive\" and thin outside of the body hair, and I'd definitely argue that that helped her cause and, as a society, we tend to be assholes to people who are overweight, etc.\n\nStill, though, I'm surprised at the comments by people here using words like \"gross\" about body hair.", "If you're male presenting, that doesn't work against you, though. Like, the whole point is the double standard that it's okay for male presenting people and disgusting for female presenting people.", "Yeah, I dated around before meeting my husband, and not one single dude actually gave a shit if I shaved or not. I doubt most people do as long as you still maintain good hygiene otherwise. Women shaving wasn't even a thing until after WWII when the disposable razor companies realized they were going to start losing money when the troops came home and went back to their reusable razors 🤷🏻‍♀️", "I agree there isn't much to be done about it, but this comment section is like 90% guys pretending there's no difference, the expectations are the same, and that it's all about dating too -- girls don't start shaving at 12 or w/e because of dating standards.\n\nAll the lies and trying to pretend it isn't a double standard is what I'm frustrated at. At least admit it exists while still preferring women to shave.", "If it were just about desirability, maybe.\n\nGirls aren’t told to start shaving when they start showing hair because everyone wants them to be desirable at 12.\n\nIt’s a society wide expectation. Men are not ostracized or shamed from a young age for hair. Women are. Men do not get weird looks in public or comments shaming them if they have hairy legs. Women often do.", "You're talking about your personal preference and not a societal standard. Hairy men aren't generally ostracized by women or even other men for not matching their standards of hair. Women are. Hairy men aren't generally told to shave for the benefit of their dating life. Women are. Does it happen occasionally? Sure, probably. But it's not such a social norm that hairy men are seen as weird or gross simply for not shaving", "Bald men can exist in public without being called gross?\n\nMen can exist in public without being called gross for having hair.\n\nApparently, expecting people to not call women gross for looking normal is an insane expectation now.\n\nWhat would agreeing cost you, really? It seems like you think you’ll lose out on something by not going around calling women with hair gross. But what does it actually cost you to just be decent?", "There is a world of difference between “there are women who exist that find facia hair gross, and likely a tiny amount who prefer a man completely shaved” and “the societal standard is to be as hairless as possible, to the point where you constantly have to defend the decision not to remove all body hair”.", "The razor industry was able to get the majority of people to change their preferences to find normal body hair on women unattractive. It wasn't really common the West until WWII.", "Sexual orientation is innate. What people find attractive is largely culturally conditioned. People often do, in fact, change their feelings about what's attractive to them after spending time thinking about the  cultural beauty expectations they've been exposed to.", "No woman, ever, expects a man to shave 1/3 of the surface of his body like men expect women to.\n\nPlenty of bald men are sex symbols, have happy relationships, are considered attractive. Same with men who have unruly beards.\n\nIt's okay, actually, to accept when a standard falls harder on one party than the other.", "I was getting my nails done this summer and the tech tried to talk me into having my arms waxed. My arm hair is ***very*** thin and is virtually invisible unless I hold my arm a certain way in the sun, but he still tried to get me to wax it. I assume he was just trying to upsell me for more $$, but it still felt very \"wtf, why would i ever do that?????\"", "I do. I have long hair. It’s blonde, but long. But I do it for me. I feel better shaving it. Which is really, I am sure, also a symptom of feeling it was always more accepted by the general public to where now I prefer doing it. 🤷🏼‍♀️", ">Some people honestly hate women that don’t shave.\n\nI don't get it either - I think our society has been grooming people to believe women should be this pristine, beautiful, obedient creature - unsullied by cursing, smoking, hair growth, and 'gasp' being educated.  We've also been led to believe nudity = sex, which is horseshit.  \n\nI personally don't care about shaving/not shaving, but I am turned off by certain behaviors, not physical traits.", "Professional shorts? Do they play for the Lakers?", "There is unequivocally no such thing as 'Professional' shorts.", "In general, men cannot formally show their unshaven legs in US society while women can show their legs but yes, shaven.  To deny that is weird.\n\nAnd yes, what men and women find attractive about each other is different, and society tends to reflect those differences.", "Ah, my field is much more formal. Men are in long pants/jackets, so I just follow that. In more casual offices, I have gone in in with sleeveless shirts that show armpit hair and never really gotten pushback, but it might be the city I'm in", "Professional Shorts is the name of my Beach Boys cover band.", "oof, I'm sorry about that! and yeah, it works as good filter now - those that mind don't matter and those that matter don't mind", "Yes, I think that's right - that's my rule. If hairy legs are allowed, then they're allowed. That's not my workplace, which is why I don't wear skirts", "yeah, it's super internalized misogyny. also the basic premise is like, so silly. she doesn't need to make herself attractive to all the men in the world, she needs to find the guy that works for her. that guy won't care about body hair. \n\nOPs friend is just describing dating experiences that happen to everyone, attractiveness aside...", "I still remember the SCANDAL when Julia Roberts had hairy pits out in public.", "To say nothing of what it does to your employment opportunities, particularly if your talents lie in the arts. I’m slowly having to accept that I may just not get to do what I love because my skin will not allow it. From makeup to shaving, there is too much I’m expected to do to it that is frankly just not good for it. I can live with being disliked by mainstream society, that’s been happening since I was a kid, but it really sucks that I don’t get to do what I love.", "Post WW1 if you're interested, started around 1915 but by the 20s sleeveless dresses became fashionable and there's an advert from Harper's Bazar from 1922 where the model is shown with smooth armpits with a strapline about smooth skin being desirable, though in those days it was depilatory creams rather than shaving. In the 1920s there tended to be adverts for hair removal products from spring to summer suggesting it was common but largely for times when women would be showing skin but by the 1940s it was the norm to shave legs for women.\n\n[This Vox article covers a lot of the history with example adverts](https://www.vox.com/2015/5/22/8640457/leg-shaving-history)", "We're mammals for crying out loud.  Hair is *normal*.  Trimming it to some degree is also normal, but you don't need to be as bare as a naked mole rat to be presentably groomed, and there's a *huge* variation in preferences.", "Ridiculous, I have blonde thin arm hair and would question someone’s sanity if they suggested to me I wax my arm hair. You don’t even see it really.", "I meant who suggests that to people, sorry for the confusion. I know some people wax their arms but I thought that was the one safe area where women were “allowed” to not wax.", "I went to flight school and we had to wear a pilot uniform.  Legend has it the dress code used to allow shorts but only with black knee socks.  One year, a guy actually wore that with their short sleeved pilot shirt so they removed it from the dress code.", "Postmen!", "Professional shorts is an oxymoron, lol.  Absolutely nowhere I've worked would consider shorts to be business formal or business casual.  Shit, jeans are considered more professional than shorts.  The person you're replying must work somewhere where they barely have a dress code.  Probably in IT or software dev if I had to guess.", "Yes, professional shorts. The porters at my work wear them as they are outside in the heat half the day. They’re nicer kinda shorts and longish", "from wikipedia  \n\n\n\"In many countries, there are still many settings in which wearing shorts would not be acceptable, as they are considered too casual. Notable exceptions in which men may wear short trousers to the office or at formal gatherings are South Africa, Bermuda, Australia and New Zealand.\"", "You've never heard of dress shorts?"]}