{"id": 28051, "submission_id": "16xtvz3", "title": "AITA for telling a girl it's not my fault she gave her kid away?", "selftext": "I'm 16f. I was found in a crack den at the age of 4, with no record of me anywhere up to that point and it had appeared a though there had been no adults around for days and despite investigators turning up at the property for several days, no one was ever there so my biological parents are presumed dead or incarnated.\n\nI grew up in Foster care and this week I'm going to be adopted by my parents of the last 3 years. Over the last number of years, there's been a movement to reform adoption and social care because kids should be kept with the parents or whatever. \n\nOn Friday I telling a group of friends about my upcoming adoption because I'm really excited. Katie, 17, had a baby last year and put it up for adoption. She got annoyed at me for talking about my adoption and said that I should be reunited with my biological family, even if its not my parents, I could go to like a cousin or an aunt or something. She said its because adoption is traumatic and both the bio parents and child will be traumatised and the only people that will benefit are the rich people that buy kids.\n\nI told her it's not my fault she gave her baby away and regrets it but my incubator abandoned me so clearly didn't want me in the first place, whereas my parents paying thousands to adopt me do.\n\nAll of my friends think I'm an asshole because Katie ran off crying and isn't in school today so I seem like a massive asshole and they won't talk to me. AITA?", "created_utc": 1696245330, "permalink": "/r/AmItheAsshole/comments/16xtvz3/aita_for_telling_a_girl_its_not_my_fault_she_gave/", "score": 878, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the ass for minimising katies trauma and brining up her baby\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n###[Moderators needed - Join the landed gentry](https://www.reddit.com/r/AmItheAsshole/comments/155zepq/moderators_needed_join_the_landed_gentry/)\n\n ---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n>She got annoyed at me for talking about my adoption and said that I should be reunited with my biological family, even if its not my parents, I could go to like a cousin or an aunt or something. She said its because adoption is traumatic and both the bio parents and child will be traumatised and the only people that will benefit are the rich people that buy kids.\n\nOverloaded with guilt.\n\nThey are not friends, they know your history and still act like that.\n\nIf you feel you were too much then apologize if not then stand your ground and don't give a shit about them.\n\n> incubator\n\nHahaha I use it too for bio genitor but not parent :) \n\nI wish you the best.", "Fellow adoptee, congrats on your big day! Ignore Katie and her projections, focus on how great this is for you and don’t let anyone give you crap about this. Every adoption situation is different and just because she might regret what she did, it doesn’t mean she can be a dick to you for getting a better life away from your bio parents. You’re with your real parents now.", "NTA\n\nShe made a stupid remark about something she doesn’t understand and was upset she was called out for it. \n\nCrying doesn’t make a person right.", "NTA - there’s a difference between a child who has bio family that want them and the only reason the child is not with them is because of lack of funds and support and a child who has no bio family or unsafe bio family. Logically if she is your friend she probably know your background and that you do not have bio family. But also she should really not speak on this matter so broadly as she can never know everyone’s situation. \n\nObviously she’s clearly emotional and processing having given up her child, but that does not give her a right to insult the choices of others. You clearly want to be adopted and she should respect your choices. There’s a difference between a baby who doesn’t anything and a 16yr old who can make their one decisions over who they want to be their parents.\n\nEdit: I see you say in a comment she is not your friend, but instead just interrupted this conversation to give her opinion. So she does not know your background and should definitely not speak on things she is ignorant about.", "NTA - her regrets are not your problem.  She is ignorant, while some adoptions are difficult, most are not, and yours is excellent.  Congratulations!  She was actively trying to put you do down, and what you said was not that harsh AT ALL.  As a teen mom, the road is long and hard, and she is clearly not mature enough to have raised that child, so it is probably better off without her.", "NTA - your friend has no idea of the full ramifications of adoption. She may regret giving her baby up for adoption, but there are so many other children that are better off for it.\n\nCongrats on getting adopted by your parents, and good luck in the future", "> She said its because adoption is traumatic and both the bio parents and child will be traumatised and the only people that will benefit are the rich people that buy kids.\n\n\n That is an horrible, horrible horrible thing to be said to someone who is about to get adopted. NTA.", "NAH\n\nKatie lashed out, but she's probably still coping with the fact she had to give up her own baby. You're not an asshole for being excited about your adoption. It's a difficult situation for Katie, but hopefully she'll come around soon.", "NTA at all. She is spouting off anti-child welfare talking points that she probably found online without considering the very real fact that people whose kids get abandoned or abused probably ALSO come from shit families.\n\nCongrats on finding your people!", "What!? NTA NTA NTA \n\nShe had a choice to use adoption, & while yes, she probably still feels a certain type of way about it, it’s not your fault she has those feelings & it’s not her place to push those feelings on to you, to make them your responsibility. \n\nYou didn’t have a choice to be reunited with your bios. The situations are at totally different ends of the spectrum 😡\n\nYou keep in that happiness of your impending adoption, don’t let anyone take away on moment. Congratulations!", "NTA anyone who can’t be supportive of your adoption when you yourself are excited about it, can go kick rocks. She needs therapy but that’s not for you to manage her feelings", "NTA- in fact ALOT of children should not be reunited with their biological parents. It is great that some can and some have the real desire to be, but a lot of kids are not in that situation. Not all biological parents have their kids best interest at heart or truthfully even care. It sucks for her that she gave up her baby, but she made a senseless remark and got it handed to her.", "NTA. She projected her issue onto you. I'm assuming at your age you get some say in your adoption? So she should be happy for you.\n\nCongratulations on your big day!", "Katie should have kept her mouth shut.\n\nNTA", "NTA You could have phrased it better but telling you how to feel about your bio parents was crass of her. I’m also adopted and I won’t be told how to feel about it.", "The only AH here is the one projecting onto you and telling you how you should feel, then running off crying because you basically pointed out that her situation is nothing like yours. NTA.\n\nYour friend is straight up wrong, anyway. I'm sure adoption is traumatic for some people, but not for everyone. I grew up with a friend who was adopted as a baby and she wasn't traumatized at all by it. She had no interest whatsoever in finding her bio family because her parents were the people who adopted and raised her.\n\nCongratulations, by the way.", "NTA\n\nKatie tried to sh.t on your parade; to turn something you consider very positive into something negative. And you shut her down. Maybe if she doesn't want someone else's opinion on her situation, she shouldn't go trying to insert into other people's situations.", "NTA & congratulations on her adoption!", "Nah, fuck that. Don’t let someone bring you down queen. CONGRATULATIONS!!!! This is amazing news and I’m sorry your friend has to shadow it with her own personal problems.", "NAH there’s a lot of trauma happening but hers doesn’t trump yours.", "NTA. She didn’t need to shit on your parade no matter what she thinks or does. Your friends are bozos too.", "FWIW, my Dad's parents adopted two babies when they were a youngish couple, and I can't imagine my family without my aunt and uncle, let alone their spouses and all my cousins.", "NTA, she is assuming everyone’s experience with adoption is the same and that’s not the case. She’s projecting her regret onto you, and you are allowed to be excited about being adopted. \n\nSure you were a little harsh but so was she, basically telling you that you’ll be traumatized if you’re adopted and that your parents are trying to buy you, which isn’t ok to just walk up and say to somebody.", "NTA plain and simple.\n\nCongratulations on your adoption!", "NTA. While there is a lot wrong with the adoption and system, it doesn't sound like for you there were other options. She shouldn't be projecting her negative experiences onto you.", "NTA. Was what you said harsh? Sure. But the way she was talking about it, making her personal guilt your problem? Yeah, no.", "NTA\n\nIf the conversation was making her uncomfortable, all she had to do was walk away without adding her 2 cents.", "Nta. She definitely is though. Her regret is her issue.", "NTA! Absolutely not", "NTA. As a adopted person myself I would rather be happy with those who chose to care for me then be with those who didn't want me. I have talked to both my birth givers and that was enough, I want nothing to do with them. \n\nI am excited for you. Congratulations!", "NTA\n\nThere are lots of issues with the system that is in place for adoptions, sure. But it’s complicated and every case is different. You are clearly excited and it is the option that works best here, and your friends should support that. Katie might have her own trauma regarding her situation but it’s not fair for her to put it on you like that. Maybe she should excuse herself from conversations on this topic because it’s clearly a trigger for her.", "NTA and congrats on the adoption! Sounds like both you and your parents lucked out meeting each other.", "I know my biological donors, they did me a MASSIVE favor adopting me to my parents. Like, huge.\n\nNTA, her guilt over her baby is between her and her therapist, it’s definitely not your problem and you are not obligated to dim your joy because of it.", "NAH you both have huge trauma and are way too young to be expected to handle such terrible feelings well. Of course you both lashed out.", "Nta", "Nta", "It sounds like Katie may have some personal issues to sort out. I'm of the mind no one should have kids if they don't genuinely want to, so giving an unwanted child up for adoption is a terrific move if you feel like you can't or don't want to change your life to accommodate it. But I imagine it isn't all that clear-cut when it really comes down to it, and that there might be some lingering feelings of guilt about the whole thing that she's projected onto you and your situation and wasn't ready ot didn't want to have deflected back onto herself.\n\nOP, I'm really happy for you being adopted. Congratulations! I wish you a wonderful rest of your life after what sounds like a rocky start.", "I was adopted as a 3 month old by a Mom who apparently tried to keep me but couldn't make it work. Do I have more trauma due to being adopted vs not growing up where I was born vs living in 4 countries by the time I was 18 or am I just human and would have had similar hang-ups and quirks if I had been brought up by a single Mom in the 70s? Who knows.\n\nYour situation is YOURS, not hers, and she should not tell you how to feel about your situation.", "NTA. I also was adopted, and while I wished I could have stayed in my own bio family, it wasn’t possible. I mean, if you had no records, how the hell were they supposed to find your family? I understand Katie is hurting too though, but there is also things called open adoptions or being able to stay in contact with the family so she did have options. The only reason she was a slight Ah was her getting annoyed at you for being excited for finally getting adopted! You know what else is traumatizing? Foster care! \nI say, reach out to Katie and say she really hurt your feelings saying you shouldnt be adopted by people who love you, and actively want you. While I agree that the adoption system sucks because of the amount of money needed, that doesn’t take away from your personal joy of having a family! \nCould you personally have used more tact? Yea, but so could she. \nCongratulations on being adopted!", "NAH. The problem with both “sides” of the adoption conversation is that no one wants to admit that it's more complicated than one solution for everyone, and their own experiences are not everyone else's. Adoption, or at the very least what leads to it, IS trauma and there are very serious problems with the entire system, BUT this does not mean that everyone is always better off with their blood relatives or that adoptive family cannot be real family. Neither of you are AHs for how you feel, because your situations are very different. I can't hold her outburst against her because she is still a kid herself and likely very traumatized, but neither can I hold your defensiveness in response to her comments against you. You shared your excitement and were basically told you shouldn't be with the parents it sounds like you love dearly from this post. From the way you speak it sounds like you're getting the family you always wanted and you are not wrong to feel happy and excited by that, nor to be upset when someone tells you it's wrong. But Katie almost certainly meant no harm either, and her comments truthfully likely weren't even really about you, she is just vulnerable and hurting. You both deserve compassion and happiness and I hope you find it.", "[deleted]", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 16f. I was found in a crack den at the age of 4, with no record of me anywhere up to that point and it had appeared a though there had been no adults around for days and despite investigators turning up at the property for several days, no one was ever there so my biological parents are presumed dead or incarnated.\n\nI grew up in Foster care and this week I'm going to be adopted by my parents of the last 3 years. Over the last number of years, there's been a movement to reform adoption and social care because kids should be kept with the parents or whatever. \n\nOn Friday I telling a group of friends about my upcoming adoption because I'm really excited. Katie, 17, had a baby last year and put it up for adoption. She got annoyed at me for talking about my adoption and said that I should be reunited with my biological family, even if its not my parents, I could go to like a cousin or an aunt or something. She said its because adoption is traumatic and both the bio parents and child will be traumatised and the only people that will benefit are the rich people that buy kids.\n\nI told her it's not my fault she gave her baby away and regrets it but my incubator abandoned me so clearly didn't want me in the first place, whereas my parents paying thousands to adopt me do.\n\nAll of my friends think I'm an asshole because Katie ran off crying and isn't in school today so I seem like a massive asshole and they won't talk to me. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYour experience is not her experience.", "NTA you may have been harsh but your situation is completely different than hers.", "NTA Your friend knew you were excited about your adoption (congratulations by the way!) And completely changed the mood.\n Instead of being happy for you and showing her support for you at such an important and exciting moment she chose to put the focus on her and her regrets.\nShe even had the audacity to say you should be reunited with family you've never met just because of blood ties DESPITE you being quite clear of your happiness for the adoption.\nShe took her situation and completely changed the narrative\n\nYou replied perfectly and didn't insult her. \nAgain NTA and congratulations for your adoption wish you happiness", "I can't believe that your \"friend\" was so cruel to you.  Oh, BTW. she is not a friend.   \n\nCongratulations on your big event @", "NTA.  Why are people who are so eager to dish it out never able to take it back themselves?  If Katie doesn’t want to hear what other people think of her, she shouldn’t be shooting her mouth off about things that are none of her business.", "NTA\n\nCongratulations on your adoption and being with your true parents for life. About Katie, you were right in your response, so don't apologize to her. Katie gave up her baby for adoption, seems to be under duress, or very difficult and traumatic circumstances and while she's partially right about trauma adoption, you're happy about yours, and rightfully so.\n\nI understand the family reunification process, but people forget that not all biological parents/family are safe for kids, and genuinely care about their well-being. Katie was rude and judgemental towards your situation and your parents. Your friends are bozos, that can't accept the reality of Katie's words and awful behavior.\n\nETA\n\nRead your comment about Katie voluntarily giving up her baby for adoption, despite having her parents help and support to keep her baby. Yet, she hated it and now she's \"traumatized\" by the adoption? I get her guilt and regrets, but her comments about \"rich people\" buying babies, and that you should be with family like aunts, or any other family member is nonsensical since a) her parents are well off, and b) she could've place her baby under her parent's custody, yet she didn't therefore her words make no sense. Her tears seem a bit performative and her crying doesn't make her right. Finally, Katie is the last person that should be talking about traumatic adoption.\n\nThere's traumatic adoption, but it doesn't apply to everyone. Lately, there's a number of folks talking about their negative experiences as adoptees, but they are framing the experience as if no one should be adopted bec is a traumatic experience for everyone not only them, regardless of happy and positive adoption experiences", "NAH\nShe had a strong opinion about adoption and your arguments hurt her. But she needs to learn to handle her situation instead of forcing her opinion on others.", "NTA. Emotions ran high. You are thrilled to be adopted by people who have been your real parents. It's wonderful! Of course you'll share your joy with friends! You were cruelly abandoned as a child. \n\nShe was triggered, having recently gone through the trauma of giving up a child for adoption. All those hormones, confusion, desire to still be part of this child's life.\n\nHOWEVER, how unthinking to attack you for your joy. She's the AH, but it's easy to understand her feeling of being attacked, which was NOT your intent.\n\nYou can repair this. Sincerely apologize to her, explain you didn't mean to call her out, that you understand her sadness and pain. That you've both lived through traumas. If you can do this, and if she's capable, she'll also apologize. But if she can't or won't, give her a pass. She didn't abandon her baby like you were abandoned. She didn't injure you other than step on your joy. Even if she doesn't come around now, your kindness can go a long way towards her healing.\n\nBe the bigger person.", "ESH / N.A.H... you both have had traumatic experiences related to adoption just opposite perspectives.  Katie MAY have made the best decision for her (and babys) circumstances but she will have a full lifetime of pain /guilt /regret ahead from this experience. You experienced trauma as an abandoned child but this doesnt speak to all children of adoption, many are raised in better circumstances then their bio parents could have provided. You are both being judgemental of each other. \n\nSincere congratulations on your adoption, I'm glad you have found your family. \n\nI hope Katie finds peace with her decisions as her baby finds love and support in her new family also.", "I mean, it was tactless but you're right. \n\nI'm gonna go with ESH because while your friend was an asshole you very much could've handled it better", "NTA but you both have gone for the worst possible take on this.\n\nIt's wonderful that you've found a loving family.  Really happy for you.  You don't have biological family members that could have been an option and that's really all you have to say. \n\nShe gave her child up for adoption because she was not in a place to look after a baby.  That's one of the biggest sacrifices and most loving acts that someone can undertake.  For most people, even while they realize that it's the best choice, it's highly traumatic and infused with at least some regret and guilt.  It sounds as though Katie is still dealing with that.  She was very unkind in how she responded to you, but if you're able to show her a bit of grace, you're going to see that she spoke out of a great deal of pain.\n\nYou're not responsible for helping her heal anymore than she is for you.  \n\nYou're an example of how adoption can be a positive thing.  At some point she may be in a place where seeing that helps her come to terms with her own difficult decision.", "Right message, but definitely wrong delivery.\n\nYou are lucky because you are getting adopted by a family that sounds amazing. Not all children, as you are most definitely aware, based on your own story, get to be so lucky, and this is probably why Katie said the things she said. Katie is scared that her child won't be so lucky.\n\nESH, but congratulations on finding your family. You deserve a real home after all you have been through", "NTA but maybe you could have been a bit nicer.", "ESH. She was HUGELY insensitive first while you're preparing for your very special day, so I totally get why you lashed out (and probably would have too), but what you said was hurtful to her too. \n\nI'm coming at this from several sides. I'm an adoptee. I've reconnected with my birth parents and saw the immense trauma they went through for decades. I've also lost a baby through miscarriage, so I know what it's like on some level to lose a kid. \n\nMany adoptees feel as you do. Many adoptees also hate being adopted. There's no right or wrong way to experience it. I personally think that the problem is systematic - if my bio parents had access to better systems that would have enabled them to raise a child and go to school, they wouldn't have been shoved into a difficult decision like your friend was. \n\nAdoption is often traumatic for both sides, but it's often not discussed. Adoptees who feel this way don't often realize they can feel sorrow and trauma from this until later in life. It's called \"coming out of the fog\" in those communities. (You can connect with all types of adoptees on r/adopted if you're interested!) \n\nI think your friend is dealing with a huge trauma and probably needs some help. You both need to figure out how to talk about this going forward. \n\nYou're coming at this with completely different and equally justified perspectives. She mourns the loss of her child through adoption - adoption is traumatic for her. You, who have no access to your biological family, are getting a family for the first time - adoption is joyful for you. Those are both very valid responses and shouldn't be at odds with each  other. \n\nIn this situation, they're almost entirely different concepts with the same word with how separate your situations are.\n\nTalk to her and find a way to walk forward that works for both of you. \n\nAnd congratulations! I'm so so happy for you and wish you all the love and joy in your family!❤️", "ESH - she was projecting, and her point is totally ridiculous. Why would you want to be reunited with biological parents that did that to you?  Some people don't deserve a chance and that's fine.\n\nBut also understandable that you were talking about something that was really important to you and that you are excited about and she somehow found a very creative way to make it negative. And she can't apply her thinking to people and completely different circumstances.", "ESH (you a bit less than her) \n\nShe said something rude and spoke from her own position without thinking about the situation of others. \n\nYou said something rude and spoke from your own position without thinking about the situation of others. \n\nHopefully this will help both of you to start thinking about how not everything is black and white. \n\nHowever, congratulations on being adopted! I hope you and your parents will have a lovely life as a great family.", ">!Sick. Ass. PANTHER! 🐈‍⬛!<", "YTA, a little. I think you should have just shut her down without getting personal with her. Her history had nothing to do with the conversation.", "NTA", "NTA. It's horrible that you were abandoned and found in a crack den but that honestly is so much more tramatic than being given up as a baby. Your \"friends\" child will have no clue what happened to them. Handed off to a new family from the moment of birth. Feed and safe. \n\nYou were in a crack den by yourself at the age of 4 for days. I don't want to imagine how you survived. Even if you don't remember it you probably unconsciously have some memory. \n\nYes the adoption is tramatic for your friend...but that's her problem not yours. Your sperm and egg donor obviously don't have family that cared for you either because there weren't any reports that you were missing. \n\nYour friend needs therapy badly. I feel for her. Hopefully it's an open adoption if it's not she needs to register her DNA everywhere she can and register for her to be contacted because she is open to it. Hopefully she deals with her pain.\n\nAnd congratulations on finding your true family.", "NTA - First, congratulations!  I'm so happy for you and your parents.  Second, everyone has a right to their opinions, but not about YOUR adoption.   She was a jerk to rain on your parade over something YOU are happy about.  She can talk about how she feels about her adoption story, but it's a jerk move to rain on your good-news-day.  \n\nWishing you much good luck from a mom to bio and adopted children!", "NTA but you probably could be nicer she has no experience with all of this.  \nI think keeping kids with bio family is great, but they always take it too far.  My State has that policy too, sometimes it just prolongs the abuse and neglect.\nAll that said I am very happy for you to find your family.  Good luck in all that you do!", "NTA, your friend is a bum. Who the fuck gets pregnant at 17? Ditch those people", "NTA. Your situation is not about her and her guilt. I'm sure she is going through it, but your excitement about being adopted has nothing to do with the choice she made. If anything she should be happy you are finally being adopted by your family that loves you as I'm sure she hopes her child is happy with their family. I hope your friend is in therapy to deal with her grief, but her triggers aren't your responsibility.", "Does Katie think being abandoned at a crack den at age 4 is not traumatic? NTA", "She may not have wanted to give her baby up for adoption but that doesn’t mean she’s allowed to take it out on you and make it your problem. NTA.", "NTA at all. Katy was a huge jerk. Congrats to you and your parents! May you continue on with a wonderful life with them!", ">On Friday I telling a group of friends about my upcoming adoption because I'm really excited\n\n>She got annoyed at me for talking about my adoption and said that I should be reunited with my biological family, even if its not my parents, I could go to like a cousin or an aunt or something\n\n>She said its because adoption is traumatic and both the bio parents and child will be traumatised and the only people that will benefit are the rich people that buy kids.\n\nTake out the context for her situation for a moment. You were excited because the people who have been fostering you for 3 years want to officially make you part of the family, something you've been denied for most of your life. You are happy and excited. Someone believes you're wrong to be excited and that you should go to whoever abandoned you initially, or their relatives.\n\nKatie may have her reasons, but what she said to you was awful and makes her an asshole.\n\n>Katie, 17, had a baby last year and put it up for adoption.\n\n>I told her it's not my fault she gave her baby away and regrets it\n\nThe only comment you made about her situation was about her regret and taking it out on you.\n\nNTA\n\nKatie needs support and possibly therapy, because she does not sound like someone who willingly gave up a child for adoption. She might have a pretty unhappy home life, with pressures and expectations she isn't coping well with.\n\nDoes it make what she said to you okay? No, not at all. She was taking out frustration about her life and actions on you, which involved speaking badly about the people you're excited to be adopted by. I'd be worried if you weren't defensive.\n\nDoes it mean what you said was wrong? No. Maybe you could've been a bit more tactful, but she'd just verbally attacked you over something you may have believed would never happen.\n\nImportant bit? She spoke out of anger at her situation and hurt you. If she's one of your friends, maybe take some time aside to go chat with her about things. She might just need a friend to help her deal with the emotional impact of everything. If she's had someone pay her to skip the regular adoption/foster system, might be worth chatting about said system, share a bit of insight. If she's not one of your friends, you can still reach out if you want, but she might not want to talk with you. Maybe nudge one of her friends and say that Katie seems to be having a hard time lately, would they be okay to check in on her.\n\nEdit: Also, congratulations on your upcoming adoption day :) Not sure if it's your thing, but I've heard some people treat it like an extra birthday (Got'cha Day?). Really hope you're happy in the future, and that your parents keep you feeling welcome and loved.", "NTA She, by her own logic, was talking to a \"traumatized\" person. One who was more the victim of the situation than Katie's situation. That is assuming the start of the pregnancy was consensual.", "NTA.", "best to not bring that up anymore with her.  you are of course technically correct, but she has a good deal of baggage she is still trying to deal with, and you only make her think about it more.", "NTA - congratulations :))) Unfortunately Katie has gone through something that she now regrets but as ur friend she should be supportive and excited for your big life moment which causes you happiness. Not push her views onto you about a system in which you’ve been through. \n\nHopefully she matures and realises what’s she’s done wrong ☺️ but as she’s cried and for everyone on her side being yes men unfortunately I don’t get that vibe — don’t let her get you down tho! You have big things to look forward too 🩷", "NTA. Katie doesn't practivce what she preach, she can't condeem your upcoming adoption, when she just given her child away(I wonder if it was willing, since she came a comment like that, she is minor and your upcomming adoption reminds her of the pain of being unfit mother, but still the hypocricsy). One standard for her and another for you. She is no friend of yours, if she know your history. Family care is great, if there is some one to step up, but in your case, there isn't and so many children in foster system have same problem, even they do have families. The families are very often not fit or willing to take them in.", "NTA - You have the right to be happy even if that doesn’t conform to other people’s ideas. Go be happy, and live a good life.", "I think a better way to handle it would have been to say “hey, I know you’re saying this because you’re upset about your own hard choices with your baby, but this is my own unique situation and I feel like your not letting me be happy about something I’m genuinely excited for.” If she didn’t know your story it would have been a good time to maybe tell her. \n\nGood luck! \n\nNTA", "NTA, she has some very ignorant views on adoption and should have thought twice before making such comments to you, someone who has actually lived through it.", "My bio mom will now forever been known as the incubator", "NTA.  Katie trauma dumped on you, and you put her in her place.  She made some unfortunate decisions in her life, but the consequences of those decisions are hers, not yours.", "Nta. While I do feel badly for this young lady she made a choice. Some choices are extremely painful but she did it and has to live with it. The two situations are totally different. You were saved and given a proper life. If they hadn't found you in time you probably wouldn't even be here. Celebrate the happiness you have found in life.", "NTA I think adoption is much less traumatic that a child being abandoned in a crack den. Congratulations by the way! Wishing you a very happy life", "No child should have to suffer through what you have.\n\nI wish you a loving and healthy future.\n\nNTA, btw", "NTA.  Katie is messed up both from the pregnancy and adopting out her kid that she didn't want. That is no excuse for her to crap on your happiness.  Congratulations on finding your forever family.", "It’s almost like adoption is a process with lots of grey areas where it’s impossible for one rule/procedure to be relevant for everyone. \n\nOf course OP isn’t TA for being excited to be adopted by loving parents after everything she’s been through… but I’m not sure that we can call a child who was forced into a pregnancy and birth she didn’t have the physical or emotional maturity to deal with followed by the baby she carried for 9 months being adopted by someone else (whether she wanted that or not, it would be hard,) an AH here either. She reacted emotionally, its only been a year, I think she needs therapy rather than being called an AH.", "I mean, it is a really mean thing to say to someone who’s clearly dealing with some shit. But I’m not going to tell a 16 yo that she’s an AH for saying it under these circumstances. She’s not required to rise above Katie being shitty first, especially about something so important to the OP. \n\nI wonder if the friends calling her an AH and not talking to her is more about the friend group dynamics than any objective evaluation of both girls’ behavior. Or just a not very sophisticated reaction to the fact that Katie ran off crying while the OP went on the attack.", "Well, you responded to what indeed seemed like her blaming you for her problems and that's fucked up in more ways than 100. NTA.", "NTA. \ncongratulations on your adoption! \n\nMy child is adopted and where I’m from you don’t pay for the adoption but you do go through quite rigorous classes designed to educate you to the traumas, possible backgrounds, issues etc. that children may have due to the circumstances that led to them being put up for adoption. \n\nKatie was lashing out due to her own unresolved issues. I think what you said was fair and truthful. There is no reason to be negative about putting together a loving family. My child’s biological parents had 8 or 9 other kids between them, (the eldest weren’t caught in time for fostering) the majority went into care and the few we know of all speak about how awful their limited time as children was with the birth parents. Through choice most have no contact with them (open adoptions/letterbox contact very big here). \n\nKeeping kids in families that aren’t actively WANTING those kids is a cruel punishment for all involved. I’m so sorry you went through those experiences so early but am so happy you have found your family.  Wishing all of you the best future full of happy memories waiting to be made 🥰", "Although there are many issues with the adoption and the system, it doesn't seem like you have any other choices. She shouldn't be putting you in the negative light of her experiences.", "She only needed to leave the conversation without contributing anything if she felt uneasy.", ">Crying doesn’t make a person right.\n\nThank you. So tired of the \"but you made her cry\" argument.\n\nCan we please get T-shirts printed.", "This.", "Crying also doesn't make a person not an asshole. Which she absolutely was being to OP.", "It's also a horrible horrible horrible thing to say to someone who has no known biological family and grew up in foster care.", "She spoke negatively about the thing for the entire time she was pregnant saying how it belonged in a hazardous waste bin, how she was angry about her parents urging her to keep it (they're well off and offered to support them until she was done college), how if she couldn't find parents shed leave it in the rubbish", "Difficult situation for Katie yes, but she still acted like an asshole. Come on now, seriously.", "It sounds like she's projecting her situation on others'.", "Yep. Same but then my moms parents. They adopted many children. Official and non official; as in kids were left by their parents and no one cared about these kids. (The 50s-60s-70s were a different time in the netherlands).\n\nA few of them are extremely valued family members, others just send yearly christmas cards.\n\n(Grandparents were well off and had a holiday resort with 100+ bungalows so some kids lived in these houses).", "What negative experiences? The grandparents were even  on board to raise the kid until she was stable in life, according to the main post. It just sounds like a half-hearted attempt at masking her choice as something she \"had\" to do.", "The things Katie is saying definitely sounds like she's fallen into the rabbithole of 'adoptee tiktok.' \n\nI've seen the accounts of lots of adoptees who have been hurt by the system and I can really get why Katie is retroactively regretful of her decision to give her baby up. It must be torturous to have so much content from adults who were traumatised/abused by the adoptive process readily available and have to reckon with the guilt of that aged 17. \n\nNone of the things these people are saying is wrong, but the issue is the nature of the tiktok algorithm is that it provides a completely unnuanced and one-sided account of a complex issue. If she's clicking on videos of anti-adoption adoptees, she won't be getting any perspective from adoptees who have benefitted from the process.", ">suspect Katie wasn't given a choice on the adoption and is still processing it.\n\nAccording to op she kept saying that the kid belonged in a bin. Her parents offered her to help with the baby but she hated the baby", "\"...she needs to learn to handle her situation instead of forcing her opinion on others.\" THIS is so true for soooo many humans and sooo many situations :)", "What trauma? She said that if she didn't find parents for her kid she'd leave it in the garbage\n\n>Be the bigger person.\n\nThat's a shitty advice", "Katie's words about her kid : it belonged in a hazardous waste bin, how she was angry about her parents urging her to keep it (they're well off and offered to support them until she was done college), how if she couldn't find parents shed leave it in the rubbish", "She's not my friend. I very much dislike her.", ">She gave her child up for adoption because she was not in a place to look after a baby. That's one of the biggest sacrifices and most loving acts that someone can undertake.\n\n This is what katie said about her kid : it belonged in a hazardous waste bin, how she was angry about her parents urging her to keep it (they're well off and offered to support them until she was done college), how if she couldn't find parents shed leave it in the rubbish", ">Katie is scared that her child won't be so lucky.\n\nKatie hated the kid. Her parents wanted her to keep the baby and offered help, but she didn't want to keep the kid.", "Op said katie isn't her friend. \n\n>She mourns the loss of her child through adoption - adoption is traumatic for her\n\nHer parents offered her to help her to keep the baby but she didn't want to. She kept saying the kid belonged in a garbage bin. So no, i don't think she mourns the loss of a child she said she hates.", "Seems like Katie got personal first? That's how I read it anyway.", "*noted\n\nNot for t-shirts but hey, I have a button machine.", "She should have had an abortion, her parents are assholes for forcing her to go trough pregnancy.", "Honestly just ignore anything Katie says about pregnancy, babies, and adoption. She's clearly going through something and what she's saying isn't about you, it's just her processing her own trauma out loud.", "Did her parents make her go through with the pregnancy?\n\nI think you are NTA but it sounds like she didn't want to be pregnant and her parents forced that upon her instead of getting an abortion.", "Why didn't you put this in the main text?", "NTA. she shouldn’t have been saying shit if she couldn’t handle it. it doesn’t matter if the subject was related to her or not. you were celebratory over something (rightfully so) and she should’ve been what a friend is and celebrated with you. her argument made no sense and was clearly emotionally driven. because of that, i don’t think you said or worded anything wrong. especially given this information, how she talked about her pregnancy/the adoption. she can’t blame you for your response because how would you know differently when she spoke like that about her child? oh and your friends suck too. congratulations on your adoption, don’t let what she has going on affect your moment.", "Was yeah good thing the baby went up for adoption.  And obviously, if that's what she said and felt. She has no right to be mad at you. You have every right to be excited about being adopted into a loving family. And it's not just rich people who do adopt. There are families who will spend whatever they can yo have a family. Not all people are meant to be parents. And those who open their hearts and family to adopt a child are a blessing, too. Seems she doesn't understand it takes more than giving birth to be a parent.", "You should add this to the main post op", "I was going to say Y T A as I thought your friend was forced to give up the kid given her age. But this was her idea n you can't be blamed for her regrets. NTA", "She said all that knowing how you had been abandoned by your bio parents? But then got upset when you were happily talking about your adoption? It maybe best for you and Katy to give each other space. You’re both dealing with a lot right now.", "NTA. She tried to mar the OP's shine. She got what she deserved.", "She was a 17 year old pregnant child who sounds like she was forced to go through with her pregnancy and birth by her parents and give the child up for adoption.\n\nThat’s traumatic.\n\nIt doesn’t give her an excuse to unload on OP but the lack of empathy the other way is also puzzling.", "I can see why from your other comment about how she spoke about the baby.", "I understand, I very much dislike her too", "I can only comment on the info that OP provided, and OP said Katie regrets giving her child up for adoption. I dont know these people or the actual circumstances of the situation.", "10-15 years ago, I'd have passive-aggressively worn the heck out of that. Too many of us identify with this.\n\nI wouldn't wear it now, but I'd be tempted to post it to certain people.", "Maybe she lives somewhere where abortions are illegal", "[removed]", "It doesn't matter. That all screams coping", "Because it doesn't matter in the slightest", "Sure, but it doesn't change anything. Her friend is a teenage girl who has gone through an intense emotional and physical experience very very recently. \n\nShe's not an asshole, she's just a person coping with trauma in that horrible stage of life where you have the responsibilities and expectations of an adult but the emotional needs of a child. Both girls here need help and compassion.", ">I can only comment on the info that OP provided\n\nI took what i said from op's comment.", "We don’t know her, or any context. We don’t know whether she consented (as much as a minor can) or whether she was forced to “spread her legs”, as you put it.", "Exactly. OP's comment doesn't change my judgement. Katie needs help, she's struggling and possibly grieving", "Also the misogyny that a woman belongs in the trash/has no value because she's sexually active."]}