{"id": 28127, "submission_id": "16ynh5c", "title": "AITA for talking to my husband on the phone outside of the Airbnb so my friend can sleep?", "selftext": "So there is this friend I’m traveling to Europe with, let’s call her C. \n\nWhen we were booking accommodations, she was super strict on her budget and we ended up booking a bunch of cheapy studios. \n\nI had a hard time sleeping in, and morning is the best time to call to my husband. So yesterday I woke up at 6, wrapped myself in a blanket and went outside of the Airbnb to the staircase landing at 6:30 to make the call. \n\nI was trying to chat in low voice, wasn’t laughing loudly, nothing like that. Finished the call and snuck back into the Airbnb. \n\nAnd before I left I turned the light on in the bathroom, so I have some light when I come back. It wasn’t shining into her eyes and I thought I was mindful and didn’t turn the hallway light or the living room light.. \n\nThis morning she wasn’t talking to me and decided to go explore by herself because I’m so inconsiderate and selfish for walking up so early and opening the door, and that she could hear me talking outside of the Airbnb. \n\nShe suggested I don’t turn any light on, and better go to a coffee shop if I wake up before her. \n\nAm I the asshole?", "created_utc": 1696326464, "permalink": "/r/AmItheAsshole/comments/16ynh5c/aita_for_talking_to_my_husband_on_the_phone/", "score": 155, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I took a call outside of the Airbnb in the apartment staircase landing at 6:30 am. My friend got pissed at me for waking her up by those actions and called me selfish and doesn’t want to talk to me anymore.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA at all.\n\nThis summer i went in a interrail and my friend spent every night talking to his bf on the phone until 2/3. inside the room. with me only wanting to sleep. I got serious killer instincts. you did what you could to accomodate her, at least.", "NtA. \n\nIf you take breaks during the day to call your husband you would also be the bad guy for disrupting the plans. Now you're the bad guy because you're waking up early and calling your so. I don't think you could win here.\n\nLet her sulk.", "Why are you travelling with this C? She sounds super lame and self-centered. \nNTA at all. She needs to grow up.", "NTA...traveling with someone can make or break a friendship. Life goes on, even when you're on vacation. Your friend needs to learn that she's not the centre of the universe.", "NTA at all you made everything possible in an attempt to not disturb her sleep. If she can understand that well she is bad friend", "Are you leaving out any important details because none of this is AH behavior", "nta", "Jokes on her, coffee shops open at 9 in Europe", "NTA, you were considerate enough.", "NAH", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo there is this friend I’m traveling to Europe with, let’s call her C. \n\nWhen we were booking accommodations, she was super strict on her budget and we ended up booking a bunch of cheapy studios. \n\nI had a hard time sleeping in, and morning is the best time to call to my husband. So yesterday I woke up at 6, wrapped myself in a blanket and went outside of the Airbnb to the staircase landing at 6:30 to make the call. \n\nI was trying to chat in low voice, wasn’t laughing loudly, nothing like that. Finished the call and snuck back into the Airbnb. \n\nAnd before I left I turned the light on in the bathroom, so I have some light when I come back. It wasn’t shining into her eyes and I thought I was mindful and didn’t turn the hallway light or the living room light.. \n\nThis morning she wasn’t talking to me and decided to go explore by herself because I’m so inconsiderate and selfish for walking up so early and opening the door, and that she could hear me talking outside of the Airbnb. \n\nShe suggested I don’t turn any light on, and better go to a coffee shop if I wake up before her. \n\nAm I the asshole?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH. \n\n1) Use your phone as a light, not turn on lights around the place and leave them on while not using them. Especially since the place is small. \n\n2) If she could hear you talking in that staircase landing at 6:30 am, then everyone else in that place could hear you chatting with your husband. Take that outside. \n\n3) She should have more grace since you tried (in your mind) to be as considerate as possible.", "as someone who is a super light sleeper, I appreciate when my partner tries to let me sleep by doing similar things to what you did. but sometimes I still wake up. am I grumpy? yes! does that make my partner an AH? no! and neither are you. especially while on vacation and having to navigate staying in a studio with your friend.\n\nNTA", "Nta this is travelling with people. She needs to not be a princess. You did the reasonable thing and left the apartment. Ear plugs and sleep masks are a must when travelling with others", "Your friend a whole goofy NTA", "NTA, your \"friend\" is a control freak", "And this is why I prefer to either travel alone or book different rooms.\nSome countries have lousy noise insulation and you did what you could to mitigate her discomfort.\nShe could also have worn earplugs. \nNTA", "NTA, your friend is the asshole for not getting up at the same time as you and being active on holiday with the same schedule as you.  \n\n\nYour friend is also the asshole for not accommodating your poor eyesight and you needing some light on to move around at night.  \n\n\nAsk her why she thinks her needs are more important that yours", "NTA, but your \"friend\" sure is. Book the first flight home you can and be done with her. That way, she can finish the trip in complete peace.", "NTA. It's reasonable that she tell you your attempts to let her sleep in did not work. You can probably change it up - move a little further away, don't leave the light on - but having a tantrum about it when you had made efforts is childish AH behavior. You maybe need to find better travelling companions than this C.", "Um, YMMV. I'd be cool with anyone wanting to talk on the phone during my waking hours on our joint holiday, really  less  cool at 6:30 and within earshot.", "Especially when it was C’s budget that dictated this small studio where they are on top of each other", "I wish? I don’t know.. maybe I’m an elephant in a china shop? Who knows, that’s why I’m asking.", "That’s true!! Why that? You guys don’t drink coffee on your way to work?", "But outside of the Airbnb though? The time difference is such that during the day here it’s nighttime there. At 6:30 here is almost 10pm there. So what does one have to do?", "For me a coffeeshop is a place where i meet other people to chat and have fun together. If i want a coffee just to drink it quickly on the way to somewhere else, I'd make it myself at home, much cheaper and much easier (and faster than standing in line somewhere!)", "You’re absolutely fine and have nothing to feel guilty or bad about. She completely overstepped by being mad that you accidentally woke her up. If you’d been doing it the entire trip every morning that’d be a different story. But you weren’t and this is the first time she woke up. Also, 6:30 is honestly not that early for waking up on a vacation….depending on the type, if it’s a beach versus actual traveling. \nI would not recommend not turning any lights on. One light is fine to have on as long as it’s not right in her face or something like that. Besides, she’d probably get mad if you tripped over something because you didn’t have any lights on, for her, and \naccidentally stubbed your toe or something. Coffee shop option is just ehhh. Hard no. You’d have to get dressed, look somewhat put together, spend money on a coffee and what not, and also be surrounded by strangers when having a personal conversation. \nTo be honest, I’d just ask her what exactly woke her up. Like, the light, your voice, what was it? If she can’t respond she’s mad just to be mad. If she does have an answer, tell her you’ll make sure to not have that happen again or be a bit more quiet the rest of the times. \nIf she can’t accept a compromise or a resolution, just tell her to get earplugs and get over it.", "The time difference is a big factor, I see. NTA as it was accidental, she shouldn't have screamed like that.", "The fact that she’s upset means that the light *was* disturbing her sleep and she *could* hear your phone call. So you were not as considerate as you believed yourself to be. I truly don’t understand the leaving a light on in the bathroom part, especially. Put on some comfortable clothes and go for a walk AWAY from where anyone is sleeping, not just your friend.", "NAH. Honestly, it sounds like you tried to be mindful but was unsuccessful. She sounds like she’s sleep-deprived and grumpy. I read her going off on her own as taking space for herself while she processes her feelings. Perhaps, after you’ve had a break, talk to each other then and be empathetic to her experience, and hopefully she will be empathetic to yours. When you’re both levelheaded will be the best time to figure out the best path forward. Good luck!", "I would say no assholes here if it wasnt for C's reaction. You tried to be mindful, C still woke up anyway. Oh well, you tried and you can try again another time with what she said you could help more with \n\nTo abandon you and do her own thing as some sort of punishment is petty as heck to me.\n\nNTA", "YTA. You turned on a light and left it on? And sat outside the door and had a phone conversation. Super rude.", "I'm a light sleeper, and if I know whomever I'm bunking with wakes up early, I wear earplugs and a sleeping mask. You were perfectly reasonable in how you accommodated her. She needs to meet you half way.", "NTA but either don’t do that again or fly solo. Your friend is drawing a boundary.", "YTA - you were sharing space with another person and making noise  very early in the morning including waking them up with a door You turned on a light , and were speaking loudly enough that she was woken . If she could hear you I presume other landings in the communal area also could, so you were just being an overall nuisance at what most people would consider to be an unreasonable hour .\n\nIf this is something you need to do , I think going forward you need to explain to people you are sharing with that you are an early riser and will be waking up, moving about etc so that it's better you have your own space , if you had done that it would have be nah", "ESH, not for the initial actions but for the reactions. She should not be sulking and ignoring you, but you also shouldn’t be so defensive about it. Europe is a vacation spot where you need your energy and your sleep. My husband is an early riser, and we decided before we went that he would slip out in the mornings and go walk to a bakery or store to get breakfast or something until the rest of us woke up closer to 8. You guys need to make a plan that doesn’t involve her getting woken up at 6am every day. And if you were talking loudly enough for her to hear you inside your unit, it’s almost certain that other people could hear you inside theirs. That’s rude at 6am. But both of you need to be grown up and talk it out.", "NTA\n\nshe got mad bc you wanted to talk to your husband? And you even tried to not wake her up, that was mindful. nta at all.", "NTA. This is a 2 way street. If she’s that light a sleeper she should be prepared with ear plugs and blinders at a minimum. Someone else could have been sitting outside and made noise. You at least tried to be considerate, she didn’t.", "NTA. But just leave the lights off and take a walk next time.", "NTA, I don't know why you went on this trip with her. You were accommodating and were considerate of her. You made sure not to make too much noise. Maybe go on your own for the rest of the trip. Get your own room at a different hotel, do your own tourist things, etc.", "NTA at all. The rule when traveling with friends, in my opinion, is that if someone is making an effort to be considerate, that's enough.", "NTA. If they’re that sensitive when they sleep that opening a door or turning on the bathroom light wakes them up, they can sleep with earplugs and a mask. You both need to be considerate of each other and it sounds like you’re doing that.", "NTA, since you accommodated her because of her budget. And you made an effort to not be  noisy in th3 morning.", "Nah. You didn't know you disturbed her. You can't be blamed for not realizing you were bothering her.", "NTA. \n\nThis is part of needing to share accommodation. \n\nIf she needs perfect silence and darkness, she needs to also spring for a solo room.", "But her some ear plugs and eye mask. 6am is not that early. Just spent a week in a house with 15 people. Think I complained of all the noises I heard while still trying ton sleep? No. You travel with someone and sleep in the same room with them you are gonna have to be accommodating.", "F her", "NTA. I would tell her I was being courteous and she is not and one more type of this outburst and you will continue on your vacation without her. Its best to call bullys out.", "NTA", "YTA for the light on in a studio. I think that's why she's upset because she was woken up early. You're on your phone, so you should have used the flashlight on your phone why switch the light on if you were not going to be in the studio? At the same time, her reaction was unwarranted though. You two need to have a conversation. I travelled last summer with my bff too and we shared airbnb rooms. I knew she'll call her partner every night due to the time difference because she made sure to communicate it to me and that I was ok with it.", "NTA.  You made a reasonable effort not to disturb your friend given the accommodations.  The answer for your friend of course, is, if you know you're a light sleeper and value complete privacy on the trip, splurge a bit and get a 2 bed airbnb.", "NTA.. i am NOT a morning person lol. When i travel with friends i emphasize that before we agree to book the hotel or airbnb. Everything you did showed you tried and thats what matters. Would i have given you a death stare when you came back in? Maybe lol but then i wouldve either went back to bed for another hour or so or gotten up and showered and mada a joke about it when im back. \n\nI legit recently traveled with two gfs. We had to share a bed, and i had to sleep in the middle bc im small. I gave my “warnings” lol especially bc we slept at 4 am the night before. One of my gfs alarms start blaring at 8 am. Oh lord the anger i felt lmao. I woke up and had to look for the phone and closed it multiple times. Then this dummy wakes up finally at 8 something and shes like “girl close your alarm”. I definitely gave her a death stare and snappily said “this is not my phone -.-“ and she realized it was hers and closed it. I went back to bed and when i woke up i kept joking with her about (1) how on earth did your phone get to the other side of the bed and (2) why on earth did you never wake up \n\nBeing grumpy when youre woken up early, especially on a late night in, is understandable. But being petty about it the whole day? And on a vacation with your friends? No. Why would you waste that time together?", "I mean that's a total overstretch. OP said nothing of the sort about that , you've just made it up", "The light in the bathroom. The door to the bathroom was only open a tiny bit, not full swing blasting. \n\nAnd I sat not right outside, but a whole set of stairs down on the landing between two floors.", "Leaving a light on while someone is sleeping is super AH behavior.", "Interesting! \n\nI did tell her I’m an early riser though. \nAnd I was surprised that I woke up that early too, because with jet lag I expected not to wake up that early. \n\nJet lag really fucks you up. The other night I worked up at 4:30, so I played a sleep meditation while in bed (with headphones of course). \n\nIdk what else people do when they wake up early when traveling… force yourself to lay still for hours? I’m afraid to make a squeak now or move around too much. \n\nShe stays up later. So I wear a sleep mask, and earplugs. Sometimes I wake up when she switches her headphones from the iPad to the phone and the music starts playing, but I just go back to sleep.", "I did use the phone light when I tiptoed to the kitchen to get my phone. But the bathroom light seemed to be a better alternative since it’s around the corner from the hallway and a much better alternative than turning any other lights on.", "She's sulking because OP called her husband at a convenient time due to the time difference. If she can't understand the logic behind that then why are you assuming that she would have been more understanding if OP had called her husband at a later time?", "So you must have been even louder than previously suspected for her to still hear you! And yeah, any light in the otherwise dark room is going to wake a sleeping person. Why in the world would you leave the light on with the door open a crack while you’re not even in the room? Let her sleep for the hour that you’re quietly [and farther away] talking to your husband and then, if it’s really needed, use your phone light (shielded by your hand) to light your path when you come back in.", "I think if they do and it's a one off unusual thing , then yeah that's what they do, they don't get up and start turning on lights and making phone calls in communal spaces . If they are the kind of person that has to do this regularly then they get their own space or travel with people who don't mind being woken up early in holiday . \n\nYou are being over dramatic now claiming you are afraid to make a squeak , there is a big difference between rolling over in bed versus getting up , grabbing blankets , opening and shutting doors, turning lights on and having conversations in shared spaces that are loud enough to wake people up and I think you know it , there is no need to exaggerate.  \n\nIf she does that is also not cool either and you should mention it . The main thing is though the time difference between Europe and where your husband is that dramatic I assume you are coming from Oz, new Zealand etc.  You will need to organise a way that you are able to have those conversations of course and so organise your days around when that works best , otherwise you are both going to end up annoyed at each other", "> But the bathroom light seemed to be a better alternative since it’s around the corner from the hallway and a much better alternative than turning any other lights on.\n\nWell it’s not. Use your phone like a flashlight the whole way next time. \n\nI also feel sorry for everyone else who had doors/walls connecting to that stairway landing.", "Because she would not have been woken up at an unreasonable time in the morning when OP says they both have jetlag ? Thats not reasonable behaviour , why on earth does that compute that she is therefore unwilling to ever let OP speak to her husband", "Because.. as a light sleeper myself I think it’s better to have consistent little light than turning it on and off again. \nUnless it’s directly in your face. \n\nMy husband could barely hear me himself, he said, so I wasn’t loud.", "I said that because I wanted to get up and pee last night and was too self-conscious about noise, so I waited until the absolute last minute before going.\n\nI don’t know what’s normal or appropriate anymore or not because I thought we can’t control when we wake up, and if we try to be quiet by reading or being as quiet as possible it’s ok and understandable. It’s not like I’m running a blender in the morning (which one of the hosts did one time a few years ago, when I was staying in a shared space).", "and some people just wake up early. i wake up earlier than my friends 90% of the time.\n\nwhen we travel, i wander off until they wake up and are ready to start the day. they just call/text me when they're ready to meet up and i get a nice walk in.", "OP left the room to go sit OUTSIDE and this friend is still sulking that she left to go call her husband. What was OP supposed to do, if and when she wakes up just stay quietly in bed so this friend can sleep in? On their joint vacation? \n\nAgain, OP left the room to go call outside, and the friend is still sulking. Can you give me an example of what OP could have done according to you?", "Better to have: no light", "That's very different to saying you are scared to move . Look it's not a massive big deal , just talk to your friend. I would be mortified if I had woken someone up early when all struggling with jet lag and also just on holiday and not having to get up for alarms . I think most people know that when someone is asleep you don't have phonecalls and turn on lights and open doors expecting not to wake them up . If she wants to sleep and you want to be getting up at 6.30 then maybe need to rethink the accomodation plans , but just talk to each other", "And that's polite . You leave , I presume as quietly as possible so as not to disturb others .  OP has made a comment that says she turned a light on  , left the door open and went down a floor , where she was loud enough on the phone to wake her friend up a floor down ! How do you think the other people on that floor felt about it at 6am?", "Option 1 Stayed in bed to a reasonable hour , yes that's a polite option . Would you be ok with this if it was 4.30 ? 6.30 is quiet hour time \n\nOption 2 Left as quietly as possible and gone out to a place that was not going to annoy  other people , not turning on lights and not having a conversation outside in an area where she was waking people up at 6.30am \n\nThere are loads of ways OP could have made this less rude . Instead she went into a communal area and talked loudly enough to wake her friend up and therefore one assumes she is waking up other people in the area . It's rude and inconsiderate of others\n\nEdited she did not go outside . She went out into the communal hallway", "i leave as quietly as possibly. that will require lights get turned on. that i use the bathroom. basic morning/don't die stuff.\n\ni think of this as when you were in college and you have a roommate who wakes up when a light is turned on. that's rough but people need to get to their bed. they have to get up for class. lights are going to get turned on.", "Right.. I went to the stairwell. \nI could’ve gone outside, but it’s cold. And I would’ve needed the keys from the apartment building door. And if I was looking for them, I would’ve probably made even more noise. \n\n:(", "Option 1. There's a time difference,  what if her husband is working 2 hours later? My mother used to call me at 6.30 am, mid day for me because when she's done with work and can call, I would be in bed. Time difference is a thing.\n\nOption 2. She left. She did the best she could. \n\nAnd in most communal hallways you can't hear people talk.", "And that's a need . They have to leave at that time \n\nYou don't have to wake up your friend sleeping of jetlag to phone your husband", "Yup . Being cold would have inconvenienced you , so you didn't .  Instead you inconvenienced someone else and if you were loud enough for your roomie to hear , then you were inconveniencing others . It's ok to be like \" I picked the option of what I wanted to do and did not bother about it affects others\" but in my opinion that does make you the asshole \n\nI will say I don't think I would have gone off in the huff for the whole day , but being exhausted makes things much more of a big deal than it needs to be and maybe her getting some space stopped her saying something that would have been an over reaction", "I am aware of time differences , believe it or not . But thank you . And if I was choosing to go away without my husband , I would organise with my friend about this beforehand if I knew she was a person that might want a full night's sleep on their holiday and I would not be able to respect that and would have to get up to make phone calls.  If I knew I was going to be up and making noise at unsociable hours , I would have got my own accomodation, or made sure they had an agreement on what we were doing .\n\nShe did the best she could is not true  . She admits herself she could have gone outside but didn't want to as it was cold. So she would have been inconvenienced by that , so instead she made the choice to wake other people up. I don't think that's true about hallways - maybe in older apartment blocks but in modern builds or hotels that's just patentlyincorrect .  And finally ? This was not a life or death situation where she was like ... well if I don't get medicine or I need to call someone desperately. She woke up earlier than she planned , and decided to phone her husband . Not an essential thing . Sleeps a need. Chats are not.", "yes but if you are up, you're going to do something. and if OP was going to phone her husband at some point, this time made sense.\n\nand i don't think the issue was her talking on the phone- the issue was that OP woke up and because she was awake and doing this, OP's friend woke up. well, that was always going to be an issue if OP woke up before her friend whatever OP did.\n\ni agree that this should have been a conversation in advance. especially if OP often wakes up earlier than her friend. (my friends and i have blanket conversations of rak1882 wakes up earlier so she'll do whatever and we'll meet up)  and once it was an issue, her friend still needed to be- hey, i found this annoying. can we figure out a solution.\n\ntalking is an important part of relationships.", "I agreed , but if you are waking up early you can read on your phone for a bit . It was the talking , OP said that her friend was annoyed because she opened the door and then she could hear her talking . \n\nTalking is important but if you really cannot go one morning , when you know your friend is sleeping off jetlag , without walking her up and then going into a communal hallway ( so other people not just OPs friend) without speaking to your husband then either get a plan beforehand or dont go on extremely far away trips without him \n\nWould you feel differently if this was one of the other people who had complained ? As there is a fair chance there are people saying to each other \" god , did you hear that person in the hallway super early , yeah , that was annoying I was trying to sleep , I don't know why she didn't go outside \""]}