{"id": 28153, "submission_id": "16yttpi", "title": "AITA for demanding to be able to park in my parking space…", "selftext": "Repost because the bot did me dirty.\n\nSo I genuinely don’t understand people anymore, because these people did this with such a level of cheek, I’m almost wondering if everyone thinks this is okay and I’m being unreasonable here…\n\nSo I live in a residential area of Berlin, Germany. I pay a relatively large amount comparatively to rent a parking space at my apartment. I moved here about 6 months ago. When I moved I was told to contact the local governing body to apply for a temporary “Parkverbot” (parking ban) for an area on the street so that the movers would have space to park the truck on the street. We did this.\n\nNow there is someone else moving into the building. I came home yesterday from work and saw that they had parked the mover’s truck on the sidewalk blocking access to my (and other people’s) parking spaces. I guess fair enough to park there at first, but when I mentioned they were blocking my parking spot, they told me to park somewhere else. The rest of the street was full of cars and there was nowhere else to park except for rather far away from the apartment. Not only that, but the area where was available to park is an area where you have to remove cars by 6am. There is a sign and I know that they police it frequently because I have seen the Ordnungsamt (office of order) writing tickets many times over there. I refused. In my view, I pay for this parking spot, I should be able to use it when I want. \n\nAnd to be fair, they are breaking several laws being where they are. They are parked on the sidewalk and are blocking exits, both of which are technically grounds for a traffic ticket (I looked it up). They eventually moved the truck so that I could drive in. I tried to get out and get the things I had in my trunk that I had bought on my way home and the guy backed the truck up before I could even get out and parked so close that I couldn’t even get the trunk open. He just laughed at me when he saw this. \n\nWhen I came out of my apartment earlier to go get some lunch on our day off (today is a German holiday), they are back again and this time are blocking my exit. They moved when I asked them but not without an argument.\n\nAm I the asshole for getting upset about this? I am seriously considering making an official complaint about this to the landlord and maybe even making an “Anzeige” (report) to the police about the truck. It may seem a bit petty but honestly I find it very antisocial and just really assholic. Like I get maybe parking where they did if they would just move when the person who rents the spot asked to get out/in. But they tried to argue it, that I should just park somewhere further away. \n\nAm I the asshole for refusing to park somewhere else (or refusing to wait until later to leave) and demanding they move their truck so I can get in/out of the spot? Would I be the asshole if I reported this occurrence to the landlord or the police?", "created_utc": 1696344329, "permalink": "/r/AmItheAsshole/comments/16yttpi/aita_for_demanding_to_be_able_to_park_in_my/", "score": 107, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Am I the asshole for refusing to park somewhere else (or refusing to wait until later to leave) and demanding they move their truck so I can get in/out of the spot? Would I be the asshole if I reported this occurrence to the landlord or the police?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Sounds like they are going to be fun. 🙄", "NTA - I was on your side as soon as you said they were blocking the sidewalk, which is an asshole thing to do. I would most definitely tell the landlord AND make a report. Clearly it has lasted for more than one day. It would be different if there were no other options, but you went through the proper channels when you moved in, and they should be expected to do the same.", "NTA. People really need to be more considerate. My new neighbors who moved to the condo behind, introduced themselves before they moved in, let me know their move in date. They said that the movers would be there at a certain time and the duration. They apologized if this would inconvenience me and said to let them know if they need to move. We had no trouble at all.", "NTA. I would have reported it to the police the very first time.", "NTA\n\nThe only places you can park are ticketing zones after 6 PM.  They are behaving very poorly, even laughing at you having difficulties getting stuff out of your trunk.", "NTA. This behavior is insane. The only question I have is ... does the guy moving in know that he can get a municipal \"parking ban\" for the time he's unloading his truck? Because that really is the solution ... the problem is he may not be aware of it. \n\nSay hi to Berlin from me in New York. :)", "Here's the thing. They blocked you out of and into your parking space. But they did move to let you get in and out of your space. But they were rude about it. Had they not been rude, but been apologetic instead, you probably would not have minded. So basically, you are reporting them for being rude. Is it worth it? Is it causing drama with someone who will be living nearby you for some time leading to more and more drama and heartburn for you? OTOH, are they just bullies who need to be smacked down right away lest they take advantage of you over and over in the future? \n\nI am going to judge you as NTA if you do decide to report them, but consider carefully that it may just cause you more grief in the future, If you still think its the right thing to do, then do it. I hope it works out for you.", "YTA - The moving truck blocked your parking space. The moving truck is a one time temporary situation. That's too bad. If you want to report it, go ahead, the truck will be gone by the time the city sends anyone around to deal with it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nRepost because the bot did me dirty.\n\nSo I genuinely don’t understand people anymore, because these people did this with such a level of cheek, I’m almost wondering if everyone thinks this is okay and I’m being unreasonable here…\n\nSo I live in a residential area of Berlin, Germany. I pay a relatively large amount comparatively to rent a parking space at my apartment. I moved here about 6 months ago. When I moved I was told to contact the local governing body to apply for a temporary “Parkverbot” (parking ban) for an area on the street so that the movers would have space to park the truck on the street. We did this.\n\nNow there is someone else moving into the building. I came home yesterday from work and saw that they had parked the mover’s truck on the sidewalk blocking access to my (and other people’s) parking spaces. I guess fair enough to park there at first, but when I mentioned they were blocking my parking spot, they told me to park somewhere else. The rest of the street was full of cars and there was nowhere else to park except for rather far away from the apartment. Not only that, but the area where was available to park is an area where you have to remove cars by 6am. There is a sign and I know that they police it frequently because I have seen the Ordnungsamt (office of order) writing tickets many times over there. I refused. In my view, I pay for this parking spot, I should be able to use it when I want. \n\nAnd to be fair, they are breaking several laws being where they are. They are parked on the sidewalk and are blocking exits, both of which are technically grounds for a traffic ticket (I looked it up). They eventually moved the truck so that I could drive in. I tried to get out and get the things I had in my trunk that I had bought on my way home and the guy backed the truck up before I could even get out and parked so close that I couldn’t even get the trunk open. He just laughed at me when he saw this. \n\nWhen I came out of my apartment earlier to go get some lunch on our day off (today is a German holiday), they are back again and this time are blocking my exit. They moved when I asked them but not without an argument.\n\nAm I the asshole for getting upset about this? I am seriously considering making an official complaint about this to the landlord and maybe even making an “Anzeige” (report) to the police about the truck. It may seem a bit petty but honestly I find it very antisocial and just really assholic. Like I get maybe parking where they did if they would just move when the person who rents the spot asked to get out/in. But they tried to argue it, that I should just park somewhere further away. \n\nAm I the asshole for refusing to park somewhere else (or refusing to wait until later to leave) and demanding they move their truck so I can get in/out of the spot? Would I be the asshole if I reported this occurrence to the landlord or the police?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, start with the landlord, you did what you had to, they did not and they are causing you grief.", "NTA - Call the police and get the truck removed from the area.", "Nta. They are ah. You didn't have to even ask, you could have just phoned the authorities. People suck", "NTA.  Tell the landlord, and the authorities.  If it really isn't the tenants and it's the fault of the movers, they need to know how to work legally and do so, or face legal consequences.  If it's happened to you, it's happened to other people across your city.", "Nta", "NTA, file the police report. There's literally nothing else to say but file the report and take documentation (photos, videos, etc).", "NTA - many cities have temp parking signs for movers and they are often free or a small fee so that movers can park.\n\nBlocking a driveway or parking access is just a dick move on their part. Considering they gave you attitude and made it so you could get to your trunk, I’d have called parking enforcement and reported the truck. There were other people who were impacted too.", "Complain to the moving company. Leave a bad review on Google...\n\nMaybe you can mention this to the landlord. But what shall he do about it as it's not the tenant who blocks you?\n\nPolice won't do anything about it and Ordnungsamt is unlikely to be out on the streets on a holiday. And even if... nobody will have a moving truck towed...\n\nNTA, but suck it up once. Only once", "INFO:  Did they get the permit like you did?", "If you're German you'd have complained the first minute", "To be fair, it was the movers behaving poorly, not really the tenants. They got involved in the argument at the end too saying “what should we do” which was when I told them about getting a temporary “Parkverbot” and he huffed at me. But where the truck was and how they moved it and the laughing at me was all the movers themselves. But also they should know better than to park where they did, that being their job and all.", "That’s another thing that really irritates me with this, is because I had to go through this bureaucratic bs to get it and pay a small fee and everything to do it right… Then other people just do shit like this and get away with it. It ends up punishing the people who do the right thing…", "There is no excuse for blocking someone’s access for anytime longer than a few minutes. This happened on multiple occasions. NTA", "The moving truck blocked my parking space, which I pay  over a thousand euros for a year, meaning I would have to park on the street with the only available spots being about a kilometer away which I would then have to get up and move at 6am because of the parking ban that takes effect beginning at 6am the next morning.\n\nAnd it’s already happened twice, not just once. \n\nJust correcting a few inaccuracies in your statement there. If you still think I’m TA, then fine. But I want you to understand where I’m coming from here.", "You didn't even read the post", "The truck was there for an extended period of time.  Presumably the were also told they needed to get a permit, like OP, and decided not to.  Then they were petty and blocked OPs access to their trunk, and blocked the sidewalk and exits.  OP is patient and NTA", "It’s already been twice though. And I could report with the license plate number or something… \n\nAnd as far as reviews in Google, I’d really rather not. Because I’m not a customer of them, I don’t know if that’s the sort of thing they can then sue over… But they are very sue happy with Google reviews here in Germany and it’s not protected.", "No. I even mentioned it to the guy and he huffed and was like “Oh so did you do that when you moved in” like a ‘gotcha’ sort of moment then when I said yes he himmed and hawed for a moment before walking away.", "I had movers do this when I got a temporary moving parking permit. They were absolutely infuriating before they finally moved. It’s so easy to get a temporary moving permit here too, just one tiny form online.\n\nRegarding the neighbors, seems like they aren’t going to respect the parking rules whatsoever so do what you can to ensure access to your space NTA.", "This is all the reason you need to call the police non-emergency line and explain the issue. The police can make them move to an appropriate area or cite them for not having the correct permits. Certainly movers should know that permits are required to park in certain areas. They seem like a lazy company cutting corners hoping to save money", "That’s why you should just call the police non-emergency line and let them deal with the rule breakers. If they get a ticket, it’s on them.", "Call the police on the moving company.  Not the tenants but the company.", "NTA and oh how I feel your pain. I lived in New Orleans, LA (USA) in the French Quarter directly on the river front. Some days I could barely open my door to walk my dog because apparently people don't realize that there are actually residents living on the top floors of EVERY building in the city. As for parking? Forget it. Luckily the Quarter is pretty self-contained and I rarely had to drive so once I found a parking spot that's where the car stayed unless I was leaving town. BIGGEST headache.", "NTA \nWelcome to Berlin, where streets are dirty and people are rude.  \nDepending on where you are from,  you might be in for a bit of a culture shock.  Don't back down. Good luck", "NTA, call your authorities. \n\nAt a point in time, they've decided to make blocking your spot a game to mess with you.", "I thought Germans prized order and obedience to rules above everything. You're NTA.", "You are to kind, I would've called the police from the first time.", "Unfortunately you have gained a rude, entitled neighbout.\n\nNTA", "Can you file a complaint with the moving company?", "Call the company and complain then.\n\nThere's nothing you can do about it other then what I mentioned.\n\nIn the end you're NTA for demanding access to your parking spot. But unfortunately there isn't too much you can do about this.\n\nI am not sure who wants to sue you for leaving a review? First it might be deleted but suing? This is not America, people usually cannot sue you for a reasonable review", "That „non-emergency line” isn’t really a thing here as far as I know.", "It is. Just call the office number of the nearest police station and not 110"]}