{"id": 28224, "submission_id": "16zqhks", "title": "AITA for not wanting to give up my motorcycle after my girlfriend got pregnant", "selftext": "So me and my GF have been trying to have a kid and we have been successful and she's currently 2 months pregnant. We were just hanging out and the she told me that she expected me to sell my motorcycle soon cause it was just too dangerous of a hobby to have as a soon to be dad.\n\nI told her I wasnt going to do that since ive been riding for the past 10 years and been perfectly fine and she's just over reacting. She told me that this was something she wasn't going to budge on a and that i had to do it.\n\nI told her that it wasnt her choice to make and i wasnt going to give up my hobbies just cause i was about to become a dad and that she should have brought this up back when we decided to start trying for a kid. ", "created_utc": 1696433964, "permalink": "/r/AmItheAsshole/comments/16zqhks/aita_for_not_wanting_to_give_up_my_motorcycle/", "score": 637, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > For refusing to give up my motorcycle when im going to be a dad soon\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "I don’t want to judge, but I lost my brother in a motorcycling accident - who was a young dad of two very small kids at the time - so I kind of get where your GF is coming from. \n\nThe thing with motorcycle accidents is that it’s hardly ever is about a lack of skill or safety measures taken by the motorcyclist, and more often than not about dangerous behaviors by\nothers. You’re so damn vulnerable on a motorcycle!", ">she should have brought this up back when we decided to start trying for a kid.\n\nNTA because you're right that she should have mentioned this was a dealbreaker for her.  Not sure what she means by \"not budging\" though---is she saying she will break off your relationship?\n\n--->She's not wrong about the general \"concern\" around a new parent having dangerous hobbies.", "Info: Do you have life insurance?", "NAH, but you're not the most important person in your life anymore. You have a responsibility to your daughter to not die in a stupid motorcycle accident.", "ESH I mean, yes she should have known to clear this up when you were both trying for a pregnancy but I also would be terrified of becoming a widow single parent if my partner rode a motorcycle so I can empathize with her.  All I ever hear from my hospital friends is how often they see these accidents and how horrific they are. Good luck!", "NAH Look, motorcycles are arguably more dangerous then a car but it’s also your choice to do what you want with your life, just Atleast make sure you’re riding with motorcycle protective gear.", "my father sold his 63 mg after my sister was born . sad , but he knew the car wasn't safe and would never put himself in harms way over a silly vehicle . sounds like you have it all figured out though . YTA .", "INFO: Do you have a lot of Short- and Long-term Disability insurance coverage? A lot of Life insurance? And an emergency fund? If yes, ride on, my friend. If you don't have all 3 of them, get them all or don't ride until the kid is 18. I'm not kidding. Bad stuff is way more likely to happen on a bike vs a car. You have a family to support now. How are you gonna do that if you can't work for 6 months because some dumbass in a car turned left in front of you?\n\nSource: biker who spent 6 months on full and 6 months on partial disability after crash. If I didn't have a big ass emergency fund and good insurance, I'd be bankrupt. Shit happens.", "NTA but I would still cave and sell it if I were you.\n\nI was in the same boat with my wife. She is an emergency nurse and she gets the remains of motorcycle accidents almost daily. I say remains because there's not much left.\n\nI have all the same excuses you do but I learned that everyone of them was pushing my own selfish agenda. When I looked at it I know seven people that have died or have permanent damage from a motorcycle accident. Everyone I know has similar numbers.\n\n I've been riding motor cycles without an accident for 20 years. While I am an amazing driver, you can't claim that for everyone. Eventually someone will be a dumbass.\n\nIt's a little different if you're in a car/truck. They are better designed to keep you safe. A motorcycle has none of the bells and whistles. If you get into an accident it is much more severe.", "ESH. My father spent the first year of my life in a wheelchair after a lady blew through a stop sign and wrecked his bike. Is that what you want for your first year of fatherhood?", "ESH. 99.9% of the time, it would be ridiculous of her to all of the sudden tell you what to do and say she’s “not budging” as if she has a say…. But a motorcycle? The data is clear as day: you’re begging to make her a widow, sole caretaker of this kid, and make your to-be child a fatherless one. That’s just the reality.  So yes, when you’re aware of that reality, it makes you an AH being a father-to-be playing with death and risking leaving them alone. \n\nShe should have made her thoughts more clear before getting pregnant instead of springing this on you. That’s what makes her the AH.", "NAH. She would have been TA if it was just the two of you, but things change when there's a dependent involved.", "NAH - she shouldn't have sprung it on you like that, but she does have a point that it is a very dangerous hobby. I was raised by a wonderful father, but biologically I am his best friend's kid. He was run down while riding his motorcycle while my mother was pregnant with me. Please take her concerns into consideration.", "ESH. Her for acting like she has power over you, and you for not considering her very legitimate concern. Check the stats some time, you'll see why hospital and morgue workers consider motorcycles the kiss of death.", "NAH I get where she’s coming from and where you’re coming from. It’s kinda funny my husband and I each have something that we think is unnecessarily dangerous. We kinda let it go as each was important to the other and now just morbidly joke above each others life insurance policy’s.", "[deleted]", "NTA.\n\nYou're 100% right, it's not her call to make, especially since you're not even married (and even if you were, it still wouldn't be her choice)!\n\nYou should take this as a wake-up call to have discussion on other things too before the kid comes.  Like finances, how you plan to raise/parent it, last name, etc.  You're going to both have some tough decisions to make probably with a lot of compromises, so strap in tight!", "ESH\n\nY T A for telling us the future mother of your child is \"sulking\" about you casually risking your life on the daily. Have some damn respect for the woman you CHOSE to impregnate.\n\nYeah, she should have brought it up before deciding to have kids with you. But in every other thread about parenting standoffs, people scream that \"kids change everything\" no matter what past agreements and promises were made about your individual wants. I say this as someone who rode and loved it: No one needs a motorcycle.\n\nEither way you're gonna be a dad and the pressing question is: How much life insurance do you have?", "YTA because you need to accept that your life does not just belong to you anymore.\n\nYou have a child and a girlfriend who is going to be depending on you for support, and you are out riding a crotch-rocket.\n\n10 years safe, that means that tomorrow will be safe?\n\nSorry, YTA.\n\nYour wife doesn't want to be a single mother in deep poverty after your brains are rinsed from the blacktop, because you thought you still wanted and deserved freedom even though you made the active choice to bring another life into this world.", "NTA your girlfriend is allowed to not budge on her opinion, but that doesn't make it enforceable. How is she going to stop you? Does she have a gameplan?", "NTA.\n\nAs a child raised by two motorcyclists - who were riding well before I was born - I get her concern, but it's no different that someone who enjoy snowboarding. And honestly, every single accident my parents have been in in the last 50 years (only a few) have been in cars, never on their bike.\n\nAre there risks, absolutely. But if you're not one of the crotch-rocket riders, pay attention, and drive responsibly your chances of an accident are reduced.\n\nThat being said, her fears are not unfounded. It can be dangerous, and you really have to be understanding of that.", "NTA...She can't simply make these demands.  You're right, this should have been a discussion long before trying for a child.", "NTA - You're 100% right, this is something she should have brought up before trying to have a kid.", "Currently pregnant with baby number 2 and my husband has been in the motorcycle trade for the past 12 years and was riding for fun another 3 years prior since he was 16. It's an intrinsic part of who he is, it's been such a large part of his life for so long. After we had our first, I didn't ask him to give it up I just told him he has to ride completely safely and within the law. Which he has followed pretty well (except for when he sped to the hospital 10 weeks ago for a miscarriage scare) He used to ride like an arse when he was younger, but now he keeps our daughters at the forefront of his mind. \n\nNTA. Maybe discuss that you'll be safe and you'll take all safety measures. Regardless of what you do, the road isn't safe for motorcyclists, drivers, cyclists or pedestrians as there's always someone else who's stupid enough to think they deserve to be on the road.", "NTA. Yes, she should have thought about her concerns and voiced them before starting, no, you should not sell the motorcycle, because giving up on yourself doesn’t make for complete parents.", "NTA. But I think a reasonable compromise would be for you to try to be extra careful?", "NTA - she knew already", "NTA\n\nYes, driving a motorcycle can be dangerous and, to an extend, I understand her concern. But I draw the line where her concern becomes an ultimatum. Nope, that's not how a healthy relationship works.\n\nBesides, if we look at stats, also bikes and cars are dangerous. Hell, sometimes just leaving your house by foot is dangerous. So what? Does she want to lock you up?", "NTA. If this was the first time she mentioned it, right after getting pregnant, it looks like maybe she deliberately waited to get pregnant first, so she'd have more leverage to make you get rid of it. \n\nBut... It may just be her hormones talking, so if she's not usually very manipulative and controlling, maybe she'd come around. Don't get rid of your bike.", "NTA. As long as you're being as safe as possible. That means a helmet and protective clothing at all times. Just be warned that Reddit collectively hates motorcycles, so you might get a lot of Y TA comments.", "NTA she shouldn't have waited until after she was pregnant, makes you wonder what other ultimations she will pop on you.", "NTA\n\nI know several parents with motorcycles, and they are responsible. It’s an AH move for her to demand that, at the very least, she should have brought it up when discussing having kids and not attempt to trap you into doing so after she started carrying.", "NTA!! Can’t become a hermit just because your having a child, any one of us could drop dead at anytime", "NTA. While motorcycles are more dangerous than cars. Anyone can lose their life in a hundred different ways everyday.", "NTA - \"How about No!\"\n\na lot of you sound like riding a motorcycle is like pouring gas on yourself & lighting it \n\nthat's a near-certain death sentence.", "In her extremely hormonal state all she wants is peace of mind. But she’ll never get that with you. Not ever. \n\nESH", "NTA  ... Just because you have a kid doesn't mean you lose your hobbies....\n\nAs a rider myself the danger ISN'T the bike. It's all the cars that don't pay attention to bikes on the road. Or drivers who simply don't follow road etiquette and traffic law .... speeding, following too close, not signaling, cutting people off etc. \n\nI would say maybe 5% of riders are at fault because they're doing stupid shit... the rest of us just want to cruise.", "NTA-\n\nShe saying what now?\n\nI'd does (kinda) make sense, not wanting to become a widower..\n\nBUT\n\nBUT\n\nBUT\n\nAs you said, she could have mentioned this before, but as i see it, she might have been sceptical that you wouldn't want to try for a kid anymore if she would have brought it up.\n\nalso, what's the worst in this situation, is that she knows how much riding on your bike means to you(besides the fact that you have your 10 motorcycling experience), yet she has the AUDACiTY to even ask you to give that up!!! Like what the 🐔!!!!\n\n\n\nshe is controlling, selfish and inconsiderate.\nto late now, but do you really want the mother of your child to be her?!\n\ni don't like her PERiOD \n\n\n\nhoney, sorry not sorry.\n\n\n🖖", "YTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo me and my GF have been trying to have a kid and we have been successful and she's currently 2 months pregnant. We were just hanging out and the she told me that she expected me to sell my motorcycle soon cause it was just too dangerous of a hobby to have as a soon to be dad.\n\nI told her I wasnt going to do that since ive been riding for the past 10 years and been perfectly fine and she's just over reacting. She told me that this was something she wasn't going to budge on a and that i had to do it.\n\nI told her that it wasnt her choice to make and i wasnt going to give up my hobbies just cause i was about to become a dad and that she should have brought this up back when we decided to start trying for a kid. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. My dad got crippled in a motorcycle accident when he was 17. My mum didn't want him riding after that. He basically never did, although he kept buying bikes and doing them up. He'd just pop up the road and back to check they worked, or rode scramblers in the countryside. You could tell he still was just really into them and it was pretty much the most compromise he'd provide. They were a childhood obsession, and just his thing.\n\nThen we lost him 6 years ago to a heart attack after moving a heavy television.\n\nMaybe don't ride it at rush hour or at night. Go off-roading instead? Get life insurance and try to compromise a bit.  If she still won't budge then you've made your attempt.", "Nobody's right here. What we need to be doing is finding a middle ground instead of arguing. YOU ARE ALLOWED TO HAVE HOBBIES AS A PARENT- despite misconception. Parents are people, too. Involved parents can also have hobbies... How else do they relax and keep themselves from burnout? Anyway, your girlfriend is obviously worried about you. She cares. This isn't the end of the world, and you shouldn't shame her for that. At the same time, it's not fair for her to tell you HAVE to sell your motorcycle. Yes, you guys should've talked about this prior to trying, but you didn't. So now what do you do? Be mad at each other and ruin the relationship? Or apologize to each other and find a middle ground? That's all relationships are about- compromising. Nobody agrees on everything all the time. I'm sure at the end of the day you love this woman- so love each other and quit acting like children!", "NTA.  Keep your bike. Just ride safe and have insurance.", "Too many of my friends have died on their motorcycle. Sorry dude but i gotta side with her. I’d be terrified of being a single widow mother. I get that it’s fun but it’s not worth the cost. If you care about her and your child, hang up the helmet.", "I was ALMOST going to say not the A H til I read on and realized how selfish and entitled OP sounds. Between not being prepared to give up hobbies because of becoming a dad and condescendingly speaking about his wife sulking (in a reply to a comment). OP just isn’t ready to be a dad. Hopefully he grows up quickly otherwise I see big AH flags ahead.", "NTA. Then people need to sell their cars, bikes because people die from that too?\nWatch out if she doesn't sell it behind your back", "No i think she believes if she sulks long enough ill give in", "It isn't life insurance you usually need. It's DISABILITY insurance. Most bikers survive the accident but have lots of medical needs & rehab. If you have a kid, you need to keep an income stream coming in.", "In his defense it’s usually not as bad for the rider, since they are dead.  It’s the firefighters, paramedics, police, ER staff, and family that get to live with how horrific it is.", "OP lost me at the 'I'm not going to give up my hobbies just because I'm a dad.' line. I mean, yes dude, you absolutely are. A new baby, a first baby especially, is all consuming. I wouldn't be asking (let alone telling) him to sell his bike but he's got to realise he'll have sod all time to go riding. Unless he's planning of dumping all the childcare on his wife of course. ESH", "And a boatload of life insurance.", "She's the AH due to demanding.  Had she asked or wanted to discuss it, that's different, but I think her saying he must do it no longer lets her off the hook.", "Better not have kids, cancer is so rampant your begging to die and make them a widow. \n\nStupid analogy that makes no sense", "Man id love to meet your husband he seems like the kinda guy i wanna still be like as i get older.", "It isn't just the life insurance you usually need. It's also DISABILITY insurance. Most bikers survive the accident but have lots of medical needs & rehab. If you have a kid, you need to keep an income stream coming in.", "This isn't about if motorcycles are safe or not.  It's about her demanding it without even a discussion and expecting him to just do it.", "> YTA because you need to accept that your life does not just belong to you anymore.\n\nSo if he says she is no longer allowed to go out in a car unless its necessary, is that ok? Cars accidents are one of the leading causes of death, so clearly going out when you don't need to is equally reasonable, right?\n\nwouldnt want to leave an innocent baby without a mother because she went out to see a movie with friends, would you?", "Yes, a friend of my uncles in Florida rode a motorcycle almost everywhere from 18 til 39, when his new wife demanded he get rid of it.  It was to dangerous she said, he never had an accident, approximately 5 months later he was killed in a car accident.  Anything can happen, at any point, at any time.", "this comment gave me scabies", "Be carefull she doesnt sell the thing behind your back.", "Sounds like OPs not ready to be a dad.", "It isn't life insurance you usually need. It's DISABILITY insurance. Most bikers survive the accident but have lots of medical needs & rehab. If you have a kid, you need to keep an income stream coming in.", "You cannot choose to sell the cancer, thought, can you? There are risks that you cannot do anything about and the ones you can. This is where analogies get stupid or not.", "You shouldn't smoke if you have kids either. Why take stupid risks?", "[deleted]", "That's a strawman argument and it is stupid.", "Washington state hbu", "That’s literally your argument you dumbass", "[deleted]", "Thats unfortunate you two seem cool", "Awww, thanks for that nice comment!", "INFO: How much disability and life insurance do you have and is your child/her the beneficiary? How long can she live off it? 1 year? 10?", "My friend's dad was a highly skilled motorcycle driver. Last summer, he went missing on his usual back roads ride. His body wasn't found for five days.\n\nNAH, but she's got a point. You committed to sticking around when you chose to have children. She should have communicated this beforehand, though.", "FYI part of my job involves reviewing medical records at a trauma center hospital.\n\nGet rid of the motorcycle. Trust me.", "ESH, but mostly you.  Sure, she should have brought this up.  But she also probably thought you already had sense to know.\n\nHere's why \"mostly you\":  you have a greater responsibility now - not to her, but your kid.  And, she's ***your girlfriend***.  Which means she has less legal protections to support her and your kid if you are killed, particularly without a will.  She's not making this demand because of her, she's trying to protect your kid.", "I’m not going to make a judgment on this. I will share a story. My neighbor loved his motorcycle. His wife had just had their 3rd baby and he and his buddy went for a ride, he ended up crushed against concrete construction barriers by a drunk driver. He left behind 2 toddler boys and an 8 day old daughter. Doesn’t matter how safe the rider is, it’s other drivers.", "ESH \n\nY'all should have discussed this before getting pregnant (assuming this wasn't an accident). My parents made a deal when they decided to start trying for a kid, my mom agreed no sky diving and my dad agreed no more motorcycle. \n\nMy best friend, her dad continued to use his bike after she was born and had three separate accidents (he was hit by cars and legally not at fault each time) and because of this now has difficulty walking because of his leg having been shattered so much. He missed his daughters birthday because he was in the hospital, couldn't run with her at the park, teach her how to bike. He missed a lot of mile stones. He never wanted to give it up but my dad eventually talked to him and asked would he rather have a hobby or be alive to raise his child. He chose the latter.\n\nNow that I'm no longer a dependent, both of my parents have picked up their former hobbies. That's one of the sacrifices of becoming a parent, your life cannot and will not stay the way it was when you were child free. And frankly it would be irresponsible to do so.\n\nI understand it is your hobby, but with the high risk that comes with it, do you really want to risk leaving your child with a single parent if you got into an accident? Is your motorcycle worth it? If yes, then you're not ready to be a parent.", "YTA. Who's going to look after you if you're disabled on your bike? Is it going to be her, by any chance? Then she gets a say in whether you ride or not.\n\nIf you've got enough insurance to hire a nurse to look after you 24/7/however many years, then NTA.", "WHY DON’T PEOPLE COMMUNICATE BEFORE CREATING HUMAN LIFE????", "No problem, OP. Make sure you are an organ donor though :)", "If you won't give up a dangerous hobby to ensure you are present for your child, at least make sure you have a very large life insurance policy so that they will be cared for if the worst happens.  That's not sarcasm.  I have quite a few friends that are bikers. One was hit by another driver and broke his neck.  Paralyzed from the neck down.  It was not his fault at all, but he's the one living with the consequences.\n\nAnother friend was literally going 15 mph in a neighborhood, *was* wearing a helmet, and was hit by an unlicensed driver and broke his neck.  He was lucky; he only had to spend weeks in a hospital, a couple of surgeries,  and months of physical therapy.  He still has ongoing problems years later.  \n\nMy point is that even if you are a fantastic driver, other people aren't, and people on motorcycles often wind up dead or severely injured.  So, if you continue to ride, make sure your family is covered financially in case you are ever not able to provide for them.", "YTA.\n\nWhat a coincidence. I just drove past a freshly dead motorcyclist on my way to work quite recently. A disabled vehicle had stopped in the roadway, and the motorcyclist couldn't stop or swerve around it in time. I read later that he was pronounced dead at the scene. It happened about a minute or two before I drove past it. \n\nBut I also work at a police department headquarters building. My office is right below the 911 operators. (As part of my job, I access the 911 calls to give traffic reports.) The frequency of motorcycle fatalities would surprise you. Motorcyclists of all ages. Teenagers. Guys in their 20s, 30s, 40s, 50s... it doesn't matter how much experience they had. There are also plenty of crashes with serious injuries. Which sometimes turn into fatalities later. In nice weather, one or two a week is normal. \n\nSome of them are caused by other drivers. Sometimes the motorcyclist made the mistake. Some are operating their motorcycle too quickly. Some are obeying the law completely and someone else crashes into them or turns abruptly in front of them. \n\nYou risk your life every time your drive in traffic on a motorcycle. You owe your future kid not to kill yourself. You owe your kid to be around to love and support him / her and his / her mother. Think about it.", "If you're going to keep riding, you need to take out a massive life insurance policy.", "ESH but mostly YTA. They are called donorcycles by medical staff for a reason. Its all fun and games until they are pressure washing what used to be you off a roadway. \n\nClient of mine, age 24, left his pregnant new bride behind after he wrecked, because a sign was obscured and he swerved to miss a car in a hidden driveway that was exiting. \n\nYou can be the best driver in the world and it doesn't matter at all. \n\nShe should have brought this up before getting pregnant but its obviously a no-brainer so she's probably stunned you would even consider something so dangerous with her being pregnant. She's ever so slightly the asshole for the ultimatum but barely.", "Donorcycle!", "This is up to you and her to work out so not going to pass judgment but FYI you are delusional if you think having a kid won’t mean you have to give up your hobbies. Once it’s a bit older you can start them up again but the first few years they occupy 90% of your your time and attention. The other 10% is sleeping.", "Congratulation on becoming a father \n\nNow as your responsibility  grow , you have to be more proactively thinking about your family \n\nRiding a motorcycle , the freedom , racing a sports car down the highway , it’s all fun and adrenaline rush \n\nBut if you do , you also increase the chance of becoming organ donor .. so better to have life insurance and get your will / orders in place \n\nShe is your girlfriend , but she is becoming your future mother for your kid , she want to be protected … if you a traditional men , then you want to hear her input", "I wouldn't let my husband skydive when I was pregnant.\n\nI did take him skydiving when the kids were 23 and 33.", "My dad works in a hospital for years. All or almost all hospitals call motorcycle riders organ donors. So I can see why she feels this way.", "I can understand where she is coming from. \nMy friends have a two year old. The dad went and bought a motorcycle a few months ago. Already flipped over the handlebars when another car pulled out and he smashed right into it. Wasn't his fault but holey hell. He was okay... but what if it wasn't?\nShe should have bought this up when you were discussing pregnancy yes. For this, NTA.\nPLEASE. BE. CAREFUL. \nYour girlfriend and baby need you", "NTA\n\nI wanted to get some perspective on how dangerous motorcycle riding is, so I looked up some statistics for 2021 or 2022 in my country and they were definitely not what I expected. \n44 motorcycle riders out of 691.000 died in a motorcycle accident, which is 0,0064%\n45.542 people out of 17.590.000 died of cancer, which is 0,2589%\n38.986 people out of 17.590.000 died of heart and vascular diseases, which is 0,2216%\n\nI was shocked, because I did not expect this difference between motor riding and the diseases, the other way around would have been more logical to me. \nAnyway, I ride, and I didn't stop when pregnant. It's not just a hobby for me, it is a part of me and I would get seriously depressed if I had to stop.", "Donor-cycle.   You don’t give up the motorcycle for your girlfriend.  \n\nYou give it up for your child.  One distracted driver on their phone and your kid grows up fatherless.", "Well, they aren't called widow makers for no reason....\nBut I understand it's hard to give up so NAH", "Make sure you have a will and good life insurance, every parent should do this.", "YTA\n\nMotorcycles are death machines and you now have a huge responsibility. Take it seriously.", "YTA", "INFO - do you have good life insurance?", "Very soft YTA. \n\nYes, you and your gf should've probably discussed this more beforehand. However, early pregnancy hormones are very much a thing and might be adding to her feelings about the situation. \n\nHOWEVER, I can also understand her sentiments. I remember when I was a kid and my dad had gotten his motorcycle to commute to and from downtown every night, because it was cheaper than a car to fuel and maintain, and my mom was alright with that because she had recently become a SAHM, and my sister was still a baby at the time. A truck had dropped a dolly in the road during morning rush hour traffic, and my dad had just gotten off of work. It was on a 4-lane stretch of I-35, my dad and the truck that dropped the dolly were in the second-from-the-left-lane (aka the 2nd fastest travel speed lane). Everybody in front of my dad slammed on their brakes, and in my dad's knee-jerk reaction, only slammed on his front motorcycle breaks going easily 65+ mph.\n\nNeedless to say, he went over the handlebars and his bike fell over. The only two things that saved my dad in that situation?\n\nA. His helmet\nB. His gun\n\nHe slid on his gun into the left-most lane of traffic and had to very quickly continue rolling to his left towards the concrete median to narrowly avoid getting run over and killed. I remember my mom sounding so panicked in the kitchen while I was getting ready for school, and she shoved me in the car after calling my teacher and letting him know I wouldn't be in class that day, and I would need to make up our spelling test that day next week. Seeing my dad bruised up, with his uniform all torn up from sliding on the pavement draped over the chair in the hospital was a very scary thing to 4th grade me (honestly, the only reason I remember all this shit so well). Thank the powers that be that he only came away with bruises and a broken bone in his thumb that had to be reset with plates and pins. He sold his bike not long after that incident.\n\nAll that being said, I'm sure you're a wonderful and safe motorcyclist, but shit can still happen. Shit that's sometimes completely out of your control. I would take a moment to very carefully consider your gf's thoughts on the matter.", "You're right, you are free to do as you please.  She's not wrong either though.    \n\n\nIt doesn't happen overnight but soon you'll start thinking like a dad instead of a young man and then you'll be able to see the situation more clearly.  You may still decide to ride but I don't think you get it quite yet.", "Eh, NAH, but if you're not going to park your donorcycle, make sure to get a good life insurance policy.", "I work in healthcare. We call them donorcycles", "Aaah. I empathize with you because I really loved riding a bike too despite my mom’s many many exhortations. Then I saw a guy’s body smashed on the side of the road. Got me back in my senses and I stopped. My uncle is a doctor and he calls bikers “living organ donors”. \n\nNTA only if you break up with her for sure because she shouldn’t be risking her sanity on someone who would keep doing something risky without a thought about her and your child.", "Certainly this should have been discussed before the impregnation. It was an expectation she didn't share with you. NTA for that. \n\nShe's not wrong about it being dangerous and it's not because you might have an accident. It's because you might be someone else's accident. Watched a guy get clipped on a corner many years ago. Right into a guardrail. On to? Split him wide. Id never seen the inside of a human like that and never want to again. Imagine it was a closed casket wake.", "At least the kid will have organs to choose from if they need it.", "She's probably just freaking out and seeing the motorcycle as a sign that you aren't ready to be a father. Irrational, probably not true, but pregnancy hormones are a rollercoaster.\nTry asking her what's really going on and get to whatever is underneath this.\nNAH", "My mom had the same rule for my dad when I was born but eventually he bought a bike when i was 12 and was killed in an accident less than a year later. I will never ride one.", "NTA, my bd is still a rider and i would never ask him to give up the one thing he loves doing. He’s always said if he does riding, he died happy. Although as new parents, i did convince him to purchase life insurance on himself. Should, God forbid, anything happen to him, our child and I won’t have to deal with financial struggles on top of grief.", "She can’t make those decisions for him. I would never give up my motorcycle!", "ESH. I can understand her. she doesn't want to be a single mom. she's full of pregnancy hormones and is scared for your safety and her future security. that said, it's not reasonable that you'd totally give it up. however, you're also an AH because you're not being empathetic AT ALL and not trying to validate her feelings/compromise.", "NTA. I understand and agree with some of the concerns people listed. It's definitely higher risk, but it's something you're passionate about. My partner and I are really into driving. It's in our blood. I just spent a week driving straight economy cars that have a fit doing anything remotely fun and I was miserable. Driving is so fulfilling for me. I feel it might be the same for you. My partner and I are team no kids, but in the event that we changed our minds, I would fight for him to keep his Miata, which he plans on super charging. Driving is a huge part of who he is and I'd argue for him to keep the car. He wouldn't be the man I fell in love with otherwise. And I wouldn't be the woman he fell in love with.\n\nWhile I think while her reasoning is valid, her approach and unwillingness to compromise truly bother me, especially as she is a mom to be. I mean, you could keep the motorcycle and take it up around the neighborhood just to keep everything running until your child is old enough to share this with you. I absolutely don't think you should give up the bike. There are quite a few people I have seen that have families and both parents have motorcycles. \n\nTo all of those who will inevitably throw shade on my stance, let me steal your joy. I'm not a parent. I don't intend to be. I realize my stance could be controversial and that's okay. There's a reason I've chosen not to have kids.", "ESH. She shouldn't have \"expected\" you to give up the motorcycle, and I wouldn't see that as something worth an ultimatum. But you're also at a point where you need to start evaluating priorities and risks in a different way, understanding that it's not just \"your life\" anymore.\n\nAlso, telling someone they're over reacting is a guaranteed way to de-escalate. Did you tell her to calm down, too?\n\nAlso INFO: how much life insurance are you carrying?", "Nta provided you get comprehensive life and disability insurance. If you refuse to do that you are 100% the Asshole. Also make sure you are actually responsible on this thing. I know plenty of people who think they are good drivers who regularly pull dick moves. You take unnecessary risks on that thing you are the asshole. Your life is no longer your own and you need to be dammed sure you are doing everything in your power to get home to your child. That means being a defensive driver, that means being cautious and that means being an adult.", "NTA", "NTA\n\nIt could be because I was raised by bikers but I don’t see why you would have to do this. I had my sons on motorcycles at a very young age. I get her worry but if she knew that you rode then it should have been discussed previously. Try to discuss this with her and explain that you take every precaution. Beyond that, good luck. \n\nNot sure if this will help or not but I had more fear of my dad going to work every day then I ever did of him riding. His job has been in the top 10 most dangerous jobs and often number 1 for more years than I like to think about. Just shows that even a job can be life threatening.", "NTA, guys at this point you should all upload the post after changing your gender. Say your boyfriend is stopping you from riding your motorcycle after you have a kid and watch the responses change. Are motorcycles “risky” absolutely, however this was a part of you and she knew it, she is emotionally manipulating you. She knew being a biker was a big part of who you are and she wanted to change it, and is using your unborn to get you to do it. My advice will be read up on the statistics and make your decision after comparing to cars risks and general risk.", "NTA. I can’t understand why this happens with some couples, seen it happen a few times. Luckily my wife likes motorcycles.", "YTA - it's valid because it's quite literally about you being alive, and the risk is higher on a motorcycle compared to in a vehicle.\n\nMy mom's ex died in a crash and left his daughter at 14 years old. Not worth it.", "NTA.  When you started discussing having kids, this is when this should've come up.  She can't decide, for you, what your hobbies should be.  Evidentially she wasn't worried about you riding it since you've been dating.  If you had a truly dangerous job, (cop, fireman, etc.) would she expect you to change jobs?  Just take out extra life insurance if she's afraid she might have to raise this baby on her own if something happens to you.  But I would never live my life always worrying.", "NTA. Your girlfriend's concern is completely understandable, but she can't spring this upon you without warning and demand you comply. It's not as if she didn't know you like riding motorbikes or that you took it up in the last two months.\n\nThat said, life as you knew it is over. Not that it's going to be worse - but it's going to be different. There are certain realities that you're going to have to deal with. You used to only be responsible for yourself - but now you have a child on the way who will be totally dependent on you and your girlfriend.\n\nYou've got some talking and thinking to do.", "NTA.  I would not give up my bike for anyone.  She did not bring it up before getting pregnant so too bad.  - motorcyclist (yeah, I’d dump someone in a heartbeat if they said I had to get rid of my bike).  I’m not a child and no one gets to treat me like one and tell me what to do.  I am female too.  So take that all you that were sure I was male.", "NTA. Absolutely not. If you’ve been riding for 10 years, then you know exactly what you are doing. You could compromise and say you absolutely will not go out without gear (I don’t know if you wear a helmet/gear or not).\nGiving up riding because you’re a parent is ridiculous to me. \nWhen my husband decided to ride, we compromised by buying the best gear we could find, he also goes to tracks for a faster pace. And we agreed that he would get a life insurance in case something did happen. \nI love my husband and I will not keep him from doing something he loves, as long as all precautions are taken. \nAnd we have two kids btw.", "NTA all day. It’s not about the danger, it’s about what it represents to her (your freedom, your fun, competing “obligations”). Tell her you want to keep it because there’s equity in it, and that obviously you aren’t going to ride as much or ride recklessly. If that’s not enough, you’ll have to decide if you want the family or the bike.", "NTA, this is clearly a conversation that should've happened well before you decided to start trying for a baby. There is nothing else to say.\n\nI get her perspective, but to expect your partner to change their hobby because you're now a dad, is pretty silly. Will you have as much time to go on rides? Absolutely not. It'll be harder to find the time, and you'll have to make sure you trade off with your wife sometimes, but you certainly don't have to give it up, and you certainly will have some spare time, that's important to still get to do some things you like to do (just, not as often).\n\nI seem to be in the minority here, everyone quotes accident statistics and whatnot like it's a given you will crash and die. Obviously that's not the case, and the vast, vast majority of bikers ride every day with no incident. Is it more dangerous that a car? Undoubtedly. Does that mean you can't ride a bike and have a kid? Of course not.", "NTA\nThe comments saying otherwise are all written by people who like regurgitating statistics they found on the internet and then parroting “clever” phrases like “donorcycles” to sound like they have more life experience than they do. In no world does riding a motorcycle make you a bad dad, and it’s not your wife’s place to demand you give up something important to you out of the blue. She doesn’t want the father of her kid on a motorcycle? Then she shouldn’t have chosen to have a kid with a guy who rides a motorcycle.", "NTA but you wife is. She is controlling and manipulative. Once the baby is born I see many more red flags in your future. If you cave to this DEMAND what will her next order be?", "NAH I think it depends on where you live. In the US? Well, never been in a country with more people having accidents in general like in the US. Yes, I would probably sell the bike or store it until the kid is older.\n\nHere in Germany? Keep your bike. The chance to be killed or having an accident here is much lower.", "I’m going to go NTA even though deep down I feel like it’s on everyone…..\n\nShe should have mentioned this way before you even tried if it was going to be her line in the sand when having kids. \n\nAs someone who has worked in healthcare though, bro, she’s not wrong. \n\nThat being said, if she feels that way, why is she even with a guy who rides? That makes her TA way more than you.", "NTA and I say that as a mom. You and only you get to make that choice. Just like she gets to choose to stay off of it and to keep the child off as well. She doesn't own you.", "NTA I think. I get where your GF is coming from but she should have mentioned it before you started trying for a baby as a non-negotiable for when you have kids. If you’ve been riding for a decade it’s not like she didn’t know that you’re super into motorcycles and ride often. On the other hand they are dangerous so I would just ride but be more cautious moving forward and get hella insurance now that you have a dependent on the way.", "No way man! I say to hell with your old lady! Drive your hog up all the way up to snake peak and see if you can’t finally stick the jump over Devil’s canyon!", "\" i wasnt going to give up my hobbies just cause i was about to become a dad\"  \n\n\nhobbies. not career. not health. not mental state. HOBBIES. \n\nwhoooaaaaa boy someone is in for rude awakening. Lol\n\nYeah...big YTA.", "NTA- yes, riding a motorcycle is dangerous, but what’s to say you won’t get hit by a bus crossing the street to go for coffee or have a heart attack while on the toilet? You can’t live your life in fear of what could happen. People shouldn’t be expected to give up hobbies just because of parenthood. But please, make sure she has the same courtesy. She shouldn’t have to give up her hobbies either. Whether they are getting her nails/hair done or doing things without the baby. Just make sure you guys work as a team and value each other.", "NTA\n\n&#x200B;\n\n\"she should have brought this up back when we decided to start trying for a kid.\" .. you are right with that.", "The hell is wrong with people here !! The expectation was never communicated and she always knew he rides a motorcycle ! I get riding can be dangerous and that maybe she’d PREFER  he sells it but he isn’t an asshole for not immediately stopping something he enjoys and has been doing a long time.\n\nNTA if she expected you to stop it should have been communicated before trying for a kid", ">she should have brought this up back when we decided to start trying for a kid\n\nYou're not wrong, she should have; however you aren't giving any credence to her current concern about it now that she *is* talking about it, you're just blowing her off completely. \n\nYes, there are parents out there with such hobbies... however, counterpoint that is equally anecdotal; we call em donorcycles for a reason. \n\nI'm going ESH. She's going about this all wrong, but you aren't handling it any better and neither of you are modeling good behavior or problem solving for your future child.", "NTA what’s next? This is something she should’ve had a conversation with about before you decided to have a child together. Honestly, I don’t think it ever OK for one partner to give the other partner an ultimatum like this. Personally, I don’t know why you would even want to stay with someone like that, that will try to manipulate you like this. She knew what she was doing and she waited. She could’ve easily said something long ago.\n\nPeople came die, or be seriously injured at any moment during the day buy some freak, accident, or by some other driver. You don’t know what’s going to happen to you until it does. It’s not OK to try to guilt trip and force your partner to stop doing something they love.", "NTA it’s crazy she brought this up after already getting pregnant and not before when you both decided to have a kid.", "keep the bike and get life insurance", "NTA. If she had this has her dealbreaker she should have mentioned it before you even tried to have children together.\n\nThis is not a good look. If you agree to this what’s the next stp in the things she didn’t mentioned before and that need to be done/not done now …?", "NTA. A lot of people here are jumping straight to “you’re going to die”\n\nIf you go on a nice little ride around town once a week in full gear on a lovely sunny day, you’re most likely not going to die. \n\nBecoming a parent doesn’t mean not riding a motorcycle anymore and it doesn’t automatically make your partner a widower! \n\nI’ve been riding for two decades, I’ve had two accidents and I’m relatively unscathed. My kids also ride, they love it and we’ve done everything we can to teach them all about safety and they compete in motocross. \n\nYou could die anytime, you could cross the road and get hit by a bus. In fact, the biggest cause of death in the western world is Ischaemic heart disease. Therefore, I’d now expect everyone in this thread to expect you to give up fast food because this could really make your partner a widower /s", "#Buy life insurance and make her the beneficiary.", "Lol YTA , you'll be giving up alot more hobbies then then that when your kids born .", "Totally not out of the ordinary to hold her opinion. Totally unacceptable to bring it up only after you're both committed. \n\nIt's fine that it's something she assumed. But by relying on the assumption, she risked exactly this, that you do not hold the same assumption. \n\nAsk the \"or what\"? It's idiotic to leave you because you won't lessen the risk that you'd be unavailable to help her. \n\nI'd offer to get life insurance and disability insurance. That's something of a resolution that at least addresses both concerns (fully resolves neither, but better than nothing). \n\nLast, controlling behavior is uncool even if it's a pregnant wife. Might want to address that generally.", "Nta. \nWe had two motorcycles in our home with two kids. We would go on weekend trips with other sport tourers for our kid free vacations. He also commuted in one because gas is expensive!  \nI would never make him sell the bikes, but I sure as hell put my foot down when he said he wanted to take a month and go ride somewhere by himself while I had babies at home!", "NTA. Whether or not you would ever be willing to give up your hobby should have been discussed Looong before this point.  No, you absolutely should NOT give up your motorcycle just because she wants you to. That's all kinds of selfish and unreasonable - and I say that as a wife and mother whose husband had a motorcycle for years after we had our first child and intends to get another \"before he's too old to ride.\"  - Do I have concerns? Yes. Am I going to try and stop him? No.   It would be like him demanding that I give up my Library. Not going to happen.\n\nCompromise with her - maintain excellent life insurance and keep your hobby.", "Make sure you have good life insurance. Motorcycling is inherently dangerous, she isn’t wrong about that. I don’t doubt you’re a great rider, but it’s the other drivers you need to worry about. \n\nBut she cannot force you to give up your hobby.\n\nNTA", "I'm a mom (13 yo boy) and I still love a motorcycle ride. NTA. If it was a dealbreaker to her, she should have said so before she got pregnant", "YTA if you don’t have lots of life insurance.", "NTA but I would recommend some life insurance. Get a policy with the kid as the beneficiary. That way you can have your hobby without risking the kid’s future. You can be as safe as you possibly can but there’s no cure for how invisible motorcycles are to motorists. And you can’t control other distracted drivers.", "NTA as long as you have comprehensive life insurance and disability insurance. If you don't, do it now. If you can't afford it, then sell the bike. You are now responsible for another human being (in 7 months), so it's all good if you don't mind becoming disabled or dead, but that baby is your responsibility at least financially.", "NTA but try to understand that she just doesnt want you to be dead or paralyzed while she raises the baby alone. is motorcycling your only thing? you couldnt switch to skydiving or russian roulette until the kid is out of diapers?", "Yta you decided to procreate, now your needs are less important than the child's needs. Grow up, you should've thought about that sooner", "Esh. I witnessed a man on a motorcycle get rear ended at a light. The car behind him hit him where he was shoved into and under a mustang. The mustang he was following happened to have his 3 kids and his wife in it. She was crying that he went to fix her flat and they were heading home. \n\nI will never be able to forget the look on his face as I tried reaching under the mustang to get him. The smell of his skin burning from being pressed under a hot car. The screams of his children.\n\nBe a meatsicle. It’s worth the rush… right?", "YTA. 3 motorcycle accidents in my family, all the riders were not at fault. Results: 1 dead, 1 quadriplegic, 1 with almost every major bone broken requiring years and years of rehabilitation. My dad was a motorcycle owner, he loved his bike. But my mom gave him an ultimatum and he sold it after riding for 20 years. \n\nYou’re no use to your kid or your girlfriend if you are splattered across the asphalt. And do you have the financial resources to pay for lengthy, costly medical care as well as cover bills? Because unless you do, just sell the bike. It’s not worth it.", "I think NTA but you do sound immature. She isn't being unreasonable by being concerned. Life isn't just about you anymore. My partner has to drive 6 hours once a month for work and I get terrible anxiety about it that I didn't get before and that's in a car! Most pregnant woman start to worry about life with a baby if something happened to their partner.\n\nP.s I hope you have good life insurance now!", "YTA, what are you 12? Just start gaming or something not risk ur life.", "ESH, but mostly you. She should've mentioned it before trying, but be serious. They're called DonorCycles for a reason. There's a reason you'll be hard pressed to find hospital staff that drive one. It doesn't matter how safe of a driver you are oftentimes, accidents happen and motorcycles are hard to see.", "YTA. \n\nYes she should have brought it up before you got serious. \n\nDid you get to grow up with both your parents? She probably doesn't want to lose you and your baby needs a father. You might go your whole life without an accident. It takes one moron to merge into you with no space and you're done. Completely done. Paralyzed. Dead. It's not a joke at all. You can be the best rider in the world, it's not about your abilities. It's everyone else and you have zero control over what happens to you. \n\nIf you want a family sell the damn. If you want to be a cool weekend dad who literally might die any day then keep it. \n\nAlso laughable that you say your partner is sulking. Genuine concern for your well being and the panic she is feeling knowing that she is going to have to leave you and become a single mother all because your hobbie is more important is NOT sulking. She's grieving the death of your relationship.", "NTA: My husband has had a motorcycle on and off for years, and we have a 10 year old kid. As long as you don't ride like an asshole and you wear the proper kit, why should you have to give it up?", "I have a motorcycle. And I’m a single parent. Guess what? It’s not the end of the world. \n\nNTA \n\nI do get where she is coming from but I chose to ride when there is less traffic, more visibility for myself, and in areas that don’t have a lot of blind corners or turns. The risk is still there but it’s lower.", "NTA. Your life and the things you love don't just suddenly stop when you have a kid. Parents like this deserve the resentment they eventually get from their partners. She is a controlling asshole.", "NTA i don’t know what ESH but I see a lot of that here and people taking a middle line, I understand her concern but she should have brought this up before you guys actually started expecting. Ontop of that it’s your decision and there’s plenty of people that don’t ride aggressively and are just fine. I had a friend that rode his bike across the country visiting each state in depth fine. Anything can happen in any vehicle. She is just concerned about your safety and the future of your family though it sounds. As a guy that is thinking of getting his motorcycle endorsement soon and also rides dirt bikes I have a bit of a biased opinion though. If you do end up getting rid of your bike maybe look into a dirt bike! Trail riding is a ton of fun and less traffic on trail obviously", "Can’t you compromise and stop until baby is 1? Then reevaluate, my husband stopped until our son was 1 as the anxiety it caused me was affecting my health.", "I love how you think \"I've been riding for 10 years\" is relevant at all. Things change when your circumstances and responsibilities change. That's life. ESH. Her for not bringing this up before you guys got knocked up, and you for being stubborn instead of considering her reasons and being empathetic. My ex-husband had been riding for 10 years when we got pregnant. I was six months along when he got hit by a dumbass driver. It's naive AF to think \"nothing's happened so far!\" is a valid argument. \n\nShe's full of hormones and her fear has ratcheted up to an uncomfortable degree. If something happens to you she's raising a kid *alone.* She might not have even realised this would bother her before. I'm not saying sell your bike immediately, I'm saying have some fucking grace and empathy for the woman carrying your baby over defending your hobby. Jesus Christ, telling a pregnant woman she's overreacting. Will you also tell her to \"just calm down\" in the delivery room? 🙄\n\nEdited a typo", "You better have EXCELLENT insurance if you're willing to put up this fight. Going with NAH. Your GF doesn't want you to die and end up raising a child alone. It's not like she's asking you to give up video gaming or golf. It's fairly common knowledge how deadly riding a motorcycle can be.  That said, she can't exactly force you. \n\nKeep in mind, it's not just YOUR life anymore. You're responsible for a child now. Try and stay alive for them 👍", "YTA  she loves you and wants you to be in the child’s life. Before we were married my husband had bought a beautiful Suzuki. ( I am an ICU RN)When I was pregnant I asked him to park it until our youngest child turned 10 and also he needed to become an organ donor. My reason being that at least by 10 the child would have good memories of their Dad and, with motorcycles, it not if there will be an accident but when. He agreed and the eventually sold his bike because as he said, the kids and I would need him for many more years. If you continue with your bike at least get a very large life insurance policy so the family won’t suffer much financially.", "YTA. I personally know - yes, personally on first name basis - 2 people with legs amputated below the knee and 1 died from motorcycle accidents. It’s one thing to risk yourself when it’s just you, but another with a family.\n\nETA: forgot one. Guy hit a deer on his motorcycle, in hospital for over a month. He’ll never recover fully.", "Info - How much life insurance do you have?   If it’s 18 times your annual income, NTA.", "ESH Motorcycles are dangerous and aren't really compatible with fatherhood but she should have mentioned this beforehand. My brother in law kept his motorbike for a while after my eldest nephew was born but after he had a crash the reality of what that crash could have meant to his new family if it had gone worse really hit him and he sold the bike. Fortunately that wake up call only cost him a couple of bruises and a slightly damaged bike but it could have been much worse for him", "ESH for being another couple who get to this point without communicating with each other. I get it most of my family rides and I used to as well.  But your life changes when you have kids and part of that is putting them above yourself. No you don't have to give up all your hobbies and neither does she. But pretty much everyone I know got rid of the bike when their kids were young party because they never had time for it but mostly because they realised they were putting themselves in danger and actually wanted to be there to see their kids grow up. I know far too many people who are dead or disabled because of bikes and everyone thinks it won't happen to them until it does.", "The last time I rode my bike was when I was pregnant. It was hard to pack it up but parenthood changes you and the thought of leaving behind a child and partner who need you makes everything else seem inconsequential. I held onto the bike for a few years and finally gave it to a friend whose children had grown and were out of the house. I will be her one day but until then I’ll continue to make choices that are the best for my whole family, not just myself. You’re NTA, but if your perspective doesn’t change when that child arrives, you will be.", "ESH \n\nJust because you've been fine in the past doesn't mean you can't crash and die tomorrow.\nAt the least, consider becoming an organ donor if you aren't already.", "Y’all should not be having a kid.", "Most of my male family members are big Harley guys, and most stopped riding when they were raising little kids. They ride again now that they’re older and kids are grown. But usually as a group and for a certain event. We’ve lost 3 over the years from accidents. It’s real how dangerous they are and her concern is very valid. You can be the best rider in the world, it just takes one idiot not paying attention on the road to take you away from your family forever. And they’re left to pick up the pieces of it.", "ESH. Girlfriend should’ve brought this up a while ago. \n\nBut you’re also TA for how naive you’re being. \n\n*”I’ve been riding for the past 10 years and I’ve been perfectly fine.”*\n\nWell, no shit. Otherwise, you’d be dead because not many people survive motorcycle accidents.\n\nYou could be the safest motorcyclist in the world - the issue is all the other people on the road. If some idiot is texting and driving on the freeway and hits you, you’re dead. Or very badly mutilated. Either way, the possibility that another driver could accidentally launch you off your bike at a high speed, around other fast moving vehicles, at any moment makes driving motorcycles beyond dangerous. Don’t downplay that. \n\nEspecially with becoming a father soon, you really should remove yourself from risky situations in which your life is at the hands of others (literally).  You might be a skilled motorcyclist but that doesn’t make you safe.", "YTA. My neighbours kids are without a parent because the mother loved a bike too much and ended up dead after crashing into someone on a road when that man shouldn't have been at all. It wasn't her fault at all, but she's now gone, and kids are without a mother forever.  Accidents happen. Don't leave your kid without a parent because you can't make a sacrifice. Having children means that you need to sacrifice things, whether you like it or not.", "YTA - yeah she could have mentioned it sooner but it’s likely that it didn’t hit her until she was actually pregnant just how huge it all is and what she could be dealing with if you get yourself killed or seriously injured.\n\nYou’re going to be a dad.  You made this choice.  Time to buckle down and accept your new responsibilities.  Sell the donor cycle and get ready to spend that hobby time taking care of your baby.\n\nYou can buy another in 20 years once the kid is out of the house and it’s mid-life crisis time.", "YTA, she didn't bring it up before because she didn't know it was a problem.\n\nI used to drive to work in 30 minutes. Then I got pregnant it started taking me 45 mins to drive to work because suddenly places were no longer safe to overtake, my speed reduced etc.\n None of this was a conscious change, I just  became more risk adverse.", "A mans got to do whats best for his children.\n\nYou should of thought about that before you knocked her uo.", "NTA but you're gonna have to not ride for a long time", "NTA, should a roofer stop working because he become a dad? he can fall off a roof any days and die. should a plane pilot stop piloting plane because they became a dad?\n\nshould an astronaut stop working because they became a dad?", "YTA\nThis should've been discussed befor hand since she knows it's your hobby. But imo it's extremely irresponsible to bring a child into this world and then continue to engage in risky behavior. That child needs you in their life.", "YTA. Motorcycles are incredibly dangerous please stop\nRiding it", "YTA what she’s asking isn’t for you to give up your hobby because she’s paranoid or on a power trip. She’s asking you to take reasonable action to be a good parent and partner to her in this. Try and side step all the data you like - it’s a dangerous hobby and one more likely to kill you than alternatives. Once you have your child you might understand that your world becomes about them and you’ll be forced to be a lot less selfish. Can you pick up the hobby again when you’re a bit older? Absolutely", "Bruh she has a point, you're gonna be a father now, try to meet her halfway.\n\nEither buy one of those full-body hard-plastic suits or seriously reduce your riding. Unless you're totally fine with her stressing out every time you have to go somewhere. Jeez.", "YTA. It sounds like you like your motorcycle more than your future child and the future you can have with them.", "Soft YTA. You shouldn't have to give up all your hobbies. If you want to keep the motorcycle, maybe look into circuit tracks or parks you can ride in instead of the open road, or one of the bigger \"slingshot\" style ones with three wheels. I know they handle differently, but you still get the feel and control of a motorcycle, and it would probably give her more peace of mind.\n\nYou're having a kid, your entire life will change, you will literally have to give up time for hobbies to work and take care of the family, and you will have to start planning for things like, \"What if I died tomorrow?\" You'll probably be using a full sized vehicle for everything too, so having the bike is just an extra insurance payment and higher health / life insurance premiums (because it's considered a dangerous activity). \n\nMotorcycle crashes are particularly horrific. She probably didn't think about any of this until the pregnancy actually happened and she started \"planning / nesting.\"", "YTA. She’s correct. Your hobby is incredibly dangerous. Go get a PS5 or learn to draw if you want a hobby.", "ESH, you much more than her tho. She should have mentioned this before you started ttc, but your unwillingness to budge is selfish af.  You could die tomorrow while riding your bike, making your girlfriend a widow & your child without a father.  OR you could die riding 5 years from now when your child is old enough to remember you & grieve you. Is that something you’re willing to chance? Is that something you are willing to put your gf & child through?  Is riding *really* more important than your family?\n\nETA I’m in the medical field and have seen a lot of shit. A guy on a bike got hit by my house a few months ago & it wasn’t pretty. I still see his face, the blood pooled around him & it haunts me. Please think of your family instead of your own desires.", "NTA - my husband has been riding for over 20 years now and it wasn't even a thought in my mind to ask him to give up something he loves so much. Our son is now 16. If you are a safe and vigilant motorcyclist then you are just as safe as anyone else out there on the road.", "NAH, honestly, from a psychological perspective, she's already a mother. The baby is real to her, and she's carrying it. However, most males do not have that paternal feeling until after the baby born is he holds them for the first time... that's usually when they rethink things like motorcycles until the kids a little older.", "She’s really vulnerable right now, I would suggest putting the hobby on hold for a little while. Your NTA for wanting to keep your bike and to keep riding, YTA for for not recognizing that pregnancy is bananas and puts the body through hell - her whole body is changing, brain included, it’s scary. You should be as supportive as possible while she goes through something incredibly hard to grow you a child. \n\nJust give it a rest for bit, don’t give up your hobby long term but be considerate as a partner right now. Make a sacrifice.", "Nta at all and this is gonna be an unpopular opinion but whatever. Your partner never has the right to control you, and that includes making you get rid of your possessions. Yes, riding a motorcycle CAN be dangerous, but if you ride safely and responsibly, she shouldn't have an issue. These days, going into a public space in America is risky because people are nurs and anything can happen. Would it be ok to ask your partner to never leave the house while pregnant? Absolutely not. \n\nIf she felt this strongly about it, it should have been discussed while the discussion of kids was happening. Just because she's carrying your child doesn't mean she is now an authoritarian. You are partners. Don't sell it if you don't want to.", "NTA\n\nIf this was a \"hill to die on\" non-negotiable to her this should have been discussed prior to trying to get pregnant.  She shouldn't have assumed it was a foregone conclusion that you would give it up entirely.\n\nWith that said, had she came to you and asked you to cut back on your riding to lower your risk or keep to riding during the day at less congested times/roads I do think that would have been reasonable.  You can't expect your life not to change some with the birth of a child but I think totally eliminating a hobby you are passionate about would make you resentful and would impact your ability to be the best father/partner to your GF.", "NTA - if there can be no compromise, she is TA for not bringing this up before you two conceived. Other commenters are right though - get good insurance and consider carefully before taking your bike out. Lots of graves filled by excellent riders.\n\nWas debating to add this or not - my dad gave up biking due to having kids + close friend from high school died in an accident. He never got another one (despite my siblings and I being adults) but I always thought he sounded *mildly* resentful about it.", "Nta.", ">she should have brought this up back when we decided to start trying for a kid. \n\nThat's it, right there.  That's the important bit.\n\n>something she wasn't going to budge on\n\nGood for her?  She doesn't *have* to budge... it's *your* motorcycle.  She can't force you to sell it.  She doesn't have to ride it, certainly... but she can't forbid you from riding it.\n\n>and that i had to do it.\n\nNo, you abso-fucking-lutely don't.\n\nShe can be concerned for your safety, and express those concerns, as well as her preference that you give it up... but that's about it.", "Nta. Tell her she has to give up going outside since sometimes people get struck by lighting or attacked by animals. Also sometimes people have brain aneurysms so she doesn't get a brain anymore. Also no more eating she could choke.", "NTA.  Your wife is sulking, and is likely being fed bullshit stats, much like every single person here talking about how much more people die on bikes.\n\nSo here are some stats you can take back.  Source at the bottom.  14% of all US motor vehicle deaths in 2021 were motorcyclists.  \n\nWear a helmet, drive defensively, and teach your kid to ride once they get old enough.\n\nhttps://www.iihs.org/topics/fatality-statistics/detail/motorcycles-and-atvs#:~:text=A%20total%20of%206%2C084%20motorcyclists,of%20motorcyclist%20deaths%20in%201997.", "NTA. \n\nA motorbike is transport. \n\nDriving a car is also transport, but statistically much more dangerous than public transport.  I don’t see anyone giving up their car though.", "NTA. Buy a life insurance policy on you. Make sure the child is the one who would get the money.", "NTA.. I’m a woman and would have a problem with this.. I love riding.. but you are correct she should have told you before getting pregnant. Sounds as if now that she knows you are tied together she can demand you to change.. that is not ok.", "Lmao don’t fucking give in", "There's a pandemic of testosterone deficiency in the western world, do dangerous things safely- it helps keep you healthy.\n\nEDIT: NTA", ">The thing with motorcycle accidents is that it’s hardly ever is about a lack of skill or safety measures taken by the motorcyclist, and more often than not about dangerous behaviors by others.\n\nYes, exactly. \n\nThink about every idiotic driver you encounter - now imagine encountering those same idiots without a steel cage, crumple zones, and airbags. \n\nIn a car an idiot is an inconvenience. On a motorcycle an idiot is a death threat.", "My aunt was decapitated in a motorcycle accident, leaving her 2 young sons orphaned. GF should have brought it up sooner, but I absolutely get where she's coming from.", "One of my best friends from high school also passed away from a motorcycling accident. He made a sudden stop at a light and the car behind him rear-ended him and threw him off the bike.\n\nPSA for drivers: motorcycles stop much faster than the typical car. Try not to ever drive behind a cyclist and, if you do, leave a good amount of distance in between.", "My neighbor's kids are motherless, because of an accident that was a pedestrian fault completely (the man shouldn't have been on that road at all). So yeah, not her fault, but accidents happen because of others", "As a nurse, I wouldn’t start a relationship with anyone that rides a motorcycle. Most of the motorbike accidents I’ve seen have been caused by cars so you’re 100% right, there’s no amount of skill that will keep you safe. It’s luck that you’re safe.", "OP really needs to understand this. It's not just about him. It's about other bad drivers and his wife and children.", "I agree with you in that. Still, I love a motorbike ride.", "That's just not true.\n\nMotorcyclists have waaay more room to avoid shitty drivers.\n\nYes you are protected by a steel box, but you are also stuck in one.\n\nAlso contrary to this myth you spread, a majority of motorcycle accidents are the driver doing something stupid even when it's not technically his fault(speeding, speeding during lane splitting, drugs, alcohol, etc).", "Yes. This right here.  My husband and I both ride bicycles (not motorcycles, triathlon bikes).   We upped our insurance because we wanted to be prepared if things went very, very wrong. \n\nNAH as long as you’re adequately prepared for death and disability.", "> Do you have a lot of Short- and Long-term Disability insurance coverage? A lot of Life insurance? And an emergency fund?\n\nDon't forget the *replacement husband* coverage! It's a pretty penny but really helps after the death of their significant other because they like to joyride more than their family!\n\n/s", "Would bet folding money the answer is no.", "NTA. But a motorcycle cop just lost his life today and they shut down a freeway because of it.", "I agree with the NTA verdict.\n\nBut as a former pregnant woman I also know the other side. I was so scared my husband would die (in a car accident or something) and my baby would never meet his dad. I never experienced these feelings before. My husband did not have dangerous hobbies. My fears were the worst around 2-3 months pregnant. And when I was no longer under the influence of pregnancy I never experienced them again. It probably was fueled by my work in criminal law. I knew from my profession anybody could be the victim of something they would never expect (like car accidents). So it was just a big fear. Not totally irrational (because it could happen) but also not totally rational (because it probably was not going to happen). So OP, even though you are NTA and your girlfriend should also let you have your hobbies, you should probably have some empathy because that will get you the furthest with making your point. Emphasize that you know she is afraid of something but also that you need these hobbies in your life. Maybe you can work on agreements like you will ride less for a while.", "Exactly. Bike riding is not just a hobby, it’s probably the most dangerous hobby other than storm chasing or crocodile wrestling.\n\nAsk any EMT or ER doc/nurse/tech and they will tell you that they’ll never ride a motorbike. They constantly see people concussed at best or pavement paint at worst from bike accidents.", "I mean,cars are dangerous too. Should OP never drive, as it is ever so dangerous?", "I’d argue this info isn’t even necessary for the question. \n\nWithout good insurance OP would definitely be an AH.\n\nBut even with good insurance OP would still devastate multiple lives if he got disabled/killed. The kind of stuff that ripples for generations. That’s the burden that comes with deciding to have a child. You can’t opt out of it.", "Family friends of ours who did mechanic work for us had a son in the business that was into motorcycles.  One day he was riding as usual and a van pulled out in front of him. The guy and his bike almost went through the van. He had to have his hand amputated but survived at least. Sadly being a mechanic was difficult for him after that and he can't do his usual favorite job because of the accident.\nHe gave up the bikes not because HE is a bad driver but because others are dangerous to bikers.\n\nSorry if the text doesn't make sense", "Yup, we don't use \"toe tags\" anymore because too many corpses don't have any.", "If anything he doesn't have to sell it and keep it for memories until the kid turns 18", "A local mc cop died because tourists stopped at a stupid place on the highway and threw open their door just as he came by. It's really not about being a good driver.", "My god that is so sad 😞", "Agreed. I worked with a medical student who sold his motorcycle immediately after he spent a week shadowing at the an urban level 1 trauma center.", "He'd be damn lucky if that's all that happened to him.", "A year ago I lost a friend to a motorcycle accident. He was careful and wore a helmet and everything. The autopsy revealed he flew over, broke his brain stem and died instantly.", "Or road conditions. My bfs brother hit a large pothole he couldn’t avoid going 40 and was thrown from his bike. He broke several ribs, his arm, and his clavicle and even after a year and a half of pt he has limited use of his left thumb and lasting nerve damage. He almost died and left behind two young kids because the county roads were not maintained.", "We call them \"donor cycles.\"", "They're calling them donorcycles for a reason, yeah", "YTA \n\nIt’s time to grow up and consider other people’s needs above your own. There’s a reason why Emergency Room personnel lovingly refer to motorcycles as “donorcycles”.  Source: friends and family in the medical field.", "To be fair she'd be single but I don't think you're a widow unless you're married and before anyone gets uppity. They are taxed differently so it is a legal distinction that has to be made", "So if he has a brain aneurysm, that would be ok? It’s only tragic if he dies on a motorcycle? That reasoning makes zero sense.", "Squids (hooligans) and people with poor situational awareness are usually the ones that crash. People who regularly hone their skills, take training, and don’t ride when they’re not mentally sharp aren’t usually the ones involved in crashes", "Yta. Having kids means making huge sacrifices. This is something you should sacrifice if you actually care about your gf and baby. So many people die on these things. The ones that don't are usually never the same again and often require long term care. If you die, your gf and child will get to live with that loss. If you become severely disabled, it's your gf who will likely be shouldering the burden of caring for you (as well as your child!) if you guys stay together. It's absolutely reasonable that she's asking you to give up the donor cycle. At least until the kid is grown.", "Also, people are allowed to have new realizations when they have a first kid - or are pregnant. It shifts your perspective on lots of things - your own mortality being one. \n\nMeaning that OP’s partner may have shifted her thinking on safety, and that’s ok.", "She shouldn’t get a pass because she assumed “he had the sense to know”. Thats just bad communication and shouldn’t be excused because the hobby is riding a motorcycle, even if her fears are 100% understandable and warranted. \n\nShe 100% should’ve brought it well before trying for a kid. Choosing to wait until she got pregnant is bad judgment.", "She'll be on here in a few years asking if she's wrong to ask him to \"babysit\" one afternoon a month 😬", "if you leave that acronym in your post it will count as a vote", ">Who's going to look after you if you're disabled on your bike? Is it going to be her, by any chance?\n\nWelllll, since they aren't married, she have no legal rights unless she have or is given a Power of Attorney.  His parent(s) or sibling(s) would have legal rights as to making decisions regarding his health care and so forth.", "Nowhere does he say he rides it daily, just that he has a motorcycle.  I know many people who own motorcycles and it is not their main mode of transportation.  Most only ride it a couple months out of the year maybe once a week just to cruise.  For all you know OP could be doing the same.  His girlfriend is an ass", "No he isn't the arsehole you are, men aren't mind readers and don't need to deal with bullshit all our lives because woman can't communicate properly.  A hobby is a hobby whatever it may be, the man enjoys his motorbike. Let him live", "You sound very bitter. Your comment makes you an asshole to assume he impregnated her. Her opinions changed after the fact. Plenty of parents ride. Get out of your bullshit .", "Sometimes peoples’ perspectives change when they feel the figurative weight of the new life.\n\nIn my experience the woman often feels this sooner, during pregnancy, whereas the man may not feel it until the birth.\n\nSo OP’s partner may simply have had a shift in perspective - hopefully one that OP will have too.", "Well that would be too simple 😅", "And he needs to make sure she’s his beneficiary, and has life and disability insurance - then when she’s a widow she’s not completely screwed!", "Arguably more dangerous? They are absolutely more dangerous. There is no argument to be made lol.", ">but it’s also your choice to do what you want with your life\n\nIt's not anymore.", "How many women with children do you know who still ride? You can't \"reverse the genders\" here it doesn't work because women are expected to give up everything when they have kids.", "The question isn't if motorcycles are more dangerous (of course they are, look at the statistics), or even if he should give up riding them.  What is the question is her attempting to make a unilateral decision for him without even attempting to discuss it.  For that she's an AH and he's not.", "She's not \"talking about it\" though, she's making a demand.  If she were trying to discuss it and he refused to even do that, he'd be the AH.  Her coming out the gate saying he must stop and get rid of it is where she's the AH and he's not.  The underlying topic could be anything that isn't illegal and the verdict would have to be the same.  We're not judging if OP should give up riding or take other steps, only if his refusal to simply accept her demand was an AH move or not.", "Disability insurance as well.", "That’s fine between two adults. It’s absolutely *not* okay when you’re bringing an innocent child into it.", "Which is probably why this shouldve been asked and communicated a long time before ever trying for a child. Why did she wait to tie him down until bringing it up?", "Ah yes because children never need to eat or have a roof over their head. I'm it would be a great comfort for a fatherless child living in poverty that they have money waiting until they are old enough claim it.", "If you have to do dangerous things to feel like a man then you aren't one.", "Being a responsible father to a kid and seeing that child become an adult is also a very masculine and manly thing to do.\n\nLeaving a kid without a father figure seems to be quite the opposite.", "Absolutely this.\n\nA news report from my area reported on a person’s actual severed penis that was found at a gas station. People quickly put two-and-two together that it most likely belonged to the motorcyclist who had become road paint earlier after he lost control of his bike on a highway and got hit by multiple vehicles. It must have flown off and got caught in the grill of an 18-wheeler before falling off when the driver made that stop.\n\nDon’t become someone’s truck nuts, folks.", "Plus road conditions. I live in the most densely populated state in the US. We have pot holes everywhere, more cars every year. Maybe it safer in open spaces, but it not the same everywhere.", "No, motorcycles do not stop faster than a car. \n\n[Sport bikes stop about as well as minivans and get demolished by any performance oriented car](https://www.reddit.com/r/motorcycles/comments/33sun7/motorcycle_braking_distances/)", "This isn’t true, but it’s a good idea to leave space anyway", "Hardly anyone leaves enough space! It freaks me out to watch!", "You can’t buy an insurance policy that’ll un-traumatize your kids and un-widow your wife.", "Not sure why you're being so sarcastic. Riding a motorcycle carries high risk. A parent of a young child should mitigate every risk possible. If he's not willing to do that, he should postpone riding until the kid is older.", "Not taking that sucker bet.", "We used to live in the main highway. One day I was out front watering plants and a pickup stopped to turn into a drive just past mine. A motorcycle going easy too fast slammed into the back of it and launched the rider completely over the truck onto the highway. Killed him instantly. Luckily my kids had walked inside about 2 minutes before it happened. My cousin died in a similar way. Was racing with friends and some into the back of a produce farm truck. Killed instantly.", "They call them suicide machines for a reason", "I've had 2 friends die and 2 friends be permanently disfigured and/or disabled in motorcycle accidents in the last 6 years.\n\nAll experienced, safe riders who crashed due to freak circumstances or someone else's negligence.\n\nI'll never get on a motorcycle again. It's not worth it.", "A young guy here just out of high school died here last year, took a curve too fast.", "People die every day on the streets, whether in/on a vehicle or on foot.", "I can pull up plenty of stories of people dying in cars that shut down freeways.", "If everyone stopped doing stuff because ppl die, there wouldn’t be anything left to do. Quit being fear mongers", "Tons of people died in a car accident today but I doubt she expects him to stop driving", "People die in cars every day.\nPeople can get sepsis from a paper cut and die.", "a state trooper just crashed last week and died aswell (his fault unfortunately) but he was in a car. so if she wants him to get rid of the bike they can both compromise and she can sell her car aswell. since there both dangerous", "How many people died in cars today?", "Can look up how many people died in cars today too?", "I was fine with anxiety until 3rd trimester. Now I'm constantly worried my husband or I will die in various freak accidents... hoping this goes away within a year, but I'm not holding my breath...", "This. A common EMT joke is that medics want riders to wear helmets, since they make finding a rider's head in the ditch easier. One EMT I knew also called Jeeps \"guillotines.\"\nIf you can afford it, I would suggest you take out a respectable life insurance policy. With a dependent on the way, it's a practical action. Most motorcycle accidents I dealt with in my short time as an EMT were 100% a car driver's fault, but the cyclist was always the one in the ER.", "Not a doctor in those areas, but I remember going to the neurosurgery intensive care unit while at med school.\n\n6-8 beds. Every single patient in that room was a victim of motorcycle or bicycle accident.\n\nAin't no way I'm ever riding a motorbike or riding a bicycle on a road ever again", "Yup I work in the emergency room. See motorcycle accidents daily. Some fatal, some not. The people that survive are usually in pretty bad shape and needs months of recovery.", "Hence why they literally nicknamed them “donorcycles”-because people become organ donors way too easily on them", "One of the many reasons I am not a parent is cause I deeply love a dangerous hobby. Obviously if having kids was super important to me I’d have made a different choice but it was definitely a strong consideration. I’ve gotten banged up a few times over the years badly and it’s hard enough having to be helped around the house. Can’t imagine being like nah honey you take care of the kids, I’m gonna chill here in bed with my broken pelvis I got from an entirely voluntary activity.", "I mean, those flying squirrel suits are probably up there.   And anonymous unprotected sex.", "As an EMT we call motorcyclists \"organ donors on wheels\".  It's dark humor and is due to the number of them who end up dead.", "I’m an EMT and I ride motorcycles. That doesn’t change anything for me, I just use more caution and ride with protective gear. Life happens, shit happens, just because there’s a potential to get hurt doesn’t mean I wont do it. There’s a potential to get hurt just walking, I know there’s an obvious different and riding comes with a more inherent risk, but being proactive while riding makes it safer. He shouldn’t have to change his hobby because his gf tells him too, and she should have discussed it more with him before she got pregnant.", "You know what is many times more dangerous? Horse riding.", "I mean, you definitely should have a hefty life insurance policy and make her the beneficiary", "Sucks that she didn't mention it before the pregnancy but all I can say is I saw a motorcycle accident once. The guy's head was several meters away from his body but hey, at least it still had the helmet on. I'm sure the mortician was able to sew it back on quite nicely. Her concern is not dumb.", "I lost my dad in a motorcycle accident. Dead on impact. 44 years old. A co-worker lost her dad in a motorcycle accident. A different co-worker’s, same job, husband got into a terrible accident that resulted in a TBI. He had to fight very hard to overcome his injuries and, naturally, the trauma and recovery took a toll on her as well. \n\nSo, no. You’re NAH for not wanting to give up something you love. You are TA, though, for implying that your wife is trying to emotionally manipulate you to stop by “sulking long enough.” Her concerns are very, very warranted. And should anything happen to you after the baby is born, she would end up responsible for caring for you, or she would end up the sole caregiver to your child. \n\nI get that this hobby is fun for you, but it is known to be incredibly dangerous. You owe her an empathetic ear, a genuine desire to understand, and a healthy, non-defensive conversation. Maybe you could come to a compromise.", "Do you have another mode of transportation? You can’t take a baby on a bike", "Why in the heck was OP so heavily downvoted here??", ">Riding a motorcycle is undeniably dangerous. Sadly, motorcycle riders are 28 times more likely to lose their lives in a fatal driving crash compared with other motorists on the road. They are also four times as likely to sustain an injury in a collision.\n\nhttps://www.forbes.com/advisor/legal/motorcycle-accident-statistics/\n\nYTA\n\nPart of deciding to become a parent means mitigating risks so you can be there to raise the child YOU decided to father.  It’s time to grow up and make some adult decisions and take accountability for your own actions.  You decided to bring a child into this world, it’s your responsibility to take care of yourself so you can be there to care for this child - stop blaming your GF for your immature decisions.", "Idk your the one crying online to strangers, not her. Sounds pretty sulky behavior to me.", "NTA and not only should she have brought this up beforehand and didn't, probably intentionally because she knew it might make you hesitate and she wanted to get pregnant with all that this entails before trying to change the terms of the relationship, but you need to make her understand that she is not empowered to ***order*** you to do anything like this, saying she won't budge is saying you have given up your autonomy and must obey her commands, a posture you need to correct forcefully and immediately.", "Good point. Life insurance, disability insurance, and consistently wearing safety gear are all important determining factors in whether or not OP is an AH", "Put his kid on a motorcycle? That is a terrible idea. I’d do anything I could to stop my kids riding one", "He was a really wonderful man.", "My dad quit riding his motorcycle when I was two or three because he came upon a motorcycle accident and was like \"I can't do this anymore. I have a kid.\"  He parked his bike and never rode again.  I'm 45.", "Trauma Nurse here. When we hear a motorcyclist is coming in from a wreck we assume they’ll be dead or dismembered. Motorcycle riders are nicknamed organ donors for a reason", "My sister married a guy from a major biker family. When they were in their early 20’s he got her into it and they loved riding together, it was a huge part of their lives. When they had their first baby they both sold their bikes and haven’t ridden since. They plan on taking it up again when they retire and travel the continent like his parents currently do but for the time being they’re focusing on raising their kids. \n\nMedical professionals call them donor-cycles for a reason.", "As a former firefighter with PTSD from a particularly harrowing motorcycle accident…yeah.", "I’m a paramedic and the first motorcycle I responded to was relatively tame but it certainly reminded me of how fragile humans are.  The guy had only a little bit of road rash on his right arm and a small gash on his temple.  Bro was probably dead as soon as he hit his head though due to the placement and potential whiplash.  His body looked fine but he was definitely not fine..", "My ex husband said this exact thing. I was too stupid to understand that he meant every word  and he n e v e r helped with the kids. He was also lazy and now he is my ex husband!", "Erm I think you are doing parenting wrong if you NEVER have time for hobbies. Parenting is a partnership, 1 person cares for baby while other does hobby, then you switch....\n\nAlso he can ride his motorcycle to pick something up for the baby or for his wife. Or to go to work...\n\nDo you just expect every new soon to be father to give up motorcycles...wtf is that hahahah", "My fiance literally rides his motorcycle to and from work or to run a solo errand.  You don't have to be gone for hours on end to enjoy riding from time to time.", "I fail to see the jump from \"having a hobby\" to \"giving up all childcare responsibilities\"\nWhere is that connection made?\n\nPlenty of parents have hobbies of their own and can still function as adults with responsibilities. \n\nYes a baby is a lot of work, but that doesn't mean he has to sell the bike and give up his hobbies. Stuff can be put on pause for a bit and come back to when there is time", "I have several motorbikers friends with kids and they are awesome parents. You have less time to enjoy your hobbies when you became a parent, sure, but you don't have to loose your identity (or hobbies) cause of that. And I said that as a single mother that had a kid with a no motorbike guy and still wasn't prepared to became a father", "I disagree. You have time. I have 2 kids, 4 and 7, so I'm not far removed from having infants. You talk to your partner, you make arrangements to go do your thing, and give them time to go do their thing.\n\nI played 20 rounds of golf the summer my daughter was born, that's about once a week. My wife would pump breast milk and went out with her friends at least once a week until she stopped breast-feeding. She went to Disneyland with her sister when our daughter was 7 months old, for 5 days.\n\nIt's not that big a deal.\n\nNow, you want to argue that riding a motorcycle is pretty dangerous, and perhaps dad should consider selling it, then ok sure, I can get that one, but the idea that he'll \"never\" be able to ride? That's just silly. Everyone needs a break from the kids now and then, as long as you trade off with your partner and one of you isn't doing all the work, what's the big deal?", "He 100% would expect his girlfriend to give up any time consuming hobbies bc she's a mum. And when she points out that they can't afford the childcare for that, he will see it as her problem. The way he's talking you just *know* how this relationship is going to look a few years down the road.", "Ambition to keep own hobbies is healthy. Sacrificing everything for child instead trying to find a way sonthay both have mean time leads to burn out, resentment and generally issues.", "Yeah she really didn't need to tell him to sell it cuz he's not gonna have a chance to ride it for ages", "Parents are allowed to still have hobbies. He’s entitled to *some* time to go out and ride his motorcycle.", "Girlfriend, not wife. So yeah, he's definitely leaving his options open...", "I've raised 4 sons and I gave up zero of my hobbies. Yes, my time spent doing them suffered at times, but I didn't give any of them up. You guys are jumping to ridiculous conclusions.", "This is so far from being true. I have a friend that has a kid. He still rides plenty and even bought a tiny motorcycle for his kid. Just because some people have a hard time with kids doesn’t mean all parents do.", "Parents are still individual who are allowed to have their own hobbies. They don’t solely become parents who aren’t allowed to enjoy themselves outside of their children. They are people too, and to say they aren’t allowed to have hobbies is extremely stupid.", "How is not giving up a hobby means he wont help woth childcare??? Does that mean op's wife needs to drop all her hobbies as well?", "Oof", "I have a wife and friends in the medical field and I ride. You're an asshole for this comment. How about give up everything you life for your other, come back in ten years and say the same shit. Get real.", "dumbest comment", "Is she going to give up eating solid foods so she doesn't accidentally choke and die? Is she going to wear a helmet every time she leaves the house in case something falls on her?\n\nLife is risky. Motorcycles are slightly more risky, but if driven carefully they aren't death traps. Most motorcyclists REALLY like to ride. She thought he was suddenly and permanently going to become a different person, and didn't bother mentioning it beforehand? That's not how relationships work, and it's not how people work. \n\nNTA", "Those “sources” are just people with opinions.  You do know many in the health field ride, right?  I bet they find the stupid nickname just as tiresome as the rest of us who think, “yeah, there’s another person who hasn’t known the pleasure of riding.”", "A bike crash is a lot more unavoidable than an aneurysm. And people who die from aneurysms are much more likely to be able to have an open-casket funeral.", "Bullshit.\n\nYou cannot control other drivers on the road. And bike vs other vehicle is definitely going to leave a smear.\n\nETA: sorry, that was harsh. But I stand by the fact that you can only control a limited amount of variables.", ">If you become severely disabled, it's your gf who will likely be shouldering the burden of caring for you (as well as your child!) \n\nIf they aren't married then she have no legal rights regarding his care and well-being.  If he became severely disabled, the legal rights would belong to his parents or siblings unless his GF was given Power of Attorney.", "Yeah something tells me she started out seeing a guy on a motorcycle with no plans to have kids with him, then realized “oh shit I’m about to have a kid with this guy, no changing fathers so I better get him to change”.\n\nNo moderately intelligent woman wants to have kids with someone who rides a motorcycle.", "Common sense dictates once you have a kid, maybe you should give up the potentially life-threatening hobby.", "Thinking about being a parent is one thing. Having a little one changes your attitude in a manner that you can’t anticipate. I grew up around guns, never gave it a second thought. Soon as I was pregnant the thought of having one around my child, I knew there would be none in my house until they are grown.", "This is why ESH. But I mean she’s with a motorcyclist intentionally trying to get pregnant while unmarried. She’s not super bright. It doesn’t matter, she probably didn’t see having kids with him as realistic until she started trying for them, and might have been afraid to start a fight if she brought this up before. Who knows, OP still sucks for being willing to risk leaving his child fatherless and probably without an insurance payout.", "Whoops I’ve changed that, thanks!", "That’s the thing, though. All it takes is one day. That’s the unfortunate reality. Pick the wrong day or the wrong road or the wrong time and the whole trajectory of your life and everyone you love’s changes.", "Did...did someone else impregnate her? Did you read the post??", "Agreed!", "You don't know what it means when some one says \"arguably\" in the above context.", "If the car had the same risks riding a motorcycle does… then yes ?", "To be fair, she probably took it as a given that he’d love his child more than his hobbies and is just shocked that that doesn’t seem to be the case.", "What I was trying to say was that if it was in a trust to support the child then the mom couldn’t blow it on stuff for herself.", "Yeah it’s pretty gross.  Being pregnant turns you into a worrier. It’s not some evil plan to take over OPs life.", "Because 4 brakes is a hell of a lot better than 2 especially since a lot of riders are afraid of using the front one's.\n\nI've never understood the whole motorcycles stop faster than cars myth.\n\nTheirs a reason why defensive riding doesn't use braking in red oh shit scenarios. It uses go around the oh shit thing because often you aren't going to be able to break in time.", "This is true. Not every risk can be mitigated.", ">replacement husband\n\nI think they were agreeing with you and expanding, in that the wife will also be down one husband.", "Even the best, super cautious rider can't always compensate for the other idiots on the road.\n\nRiders are either driving like morons or trying their best to dodge them.\n\nI love riding when I was a kid, but there's no way I'd get on the roads now.", "That's awful, I'm sorry you had to see that. Glad your kids didn't.", "I was coming home from work one day on my old Honda Hawk and a lady with her kid pulled out so close in front of me that I had to go around to keep from slamming into the back of her. If I had hit the brakes hard enough I would have flown over the handle bars. Fortunately the other lane was clear. \n\nAt the next stop sign I stopped, got off my bike and went to talk to her. \n\nMe: Do you realize you could have killed me just now?\n\nHer: No, I had plenty of room \n\nMe: No, you didn’t. I had to go into the other lane to keep from splattering myself on then back of your SUV!\n\nHer: You should be more careful \n\nI think that was the day I realized I can be super safe and do everything right and someone could still kill me through their own stupidity.\n\nBut I still enjoy it so 🤷🏼‍♀️", "They get called Donor cycles here.", "More people die in cars - trapped, screaming, on fire, maimed by the crushed chassis...\n\nPeople vastly overestimate how 'protected' you are in a car, but when you've ever seen or been involved in an accident over 40mph you can appreciate the immense forces involved.", "But you're somewhere around 25-30 TIMES more likely to die if you ride a motorcycle rather than drive a car. It's the relative risk that's key here. You can't realistically remove all risk, but riding a motorcycle is far, far more likely to be fatal.", "THUG LIFE", "Thank you! My sister died in a boating accident. I still want a damned boat.", "Them citing a single incident doesn't prove anything BUT motorcycles still are statistically more dangerous.", "Motorcyclists are 57x more likely to die in an accident than someone in a car.", "Or a four wheeler.  Dear sweet baby cheeses I hate those", "Yea laws in the country I live say that adults on bicycles must ride in the road. I live in a big city and have always said I'd rather be arrested than ride a bike in the road. I've yet to be arrested, and I spent a year biking 15 minutes to work and back. Getting arrested in a foreign country is the risk I'll continue to choose over riding in the road, especially now with a baby in the way.", "Guess who OP would expect to care for him during his extended recovery? Probably his girlfriend.", "Which hobby?", ">Before AIDS sex was like shaking hands.\n\n>***\"Hence AIDS.\"***", "Used to be an EMT. We call them donorcycles for a reason", "One of my family was a motorbike paramedic for most of his career. He said the purpose of helmets was mostly to hold the skull together after a bad accident. He said that's why they never remove the helmet at the scene of the accident, and that he's seen hundreds of fatal crashes and each and every one sticks in his head. One of the strongest/bravest people I know. You are NTA for feeling that your partner is trying to stop your hobby, and coming from a long line of bikers, I fully understand the rush. But I do believe it's coming from a place of concern because she wants you around for her and your baby.", "I still get nightmares from seeing a motorcyclist's corpse hanging from an overhead freeway sign and i barely even got a glimpse(my partner warned me so it was only a fraction of a second). He got caught up in the middle of a pileup, and it literally sent him flying. Far too many people saw his body just hanging there because it was too high up to quickly cover.", "I mean I have seen someone with the top of their skull removed from their car windshield when they rear ended the vehicle in front of them. I have seen someone with their head in pieces when they braked wrong on their peddle bike and got launched off. Everything is dangerous if your not doing it properly.", "I've seen far more gruesome car accidents than motorcycle accidents, and nobody cares about new parents driving around like they do motorcycles", "I saw a pedestrian once get hit by a car. Didn't look nice either. Pretty sure a lot of make-up was used for the funeral, OP should refrain from walking too. Life is dangerous, doesn't matter how careful you are it can be over in a split second. NTA.", ">You owe her an empathetic ear, a genuine desire to understand, and a healthy, non-defensive conversation.\n\nAnd a hefty life insurance policy if you choose to keep your bike.", "On my part it's because she's not sulking, she's got an actual issue that should be addressed. Yes, she should have said something prior to trying to get pregnant. But that doesn't invalidate her concern. And OP is definitely trying to invalidate her by calling her sulky. \n\nIf he's got a point, he's got a point. If he has to devolve to any kind of shade he probably doesn't think he has a solid argument without undermining her point of view.", "i think describing your pregnant girlfriend asking you to stop a dangerous activity for the sake of your child as \"sulking\" is a very good way to lose a crowd", "Probably because he refers to his partner's genuine concern as \"sulking\" and is talking about her like she's the enemy.", "I think a lot of people are reacting to the fact that, while he's right that she can't \"demand\" he give up motorcycling, he's absolutely putting himself in unnecessary danger and that most people who try for a child do their best to make sure they'll be there for that child's entire childhood. \n\nLike, \"behold, I have created a human! He will need me for at least 18 years, and losing me early will be traumatic for him in many ways... welp, I'm off to take unnecessary risks for funsies!\"\n\nAnd in this sub you can/will be downvoted based on any number of things.", "Angry ladies.", "This is a ridiculous comment. There is no need to \"grow up\" when it comes to riding, it's a perfectly mature and reasonable hobby. Use your brain before you make stupid comments about what other people enjoy.", "The dumbest shit I have read. I have been riding all of my life. I have family that has done the same. I have friends that have passed on dues to it. It is a risk you take, but so is everything else these days. If riding brings a person joy,  then  to take that away from them because they are be owing a parent, husband,  whatever is stupid thinking. Life in general is a risk. Don't dictate what a person can or cannot do when things change.  Because then they will grow unhappy, depressed, or resent the life they are in. You're an asshole just for making these statements. You need to grow up", "Posting here is crying and sulking somehow?", "Ah yes, OP is the AH for posting here. As if post here with issues isn't the whole point", "I’m pretty sure they mean OP could wait till their child is 18 before OP brings the motorcycle back out to ride themself, not the kid.", "Mine kept at it and to be fair, he managed to not have an almost life-ending accident until we were in the age ranges of 7-14. He spent months in hospital and was never the same again due to traumatic brain injury.", "My dad sold his motorcycle when my mom was pregnant with me, the oldest. Once my youngest siblings were over 18, he got another bike and rides happily all the time now.\n\nI hope OP can grow up and do what his family needs him to do. Maybe his gf should have told him this beforehand, but he also should have thought of it and come to this conclusion without her input. Sad that he doesn't. He did not consider what it means to have a family before he made the commitment.", "I heard that some doctors call them donorcycles.", "Do you see more TBI from motorcycle riders or car drivers/passengers?", "I was pregnant when a local rider got into a fatal wreck with a school bus. His wife, mother, and kids were following in an SUV (I think it was the first day of school). \n\nHe died, but his entire family and a school bus full of children have had to deal with seeing that for over a decade.", "No new parents are 😂", "Guess all the dads i know aren't then. 2 of them love photography, another is into snowboarding, and so many more. Damn, i think i'm gonna fart in their face next time i see them. Thanks for the heads up", "Yeah but using the bike for errands isn't *fun.* He needs to be able to attend meet ups, or take it out for a good run on a Sunday for six or so hours. Or spend the weekend working on it. Ask me how I know 🙄", "Who is saying 'never'? That's the second person to claim I said that. 'Sod all' is 'not much' not 'none whatsover'. And did you spot where I said she was right to tell him to sell his bike? (Clue: no you didn't.)", "Hah I had twins, hobbies went to the wayside real quick. I had to give up golf.", "You don't have to be. But maybe she knows him and how he rides better than we do. Demanding he sell his bike is unnecessary and, frankly, counter productive though. No argument", "Reddit. The connection is made only on Reddit.", "This is Reddit, you shouldn't expect any logical arguments.", "I’m pretty YTA on this and still agree with you on this. I still bought a season pass and went skiing once a week when my child was an infant. I just stepped up hella other times and gave my wife time to relax as well. \n\nIt’s a problem because motorcyclists die at extremely alarming rates. I ski and mountain bike and I can still say motorcycling is a whole other level of danger (for imo minimal payoff if you ever tried mountain biking, e-mountain biking or anything else that comes with more adventure and less repetition/restraint). But the time spent on it isn’t going to be the issue.", "It’s not really about the time. Riding a motorcycle is the kind of hobby that has a high likelihood of making his partner a single mother. It’s really selfish to do stupid shit that can kill you when you have a kid.", "It's because OP is a man they assumed the worst.  No one truly gives up their hobbies when becoming a parent unless they want to become dead inside.  Maybe they don't get to do their hobbies as much as they did previously but they still have them.", "It’s a lot easier to indulge in your hobbies when they are infants than when they are young kids. Infants sleep just about anywhere.", "Show me where I said 'never'.", "The way reddit psychics can see all this from a text post is astonishing.\nYou guys just make shit up to get mad at.", "I hope he won't be like that and he just sounded bad. There are plenty of good fathers in the world. Just Reddit AITA tends not to be all that rich in their stories.", "The ambition is healthy. So is realism. It takes effort and coordination and consideration to maintain such a time consuming hobby as motorbike riding. And he said 'hobbies'. I don't think he's got a realistic idea of if what being the parent of an infant is like. I hope he gives his partner the same 'free' time to herself that you gave yours.", "Oh I missed that little wrinkle", "Oh dear God!", "Good thing I didn't say that then.", "Realistically, for a first baby, that's usually exactly what it means for mothers. Not because you want to or plan to. It's a matter of time and energy. And if he's happy using his bike for solo errands or going to work fine, but hobby riding would normally be understood to be more time intensive then that", "> How about give up everything you life for your other, come back in ten years and say the same shit.\n\nThat has nothing to do with motorcycles and your entire comment has nothing to do with it other than you stating you ride and your wife is in the medical field. \n\nWhat's your wife's opinion I wonder? You certainly can't speak for your wife, but you can provide insight from your perspective... which you didn't give despite your comment.", "For your other?\n\nFor your kid, maybe. The kid doesn't just belong to the mother. That's his baby too.", "My dad rode motorcycles for 20 years before giving them up for our family. He took me out on his brother’s Harley once and it was like he never stopped. But that’s the only time he’s ridden once since. He had his fun when he was young.", "idk my mom had kids with my dad, and she's a pretty smart lady. Wisely, she ALSO objected to my dad's motorcycle on safety grounds, and wisely, he listened and put his bike into an early retirement.", "Correct. You should not smoke if you have kids. You shouldn’t either way, but limiting your own harmful decisions when you decide to have kids is clearly the better option.", "What’s funny is my dad got his smoking habit while on deployment in Iraq. I was already 2 or 3 by then. And he absolutely *hated* cigarettes and didn’t want to smoke them or smell like them before that. Had a son a few years later, dad still didn’t quit. \n\nIf it wasn’t for his hacking and coughing, you’d otherwise think he’s a fairly healthy 43 year old man. Has good dental hygiene, can still move around okay. But sometimes I’m worried he won’t make it to 60 or 70, just because of the smoking. But I think he’s had enough near-life threatening events happen that he’s not worried about the cigarettes.", "I think you can remove the word 'potentially'; it *is* a life-threatening hobby. His life is at risk every time he goes out on that bike, and his girlfriend (not wife, so she has fewer legal protections) will have a stark reminder every time she sees the damned thing.\n\n\nI'd previously had a bike and was going to buy a new one until I saw how genuinely scared for my safety it made my now-husband-and-father-of-my-child. I'm glad he expressed his concerns and I'm glad I deferred to them. As much as I do miss it, there's no way I'm getting back on one. My kid will need his mum in one piece beyond the age of 18.", "How do we know that? Seriously does everyone read minds here? We don't even know the size of his bike or how he rides. What if he is a sunday driver with a 125cc bike? Maybe he just likes to ride to the beach for a coffee and go home?  \n\n\nSeriously why does everyone here seem to know OP so well?", "He didn’t have to knock her up either, so.", "There is no argument to be made lmao.", "Wanting to keep his hobbies doesn't mean he loves the child any less, they aren't mutually exclusive.  That's not what it's about though, it's about her making a unilateral demand of him, no attempt at discussion, no sitting her concerns, simply a demand.  Her actions aren't ok and he's not an AH for shutting that down.\n\nEdit: typos", "So a woman concerned about the safety of the father of her child is automatically demonized. Seriously?", "Oh. Totally missed that! Sorry.", "The husband of one of my college roommates was killed in an accident. He was sitting still at a stoplight when he was hit by a car, crushing his pelvis. It’s not like he was riding dangerously, but it didn’t matter. Motorcycle vs car, the motorcyclist will always lose.", "My aunt was in a big group of bikers, she rounded a corner and turns out they were all stopped right there for some reason. She couldn't stop in time and was so banged up she's lucky to be alive.", "I know someone who just had his leg amputated because of a motorcycle accident two years ago. Crushed his ankle, had a replacement done, and kept getting infections from it, so they just finally decided to take just below the knee down off completely.", "that’s okay but that doesn’t mean everyone else has to get rid of their motorcycles.", "Everyone who's ever worked in an ER or a neuro ward calls them this. My family are a lot of nurses.", "More people die in cars because more people ride in cars, motorcyclists are massively over represented in accidents, in the UK they make up less than 1% of traffic but 19% of motoring fatalities.", "It sounds like op is a safe rider, but you always have to be aware of other traffic.  I live near a high-speed road and hear the bikes open up, so sometimes it's on them.\n\nThat being said, I don't want my boys to ride...hubby did as a young man.", "Four wheelers and snowmobiles are some of the most dangerous (and fun in my opinion) vehicle's you can ride.\n\nFour wheelers are extremely lightweight and unlike motorcycles have 4 wheels and usually have an automatic transmission. Meaning you can just hold the throttle and go as fast as you want.\n\nSnowmobiles are even worse because they often have over 100 HP. And snow isn't as resistive at slowing you down. Meaning that even a 20 year old sled can go 0-60 in under 4 seconds. Let alone a new one.\n\nAlso drinking and snowmobiles basically go hand in hand.", "lol i loved driving them as a kid and they were great for getting around my family's farm, but goddamn now as an adult I look back on how many times I almost crushed myself or others with it.", "Our bike lanes here are a fucking joke, if we even have them - they're probably only 2 or 3 feet wide, and the only thing \"protecting\" them is a stripe of paint. My city is notoriously hostile to bike riders in particular, but also pedestrians, and with cell phones? No way. I got hit by a distracted driver in a construction zone and even though my car was fucked, I was fine. If I had been on a bike? Yeah, no way.", "Horseback riding/jumping", "Community!", "Just in case someone reads this and comes upon a motorcyclist after an accident: This info is outdated. We take off helmets. Modern helmets have cushions to pull out to make this easier. Can’t perform CPR or secure airways with a helmet on!", "Fuck, that sounds horrific. I've seen evidence of other accidents too, and I have to agree, a \"clean\" cut head inside a helmet is much less terrible than mangled remains.", "I saw a motorcycle accident once on the motorway.\n\nEver since then, I will actively pull over when a motorcyclist is around. I've seen numerous bloody injuries and broken bones, including where the shin had broken the skin and to this day that accident is still burned into my memory as if I saw it today", "You’re family member was feeding you bullshit. Helmets are too prevent brain injuries/trauma to the head, and the reason for not removing the helmet is you don’t know if the rider has a spine injury. Hence why most helmets these days have the emergency release cheek pads to make it easier to get the helmet off.", "Motorcycles are factually far more dangerous than cars. It's not even up for debate.", "Well, that could be because deaths in motorcycle accidents are about 30 times higher than in car accidents. 80% risk of injury or death in motorcycle accidents vs 20% in car accidents. Just saying and google it for yourself.", "Oh, hell ya. I hope they can come to a compromise and get all the necessary contingencies in place!", "Those wenches, wanting the other parent to be around for their kid and reacting to a dismissal of a legitimate safety concern as \"sulking\".\n\nHow dare they raise a reasonable and responsible issue, I wish it was like the good old days when they couldn't talk back to the man of the house...\n\n/s", "So is skydiving and cave exploration and deep sea diving - however good parents put unnecessarily dangerous hobbies aside for the sake of their children.  It is irresponsible to keep up a hobby with a 28 fold death increase when you’re planning to have a child.", "My friend is caring for her paraplegic husband who became paralysed in a motorcycle crash. \n\nHe imposed the consequences of his risky behavior on the whole family. He always said he was \"one of the good riders\" \n\nShe's trying not to grow unhappy, depressed or to resent the life she's in that she didn't choose, but it's hard when you're the one who didn't have the \"fun\" of riding and you're the one dealing with the fall-out and raising a family on your own (youngest kid is 13/14), with an extra dependent instead of a partner.\n\nYou're not just taking that risk on your own.", "Ahh, so his life insurance can be used to cover the college fund, good thinking.", "He's probably thinking \"I'm a safe rider. Nothing is going to happen.\"  The reality is that he could be the safest rider in the world, but if another person makes a mistake his life could be over in an instant.  My dad hasn't gone back to it, but he does occasionally drool over motorcycles.", "I live in a state where helmets aren’t required for motorcyclists.", "My step moms brother hit a tree across from where he lived with his other sister. He died in his 7 year old niece’s arms; she never really recovered from the event so to the trauma.", "My kids are 9 and 7 and I'm STILL not ready to be a parent lmao", "The truest words I've ever read 🤣", "Enter the obligatory *poor men* comments that act like a woman who refused to abandon a dangerous hobby during pregnancy/parenthood wouldn’t be criticized.", "So how would that mean he has to give up his hobbies if he still has time to do them?", "No? You go for ride an hour a week. And another hour for music playing a week. I literally know people like that. Motorbike is literally something you can keep doing while going to shop or work.\n\nI have two kids. I was primary caregiver. Both me and my husband kept hobbies. In limited amount for sure, but we did not completely stopped doing things.\n\nIt is socialization or anything competitive that are hard to impossible. OP is not competing.", "Did you say he’d has to give up hobbies because he’s a dad?", "She has no problem that I ride. She was supportive of everything i have done with riding. We discuss in healthy ways. Not ultimatums. I let her know how I am everytime i make a stop. Just to let her know. Shr dies dangerous shit just the same. It is still called loving to some people. Sorry not everyone can grasp that. My point was I know people in the medical field as well. They ride, they don't have problems with their loved ones riding. Is it dangerous? Absolutely. I'm not in denial of that. But there are many things in this world that are dangerous. So the argument is that. Give up those things for their significant other, or child, whatever, come back in ten years and say the same thing on how great it was to give them up. I know more people who regret or have distain for their loved ones after doing that.  It happens more than not whether some admit it or not. If they have a healthy discussion about why or why not he should keep riding is one thing. But to dictate something and use a child, or lived one, is another. Because more so, once they do that, they never stop dictating.", "Still. To give up something he loves? It creates dissension, regret, amongst other things. It is a dangerous hobby. But plenty of people still ride and die of old age. Plenty of parent have rode and survived all of their lives. And yes, at least a discussion is to be made. But no matter what, the things she is saying I'd dictatorship. Not relationship.", "Oh but don’t worry, what if he’s just a Sunday driver /s", "It doesn’t matter how often you ride. All it takes is one day where you’re at the wrong place at the wrong time. \n\nWhen I was in college there was a wreck almost every other week or bi-weekly. The fatal ones were almost always the motorcyclists. \n\nA bike does not offer the same protection as a car or truck, even if you dress for the slide.", "Yeah I have nothing against motorcycles they’re just not compatible with fatherhood. Quit riding when you have a kid or never have a kid. OP states the pregnancy was intentional, they’ve been “trying”", "I agree. I do not think that OP is TA because he is a motorcycle enthusiast but I think that he needs to consider the inherent risks and ask him say are those risks worth dying for and leaving a kid without their Dad.\n\nMy friend became a widow at 26 when her husband lost control of his bike on 440. He left behind two kids. Those kids have no memory of their Dad. They did not have a Dad to go to their games, recitals, plays. \n\nWhen we become parents we put our kids first, and sometimes that means we make sacrifices that we do not want to but we do so because of our kids. 🤷🏻‍♀️🤷🏻‍♀️", "I had a cousin who rode a motorcycle who drove very safely, wore helmet, etc. He was killed one night when he was unable to see a slick spot in the road. That’s all I know; but just reiterating that no matter how safely you drive your motorcycle, it’s more dangerous than a car. \n\nAlso, your gf may not have felt this way until she actually was pregnant. NTA, but I don’t know if she is, either. \n\nGood luck to all of you!", "This happened to a guy I knew in high school. He was a couple years older than me, and a really nice dude. He got hit and killed on his motorcycle while waiting at a stoplight. Didn’t even make it to 20. \n\nA lot of my friends think I’m weird about helmets, until I tell this story. \n\nIt doesn’t matter how careful a driver you are if someone else hits you.", "I’m be done both.  Can confirm.    I also used to ride a lot.  No more.", "I did that for years. It's not even close to being as dangerous as motorcycles/scooters. \n\nI miss it terribly.", "I appreciate this response. My family member retired about 5 years ago. Would it be fair to say that only trained responders should remove the helmet? I'd never want to make a situation worse by acting without education.", ">We take off helmets. Modern helmets have cushions to pull out to make this easier.\n\nEven with emergency release cheek pads, its a multi-person job. For your average Joe responding to an accident, leave the helmet on. Let the professionals deal with helmet removal.\n\n[https://youtu.be/yiXhoFGFxyo?si=cXAQtStEvv2bA-Lm&t=280](https://youtu.be/yiXhoFGFxyo?si=cXAQtStEvv2bA-Lm&t=280) (A video on moto first aid where they talk about the release cheek pads)", "Doesn't mean cars aren't dangerous", "I remember in 1993 in Florida there was a rally to advocate eliminate the helmet requirements for motorcycle riders. 2 people died from head injuries on their way home. Both accidents were the fault of the person that died, one was a passenger and the other a solo rider.", "Wow that’s kinda wild.", "That's a roundabout way of saying you see more TBI from bike riders?", "If he's working and he's a hands on Dad and deals with his share of the sleeplessness, hobbies plural isn't realistic in the short term. Maybe baby will be a little angel and sleep through the night and not be colicky, ill, wakeful, fretful or otherwise challenging and he will have loads of time to pursue his hobbies. Foolish to bank on it though. \n\nRead what he actually said. Kiddo isn't even born yet and Dad is already setting boundaries on the amount of time and attention he's going to give him. Baby has to be priority. Wife's physical recovery second. Self care for both parents, equally, third.", "Do you count riding a bike to work out to do solo errands a 'hobby'? Better than nothing to keep your hands in I suppose. \n\nGuess you had easier babies than ours. Colic is hard labour. We were too exhausted to read a book, let alone play an instrument.", "Death and paralysis create regret, too. A regret that's irreversible. \n\nIf, as a parent, you can honestly think to yourself, I'd rather risk leaving my kid to grow up without me, or living with me as a dependent invalid, than give up riding.\n\nThat's fine. Your priority to be fulfilled is more important than being around for your kid. That's okay. It takes all sorts. Let's hope your kid isn't the one living a restricted and resentful life in the future because you chose not to prioritise them, and they suffered the fall-out of that decision.\n\nThe baby is in her belly. She's well aware that every decision she makes affects more than one person.\n\nLooks like he is yet to realise the full import of that. He can't dictate that the whole family is exposed to this level of risk because he enjoys taking it. That's also a dictatorship, not a relationship.", ">All it takes is one day where you’re at the wrong place at the wrong time.\n\nThat includes any type of incident.  Just the other day, after dropping off my granddaughter at school, there was an accident on the opposite side of the freeway.  We (people on my side of freeway) could see the driver's upper half of his body laying on top of the median and could only assume that his lower half was still in the car.\n\nSorry it's just that saying bothers me because it just don't apply to motorcycles, you can be at the wrong place at the wrong time anytime you step out of your door.", "I ride a bike too but you can say this about almost anything in life. Either way. He can simply not sell it and ride on a track once every few months if he can afford it. Why does he have to sell it?", "I think if he was going to get her pregnant and keep his hobby, he should’ve married her. If he dies in a motor accident she and the kid is fucked.", "My brother was driving home one night and past a bike accident before anything was cleaned up. Guy had his helmet on but was decapitated. A couple hours later he got a phone call. The guy in the accident was one of his friends.", "he has the same risks any other time, he could be hit while in his car and still die. he could die simply walking down the road", "look we get it, we already know how dangerous it is. Accept the fact we like a little danger in our lives or don't. We already knew from the first 15 family members to tell us how dangerous it is.", "Surprisingly perhaps, horseback riding is not only more dangerous statistically than motorcycle’s- it’s quite significantly more dangerous, 3.5x more likely to result in injury than motorcycle riding.", "I took a first aid course a few weeks ago. (It’s required to take one to get a driver’s license where I am, so that class was aimed at everyone, not first responders.) We learnt to remove helmets, including how to remove the cushions on the bottom.", "The only wrong course of action is doing nothing. \nCall for help immediately, request that the disponent on the phone helps you by giving instructions.\nThe cushions I mentioned are often marked, and you can pull them out from beneath the chin. Take the helmet off, and if you’re alone, there’s absolutely no way for you to do it ,the right way‘, so the next best thing will have to do. Try to move the head and neck as little as possible, after removing, check for breathing. No breathing or not enough breathing (less than one breath every ten seconds means it’s not enough) and you start CPR. Patient unconscious but breathing? Secure airways, and for non medical personnel, that means laying them on their side and tilting their head up. It’s ,recovering Position‘ in English, I think.\nWhen in doubt, ask the person taking your emergency call, and refresh your first aid courses now and then. \n\nImportant to note: You’re no professional. You’re doing the best you can. Anything is better than nothing. Don’t put yourself in danger, if the scene is not safe, remove yourself to a safe distance. If they die, it’s not your fault.", "It also doesn't mean spaghetti is not delicious.", "But what was the point behind it? Both dead, both guilty, and assuming both wearing helmets? If the accidents were violent enough, they would have died anyway? At least the helmet kept them somewhat intact, less trauma for first aid responders and family? I don't get it.", "Your brain generally has to still be in your skull to have a TBI", "No, they are most likely dead if they have an accident without a helmet.  TBI requires the head not go splat.", "i dont know. \n\nadding a helmet kould move a lot of people from DOA to TBI\n\ndont know how that would compare to the number moved from TBI to full recovery.", "No", "Not in this post, he didn’t say anything about how much time he would or wouldn’t spend with the kid. Just that he’s not going to give up his hobby (which would mean never doing it again) because the kid comes into the picture.", "The point is that motorcycles are not as safe anyways.", "Okay. If the both of us gets in a wreck, who do you think is more more likely to survive? You on the bike or me in a Camry? \n\n[The chances of a fatality in a motorcycle accident are approximately 30 times higher than in a car. Motorcycle accidents have a staggering 80% injury or death rate, while car accidents remain around 20%.](https://www.jdpower.com/motorcycles/shopping-guides/motorcycle-vs-car-accident-statistics)\n\nAlso they’re going to need money for the baby anyways, and the likelihood of him having time to ride is pretty slim once the kid shows up anyways. OP and his girlfriend are going to be sleep-deprived for a few months.", "Seriously? Shouldn’t you be worried about fixing this issue with your girlfriend instead of doing this?", "Had a coworker who was a cautious, experienced weekend rider. From what I remember, he hit a bad patch in the road when it started raining, lost control of his bike, and his body ended up impacting one of those giant concrete drainage culverts. He wasn't decapitated, but there was a *lot* of trauma on his chest from hitting the edge.", "Omg, how chilling. I hope your brother doesn't have any lasting serious trauma over it, and if he does I hope he's getting help. That would mess me the hell up, seeing my friend dead like that.", "Is that what you would tell his girlfriend when she's asked if she wants an open or closed casket? I've known 2 new dads who have died via motorcycle accidents, and now the kids are growing up fatherless becuase they wanted a little danger in their lives.", "It’s easy to accept the danger when you’re not the one who has to pick up the pieces. And I’m not suggesting we outlaw riding. But just know that you’re not actually the one who suffers when you’re killed (and you’re not even the one who suffers the most when you’re severely injured).", "That's good to hear. Not something I've been taught on first aid, but something I'll definitely bring up on my next refresher course. Thanks.", "I don't think its recommended for the general public responding to play with the helmet unless CPR is strictly necessary (usually advised by the phone operator). \n\nThe risks of hurting the head/neck when removing the helmet usually aren't worth it. \n\n[https://youtu.be/yiXhoFGFxyo?si=yizzAuV5wlLKn5Eb&t=280](https://youtu.be/yiXhoFGFxyo?si=yizzAuV5wlLKn5Eb&t=280) (video by Fortnine in collaboration with an EMT)", "Thank you for your advice. Thank you also for respectful discussion. I appreciate your input.", "The point was agreeing with the other post about how dangerous motorcycles are. The news article said both would have lived if they had been wearing helmets that met the current Fla law.", ">adding a helmet kould move a lot of people from DOA to TBI\n\nAssuming the head remains attached to the body.", "Hobbies. Plural. And all I said was he's going to have a nasty shock when he realises how much less hobby time he's going to have when he's the father of an infant.", "Of course the risk is higher on a bike, but normal people don’t live life outweighing every day if every action they make will make them survive. Hell why the fuck do roller coasters exist? \n\nYou don’t even know their economic situation 💀\n\nHow the fuck does having a single kid deprive someone from riding sometimes? 💀", "Nah. He is craving being cooler and faster and more dangerous. I feel sorry for his gf", "You think people come here to fix relationships? \n\nLol", "It doesn’t matter the economic situation. Kids are expensive, OP will not have time to ride the bike *if* he takes a proper active role in being a father anyways. \n\nAlso she’s not even his wife. If something happens to him she has zero legal protections here.  \n\nShit changes when you have a kid and you don’t always get to do the stuff you want. Get over it.", "Yeah this is hella sad, OPs girlfriend is probably so afraid of having to deal with him potentially dying and their baby not having a father and he’s trying to flirt with someone on Reddit while asking if he’s the asshole about a situation with his girlfriend", "My dad is an amazing dad, I have 2 brothers. He was always there for us, and once a month he’d go for a ride to the beach for a coffee with his buddies. How the fuck do you not get a free day once every month even with one kid? I don’t even understand how this is turning into an argument\n\n\nWhy does he still have to sell his bike? If I say they’re rich and you say they’re poor, both of us are equally wrong. This is making me crack the shit up, are you high? 😭"]}