{"id": 28243, "submission_id": "1705537", "title": "AITA for refusing to give up my grandfather's watch?", "selftext": "My grandfather died five years ago. After his funeral, my grandmother, who was his second wife, gave me his watch. The watch is made of solid gold and worth a few thousand dollars but not insanely valuable. At the time, none of my other relatives asked about it.\n\nMy grandmother died last week. My mom was her only daughter and has five half siblings, who are my grandfather's children by his first wife. My mom and her half siblings generally have good relationships, even though some of my half aunts and uncles weren't terribly fond of my grandmother. This is especially true of my oldest half uncle, who considers himself the leader of the family despite being an almost 70 year old ne'er do well. I remember many instances from my childhood where this uncle would insult my grandmother when my grandfather wasn't around.\n\nI wore my grandfather's watch to my grandmother's funeral. Afterward, the family gathered at my grandparents' house for dinner. As the booze began to flow, my uncle noticed the watch. He asked where I got it, and I told him that my grandmother had given it to me five years ago. He responded with a simple \"Oh, that's nice\" and seemed to drop subject. However, as the meal continued, he kept bringing it up. I forget the exact exchange, but by the end my uncle said that the watch wasn't my grandmother's to give away since she was \"only the stepmom.\"\n\nI said that my grandmother may have been the stepmom, but she was still my grandfather's wife and I was still his grandson. My uncle responded by saying that the watch should have gone to someone who carries my grandfather's name. By this point, I was angry and drunk and answered, \"Maybe she would have given you the watch if you didn't treat her like crap! Or maybe she just knew that I wouldn't pawn it to keep the lights on!\" The table went silent, and the gathering broke up soon afterward.\n\nThe next day, many of my relatives told me that I needed to apologize to my uncle. My mom even suggested that I give my uncle the watch as a \"peace offering.\" My mom grew up as the odd child out, and as a result has a tendency to placate her half siblings even when they're being unreasonable. I told her that I don't care what her half brother thinks, that he and his children are trash, and that I have as much right to my grandfather's property as any of them do. AITA for keeping the watch?  \n\n  ", "created_utc": 1696469771, "permalink": "/r/AmItheAsshole/comments/1705537/aita_for_refusing_to_give_up_my_grandfathers_watch/", "score": 515, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > My uncle thinks that my grandfather's expensive antique watch shouldn't have gone to me after he died. At my grandmother's funeral, he said this in front of the entire family. I told him to pound sand. My mom and many of the other relatives think I should apologize and let him have the watch, but I don't care what they think and want to hang on to this momento from my grandfather. AITA for keeping the watch?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA it’s your watch, don’t you dare give it up. If grandpa wanted someone specific to have it then he would have written a will.", "NTA - Unless your Grandfather made a (written) contract with someone or left a Will that explicitly assigned the watch to someone, any property would become his wife's upon his passing. She decided to gift you the watch, making it now your property. Your uncle has no claim to it.", "NTA - Your grandmother was the surviving spouse of your grandfather and so legally everything went to her.  Beings hers, she could do whatever the hell she wanted with her watch, destroy it, give it away, sell it, whatever.  Now it is yours and your property and you can do whatever you want with it.  Tell uncle to pound sand.", "So how many years has it taken him to realise the watch had gone to you?   He hadn't even remembered it until what you said,  I bet.     NTA,   he's just big noting and greedy", "NTA. Families get weird when they think they might get $1 when someone dies. I’ve seen it way too many times. Keep the watch, get a safe to keep it in, and ignore your mother trying to keep the peace. Unless your grandfather died testate, your grandmother was free to give it as she saw fit.", "NTA. He shouldn't have started wrangling over possessions at a funeral dinner.", "He’ll be dead soon\n😂 fuck him keep the watch", "NTA\n\ndo not apologise and don not give over the watch", "NTA.  Get a safe for the watch.  Don't you dare give in - he was also your grandfather, and your grandmother was obviously aware of how your mother was treated, and how she was treated -  she gave it to you in particular.  It was hers to give away.", "NTA. Tell the uncle to take it to the court. If your grandmother was executor and inherited your grandfather’s property, it became her legal property. If his will did not specify that any particular person receive that particular item, and she inherited his estate, that watch belonged to her. She could give it to whomever she liked.", "NTA.  Deaths in the family can bring out the worst in people when it comes to dividing up property.  You were given the watch.  Keep it.", "NTA", "nta please keep the watch", "You're NTA \n\n>The next day, many of my relatives told me that I needed to apologize to my uncle. \n\nNope.\n\n>My mom even suggested that I give my uncle the watch as a \"peace offering.\" \n\nHard nope.", "NTA, it was given to you, it's yours to do with as you please.", "He’s lucky you were as reserved as you were. For disrespecting your grandma and your name, he deserves much worse. NTA", "NTA. Your Granmdmother was perfectly within her rights to gift your grandfather's watch to you. For all you know, she was honoring his wish.\n\nAnd no, you shouldn't apologize. This whole thing started because he wants something that doesn't belong to him. YOU did nothing wrong. He was the one out of line.", "You're doing the right thing, don't apologize unless he (the elder) does first. 5 years ago, the man's wife gives you something to remember him by, fck your uncle for being sore or even having an opinion about it.", "NTA. Enjoy your watch , make sure you wear it any time he is going to be at a family gathering 😉. I would 🤣", "NTA. When my great-grandfather died, he left behind a bunch of old coins. Some of which are over a century old. No one but me gave them a second thought. I kept them as a remembrance of him and because I like to collect odd things. Even if someone asked, I'd never give them up. Since it's the one thing that I still have from him.", "NTA.", "NTA.  It was gifted to you. It's yours.", "NTA - keep the watch", "Nope, nope, nope! This watch belongs to YOU. She had all the rights to give it away and she chose you. You do not give this watch away. The family had five years to ask for it. Not theirs anymore.", "NTA - it was a gift *to you*, not an inheritance.", "It's your watch.  F-em.", "NTA! Your uncle is nothing and deserves the same… nothing! You do NOT owe anyone an apology!", "NTA- keep it safe", "Nta", "NTA \n\nPeriod.", "Keep it Ina safe place.  Away from your mother, and the uncle who will wait for your guard to be dow", "Nope.  It’s your watch.", "NTA - he never saw the watch as a nice memory of grandfather, he saw it as a sale on ebay.", "NTA\n\nThe watch is yours. A gift is a gift. Your grandmother had the right to make that choice, and she gave it to you. How dare someone else demand it?\n\nBased on what you've said of your uncle, he only wants it because it's worth money. if it was an item with the same sentimental resonance but no monetary value, he wouldn't care. The watch is yours and you don't owe it to anyone, and anyone who pressures you otherwise is on Team AH.", "Nothing brings out family drama like a death in the family. \n\nYour uncle was wrong to demand the watch and say those things about your grandmother - but as his wife when your grandfather died, it was completely within her rights as his spouse to distribute your grandfather's things as she saw fit, unless his will stated otherwise, so your uncle has no leg to stand on.\n\nUltimately, I say NTA, but the rest of the family sounds like a wonderful bunch to be around /s", "ESH - your uncle is wrong but that doesn’t give you the right to drunkenly argue in a family gathering after a funeral.  Take the high road, walk away from the situation, and don’t turn a dumb argument into a family drama.  \n\nPeople need to learn that just because you are right doesn’t give you the right to act like an AH.", "You held all the cards so it would have been wise to be more diplomatic. Sometimes people will judge you not by what you say but how you say it.", "YTA stepmom gave away dads watch to you and you don’t see how that’s a problem for your uncle, his actual son?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy grandfather died five years ago. After his funeral, my grandmother, who was his second wife, gave me his watch. The watch is made of solid gold and worth a few thousand dollars but not insanely valuable. At the time, none of my other relatives asked about it.\n\nMy grandmother died last week. My mom was her only daughter and has five half siblings, who are my grandfather's children by his first wife. My mom and her half siblings generally have good relationships, even though some of my half aunts and uncles weren't terribly fond of my grandmother. This is especially true of my oldest half uncle, who considers himself the leader of the family despite being an almost 70 year old ne'er do well. I remember many instances from my childhood where this uncle would insult my grandmother when my grandfather wasn't around.\n\nI wore my grandfather's watch to my grandmother's funeral. Afterward, the family gathered at my grandparents' house for dinner. As the booze began to flow, my uncle noticed the watch. He asked where I got it, and I told him that my grandmother had given it to me five years ago. He responded with a simple \"Oh, that's nice\" and seemed to drop subject. However, as the meal continued, he kept bringing it up. I forget the exact exchange, but by the end my uncle said that the watch wasn't my grandmother's to give away since she was \"only the stepmom.\"\n\nI said that my grandmother may have been the stepmom, but she was still my grandfather's wife and I was still his grandson. My uncle responded by saying that the watch should have gone to someone who carries my grandfather's name. By this point, I was angry and drunk and answered, \"Maybe she would have given you the watch if you didn't treat her like crap! Or maybe she just knew that I wouldn't pawn it to keep the lights on!\" The table went silent, and the gathering broke up soon afterward.\n\nThe next day, many of my relatives told me that I needed to apologize to my uncle. My mom even suggested that I give my uncle the watch as a \"peace offering.\" My mom grew up as the odd child out, and as a result has a tendency to placate her half siblings even when they're being unreasonable. I told her that I don't care what her half brother thinks, that he and his children are trash, and that I have as much right to my grandfather's property as any of them do. AITA for keeping the watch?  \n\n  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.\nYou should apologise for the comment about pawning it. Even if it's true, it was rude. \n\nYou should keep the watch. No specific provision was made in granddads will. Grandmother had the right to do what she wanted with it.\n\nAnd what is with the sexist has his name comment. We did away with preferential male inheritance generations ago.", "NTA.\n\nGiving the watch to your abusive and manipulative uncle would dishonour the memory of both your grandmother and grandfather.\n\nYou were the one your grandmother chose and SHE was the one, as his then-widowed wife, who had the right to choose whether it eould be given away and to whom.\n\nAnd please accept my condolences on your loss!", "NTA.  They're 5 years and a wife too late.  Notice how the reasonable person is always expected to cater to the outrageous person.", "NTA. It is your watch.", "This is my thinking as well. My grandfather's will set up a trust for each of his six kids. He had plenty of time to consider how he wanted his property distributed after he died.", "Honestly, if the watch was that important to the uncle, why wasn't he asking about when his dad died five years earlier? Why is it only important now that the stepparent has died?", "Exactly! If people had started asking about the watch right after my grandfather's funeral, I would have been inclined to tell my grandmother that it should probably go to someone else. But it's been half a decade without a word until the other night.", "Dark … but probably accurate.", "Hah! I'm sorry I can only upvote this once.", "What can I say? Can't choose family ... most of them are fine, it's just this one uncle and his kids who are problematic.", "I wonder if you'd feel the same way after listening to him insult your mother and grandmother for 30 years? I'm not proud of what I did, but I don't feel the need to apologize either. He's the one who kept pressing the issue at the family dinner.", "agreed, OP definitely should keep the watch but they were just as much of an ass about it as their uncle. It was a difficult time, obviously, and I understand why they lashed out, but that's still how it is.", "Ummm ... my mom is his actual daughter and I am his actual grandson. Do I have less right to my grandfather's watch just because I'm descended from his daughter by his second wife? This isn't Medieval England where the oldest son automatically inherits everything.", "\"Stepmom\", as current wife (at the time) of deceased Dad, inherited ALL his possessions. That includes the watch which was then HERS to legally dispose of in whatever way SHE deemed fit. She chose to give it to the grandson. End of story. It now legally and rightfully belongs to OP.", "Op's mom is also grandpa's actual daughter. Op is grandpa's actual grandson.", "Get a safe deposit box at your bank. Keep the watch there. Better safe. \nNTA!", "If he didn't will it to anyone in particular, it became the property of his wife on his death. She was free to pass it to whoever she wanted (or sell it or bury it in the garden. It was *hers*. Now it's yours. Everyone can bog off.", "My friend, I know exactly how you feel. I'll share *my own* story to bolster your strength in keeping the watch.\n\nTL;DR, my family had issues. My mom hated my dad which extended to my dad's side of the family. She never wanted to see my dad happy and trying to keep me away from my uncles, his brothers, seemed like a good game for her to play for her sick jollies.\n\nIt didn't work as well as she would've liked, but it was hard. I couldn't spend time with them like I wanted, but I connected with my 2 uncles the best I could before the age of the internet.\n\nI was especially fond of uncle Bill. In my dad's side of the family, (we're from Texas), the men had all attended Texas A&M, a famous Southern US university, and they were *very proud of this fact*. When anyone graduates from any US university, you have a chance to buy a \"class ring\" to show you had attended and graduated school there. Texas A&M students, known as \"Aggies\", are very serious about their \"Aggie rings\", their class ring showing they attended Texas A&M. My dad was so serious about his that when he got married, he got a thin gold wedding band and welded it to his Aggie ring so he never had to take it off to make room for his wedding band.\n\nI wanted to go to A&M but my mom knew it would make my dad happy and proud, and since she offered to cover my university fees, she forbade me to go, out of spite for my dad, and made me attend the state university in our hometown. I was heartbroken but my mother was a force to be reckoned with, so I had to do as I was told.\n\nWhen uncle Bill passed away, he left me just two things, his relatively new laptop (a marvelous thing for its time!) and his Aggie ring. I was humbled! I now had an Aggie ring of my own, in honour of my lovely uncle Bill! It was given to me at his funeral by my dad, actually. It was too big for any of my fingers so I took a gold necklace I had and I hung it from that, wearing it proudly around my neck.\n\nAwhile later, a woman and her teenage daughter came up to me. I'd never seen her before in my *life* but apparently she was \"family\". She saw uncle Bill's ring on my necklace and gave me a squinty look. \"So *that's* where it went.\" she said snidely. She must've looked his hands over in the casket to see that he wasn't being buried with the ring.\n\nI asked, \"Where *what* went?\" She continued snidely, \"Bill's Aggie ring.\" I got a *very* smug look on my face and said, \"Oh yes. Uncle Bill *expressly* told *his brother*, *my father*, to give me this ring. He knew I would cherish it and wear it with pride for him.\" She gave a snooty, \"Hmph!\" and wandered away, never to be seen again.\n\n*DO NOT GIVE UP YOUR WATCH!* See it as a duty to ensure it's kept by someone who will love and cherish it for the memories of who it came from and as you say, not become a pawn shop treasure meant to help keep the lights on. I'll be buried with uncle Bill's ring, dammit! I have no family to pass it onto so I'll keep it with me for the love and respect of Billy Joe Ross. :D", "Because she wouldn’t have given it to him.  Now that she’s gone he thought it was in the pot for him to grab.", "Yep,  so it was nothing special to them at the time.  Its special to you now so you keep wearing it when you want and ignore them.", "Just here to say I second the safe deposit box for the watch. Not a safe in the home and especially not a portable safe!!! I’d also get the watch covered under a renters or homeowners insurance policy. (Or whatever policy the agent advises would cover it best.)", "Every family has at lease one", "Ummm I’m not getting at the eldest inheriting everything bit.… You have less of a right as a **grand**child when his other children are still alive. They deserve his keepsakes first. It wasn’t given to your mother and she then gave to you.", "100%, cause I can imagine your mother \"returning\" it to her half brother just to save you from yourself.... Totally your watch so protect it and your GMs wishes.", "Honestly ... I think he totally forgot about it until he saw it on my wrist the other day.", "And yet ... in half a decade, no one ever said a single word about it. Clearly, it didn't mean much to any of my other relatives until my uncle noticed it the other night. My grandparents both knew that I'm into watches. For all I know, my grandfather told my grandmother to give it to me before he died. \n\nEither way, your assumption is wrong. My grandfather created trusts for each of his six children, but most of his personal property went to the grandchildren. I acknowledge that the watch was the single most valuable piece, but my siblings and half cousins all got various items as mementos. So it's not like I was the only grandchild that got something.", "That’s bullshit.\nMy grandfather went out of his way to give me certain pieces of memorabilia over his kids because he knew I’d cherish them and they’d sell it.\n\nGrandkids have as much a right to inherit things as the children do.", "Did they even know it wasn’t buried with him?", "Agreed ... u/MarionBerryBelly acts like it would have been okay if my grandmother gave the watch to my mother rather than me. But what would my mother have done with a men's dress watch? Clearly it made more sense to give it to me.", "My grandfather was cremated.", "Look at you, trying to grasp at straws to prove an asinine point after you've been proven wrong several times... yuck", "yeah hard no. how about you go NC as a peace offering? NTA", "DO NOT BE CAJOLED into giving up the watch.  You were given the watch, no one was interested for years.  You are not the AH for keeping a watch you were given years ago.  Tell you mother that you are not a spineless person.  kt", "NTA. He started the argument and you ended it.  He didn't care about that watch until he saw you had it.", "No of course you're not TA. He was your grandfather, the watch is rightfully yours.  Good for standing up for yourself. Bowing down to placate people even when they're wrong is rarely a good answer.", "Nta and nice response to the uncle.", "NTA- Keep the watch, go NC with the Toxic family.", "Get a safe to put the watch in", "Nta", "If your uncle cared about the watch he would have said something 5 years ago. It's your watch. Treasure and protect it. Nta", "NTA. This is your grandmother he was talking about, he deserved that. Maybe he’s gonna watch his mouth from now on.", "Don't give him anything as a peace offering, He was rude to keep harping on about it. You shut him down. \n\nNTA", "Nta mate! You told it like it was! 🍻", "NTA omg keep it!! That was a gift from your grandmother f the uncle", "nta", "NTA, you’re the man, that quote is legendary because they all know it’s true.", "NTA, and good on you for standing up for yourself.", "NTA and no, absolutely don,t give your uncle anything to \"appease\" him, let him appease himself by banging his head against a wall. And your mother shouldn't keep peace with a grown man who systematically belittled your grandma and grandpa for deciding to marry her, either. If your grandpa had wanted him to have his watch, he would have left it to him in his will. If he didn't, everything legally belongs to your grandma and she did whatever she wanted with her property.", "NTA. Consider it a prize for not being an arsehole like some of your other family are since this is probably why you have it.", "NTA Please hide the watch somewhere safe and rarely wear it.", "Nta", "The watch is yours. Everything was left to the Grandmother, she gave the watch to who she thought fit to recieve it. He can go pound salt", "NTA.  When your grandpa died, since he didn't specify who it should go to in his will, the watch became *your grandmother's* property.  She chose to give it to you while she was still alive.  That means your uncle can't take you to court for it, if he eventually threatens to, because it was a gift.\n\nI was the only granddaughter with the same birth month as my paternal grandmother.  She died the day after I turned 8.  My grandpa started giving me her birthstone jewelry when I turned 16 because that is what my grandma wanted.  He died when I was 28 and after he died one of my aunts wanted to force me to return *all* of the jewelry, I was gifted so that everyone could pick and choose what they wanted.  My dad was the executor and told her no and to not ask me.  She went to the probate lawyer who also told her no and explained that those items were gifts to me while grandpa was still alive and were therefore, exempt from the estate.  She tried to take the jewelry back but was stopped by my dogs (one dog was in my bedroom between the door and the jewelry box and the other dog was behind my aunt in the hall).  When the dogs started losing their minds my dad and I went to check and saw my aunt still trying to get into my room while one dog was blocking the door and the other was growling behind her.  My dad kicked her out of the house and told her not to come around me or my house again (she would have ignored me if I'd kicked her out).  That was almost 15 years ago, and I haven't seen her since.", "NTA, but in my experience escalating conflict makes things worse. Especially with family.", "NTA Hide it if you live with mom or if she has a key to your place and would be inclined to transfer ownership without your consent.", "Also it wasn't as if he even remembered the watch until he saw it.", "This!!!! Do not give up the watch..", "There’s your answer.", "Nice watches are meant to be worn, not sitting in a dark cold box.", "This a good idea, but luckily I don't live with my parents anymore. But if I ever wear the watch to my parents' house, it will stay on my wrist the entire time I'm there.", "True, but OP said it was solid gold. I have friends who collect nice watches and solid gold is not for every day, especially if it has sentimental value attached.", "Gold is a very soft metal which is why it is rare to find pieces that are solid gold, not plated. For strength/durability over 90% of jewelry is plated, so if OP wants to keep his watch in decent condition he shouldn’t wear it everyday due to the wear and tear.", "I have a lot of the family jewelry.  It is all photographed.  The good stuff has been appraised.  The really good stuff can be kept in a fireproof safe.\n\nI suggest a professional appraisal and documentation, and I suggest getting a decent fireproof safe with a good lock.  You can also keep important documents in there.\n\nIf the watch \"runs off,\" you can then file a police report with documentation.  The appraisal would make it a felony theft.  \n\nConsider having the appraising jeweler show how identifying marks can be shown, photographed, or if a serial number is present.", "I would atleast buy a small safe for home and keep the watch in there, not just because of potential stranger break in and theft but the chance of your mum grabbing it while \"on her way to the toilet.\" \n\nI'm not calling your mum a thief but she might just be a little misguided", "I wouldn't even wear it around them so they can start talking about it. I've had to go under the radar with family like that", "Yeah, but does your mom have a key to your place for \"emergencies\"? Get the safety deposit box or at least a small safe. But remember the words of the thief regarding safes, \"Don't bother hiding it, I've seen spy movies too. Also, if I can carry it out of your house, I will. I'll break it open later. Bolt it down.\"", "You can keep digging but nothing you have said is particularly compelling. OP is NTA"]}