{"id": 28248, "submission_id": "1703769", "title": "AITA for telling a group of teachers they need to control a group of kids including my son better?", "selftext": "My 5th grade since is part of an after school program. Basically he stays on the yard and plays with his friends and does activities. It's like an after school camp.\n\nI work by his school and took a late 3pm lunch today. I went to the grocery store and was befuddled by all these kids running rampant. I realized they were from my son's school. Then I saw this short blonde hair kid who looked like my son chasing this kid who looked like his best friend with a bag of sugar and weaving between people.\n\nAs he got closer I realized this was my son. As he ran passed me, I pulled him into me and told him to calm down. He realized it was me and asked why I was there. I said I was on lunch and why is he there. He said his teachers took the after school camp to the store to buy snacks. \n\nHe asked me to let him go and I said no. I told him he knows how to act in a store and as his dad, his behavior embarrassed me. I took him to one of the teachers and asked if he belong to him. He said yes, to him and another teacher. He asked what was wrong and if I could let him go.\n\nI said he and other kids are running around the store like a playground and you and Mrs. Daniel should be watching them better. Oh and I'm his dad. Mrs. Daniel came over and asked what was wrong. I told her what I told the other teacher.\n\nShe said I knew you looked familiar and laughed. I said this isn't funny. You better handle my son's behavior or I will and no one will like it. The guy teacher said \"please don't talk down to us like that.\" I said then please do your job.", "created_utc": 1696464533, "permalink": "/r/AmItheAsshole/comments/1703769/aita_for_telling_a_group_of_teachers_they_need_to/", "score": 60, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I saw my son acting out of control at a store when he was with his school and I shamed his teachers over it. They were offended I spoke \"down\" to them.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Going YTA for making sh*t up...there is no way they would have taken a bunch of kids to a store without written permission from every parent. And no one does field trips for after school care because parents pick up at all different times.", "[deleted]", ">You better handle my son's behavior or I will and no one will like it.\n\nHow would you have handled it and why wouldn't they have liked it?", "YTA.\n\n‘You’d better handle my son’s behaviour or I will & no one will like it.’\n\nYeah, how are you not TA based on that statement alone?", "YTA. Have you considered disciplining your child? Actually teaching them how to behave when you’re not there? I was a teacher for two years and if a parent needed to discipline their child, I gave them free reign. I wasn’t gonna feel guilty or bad by a parent parenting. So instead threatening them, with the whole “handle it or I will and you won’t like it.” how about you I don’t know? Handle it. I had enough on my plate just keeping my classroom from descending into chaos. Parents like you are why I quit.", "If you want to give a lecture to the person responsible for your kid's terrible behavior in the store, find a mirror and really give yourself the business.  \n\nBut you can lay off the teachers.  The fact that your child behaves like this when he's not with you is STILL a commentary on you as a parent.  My parents were able to trust me to behave completely unsupervised in stores by that age, but that's because they did their job right.  Time to reconsider your parenting methods because clearly they aren't working if your son only knows how to behave when he's being watched by someone he fears.  \n\nYTA", "YTA. How can you criticize those teacher's work when YOU couldn't even teach your kid to behave in a store in the first place ?", "Sounds like you're threatening to abuse your son.", "It does sound like they weren’t supervising as well as they should be, but your threat at the end was probably not the best response. \n\nIt would be preferable to express your concerns politely in the moment and then make an appointment to talk to the teachers at a later time when no children are present and talk more fully about what you saw in the store and why it is unacceptable to you and your spouse.", "Oh, you are TA. Maybe if you have such high standards, maybe you should watch your kid so it goes your way. My guess is your kid loves his afternoons.", "YTA oh I bet you're so much fun to live with.", "YTA. Who’s job is it to raise your kid the teacher or the parent? You dont dump your kid in school to learn how to be a decent human they go to school to learn basic subjects and educational skills. \n\nParents love to dump the job of a parent on everyone else. Not to mention talk shit on teachers and then expect them to handle everything. \n\nTeach your kid to be better, dont blame the teacher for the actions YOU failed to prevent.", "This is so fake it’s gross. You replied that you didn’t give permission for your child to go off campus and your concern is that he embarrassed you? Not his safety? And you openly threatened a staff member and your child is still in the after school program. If this isn’t fake YTA - you know that and take pride in it so why do you need to ask?", "YTA. You cant instill better behavior in  your child so you expect others to do it for you? Not running around in a grocery store is COMMON SENSE your child should have known before  hand.  Do you not discipline at home and instead expect others to pick up your slack? These teachers have a group of kids that are a handful-your son included and instead of being embarrassed you decide THEY need to learn a lesson? I know they def do not get paid enough", "Made up. No after school program is taking kids to a store with out a permission slip and not at the end of the day when parents are picking up. So lame to make shit like this up,", "I feel like part of this is on you. Why is your son acting like this when you’ve supposedly taught him right?", "YTA: Did you punish your son for his behavior, or do you always find someone else to blame?", "You ask if YTA. Your question has been answered. Why are you arguing? You asked for a general consensus and got it.", "Fake. A school won't just decide to take kids to a grocery store without written permission from all parents/guardians.\n\n>You better handle my son's behavior or I will and no one will like it.\n\nIf it is real, you are threatening abuse. YTA", "Thinking that teacher should call CPS on you justttt to check up if you threatened your child right to them.\n\nYTA🤦‍♀️", "Maybe don’t threaten a ten year old, especially to a mandated reporter (you better handle it or I will and no one will like it = threat). YTA.", "ESH. You need to teach your child that he needs to be respectful and follow the rules even when you’re not around. If he’s misbehaving, when you’re not present that a reflection of your parenting. As for the teachers, they are wrong for letting the kids run around a grocery store. One of them could have gotten hurt and the school would have been liable.  If there weren’t enough of them to supervise, they shouldn’t have taken them to the store. You need to discuss your concerns with their supervisors", "YTA- It’s on the parents to teach their children how to behave. Your son was acting a fool, that is YOUR fault not theirs", "YTA\n\nYou'll handle it and no one will like it? That, sir, is a threat.", ">You better handle my son's behavior or I will and no one will like it.\n\n\nSo you threatened your child in front of his teacher and think you're the one with the moral high ground?", "YTA", "YTA", "ESH. OP isn’t exactly a stellar parent. But the teachers also suck for not controlling the kids better. If they can’t be controlled, they shouldn’t be brought to a grocery store. A grocery store is not a playground.", "YTA - great parenting there, your kid hasn't be taught manners in public,  doesn't respect you in public and sounds like you were threatening to physically abuse him, but yeah go off at the after school staff 👏", "Yta. \n\nDo you know what is so weird? Your phrasing. I heard a parent say that to their kid recently.  Exactly that. It was one of those old pathetic fathers with a 6 year old,  probably a second family.  \"Or I will handle the problem and no one will like it\" \n\nAnd it was in public and people laughed at this sad old weak dork threatening a child.  \n\nBut in that moment I had the clearest memory I've had in quite a long time,  of my own childhood,  being at \"that\" friend's house,  when you realize there are really for real bad families out there not just in books.  That guy said the EXACT same thing. \"You will deal with it or I will and no one will like it.\" \n\nDo you guys all know each other?\n\nOr is this some kind of lizard brain thing? Like you're so emotionally stunted you think threatening children in public is effective/ good? In replies you seem proud.  It's amazing.  You're proud of such an obvious failure? You can't outsmart a kid or two underpaid child-minders? You go straight to violent threats and you feel good about yourself? \n\nIn other areas of your life would you really be the type to pride yourself on the absence of thought you give things?", "Wow. Just wow. \n\nMy mother was a teacher so this one gets to me. People like you are the worst and are a big part of the reason a lot of people aren’t teaching for as long anymore. \n\n\nWill someone talk some sense into her?", "NTA. I don't get all these YTA. They weren't supervising a group of children under their care. They were allowing them to run around a store putting, them, customers and products in danger. What if one of those kids had knocked someone down or run face first into a cart? You did control your kid when you saw what he was doing. Everyone jumping on the part of handle my son or I will and no one will like it, is BS. There are many meanings in that. The kid gets grounded, you report the teachers, you complain to the store manager and get them tossed out. You weren't taking down to them. You were pointing out the fact that they weren't doing their job.", "MTA, You say your son knows how to act in a store. Well he's not practicing what he supposedly knows. Sure the teachers should have had better control of the students but, your son needs a refresher on how to act. Be a parent not a buddy.", "Oof. Never ask redditors parenting questions. NTA but you can’t expect teachers to do much when it comes to discipline - they don’t have a lot of tools at their disposal when it comes to giving out consequences for bad behavior. I hope your son learned a lesson about not following the pack when everyone else is behaving like maniacs.", "You do realize you just threatened your son in front of his teachers right? You do know they are mandatory reporters right?\n\nYTA", "Nta. Your kid was running around a grocery store unsupervised. He could’ve been hurt, kidnapped or got in big trouble. The fact that you were able to just go in there and grab a child is alarming in itself. Imagine if you weren’t his parent…Those teachers were being negligent. If you’re going to take kids on what seems like an unauthorized field trip, the very least you can do is keep track of them.", "Nta.  Yeah, pull your kid out of that group.  They're encouraging bad habits by not correcting him and letting him earn a bad reputation in the neighborhood.  I'd complain to the school and ask the store manager to do the same.\n\nEveryone seems to be reacting to your last line like a threat.  Please clarify how.  If you mean grounding him and calling the principal and other parents I have no problem with it.\n\nAlso, I agree that after school groups, teachers and babysitters need to be able to discipline and control the kids in their care.  Yes the kids behaviour is a reflection on the parent, but if the teacher is ignoring bad behaviour they're just as at fault.", "NTA. The whole \"mandatory reporters\" bit might be an issue if there was something to actually report.", "They have a boss", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy 5th grade since is part of an after school program. Basically he stays on the yard and plays with his friends and does activities. It's like an after school camp.\n\nI work by his school and took a late 3pm lunch today. I went to the grocery store and was befuddled by all these kids running rampant. I realized they were from my son's school. Then I saw this short blonde hair kid who looked like my son chasing this kid who looked like his best friend with a bag of sugar and weaving between people.\n\nAs he got closer I realized this was my son. As he ran passed me, I pulled him into me and told him to calm down. He realized it was me and asked why I was there. I said I was on lunch and why is he there. He said his teachers took the after school camp to the store to buy snacks. \n\nHe asked me to let him go and I said no. I told him he knows how to act in a store and as his dad, his behavior embarrassed me. I took him to one of the teachers and asked if he belong to him. He said yes, to him and another teacher. He asked what was wrong and if I could let him go.\n\nI said he and other kids are running around the store like a playground and you and Mrs. Daniel should be watching them better. Oh and I'm his dad. Mrs. Daniel came over and asked what was wrong. I told her what I told the other teacher.\n\nShe said I knew you looked familiar and laughed. I said this isn't funny. You better handle my son's behavior or I will and no one will like it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. If I'd been in that store, I'd have been annoyed with the teachers too.", "YTA. Why don’t you do YOUR job as a parent and teach your child not to act like that in public. He’s old enough to know better. If you had taught him proper behavior then he wouldn’t be running around a store. That’s on YOU.", "Ay ay ay, let the man beat his imaginary kid during his lunch. Which is at 3pm, def when the kids would be in after school.", "Even if they didn't report him for it, he's definitely on their radar now.", "Go for it", "They don't want to see my kid in tears and feel guilty", "Exactly.\n\nOP, YTA. This sounds like an abusive threat. That you made to mandatory reporters. You need help.", "Can I ask, how did your parents get you to act right when they weren’t around? I’m having this problem with my son right now, he’s still little and speech delayed so I think some of that is the problem but his teacher comes to me almost every single day saying he’s not listening. But it doesn’t seem so bad at home & seeing these comments idk if that’s because he’s the only kid I have to deal with & give my attention to or if he’s scared of me.", "They're teachers and should know better", "My kid doesn't act that way when he's with me", "They get paid to watch him", "I'm honestly questioning his \"running around the store\" commentary. It sounds like only his kid was doing anything.", "I'm a teacher. This post is bullshit. A school would never sanction such a thing.", "Thank you! The answers here are absolutely bonkers. At the same time as they’re saying “you failed to teach your kid how to act” they’re criticizing him for … trying to enforce expectations of appropriate behavior (“omg! abuse!”). Really reads like a bunch of young people who don’t have kids but imagine that parenting involves just explaining to your kid how to behave, and then they just go out in the world and behave correctly every time. This man clearly has tried to teach his kid how to behave— his first words when he caught the kid horsing around were “you know how to behave in a store”— and the kid just got caught up in the wild antics of the unsupervised group. If the teachers were really letting the kids run wild in the store then you bet someone should call that out because it’s a recipe for disaster.", "Eh, schools in my district ended between 2:15 and 2:45, so this isn’t too far of a stretch. And small towns with grocery stores next to schools… it’s believe enough to me", "[deleted]", "Good", "Why would your child be in tears?", "Why would they feel guilty?", "there is something severely wrong with you... this isnt a joke either, that's pretty fucked up that this would even cross your mind to do to a child, i feel sorry for your son. YTA", "I hope you lose your kids", "YES. 100%. I don’t know how else someone is supposed to take that(?!)", "When you're a little kid it's already super hard to communicate, when there's an extra barrier sometimes people get angry at you or ignore you completely. I went nonverbal a lot as a child and I never wanted to listen to people who weren't listening to me when I tried to communicate in other ways or didn't listen to my words when I was verbal. Also some adults didn't believe I was paying attention because the regular cues like looking at them and responding were difficult, of course I don't know why your son in particular is speech delayed but it could be worth looking into autism", "They’re teachers, they can’t scream and beat your kid like you", "Shouldn't your 5th grader know better?", "You’re a dad, so should you, yet you still threatened your own son in public in front of teachers (please god let this be fake🙄)", "Great - so you’ve managed to teach your child to fear you, but not how to behave in public.  Fabulous parenting.  Parents like you are why teachers are quitting in droves.  Stop blaming others for your own failings with your son.  YTA", "Then that's the problem. He behave when you are near because he is scared of you, not because he respects you. You should have teach him WHY it's important to behave in public, not that if he misbehave you'll \"handle his behaviour\". That's what happens when you teach you kid with fear instead of explaining.", "My mother always said she wasn't worried about my behavior when I was with her, because just her presence was a damper on any hijinks. Her concern was how I acted when she wasn't around. If I had lost my mind and decided to misbehave, when I saw her I would have tried to sink into the floor. Your kid wanted you to let him go. Appears as if you might have a bit more work to do. Yes, teachers should control the kid to an extent, but they can only work with the material they are given. YTA.", "You've learned a lesson then. You're not actually properly teaching your kid how to act. And from how you speak, it sounds like the obedience you do get out of him is from fear, not understanding", "Well, the litmus test is whether he acts well when he isn't with you, innit?\n\nBeing irritated by disruptive youngsters not being handled effectively is one thing, and it's ok to express your concern. But there's no scope for you being impolite, threatening, condescending or otherwise to trample on boundaries.", "You have taught him to be utterly useless outside of your company.  Wow.  You have crippled this boy. How did you do it? Tell us all so we can just avoid all those things!", "Lmao. Ok. So he just embarrasses you when you're not around. Kids will be kids.", "True.. there has been studies done on this subject.", "[removed]", "You're avoiding what everyone is telling you. \n\nHe loves his afternoons because he's not constantly worrying about \"embarrassing\" you.", "Not nearly enough lmfao", "And you're a parent. What's your excuse for not doing your job properly?", "That's not quite true, many schools and programs have parents sign a blanket off campus permission form to make field trips easier and more accessible", "It depends on the program and who is running it. I've known some in the past that allow it if it's within a certain distance of the school.", "There was no permission slip which is another issue I need to look into", "That isn’t a good thing for you.", "So all those kids not running like manics at the store are scared of their parents?", "Thank you", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "If your kid is behaving like an AH, it’s probably because is male role model is a huge AH. That would be you. King AH. YTA", "huh no?!?! That's like the opposite of what I said. Kids that were taught respect and not fear will behave without needing to be physically threaten by their parent. \n\nDo you think that making your kid scared of you is the only way to make them behave ?! And that all kids that behave correctly do it because they are scared of their parents and that it's the only way ?!?", "No, they're all in an after school program *like a camp* where presumably one of the things they do is burn off energy. They've been sitting in school all day. \n\nAre you around kids? Like at all? They run like maniacs when they get in groups.\n\nYour kid was embarrassing you? Oh buddy, a bunch of people including your son, the teachers and the other kids saw you have an epic meltdown. Nothing to do with your son, that embarrassment is all on you.", "A 5 year old kid with his friends without his parents will almost always behave like this in a store. At this age, it’s very hard to get them to behave by themselves because they are not mature enough. It will come.\n\nYTA for your interactions with the teacher", "\"Epic meltdown\"?  \n\n\nIt's interesting all of these redditors suddenly saying that it's no problem at all to have little kids running around the store chasing each other with bags of sugar, the problem is any adult saying the teachers should be keeping the kids under control."]}