{"id": 28253, "submission_id": "1703n1r", "title": "AITA for getting engaged without my parent’s “blessing” and not wanting it?", "selftext": "About a year ago I (20F) and my fiancé (21M) got engaged. We don’t plan on getting married soon since we’re so young. However when I told my parents that he proposed to me they (mom and stepdad) were upset I hadn’t talked to them about it, and that my fiancé hadn’t asked for my stepfather’s “blessing” first. I brushed it off at the time, apologized for surprising them with my engagement (we had been together for over two years at that point) but I didn’t agree that I or my fiancé needed anyone’s blessing, let alone my stepfathers. I think the whole practice is archaic and unnecessary, and I’m no one’s property, if I say yes to being proposed that should be enough, we don’t need anyone’s “blessing.” It has come up again because my fiancé is moving to a new place and my stepdad has offered to help him move. My mom called me and asked me if I would have my fiancé ask for my stepdad’s blessing since he never did, but I said no I don’t think that’s necessary as I am my own person and I don’t belong to my stepdad or any man for that matter. She says I should do it out of respect for his tradition and beliefs, but I don’t agree. Him and my stepfather have never been close, he’s actually insulted his weight before and when my fiancé was homeless for a bit he did nothing to help (not that I expected him to but we did ask if he could call in a hotel room since he was under 21 at the time and he said no) and he just has very different beliefs that we don’t agree with. I love and appreciate my stepfather very much but, ultimately, I do not see him as my father. I don’t belong to him and I genuinely just don’t believe we need to ask him for his blessing. AITA for refusing to have my fiancé ask my stepdad for his blessing? Should I just do it out of respect to make him happy?", "created_utc": 1696465710, "permalink": "/r/AmItheAsshole/comments/1703n1r/aita_for_getting_engaged_without_my_parents/", "score": 121, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > We didn’t originally ask my parents for their blessing and we don’t want to. I may be the asshole because my stepfather is very traditional and I could just do it out of respect so he feels better.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nYour stepdad needs to examine his beliefs if he feels this strongly about being asked to give his assent to a decision made by an adult who is not even his child.  Does he need to bless my engagement too?  Does he think he's God the Stepfather?  No.  No other adult needs his blessing to make their own decisions, not you, me, or any other woman, and if that bruises his ego, that's on him.\n\nHeck, I'm very close to my dad, he's the first person I run nearly all my major decisions by because I value his input, and I STILL told my fiance not to ask for his blessing before proposing.  This is my call, not his.  And while my dad is a very traditional/conservative and religious man, he did not feel disrespected by that.", "Nta. You're an adult, your life your choice. Nobody needs permission from their parents to get married.", "NTA\n\nThis is just wacky.  Man I'm pretty old but this is like something from the middle ages.  Like it would have been old-fashioned in the 70s to react this negatively about it.  That was 50 years ago!", "NTA. It’s bizarre that this is even an issue. Kind of creepy that your parents feel entitled to “allowing you to get married.” 😳", "NTA\n\nYou said it. You're not anyone's property and the decision to get married is one you are perfectly capable of making without their sanction. \n\nI do wonder if they would expect a son or his gf to ask their permission before getting engaged 🤔", "NTA. As you say, this is an archaic practice, you don’t belong to anyone, and you don’t need anyone else’s permission to get married. When it’s your life decision, what matters are your beliefs—not your stepfather’s.", "Nta. Stand your ground. He doesn’t need or deserve to give you away bc as you said…you don’t belong to him.", "You don't need anybody's permission, OP, you're an adult. Tell them to move with the times and get with the program, without any need to insult the stepfather belief system.\n\nUnless absolutely necessary.", "\\>  Him and my stepfather have never been close, he’s actually insulted his weight before and \n\nSo your step-father has a history of being an asshole\n\n\\>  She says I should do it out of respect for his tradition and beliefs, \n\nAnd your mother likely has a history of enabling his asshole behavior\n\nNTA, and don't be his doormat.", "NTA- be prepared for more traditions that he'll expect you to follow when you get married", "OP I strongly agree with you. You aren't the property of anyone.  You're an adult, you don't need somebody else's blessing. You sound like what I said to people when I married and they asked if my father was giving me away. I loved him dearly but I wasn't 'his' to give away, I make my own choices.", "NTA good on you for standing up for your beliefs. Screw traditions you’re right that it’s both archaic and unnecessary. It’s not like they have a dowry planned for you they just want to have their egos stroked", "This was an embarrassing anachronism 50 years ago.  NTA", "What are his traditions and beliefs? I'm suspecting something really archaic like girls are property. Stick to your guns, it's the 21st freaking century. Some traditions need to die.\nCongratulations on the engagement.\nNTA\nWhen you do get married, consider not doing the \"give away the bride\" schtick.", "NTA\n\n>I think the whole practice is archaic and unnecessary, and I’m no one’s property, if I say yes to being proposed that should be enough, we don’t need anyone’s “blessing.”\n\nThis says it all.\n\n>She says I should do it out of respect for his tradition and beliefs\n\nThose are not your traditions or beliefs. Also, your stepfather and mother should RESPECT your beliefs of it being archaic and back off.", "Eh, I’m an advocate for asking for a blessing and talking to parents before hand but I believe it’s a personal choice and not required, depending on your beliefs. I’m not religious, for me it’s just a sign of showing respect, to each their own though and I don’t put anyone down for not doing it. I do think it’s not the same asking a step father though and I don’t know if I would or not", "I mean, this is one of those things that is weird.\n\nI did ask my father in laws blessing before proposing.   However, it wouldn't have changed anything no matter what he said, and he knew it. My wife was not big on this either, but when we started getting serious I think we both kinda decided that doing some traditional stuff was not horrible.\n\nOne thing for all the people saying that this is archaic.  That may be true, but asking a woman's father's blessing is also kinda a route to understanding if you are about to make an ass of yourself.", "NAH - I know that this will probably be seen as controversial since the history of asking for one's daughter's hand in marriage is a sexist tradition. The thing is that there is a reason that this tradition hasn't died when it's felt dated for well over 50 years, if not longer.\n\nThe point of asking the parents (not just the father) for permission to marry is because it shows understanding that asking someone to marry you is also asking to join their family. Presumably, the person proposing has already asked their parents for their blessing, and asking the other party's parents is essentially respectfully acknowledging that you are imposing yourself on their family.\n\nThey don't owe you and your finance their permission for you to marry, and you sure as hell don't need it to get married. So I do feel that this is about showing respect.", "NTA. You're your own person, not an object to be given away.\n\nEDIT: It was a typo! I meant NTA, not YTA. Yikes!", "**NAH**.\n\nThis is just about different generations having different outlook of things.\n\nYour parents are NA for wanting him to ask for their blessing; as that is just a formality that shows them that your fiancé is brave enough to stand up and show his face against authority for you.\n\nAnd you are NA for not agreeing that a blessing is necessary.\n\nBut you are an AH for mentioning the \"he did nothing to help\" when your boyfriend was homeless and then mentioning that you didn't really expect him to help. Why would you mention that if not for us to think badly of your stepfather.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAbout a year ago I (20F) and my fiancé (21M) got engaged. We don’t plan on getting married soon since we’re so young. However when I told my parents that he proposed to me they (mom and stepdad) were upset I hadn’t talked to them about it, and that my fiancé hadn’t asked for my stepfather’s “blessing” first. I brushed it off at the time, apologized for surprising them with my engagement (we had been together for over two years at that point) but I didn’t agree that I or my fiancé needed anyone’s blessing, let alone my stepfathers. I think the whole practice is archaic and unnecessary, and I’m no one’s property, if I say yes to being proposed that should be enough, we don’t need anyone’s “blessing.” It has come up again because my fiancé is moving to a new place and my stepdad has offered to help him move. My mom called me and asked me if I would have my fiancé ask for my stepdad’s blessing since he never did, but I said no I don’t think that’s necessary as I am my own person and I don’t belong to my stepdad or any man for that matter. She says I should do it out of respect for his tradition and beliefs, but I don’t agree. Him and my stepfather have never been close, he’s actually insulted his weight before and when my fiancé was homeless for a bit he did nothing to help (not that I expected him to but we did ask if he could call in a hotel room since he was under 21 at the time and he said no) and he just has very different beliefs that we don’t agree with. I love and appreciate my stepfather very much but, ultimately, I do not see him as my father. I don’t belong to him and I genuinely just don’t believe we need to ask him for his blessing. AITA for refusing to have my fiancé ask my stepdad for his blessing? Should I just do it out of respect\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nIf that is your stance, stick to it. I see nothing wrong with asking if you think it's romantic or whatever, and nothing wrong with not asking if you see is as possessive and patriarchal.\n\nNow, having said that, you could find a compromise where your boyfriend and you tell them you are getting married, and you hope they bless the marriage, but you're getting married regardless. That way you all have the chance to possibly put this behind you, or you can see where they really stand and whether they will accept your marriage or not.", "NTA. Your step dads beliefs are his and that’s where they should stop. 100% with you on your assessment of the practice. And if your step dad wanted to ask blessings from whoever he wanted before proposing, that’s perfectly fine. He doesn’t get to dictate how you deal with the same situation. \n\nIf you have other areas where you’re not “traditional,” you should take this as a warning about their level of involvement in wedding planning. If they are this hung up on blessings, I could see them being a pain in the ass for the already stressful process of planning a wedding.", "NTA.", "NTA It is a legal requirement not a tradition. In most states, once you are 18, you don’t need parental permission to marry.", "NTA \n\nDon't do it. This isn't the 19th century.", "NTA\n\nI'm in my 60's, and have been married for 35 years. And nobody asked for anybody's blessing for my marriage.", ">My mom called me and asked me if I would have my fiancé ask for my stepdad’s blessing since he never did\n\nHow 'bout NO? Your stepfather is just some random guy that married your mom, and his blessing is definitely not required; but I get your meaning, you don't need anyone's permission to get married.   \nNTA.", "“mom and stepdad were upset I hadn’t talked about to them about it , and that my fiancé hadn’t asked for my stepfather’s blessing”\n\nThat’s a fantastic indictment of antiquated things  that should disappear", "NTA. i think you should be free do do things how you as a couple want ot do things.\n\nHowever, you might want to make your views and opinions of your stepdad clearer, to everyone.\n\nI know you said you not planning on getting married soon, but another topic that gets posted about a lot in this sub is the \"walking down the wedding aisle\" and \"giving away the bride\". If your parens are reacting badly to not being asked for their blessing.\n\nThey might not react well to \"you not giving me away at my wedding\".\n\nSince you not plannng to get married soon, you have some time to think about it and consider how you want to approach it, However, I do think it's something you should expect.", "Generally in these situations, the man is the one that asks for the woman's parents' blessing.\n\nThis is done to show that the man has \"good intentions\", as he is showing his face and not scurrying behind the parents back in order to get what he wants from the woman. This also provides the father the ability to \"weight\" the character of the man to see if he will be someone that will actually be able to care and provide for his daughter. Sort of like \"men know when other men are talking bs and are living in la-la land.\"\n\nHowever, now a days this is just a formality, as women are able (and expected) to work; so they don't depend on a man to finance their lifestyle as they can finance themselves.", "There are all the wedding ones too… walking down the aisle, paso g her ‘hand’ to the groom, (step)father -bride dance… ugh!", "A dowry would honestly be appreciated, maybe then we’d ask for his blessing! /j", "Funnily enough, I plan on having my mother walk me down the aisle and “hand me off.” I guess we’ll see how that goes when we get there.", "There is a reason you are being downvoted, let’s see if you can figure out why.", "She didn’t expect the step dad to pay for anything. However they asked if her parents would “order” the hotel room and they refused. If they aren’t willing to put the room under their name so he wasn’t on the street (not pay for)…then they don’t get a say in wanting respect.", "I understand where you’re coming from sayings it’s more of a formality, but it’s the principle for me. My fiancé should have to “show his face against authority” for me, because my stepfather is not my authority. My fiancé is not going up against anything in asking to marry me. We are adults. \n\nAs for why I mentioned that, I meant to illustrate my stepfather’s behavior and attitude towards my fiancé in the past, which is another factor in why I don’t believe my partner should need to bow down to his “authority” and ask for his blessing. I did not expect any help from my stepdad, but I did hope that he would make a call so that my partner had a bed to sleep in for the night, because he was literally homeless and could not legally book a room for himself. We never asked him to pay anything, just book him a hotel room. There are other situations like this that outline his general lack of respect for my partner, which do not make me feel like I need to respect HIM by asking for his blessing to marry.", "Blah blah blah sexism, double standards.", "I mean realistically it started because a woman was the property of her father. And for some reason, people still do it in the name of tradition.", "Congratulations on your engagement :)", "May you have a long, healthy, and happy life.", "May you continue to patronise women on the internet and be met with derision.", "Where did you get the \"patronise women\" part from? This person just gave an answer to your question of if they expected women to also ask for permission. Calm down.", "😘", "Probably from the really patronising responses.", "What part? It sounded fine to me.", "Don't bother trying to rationalize with irrational people. \n\nThis person provably saw my user name, assumed that I was a man, and decided to get offended on women's behalf.\n\nThey provably didn't even read all the way to the end.", "One of my favorite takes on ‘Asking the Father’ went:\n\n“If my daughter knew you, a man, was here asking me, another man, for permission for her hand or any of her fine parts - it could be incredibly dangerous for both of us.” ☠️☠️☠️\n\nWe are, none of us, any longer property to be given, we decide who we belong with. You do you. Stepdads insecure and weirdly possessive. I’m petty AF and would deliberately mention in my vows that we choose to give ourselves to each other then smirk at SD 😎 NTA", "NTA\n\nThe blessing thing is archaic. That said, for some people, it's still an important tradition that they enjoy. I'm as staunchly independent as it gets, and I was still happy that my husband talked to my dad before he proposed to me.\n\nBut if that's not yours and your fiancé's vibe, that's that. It's up to you two, not your parents. You're so young. Your parents are still used to having a lot of control over your life, and this is illustrating to them that that's not the case anymore. They'll just have to get over it.", "NTA. The attitude is, as you say, 'archaic'. You have to look at yourself in the mirror and I guess you don't want to see  someone who has compromised her principles? You seriously don't want to play this asinine game your parents have been trying to lure you into.", "NTA since you don’t see the man as a father figure. But just to let you know, asking for blessing is not the same as asking for permission. It doesn’t denote ownership of another person.\n\nIt may differ by faiths, but often times the act of asking for blessing is to ask someone to help pray for good luck, health, success etc. Asking parents to bless the marriage is basically asking them to support the couple, and pray/hope for the health of their marriage. \n\nI’ve seen pastors asked to bless a child’s studies, and Bible study groups asked to help bless the opening of a new business. Some also ask pastors to give blessings on a new house. None of these denote ownership or asking for permission.", "NTA. You’re not chattel. Tell your stepdad is the 21st century.", "NTA\n\nEverything you said is correct.  \n\nYou are an adult. \n\nYou aren’t anyone’s property.\n\nHe’s not even your dad.\n\nUnless you’re getting a dowry or your stepdad wants to negotiate your price in goats, you get to make this choice without his “blessing!”", "Nah. Rubbish", "NTA\n\nHe wants to feel he is your \"true\" dad and validate him by demanding a tradition related to fathers.\nWhat if he said no? Was your partner supoused to obey? It's ridiculous", "NTA.  Traditions like this need to die off and that’ll only happen if people stop following them.", "NTA, my parents pitched a big hissy fit coz my husband didn't ask my dad for his blessing (I proposed lol) and while I apologised and explained that I proposed and my partner later asked for his blessing before the wedding, my dad said no, he didn't approve of us getting married and for a while we weren't sure if he was even going to come.\n\nThis year I fully went no contact with them and celebrated my 10 year wedding anniversary. Fuck anyone who is not supportive of you doing highly normal and morally fine things x", "Your step father is a control freak, tell him no and if he keeps it up put both of them in a time out.", "Nta. He’s your stepfather so it’s weird to ask him to begin with. My conservative dad would find it weird as hell to be asked. The tradition exists, but it’s not for everyone and I don’t know anyone that asked the step dad and not the mom if they were following tradition and the dad was out of the picture.", "NTA", "NTA - my now wife didn’t even meet my family prior to the proposal and I had only recently met them because of a major family get together. Her and I felt no need to know, ask permission or any other part of that archaic crap. It was between us, nobody else. Now happily married 27 yrs, and still don’t give a crap what either side thinks about what we do with our life.", "NTA", "He’s the STEPfather: not even her blood relative. F/ing archaic practice that went out with women being chattels, someone’s possession. Thank fuck that’s gone. Definitely NTA, stick with your principles and I hope you have a fabulous life together.", "Nta. Why should your mothers husband care. Just because mommy married some dude doesn't mean he has any sway on OP. Essentially some dude mom is banging. Besides it is archaic and sexist. As an older person, I don't understand these parents that are my kids age, hanging on to this bullshit. NTA.", "NTA, not even your biological father would need to give a blessing to your engagement as he wouldn't own you either. This man needs to grow up and get over himself and his fragile ego.", "NTA", "God the Stepfather lmaoooo 😭😭 i'll be laughing all day", "OP could tell her mother that she'd much prefer to it since respects HER beliefs than step dad's. After all step dad isn't the one he's marrying.", "He'll couch it as 'being respectful' or 'honouring the family' but dig down and it's women are property. Every time", "Did you mean to write NTA?", "The generations where this was a must are long gone. This is nothing but a leftover from a much more patriarchal time, it's sexist end of discussion. The tradition still exists because many people are sexist, not because of tradition. My father was born in 1946 and he would never have dreamed of demanding such a thing.", "i wouldnt even do that the belief of blessing comes from way back then where the dad owns his boyfriend and the daughters had to have the dad bless the proposal and engagement or they couldn’t so fuck that his step dad thinks shes his property he can suck some fat horse dick tbh (so tired and made so many mistakes so edited it 😂😭😭)", "If “respecting his beliefs” and doing something you don’t agree with out of respect for someone else is so important, why can’t they let it go out of respect for your beliefs? It’s your engagement, not theirs. It’s not about them. So why are their beliefs the ones that need to be respected instead of yours? The only reason they may have is respecting your elders but that will tell you they don’t have an answer and the only one they can come up with is “because we want it.”", "It was actually because marriages were contract negotiations and women were essentially sold from their father to a husband, often without her input or opinions mattering, and the man was figuring out what he got out of it. Women came with a dowry because they were viewed as a burden. It's why fathers walked women down the aisle. Literally giving her to the new husband. \n\nThe tradition stemmed from A) physically passing the woman over and B) the idea that the father's prescence stops either party from backing out.\n\nBoth come from women as property and fathers as authority figures until he passes the unauthority to another mans ans holdovers from arranged marriages.\n\nIt was not about respect, judging the character of the suitor or proving good intentions or stopping running around. It was about setting terms.", "I will just go out there and say that the \"asking permission\" thing is archaic tradition and more of a thing to be discussed on if it's necessary before even asking about marriage. You should know a partner's view on that and it's whatever.\n\nHowever in this specific circumstance, if this guy has been your father the majority of your life and you like him, not allowing him this traditionally fatherly role in the wedding will be alienating and hurting him and potentially put your mother in a difficult position. And that's because he is your stepfather. It would not hurt the same if he was your father, that would make him less likely to be hurt.\n\nIf you want any kind of relationship with your stepfather in the future I urge you to not even bring this up.\n\nI may even give a soft Y T A if you do choose to go forward with that idea, but at the end of the day it is your day.\n\nI will also point out that while he is being out of order trying to enforce this tradition, traditions about a nuclear family are not an attack on the independence of women, and the ancient notions behind the actual acts are hardly relevant and nor did anyone think about them in the wider public sphere until recently. Maybe in fringe groups but actual thought of this aspect of a father walking his daughter down the aisle was not common.", "Lmao oh fuck. I meant nta!", "I did! Oop!"]}