{"id": 28277, "submission_id": "170mbyy", "title": "AITA for telling coworker to fuck off after she said “this is why you’re single.”", "selftext": "I (f32) work as an interpreter (don’t worry when you see my atrocious grammar, I don’t interpret from/to English, it’s my 3rd language). One of my work colleagues, Hannah (f, late 30s) asked me the other day what my plans for the weekend were. I replied that I was going to the woods with my club to shoot some arrows and I had ballet class on Sunday. She was taken aback at that and asked me “how many hobbies do you fucking have?”\nSwearing is something she does a lot so it didn’t sound any alarm bells in my head so I replied that a few. She heard me speak about my classes before when I was asked about evening plans or when I said no to going to a pub after work. \n\nDespite my reply, she wouldn’t drop it and wanted me to list all the classes I do. So I told her that I took Italian classes, ballet beginners classes, archery, pan flute classes, and swimming. She asked, what about your volunteering, did you stop that. I said no, I still do it twice a week. And that’s when she said “this is why you’re single.”\n\nThat surprised me. I’ve never complained about being single, I’m quite content with that so I don’t know where that came from. I asked her about that and she just said I’m trying to relieve my high school days and no guy would want a woman that runs around in the woods with arrows and then pounces like a child in a tutu in adult beginners ballet class.\n\nCould I have been more polite? Sure, but she annoyed me. I told her to “fuck off” and I left the room.\n\nNow, she’s telling everyone what an asshole I am and that she was only trying to give me advice because I’m immature and will be single forever if I don’t get my shit together.\n\nIt’s been almost a week and now, she’s got some of the ladies on her side and they’re side eyeing me, one even twirled like a ballerina (badly) behind my back as I was leaving the lunch room. With so many people agreeing with her, I  need to double check if I was right to tell her what I did. Did I overreact, was I the asshole in the situation?  AITA?", "created_utc": 1696523262, "permalink": "/r/AmItheAsshole/comments/170mbyy/aita_for_telling_coworker_to_fuck_off_after_she/", "score": 540, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole because I told my coworker to fuck off after she implied I was single because of my hobbies. I guess I could’ve been more diplomatic in my reply to avoid being an asshole but she annoyed me.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\n###[The Asshole Universe is Expanding, Again: Introducing Another New Sister Subreddit!](https://www.reddit.com/r/AmItheAsshole/comments/128nbp3/the_asshole_universe_is_expanding_again/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but she IS creating a hostile work environment.  She doesn't get to decide how YOU live your life, then get offended by your telling her, in effect, to mind her own business.  Yes, you told her to fuck off, but as aggressive as she was being, it doesn't sound like she would have taken anything less than your being blunt and saying what you said. \n\nYou need to report this to your Human Resources department or file a complaint about her creating hostility at work because of an exchange she PUSHED, then she assumed you didn't like being single, (she's probably one of those people who think the whole damn world needs to pair up and have a romantic partner).  And now SHE is having others demean you, tease and mock you for LIVING **YOUR** FUCKING LIFE.  That is SERIOUSLY messed up behavior and she needs some serious consequences for starting shit at work and continuing to stir the pot and then, bring in other coworkers to help her stir that shit cauldron of hostility and bullying.", "NTA, what a weird situation. Your coworker was soooo out of line, and I wouldn't trust that she is even conveying it accurately to your other coworkers. Still it's super odd that they are all essentially making fun of you now and I'd consider that a hostile work environment - you should consider bringing this to HR. It sounds toxic.", "NTA.\n\nI'm honestly impressed, that is quite a list of activities and I don't think I'd be able to dredge up the energy for that list.\n\nIt sounds like you have a very full personal life, where you can meet new people and find friends who share some of your interests.\n\nI doubt the women agreeing with her have the full explanation of what preceded your comment. However, we are also missing something from your explanation, because your post doesn't describe the level of anger or aggression you had behind the words themselves.\n\nBut given the rude comments from her, f- off sounds like an appropriate response. \n\nI'd be tempted to turn it on the other ladies. Ask the one who is twirling behind you if she'd like you to see if the ballet class has space for her to join. Encourage someone to you work with to ask the other ladies if they all met their partners in the pub after work, or if they met them through hobbies.", "NTA. Normal people (not bitter/insecure/envious ones) would say something along the lines of wow, how do you fit all that in? You make me feel so lazy!", "NTA. It's hilarious she thinks the ultimate goal in life is to be coupled up 🤣\nYou go be you. You fabulous thing xx", "NTA.   You did not hire her to be your relationship counselor.  You did not ask her for her opinion on how to better your life.  Opinions are like buttholes, EVERYONE has one.  You do not need hers or the shit that comes out of it.  If they keep it up, it will become harassment and you can go to HR and report her for making a hostile work environment.", "NTA. OP go to HR and file a complaint. She’s starting a hostile work environment and overstepped.", "NTA your coworkers sound immature as hell. I miss having time for so many hobbies, I'm a little jelly. Maybe they are, too, because you sound like a very well-rounded interesting person with a wide variety of interests.", "NTA. This co-worker is employing juvenile mean-girl tactics, which is highly unprofessional and disruptive to the work environment. \n\nI agree with others, report this to HR. I recommend writing it out in a factual, objective report of the details, including the language used by both. Get ahead for this before she decides to blindside you by reporting you first.", "NTA. She wasn’t giving advice, she was insulting you and your life choices. Your love life is none of her business", "NTA, she’s creating hostile environment. \n\nAlso, as an aside, as you say it’s fine to be single but also your hobbies are cool and don’t actually prevent you from meeting someone- they actually increase your chances of meeting someone who shares your interests. Wow, she is dense and cruel.", "I have no idea how you have time to do all of that, but unlike your coworker, I mean that I am impressed that you manage to balance a job, a wide variety of hobbies, and normal adult life.\n\nShe’s right that you’re a very busy person, but attacking your hobbies was uncalled for. It sounds like she’s the one trying to relive high school by being catty and gossiping with the other mean girls.\n\nNTA and you sound like a lot of fun. (Also, your English reads very naturally and your grammar is definitely not atrocious.)", "NTA. Hannah is a boring turd and she's jealous of you. For what it's worth, hobby classes are a good way to meet like minded people and make new friends.", "NTA - she's jealous of your free time.", "NTA. Opinions and AH's, everyone has one, some stink.", "Okay, time to go to HR.", "NTA. Just look the coworkers in the eyes and ask them why they are so unhappy with their lives that they feel the need to interfere in yours. Misery loves company but come on. The trick is to look them in the eyes and hold their gaze.", "NTA. In fact, you are a million times more interesting for wanting to learn and do new things. She gave advice that you didn't ask for, which means she was in the wrong. Regardless, a person shouldn't live their life as though only finding a spouse is the be-all-end-all of living. I'm 40 and single by choice and have been so much happier since focusing on myself instead of trying to find a partner. Keep being awesome!", "NTA.  But you need to tell your manafmger and/or HR about this exchange, so they tell Hanna that this kind of behaviour is not acceptable.", "NTA.\n\nAlso a case in point why you keep co-workers at arms length and dont reveal anything personal.", "NTA.  Nope, this needs to go to HR.   She wouldn't shut her mouth and double downed on insulting you and is now acting like a toddler throwing a tantrum because you wouldn't put up with it.    The other ladies in the hen house are probably jealous that your life is a hundred times more interesting than theirs.", "NTA. Although you were a little over the top with the \"fuck off.\" You weren't wrong, but maybe a little less anger might've helped.\n\nShe's probably jealous of your life. If she's married, she may feel trapped and envious of your freedoms. If she's single, she probably hates that you have such an interesting and varied life, while she's constantly checking her dating apps and spending too much time on bar stools, trying to make eye contact with mediocre men.\n\n(Edited to add) We're also looooong past the time when boundaries need to be set up and respected. She does not have a right to comment on your personal life.", "NTA ... you need to report this to HR or whoever your boss is.  This is not ok", "Because people don't like interesting people?  I'm so confused.  You keep doing you, seems like you are enjoying life to the fullest. NTA.", "I’ll say this, she’s wrong about her advice. A lot of people love when their partners have hobbies and interests. Especially unique and cool ones. Nta\n\nAlso she’s an asshole for being rude to you for no reason", "NTA  (I probably would have tried to avoid alling her an AH)  Nosy people like that cause so many problems and often have very biased points of view.  .     You do what you enjoy.   Smile, and be a good worker when you're there and don't worry about her nosy gossipy nature.   Truth has a way of working it's way out in these situations.  Keep being you!!!!! Let karma take a whack at her.", "I'm a 34 year old man and I'd happily date someone that has those hobbies.\n\nNTA. She's just boring and lazy.", "NTA. You've got a great life, don't let your jerk coworkers get to you. I do a bunch of different activities after work too - Including ballet :) and it's not anyone else's place to comment on it. Fuck off may have been harsh - I would gray rock and just ignore all those ladies. You won't even remember their names in a few years after you or they move on to new jobs.", "NTA. There’s nothing wrong with how you’re living your life. It’s your life, you know what you want and need. Report her to HR. She took it from a chat between coworkers to harassment. You didn’t ask her for advice. She sounds jealous of you having a life you actually enjoy. Definitely report her and anyone else that’s teasing/bullying you—like bad ballet chick.", "NTA you’re living your life the way you want it, and it sounds like a very full life. She’s probably unhappy and jealous, also she sounds boring", "NTA, but a less aggressive response might have saved you the overall office tension you're experiencing now. Telling anyone at work to \"fuck off\" is usually not a wise career move.", "Nta but be careful she doesn’t leverage hr against you for your “outburst.” \n\nDocument everything.\n\nDon’t share anything about your life at work.\n\nSet boundaries and demand professionalism at all times.", "NTA - The worst vice is unsolicited advice.", "Sounds like if you wanted to you have plenty of opportunities to meet partners and start a relationship, why would lots of hobbies make you single? Not like potential suitors come knocking at your door. Unless she thinks online is the only place for romance.\n\nNTA", "NTA. She was being intrusive. She is a coworker, not a friend, and your free time is none of her business. I would record her comments and  report her if she keeps this up.\n\nAnd kudos for Italian classes. I take them too and volunteer as well.", "NTA - The first piece of advice given to anyone having trouble meeting people is to engage in group activities.  Since you're doing that, I don't know what she's talking about.  Just because she likes going to the pub doesn't mean it's for everyone.", "NTA. Your private life is absolutely none of her business.\n\nWhat she is doing now is \"fostering a hostile workspace\", you should go to HR and complain about it.", "NTA. You sound amazing. I didn't have as cool of hobbies as you, but I was single into my late 20s and I got a lot of crap like this. I think some people are intimidated by single women who are happy with their lives. But her baggage doesn't entitle her to be rude to you.\n\nI would not encourage you to tell coworkers to f off because no matter what they did, it's pretty easy to get in trouble for cussing someone out. But you were otherwise justified in shutting her down.", "NTA. File a hostile workplace complaint with HR.", "NTA \n\nthis is workplace harassment and I hope you are documenting it", "NTA I don’t understand how a woman in her late 30s can be this immature. She is also creating a hostile work environment. Time to talk to Human Resources.\n\n“This is why you’re single” is the crap my 11 year old son came up with when he was annoyed with me for nagging him about chores. Your 30 something year old colleague hurls insults like an 11 year old.", "Next time they twirl badly show them how it's actually done like a boss.", "A lot of adult women (and men) become extremely jealous and hostile when they see other people living a full life with lots of hobbies and variety, it makes them feel like their choice to focus on a spouse/family/work is looked down on and they get defensive. You’ve done nothing wrong and shes the one who needs to think about why shes so angry. \n\nNta", "NTA, and with all these hobbies/interests, you're more likely to not need to look very far should you ever decide you don't want to be single anymore.", "NTA\n\n&#x200B;\n\nSpeak to HR", "NTA.\n\nIn spirit of petty, might I suggest *discretely* passing info on dance classes to the coworker who twirled behind you. Suggest she get some instruction so she doesnt look like elephant next time she attempts...", "NTA\n\nCompletely uncalled for, and who says you need to date anyone? Apparently the happiest demographic is single women. Go enjoy your damn hobbies, forget them.", "Sounds like Hannah has a boring AF life and can't get dates because of it. You sound awesome and interesting and I'd rather spend time with you than Hannah. Hannah needs to learn to mind her own business. NTA.", "NTA This is an HR problem. She's making you uncomfortable at work.", "NTA. She wasn’t trying to help you. She was being mean. If you’re happy with your hobbies then continue.", "NTA. She is being a nasty bully. \n\nAlso, I think she has the causation backwards - a lot of single and childfree people end up accumulating interesting hobbies and activities because they have a bit more time to do so.  She’s probably jealous.  Also, an active social life with lots of interests is usually considered to be a good thing if you happen to be looking for a partner?", "NTA. They're just jealous of your free time. Also, your grammar is just fine - better than many native English speakers!", "NTA. Deal with this head on with your boss/HR. She can’t bulldoze her way into your social life and drop unsolicited “advice “.", "Nta. She seems jealous 🤷🏻‍♀️. You have some cool hobbies. Archery sounds fun. Maybe print out. A picture of her and use it as practice.", "NTA. She's just jealous that you have a life.", "NTA! You're living what sounds like a lovely and fulfilling life.  Don't sacrifice it for a shallow brat who honestly comes off as jealous and competitive.", "NTA, it sounds more like she is jealous. She did what society (or her parents) told her she had to do apparently, which was get a job and a spouse. God forbid you use your free time doing enjoyable activities. Nothing says you have to have a partner or one in a designated time frame either. Having biological children can be what pushes a lot of people to do it younger, but that is up to each individual person and no one else. You need to file a complaint with HR against all of them. Then continue enjoying your hobbies!", "Nta... this reads like a you need to report this to hr scenario. It will only get worse", "NTA\n\nI just took the annual harassment training for my job last week.\n\nI don’t know where you work, but at my employer you would have a valid HR complaint that she has created a hostile work environment over gender stereotyping.", "NTA, OP. She sounds very envious of you… ‘this is why you’re single’… she’s probably been questioning it because it seems odd that you would be from what she sees in front of her. THEN to find out you’re such a well-rounded and interesting person on top of that, who doesn’t sit around moping and contemplating their own singleness? ‘How DARE you’ /s of course! \n\nThis all looks and smells like classic (high school) jealousy to me; especially with the cliquey, mean-girl bullying. How she has the audacity to call you immature baffles me. \n\nNot a nice situation to be in. You’ve done nothing wrong.", "She sounds like an insecure loser and a bully. It’s very pathetic to think someone actively pursuing their interests is “reliving their high school days.” Your coworker must be an incredibly boring woman with nothing to offer anyone except her body. Report to HR. NTA.", "She's jealous because she's worthless", "What you do on your own time away from work is none of her business. Your romantic life (or lack there of) is none of her business. Her spreading her opinion of your personal life is YOUR business. Your coworkers mocking you and side eyeing you is YOUR business. I agree with the others, get HR involved because her toxicity is creating a hostile workplace which is HR’s problem to correct.\n\nEdit to add judgement: NTA", "NTA. Actually, hobbies are a great way to meet like minded people to go on dates… maybe she’s just bitter and has nothing better to do in life than judge others.", "NTA. She wasn’t giving you advice. She was offering an unsolicited opinion on something that might not even matter to you. Also, she’s wrong. It’s possible to have a bunch of hobbies and a relationship. I also find that meeting people in those situations tends to be way better than something like Tinder - you’ve already got a common point of interest!", "NTA, and you need to get HR involved. This is pretty soundly in the \"hostile work environment\"category.", "NTA. Keep record of everything and contact HR. \n\nSounds like the coworker and her friends have nothing better to do.", "The only issue you have here is that they have only heard HER version of the events and she most likely made you the aggressor in the story.\n\nWhat you need to do, if you actually care that is, is to speak to your other colleagues and explain the situation from your vantage point.\n\nYou may not change all hearts, but you definitely will change some minds and even reflect some of that aggression from them on to her.", "NTA. Tell them all to fuck themselves. Also tell anyone that is married and have just step kids and no bio children of there own. Are just really playing fantasy family. Good for you on all your volunteering and your hobbies.", "Telling anyone to 'fuck off' is not polite. People see far more meaning in words than they should and 'fuck off' is often perceived as angry.\n\nI'm not going to tell you if you're the asshole or not, but as you're asking... you likely already know. Asshole doesn't have to be a 'bad' thing, as long as we learn from it.", "ESH. Her reaction is bizarre if you've never said anything about your being single. But your response is an overreaction as well.   \n\n\nIf it isn't an insult that you're single, you sure reacted as if it were. I would've thrown it back to her that you doing all those things aren't to attract a partner, but to make you happy/a more well-rounded person/whatever, that is obviously not dependent on you being in a relationship.  \n\n\nHer turning other coworkers against you is a real problem, though.", "YTA for taking the bait and getting upset at what she said. Cursing in the workplace is not a good thing and will usually get you in trouble with management. Small minded people (men and women) think that the ultimate goal for everyone is to get married and have kids. They get upset that some people don't want that and therefore have time to have a lot of hobbies. That upsets them even more because they don't have time to have hobbies. Next time, just move on and enjoy your life.", "I think you blew up some innocuous, vapid office small-talk/joking into an opportunity for outrage. Congratulations, you’re now *that person* at the office.", "Nah.\n\nIt sound like she made a comment in passing and you over reacted.\n\nIt was out of line, *technically* , but it could also have been light ribbing. Next time just take it in stride. If it becomes a reoccurring thing then of course your reactions should change.", "ESH....co-worker is AT for commenting on your personal life. You're TA for over-reacting and telling her to FO. You could have said something like \"I like to keep busy\" and be done with it.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (f32) work as an interpreter (don’t worry when you see my atrocious grammar, I don’t interpret from/to English, it’s my 3rd language). One of my work colleagues, Hannah (f late 30s) asked me the other day what were my plans for the weekend. I replied that I was going to the woods with my club and shoot some arrows and I had ballet class on Sunday. She was taken aback at that and asked me “how many hobbies do you fucking have.” She does swear a lot so it didn’t sound any alarm bells in my head so I replied that a few. She heard me speak about my classes before when I was asked about evening plans or when I said no to going to a pub after work. \nI told her a few but she wouldn’t drop it and wanted me to list all the classes I do. So I told her that I took Italian classes, ballet beginners classes, archery, pan flute classes, and swimming. She asked, what about your volunteering, did you stop that. I said no, I still do it twice a week. And that’s when she said “this is why you’re single.”\n\nI was surprised at that. I’ve never complained about being single, I’m quite content with that so I don’t know where that came from. I asked her about that and she just said I’m trying to relieve my high school days and no guy would want a woman that runs around in the woods with arrows and then pounces like a child in a tutu in adult beginners ballet class.\n\nCould I have been more polite? Sure, but she annoyed me. I told her to “fuck off” and I left the room.\n\nNow, she’s telling everyone what an asshole I am and that she was only trying to give me advice because I’m immature and will be single forever if I don’t get my shit together.\n\nIt’s been almost a week and now, she’s got some of the ladies on her side and they’re side eyeing me, one even twirled like a ballerina (badly) behind my back as I was leaving the lunch room. With so many people agreeing with her, I  need to double check if I was right to tell her what I did. Did I overreact, was I the asshole in the situation?  AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  Head straight to HR now. She is creating a toxic environment for you.", "You sound amazing and your coworker is jealous. This mean girl bullying attitude is meant to bring you down. Don't give into it. Show them it's not bothering you and keep your personal info to yourself from now on.\n\nWhen a nosy person questions me I usually change the subject or deflect. Coworkers don't usually have your best interest in mind so the less they know the better.", "She wants the D", "NTA. She was way out of line with her insulting comments, and it's clearly none of her business how you spend your time, or whether you want to stay single. I think you're wise to avoid socializing with her. I would avoid speaking to her at all.", "NTA go to HR before she does..", "Absolute harassment. This is an HR discussion.\n\nNTA.", "NTA. For some people, finding and being in a relationship is the only important goal in life. Often times, those people look down on those who don’t share the same opinion/lifestyle. I don’t know why, but I’ve experienced it myself. It’s like they can’t just let other people live the lives they enjoy - maybe they’re not as happy as they want people to think they are.", "NTA OP please report this to HR", "NTA", "Yeah, everyone knows that no dude wants a woman  who does ballet and archery. \n\nUnsolicited advice is one thing, confidently incorrect advice is another.", "she's jealous that you actually enjoy your life, meanwhile she is only happy making others outcasts of a 'group'. it's why office works sucks ass tbh. the fucking cattiness of them all. plus you're probably way fitter than them if you are doing ballet and most women working in offices are pretty bent out of shape over their bodies lol\n\nI would suggest you start bringing them sweets and make them fatter over time. they will think you just want their friendship/approval and shovel down their remaining sense of worth one pound at a time muahahaha", "NTA.\n\nTelling someone to fuck off is kinda rude, but it was completely called for. She was much more of an asshole than you.\n\nThat being said, I would bet she would be talking shit about you to coworkers no matter what you replied.", "NTA. She is a jealous mean girl.", " NTA,\n\nBtw your post has encouraged me to try something new. I been wanting to learn a new language! It’s amazing to have hobbies and interests, it keeps life interesting! Well done girl", "Definitely NTA. Good for you for sticking up for yourself. Your coworker definitely wasn't being respectful towards you.", "NTA they are all sc r e a mingly jealous of you", "OP, you are being harassed and bullied in the workplace. NTA. Someone is *very* jealous of you, and your very full and enriching life.", "NTA with a side of wistful envy for your lifestyle. \n\nMy caution with reporting to HR is to get ahead of her likely counter that you created the hostile work environment with your “F-O”.", "NTA. Not only was she rude, but also wrong.", "NTA. There is alot to unpack there but it doesn't seem like your burden to carry. Let your coworker display their own insecurities how and where they will. It's unfortunate that work has a certain required social component. Forcing incompatible personalities into close proximity can have catastrophic consequences for group morale and productivity. If she doesn't ease off you will potentially have to take steps. I personally would mention the incident to a supervisor in case of escalation.", "NTA\n\nYeesh. Your cow orker is an awful person. Her questions are intrusive, and her attitude is belligerent. Also, she seems to think that how she leads her life is the way that you should lead your life. \n\nShe is a petty, nasty, awful person. If your cow orkers support her, then they are just as childish, and you should look for another job \n\nbut only after you have a long and serious talk with your first-line supervisor and \n\ngo to Personnel/HR and file an EEO complaint for your coworker creating a hostile working environment. Do NOT let your first-line super keep you from filing that complaint. File the complaint and push it as long and as hard as you can. If necessary, you should seek legal assistance. There are a whole bunch of attorneys out there who love to do EEO work and often pro bono. \n\nGood luck!", "I hate toxic work environments people get to comfortable to behave weird NTA.", "Next time, have a polite insult ready for work or professional situations. \"Bless your heart\" is such a good one and works on a few levels. It's a condescending pat on the head dismissal. It's also defensible on honest grounds, you're saying that the other person meant well (and clearly missed the mark). Bonus points if they don't clearly catch on that is an insult.", "NTA. Your coworkers making fun of you is pathetic.", "If your actives does not affect your work who the she is to tell you otherwise?   I personally believe she may be a little jealous of your situation and your life.  Good living and good luck.", "YTA.\n\nShe's right; that IS why you're single.  You're single because you've chosen to spend your time on your hobbies and interests, rather than dating. And that's a perfectly good and valid choice to be making.\n\nSo why would you tell her to 'fuck off?'", "NTA. Sounds like you have an awesome life! Sorry she's making the work part of it difficult. If this continues, maybe talk to HR or her manager?", "NTA. She had no business saying that. \n\nBut for what it’s worth you sound like you’re the perfect zombie apocalypse partner which frankly should be a consideration in choosing a significant other (not for literal zombies but general emergency preparedness). Can shoot a bow which has more longevity than firearms since arrows are reusable and it’s almost silent, you are probably light on your feet from ballet so the zombies won’t hear you, and you have energy to do all these activities so you will be able to push through and survive. Plus you speak multiple languages.", "Ugh. Sounds like Hannah is marshalling the troops against you. You're NTA, though it's best not to be so confrontational at work, because it can get you into hot water.\n\nI think it's delightful that you have so many interests, and I think Hannah's comments were judgmental, nosy, and completely unwarranted.", "NTA. what a miserable person- clearly envious that you find fulfillment outside of seeking attention from the opposite sex.", "Sounds like an HR visit to me with everyone in volved, its your personal life, what you do with it is YOUR business.  As long as its not illegal or against company policy.", "She's projecting her ass off. NTA.", "there are a LOT of males out there that dream of graceful elves hunting in the woods. a metric FUCKTON of males. NTA\n\nedit typos", "NTA \n\nBut pan flute? Really? 😉", "NTA! You sound like a fun and interesting person! Your coworkers are bitter and boring assholes. Being a boring drone and obsessing about finding a partner is what keeps people single. Most folks, I think, would appreciate a partner with so much energy for learning new things.", "Time to email the HR department :)", "NTA. Don't tell her anything else about your life. Methinks she's jealous of you.", "NTA. And judging by Mr. FOAH and one of my exes, there are at least two guys who like \"woman who runs around in the woods with arrows\" + likes ballet (watching and reading about it, not participating). Your coworker can go jump in a lake 😜", "NTA, you sound cool af. I love interesting people and you are the most interesting person I've heard about in a long time!", "NTA - She sounds jealous. I love that you have such a full life. You’re my new role model!", "NTA - if anything this sounds like she's insecure about it.  She *doesn't* have many (or any?) hobbies and needs a way to feel equal.  So she tries to balance it out by assuming *those hobbies* are the reason you don't have the one thing she does have.  Sad.", "NTA, she’s just jealous you’re living your best life while she’s probably someone with low standards who is bogged down by a loser who could care less about her. Keeping doing you.", "NTA No one has a right to sit in judgment of anyone else. She can FO! I would immediately go to HR and file a complaint against her and especially the twirling idiot. This is high school mean girl bullying.", "NTA. You should also tell her that you don't need a partner to have a personality.", "NTA\n\nShe is the immature one. Honestly it sounds like she felt some insecurity in the fact that you do so much and have a life and have so many talents, and felt the need to knock you down to make herself feel better about that. Her aggression feels like jealousy to me.\n\nHow is having hobbies relieving your high school days? Like you're not allowed to have hobbies after high school? She's saying a lot of weird things and really making a lot of reaches to make you feel bad about something you don't need to feel bad about.  She should probably get a hobby instead of making condescending unsolicited remarks. You had every right to tell her to fuck off.\n\nI'm also pretty sure marital status discrimination is a thing. Like treating someone in a hostile manner because of a different marital status, like they're doing right now to try to demean you for being single, is HR worthy complaint. You were only defending yourself against that.", "NTA. You sound like a fun, vibrant, and appealing person to be around. I imagine you to be very interesting to chat to! She comes across extremely unattractive here despite her implication that you are.", "She certainly earned that FO, but it was kinda dumb of you to not hold your tongue with a co-worker. You could apologize for your language but let her know that her desire to help you with something you don't see as a problem is misplaced. \nJust to keep the peace at work.\nLearn your lesson and don't share so much with her. Find ways to change the subject. She probably loves talking about her wonderful life.", "Let me make sure I understand: she recruited a bunch of Mean Girls to help her bully you, and she says that *you're* trying to relive high school?\n\nNTA", "Partner are usually found in places like that. And the best kind actually. Cause you already have a thing you both like. NTA.", "NTA - This lady screams insecurity and is literally starting a high school clic over it. She’s pushing her own thoughts of herself onto you, to make her feel better. \n\nAnd let’s make one thing clear - any man with his head on his shoulders would be obsessed with a girl with as many hobbies and passions as you. \n\nYou sound like you enjoy life to the fullest and I love that. Keep doing your thing !", "Fwiw, the right man will love that about you. My husband adores that I’m busy and I have hobbies. It gives us things to discuss and we enjoy the times we come back together. \n\nOh. \n\nNTA.", "Poor lady, she caught a case of the jealously. \n\nImpressive hobbies!", "OMG.  I'm picturing OP leaping gracefully through the woods with a quiver while playing a pan flute, only stopping to greet me in Italian.  I think I'm in love now.", "NTA. Report your coworker for hostile workplace harassment.", "NTA at all. Plus, doing activities like that are great ways to meet people that share similar interests! So not only is she out of line and an AH, she also has no idea what the hell she’s talking about.", "I love the way your life sounds, don’t let anyone make you feel bad for being active. You should probably report them to HR tho. Also, single women are the happiest demographic of people so I wouldn’t be in a rush to compromise my life for a relationship if I were you.", "For someone complaining about reliving high school days, she's doing a pretty good job of acting like she's in high school with her \"clique\" 😂", "NTA your coworkers are the childish ones, they clearly never moved past their high school bully days.", "NTA. You should sleep with her husband.", "Tell her to fuck off again! Your Not The Ass! There’s nothing wrong with having multiple activities. I wouldn’t give her OR her followers the time of day… your NTA", "NTA and you sound like you’ve got something’s figured out! One of my girlfriends is like that and she is such a good influence on me, so I’m predisposed to think you’re probably an awesome person to know too. Definitely get ahead of her with HR or your manager if you can. Anyone who gets to be in your life will be lucky - friend, family, whatever.", "I am on the verge as the f*** comment at work is a bit too much (for the both of you!) but she also shouldn’t pry into your personal life. \n\nI feel like it’s most likely a misunderstanding? Perhaps she saw you as a better friend than you saw her? So she thought it was okay to make a comment like that?", "NTA. She in an AH and is creating a hostile work environment.", "[removed]", "Having hobbies is one way people meet their partners. I guess you could've been more polite/not used an f-bomb but you weren't wrong to tell her to mind her own business.\n\nNTA", "lol WTF? You sound great. People who think everyone needs a relationship as weird and gross. Let people live their lives.\n\nAlso, why these people think you would want a man who doesn't like *you*... it's not your fault she thinks you have to give up your life in exchange for some mediocre dude.\n\nNTA, of course.", "I got sick of ppl trying to set me up w others and blatantly said, \"I don't want to date bc that usually involves sex\" I was reported for \"being inappropriate \". I got in Trouble over it. Those who complained cuss/talk vulgar and sexually on a regular basis. Unreal.\n\nNTA", "NTA.\n\nPlus, what she is doing, is creating a hostile work environment, as well as harassing you. This is not only unethical, it is illegal. File a complaint with HR, and document everything. Keep your own copies of all documentation and communication. Good luck!", "NTA. I think her “this is why you’re single” comment wasn’t great, but not as awful as her comments after you asked her about it.", "NTA - Also I know plenty of guys who consider your interests a huge plus, so if you wanted someone, I'm sure you'd have someone.", "NTA, \n\nI think someone is getting a little bit annoyed that she doesn't have any hobbies in her life. But people taking sides on that matter? Her side on top of that? I'm sorry for you but it seems people in your office are complete idiots. \n\nYou did not overreact IMO but I think the mood in the workplace is going to be bad!", "Nta. Im jealous, though. I wish there was a beginners ballet class for adults where I live.", "You’re NTA but here’s a better answer to her rudeness: shrug, say OK, and walk away. She wanted a reaction from you and she got it. Next time, deprive her.", "LOL! #1 fan!", "NTA.\n\n>I asked her about that and she just said I’m trying to relieve my high school days and no guy would want a woman that runs around in the woods with arrows and then pounces like a child in a tutu in adult beginners ballet class.\n\nI'm happily married, but this is EXACTLY the kind of woman I'd otherwise want to be with!", "Not that you should care what a man thinks but I’m one and people that have things going on in their life are way more interesting and attractive.  Volunteering is especially cool.  Again not that you would ever do it to impress someone else or should care how it looks but it’s pretty amazing.  I can’t imagine thinking the opposite.  Does she think it’s attractive if you sit at home waiting for your phone to ring to have a man ‘rescue’ you? Stop with that noise.", "NTA\n\nShe just sounds like someone actually going out and doing something with their life like having a lot of hobbies is challenging her world view. Especially with that \"trying to relieve highschool\" comment. Like she gave up on life and is deeply bothered by you.\n\nI've also never, ever, *everrrrrr* heard somebody say they were \"trying to keep him/her from being single forever!!\" that actually had good intentions and weren't just giving a thinly veiled backhanded excuse for way over stepping boundaries and being a massive dickhole.\n\nHell aren't hobby groups and classes constantly recommended as a great way to make friends and meet people? Does she truly believe you have to be a boring person and only go out to pubs if you want to fit in and/or find a partner?", "NTA, but unfortunately she is now trying to play the victim.  If you're savvy with your wording, you can insult her in the sweetest way possible,  just like she's doing to you. Something like, \"I'm single because I (emphasis on\"I\") don't need a partner to complete me. I'd be happy to help you find something you can be good at, too.\"", "NTA\n\nOP sounds so much like she's having a blast!", "NTA. It’s literally none of her business. I don’t know if you’ve got HR where you work but you should get as much of it documented as you can. If this doesn’t get handled, you may as well just get a new job. Work turning into high school sounds like a nightmare.", "WTH no, NTA.\n\nAnd this is such a a weird take. And coming from a guy only a few years older than you are, I would much rather date someone that had hobbies, especially active ones, than most people that just sit at home all of the time and expect to be with their partner every single minute outside of work.  And I think this recent culture shift of being with your SO every possible second, and in constant contact is one of the biggest reasons for the increase in divorce/ended relationships. Because people become to dependent on their SO, do not have any outlet to relieve stress outside of the relationship or work. And it leads to people blowing up on their SO, because they take the stress from work home, and can't get away from their SO without argument and things spiral quickly.", "You're NTA. It sounds like you're surrounded by immature A-Hs,  but you are not one of them.", "NTA\n\nWhat is her fucking problem???", "NTA\n\nThis is bullying, WTAF, I will never understand why grown people would act like teenagers toward one another.  Who cares if you are learning so many cool new things.  She may be jealous because she can't do these things for whatever reason.  Maybe projecting her insecurities on you to help her feel better. \n\nKeep learning, keep volunteering, if you want a partner, you will meet them doing what you love.  Instead of a Joe Shmo at the local pub.", "NTA but maybe you could have handled it in a way that better served you… like saying fuck off with a cheeky smile or what do you spend time your time doing? In the kitchen cooking to win over men? Obviously rather crass and a dig at her being old fashioned.", "NTA but keep a record of her shenanigans.\n\nMost people likely know how she is, but people like that can still make you look bad with the right paper trail. so keep one of your own.\n\nShe's clearly creating a hostile work environment, and she tried to get a rise out of you to say something to her. My advice is to ignore her. You may not be TA, but this person is actively fucking with you.", "NTA\n\nBut take this RIGHT to HR for harassment, she is creating a hostile work environment over something that is none of her damn business. *Your* dating life isn't her concern unless you *asked* for her opinion, and you didn't. \n\nFor the record, you sound badass.", "Report this to HR. She is way too invested in your personal life and way too comfortable judging you and sharing your private information. I know you were shocked, but your response was unprofessional. Telling someone they are being really offensive and you don't want to ever discuss you private life again is fine. Telling someone to fuck off? Not so much. \n\nYou are NTA, but your response made it more difficult for others to see you as the wronged party, even though you were.", "NTA.  When people complain they can't meet people they are inevitably told to get a hobby to get out there and meet people with similar interests.\n\nPersonally, I don't know where you will find and Italian dancer who loves Zamfir, swimming and archery, but knock yourself out!\n\nShe's just jelly you have so much energy.", "NTA.  And you’re more likely to meet someone decent at one of the activities you do than at a pub.  I don’t think “not being single” should be a goal though.", "She has a point", "NTA - that is a fuck off moment if i'd ever heard it.  If you were lamenting being single that'd be one thing, but how you spend your free time is none of her concern.  Coincidentally, if you weren't doing all sorts of hobbies and were complaining about being single, people would tell you to pick up some hobbies to meet new people.\n\nTell her the internet wants her to fuck all the way off as well.\n\nAlso, consider taking this hostility to HR, you have rights to work in a harassment-free environment.", "NTA . Your coworkers are behaving childish and click-y. In some offices this would qualify as bullying and would need to be reported to HR. If that's not a reasonable option for you, just ignore and carry on.", "NTA - she probably has zero hobbies. It’s amazing you enjoy so many!!! **** her", "NTA. Tell her you're sorry for her that her life is fucking boring that she needs to pry into others and then bitch about them. I guess the lesson here is keep your personal life personal. BTW, I'm a woman and I love shooting. Your hobbies sound wonderful. Do you. You rock.", "NTA. Most men actually like women with a lot of hobbies! But seriously, live your life and be happy. She is just a crabby nosy coworker who probably has zero hobbies other than sitting on the couch to watch junk TV. She’s just jealous.", "“I’m okay with being single” or “I’m dating someone” or literally anything else is going to keep the peace with a nosy idiot and her office cabal better than “fuck off” and storming out. Not the asshole, but bad tact. And it appears to have struck a nerve based on your reaction, so maybe you’ve let on to her about being frustrated at being single more than you realize.", "NTA, your life is none of her business. You didn't ask for any of her advice, and she was being nosy. Her and her little Gossip Girls Club can literally shove it. If anything, telling her to \"fuck off\" was polite.", "NTA, hey if you’re doing something you love who honestly cares what your coworkers think of you? As long as you’re living a happy life filled with things you enjoy doesn’t mean nothing just because you’re single. Also if your coworkers mocking your hobbies is continuing to bother you and your boss isn’t doing anything maybe take it up to hr and report workplace bullying and harassment or find a different job where coworkers will embrace the many hobbies you do.", "NTA- They're jelly they aren't as capable as you. You're Amazing! You're doing something productive instead of nothing like them.  The way they mock you is so childish, let them be. They're just showin a fool of themselves.", "NTA\n\nIt honestly sounds like she’s the one recreating high school with the petty gossip and rude remarks to you. Office drama can be so similar to high school gossip it’s ridiculous, you’re adults behave like it.", "NTA.  She sounds manipulative and bully-ish.", "This. She’s crossed the line both professionally and personally, and it’s important to try to nip that in the bud immediately and create a paper trail. Also, your hobbies sound super cool and anyone mocking them is probably jealous.", "This answer should be pinned. As a co-worker, she had no right to pry so hard and pass judgment after giving unsolicited advice. As far as whining about OP being immature, it sounds like Hannah was looking at her own reflection. These are seriously middle school  mean girl tactics.", "100%.  She sounds very threatened because comparatively I bet she doesn’t make good use of her time at all.  But it’s completely inappropriate for the workplace and needs to be addressed.\n  \nOP, I think all your hobbies would make you a really interesting, dimensional and fun person to get to know, platonic or otherwise.", "You are wrong about 'hostile workplace environment'. It has a legal definition and OP situation isn't covered by it. And if OP brought that problem to HR under a hostile workplace environment, they won't take her seriously.", "Report the %}%** to HR!", "This is absolutely correct. Under the guise of friendship, she queried you for personal information that she could use for sabotage. She did so deliberately as a power play as she made you a gossip target. The other women are now fearful of her and falling in line with displays of loyalty. \nTo describe this as toxic is an understatement. You have to detail in writing exactly what is happening and inform either HR or the head of your division or the head of the company. If they know what’s good for the company and for them, they will fire her. Otherwise, you have a good harassment lawsuit against the company and the woman personally.", "or just move on to a better job and leave that toxic soup behind.  OP has so many skills, talents, and hobbies that employers should be clamoring for her.  If OP's current workplace tolerates bulling so much that people feel emboldened to do bad ballerina dances in the office, they don't deserve to have top-notch employees.", "Are hostile work environments really a thing? Or is this new? I’ve been through so many similar situations and HR stayed the fuck away, saying it was interpersonal.", "I somehow can’t take this one at face value. Would love to hear the coworkers’ perspectives.", "Meeting through hobbies is a thing! That’s the part that threw me. Not only is the coworker a nosy ass, she’s also dead wrong. Having a bunch of hobbies is a great way to meet someone special! \n\nBut whether or not you want to is entirely your business, and should not be discussed by anyone at your place of business.\n\nHer only hobbies are probably whining and doomscrolling, so your hobbies make her feel inadequate. That’s likely why she’s mocking you and getting others to hang up on you. What a jerk.", "They met their partners through their parents at church like the Lord intended, hobbies are for heathens!", "Oh, I think other women might have the full explanation, they just don't like the fact OP is living her life as she pleases instead of fulfilling societal expectations. I can also see those women complaining about their husbands being useless, but hey, at least they are married, and why does OP think she's better than them?\n\nI might be completely wrong here, but that is the mental image I had while reading the post.", "You made me realize I'm not bitter or insecure. I was reading OPs post thinking to myself how well-rounded and intriguing OP must be, and I would love to just sit and talk with OP to find out why she chose these hobbies, and she must be a blast to take to a ren-faire. Nosy co-worker is a total jealous snobby a-hole.", "Also, you sound like a super interesting and fun person!!! You'd be a treat to date or just be friends with!", "I also find it hilarious that she thinks having hobbies makes people single. \n\nHaving hobbies increases your chances of meeting someone who enjoys the same things as you. Not to mention gives you more to talk about with other people.", "The idea that she’s getting others involved is crazy to me. This isn’t a high school cafeteria ffs.", "Totes. OP is being harassed and bullied. Talk about high school.", "It isn't, but it also isn't always a damaging thing.\n\nComing from a Program Manager that has said that to bosses and coworkers before. Depends very heavily on work environment and the people involved.\n\nI did get a talking to by HR, but that was it.", "It isn't, but it also isn't always a damaging thing.\n\nComing from a Program Manager that has said that to bosses and coworkers before. Depends very heavily on work environment and the people involved.\n\nI did get a talking to by HR, but that was it.,", "57% of single US adults are not looking to date. Statistically it's perfectly normal.\n\nBut socially if you want to stay single there's so much pressure to make you feel bad about it! My theory is that it's the other 43% of single people (and their parents) that don't want 57% of the \"available\" dating pool to vanish.\n\nIt's been changing a lot in the last decade but it has a way to go. It doesn't feel nearly as weird eating out or going to a movie by myself as it used to. The stigma of being a perpetual bachelorette/bachelor is going to continue fading through the 2020s because it's the way the world is going.\n\n&#x200B;\n\n \"Recent data predicts that 45% of women between ages 25 and 44 will be single and childless by the time 2030 rolls around.\"    \n\n&#x200B;\n\nCompare that to the current stat that 86% of women are mothers by 45.", "I mean, I don’t think saying “fuck off” to someone who literally just used the same word is really an asshole move the way it could be in any other context", "Right. She jumped from victim to aggressor in a hot second.", "I'm so confused by responses like this. The coworker didn't ONLY make a comment about OP being single, she went on to demean and belittle OP's hobbies and place a strangely presumptuous judgment about OP's romantic prospects which are not the coworker's business, not to mention outdated as shit and insanely presumptuous to even be judging someone else on whether they're doing the right things to win a husband. That stance and coworker's doubling down on the unsolicited critique make her the AH.", "What bothers me is if she supposedly swears a lot, then a simple \"fuck off\" shouldn't have ruffled her feathers.", "NTA. I hate the Reddit trend of giving people a \nY T A when they clearly aren’t the asshole. No, she is not the asshole for responding in kind. The co worker swore first so she’d have a hard time getting OP in trouble without giving herself away. \nI think “f*ck off” was pretty diplomatic, considering.", "I don't see how OP overreacted. OP asked what the coworker's comment 'this is why you're single' meant and the coworker went off on a strangely judgmental and misplaced critique about OP, who is in her 30's, wanting to relive high school and went into a presumptuous stance about the affect that is having on romantic prospects which is really gross and extremely outdated. The statements about the hobbies were ALSO condescending and belittling, as icing on the cake. \n\nAvoiding curse words in a work setting would of course have been better but in light of all that you think there are no AHs here?", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "The people mocking her are the ones who are being immature. They sound like middle school mean girls. OP’s hobbies have no bearing on their lives whatsoever. It’s real “look at that bitch eating crackers” energy. Adults who act like this are pathetic.", "You go be you. You fabulous thing xx", "[removed]", "Eh I mean you're right, this does not remotely meet the standard of hostile work environment. But it is bullying, which is something else HR can and depending on the company will help address. And anyway we're all quite used to employees throwing that term around with a colloquial meaning when it doesn't apply legally, so it's not like HR would necessarily see \"hostile work environment\" and refuse to even take it seriously just because the employee is misusing that specific term. An employee comes to me and says \"my coworker is creating a hostile work environment by doing XYZ\", I'm perfectly capable of saying \"no they're not because that's not what that term means, but what they're doing is still not OK so let's talk about how to handle the stuff they're doing.\" \n\nI mean some HR folks would brush her off for that, but they're shitty people and bad HR professionals. \n\nLike, I've literally got a meeting next week with an employee to talk about how she's feeling bullied in her department and see what can be done about it. Just because there's no legal angle, doesn't mean HR inherently won't give a fuck.\n\nI would, however, suggest OP frame it as a bullying concern, rather than claiming hostile work environment, and start with her manager before going straight to HR. Part of managing includes refereeing stupid interpersonal bullshit, so let the manager do their job and if they can't or won't, then take it to HR. (In case it's unclear, by stupid bullshit I mean the middle school mean girls masquerading as adult professionals, not OP.)", "I do not work in HR and maybe 'hostile work environment' refers to a specific definition that doesn't belong here. And sure, HR might put their hands up and stay away. But if one person finds themselves being ridiculed by masses of coworkers, that is minimally a dysfunctional and toxic work environment that HR/management should be aware of. OP having sworn at her coworker isn't great; it's gonna make the situation seem more even-sided and as you noted interpersonal, probably leading to some ugly conflict resolution involving them both. But if I were OP, this would not be a tennable situation for me.", "Yes, and you dealt with a shitty HR department. The job I work has clear cut lines and policies about situations like this.", "This kind of tracks, HR does not exist to protect the employees, they are only there to protect the company.", "That’s what I was about to say!\nBut it’s no one’s business if she stays single or not! \nNTA OP, and I wish I was someplace with that many options!", "I hope this is a joke, cause this is funny 😆", "Now I want a shirt that says hobbies for heathens", "I would see if any of these hobbies fit into MY schedule...  sheesh, this OP is VERY active!! (Compliment)", "Yeah running round the woods with arrows sounds fun to me", "Indeed! It is an interesting statistic, I'm curious what it's going to do to the US population over time. But regardless, OP can do whatever she wants and shouldn't be shamed for wanting to enjoy her hobbies and platonic relationships.", "Why do you view fighting fire with fire as a solution? Why be angry at all?", "You are the type to victim-blame a lot, aren’t you?", "OP's \"fuck off\" response isn't any better, and now the AH coworker is turning other coworkers against OP because OP didn't respond in a remotely  professional manner in the workplace.  I still think ESH.", "Swearing in general and telling a coworker to \"fuck off\" aren't the same thing.", "It sounds to me she was making a joke about how busy her schedule was.\n\nYou used a lot of words to assume a lot of stuff.\n\nAnd yeah, you don't tell people to fuck off at work. If making a small joke like that is past the line, fuck off can't even see it anymore.", "Co-worker cursed first too so she should have been able to take it.", "Yup, these are grown-ass people acting goofy as hell. OP's dating life is none of their business. OP isn't crying about it. What's the problem?", "Upvoted", "Opinions are like buttholes, only listen to the ones with a colostomy bag", "Comment stealing bot", "I think this is a recent phenomena though. I’ve been working for almost 20 years and it’s maybe only my current org that I could feel comfortable taking this kind of thing to. The work culture has changed drastically since I started.", "Exactly. This is what I have always been told. I wouldn’t ever fully trust them. Nothing against them personally, but they’re not there to help me.", "I can say this is shrodingers sarcasm - both a joke and yet somehow completely serious if you ask my relatives.", "and doing ballet. frigging 20/10 on the elf scale", "So it's professional to meddle in someone's love life?", "They aren't tit for tat - coworker was waaaay out of bounds before OP used the curseword - AND coworker had already thrown the f-word around with 'How many hobbies do you fucking have?'", "Coworker swears around the office. You think that’s professional?", "Oh wait I missed the high school paragraph. I am wrong here.", "Ballet terrifies me honestly. I've seen their feet", "Nope, and OP has sunk to coworker's level with their unprofessional response. OP had the chance to show coworker was the only AH, but they fucked it up.", "LOL, you can do ballet without having to use toe shoes, especially if it is beginner ballet :)", "OP responded to an aggressor in the way that they understood and/or deserved. \n\nJust because nobody reined the coworker in during her formative and subsequent years, it doesn’t mean that she should continue to live the way she does.\n\nNow all that’s left is to hope that HR does their job and removes the coworker.\n\nBut I guess you would sympathise with an aggressor and judge someone for not being a perfect victim.", "Oh thank god. I'm so glad it turns out I didn't know about ballet"]}