{"id": 28351, "submission_id": "171jdep", "title": "AITA for telling my (35) fiancé that I don’t want us to have more children at the moment cause we just got custody of his daughter?", "selftext": "Me (30) my Fiancé (35) which got custody of his (11 year old ) recently and  I’m currently in nursing school and I don’t work.  I told my fiancé that I don’t want us to have any more children until I get done with school because having a newborn and his non independent child would be rough on me . He think I don’t want to have no more children because his daughter is here now and I did state to him that I’ll be fine with raising one child while I’m in school but not two. He also feels like I can handle it cause I don’t work and just go to school.", "created_utc": 1696615642, "permalink": "/r/AmItheAsshole/comments/171jdep/aita_for_telling_my_35_fiancé_that_i_dont_want_us/", "score": 35, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Might make me the asshole cause I don’t want to have more children now\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA get on a birth control that he can’t tamper with. The shot or the implant in the arm. Use condoms as back up. No condom, no sex. Tell him you’re just not ready for a newborn yet.", "NTA - but he gets the side eye cause it feels like if you ever did have a newborn, he’d put 100% of the child rearing on you.", "NTA. School is a lot of work.", ">He also feels like I can handle it cause I don’t work and just go to school\n\n\"And that's great. But regardless of what you *feel*, I'm telling you that I can't.\"\nNTA", "NTA.\n\nYour fiance is a ridiculous person, and he should take care of his own kid if it is so easy. \n\nA newborn would not be easy to handle while you are in school. The fact that he doesn't know that makes me think he didn't do much of the work of raising the child he already has. \n\nDo not get pregnant now. Be absolutely certain about your birth control. Make sure that he can't mess with it. If you get pregnant now, it could make it very difficult for you to stay in school. Would he want his children in daycare while you go to class? Something tells me that he would try to get you to drop out or postpone your education. Do not do that. \n\nUnder no circumstances should you postpone your education. Do not allow him to bully you into staying at home. You can have a baby when you are done with school, or when you have had a few years in your profession. Please protect yourself from becoming dependent on this man when he already seems to be disregarding your education and career plans in favor of whatever he wants.", "NTA\n\n Tell him he can chose between having his daughter there or you guys having a kid. And then find a better boyfriend cause this one is an A H", "So when would you ever get to be a nurse?  He is asking you to either give up your dream or to agree to making things triple hard on yourself, does he love you or just want a bang nanny?", "NTA.  You didn’t sign up to be a brood mare.  You can make the call when to spawn.", "NTA, you don't want to have another child now. Nothing to discuss more.\n\nBut OP... his statement about you going \"only to school\" sounds very dismissive. Also I got the feeling that while HE got the custody, he expects YOU to raise this child. Be aware of these red flags.", "HE feels you can handle it? And perhaps then never get a career of your own?   \nWow, just wow. You are 30, you can pick up this discussion in 5 years or so and still be able to have 3 or more kids.   \nNTA", "When will you graduate? Can it be that he's hearing your biological clock ticking? Do you really want children later or is this just an excuse? NTA for being honest about children at the moment; but be honest about the future, too, so he can make a decision about whether to continue the relationship.", "NTA- He's being very inconsiderate of you. Schooling can be just as hard as a full-time job. \n\nHe might definitely put 100 percent of the child rearing on you if you have a child with him, and it seems he probably already has with you regarding his daughter.\n\nI'm not normally one to say to leave someone, but he's being dismissive of your dreams and the life you want to accomplish.", "Well it seems like you already have two kids. NTA for voicing your concerns.", "Nursing school is a job in itself 100%. To throw the idea of carrying and raising a newborn while studying just to appease this man in heat won't do you any good. Focus on your education and secure a position that has maternity leave if you want to consider it in the future. Nta", "NTA. You know what you can handle, and what you are willing to handle. He can \"handle\" it himself if he wants more kids. If he can show you that he can take care of the kid he already has, without relying on you at all, then perhaps you can reconsider.", "You better than me if I had no children I wouldn’t even date a man with children! But NTA your definitely correct luckily she’s 11 and not like 2 especially with your schooling it would be stressful. Honestly as a precaution I’d take some sort of birth control men are weird and he may try to get you pregnant any way", "NTA - you're not a baby making machine.  No matter how much he wants to, if you say no, it's no.  The flip scenario would be true as well (you wanting one now and him no).\n\nGood on you for thinking it through rather agreeing under that type of pressure.", "NTA\n\nYou do see the red flag right?", "tell him you could handle it if he hires a nanny.", ">He also feels like I can handle it cause I don’t work and just go to school.\n\nYeah anyone's opinion on what you can handle, ignore them. People should really only speak to their own feelings and limits.  Seems like a great time to see if he's a shit dad before you opt into making a kid with him.\n\nNTA", "He’s not respecting your career. Why would you make completing school so much harder by having a baby?  Finish school and get a little experience. Nursing is the perfect career to stay up to date and go part time if you want while raising a family. \n\nI’m concerned your fiancé is trying to keep you at home.", "Nta you have 2 kids, one of whom is an infant.  Not wanting 3 is fine.", "What, does he just think you're going to school for fun and when you finish, you're just gunna hang out and be content knowing you could apply to be a nurse somewhere if you wanted to? I don't understand his logic... Regardless, if you don't want another child right now for *any* reason, then that's it - period.\n\nNTA.", "NTA, is he actively trying to sabotage your education? He expects you to be pregnant, have a baby, and then raise that baby while going to school.", "NTA nursing school is a huge time commitment and so is caring for a child. Adding a baby into the mix would be an even bigger time and responsibility commitment.\n\nDo you think it could be a misunderstanding? If you do want to have a baby with him when not in nursing school is that clear to him? Perhaps he wants another child and is worried that it will never happen if it doesn’t happen now. You guys definitely should talk more in detail about this, your plans and goals and see if these still align before you’re married", "Nta. He thinks you can handle this? Wow he knows more about you then you. Sure that he says something stupid because he wouldn't be a stay at home dad. The audacity.", "NTA - you have an excellent point and this absolutely needs to be worked out between the two of you before you get married.", "Tell him to do the homework for you on just one of your classes and pretend to do your clinical rotations as well. NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe (30) my Fiancé (35) which got custody of his (11 year old ) recently and  I’m currently in nursing school and I don’t work.  I told my fiancé that I don’t want us to have any more children until I get done with school because having a newborn and his non independent child would be rough on me . He think I don’t want to have no more children because his daughter is here now and I did state to him that I’ll be fine with raising one child while I’m in school but not two. He also feels like I can handle it cause I don’t work and just go to school.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  While having a child is a couple decision, both need to be on board with the timing.  You, clearly, are not and he needs to respect that.  You need to have a discussion and, if you know when you want to have a child, that can be communicated to make it clear that this is not \"no\" it's \"not yet\".", "NTA. Presumably an 11 year old can dress themselves and fix a snack and is less likely to drown in the toilet, or electrocute themselves at home. Also, it's easier to find a baby sitter for an 11 year old since you know they can tell you if anything goes wrong/weird and can dial a phone in an emergency. \n\n11 year olds have their own challenges, but babies need constant supervision and interrupt your sleep. \n\nYou are not saying no forever, you're saying \"not until things settle down\" I am side eyeing the dismissal of your schooling as \"not work.\" Pretty sure learning how to care for people in a medical setting requires some focus.", "NTA being in school whole you have one child is already going to be a big adjustment. Being in school and dealing with a newborn is a whole other nightmare. I did it. I made it through, but it sucked a lot. You have time to let things settle and finish school before having more children. Don't let him pressure you into it.", "NTA. He should be more concerned with the child he has than theoretical children of the future.", "NTA. With classes, clinicals, and practicum, he would have to step up 24/7 to watch the newborn. Is he willing to do that? Or does he want you to give up your goal of becoming a nurse?", "Lock down your birth control, like.. yesterday. You, OP would be the one to carry the baby and take care of it.\n\nIf you don’t want to do it, you don’t have to. But make sure you aren’t put into a position where you have to make some hard decisions. NTA", "Your NTA. But he is. He doesn’t get to decide what you feel comfortable doing. He doesn’t get to decide what you feel you are able to handle. Having an 11 yo who is fully dependent on you is NOT easy. Children are a 2 yes 1 no situation. You deserve an education and degree you are proud of.", "NTA", "NTA!!!! Nursing school is  a very vigorous program. It’s hard on students who don’t have kids and the ones with kids. It’s not going to be easy bringing a newborn in the mix. Nursing school always brings a ring, a baby, or a divorce. I don’t know why it’s like that.", "He may feel like you could “handle it,” but what’s his role, exactly? Is he just going to go back to work and make you do all the childcare? Taking some time to finish school and raise his daughter is perfectly reasonable. If I were you, I wouldn’t rely on condoms to prevent pregnancy. NTA", "NTA.\n\nNursing school is no joke, and neither is being a nurse. There's nothing wrong with wanting to focus on getting your career off the ground. Just be absolutely clear with what you're saying so he can't misunderstand; in this case, that you don't want a new baby *right now*, not that you don't want one *ever*.", "NTA. Pls don’t do it until you are ready and stable AND have a job", "He seems to be putting 100% of raising *his* 11 year old on her already", "Ooooohhhh…. I wish I could give this a HUNDRED upvotes! Good freaking catch! This is totally true or he wouldn’t have the attitude he has."]}