{"id": 28358, "submission_id": "171jh3e", "title": "AITA for not wanting to pay for my sister's pregnancy expenses?", "selftext": "I'm 32 m and she's 27 f.\n\nThis story starts two months ago \n\nNeither her or her boyfriend are economically stable and she got her pregnancy test positive. Their decision is to keep it apparently, despite the less than ideal circumstances. \n\nShe asked our parents to pay for the expenses but they are also not in a good spot financially (I often lend them money and then they return it after a few months), so they asked me to borrow money from me in order to help her\n\nI told my sister that she should not put our parents in that spot knowing the troubles they already have.\n\nBut against my better judgment, I sent money. \nThe first amount was already double of what my parents usually ask me and now I just got another request of the same amount\n\nI'll be straight up honest here, I don't think I'll ever see that money back and I don't wanna pay anymore than I already did. I said it openly and clearly \n\nNow of course I'm the devil himself for not wanting to give away a chunk of my salary every month for something that I should not be held responsible for\n\nSo, aita?", "created_utc": 1696615885, "permalink": "/r/AmItheAsshole/comments/171jh3e/aita_for_not_wanting_to_pay_for_my_sisters/", "score": 15, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The action I took is refusing to give more money, and that makes me an ah according to many family members.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. Your sister is choosing to have the baby, so she needs to deal with the consequences. \n\nUnfortunately, if that means she cannot support herself and the baby, she needs to consider other ways in which she can help give the baby a good life, like maybe an open adoption?\n\nOf course, if you were to say something like that straight out, she would be right to call you an AH.  But if you do not send her money and then she asks, \"What am I supposed to do now?\" Then... you could tactfully suggest something like that.\n\nWhatever you do, if you keep sending money she will probably guilt you into continuing to send money for the rest of that kid's life.\n\nYou're in a terrible situation, no doubt about that. I wish you the best.", "NTA. It sounds like they are having the kid because they figured other people would pay for it.", "If they think that pregnancy is expensive, wait until they find out how much it costs to raise a child for 18 years. Cut them off because you’re not responsible for paying for their lack of better judgment. \n\nYour sister could also consider a private adoption that may help cover the expenses and more if she comes to her senses and realize she’s not in a position to raise a child in poverty. NTA", "NTA. Having boundaries is hard and you'll get called an asshole, but is' because people dont' want to deal with the consequences of their own choices. This is compounded by the fact a lot of people seem to think that getting pregnant is a get out of jail free card, and they are 'owed' support for the sake of the baby. Nope to that.", "NTA.  Your Sis and her guy are adults, time for them to act like it", "NTA, My mother pulled something similar and I stopped speaking to her for 7 months. Sometimes you really have to put your foot down, just because you have extra money and no kids that does not mean you have to spread that freedom around.", "NTA", "NTA if they can’t afford the costs of pregnancy they are not going to be able to afford the child. They both need to get second jobs now before the baby is born or consider other options like adoption.", "NTA not your kid not your problem. If your sis and her baby daddy can't  afford a kid then maybe they shouldn't be having one. You don't owe them YOUR hard earned money for their mistakes", "Cut all those people off.  You aren’t a bank and NTA.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI'm 32 m and she's 27 f.\n\nThis story starts two months ago \n\nNeither her or her boyfriend are economically stable and she got her pregnancy test positive. Their decision is to keep it apparently, despite the less than ideal circumstances. \n\nShe asked our parents to pay for the expenses but they are also not in a good spot financially (I often lend them money and then they return it after a few months), so they asked me to borrow money from me in order to help her\n\nI told my sister that she should not put our parents in that spot knowing the troubles they already have.\n\nBut against my better judgment, I sent money. \nThe first amount was already double of what my parents usually ask me and now I just got another request of the same amount\n\nI'll be straight up honest here, I don't think I'll ever see that money back and I don't wanna pay anymore than I already did. I said it openly and clearly \n\nNow of course I'm the devil himself for not wanting to give away a chunk of my salary every month for something that I should not be held responsible for\n\nSo, aita?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA, it's her responsibility and she is a grown adult who conceived this child. I wouldn't have even sent the initial money but that's just me", "…so you’re gonna be paying for that kid for 18 years. they expect you to cover college as well? better start saving. \n\ni’d rather be the devil tbh. nta.", "Ehh. \n\nI'm going to go against the grain and say soft YTA. \n\nThe way I see it, that's your niece or nephew. I have four brothers/brother-in-laws. I'm financially better off than all of them. If I was in a situation where I could help pay for their kids medical expenses when they were financially strapped without sacrificing much to my own well-being, I think the ethically correct thing is to try to help as much as you can. Also, prenatal care is SO important.  But also I would be making sure they're taking steps to become more financially stable and have a plan to pay me back. And if they fail at becoming financially stable for too long then I would call CPS. I also would not just give them money, but I would pay their bills directly."]}