{"id": 28389, "submission_id": "171u6u3", "title": "AITA for wanting my gf to stop setting her alarm extra early only to keep hitting snooze?", "selftext": "I (33M) and my gf (32F) moved in together a couple of months ago, and everything has been good so far except for one thing. We both have to be at work at 8 - my job is less than a mile away so I get up at 7, hers is about a half-hour commute so she naturally gets up earlier. \n\nBut here's the thing, instead of doing it the usual way, she will set her alarm for 5:30 or 5:40 and then keep hitting snooze until 6:30, or she'll set it for 5:30 and then reset it a half-hour later, and so on. \n\nSometimes she'll get up at 5:30 and lay in bed looking at news or memes or whatever on her phone, and when she does that she usually falls back asleep with no alarm set, until either I wake her up or she wakes up to my alarm in a panic. The snooze button or the reset are annoying, but this one is the worst, because when she does it, I am now automatically lying there awake until she either gets out of bed or (usually) falls back asleep so I can wake her up, because if I do try to go back to sleep, that's in the back of my mind and I'm all restless.\n\nAnyway, this is killing me and I am dog tired at the start of every morning and usually throughout the day. I asked her why she does it that way, and she said she was used to it from before, when she used to wake up and run or go to the gym in the morning before work. I told her, well you don't go to the gym in the morning now, so what are you doing? All this does is wake us both up. She didn't like that, and admittedly I may have been a little gruff because this was at the start of the morning when I was tired and at my worst. But I kind of think I've got a point. So AITA?", "created_utc": 1696643338, "permalink": "/r/AmItheAsshole/comments/171u6u3/aita_for_wanting_my_gf_to_stop_setting_her_alarm/", "score": 65, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I got upset because my girlfriend always sets her alarm extra early in the morning and snoozes it several times before actually getting up, and I told her it is just killing my sleep. I personally think she's the one doing something abnormal, but she did not like that I brought it up and kind of grumbled at her about it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA but beware: I'm married to a \"snoozer\" and it doesn't get better. I'll say snoozing for an hour is ridiculous, hit snooze once (+10 minutes) but then get up. At 30-something you're still quite young but also set in your ways already so she might not change anymore.", "NTA. Setting her alarm for hours before she needs to wake up, and then snoozing that alarm, is incredibly inconsiderate - not only is she waking herself up each time an alarm goes off but she is also likely waking you up, which is unnecessary. While it’s her choice, how she wakes up, it is inconsiderate of her to be disturbing you each morning.  \nI would recommend talking with your girlfriend about finding a solution together that works for both of you, such as setting an alarm for around 6:00am and waking up for the day then.", "Tell her to get a watch or something. I have an Apple Watch and if I set an alarm on it it’ll vibrate to wake me up but there is no noise so it doesn’t wake up my roommate.", "Nta no. She isn't in her own room anymore.  She's waking you up and that's rude as hell.\n\nMy rule is 'if *I'm* awake bc of your alarm, then *you're* awake'  You wake up? Light goes on, loud ass music is played.", "NTA, and this is coming from a person who used to do exactly that and wake up my 7 roommates in college :”””) there is genuinely no need to be a morning menace with alarms when you live with someone else. she can 110% adapt to having just one alarm at the time necessary", "This is why my husband and I have separate bedrooms. \n\nBest. Idea. Ever.", "NTA. Sleep is precious and she's stealing yours. There are other ways to get up besides various loud alarms.", "NTA Op. This is inconsiderate of her and she needs to understand that she doesn't live alone anymore. She should at least try to do something different.", "NTA. I have about 10 alarms that start at 4 and go till 5:45 for work. Is it overkill? Probably. Do I know I have a sleeping problem and have tried looking for answers with no results? Yes. Does my alarm disturb anyone else’s sleep? Only my dog because my room is on the opposite side of the house from the other two rooms. Some people do need several alarms to wake up, but if they are disrupting your partners sleep, then you obviously need to think about how you can be respectful to their sleep while still making sure you get up. Your gf needs to figure something out that will work for y’all cause we all desperately need our sleep nowadays", "NTA!! This is THE single most infuriating thing in the world. \n\nI shared a room with someone who set 20 alarms every morning, for every 5 minutes, of increasingly louder and louder sounds (basically a fire truck sound) on the ALEXA. the person could sleep through the apocalypse and still wouldn’t wake up naturally.\n\nI dealt with this for months and all it managed to do was ruin my own sleep sensitivity, and now I can also sleep through an apocalypse. It’s super helpful especially when you have to be up early for work and nothing audible can wake you.", "Make her get the app Alarmy. I'm a total snoozer and it broke the habit. U have to do math or scan a barcode to turn the alarm off, it works!", "I was this person and I ended up getting wristband with an alarm function that vibrates to wake me up. Probably saved my relationship lol. \n\nGet her an Apple Watch or something under the condition that she has to use that function. She gets a gift and you get to sleep. Everybody wins.", "NTA but sorry man, this is just what living together is going to be. \n\nHave you tried to shift your daily schedule to start at her first alarm? It will mean an early night but I think this might save you from the impoverished sleep and possibly have the secondary effect of annoying/prompting your GF to start the cascade of alarms a little later. You should talk about this and see if you can both agree on a new time to start this process.", "Repeat snoozing is stupid. If you hit snooze from 530  til 630 and then get up, you've robbed yourself of an hour of good quality sleep.", "NTA.  Sleep on the couch, when she asks why just tell her \"I'm sleeping here so I dont have to wake up 6 times to you snoozing your alarm like a lunatic\"", "NTA but you need to accept you have a new reality- she isn’t going to live according to your logic.", "NTA. She needs to better acknowledge your feelings or you need to dump her.", "NTA. I’ll cut her some slack. I’m a snooze button person, and it’s difficult to change. And she may not have considered that different people do things differently. And if she hasn’t lived with anyone before, dealing with an incompatibility like this is probably something she’s never navigated before. Anyway, not be too hard on her. \n\nSolutions?\n- You could try to keep talking to her about it. You will have to figure out how to deal with conflicts at some point. Be calm. Let her talk. Tell her the impact it’s having on you. Empathize with her too - she’s being asked to change a habit. She might be fearful that she won’t be able to get to work on time. Don’t brush off these concerns. \n- you could offer to get up at 630 with get, and assure her that you won’t let her sleep in. It’s not 7 when you would like to get up, but it’s an improvement. \n\n- you could ask her to wean herself off it. Like setting the alarm 5 minutes later each week. \n\n-earplugs for you\n\n-if none of this works, you probably aren’t compatible. At this point, You could try a last-ditch effort to make it clear that this is untenable. Start sleeping in a different room. Tell her that it’s threatening the viability of the relationship. Reiterate the potential solutions. And give her an ultimatum. \n\nOr you could learn to live with it. Go to bed earlier.", "Get seperate rooms problem solved", "me and my gf both do this so… idk, maybe we’re both assholes", "Go to bed earlier, or break up with her", "NAH \n\nNo assholes here\nYou both just have different routine preferences. These end up being my least favourite posts. It’s pretty simple, either learn how to live with someone else’s routine or leave and find someone with one similar to yours. It’s not like she’s problematic.. it’s just what works", "ESH\n\nBoth of you need to be rested for the day, so you two need to talk this one out.  Compromise on something in the middle.  And definitely set the alarm on the other side of the room, forcing her to have to walk over to it in the morning.  Speaking from experience, it helps with the wake-up process.", "NAH. You’re right for how you feel and she’s right for wanting to stick to a routine that works for her.\nI do the snooze thing because I know I have to for me to be on time. I don’t use any alarm sound though just the buzzing so maybe that’s a big difference. But I know that if I don’t do the snooze thing then I’m not gonna want to get out of bed when I actually have to. It’s like warming up for waking up.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (33M) and my gf (32F) moved in together a couple of months ago, and everything has been good so far except for one thing. We both have to be at work at 8 - my job is less than a mile away so I get up at 7, hers is about a half-hour commute so she naturally gets up earlier. \n\nBut here's the thing, instead of doing it the usual way, she will set her alarm for 5:30 or 5:40 and then keep hitting snooze until 6:30, or she'll set it for 5:30 and then reset it a half-hour later, and so on. \n\nSometimes she'll get up at 5:30 and lay in bed looking at news or memes or whatever on her phone, and when she does that she usually falls back asleep with no alarm set, until either I wake her up or she wakes up to my alarm in a panic. The snooze button or the reset are annoying, but this one is the worst, because when she does it, I am now automatically lying there awake until she either gets out of bed or (usually) falls back asleep so I can wake her up, because if I do try to go back to sleep, that's in the back of my mind and I'm all restless.\n\nAnyway, this is killing me and I am dog tired at the start of every morning and usually throughout the day. I asked her why she does it that way, and she said she was used to it from before, when she used to wake up and run or go to the gym in the morning before work. I told her, well you don't go to the gym in the morning now, so what are you doing? All this does is wake us both up. She didn't like that, and admittedly I may have been a little gruff because this was at the start of the morning when I was tired and at my worst. But I kind of think I've got a point. So AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I’m not sure who wouldn’t be an AH in that situation! My advice work it out or move on … it‘ll be a source of deep irritation. Full disclosure- my husband did that sort of thing when we got married (adults, 2nd marriage with kids) and he got up at 3:15 and I not till 7. Happy to say 30 yrs later he sees sleep as sacrosanct and I’ve done all I can to set up our house so he can be up without tiptoeing-around. But MAN! I wanted to throttle him.", "My wife used to do this. Then we had a kid. Now she doesnt do this 😂 my alarm clock goes off 30 mins after i wake up most days now too. Life 🤷‍♂️", "NTA. My fiancé was worse. It drives me INSANE. Even worse, he'd do it on the weekends as well for zero reason! I got him to knock off on the weekends. And then to drop the vibrate on the work mornings. And then to set ONE alarm instead of 7 per day. This was over the course of a year with me getting pissy because he can fall back asleep super easy, but I don't. Told him it was a deal breaker because I needed my sleep as well, and it was horrifically inconsiderate of him to do that. It did get better over a few years. Now we rarely have this issue, including on the mornings that he wakes up before I do. I will admit I got petty at one point and let my alarm go off multiple times while i was awake and just on my phone.... that might have helped as well. Lol. \n(Next is addressing leaving the light on in the middle of the night...)", "NTA my partner sets alarms for every 15 min for an hour before he/we have to be up. He can fall back asleep I cannot.", "May be you should set alarm at 6:30 and wake her up every day.", "Sleep in separate rooms on days y’all need to get up.", "Where's my husband for 20 years.  He suffers from insomnia and takes forever to wake up.  His alarm starts An hour before he gets up.  Goes off every minute or so, to do math problems patterns punching numbers for it to Snooze.   \n\nHe is not being inconsiderate to me.  It just really takes all that to get him up and awake.   \n\nI found it frustrating until I learned to work around it.   I suffer from narclepsy,  And I wake up the instant there's any kind of noise.  So I am awake as soon as the alarm first goes off.  I'm part of the waking up process for my husband.  I shake him to get his alarm to shut the f*** off.  \n\nI only need an alarm as insurance for in case I don't wake up.  But I usually don't even need an alarm.  I also don't need to be awake,  To get up and get going.  I get out of bed About 20 minutes before my husband gets up.   So his alarm will start going off every minute or 2 from 5 AM.  If he takes too long to hit snooze then I nudge him shake him until he turns it off.   That is until my alarm goes off at 5:40.  Which is when I get up, To then go get his coffee breakfast and lunch ready.  While he gets another 10 minutes to wake up, Get himself dressed and ready to go to work.  \n\nAnd then I get my kids up and ready and off to school.    And then I'm free to take a nap.   \n\nThis may seem unfair.  But for me and my husband this is what works for us. Relationships that work  Are a give and a take. I hate his alarms.  But he needs Them.   He works really hard supporting our family.  It's the least I can do.   But that's my circumstances.   \n\nBy now it doesn't even matter if he has the alarms are not I'm getting up at 5 AM anyways.   Darn  natural internal clocks.", "NTA but it’s OK to sleep separately if possible.", "NTA. if she *really* doesnt want to start being considerate of your sleep then i would propose sleeping in different rooms", "Maan she is a big A if she does not want to change her ways. Snoozing is really bad for your waking rythm and disturbs the hormonal change that is meant for a fresh start.\n I used to be a snoozer and had always a terrible morning mood which made me believe i needed snoozing to soften the blow. No i dont snooze anymore and am way faster alert, awake and not a dark cloud to be around.", "NTA for your want but maybe your tone wasnt the best.\n\nMoving in with your partner is all about figuring out how to work together to solve the problems you didnt have facing alone. One solution is your GF sets her alarm back, another could be she (or you if that's easier) moves to the couch to continue snoozing. I understand how several snoozes can feel better than one jarring alarm that you instantly have to get up for. Just remember: in relationship dilemmas its not you versus her, its both of your versus the problem.", "Omg no…NTA. That drives me crazy.", "NTA     \n  \nThat is absolutely wrecking both of your sleep cycles. By now it should have established natural awake time.   \n  \nIf you don't adjust you will end up one of those people that are always tired and wondering why.", "NTA. When you're sharing a bed with someone, you have to be considerate towards them. I'll snooze once for 5 minutes, then get up because otherwise, it's going to impact on the bloke laying next to me who doesn't have to get up at 6am like I do. Talk to her about it properly over the weekend and not when you're tired or annoyed by it.", "NTA, although I totally see why she will want to do it...I do it too but I am pretty sure I wouldn't if I weren't an alarm ní já. I literally wake up to the lightest first tone/vibration and I don't think any of my partners ever had an issue. Letting the alarms yell for hours is selfish af. Also being grumpy because she just wants to get up early and uses one is.\nI'd strongly suggest different rooms and a vibrating bracelet for her. Also talking when you are not groggy and grumpy, obviously.", "NTA, my partner used to do it all the time (he often gets up around 4am because he’s in logging) and it would make me WILD. \n\nEspecially when I’m as quiet as possible sneaking into bed if he’s already in there, so not to disturb him", "NTA \n\nDon’t mess with my sleep! Lol", "Oof. NTA but idk if you two will work out long term in the same room ^^\" I set 5 alarms to wake up, and can't get up without doing so. If my partner couldn't handle it, we'd definitely be sleeping separately by now. Best of luck", "Invest in a Pavlok. Best money I’ve ever spent.", "NTA. If one decided to live in with other people, esp. in the same bedroom, you can't really say, \"This is how I live before,\" one has to really compromise or adjust. Consideration towards others, loved ones nonetheless costs zero dollar.", "I don't care if one snoozes alarm as long as it's not super loud. If it's phone alarm, she can choose a soft tone and not the ones that sound like emergency alarms. It's also not a good habit to suddenly get awaken.", "No.", "Nta. I'm a snoozer and I recently moved in with my partner who isn't. I keep my phone under my pillow and set the alarm to vibrate only. I wake up and he doesn't. I would get a watch or something if that wasn't good enough though", "NTA.  I'm a snoozer, but not for the normal reasons. I turn my alarm off in my sleep and will have no recollection of doing so. I have to set multiple alarms to start going off an hour before I'm supposed to get up or I will over sleep. Usually by the 3rd or 4th alarm, I end up actually waking up. My husband uses ear plugs and our agreement is that I will use a different alarm sound than his so he can differentiate his alarm from mine. This makes it easier to ignore and sleep theough. And I only set the alarms in increments of 20 minutes. He says there there is some scientific data that says 20 minutes snooze is the best for waking rested and prevents from getting woken up in the middle of a bad sleep stage. It sounds like that is not the case for her. If she sets an alarm and then is awake the whole time anyway, then that makes her the AH.", "So I suppose it's kind of complicated, personally I do that too, I set alarms 2 hours before I need to be up, sometimes it's so I can read stuff on my phone, sometimes to just lay for a while. Fact is I hate waking up and instantly having to get up, it makes my mornings a lot more anxious and it's a hill I'd absolutely die on.", "NTA.\nThis was a top reason for my last breakup. So disrespectful. A terrible way to start the day. \n(Yes, I brought it up multiple times). It’s like instead of waking up to a “good morning babe” you’re waking up to “duck you, idc”.", "I'm a snoozer, you know how I deal with it? I stick the alarm on the other side of the room so I'm forced to get up. It does mean that the alarm lasts longer, and causes more disruption at that moment. But it stops continual disruption\n\nIt's not the best fix, the best is to have it next to me and get up straight away. But I've tried that a lot, and I just can never do it", "My husband is a snoozer as well, but luckily he's a reasonably light sleeper and a crescendo alarm that gets louder means he snoozes it before I get woken up by it 95% of the time. We also both use a function that makes you do a sum (difficulty of your choosing) to actually turn the alarm off.", ">hit snooze once (+10 minutes) but then get up.\n\nIts like that book for kids read by Samuel L Jackson \"Go the Fuck to Sleep\" She needs one \"Get the Fuck out of bed\". Anything more than 1 snooze and up is being an asshole.", "I dunno about that. I think it depends on the type of person you’re with. My partner was a “snooze again and again for an hour” person when we first started dating, and when I told him it was making me lose an hour of sleep and I hated it, we had a conversation and figured out a solution. Now he snoozes once or twice and everything is fine. So I’d say that if your partner is considerate and you’re both willing to compromise, it can totally get better. Being a snoozer isn’t forever unless the person is stubborn, inflexible, and/or inconsiderate, imo.", "Best answer.", "Yes! I'm always extremely exhausted in the morning and have no motivation to get up, so I started setting the first 2-3 alarms as math problems (first one is easy mode, second is slightly harder, third is harder than #2). It has definitely helped a bit more, although (thankfully) I currently live in a dorm by myself so my other alarms don't annoy anyone else (I need multiple alarms at different times of the day because otherwise I will completely forget something or end up super late to class. Most of my later ones aren't super loud though, just loud enough for me to hear them)", "Just shift your schedule eh? Have you tried pushing a rock uphill your whole life? That's what a nightowl feels in a lark society. It's recepe for exhaustion, unless you want a permanent sleeping pill dependence. As I have a kid that must get to school, that's  my life when school is in season.\n\nI am also a snoozer. I need to wake up gradually or part of my brain will not stop dreaming until late afternoon. But thats 15 minutes, not more! And I use crecendo alarms, so Id stop it before the ex even heard it. Being a snoozer is  no excuse to be a dick to other people. OP is NTA. She needs to NOT wake her bed mate end if that does not work, have sparate sleeping arrangement.", "Blasting your alarm when you have a sleeping partner is incredibly inconsiderate", "You realize that humans aren't static, correct? A \"routine\" isn't in our genetic code or part of our personal identity. \n\nPeople in healthy relationships:\n\nA- Want their partner to be happy \n\nB- Are capable of mild adjustments \n\nShe doesn't need to set her alarm so early. It's a simple adjustment that is of no real consequence for her and brings a lot of happiness for him.", "Why does Op suck?", "I'm a solid 15 minute snoozer. Sometimes I set my sights too high and do an hour when I feel ambitious. That ship sailed after my kid was out of the toddler years. Op's gf needs to set a more realistic snooze schedule.", "My wife works at 5 and she got a Fitbit. I am now a slightly happier person. 😂", "Most often it’s because he has a penis.", "By his own admission, the OP was \"a little gruff\".  I too would be irritated at being woken up an hour early, but you have to tactfully figure things out.  Just being irritable alone won't solve anything.  Just my two-cents.", "Yep. I read that too. Makes him a human, not an arsehole.", "Agreed.  That's why he \"sucks\".  It seemed the most fitting description.", "You don't suck for being \"a little gruff\" when you get woken up repeatedly every day.", "I guess we are at odds then, Dooomed.  You believe he handled this situation productively and I do not.  As someone who is woken up far earlier than the OP on an almost nightly basis, I've come to realize being irritated and yelling doesn't solve the problem.  However, winning the Powerball tomorrow just might.  \n\nThat all being said, I would be more than happy to buy both you and the OP a beverage sometime and discuss things.  Apologies, OP, if I caused any offense.", "Hey that's OK dude. It's just a discussion and I definitely don't take it seriously.\n\nReddit would be a boring place if we all agreed with each other. Arguing is part of the fun (at least for me).\n\nI'd love to have beer with you if the opportunity presents. In the meantime good luck with powerball and have a great day.", "And you a better one.", "BTW I just saw how much powerball is worth in the US (I assume that's where you are). If you win I'm gonna hold you to that beer!"]}