{"id": 28448, "submission_id": "172igrf", "title": "AITA for not letting a woman w a baby use my Costco card?", "selftext": "My husband and I were at self check out and there was a woman w a baby asking customers if she could swipe their card quickly so she could purchase her groceries. She had 2 items, bread and something frozen. My husband was about to say yes but I nudged him and said no. So my husband had told her no. I thought that was over and done w but my husband and I got into a little disagreement and he calls me selfish then brings up me not helping the lady w the baby as an example. I thought that was completely irrelevant. Why didn’t the woman have her own card? Why was she in Costco if she didn’t have one? Why did she only have 2 items? All of those rang bells so that’s why I said no. My husband sarcastically says she is asked to swipe your costco card and not your damn cc. He’s saying it says a lot about my “character”. Was it really that big of a deal that I said no? AITA here or is my husband overreacting?\nA family that initially said no to the lady tapped her and gave her their Costco card to use so she was able to buy her items.", "created_utc": 1696716790, "permalink": "/r/AmItheAsshole/comments/172igrf/aita_for_not_letting_a_woman_w_a_baby_use_my/", "score": 28, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > AITA for not letting a woman with a child use my Costco card. My husband thinks I am selfish because I did not.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Even at Costco's self-checkout, there are multiple cashiers overseeing those lines. No way this could have gone down like this.", "NTA Costcos in my area are revoking people's memberships if they allow unauthorized users to use their card.", "NTA. How’d she even get into the store without a membership card? There’s someone manning the door of my local Costco and they’re very strict.\n\nAs others have said, you’re not supposed to share your membership. \n\nFor all you know, that lady was a “secret shopper” type or even a Costco employee whose job it is to crack down on membership sharing.", "NTA\n\nHer having a baby is irrelevant to the situation. She could have signed up for a card while there and you could have your membership revoked for sharing your card. It’s not worth it.", "NTA.  This is a huge scam going around lately at Costco and other membership big box stores.  If she forgot her card, she can go to customer service to get a temp card.", "NTA, the mom could’ve went to a different grocery store that doesn’t require a membership if she needed groceries that badly. Costco will most likely revoke your membership if you share it.", "If she only needed those two items, why did she go way to Costco? Anyway, NTA. Even if she wasn’t pulling a scam, you don’t have to share your membership. that you pay for.", "I had a lady ask if she could use mine at the Costco gas station. I told her no so the attendant swiped hers. The thing is at the gas pumps, you have to use either your debit card or the Costco credit card to pay. I didn’t know this woman & she could be using a stolen card to pay. I’m not getting in trouble for a stranger.", "NTA. Costco is cracking down on people sharing the membership cards.  They can revoke your membership.  They gave me the 3rd degree when my 16 year old son wanted to pay for his own stuff when we were there together.", "This is an old scam.  They were doing this back when I was working LP-Security (not Costco). They take your card info-simple they use their phone to capture the bar code.  They will shop with it in the self-checkout and use a stolen card.  When the purchase gets charged back, they come after you.", "Well the whole thing just seemed weird. How did she even get in without a card and why would she sneak into Costco for only two items? NTA.", "NTA. Costco is a warehouse that gives bulk discounts to people that pay a membership fee. They are very strict about checking membership on the way in and out. How did she get in without a card? Why was she there if she was not a member? Having a baby is not an excuse for trying to scam a discount she is not entitled to. You were right to refuse to share. \nAs others have said, you can have your membership revoked if caught breaking the terms of membership by allowing a non member to use your card to get a discount.", "NTA Honestly, I’d find her situation weird, too. I don’t know about all Costcos, but the one I go to won’t let you in the store until they see your card. If she lost hers in the store, she should’ve spoken to an employee.", "NAH. While it would have been kind to help her it is very strange that she was there without a card of her own and not helping her doesn't make you implicitly bad.", "NTA.  No one is ever wrong to tell people like this to f-off.", "NTA. \n\nIt's a violation of the terms of your membership. If she's a member who just didn't have her card with her, she needed to go to customer service and get a temp card or a new one. If she's not a member,  she can't shop at Costco until she becomes a member. \n\nI have a hard time believing that she wandered in without knowing this, so I share your concern that she was possibly up to something .", "NTA - I have lost my card while shopping, a major pain, so I went to customer service and got another. Mom should have done the same. She didn’t have a membership…", "NTA\n\nEither this is a scam and I can’t figure out what it is, or it’s an undercover Costco employee. Why is she shopping there without a card? Other places sell groceries. The baby is irrelevant.", "NTA, don’t have a Costco card? Sucks for you, either invest or have someone who has a Costco card to make the trip on your behalf. I’ve done it that way for years before I got my own card. Have them my card and offered to pay them back too if they got it.", "NAH- your husband wanted to help and that’s fine, you didn’t feel comfortable and we’re suspicious which is somewhat understandable- the lady had probably lost her card and was panicking thinking she wasn’t going to be able to pay for her shopping. Awkward situation but I wouldn’t say you were TA", "NTA, my Costco has been cracking down on card sharing. They have employees check the photo on your card at self checkout to make sure it's you. They've been doing this for a couple of months now.", "NTA — it vacates your membership and you would be responsible for her actions. If she shoplifted, you’d lose your membership.", "NTA while it is always a nice gesture to help someone out, you should always have a choice. So that doesn't make you an asshole for not giving a stranger your card.", "I really don’t understand all the pearl clutching and bell ringing here.  Maybe she did not have transportation or money for transportation to get her to a different grocery store.  Maybe she can’t afford her own card. She only had 2 items. JFC how much was she actually “scamming” Costco out of?  Pennies.  You should all be ashamed for declining on those foolish reasons. If you had a concern that Costco might cancel your membership for letting her swipe yours, then that’s a slightly different story. Slightly.\n\nIt rang bells that she only had 2 items?  I’m disappointed with your lack of humanity", "I have bought food, diapers and other necessaries for folks with kids who have no money in the grocery store. Even if they are getting over on me, I'd rather feed a child than spend five minutes of my life thinking about one going hungry. She asked you to use your membership card for access and not your money?\n\nI can't see getting excited about this in any way. I agree with your husband. This is unnecessarily gate keeping of you. So, that part is a holy.", "NTA. She thought she could “steal” your Costco card. The baby might not even be hers!", "On one hand, yeah, she shouldn't be shopping at Costco if she hasn't bought a membership.\n\nOn the kinder other hand, who cares? How difficult would it have been for you to let her swipe your card? \n\nWhen you have a choice, choose to be kind.\n\nYTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy husband and I were at self check out and there was a woman w a baby asking customers if she could swipe their card quickly so she could purchase her groceries. She had 2 items, bread and something frozen. My husband was about to say yes but I nudged him and said no. So my husband had told her no. I thought that was over and done w but my husband and I got into a little disagreement and he calls me selfish then brings up me not helping the lady w the baby as an example. I thought that was completely irrelevant. Why didn’t the woman have her own card? Why was she in Costco if she didn’t have one? Why did she only have 2 items? All of those rang bells so that’s why I said no. My husband sarcastically says she is asked to swipe your costco card and not your damn cc. He’s saying it says a lot about my “character”. Was it really that big of a deal that I said no? AITA here or is my husband overreacting?\nA family that initially said no to the lady tapped her and gave her their Costco card to use so she was able to buy her items.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "I don't know. This smells of scam to me. She had to show a card to get into the store or be with someone who did. Which means she must have had access to a card. I like to help people when I can, but I would said no to this too", "My Costco checks the card at the door on your way in.", "See I wouldn't scan my card for them but if it was just bread and milk I would probably buy it for them. Don't want to lose my membership. I thought I heard that you can shop at Costco if you have a Costco gift card.", "Clearly there are some Costco's that don't enforce their own policy.\n\nYou can't get into the one near me unless you have your card. There are currently no self service registers to do the \"sharing\" of one card over multiple transactions.\n\nIf you want to risk your membership, then go ahead and share it around.", "We don't have a Costco where I live and I'm so confused by this. If I understand correctly there are supermarkets where you have to be a member or you can't buy groceries? 🤯\n\nIt feels like the system ITA, why can't she just shop and tell them she forgot her card? Is it really so big of a deal to exclude paying customers? This feels wrong on so many levels.", "Not really an AH but I really don't get the problem.  You aren't making it a habit of swiping your card for strangers.  It's a woman with a baby.  She probably lost it or forgot it and she is in line with a kid on her hip, putting the stuff back, getting in the other line then getting back in line to pay again...pain with a kid.  Doesn't  seem that weird to me.", "NTA, scammer using her child to help scam, nothing new", "NTA\n\nthat said, I’m not even comfortable middle class.  But a lady with baby needed help buying bread?\n\nI would’ve just bought it for her.", "NTA. Don’t they stop you at the door if you don’t have the card? How’d she get in there in the first place?", "There's a reason you have to have your picture taken when you get your card", "Costco in Dallas today. They checked card on entry and checked card and photo on back at checkout.", "Regardless of whether this happened or could have happened, in a situation like this, why wouldn’t you let the woman use your stupid card? It costs you nothing but a few seconds of your time. Do you really want to be the membership card police? What’s in the for you?\n\nIf it costs you nothing to help someone in any situation, why wouldn’t you? What kind of world do you want to live in? How do you want other people to treat you?", "I can't get into my Costco without a card. NAH for saying no to her using the card but what else have you did?", "NTA. I can’t even get through the front door at Costco here without showing my card. You can get in without a card for optical or pharmacy so she could have picked something up at the pharmacy but she has to know you need a card for checkouts. Kind of wondering if it was down me sort of scam attempt.", "NTA. First off, how is she able to even enter Costco without card?", "So the scam, for those wondering, has to do in states where groceries are taxed & the person is tax exempt due to military or disability or a business. If you allow someone else to use your card & get tax exemptions then you’re defrauding the state. This can get you & Costco in trouble for unauthorized usage.", "My local costcos won't let you in the self scan area without showing your card first to prevent non members from sharing cards with members", "At least 2 of the 3 costcos near me (haven’t been to the 3rd one), I can’t even get into the store without showing my Costco card first.  Also, Costco is cracking down on this: https://www.cnbc.com/2023/06/27/costco-cracks-down-on-membership-card-sharing.html .  NTA", "Costco also won’t let you use a card with a different bill to name than the one on your membership card. My husband has gotten stuck using the wrong card on my account.", "Actually, yes it could.  This is a huge scam happening at Costco and the other box warehouse store.  I've been reading about it for the last two weeks.", "Me and my 3 friends go all the time and the one friend with the card just scans it each time for us. It’s not hard. No one stops us.", "I basically got rugby tackled by one of the Costco associates trying to check my card when I was using the self check outs", "There was a female employee at the front of self checkout. And others putting back groceries that customers didn’t want. No one said anything to the woman.", "Agreed. Also your husband is kinda an AH for dredging it up in a later argument. If it bothered him, he could have addressed it earlier with you, not used it as leverage later on. You protecting yourself when you sense a scam is good instinct.", "It's very easy to bypass the card check at the entrance by going in through the exit.  If anyone asks, you tell them you're going to the membership desk.  No one has ever asked but I've never been carded going to the restroom or the food court through the exit.", "Easy …just go through the exit, I do this when I go to the pharmacy", "Sometimes they don't even ask here. And I have misplaced more than one membership card. I just go to the desk and buy another. But, its not like I've never entered the store and realized I didn't have my membership card. \n\nI just swiped my card for a teenager trying to buy gas a couple weeks ago. He was embarrassed. And the lines for gas were long. It was easy to swipe my membership, let him pay and then get my own gas. \n\nI don't think OP is the worst person in the world. But, I understand why her husband disagrees with her.", "By huge scam, do you mean going to Costco and borrowing a member’s card to be allowed to have the discount? That doesn’t seem like that huge of a scam to me.", "Or a replacement. They also offer free one day trial cards.", "I’ve gone to Costco for one or two items at a time. Sometimes it makes sense. I, however, have a membership.", "I go to Costco when I need just one or two items. For two loaves of bread, I pay the price of one. I think the OPs red flagging of two items is silly, but I agree, NTA.\n\nIt's not worth the risk of your card for a stranger.", "Agree with this, I can’t even get in without showing my card first.", "Could be any reason why she asked. She may have been with her husband, and he wasn't done shopping, and she just wanted to go back to the car with the baby.", "And I am always happy to bring a friend or grab a few things for them. My mom took me to Costco every month for the longest time & my husband takes his mom whenever he goes home to visit", "\\^I have a friend with Costco, while I don't. I will occasionally have her buy things for me and pay her back plus gas because she'll drop it off at my house.", "If it was lost she could have just gone to the customer service desk.", "Costco stores near us are located where you would definitely need a vehicle - she is definitely trying something wrong and has a kid with her to try and make people feel bad - probably stolen credit card.", "I agree. I guess I would just assume she was really in need of those items and maybe was down on her luck. If I was nervous about handing over my card, I honestly would have just said “hand me your items and I’ll ring them up and swipe my card”.", "Just experienced that today, in fact.", "What is the scam?", "They check for cards before you even get to the self checkout machine now.", "They are cracking down on that", "I think as long as the person is with you they don't care. I use mine with my friends all the time.", "Sure.  NTA I guess.", "He did bring it up in the car but I didn’t think it was worth talking about. He was upset that I pushed him back when I saw the woman passing us to leave.", "Or you walk in behind someone like you’re with them. Another way is to get an empty gift card & present that.", "You don’t buy another card. It’s free once you’re a member.", "That's part of it and then you can lose your own membership by doing this.", "Yeah, it may be a hassle for some but many times I’ve been treated very kindly when I had asked all that time ago! I now repay that kindness forward and help those out who I know don’t have a card but REALLY need something from there when they know I’m going to Costco to shop.", "Thank you, kind stranger", "Depends on the location. We have three in our area, I know two of three don’t check for cards at the self-service kiosk. It’s super easy to get in, just walk in with folks like you’re with them.", "Not yet in Canada", "Nah most costcos make you do one transaction", "It just doesn’t sound scammy to me. I read elsewhere that folks are concerned that nonmembers who borrow the card will use stolen credit cards and then the member is a suspect, but I cannot imagine that ever resulting in actual criminal charges.", "They literally let me do two separate transactions every time for a friend. They told me that's allowed?", "Depends on the location. The one I go to most often is pretty strict, but there's one a little farther away that I go to sometimes because it's less busy during the evenings that is much more lenient.", "In Canada. Have seen them cracking down. Expect it soon at yours.", "Yeah, they don't care who's paying though. I just have my friends pay me back if we use my card.", "Costco largely survives on membership fees. If people are shopping without a household membership, they’re scamming Costco. Now if she found out her card has just expired and just needed bread and formula until payday, I’d be sympathetic, but definitely not violating the contract I signed for her.", "You don’t get it lol. We do 3 separate transactions in the self check out.", "Well, that’s just silly. Of course they don’t. A Costco membership is like five dollars a month per member, which is not pure profit as there are administrative costs to having a membership system. Costco clearly makes a lot more than that per month per member in profit from sales. They make slightly less margin on sales than Walmart but make up for that with lack of advertising, less need for labor and other overhead, and membership fees. They also get a lot of valuable data from members as well as member loyalty, which can be leveraged into things like members being territorial about Costco, increasing its social value, and buying some higher priced goods than other stores. Forgive me if I don’t care if Costco loses its five bucks on one lady’s purchase.", "The bulk but not all of their profits come from membership fees \n\nhttps://www.investopedia.com/stock-analysis/040915/3-reasons-costco-great-company-cost.aspx#:~:text=Costco%20makes%20some%20of%20its,prices%20to%20ensure%20customer%20loyalty.", "No, their profit comes from memberships… not sales. They basically break even there. Feel free to look it up. Lots of articles on it. It’s pretty well known. \n\nPeople cheating the system drives up membership costs. You may not care. I don’t want to pay for others’ dishonesty.", "Read the article. Specifically this part: “In 2022, Costco's revenue from membership fees alone increased 9% to $4.2 billion. The company's total gross profit for 2022 was about $27.6 billion.” $4.2B is not the bulk of $27.6B.", "The reason they word it like that is they make much higher of a MARGIN on memberships because memberships themselves are almost all profit compared to profits from merchandise sales. Membership profits as a total are a small portion of overall profits.", "That is a really good point. I stand corrected.", "I think it was confusing on purpose. I personally think Costco has a strong interest in its members thinking that membership costs make up most of the profit. It makes it seem much more valuable than it is and blinds them to other manipulative tactics."]}