{"id": 28454, "submission_id": "172lf5z", "title": "AITA for my reaction to kids kicking my door?", "selftext": "Pretty much title. I 37F was lying on my couch while my husband was in the yard doing some work, when all of a sudden I heard a really loud bang on my front door. It scared the shit out of me. My heart started racing, not knowing wtf just happened. I got up to go check thinking maybe it was something with my husband, but as I opened the door and looked down the block, I saw 3 kids running away. They were kinda far, but yelled out \"I dare you to do it again, you little assholes\". I checked the ring camera playback, but it only caught them running away. On my door was 3 wet footprints since it rained earlier. Like, all 3 of them kicked the door at the same time. I was super pissed at this point. I grabbed my car keys, jumped in my car, and went after them. \n\nThey weren't that far, around the corner at this time. I pulled my car up to the sidewalk, window down, and just completely went off on them. This included yelling and lots of cursing. They were shook, and tried to say they were just playing \"ding dong ditch\". The last thing I remember saying was if I catch you in front of my house again, it's going to be a bigger problem. When I got back home again, and calmed down a bit, I started thinking about it. The kids were actually pretty young. Like, couldn't be more than 12 or 13, and they admittedly looked scared as shit lol, and thought maybe I could've handled it better. But, at the same time, I feel like if I just let them off, they would keep doing stupid things like that, and think it's ok. Also, I honestly wouldn't have reacted so strongly if it was merely them ringing the door bell, and running, but them kicking it like that really really scared me. I thought someone was breaking in. Anyway, aita for my reaction?", "created_utc": 1696724844, "permalink": "/r/AmItheAsshole/comments/172lf5z/aita_for_my_reaction_to_kids_kicking_my_door/", "score": 278, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > Imbta because I could've been more calm in my approach, or just let it go altogether.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA perhaps but I see toilet paper and eggs in your future.\n\nOne 12 year old by himself has the initiative of a moon rock. Three 12 year olds together is a purposeful crime syndicate. You may have erred in teaching them new words to take home and rewarded them with a thrilling chase. Even if they shat themselves when you got them they loved it.", "NTA- their doing that could actually get them physically hurt if the picked the wrong house. Hopefully the lesson was learned that adults can track you down. A good tongue lashing is was well deserved.", "NTA - 12 or 13 year olds know exactly what they are doing. 5 or 6 year olds egged on by older kids would be one thing, but these kids were way out of line. If you \"scared them straight, you did them a favor.", "NTA\n\nAt their age, they should know better. Maybe next time, they'll think twice before doing something like that again.", "NTA.  Kids that age can do thieving, they have a lookout or 2 with cellphones while one or 2 breaks in.", "INFO - when you went off on them, what exactly did you say? Name calling? Threats of violence?", "Not wrong for being mad, but it’s dangerous legally to act like that.\nA lot of police would treat you as a crazy person if they told their parents about it, and if they chose to call them.", "NTA. They gotta learn respect for other people’s property and you made sure they will be now lol. All you did was scare them straight, their parents should have done it sooner anyway.", "[removed]", "NTA\n\nThey deserved it - kicking your door is obnoxious.", "NTA. I know some kids that are the exact age you describe, and they are vile. They'll grow out of it, I think, but they need help along the way. I believe you are helping them! Good job!", "\nNo, but I have a thought. I would go back and find out who they were and do something nice for them. I know that sounds crazy but you can actually turn them where they won’t want to mess with your house. You can even turn them into kids that will watch your house for you. We did this with some kids on our street. When they were turned down mailboxes we made friends with them And it worked even though you yelled at them you could go back and find them and say hey, I overreacted and I know you guys are just being kids, so I wanted to see if I could do a little something fun for ya. It’s totally not what they will expect.", "ESH that was a bit too much with the cursing and chasing them in the car. I understand your frustration but you have to do it in a way that doesn’t end with you being the primary aggressor. For example, I did walk out to talk to kids who played ding dong ditch but lived right across the street so I recognized them the next time I went out from the recording. I didn’t raise my voice, I didn’t use salty language. I just firmly stated that I have them on camera doing this and that it is going to stop. On another occasion, I found my next door neighbor outside when her son hit my door with a tennis racket and while we don’t speak a shared language, she watched the video and 100% was pissed at her kid. No one comes at my door except on Halloween anymore :)", "You probably saved their lives. Someone else with your pissed off mindset could have had a gun. \n\nNTA. Kids are stupid but at those ages they have the internet and know bad things happen.\n\nI’m only in my 40s and grew up going door to door to sell Boy Scout shit or ask to shovel a driveway. No way in hell I’d do that now for money, much less to antagonize people", "NTA. In fact, you are quite kinda and thoughtful to show such tough love. You probably lowered the chances of any of them ever ending up in jail. Don’t poke the bear is a vital lesson.", "At first I thought they were really tiny, but 12 or 13 year olds? Absolutely deserved it, if not more. NTA.", "no, kick door bad teach lesson life good", "NTA. Hopefully you scared them straight", "NTA. We are having problems with kids around that age in our shopping center. They move from one store to the next terrorizing staff. One store banned all kids under 16 without an adult after 5pm. Wish we could. At this point we are calling the cops next time they try to come in. I’m not usually about calling the cops, but I’m over these dumb white kid shenanigans (I’m white). They freaking sprayed my entire store with fart spray after begging to just use the restrooms. Half my staff wants to just straight up murder them.", "Probably nta -- I think it would depend on if they looked scared as in \"oh no we're in big trouble\" or scared as in, \"this person might hurt us.\"  I think 11 - 13 is honestly a good age to be reminded that other people have feelings and silly pranks can have consequences of people being upset or angry. They probably thought it was a joke when they did it: Now they are aware of a more serious perspective.  It's maybe not the absolute best way to handle the scenario, but I don't think you need to worry you did any harm.\n\nI will say that that age is also open to the nuance of a, \"You were wrong but I could have handled myself better\" type apology. So if you are feeling guilty or worried they will somehow escalate and turn you into their nemesis, I'd keep an eye out for them just to say, \"Hey, I just wanted to talk more about our interaction. Your prank made me feel scared/upset/etc. and that affected how I spoke to you. I hope you understand why that's a harmful prank to do, but I also wanted to make sure I explained myself in a way that's less inflammatory.\"  That could also be a learning experience for the kids so they don't stereotype you as the lady who yells at them but helps them see you as a complete person. Also it might head off any Halloween retaliation ;)", "YTA for driving after them. This is the kind of behavior kids are told is predatory and you likely scared them beyond reason. Actually chasing them down in your car was way over the line. Yell at them from your door or your yard, whatever. Literally hinting them down in your car is honestly disturbing to me, and if I were their parent I’d be horrified- by their behavior, but even more so by your rage and willingness to seek them out to verbally attack them. \n\nSeriously- if you were a parent and your kid said someone drove after them to scream and swear at them for one act of mischief, you’d be terrified for your child’s safety no matter the reason.", "good run them over next time, kids are demons now days they aint shit nta tbh", "NTA. Giving them a good scare may keep them from playing this ‘game’ again.", "I would post the video on your local neighborhood page.  If they are doing it to you they are doing it to others.   Their parents need to be aware.", "NTA clearly the \"parents\" aren't trying to, SOMEONE needs to teach these little snots how to behave", "NTA\n\n.You are my hero", "NTA.  Remember that old TV show \"Scared Straight\" where they show troubled kids how bad prison is?  Consider this your personal reboot.\n\nAnd you're doing them a favor.  The way things are these days, someone will probably blow their heads off next time and get off on self-defense charges.", "I did this to kids pretending to throw rocks at windscreens. I pulled over and let rip. What if I'd swerved toward them?    Sometimes kids need a good bollocking and letting them know not everyone will put up with their shit.", "Yeah YTA. It’s kids messing around. Big “get off my lawn” energy from you.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nPretty much title. I 37F was lying on my couch while my husband was in the yard doing some work, when all of a sudden I heard a really loud bang on my front door. It scared the shit out of me. My heart started racing, not knowing wtf just happened. I got up to go check thinking maybe it was something with my husband, but as I opened the door and looked down the block, I saw 3 kids running away. They were kinda far, but yelled out \"I dare you to do it again, you little assholes\". I checked the ring camera playback, but it only caught them running away. On my door was 3 wet footprints since it rained earlier. Like, all 3 of them kicked the door at the same time. I was super pissed at this point. I grabbed my car keys, jumped in my car, and went after them. \n\nThey weren't that far, around the corner at this time. I pulled my car up to the sidewalk, window down, and just completely went off on them. This included yelling and lots of cursing. They were shook, and tried to say they were just playing \"ding dong ditch\". The last thing I remember saying was if I catch you in front of my house again, it's going to be a bigger problem. When I got back home again, and calmed down a bit, I started thinking about it. The kids were actually pretty young. Like, couldn't be more than 12 or 13, and they admittedly looked scared as shit lol, and thought maybe I could've handled it better. But, at the same time, I feel like if I just let them off, they would keep doing stupid things like that, and think it's ok. Also, I honestly wouldn't have reacted so strongly if it was merely them ringing the door bell, and running, but them kicking it like that really really scared me. I thought someone was breaking in. Anyway, aita for my reaction?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA: make sure to some your cameras correctly.", "NTA.  Someone needs to teach kids some manners these days.", "Tbh, I thought about this, too, with halloween right around the corner. And my husband and I both work on that day. 😓 Hopefully I scared them enough to never come back. Fingers crossed lol 🤞", "Agreed. So many stories about people getting shot for coming to the wrong door, or even turning their car around in someone’s driveway. Those kids were lucky all they got was yelled at.", "Plus kicking on doors and on the off chance they actually do damage to one? Parents won't be happy about that bill. Neither will the person whose door they broke", "Omg dramatic much?", "When I pulled up, I was like \"why did you just kick in my door?\" You think it's f*cking funny? If you damaged my door, are you gonna f*cking pay for it? Where the f*ck are your parents that u guys are around here doing stupid shit like this?\" Stuff like that. I never once threatened them directly, like I'll kick your asses or anything like that. Tbh, when I realized how young they were, I kinda threw me off a bit, but yea, no physical violence.", "Your post has been removed. \n\n#Do not repost this without [contacting the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) for approval, including edited versions. Reposting without [explicit approval](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_can_i_repost_a_thread_you_removed.3F) will result in a ban.\n\nThis post violates Rule 5: We do not allow posts which concern violent encounters. This includes any mention of violence in any context.\n\n[Rule 5 FAQs](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_rule_5.3A_no_violence) ||| [Subreddit Rules](https://www.reddit.com/r/AmItheAsshole/about/rules/)\n\n#Please ensure you have reviewed this message in full. We will not respond to PMs to individual mods. [Message the mods](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) with any questions.\n\nYou can visit r/findareddit for a comprehensive list of other subs that may be able to host this discussion for you.", "This is not a bad idea at all, and tbh is something I would do. I really don't know who they are, but if I run into them again, I would consider this. At the end of the day, even though most people are saying NTA, and I do stand by what I did, I also feel as the adult I could've turned it into something as a lesson. Idk, mixed feelings on the whole thing. Thanks 😊", "I respect your judgment, as well as everyone else's. I just wanted to say they were the \"primary aggressors\" since they initiated the entire situation. Also, as stated in my op, I think them actually kicking my door with enough force to make the sound that it did, was very different than the nuisance of them simply ringing the bell, and leaving. But again, I respect your opinion. Thanks for commenting.", "I really appreciate this comment. Very thoughtful and captured a lot of what I was feeling on the situation. Thank you. And, just to let you know, scared as in like they were not expecting someone to catch them, and now they're in trouble.", "I did 👍", "Put up a sign saying you have cameras, maybe that will scare them to not approach again.", "They deserved the scare. They were not doing it correctly anyway. And besides it’s October so you get a pass.\n\nI just hope they wore their brown pants.", "Honestly, be careful. Maybe get another camera set up and have motion lights at night. Something similar just happened in my town except instead of chasing them down, the homeowner posted in the neighborhood Facebook group naming names because they knew who some of them were. Kids came back and broke windows. I have no idea if they had cameras or police got involved because the homeowner never said in the post but that's still awfully shitty to have property damage. Some kids will learn their lesson after being caught, some decide to take it further", "If this how up for normal Halloween trick and treat,  I hope you shower them in sugar. \n\nYou do catch more flies that way and you fatten them up so they can't run away. Win-win", "Spray Pam on your door.", "Yeah, you're the AH, but understandable you were upset.  Best not to chase down and swear at other people's children.  At worst, all 3 could make up a bad lie about you to police that could land you in jail.", "When I say primary aggressor, I mean that they kicked an inanimate object, a door. You got in a car and chased down minors to yell and curse at them. Between those two things, yours is the most aggressive and concerning.  I’d roll my eyes at the kids and tell them not to do it again if I heard what they did. I’d warn people not to leave their kids around or alone with you if I heard what you did.", "However, you experienced a crime on your property, and they experienced threats and swears to their persons.  You can't do that or rationalize that behavior.", "They're fucking 12 year olds, not toddlers. I don't know a single normal 12 yr old who'd do that. Istg, people are getting too comfortable with \"they're just children.\"", "Yeah 13yo should just be allowed to do whatever. A tongue lashing was what these kids fully deserved since their parents failed to raise them.", "And how do they explain the footage of them running away and their foot prints on the door? OP can back up their version of events.", " I respect the judgment, just wanted to clarify,  I NEVER threatened them with physical violence, if you re-read that info comment. Just wanted to make that clear. Thanks for commenting.", "You don’t know 12 year-olds who would *lie* when they’re in trouble??", "You might want to reread your post yourself. What you said could easily be construed as threats of physical violence. You \"dared them to try that again\" then caused down CHILDREN in your car and told them if you \"catch them in front of your house there's going to be a bigger problem.\"\n\nTo an adult, both of those statements are generally interpreted as a challenge to a physical altercation. So yeah, they were shook alright because I'm sure their view of it was a middle aged woman threatened to beat them up.\n\nTheir version of ding dong ditch is ridiculous and overly aggressive, but you really lost the plot with that reaction.", "Esh,    I hate to use the kids will be kids,  and they shouldn’t have been doing this,   But there were way more mature ways to handle this", "NTA - kicking a door and ringing a doorbell are very different.", "Yta got the overreacting of the millennium chasing down kids over a ding dong ditch is pathetic", "Better you than someone like that weatherman asshole on Facebook that was bragging about how he almost answered a door with a shotgun because a young kid knocked on the door to give her neighbor cookies. He was “scared.” NTA.", "A few days ago, I might have said your reaction was a bit over the top but we just got a community wide notice today advising that parents pick up their elementary school kids or make sure they walk home in groups - not pairs but groups - even if they only live a block or two from school because there are middle schoolers going around beating up LITTLE KIDS. And when I say beating, I mean *beating*. \n\nMy point being, maybe it is time for a healthy dose of fear for some. NTA.", ">and they admittedly looked scared as shit lol\n\nGood! Like you say ding dong ditch is one thing but kicking someone's door so strong that you think someone is breaking in is something they should remember not to do  \n\n\nNTA", "Divided here. NTA for being upset or even chasing them down and yelling at them. But there is a pinch of YTA for cursing so vehemently at them. I’m sure you know but the moment that you start throwing swear words around, especially at kids, you start to loose some footing in your argument. \n\nI’d say 90% NTA. 10% YTA.", "Info: your husband was outside doing lawn work and didn't notice 3 kids walking in your yard or running away?", "NTA. The kids in my neighborhood stick Kraft cheese on peoples car. If you go after then, their parents send their attorneys.", "NTA. Our house used to get egged by the local yob kids, until one day my mum drove after them in her car. One of the kids had a broken leg and was wearing a cast. His mates all ditched him and mum caught up to him and yelled her head off at him.  \n\nNever egged again.", "NTA but you are now their awesome story about that terrible adult who reacted and they are likely going to retaliate because they got such big reaction.", "NTA Probably did the same sort of thing, but it was just the knocker or the bell, we were on bikes, one friend turned the wrong way into a cul-de-sac and got a slap.\n\nas for halloween I suspect they will be back, so chocolate covered garlic cloves mixed in with the other sweets might be nice :)", "NTA, your reaction could have been a bit more controlled, but they are old enough to know they shouldn't be doing stupid things like playing ding dong ditch.  At least now they'll be too scared to do it again!", "You did well.   I hope it scared them", "NTA OP.  They should consider themselves lucky that they ONLY got a tongue-lashing.", "NTA", "You should have grabbed them with your adrenaline fuel, and locked them in the trunk and drove them a couple counties away", "I will never understand how it is to be an American. You have a door camera, you have a car, you have so many things. And you are so frightened? What the actual fuck?\n\nThis was a normal, albeit annoying prank we did some 30 years ago in my country (Sweden). It isn't exactly great, but I don't understand how you can't remember how it is to be a bored preteen?", "NTA\n\nand you probably just taught them a valuable lesson. Well done.", "Oh dear. I think you have now become the number 1 target for the neighbourhood demons. NTA though.", "NTA but it would maybe have been best if you had not reacted so angrily as it may rile them and make things worse for you. I had a fairly similar situation with some children knocking at my door and running away several times, then one day I saw them sitting in the street and I said to them I had seen them knocking at my door and running away and could they not knock again as I am disabled and since then they haven't bothered me.", "The car thing might have been a tad excessive, but if it works it works 🤷\n\nNTA", "NTA. Scare the shit out of them so they respect your space and then find where they live so you can tell the parents.", "My friend likes to say \"one of them, half a brain, two of them 1/4 of a brain, 3 of them, no brain.\"", "Yup, me and some kids from the village I grew up in did that once though we called it chap door run. Guy jumped in his car and chased us round the village, only lost him since we decided to take the shortcut that went from the top of the village to the primary school, to continue following us, he would have had to go all the way round to the bottom end, or get out and chase us on foot. We loved it and was probably the best laugh we had in a long time.", "12 year olds can't afford toilet paper and eggs anymore.", "About 15 years ago, a guy in our neighborhood pulled his rifle on kids doing this.  How do I know?  His neighbor told us.  Why did he tell us?  He caught my son and another kid playing DingDongDitch. 🙄\n\nWe had a pretty serious talk with our son that week.  Thankfully, he survived his teens.", "A few days ago, I might have agreed the reaction was a bit over the top but we just got a community wide notice today advising that parents pick up their elementary school kids or make sure they walk home in groups - not pairs but groups - even if they only live a block or two from school because there are middle schoolers going around beating up LITTLE KIDS. And when I say beating, I mean *beating* like, admitted to the hospital beating. Multiple different incidents, each perpetrated by different kids. For months leading up to this, we’ve had an increase in all sorts of ‘nuisance’ behaviors from the middle school age group. My point being, maybe it is time for a healthy dose of fear for some.", ">This is the kind of behavior kids are told is predatory and you likely scared them beyond reason\n\nGood. I hope it scared them. You don't fuck with other people's shit.", "self projecting much?", "A few days ago, I might have agreed the reaction was a bit over the top but we just got a community wide notice today advising that parents pick up their elementary school kids or make sure they walk home in groups - not pairs but groups - even if they only live a block or two from school because there are middle schoolers going around beating up LITTLE KIDS. And when I say beating, I mean *beating* like, admitted to the hospital beating. Multiple different incidents, each perpetrated by different kids. For months leading up to this, we’ve had an increase in all sorts of ‘nuisance’ behaviors from the middle school age group. My point being, maybe it is time for a healthy dose of fear for some.", "NTA. those kids are lucky you’re only “yelling in the streets” kinda “crazy” and not “open the door with a fully loaded double barrel” kinda “crazy”. If they can take this to heart, then you might have just saved them from bad injury one day", "Motion detector sprinklers are awesome.", "NTA for the sentiment of not wanting the kids to do that, but to chase after them and yell and curse at them? YTA for that. It scared you. Okay cool. Could've just followed them a bit and when they went home talked to their parents or something. But they're just kids. Chasing was too far imo and I'm not one to take bs from kids very easy myself", "Get a lot of candy for Halloween lmao", "Ha.", "We got the idea the first 2 times you cut and pasted this comment ;)", "being honest tbh but i was trying to explain kids just dont give a fuck what they do", "Ding dong ditch done incorrectly is when you deserve the trauma. This is how kids in my neighborhood learned that adults can be really sad too.\n\nThe little idiots hid behind my car, forgetting that glass has this tendency to be see through. One of them realized and asked how I was doing. My cat just died and I didn't feel like lying to him.\n\nThey all were very remorseful, slightly traumatized but never did it again.", "And boy, do their parents hate you for giving them that sugar rush 😂", "Maaaaaan fuck them kids.", "Not ones that would lie credibly, no.  \n\n\"This crazy lady chased us in her car for *no reason whatsoever* officer\"  \n\n\"They all kicked my door in unison and nearly took it off its hinges. I wanted to scare them so it wouldn't happened again\"  \n\nWho are the police going to believe?", "“Yeah officer, we just tried to ding dong ditch her and she chased after us, tried to run us over and the threatened us.”\n\nWhen my oldest child was 10, she had these 2 girls who were bullying her in her class for several months. The way that they would lie and manipulate the teachers and their parents was scary. Middle schoolers can definitely lie well."]}