{"id": 28469, "submission_id": "172stk6", "title": "AITA for refusing to stop spoiling my daughter?", "selftext": "Me(45M) and my ex Hailey (40F) spilt up amicably because she came out as lesbian. She is now married to Jane(41F) and they have two daughters together, Rose and Mel(14 and 10F). Me and Hailey also have 50/50 custody of our daughter, Anna (17F). \nNow, to start, every person involved in the story (except possibly me) is an amazing person. I truly love Hailey and her wife and view them as dear friends. The issue, however, involves the amount of money I spend on my daughter Anna. \nI am fairly well-off thanks to working for years on my business, and I like to buy my daughter the best of the best. She is also not bratty and doesn’t act “spoiled”. She always shares the stuff that I get her (designer bags, dresses,tech, even her new car) with her step sisters and they have an amazing relationship. I also make sure to buy equally expensive gifts for all three girls when it comes to special occasions as a good family friend should. However, my daughter has a much bigger allowance than her step sisters and that obviously shows in the stuff she buys for herself. So far, I had not heard any complaints from anyone. \n\nThat is until Hailey came over the other day to talk, and asked me if I can tone down Anna’s allowance a bit. I asked why, and she told me Jane’s sister was worried when she found out about the arrangement. She believe you can’t raise kids in one household with different lifestyles without creating resentment, and while they may have an amazing relationship now, that might change when the two girls get older and start to understand concepts like wealth and class. However, I think that applies more to situations where one side of the family is starving and the other is fed with a silver spoon, not discrepancies in the amount of Taylor Swift merch owned, especially since Anna always shares. She also is not allowed to spend her money on traditionally family experiences (like Disneyland or trips) without offering it to the girls too.And frankly, I worked hard for my money and shouldn’t be obligated to consider the impact on another family’s dynamic before spending it. And there is no evidence that their relationship is suffering as a result of money. \nBut on the other hand, I’m worried about what if Janes sister is right, and if this could be planting seeds of resentment. If that is true, I’d rather my daughter have a better relationship with her sisters than a larger allowance. \n\nAita if I refuse to stop spoiling my daughter? Please be brutally honest", "created_utc": 1696749115, "permalink": "/r/AmItheAsshole/comments/172stk6/aita_for_refusing_to_stop_spoiling_my_daughter/", "score": 2964, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I am spending a lot of money on my daughter and that might make me the AH cause I may be creating resentment between her and her step sisters without knowing it.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Big NTA and Jane's sister need to mind her own business. It's up to Hailey and Jane (with your help, which it sounds like you would give willingly) to raise their kids to realise difference in circumstances, wealth, class etc and what is really important. \n\nTBH it sounds like Jane's sister is jealous and is the one who's going to cause resentment amongst the family, so I would tell her to keep her opinion to herself. It's completely up to you how you spend your money.", "Anna has shown responsibility, class, and compassion with her allowance privileges. She shares with the other sisters and has, from what i can read, stayed humble.\n\nWhoever this sister is has no place in speaking upon the relationship you and your daughter have when it comes to money. Jane's kids are not your first priority. Anna is. \n\nThe sister herself is projecting her insecurities onto the situation. \n\nYou STILL spoil Jane's daughters for special occasions. The fact that you do that is amazing. You are still including everyone. So does Anna.\n\nI say keep doing what you're doing. Last but not least, if anyone harbors resentment towards someone else for what they have, especially when their family has worked their whole lives for that sort of privilege, that is their problem. That's hard earned money. Your hard earned money.", "NTA. \nIt's your money and you can spend it however you want.\n\nShould any problems arise It's Jane and Haleys jobs as the parents to explain to their kids why the dynamics work as they do.\n\nIt wouldn't be fair to basically change the way you treat/spend money on your daughter.\n\n\nEdit to correct spelling", "NTA - Jane's sister, however, needs to stick her nose in someone else's business, preferably her own.\n\nIf the girls don't have a problem with Anna's allowance now, they probably won't in the future. Add in, Anna will probably be going off to university soon, and then living on her own. None of the kids' standard of living is impacted by Anna having a larger allowance than her step-siblings, so honestly, I wouldn't worry about it.\n\nEdit to correct daughter's name", "NTA.  Jane's sister sounds like a busybody who goes around solving imaginary problems.  Also Reddit demands footage of Mel driving Anna's car since \"She always shares the stuff that I get her (designer bags, dresses,tech, even her new car) with her step sisters.\"", "That's unfortunately the reality of blended families. You might try to keep things equal but they will never be.\n\nYour daughter, from your accounts is well-adjusted. And you even go out of your way to gift the other girls on special occasions, something you're not actually obligated to.\n\nThe only a-hole in this situation seems to be Jane's sister who's meddling and creating problems where none existed. \n\nQuestion: Does Jane's sister have kids? Might she be angling for her kids to eventually also get cool stuff? You know just to make things fair between all the cousins. Or is she projecting her feelings of resentment about herself (how old is the sister) or her own kids being left out? \n\nQuestion: If you're that well-off, I'm guessing this will be reflected in your daughter's car and her college fund? Will you also be required to chip in for the other two to make things equal? Or only contribute as much as Hailey and her wife can? If something happens to you, will the inheritance be equally shared between your daughter and her step/half sisters? IMO, Jane's sister is a sh*t-stirrer. And you should pay her no mind.\n\nNTA", "NAH. Things can't be the same in combined families, and your daughter is already 17; she'll be out of home before you know it.\n\nSince your daughter is very nearly an adult, maybe this could be an opportunity to start discussing money, making budgets, and trying to save for bigger things she wants/needs. She'd still be receiving the same allowance but wouldn't be flashing cash as much in front of the younger girls. If you are currently spoiling her (your words), teaching financial responsibility along with it will set her up well for her future.", "NTA\n\nI have no idea why your ex would tell you she’s relaying a message about your relationship with your dayghter from her sister-in-law, except maybe to telegraph that it’s ok for you to not take the request seriously. \n\nMaybe there’s an issue, maybe there isn’t. But the good news is that either way, it’s not your problem. It’s your ex wife’s problem (managing her own family).  There are many solutions, and in none of them is it your responsibility to change how you treat your daughter.", "NTA. Jane’s sister is probably just jealous. You guys have all done well for yourself. This is not something to worry about.", "NTA. Keep doing what you're doing. \n\nYes, you're being generous but you're also assessing whether that generosity is doing harm. That's important, and good parenting.\n\nJane's sister is making judgements on parenting choices based on her assumptions and prejudices.", "NTA you Sound Like a good dad and its nice that you include the other Kids. But your First Priority is Anna and you have every right to spoil your daughter the way you like. \n\nSounds like Janes sister is bitter and Jealous about how amicable you all handled the Situation", "If the dynamic is working for all of you then Jane’s sister can be ignored or told to mind her own business by Jane.   \nIf you are going to drop her money could you just save it and give it to her when she starts college.", "NTA. \n\nThis wasn’t even a problem til the nosy sister stuck her nose in where it doesn’t belong. That sister needs to mind her own business.", "NTA\n\nLook, I'm fairly left sliding into straight up socialism. But your kid isn't an asshole, she shares everything all the time, she clearly loves her sibs and will likely share with them forever because she sounds like the sweetest of hearts. If she were even remotely a jerk I'd feel differently but it's clear that the difference isn't major and she's a genuinely lovely kid. Without knowing anything else I think Jane's sister is, at best, making systemic issue into a personal one (pointless) and at worst being a busybody bitch (the fust worst).\n\nI'd make the case that Anna clearly works to keep things pretty equal with her sisters and that if it's a real concern that ya'll can sit with the sisters and have an open convo about if they ever feel left out of the financial love fest they can come to them and ya'll will work it out.", "NTA - everyone is ok with things except for your ex-wife’s new wife’s sister. Who has nothing to do with your relationship with your daughter. Your daughter shares things with her step sisters. You even buy expensive gifts for them as well on special occasions. You are allowed to spoil your own daughter a bit.", "Awww it's sweet that you spoil all of them and try to be fair with it. Nah, NTA, if the girls are doing fine, let it be. Janes sister is looking for issues rather than spotting legitimate ones.", "NTA.  That would be Jane's intrusive sister who sounds jealous.  It's fantastic you buy for all three girls and not just Anna.  You've done something right because Anna shares with her sisters also.  Keep giving Anna the same.  If it becomes an issue it's up to Jane and Hailey to explain Anna has a father who can provide things they can't.", "NTA, but listening to a good old Jane's sister is an amazing way to cause resentment! \n\nYour daughter knows and understands her luxurious life and share that with her sisters, NOW say you take that away and say 'Oh you can't have this anymore because some people believe it will make your sisters feel unequal' who's gonna feel like they are below the others? Your daughter. \n\nEven if you don't word it this way The kids will still feel it some way or another\n\nThe kids know they have different parents, which means differences in how you live, nothing will change that", "Your daughter is 17, so Auntie is a bit late with this opinion. Going into adulthood is precisely when keeping things \"fair\" won't be possible.\n\nIt's late enough in your daughter's childhood that this concern is a bit odd.\n\nIs her concern really about Taylor Swift merch or is she planting seeds for what's next? Or is it actually your ex thinking of the future and using the Auntie as an excuse?\n\nBecause the truly large expenses are about to come with college tuition, weddings, and homes. These won't be the same for all the kids.\n\nA sit down with your ex might be needed to understand what her actual fears or worries are. It likely isn't just about the allowance as it's college application season.\n\nNTA", "NTA? Who tf cares what Jane things until Jane miraculously becomes your daughters mother she don’t get an opinion", "NTA", "NTA - tell your ex and Jane not to create problems where there are none in your co-parenting relationship. You’re all doing amazingly well. Your and Jane need to stand up for themselves, Anna and you in this case and tell the sister to back off", "While I can see where she is coming from, but this is your money. You do with it as you please. As the girls grow older, it is up to them to teach them what really matters. Family or money.\n\nNTA", "Definitely nta. you seem to genuinely care about your daughters best interest. That’s all you can do. \n\nI agree, I know people who have resentment issues toward step families for financial reasons but in every situation it was because one side of the family was truly poor/struggling.\n\nAnd it sounds like Anna is a good kid, but If you’re sitting on a pile of money and you don’t share with her, she may resent you some day too. Hopefully not for a lack of Taylor swift merch. But as a parent if you can afford to feed, clothe, educate, and reasonably support her until she’s old enough to do it herself, I think you should.", "NTA at all\n\nBy your description, you already give children who are not yours a ton of money and gifts. Just because your ex wife started a new family doesn't change how you get to treat your own daughter with your own money. Keep being a great dad and friend!", "NTA toning down her allowance isn’t going to change the fact that she is more well off than her sisters. Will you be asked to not help her with college expenses, buying a house, funding a wedding etc because your ex and her wife can’t afford to do the same for their kids? Are you supposed to not leave her a big fat inheritance in your will just because her sisters won’t have the same from their parents? You are giving your daughter the best life you can while managing to teach her how to be a sweet, caring, mindful person and that’s exactly part of a parent’s job.", "NTA. Take care of your child how you see fit. Tell the ex to teach the other girls how not to be resentful if they become that way, or jealous. That's parenting!", "If your daughter isn’t bratty, shares her things (which she doesn’t have to do), you buy children who aren’t yours expensive gifts (which you don’t have to do either) then everyone needs to mind their own business. \n\nIs this a new thing or has it been going on since you and your ex split? If it’s been consistent for ages then they can’t say anything. If it’s such a problem then they should’ve mentioned it sooner", ">She believe you can’t raise kids in one household with different lifestyles without creating resentment\n\nFor who? She can't seriously believe that it wouldn't create resentment for her to take away Anna's money after she was tossed into two new family dynamics. If she wants Anna to resent her and the new family members, then she's on the right track. NTA.", "James sister is the AH, simples", "I think this is not a matter for Jane's sister, but you, your ex, her wife, and the three kids.  They are old enough to have an honest conversation.  \n\n\nJane's sisters concerns are not invalid, but there is also not a one size fits all definition of sibling relationships, especially in a blended family.    \n\n\nI do have a question though, would it bother you if Jane spent more money on Mel\\\\Rose than she did on Anna?", "NTA why your daughter will have to pay for you ex choice ? First of all why is she obligate to share ? You are her a father she does not have to pay for adult choice too bad for her stepsister but it absolutly not you problem and asking that YOUR daughter have less just to cuddle the stepsister is insane. I m sad for her...", "NTA u can choose how u spend ur money on ur daughter however from experience of the same thing in my family, it did cause issues and resentment and strained bonds", "NAH - I think you sound lovely and are doing the absolute right things. And the concerns shared are genuine, but also don't need to be concerns if nothing of the sort has ever shown. But if it does start to seem to be an actual issue then yeh, re-evaluate as needed and relevant. \n\nI do have one question though, why do you refer to them as stepsisters if they are her mother's kids? They are her sisters - albeit half-sisters. But sisters none the less. That night be problematic in future in the sense of hurtful and diminishing? \n\nI'd hate it if someone referred to me as my sister's stepsister. We are half-sisters but we share a dad. We are sisters, it shouldn't matter either way, they are siblings.", "NAH. If their daughters aren't being home-schooled, they've already exposed to the subject of wealth and class.\n\nI hope you are teaching your daughter about empathy, helping the less fortunate and saving and investing money, not just spending lavishly because she can.", "YTA it's not fair on the other kids and also it's not a good idea as she heads into adulthood - I speak from experience as my absent father sent me extra spending money regularly in my teens and during my time at university and it helped me develop some very bad habits such as spending far too much on clothes and restaurants and cigarettes ... I realised it was bad for me and got him to stop but it was too late. My daughter had extra money from her dad while she was at university but saved it all up so she had a nest egg ... so not all kids are the same. But my daughter was dirt poor in her school years and knew the value of money already. Your daughter is conversely being encouraged to spend a lot of money on frippery and superficial things like clothes and fan merch. This is NOT GOOD.\n\nTake some gentle direction from the mother of your child, and put the extra you save into a bank account for her or something so that when she moves out on her own she has a deposit etc.", "INFO: how much do you give Anna for her allowance?\n\nI think the issue here is whether you are giving Anna an allowance which is well outside the norm for a kid of Anna's age, even if she has a well off parent.\n\nVariances in allowance is normal when you have a family made up of siblings from separate marriages. Hailey and her wife should give each of the 3 girls an equal share of what they can afford as an allowance (or very similar, since Anna is 17 I'd assume she'd get a bit extra than her younger sister who's 10). OP, on the other hand, only has 1 daughter, so you can afford to allocate 100% of your allowance budget to 1 kid, instead of splitting it in 3 as Hailey and Lisa must do. For this reason, Anna's sisters shouldn't resent her in any way. \n\nTo clarify, OP, you're entitled to give your daughter whatever you want if you can afford it. You're not T A for having money. But you'd be T A if you were giving her too much money, simply because kids don't need to have copious amounts of cash.", "NTA- you are free to do what you want. \nHowever, taking the current situation out of this, spoiling your daughter, regardless of her gratitude, may  eventually backfire and I say this so kindly as someone with privilege. Our daughter grew up wanting for nothing, really. We taught her the value of things and she never asks for anything. Right now she’s fixing up an ancient grandma car we got for $500 to be her first car. We did the right things and didn’t give her every material thing, but we simply live a privileged existence. \n\nBut kids need grit. They need to not have all nice things at times, to show them how to sacrifice, have patience, and to not have so much of a safety cushion. By no means do I mean deprive her of love, support, and affection. I just mean…. not always having the nicest material things in every situation, and instantly. Though she is appreciative, she will also have some sort of intrinsic expectation. I have the sweetest non bratty, sharing kid. But I still struggle and we have to make conscious decisions to let her be disappointed. Let her not have the best of everything. Because it’s easy when you have money! Oh, you need earbuds for school? Ok get AirPods go pick ‘em out. We have to be constantly curating this…. struggles not the right word but just…. Grit! So instead it’s “you want air buds you have to earn half the money for it”. \nAnyway, I hope you get to see this, I hope you take it as I intended- just friendly advice from one parent to another.", "The problem I see is that no teenager actually NEEDS designer purses. Your daughter is living a lifestyle she may not be able to sustain once she joins the working world. And unless you already have her college tuition covered, the money would do better for that.\n\nIt sounds like the person with the problem is your ex-wife's partner's sister, who may just be expressing her own jealousy of your daughter's bling. If your daughter truly is sharing the wealth, then I don't think there is a problem. NTA, but keep an eye on your daughter's attitude.", "NAH Hailey might be noticing a dynamic happening that will become toxic. She lives with the three girls and might have a deeper insight.I wouldn't just keep giving money and ignore Hailey's concerns. I would talk to her more about it.If you DID lower the allowance, perhaps you could instead start investing that money in her name.  \n\n\nAnyone who's claiming the concern just comes from jealousy isn't really that emotionally intelligent. Don't listen to them. I'm sure you already know Jane isn't just being jealous.", "YTA You are creating reasons for Anna's sister to resent her. Of course, sibling resentments over inequalities in their own home aren't necessarily about one child starving while the other is \"fed with a silver spoon\" There are plenty of ways to create more nuanced resentments and you are doing that. And that fact that Anna shares? That's charity and would cause resentment in itself. And that \"other family\" whose dynamic you don't care about because you should get to spend your money as you like? That's your daughter's family, not some stranger. You are making a situation that could cause rifts now and in the future among the sisters. That's worth a designer bag for a teenager?", "YTA.   \n\n\nYou and your wife have 50/50 custody. That means yes, you need to take her views into account, and her views include the impact on family dynamics of one of her daughters having a much bigger allowance than the other two.   \n\n\nYour buying your daughter expensive presents isn't the issue - you're her dad, you get to do that. The allowance your daughter gets, however, should be one that you and her mother **both** agree on.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMe(45M) and my ex Hailey (40F) spilt up amicably because she came out as lesbian. She is now married to Jane(41F) and they have two daughters together, Rose and Mel(14 and 10F). Me and Hailey also have 50/50 custody of our daughter, Anna (17F). \nNow, to start, every person involved in the story (except me) is an amazing person. I truly love Hailey and her wife and view them as dear friends. The issue, however, involves the amount of money I spend on my daughter Anna. \nI am fairly well-off thanks to working for years on my business, and I like to buy my daughter the best of the best. She is also not bratty and doesn’t act “spoiled”. She always shares the stuff that I get her (designer bags, dresses,tech, even her new car) with her step sisters and they have an amazing relationship. I also make sure to buy equally expensive gifts for all three girls when it comes to special occasions as a good family friend should. However, my daughter has a much bigger allowance than her step sisters and that obviously shows in the stuff she buys for herself. So far, I had not heard any complaints from anyone. \n\nThat is until Hailey came over the other day to talk, and asked me if I can tone down Anna’s allowance a bit. I asked why, and she told me Jane’s sister was worried when she found out about the arrangement. She believe you can’t raise kids in one household with different lifestyles without creating resentment, and while they may have an amazing relationship now, that might change when the two girls get older and start to understand concepts like wealth and class. However, I think that applies more to situations where one side of the family is starving and the other is fed with a silver spoon, not discrepancies in the amount of Taylor Swift merch owned, especially since Anna always shares. She also is not allowed to spend her money on traditionally family experiences (like Disneyland or trips) without offering it to the girls too.And frankly, I worked hard for my money and shouldn’t be obligated to consider the impact on another family’s dynamic before spending it. And there is no evidence that their relationship is suffering as a result of money. \nBut on the other hand, I’m worried about what if Janes sister is right, and if this could be planting seeds of resentment. If that is true, I’d rather my daughter have a better relationship with her sisters than a larger allowance. \n\nAita if I refuse to stop spoiling my daughter? Please be brutally honest\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Jane’s sister should mind her own business, as this only seems to be a problem because she thinks it’s one. NTA. Keep parenting the way you want.", "The reason she is sharing is because she has things to share. If you make cuts on money, she will make cuts on her sharing. You will than get the resentment which you are all trying to avoid. You must talk with your daughter and make the deal which work for all of you.\nBtw, Jane is TA", "NTA. It sounds like your daughter has been raised very well, and so have the SS's, everyone is happy, Jane seems to be pushing am unlikely potential hypothetical, maybe projecting a situation that happened to her. Maybe talk to all the girls and make sure they're happy and fully understand the situation. When they get older and start their own careers, you wouldn't tell the highest earner to downgrade their job so they can all afford the same things, that would be ridiculous.", "NTA-you sound like an amazing dad, Anna sounds like an amazing daughter and Jane's sister sounds like she needs to mind her own business.", "NTA, your relationship with your child is your personal matter no other person should have a say in it and specially not a 4th person who is neither your nor your daughter's immediate family. \n\nThink like this if you would have asked your ex to not have children or to have just one child so that she can also provide better for your daughter then would it have been fair?? Would she had allowed you to dictate her relationship with her partner or children, then how can she ask you to do this??\n\nYou need to put clear boundaries with this distant relative, and make your ex understand that you are  responsible for your daughter first and she as a mother should be more mature and take a stand for her daughter and should not try to please only the new family.\n\nHow are you so sure that you cutting her allowance or reducing her 'privilages' will not make her resent you or her siblings in some way??\n\nThis person is projecting her insecurities on a relationship that doesn't affect her life, and your ex and her wife are allowing her. \n\nYour only responsibility is to look for your daughter not for some unsolicited advise. It's your ex's responsibility to make her other two children understand if any such situation arises in future.", "I think you are most definitely NTA.  You're a good guy that loves his daughter.  You worked hard for your money and want to spend it on your little child whom you love.\n\nNow with that said, you are in a difficult situation and I can certainly understand where Hailey is coming from.  I think this is a great chance for a learning opportunity.  Not everything in life is fair.  You can have a talk with your kid.  Hailey can have a talk with her kids.  \n\nShe left you and is now with a new marriage partner.  This is her decision and as such, she is happy right?  Well if she is happy, then she must be happy with all the circumstances that come with it.  \n\nThis is just my feeling and there are no right answers.  But I will just say this.  It seems like you are the only one being punished in this scenario, which is I think an unreasonable request.  If she is divorced, and she has a different life, and she doesn't like that you are making more money... Well... That's up to her to come to peace with her decision... Right?  Why is it your fault that you have more money than her and her wife?", "NTA and suddenly dropping your daughter’s allowance to accommodate her sisters runs the risk of creating resentment towards them. At the moment she is happy sharing and all girls benefit but she not be so willing if she suddenly started getting less to spare their feelings.", "Jane’s sister should stay the f— in her lane and butt out of things that are none of her business. Sounds like she’s 100% out to stir up drama.\n\nNTA.", "To me this reads like Jane herself is envious of your relative wealth and is projecting that onto her nieces.  If I were Jane and Hailey, I'd be more concerned about her poisoning the well than  your money.  \n\nIt sounds like you are amazing co-parents to your shared child, and you are an amazing male influence to their other two daughters.  It sounds as though you have raised your daughter to be thoughtful and generous.  Spoiling your daughter is far less likely to cause resentment between the sisters than having you suddenly scale back money because of resentment that so far is not there.  \n\nI'm glad that you are concerned about the potential for this to cause problems in the sister relationship, but until there is evidence that this is the case I would keep doing exactly as you're doing.", "I feel like Jane's sister is jealous of what you guys can provide. Question, does she have kids?", "NTA", "NTA, Jane's sister needs to mind her own damn business", "NTA. It's not your responsibility to ensure someone else's children don't feel they're hard done by. Which they're not. All three girls have everything they need. The mothers can also work hard and make the money you did.", "NTA. \nYou shouldn't have to treat your daigjt differently because of something that hasn't happened yet and may never happen. \n\nThis is probably about the kids not thinking it's fair but rather Jane can't give the same allowemce to their kids. Jane may have said something to her sister about feeling bad about it and her sister chose to involve herself. \n\nThe families are different, financials are different. This isn't your issue.", "Jane's sister shouldn't even know about the financial arrangements of your household.\n\nAnna is older so yes, she will get different and more expensive items. She also has a different father from her step sisters so she will benefit from that.", "NTA Its none of Jane's sisters business. This is your daughter you only have one life and you should spend what you want with her and give her the best life. She isn't a brat or spoiled or demanding or showing off so you have raised her well.\n\nHer half siblings know she has a different father. They have both their parents yet your daughter's parents are split up and live separately. She doesnt have the same family set up as them, they are not equal anyway. Technically they are better off than your daughter because they have what child wants  - their parents together. Money cant compensate for that.  So they are better off. So why should your daughter also lose out on the money and gifts you can give her", "NTA and Jane’s sister needs to keep her nose out.", "NTA. Me thinks Jane's sister is the one having trouble with HER kids because her family doesn't have the wealth of OP or his ex wife and her partner and her kids are complaining about the stuff your kid and her step sisters by extension have.\n\nthe resentment she's talking about, is Jane's sister's resentment of Jane.", "NTA. If you want to compromise a bit, though, you could lower Anna's allowance and put the difference in a bank account so she can use this money when she's 21 or something. But you don't have to.", "She's not the step-sister, she's the half sister if the girls are of your wife.", "NTA! Why is Jane's sister meddling in the way you should raise your child.\n\nBesides by the time the other girls become teenagers or adults, Anna would have already moved out for college and work.", "NTA.  Your money, your daughter. And if she is already 17, won't she be going off to college soon? Then, nobody needs to be offended by the amount of money you give her.", "NTA\n\nIt’s not Jane’s dynamic, and she doesn’t get to decide this stuff.", "Jane’s sister needs to mind her own business. Sounds like she’s jealous. \n\nNTA", "NTA. You've made sure the other girls would be taken care of as well. The only difference is your bio daughter receives a bigger allowance. If your daughter became a spoiled brat and came with attitude then yeah, it'll need to be addressed but in this instance, keeping what you're doing makes sense.\n\nAs for Jane's sister, she does need to mind her business. Nobody likes meddler. If she has a problem with you raising your child then she can adjust her own style for her own kids which wouldn't be your business anyway.", "NTA\n\nreads like your kid already shares her allowance with her step sisters\n\nlooks like the woman is trying to cause hassle", "Sounds like jealousy being dressed up as concern. Tell the mom to stop trying to fix something that isn’t broken. What if one of the girls ends up being a higher earner than the other two? Or marries into a wealthy family? When does the “fairness” stop?", "NTA there’s no reason to change since your daughter did nothing wrong and Jane sister needs to stay in her place", "[removed]", "NTA and Jane's \"sister\" needs to mind her own business. Sounds like Jane might be a little jealous that she can't give the same amount to her daughters. Even if you do everything right, there's always going to be that one person that just doesn't agree. The good news is your daughter is almost 18 and an adult, and you don't have to send money thru anyone else's hands but hers. You sound like a great guy who is very thoughtful and careful to think of everyone's feelings. Keep doing you.", "There hasn't been any resentment up to this point she is the one that feels resentment and frankly she's almost 18. What does it matter at this point this is between you and your daughter and you have every right to give her what she deserves the reality of life is, there's always gonna be somebody with more and they need to learn that early", "NTA\n\nYou are not spoiling your daughter. Jane's sister has her nose in something she ought not and is creating waves that were not there. It sounds like the girls all get along just fine. Anna has learned to share the wealth. \"Toning it down\" will hurt your and your daughter's relationship. She will believe she did something wrong to suddenly have less or you are more worried about what other's believe your relationship that you are suddenly punishing her for it.\n\nSuggestions: Talk to Anna about starting to save a percentage of her allowance gotten now to spend for college, because college is expensive or if she wants to take a gap year she could save for that. This would make it look like she is getting less allowance. AND/OR if you have the money why not treat the other two to smaller more age appropriate allowances. You have a great relationship with your ex and her wife, why not be a bonus uncle. You should talk about this avenue over with your ex and her wife before doing it. OR you could gift the girls a monthly entertainment budget for Anna to take the girls out specifically for her to treat her younger stepsisters.\n\nAs stated earlier, you are doing right by your daughter. She isn't acting like a brat or being stingy. I highly doubt there is any resentment and if there is it is being sewed by the girls' aunt who should be told respectfully to stay out of other people's business. Janet is just trying to cause problems, enough already that your ex had to come to speak to you.", "Kids can be raised differently in the one family.  We are more financially secure from our first to last.  The sister needs to but out. Sounds like you are all doing a great job as is.", "NTA\n\nBut are you sure this is really the sister's opinion or is there a chance she is used as scapegoat by Hailey and Jane?", "NTA, tell them to keep their noses on their face and out of your business. \n\nThey have no say on how much you spend on your own daughter, especially when you’re not part of that family unit.", "NTA\n\nYour daughter sounds lovely. She shares when she is not obliged to. \n\nYou are generous to your ex's kids too. \n\nThe only person who has an issue is your ex-wife's wife's sister. And her interference is the thing which is likely to lead to resentment. She is poking her nose into an arrangement which works.\n\nMoreover it is for your ex and her wife to explain to their children how blended families work.", "NTA. She's your only daghter, you're responsable for her and for her only, Jane's ssiter (if not JAne herself) is just jealous, don't ever let anyone convince you to treat your daughter differently than you are, it's your money and she's your daughter, give her only the best. Your ex, her wife, the sister  and the other two girls have to accept it and suck it up, you owe them nothing, take care of your daughter.", "NTA, you care so much about not only your daughter but also children of your ex and her wife. Most people won’t bat an eye for children which are not theirs. Seems like Jayne sister is jealous AF because you all have healthy family dynamics. Don’t bother. \nI know it will sound a bit gloom but one day you will depart from this world and your daughter will be inheriting whatever you will leave her. Should you donate your wealth somewhere else so your ex wife girls don’t feel left out? Absolutely not. Life isn’t always perfectly fair and you already doing as much as you can to balance those inequalities.\nSpeak with your wife and Jayne, they also have to understand that Anna is your only child and you have right to treat her well.", "I don't think anyone is the asshole here. The daughters are raised right and all of you have great relationships. Sister's opinion may come in different formats. Perhaps she's seen other families who have raised spoiled children or clear power differences between divorced parents that tend to play with their child's feelings. That happens, it's a normal fear. You just have to talk to her and see if she is very bossy or just disagrees a normal amount but still respects you.\n\nTalking to the girls would also be good, but I assume you've already done that. They happen to be great, but a bit of doubt could happen every once in a while. A classmate's comment, another person abusing their wealth, idk. Just as long as they feel safe to communicate their feels (which they probably do), it's fine. Kids can be humble, mature and all of that, but we can't assume that they'll always be as responsible as an adult (and many adults themselves aren't).\n\nOther than that, just the typical advice. They'll learn how not to waste money, how to work for their own benefit... You're probably doing a good job already.", "NTA. By the sounds of things, everything is going fine as it is. You’ve raised a caring daughter and it‘s not like you leave your stepdaughters out of anything. Keep doing what you’re doing. Jane’s sister should just mind her own business.", "NTA the only one with a problem here is Jane's sister who should just mind her own business. This sounds like a great family dynamic and that your own approach to Anna's younger siblings has clearly rubbed off on your daughter who willingly and openly shares and supports them. Good parenting and siblinging all round.", "NTA and also when did janes sister start involving herself in your things well where ever she started she must stop right there because it seems neither Jane or your ex wife had a problem with it and also I think your a very good person for also spoiling the step daughters too and not just your own daughter so no NTA", "Nta. There could be some resentment. But the parents should take care of it. And i think it wouldn't be a big deal.", "NTA. There is quite a gap at this stage between them all, 17, 14, 10. They should all understand that their allowance, whatever it is, isn’t a right, or an entitlement, nor is it a measure of how much they are loved. Having more or less money doesn’t mean that you are a better or more deserving person. With the gap in age, it should be understandable that they don’t have the same allowance. If the difference in allowance was exponential then that can create resentments in both directions. What is important is that an allowance doesn’t prevent them from becoming independent as young adults.", "NTA. This is coming from your ex-wife’s partners sister for goodness sake, she doesn’t get a say in how you treat your daughter. If your daughter was being a brat or refusing to share, I might think differently but she’s not. Stay as you are, deal with any ‘bratish’ behaviour as and when it happens, and expect your ex and her wife to do the same with their kids.", " HUUUUUGE NTA OP.  Jane’s sister needs to keep her opinions to herself instead of trying to foist them on you.", "NTA. Many families have a sliding scale of allowances (and yes - I know that isn’t the case here) depending on the age of the children, so income equality isn’t an issue. I think by the time it is likely to be more of an issue, the eldest is most likely not going to be at home full-time anyway.", "NTA and I think the sisters would only have a problem with it because Janes sister told them to… its non of her business.", "So Jane's sister obviously doesn't realize that her nieces are literally reaping the benefits of being in  your circle. She needs to step away or her nieces will resent her. Does she want an allowance or have your daughter share with her, too? Because that's what it almost feels like.\nEdit for the NTA", "No. You all sound like emotionally intelligent and aware adults. If you actually discover a problem address it then. Right now you’d be changing what you do because of a theory based on someone else’s perception and values, and that may create resentment. You’re teaching your daughter gratitude and generosity and what better way to teach the value of money.", "NTA\n\nIt's none of Jane's sisters business. End of.\n\nYou still make an effort to spoil her step sisters (when honestly you could just not), and Anna to her credit shares anyway.", "I see both sides of this argument.  However, it sounds like there are good relationships and communication within the nuclear family and that Jane understands appropriate and thoughtful use of her money. Who TF is Janes sister? Sounds like she needs some lessons on healthy boundaries from your functional blended family. Totally NTA.", "I am sassy so I’d probably tell Hailey that I will provide for my daughter as I see fit and since there seems to be a problem I won’t bother providing for anyone but her from now on. \n\nIf nothing is good enough, nothing is what you get. \n\nAnna is your main concern. Not your ex wife’s new wife’s sister’s opinion on how you spend your money", "NTA, I understand Jane's worries but she needs to see that Anna is clearly very responsible and never makes her sisters feel left out. You do get the other expensive gifts occasionally, so it's like you're completely ignoring them.\n\nAlso, you have an amazing, RESPONSIBLE, kind daughter who deserves to be spoiled", "NTA sounds like Jane’s sister should mind her own fkn business and worry about her own family. I smell resentment in those comments from her bc it did not seem like a problem for you or your ex wife before. It doesn’t seem like your daughter flaunts what she has and has been respectful about sharing HER things so why should she be penalized for that.", "NTA  because you have made generous efforts with the gifts and your daughter is generous.  \nIs there creative solutions to spoiling your daughter. Instead of a massive allowance, maybe a prepaid gift or credit card she can use. Along with a kind remember to keep her extras as private as possible. As she is older her needs are different to. Sounds like you are doing things well already.", "I think NTA although I do wonder if the money might be better spent in giving an equal allowance and putting the difference into a savings account for a house or education or travel or something later. Maybe OP is doing this as well and it’s not needed but just a thought.", "NTA\n\nBut you sound oddly focused and attached on how much you like to spend on your kid. Using the term spoiling her...", "NTA\n\nThe fact that you give them anything at all can show that. And the fact that you spend as much money as you do on them in the first place shows it too. \n\nKeep up the good work OP. It's better to ignore Hailey and keep doing what you're doing. If a problem arrives with Rose and Mel then change something.\n\nAsk Rose and Mel if they have a problem with Anna's allowance and then do (or don't do) something based on that.", "NTA", "NTA rose and mel are lucky you even give them stuff. Majority of people wouldn't", "NTA and I don’t think it’s a problem. Rn the girls don’t have a sense of money and your girl is years older, it would make sense she has a bigger allowance", "Nta absolutely do not stop using the money **you earned** as you please. She’s your daughter, you have every right to spoil her.", "NTA. Jane's sister need to stay in her lane, there didn't seem to be a problem until she decided to stir the pot. Suggest to Hailey that she needs to shut her down now before this ruins your family dynamic\n\nI think Jane's sister is jealous of the happy co parenting / family situation you have with Hailey, Jane and her daughters, there's always one family member that likes to cause drama and she's it.", "One day or another, the gril will learn life is unfair, your have done more of you share to redistribute your money and it’s good that your daughter is not spoiled but generous with what she gets, NTA", "So let me get this straight (no pun intended)\n\nYour ex wife's sister in law who presumably you've never met or have limited contact with has recommended that you change how you treat and raise your daughter, and advises that you should not give her what you want to give her because it might breed resentment?\n\nThat's a big glass of NTA right there brother, and unless this lady decides to start sharing the wealth I'd tell her to mind her business and in the parlance of my homeland, tell her to get fucked.", "Jane’s  sister is a busybody and needs to get her nose out of your business. She may be jealous or just trying to start something. If Hailey and Jane are concerned what about one or two group therapy sessions with a family counselor? With and without the kids?", "I assume your daughter will be leaving and going to college or getting a job soon anyway, so what does it matter at this late stage? But even if that wasn't the case, you've already said that she includes her sisters, she shares her things, and she doesn't rub it in their faces that she has more money.\n\nI definitely think the other sister is projecting here, and also sticking her nose where it has no business being. If all of the people who are directly involved in the \"situation\" are happy with how things are going, that's all that matters.\n\nDefinitely don't stop doing what you're doing, why should your daughter suffer for the sake of some outsider with an opinion? 😏", "NTA! As a child of a mixed family i can tell you that as long as there is clear communications with the kids it will be fine. My half siblings had a different life than I did and we still get a long great and understand that we had different lifestyles growing up. I’m sure they will too. Also, even if you stop pampering your daughter that won’t guarantee her sibling won’t resent her but your daughter might have some resentment if changes are made to her lifestyle even though she’s doing things right.", "NTA.  Jane's sister wants you to figuratively give all kids at the party a present.   Everyone in this world has to learn that the birthday kid gets the presents, your turn comes later.  \n\nJane's sister is the problem here  ( or Jane, as it's possible this is coming from her with the 'sister' being the deflection to keep the relationship between you 3 smooth.)", "NTA often adults will project their insecurities in kids rather than addressing them themselves. It may be worth having that convo with your daughter about the value of money and how proud you are of her for sharing with her step/half sisters", "NTA and it sounds like Anna is a good person and already generous with her step sisters. You aren’t the same family and things aren’t equal. You shouldn’t feel bad about that though", "Definitely NTA actually you sound like a super great guy I am a single mum and was also a stepchild. First I would sell my soul for my kids to have a father like you and I’m not talking about the allowance but you seem to have adapted so well into your role as a single dad you are involved in your daughters life without bitching about the circumstances or anyone who is part of this family . My kids don’t see their dad (his choice) nor do I get child support as the work he does in often paid in cash. Second I was a step kid and the dad of my step brother never not once tried to interact with me let alone buy me gifts but that was fine he wasn’t my dad and it didn’t affect the relationship I had with step brother. There is a big difference between fairness and equality and you are being more than fair the girls probably adore your gifts. Things are not often equal in life and that is not a criticism cos fairness is much more important.\nI think you are a great dad and super guy ignore the sister and keep being you x", "NTA\n\nBut to the ex wife that runs to you because her SIL is talking about this and that. Are they not adults and think about what works for their family and not?\n\nPerhaps it’s Jane that is worried and is making it about the SIL. \n\nYou seem to be a very considerate parent and probably do a lot more than what other exs do for their families. \n\nYou can always get your daughter set up with a very good saving/trust account where she can keep money for the future if what she has is becoming a family discussion.\n\nYour ex should not allow some other SIL to dictate how you do things for your daughter but I do agree your daughter having a good relationship with her siblings is more important. As others have suggested the ex’s sil is planting unwanted ideas. \n\nShe will also be leaving when she turns 18 right so not a lo", "NTA, but i would take Hailey’s words into consideration, because she may have a point. Now this is a long story but there’s a point behind it. Growing up i had three younger siblings, and i was the oldest. My family wasn’t considered “well off” when i was growing up: my dad worked at a carpet factory and my mom worked at an ice cream plant. But as i got older, and my siblings began coming into the family and growing up, my dad ended up leaving his job and got a much better paying job as a plant manager. Now while that was great for our family in general, i was 17 at the time and had my own job, and we never had allowances, so i either got what my parents bought or i bought it with my own money. If i wanted any clothes that my parents didn’t deem appropriate pr what they wanted me to wear, i bought them. If my siblings wanted anything, our parents bought them. When i was growing up i went to school in second hand clothes from my parents friends kids, clothes from goodwill, with a mayo and bologna sandwich everyday, and had to walk. My siblings get driven to school every day, they get lunch money to buy whatever they want, and my sisters pretty much live in Lululemon. I had to buy my first car with all the money i saved up from my part time job through three years of high school, my dad gifted my youngest sister with her $20,000 dream car just because. And i know that my parents are in a much better situation financially and that is amazing, it does hurt sometimes seeing your younger siblings get the childhood you wanted, but you couldn’t have that simply because your parent didn’t have the means at the time, so i could very much understand how this could be how the younger siblings end up feeling, even though it’s not exactly the same thing.", "NTA. Based on Hailey and her sister's logic, Hailey and her wife would pay your daughter the same allowance as they pay their two girls. That's equity within the same home.\n\nThose girls are not a part of your home. Your daughter is. Singly. So whatever you do or do not pay her for allowance doesn't need to be held up to equity because it's just her. You are extremely kind and generous to purchase high value items for those girls for holidays and bdays/gifts. That should be more than enough.\n\nAt their age, they are well aware that their friends, classmates, cousins, neighbors, etc all have different lifestyles. They may not understand the exact intricacies of how or why, but they know that some people can spend more money, drive nicer cars, have nicer things, go on more vacations, etc than others. And they're not entitled to what anyone at any other house gets, because that isn't their home. If their moms want to have more detailed and thorough discussions with them about that, so be it. But I think the kids are perfectly fine with how things are with the world around them. They don't seem to be complaining at all. \n\nIt's also incredibly kind and thoughtful for your daughter to share her things. I'm not sure I would have done the same, but I'd like to hope I would have. I feel like the generosity and grace the two of you show these girls is outstanding. I don't understand why the sister would feel she has anything to say about the situation. And worse, why Hailey is poking what seems to be a perfectly content bear that is already substantially benefitting her daughters leaps and bounds beyond what most blended families expect and see.\n\nLeave the sleeping dog lie, damn.", "Sounds like they're jealous. NTA. Keep spoiling your girl as long as she stays humble.", "When I was growing up, kids would say, “My stepbrother’s father is rich.” That was the explanation. Matter of fact. Stepbrother gets nicer things because his Dad is rich. I don’t have as nice things because my Dad is not rich. \n\nLooking back my friends had the better deal because their parents were usually together and I guess their father might have been the nicer guy (maybe?) But kids can see things in black and white, and don’t necessarily internalise it as long as the messaging is on point.\n\nNTA If you work with Hailey and Anna to get the messaging right.", "NTA. \n\nThink it'll probably be alright, the age gap between your daughter and the others is wide enough that what they get or don't get would not be directly compared. \n\nNevertheless, might be good to chat w your daughter about mone, privilege and equality.", "NTA and tell Jane to mind her business. She doesn’t get a say in how to raise any of those kids.", "NTA, she is your daughter, so of course she is going to end up having more than the other girls, that's what happens in households with separate parents in general. If you were to reduce your daughters allowance, how would you explain this to your daughter, this could end up causing resentment in other ways, either between you & your daughter for reducing her allowance or your daughter towards her sisters, as she may see it to be their fault her allowance has been reduced.\n\nIf you do decide to reduce her allowance, maybe put the extra you would normally give to her in to a savings account & give it her when she is older.", "NTA. Someone's sister doesn't get a vote. Your family, your choice.", "I'm going to do a soft YTA for both of you. Your ex wife for dragging Jane into it and you for spoiling your daughter. Your daughter's mother has asked you to tone it down. Your view of your daughter's behavior and attitude is colored by your love and pride in your daughter. Trust your very good friend and ex wife when she says it's bad for you to spoil your daughter. By definition, to spoil a child is to harm her character by being too indulgent. It's the word you use. You do it to make yourself happy. Your daughter is nearly an adult and you have set her up to expect a much more luxurious lifestyle than she is likely to afford for herself anytime soon. You're setting her up to depend on you for luxuries for a very long time. I hope you're up for paying for them.", "NTA. She's your child and you're allowed to spoil her. It also sounds like she's well aware of how fortunate she is and is kind enough to share when she can.", "Finally an AITA post where the spoiled child isn't bratty and is good at sharing with siblings. For once, you're not a villain as a result of said spoiling. Jane's sister is just jealous that you probably earned more money than her so you're NTA OP. Also to mention you treat the kids equally which is a breath of fresh air where AITA subreddit is concerned in relation to spoiled children and step children.", "NTA. It's not even the family who was worried. It was the wife's sister (if it's true)! It's jealousy or putting her nose where it doesn't belong on her part. I find it quite disgusting. However, your ex asked you something and it means it's gonna be a thing now. If anything happens it will be your fault it doesn't matter if it really would be. \n\nI'd be vary from now on. Just tell your daughter she can have everything she wants while in your house but she can't take more than her sisters' have to mother's house. They can't tell you what to do in your own home. However, if they are worried they will make it a thing in their house. \n\nIn my opinion they are creating resentment as the kids will feel the change of dynamics and they will wonder. Just be ready that all those absolutely wonderful people are not gonna be absolutely so wonderful from now on. Because they made money a thing now. \n\nI'm also absolutely sure it's not about your money or girl's resentment towards each other. It's jealousy of the ex's wife or wife's sister towards your daughter and your relationship and lifestyle. Things change. Just get ready that you are gonna be the bad guy whatever you will decide anyway.", "NTA. While you may adore the lesbian couples adopted kids, Anna is YOUR daughter and biological child. Spend on her as you see fit.\nIf the birth mother doesn't like it, too bad..\nShe can demand you not neglect her. But it's not logical for the mother to complain about treating her too well.\nIt's your money. Spend it as you see fit.\nAnd the resentment issue? That appears to be something the couple has made up in their minds.\nTheir adopted kids are theirs to deal with.\nLet them hash out that situation.\nIt appears they are projecting..\nLastly, perhaps the lesbian couple isn't as close dear friend as you think.", ">She believe you can’t raise kids in one household with different lifestyles without creating resentment\n\nShe's right and it was actually a story I read here about the foster children and the husband and wife. The difference is the actual effect on your daughter. It appears that she's doing fine, for now at least. The only issue I see is that later when your daughter no longer has access to all that stuff, it's going to be really hard for her to deal with. To suddenly go from having all the major things bought for you to having to work for each thing one by one.  \n\nIt's not actually resentment between the girls but rather between your ex-wife's children and your ex-wife and partner. They're going to go to them asking for stuff and when they can't give it to them, they're going to be upset. It's not causing resentment with your daughter at the moment but could later on when their parents keep rejecting them.", "NTA. Youre going above & beyond. You could pull back on the non-kids of yours & just focus on your daughter if you wanted. But youre not. You are kind.", "I dunno, it sounds like you're perfect and your daughter is a generous angel so how could anyone here find fault", "Hard NTA. Jane’s sister needs to mind her business. \n\nYour daughter’s half sisters wouldn’t thank you for cutting back on her allowance, as they seem to benefit from it too. It doesn’t seem like any disparity has been an issue until Jane’s sister stuck her nose in, it just screams jealousy to me.", "NTA because Anna is not jane’s daughter, so she should mind her own business. OP is not the father of rose and Mel, so he can raise his own child however he wants.\n\nHowever, Anna is 17, so she should have a job, and be learning how to earn money for herself, she needs to learn that adults have to work hard to earn money. That way she can look after herself in the real world. \n\nTell Jane to leave Anna alone, your parenting style (and lifestyle) are your own business, not hers. Life isn’t fair or equal, rose and Mel need to learn that. \n\nPlease encourage Anna to get a job, don’t let her leave home unprepared!", "NTA. Anna has shown responsibility and shouldn’t be punished for another person's financial situation. Why is Jane's sister getting involved in the allowance that Anna is getting. I would suggest talking as a family and maybe dicuss what Jane's sister have said and give Jane a chance to listen to her opinion on the allowance, just because Jane's sister thinks one thing it doesn't mean that Jane thinks the same. In my opinion Jane knew what she was getting into when she got with Hailey and since Jane been there when Anna is with them then she should know how Anna is when she is with them. Don't let another person get into your head with their opinion without having a honest conversation about those things as a family. If Jane or Hailey have an issue with how much allowance Anna is getting then let them explain why and maybe try and compromise but Hailey shouldn't listen to another person's opinion on her situation without having a deeper look into her family dynamic and how her family trully is.", "You are NTA but I'd take the money and put it into savings for my daughter and ensure she has the same allowance as her sisters.", "NTA but as others have  said, James sister is and I think she’s jealous of what Anna gets from you financially", "Huge giant NTA!! But Jane's sister is. She needs to butt out and mind her own business. SHE will be the reason if any resentment happens. She'll be the one to drive a wedge btwn the girls. That being said I have a question about your statement \"She also is not allowed to spend her money on traditionally family experiences (like Disneyland or trips) without offering it to the girls too.\" Can you expand on this please cus this is the only thing that stood out to me as unfair for Anne!", "NTA the youngest child involved is 10. I’m pretty sure they know who you are and why their sister has a bit more money and stuff. If it’s the difference in how much Taylor swift merch they have, they’re all comfortable and cared for. \nThe only thing is to tell your daughter to share if she wants to, because she doesn’t need to, and to keep an eye out to make sure she values money and knows how to use it. Encourage her financial literacy as she’s 18 soon.", "When you spoil kids, the only person you destroy is the kid", "NTA. To me you sound incredibly kind and generous and Anna clearly takes after you. Carry on spoiling her. Giving presents to her step sisters on special occasions when they are not even related to you takes your generosity to a whole new level. Hailey should be praising you and not finding fault with you.", "All of these stories are either fake, or by the weirdest people on the planet. Im rich my wife remarried a lesbian shes upset that i have money to spend on my one kid.", "NAH, except for Jane's sister.  Sounds like she's just being a drama-monger when she's not even involved in the situation.  14 and 10 are already PLENTY old enough to understand the wealth difference between themselves and your daughter, but they still get along anyway.  Probably because you guys have done a good job at ensuring the family got \"blended\" and ensuring they all see each other as sisters. It's not your responsibility to make sure their family dynamics stay balanced, but it sounds like there's not even any resentment to worry about in the first place.  Especially if your daughter is sharing her stuff anyways and isn't flaunting it.  Jane's sister needs to butt out.", "You had me entirely on your side until you said “I worked hard for my money and shouldn’t be obligated to consider…”. Yes, you worked hard for your money, but a lot of luck also has gone into producing your circumstances. You said your wife and her wife are amazing people - I’m assuming they also worked hard and didn’t slack off. My point is, as a human living in a society of other humans who are impacted by your behaviour, you certainly do still have an obligation to think about that sort of thing. I don’t think you’re the AH in this situation, but you need to reconsider some of your perspectives. And I’m saying this as someone from a well-off family, who is also well-off herself", "NTA. So Janes sister decided to plant the seeds of a problem that doesn’t exist? There are differences in people’s wealth and that’s just a fact of life. Her sister may have a point if your daughter lorded her purchases over the other girls. But she doesn’t. I’m amazed her sister just sees in terms of dollars and not what a generous relationship the girls directly involved have. Sister needs to mind her own business and your ex should be a little less worried about this woman’s unsolicited opinion.", "NAH If there's a large disparity it could cause or worsen a rift any number of ways, but that's not a guarantee. It's good for the adults to be aware and discussing this.\n\nAs Anna is 17 now, you should include her in the adult category for this! She's shown she's responsible and generous, and will have to manage her own money soon. Leaving home she will meet a wider variety of people from different income levels and it's good for her to learn NOW about how to navigate those differences. What if she's the richer party in a romantic relationship? What if she's much poorer and comes to depend on a partner so much she doesn't feel she can leave? When eating out with a group of friends how do they pay? What are signs that a friend may feel too awkward to say that Anna or their group of friends are choosing expensive activities they can't afford? (And what if they don't want others to pay for them all the time?) \n\nIt's possible that step-mom is picking up on things OP is not. Anna may not appreciate how hard money can be to come by, so gives it away too easily. She may be a blatant anomaly in the community, dressing or acting in ways that draw attention... and it could be her step-sisters getting asked why she gets to have designer bags and drive a fancy car. The younger girls will have their own feelings about the wealth disparity, and may feel pressure to set themselves apart from Anna, or to glom onto her lifestyle. They could be pressured by friends to get favors from Anna, like wanting her to cover their next concert tickets, or swiping one of the bags she no longer uses. Step-mom might be getting weird vibes from her daughters, feeling like she's being compared to OP and found lacking. Or maybe it's not about the money at all, but that OP is spoiling Anna, not sticking to agreed rules, or not disciplining her when she deserves it. (Ask yourself in all seriousness, OP: on some level are you buying your daughter's affection?) \n\nI think there's a clear win for everyone if Anna takes this discussion as an opportunity to save up for the future. Whatever her plans after after high school she'll be better-prepared for it if she has savings. What kind of lifestyle does she want and expect in the next 5,10,and 25 years? Who's going to pay for it? Does she have a big dream she wants to chase? Does SHE want to cut back on how much she's spending? Would she prefer that some of her allowance go straight into a savings account? \n\nHonestly, OP, if you've been giving her so much for so long there are SOLID odds that her room(s) are full to the brim with items she appreciated but has moved on from. Ask her what she wants to take with her to a (tiny) dorm or (tiny) first apartment, and what she expects will happen to the things she leaves behind. Are you always going up store it for her? (Would they be safe from little sisters and friends?) Or would she prefer to start weeding now, and donate or sell things that can go to people who really want them? This is NOT about trying to kick her out, it's about empowering her to take agency over her own direction. Now is the time to talk about what she wants her life to look like and how much financial help she wants or expects. \n\nIt's awesome to be able to give her things, but it's going to feel EVEN BETTER when your daughter uses the solid foundation you've provided to go further and become her own person. At this stage, pay for stuff that will give her tools and opportunities (school, experiences, supplies for hobbies, sports, books, and niche interests), not just stuff she wants or that you think she wants. \n\nBy the sound of it, she'll always have a soft place to land between yo, and her mom & step-mom. If things go awry you'll be there for her. You don't have to kit her out with the best of everything for her to turn out okay. And at 17, you won't be able to shield her from everything coming her way. It's GOOD for her to leave the nest, take risks, and have to work for things. \n\nAnd if you just HAVE to spoil her... Put that money aside for the big shit: college (for Anna AND any grandkids), moving across country/world, homeownership, rainy day funds (disaster, divorce), everyday stuff (a good financial planner, healthcare), retirement annuities, funeral expenses (yours), all the things that could catch her short or make her life easier.", "NTA\n\nYou should not reduce your daughter's allowance just because someone else is jealous. Priorize YOUR daughter.", "NTA. \n\nHow's your daughter going to feel if you suddenly downgrade her? This conversation should've happened BEFORE the amount was decided upon. Reducing her allowance now will only feel punitive to her and none of this is her fault. The stepsisters aren't children. They may not love it, but surely they can understand it. Their moms need to have a talk with them if it's becoming a problem.", "YTA because you’re lying. Your Reddit history is comprised solely of comments in the r/AsianParentStories sub, in which you lament living with your parents and having them yell at you about your future job whenever you leave your room.", "Dad? Aah ... to have problems like these!! :D NTA", "NTA - janes sister should learn to mind her own business, also why is Jane discussing  your relationship with your daughter with people?", "NTA. Anyway, if there would ever have been resentment, it would have been during more immature years (early teens or tweens). It sounds like Anna isn't overly spoiled and is happy to share, plus it's not like it's a single household where all parents decide to spoil one more - she's your only child so of course you take care of her. Don't worry about it.", "YTA. Even if she were the only kid in the dynamic, it sounds like too much. Put it in a trust fund if you must or give it to a charity of her choice in her name. With multiple kids, it is just going to cause problems.", "NTA, but aren’t they half sisters and not step sisters?", "I agree with every comment I've read NTA plus if you all the sudden stop treating your daughter the same way she's going to think she's done something wrong or that you don't love her as much anymore why would you have to change the relationship with your daughter because she now has step sisters that aren't your step daughters and don't even live in the same house that would not be fair to her I think your doing the right thing. Yeah your daughter might be lucky because she's more spoiled from her dad because she's your daughter and her stepsisters are not your daughter or your step kids that's life", "NTA. Jane's sister needs to mind her own business, or offer to make up the difference between the kids' allowances, instead of trying to get the oldest's allowance decreased. Although why anyone thinks a 14yo and a 10yo need the same allowance as a 17yo is beyond me.", "You ARE obligated to consider how you treat your daughter will affect her FAMILY, her mother, step mother and step sister's are her FAMILY and you should consider it. \n\n\nHOWEVER, this is where I disagree with your exe's sister, you ARE considering it and acting appropriately. Your and your daughter's behaviour is resonable and measured. You aren't acting to hurt anyone's feelings and are being respectful. \n\n\nIf you want you could be extra extra nice and supplement the girl's allowances, but that's not something you *need* to do by any stretch. It would just be super freaking kind of you.\n\n\nNTA. Good job on handling the lifestyle difference responsibly 👍", "NTA Anna is 17.. should not have the same monthly allowance as a 10 and 14 y.o where are they going, who with and why aren’t their parents paying ?", "James sister needs to learn to butt out. NTa", "NTA. But (and I 1000000% acknowledge this may not be the case) I always wonder how a child who has been spoiled will fair if they don't wind up earning as much money as their parent(s). Especially one that is still getting an allowance at 17 when many other 17 year olds are out earning their own money by that point, even if it is just part-time minimum wage gigs. I know this is going beyond what was asked, but I went to college where the vast majority of students had financially successful parents, many of whom lavished their kids in that lifestyle. I can recall one in particular whose parents paid for her and 10 of her friends to fly to Vegas for her 21st birthday and stay in some ritzy hotel with entertainment likewise paid for by her parents. \n\nSome used their comfortable backgrounds to set themselves in careers to maintain that kind of lifestyle. Some chose a more modest profession and were happy to live a less affluent life. But there was another category where they just couldn't cut it and either became a bit bitter at no longer being able to afford all those luxuries or put themselves in serious debt trying to sustain it. It sounds like hopefully your daughter falls into one of those first 2 categories particularly with her desire to share the benefits with her half sisters, but I do think at 17 it will help to have a conversation about managing finances and that life can be happy even without those luxuries and perhaps begin tightening the purse strings to encourage her to find her financial independence.", "NTA, I understand their concerns but it sounds like your daughter is very fair and generous and even so are you and those concerns are not occurring.", "NTA. The other daughters aren't your concern.", "It sounds like you and your ex and her wife have created a strong, healthy co-parenting relationship that you all are happy with, so it’s none of Jane’s sister’s damn business. NTA, but the sister is.", "NTA Hailey is such an asshole, it‘s so egomanically to split up only for your interest, a child needs their parents together, Hailey could have at least waited, until your daughter was an adult… everyone is so selfish nowadays…", "Jane needs to mind her own business- would not surprise me if her interference is down to some kind of jealously re her own kids. NTA!", "NTA AT ALL.\n\nYour daughter sounds like a rational, considerate young woman, the way you speak makes you come across as a decent man. \n\nYou’re correct to worry about the dynamic- it’s good that you care, but in this one, I’d go with your gut. I wholeheartedly agree with every statement you’ve made.", "INFO: how much is the allowance?", "Divorced here, you are NTA.", "NTA \n\nThe other sisters are 10 and 14 - they already know money \n\nIf it would have impacted their relationship, it would have happened already \n\nSounds like Jane’s sister is actually the one who is jealous and ready to start drama about it", "You're wife is not a lesbian but bi-sexual.", "You're an amazing person, but I agree with your ex. Why don't you get together with her and her partner, and event the half sisters, and try to sort things out? \n\nYour own daughter will soon be an adult and then you can discuss college fees and allowances with her. \n\nAlthough I' m not living in poverty and have always helped my children a little bit, my sister is much better off. I see her jumping in to subsidise her adult children for expenses they should have budgeted for. I'm just saying that over subsidised offspring often don't learn to budget or save for their futures.", "Aren’t they half sisters? NTA is my vote but it’s also good to not spoil her too much so she knows the value of money. Her having more money may create resentment in the future, but I still wouldn’t say you’re the asshole in this sitch.", "NTA for this specific question relating to family dynamics.  But I  would suggest you sit and talk with your daughter and check to see how she feels.\n\n(As someone who was given lots of things and \"spoiled\" in other people's eyes, I hated it. I'd much rather spend quality time with my parent.  I felt obliged to accept stuff, when i really wanted to say no, byt cpuldnt because my parent would get upset and angry.  Now I just have a ton of junk to get rid of.)", "NTA-and your daughter is almost an adult.  Too late now anyway.", "NTA. Wth the level of insane mom math in this request. #JusticeforJane", "NTA yes you may be “spoiling” a bit but not in a bad way.  Your daughter has a positive relationship now with her sisters. \n\nI do see where the Sister in law to your ex is coming from. Yes children can hold resentment is a sibling gets more attention and love from parents than them. However that is always the case of the shared parent doing it.\n\nYou are not the father to other 2 girls. You have no responsibility to give them anything. Yet you are giving bday gifts and treating those two girls with kindness. You are doing the opposite of what the SIL to Ex is suggesting on all fronts.\n\nHer viewpoint is the typical bad thought of if you are a parent in a park giving your kid a cookie then all kids need to be given a cookie by you.  That just isn’t fair to anyone involved. \n\nYou have one kid and you provide for one kid. If you change what you are doing now it will cause your daughter to hate her sisters as well. How much allowance she gets is based on the split family for her. The other two girls while not getting as much are with their whole family as far as they know. Plus they have sperm donors that would be responsible for them but not your daughter if they were in the other girls lives.", "Why on earth at this point is anyone listening to Jane’s sister? Your daughter is nearly an adult and college. You guys seem to have the best co parenting relationship I’ve ever heard of. All 3 of you need to tell Jane’s side to mind her business.", "NTA why should your ex wife’s new wife’s sister have a say in how much money you give your daughter", "NTA- you are legally obligated to support one child- Anna. It’s foul for Jane’s sister to make money an issue. Could it be in the future? Yes. You aren’t obligated to pay college or help with house down payment for kids that aren’t yours. I’m certain you will help your daughter with all of this as you should. And her sisters and Jane’s family may be jealous but that is not your burden to bear.\n\nLol how many AITA have we seen where steps feel entitled to money from the non- step parent? So many, well she lives w/my kids so you should support my whole family to be fair. That’s a load of crap.\n\nI think you are doing a great balancing job and should not be ashamed for supporting your child in the way you can afford. Maybe look at prior posts from other people about this situation and share with Hailey and Jane. It sounds like you were all on the same page until Jane’s sis made a comment for them to re-think. \nDefinitely NTA.", "I would have a discussion with your ex that you are concerned that the sister is trying to sew seeds of discord, and that you would appreciate it if she would nip it in the bud.  A kindly “thank you for your concern, but please don’t bring this up to the younger children and cause problems where there aren’t currently any” and maybe find a nice way to tell her to mind her own business.   NTA", "Older kids usually have bigger allowances anyway", "Jane’s sister shouldn’t get a say, she’s not involved in the raising of your kids. If you, Hailey and Jane are fine with the arrangement that’s what matters.", "NTA but I think you guys are all going about it wrong.\n\nIt's very possible resentment could be fostered in this situation. But also you changing the allowance could cause that from your daughter.\n\nThis situation has been going in for a while and so while I don't think it should have ever been like this ideally, that ship has sailed.\n\nPeople get used to things and your daughter is used to this, and so potentially are her sisters.\n\nThe most important thing is not spoiling your child and not fostering resentment between them. Or hiring your own relationship with them.\n\nHow to do that? Well communication is a big thing, not going behind their backs and deciding things. If your daughter is old enough to drive she's a young adult, treat her like one.\n\nThe other thing is teaching her the value of money. Adults generally have to work for their stuff, not be given it for free. You could start working towards your daughter earning her allowance instead of just getting it.\n\nWhatever you decide to do though, communication is the thing.", "NTA,\n\nIf you ever lower her allowance, put the difference in an account in her name so she can have it for emergencies.", "Nta and Jane's sister should butt the fuck out.  Your child ,your money.", "INFO: I think you, Hailey, and her wife need to have a sit down and have a conversation.  You are a family unit that has been co-parenting well, and you feel that Jane's sister is overstepping. You have managed well so far. Your daughter is 17 and headed to college soon. There is enough of an age gap between the girls that there can be some rationalization of different allowances. Not to mention Jane's sister sounds like the jealous one. Does she have children who are seeing a discrepancy between what they have and her cousins have?", "NTA but I have a good compromise if you need it. Tone done the allowance, and put the difference into a college/car/house fund that she'll get once she's out if the house.", "NTA: I grew up with a step sister who’s father was far more well off than her mother and my father. Obviously she always got new tech, a nice car, etc. but I wasn’t upset. He wasn’t my parent so I didn’t expect that from him. If the other daughters are upset, that’s not your fault 🤷‍♀️", "Nta. Is your daughter earns more than the other girls in later life, will she be obliged to furnish their lifestyles? Bs.", "NTA\n\nIf you did cut down on your daughter's allowance like this it'd be like you were punishing her for something that hasn't (and will maybe never) happen. It wouldn't at all be fair to her. Best case, she feels put out and is upset. Worst case, she feels like you're accusing her of already being snobby/mean to her stepsisters and is deeply offended, which would probably strain your relationship.\n\nNot worth it in my opinion, just keep as you're doing and adjust accordingly if something does end up happening. But don't make problems where there aren't any.", "Info how much are you giving a 17 year old for spending money?", "Yes, I'd point out that there is no resentment that doesn't come from Jane's sister, so the ideal situation is the current one, minus Janes sisters' input.", "I agree. NTA. With split households come this kind of stuff. I have a stepson and bio son and my stepson also has a brother on mother and stepfather’s side. So he has 2 little brothers. Sometimes my stepson will experience things in our home his little brother (8months old) over there would not be able to experience (or toys to play with). And sometimes my stepson will do things my own son doesn’t get to do. That is just life. My son is too little (one year) to really understand now. But he will when he is older. My stepson has the pros and cons of 2 homes. He has to miss certain things in certain houses. He can’t be with 2 houses fulltime. So that is a big con for him. Plusside: he also gets to do fun stuff at both houses. My son has 1 home where he stays at and has 2 parents who love each other. But yes, sometimes he doesn’t get to do what my stepson does at his mother’s house. So it goes both ways. That is just the way it is.", "Yeah, I second the comment about her sister. It's none of her business, and it's not her family, so she needs to butt out. There was no problem until she opened her mouth about things.", "[removed]", "Yeah, it's going to cause a lot more resentment that the 17 year old is suddenly being cheated out of what she should expect in life because her mother's wife's sister doesn't like it. Just because her parents divorced doesn't mean she should have things taken off of her for doing nothing wrong. Or that every random person related to her parents new spouses should get a say in her life. This girl isn't spoiled or selfish but she suddenly might get a lot less generous if everybody who sees her with it gets to say in it.", "I had to do a second read to make sure it was the new wife complaining, but the new wife's sister?!?", "Like what is with these people and and trying to punish one kid because their other half of the family isn't in the same bracket. Sounds like dad is doing a good job at not flaunting over his ex and just being a good dad.", ">You STILL spoil Jane's daughters for special occasions. The fact that you do that is amazing. You are still including everyone. So does Anna.\n\n&#x200B;\n\nExactly this.  It is huge that you're going this far to me a nice dude about it. The girls need their mom to talk to them and explain that their father worked very hard for his money and he deserves to give it to his daughter.  The girls also need to hear that jealousy and envy are normal feelings, and it is important to process these feelings in a mature manner.", "Also Anna is older than the other two sisters. It’s normal to have a bigger allowance when you’re older 🤷🏼‍♀️ and she shares with her younger sisters which, isn’t necessarily normal, but what I would assume a loving and caring older sister would do. In fact I bet her bigger allowance allows her to be generous to her sisters on occasion. Which is as it should be as the older one. This whole thing is ridiculous, a 17 year old needs more money than early teen kids anyway 🤷🏼‍♀️", "Age is a useful guide. Anna is older explains things without dragging in financial circumstances. Jane's sister is a PITA who likely lives dramatically", "I disagree with the NAH judgement. Jane's sister certainly is an AH for trying to stir trouble where there isn't any. And Jane & Hailey are also somewhat AHs because instead of telling this woman to shove it, tried to dictate to the ex (who is being extremely generous with their children, who aren't his, and for whom he has no legal or moral responsibility) what to do with his money and how to interact with his own daughter.", "Agreed. It's your money and you can spend it how you want, and it would be hard for it not to seem like a punishment for your daughter to have her allowance cut, but you could advise her to start saving the difference in allowance to help set her up for college.", "Dismissing the concerns as just jealous is such an idiotic and knee jerk response.", "I agree with this NTA. \n\nBut your ex relayed this for a reason so she’s worried about something rightly or wrongly so a chat about it especially as it seems you’re on good terms may not be a bad idea. At least then you’ll know if there’s maybe something else worrying her.", "\\+1.  Couldn't have said it better myself.", "That’s a different equation though isn’t it? I mean Jane is Anna’s Step Mum. OP is nothing to Mel/Rose", "Anna's sisters might be biologically only her stepmother's. Still sisters whether half or step though.", "It is not good or healthy to project yourself onto other people.  His daughter is not you.  He is not your father.  Okay?  Hope we got that cleared up.", "It's not jane. It's jane's sister, who doesn't live with them.", "No one has any right to tell anyone else how to spend their own money. You are being ridiculous.", "It’s not Haley’s view, it’s Haileys wife sister CONCERN for when Anna’s stepsister are older.\nNothing to do with the current dinamic between them", "It’s his money he can do whatever he wants", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). If we’ve removed a few of your recent comments, your participation will be reviewed and may result in a ban.\n\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Depends on which one of their moms gave birth. If his ex gave birth it would be half sisters but if her wife gave birth step sisters.  This is all genetically speaking of course.", "Seriously, what is wrong with some people that they feel entitled to insert themselves into situations that don't concern them, and where everyone who IS concerned is actually happy? Jealous much, Jane's sister?", "[removed]", "This actually happens in houses where there’s no split families too. My sibling was friends with someone with a cottage and got to go visit them all the time. My godparent was much more involved and bought me presents and took me on trips. Another sibling got access to a cousin’s leftover university fund and didn’t have to pay for school the way the rest of us did.\n\nMy children have had the same experience - occasionally opportunities have come their way and as parents we know that the chances of being able to give this same opportunity to all the kids is probably nil. This isn’t a reason to deny the opportunity, it is a teaching moment for the kids. When they grow up, maybe one will be more “successful” than the others, but that won’t mean that the others are somehow less worthy. As parents we won’t always be able to “even out” the chances of life. Better learn now how to be happy in your own circumstances and not to let jealousy and envy spoil your contentment with your own lot.\n\nNTA.", "I don't think they're AH. All of these conversations seem too have been held privately and respectfully. Everybody involved seems to be opened to compromise. I don't think it's inappropriate to discuss money with the sister/SIL or with the ex. It's not like Jane's sister brought this up in front of everyone during the Xmas party.", "The concerns are idiotic. The kid is 17.", "Would you mind elaborating on that please? I’m not sure I understand why it’s a problem in this instance.", "He asked for people opinion, this person is even giving an anecdote to support their opinion. They KNOW OP is not their father. Why are you being this condencending? Are you okay?", "But she is **not only** his daughter - she's also his ex-wife's daughter. He can do whatever he wants with his money: he *cannot* do whatever he wants with his daughter.", "Jane’s sister needs to mind her own businesses..", "Couldn’t agree more. It’s ok to learn that some people have more and some have less. This will be true throughout life. Sometimes your life will go well and sometimes you’ll struggle. That’s ok too, we’re all just doing our best.", "“Leftover University Fund” ??? Not something you hear every day. Guess you are not in the US", "Either way, your nonsense isn't helpful.", "If I do not communicate in a way that you find acceptable, you can kindly internalize your own malcontent and ask yourself why you don't like what I said.", "Yes he can give as much money he wants, it’s not like he wants her to change school or something .\n\nThe ex-wife should give more money to her two daughters instead of wanting to limit OP daughter allowance or she needs to get over it.", "\"If you are not happy, make sure you destroy other's lives as well. That way everybody can be miserable together.\" Besides the eldest is 17 and may move away for college etc and the younger are (14,11) and may not have yet formed any opinion regarding handbags/money etc unless poisoned by the sister. All this will do is destroy a harmonious relationship.", "Are you Jane by any chance?", "Nether is yours, and you don't see us complaining. You're also wrong.", "Are you okay? Do you need help?", "You do not seem interested in communication or discussion.  Have a nice day.", "I am interested in how you are doing, but you are evading the question. Why is that? Are you in fact not okay?", "Love you too.  Take care.  Hope you have a better day.", "NTA\n\nThe only one spreading seeds of resentment is the person \"suggesting out of concern\" that there might be a problem. That's the strategy of people who enjoy creating drama.", "Nta- she’s your daughter too and you can give her what you want. She’s not acting poorly or mean to her sisters, so it shouldn’t be an issue. Anna is also 17, the other two 14 and 10, that’s a good age difference and soon Anna will be a legal adult, things will be changing for her, like college, jobs, etc, and this allowance won’t even be something they think about.", "NAH \n\nYour co-parent received feedback on parenting that made her question the current setup, and then she discussed with you the possibility of making a change. You don't see any existing behavioral reasons to make those changes and declined to do so.  Everything's chill.   \nYour daughter is 17 and old enough to participate in discussions about the family dynamics without you and her mom making top-down changes to her lifestyle. Maybe set a family meeting (You, Hailey, Anna, maybe Jane) to make sure that everyone is on the same page about the expectations around the money she receives from you, so you don't get blindsided if Anna's behavior doesn't truly align with your perception that she \"always shares\".   \nYou're generally right that you should be able to spend the money you earn how you want, but remember that as Anna's parent you are modeling to her how to treat *her* family. Any consideration you offer Hailey and Jane's household is consideration for Anna's home life.", "Do some children really have allowance? Just like weekly money their parents give them? Is this a thing in the US?", "So you do for your daughter, and screw the other? I can promise you that it will come back to bite you on the behind one day.", "Hmm… tough one but I’m gonna go with YTA 😬 I think the friend is right: Anna living in one household with her less well-off siblings is kinda bound to create resentment even if she does share.\n\nI think it’s very defensible that you do nice things with your daughter that don’t extend to the other two: take her out for nice dinners, buy her a gift when you go shopping with her every now and then, go to concerts together, go have experiences together. But I think that her having a significantly bigger allowance will probably not do her personality any favours in the long run.\n\nAlmost everyone with more power or money than the people around them will end up thinking they deserved it because they did something right. Even if your kid is the exception to that rule, is it worth running the risk?\n\nSpoil your kid, but spoil her with love and cool experiences because you’re her dad, not with having more money than her siblings because her dad is rich.", "Nta and side note it's refreshing to see such healthy coparenting I always see toxic \"my ex is a b-\" remarks from divorced people I know and it drives me nuts cause you know it affects the kids. But on regards to your post it's your money spend as you see fit plus soon your daughter will be 18 snd if she isn't already working she will definitely want to at least start working and being independent so lessening the allowance won't mean anything anyways plus if there was damage done it's already been done considering her age but as you stated there is no hints of poor relationship now from anyone but Jane's sister who's business is not hers. They're young enough now it seems that it won't matter to them unless they're told they should and by the time they're more opt to understand or feel that way they will have other things on their mind rather than how much their older sibling for x many years in the past ago. They will be focused on school, dating, and learning independent lifestyles of their own", "NTA, this doesn’t sound like it’s causing any kind of issues between the children, in fact, the only person who seems to be having a problem with it is Janes sister. It’s merely her opinion, not fact. Besides, her sister did overlook one important fact, if you cut back suddenly on Anna’s allowance, and she figures out why, could she not end up resenting her stepsisters anyway? I mean, she could see it as being their fault. I think you’re doing right by all parties, and you should continue the good work.", "NTA.\n\nThe kids seem to be doing well, all three parents were fine for over a decade of coparenting. Then your ex wife's new wife's sister has opinions about *your* parenting, which is explicitly not her concern. This isn't about the girls, nobody with any familiarity of children would expect a 17 year old and a 10 year old to be given the same spending money. What is her deal? Why is she stirring discord where there has been none, and why are none of you telling her to fuck off and mind her business?", "NTA, your money your daughter", "NTA. Your daughter deserves the best life you can give her. It's not for other people to have an opinion on the matter. Dad is well off, which means the child should be too. She has great ground rules. You have been spoiling her responsibly. Sibling resentment can show up over anything. Even looks and talents. Should a kid stop being the best at his or her sport because it creates resentment with the siblings? No!. They are raised as sisters, but the reality is that they are half sisters and can't be raised 100% the same. If you stop, she might resent you for not including her in your success.", "Nta", "I she sowing a seed of discontent among the children?", "NTA  \nAt all . I think it’s unfair for them to tell you how to spend money on Your kid! My siblings and I been spoiled our entire lives. I started traveling at age 3, always had new things and we shared with our cousins and other family members because that’s how we were raised. And look we’re hard working adults/teens who work for what we want. \nKeep spoiling your daughter she sounds like a good kid", "I agree with Jane. Also, your daughter shouldn’t have more than her classmates. Or her neighbors. Or the other people in her city. In fact, let Jane know that, in order to be fair, all of the children should only get the same amount of stuff as the poorest person in the city. \n\nNTA. Life isn’t always fair. Everything isn’t “equal.” I have a larger house than my neighbor across the street, but my house is much smaller than my neighbor on the other side of my backyard. \n\nAs long as your daughter appreciates what she has in life (and recognizes other people may not be so lucky) and doesn’t flaunt it, you’re good and Jane should butt out.", "NTA. A caution though. I have a friend who is spoiled. She had this somewhat entitled attitude to money. Anything she wanted and couldn't afford for herself, she just asks her parents for and they provided. Expensive trips, private school for the kids, nice cars, maid, nanny, high end clothing, etc. Well, they did until their retirement money was lost. It was a big adjustment for her and one she didn't handle with grace. She was your age when it happened. A few years later, and her parents had to move in with her because the lost retirement couldn't be recovered and they had run out of savings. \n\nSo, talk with her frankly about money. Prepare her for being someone who can navigate financial changes.", "NTA. This current arrangement has been working for the last 17 years. Now all of a sudden it's a problem because of a random family member had to butt in? No no no, it doesn't work that way.", "YWBTA if you don't \"stop spoiling\" your daughter only in *this way.*\n\nYour ex has raised sensible and well-thought-out concerns about how siblings/other kids may respond.\n\nI'd ask, have you ever talked to your daughter about what, if any, material things *she* wants?  Or of how she feels about being part of a family, and having sisters, when she's the single person being \"spoiled\" this way? Are you comfortable rejecting that family unit's apparently reasonably expressed feelings? Do you really think your adopting the approach that anything short of an \"Upstairs, Downstairs\" version of wealth and class distinction is fine, and/or is what your own daughter wants or is comfortable with?\n\nMy teenage daughter gave me the some of the best and most life-changing advice I've ever received: if I were to spend money on her or her siblings, she'd want to spend it experiencing things and meeting people she'd never meet in comfort or near home. For way less than a typical middle class vacation trip cost, we've stood all night in seatless packed trains (in which crowds respectfully would try to pull back to give what space they could to pregnant women and elderly and sick passengers). We've been in miraculous parts of the world where poverty and life-threatening disease are constant and it's a continuing struggle for parents to keep their kids alive.\n\nAre you giving your daughter experiences, as well as designer goodies?", "NAH- janes sister got into your ex’s head with this one and it seems like it was just a discussion without totally out of line requests so I don’t blame her because it came from a place of worry. You also aren’t doing anything wrong at all and have gone above and beyond to ensure that things aren’t crazy unequal between your daughter and her siblings. I would suggest having a very calm discussion with your ex where you discuss both of your worries about this, and definitely bring up that janes sister is the only one causing this issue. If she starts bringing it up around the kids that will what causes a problem.", "NTA. Jane's sister should mind her own business. \n\nSpeculation: Jane's sister is the one who is jealous and resentful.", "Jane should cut her sister out of her life. If my brother spoke to me that way continually we would be past tense.", "She only has a point if it *is* happening. If the other 2 girls don't resent her, and if your daughter doesn't resent her mother and step mother for not being able to give her more, then I'd say Jane needs to mind her own damn business! \n\nMy step bro and sis' bio dad was rich and gave them whatever they wanted, but it 'caused no resentment because same, they always shared and we all had great relationships. \n\nIf it was your ex who had the issue, that would be a different story, but even though this is a sister, they're not *part* of the *immediate* people that it would affect (if I'm making sense lol). Anyway, I think NTA", "NTA. \n\nNot only is it extremely common for different kids to have different access to resources in blended families, it can and does happen in “nuclear” families as well.\n\nEconomic situations change all the time. A family can find themselves in a more or less stable economic situation all the time. When I was a kid, my family had an economic disaster. My oldest sibling had a much higher standard of living before that, but the funds just weren’t there while my parents were rebuilding and recovering. I was young enough that the changes didn’t affect me the same way. By the time I was ready for college, my parents were in a much better position and they were able to help me out financially much more.", "NTA. I have a stepdaughter and we work with her mother to align disciplinary actions when our daughter gets in trouble, like she was failing school and got grounded from her phone, so she was grounded from it in both households until she brought it up.\n\nThis is not the same issue at all. You are not the father of the other children. You do not have to pay for those children at all. You are obligated to take care of your child. You owe the other ones nothing. And although i understand the other girls might be upset, they don't have the cashflow and nicer things. That is life. Their neighbor will make more money than them. Their boss will make more money than them. Their spouse will make more money than them. They need to learn that now, even at 14 and 10. My kids are that age, and they know we provide what we can. And they know their older sister has another family that gives her things that's out of our control. Same goes for you.  If anything, just make sure your daughter stays humble and not the braggy type. Sounds like the ex needs to raise her kids to stay in their lane.", "NTA.  Ignore the sister.  If Hailey comes to you with observations of actual dynamics between the siblings (as opposed to speculation or theories a la her SIL), then you and Hailey can work out what seems best.  Until then, carry on!", "NTA. It's not your responsibility to change your gift giving behavior to your daughter if it's not negatively influencing her. Your ex and her wife need to have a conversation with their own children, not you.", " Absolutely NTA. janes sister definitely needs to mind her business. None of the girls seem to have an issue with it and if your ex wants her other kids to have more money then they need to raise their allowances or if they can’t afford to do that then leave as is, it’s your choice how much money you give your daughter\n\nAnd you’ve already said you spoil the other girls on special occasions. That’s more than most would do", "NTA - BUT...  are you teaching her to invest, save for a house, put money in an IRA?  What life skills are you teaching her when handing over her allowance?", "I think now that curtsey to Jane's sister, the doubt has crept out, all three of you could discuss this with the girls. If they think it's unfair or not. ( if i was in Anna's step sister's position i would have been glad that my older sister has more money and she spent that on me as well but to each to its own). If they think its unfair and do not understand even after explaining you can tone it down to accommodate if YOU WANT TO.", "NTA. YouR daughter should not have the opportunities you Are able to give her because if some perceived issues that “might” happen. If she is kind and shares, that is the best lesson she can get. As parents, we want to provide our kids all the things we couldn’t have. Spoil away as long as she is a good person. ❤️❤️", "\rSincerely NTA, because Anna is your daughter and deserves more attention even if the others are also important for the family relationship", "Definitely NTA. This is the reality of a blended family, lady should mind her biz.", "Nta I do think there will be some conflict because of the imbalance. Even if you cut back on the allowance, when her college is paid or when you die and she inherits the money, jealousy will creep in.", "Im going with NTA. I would understand the concern if Anna was acting like she is better than her sisters or acting entitled. But that’s not the case.", "In some families, with some kids, inequality creates problems. That is not the case in your family because your daughter is as generous and warm hearted as you are. Her younger siblings understand the reason for the difference and also see how much she loves them. This is a non-problem. She is older and in most families the older child has a bigger allowance. Punishing a child (and lowering her allowance would be seen as punishment) for something over which she has no control is never a good idea.", "NTA \n\nThe choice to create a blended family means the adults have chosen **inherent unfairness** for the children involved, if there is any difference in household incomes. That’s it. It’s the facts. \n\nWhat’s incredible is that you have actually sought to minimize that gap by including the half siblings in generous gifts etc. \n\nOf course there may be resentment. *Hailey and Jane chose to manage that, as parents, who chose to grow their (blended) family*.\n\nAnyway. There are 2 types of unfairness in life: unnatural unfairness, which is usually done with some malicious intent and can easily be resolved and corrected (ie parental favoritism); and natural, inherent unfairness, which is not easily corrected and isn’t anyone’s *fault*- that’s what this situation is. \n\nThere is no difference in the love the girls receive, there is no situation where anyone’s needs and even wants aren’t being met.", "You can't really decrease it without suddenly giving her a reason to resent her step-siblings really!\nBut from now on open an account at the bank for her and tell her about how the extra part is put there until she turns 18 or 20? As fun way to start saving together?", "NTA and Jane's sister needs to be told to mind her own business. It looks like you are all handling things very well.", "This is a great opportunity too discuss finances and investing with your daughter, she's old enough now. Show her how to invest her allowance, which will give you the opportunity to still give her the same amount but her discretionary spending money will then match her step sisters. \nStart putting the extra into an account for college, or mutual funds. You are still \"giving it to her\" but also seeing her up to survive hard times and have a safety net during her career. \nThe sister needs to butt out, the moms need to discuss things with all the girls as a family. \nNTA", "NTA!! Janes sister needs to mind her business!! Sounds like you're doing a great job 👏", ">I asked why, and she told me Jane’s sister was worried when she found out about the arrangement. She believe you can’t raise kids in one household with different lifestyles without creating resentment, and while they may have an amazing relationship now, that might change when the two girls get older and start to understand concepts like wealth and class.\n\nSounds like a solution in search of a problem.\n\nNTA", "NTA \n \nLet your ex know it was super generous of Jane's sister to offer to make up the difference in allowances.", "Janes sister needs to mind her own business. She has no role in how your daugther, nor really even her stepsisters, are raised. \n\nYes, Anna has more, for a few reasons. She is older, and has more needs. She also has two sets of parents. You are one and her mom and step mom are the other set. So she has two sources of things. \n\nAlso, as you said, how you spend your money is up to you. You don't need to consider someone else's kids when making choices for you own. \n\nLastly, it sounds like maybe Hailey and Jane might feel inadaquate in what they can give their kids. That is solidily a them problem. \n\nYou said Anna is not spoiled and she shares what she has, and has a great relationship with her sisters, so don't start worrying about something that is not there. If there ever is a conflict over this, denying your daughter things just because others can't afford it is not the right way to go. She would end with her being punished because of someone elses feelings. This is not a fair solution. Instead, you ex needs to teach her kids that life is not always equal, and that it doesn't make it unfair or wrong when it is that way. \n\nNTA", "NTA. Kids are raised in different income levels because wait for it, people HAVE different income levels. Your Ex is raising their kids in a two parent household, how would they feel if you told them to split up because it’s unfair that their kids live with tie parents and your daughter doesn’t. SMH here is disbelief of the entitled thinking.", "NTA. Sounds like you raised a good kid, and why shouldn’t she have a few nice things? I like that you give the other girls equivalent gifts on gift occasions. It’s nice that you give them gifts at all, but you’re being mindful, your kid is not acting like a brat with her stepsisters, and there isn’t a problem here.", "You're NTA, but  they are right.   One child having more money than the others introduces tension and stressful dynamics that make it more more difficult to provide a healthy environment for all the children.\n\nSave the money for Anna for when she moves out. You can pay her college, buy her a nice car,  help her travel the world when she's ready..\n\nBut that's later, when she's moved on from that household.", "Nta the only one causing issues is the sister. Your ex needs to tell her to butt out.", "NTA", "NTA but I don’t think Jane’s sister is wrong, either, at least in general.\n\nIf all the kids were closer in age, then it would be wonderful for you to prioritize her the sibling relationships and perhaps put a portion of the allowance into an account to gift to your daughter perhaps when she goes to college or moves into her first home. \n\nHowever, that teen years gap is big enough that the disparity shouldn’t be an issue. Oldest kids usually get benefits; when the younger kids reach that age, they might enjoy a bit more than what they currently get and never notice much if it’s not exactly the same.\n\nI think Jane’s concern is technically valid but not applicable in this situation. (I don’t understand the “she’s jealous” comments; she’s clearly way too far away to ever have a claim on it.)", "what will cause resentment is you cutting your daughter's allowance to solve an imaginary problem that was brought up by a third party not minding their business. your daughter will resent you for that for sure.", "NTA. This sounds like a healthy blended family situation that is working for everyone except a person who's not even in it and probably has a weird agenda.", "First off, let me confirm I read this right:  \nEx's current SIL has \"convinced\" your ex to approach you and - being blunt - ask you to \"tone down\" your spending on *your child Anna* to levels that \"they\" (ex and current wife) can afford to pay their two children?\n\nNot just while Anna is with them, but *overall*?  Because \"raise kids in one household with different lifestyles\"...\n\nEven though you \"invest\" in both of Anna's \"step\" (actual relationship not 100% clear from story) siblings \"when appropriate\"?  \nAgain, at levels \"they\" (ex & current wife) can't match...\n\nThat sure sounds like there's some \"resentment\" building, and my \"read between the lines\" thoughts are \"seeing that resentment\" building not in the kids yet, but the moms.  \nAnd SIL is being a perfect scapegoat.\n\nTo wit: the \"stepsiblings\" are still younger.  And you (OP) presumably actually put thought / effort into what \"expensive gifts you buy the 'step'siblings when the appropriate gift giving opportunities arise\".  Younger kid with \"desirable and expensive\" gift is gonna be more exicted than \"desirable and 'bland' priced\" gift.  \nParental resentment.\n\nDefinitive NTA for taking care of \"all\" kids involved to the best of your \"reasonably expected responsibilities\" (read: spending \"equally lavishly\" on the other two when the right times arrive)\n\nDebate on whether there's assholery from the other side, or there's NAH.  Best way I have of setting this up:  \nWhen I (50M) was a kid, my mom was divorced and stayed single.  Meanwhile, one of my uncles gave me \"hand me down\" comic books, and one of my aunts would usually toss \"hand me down\" toys - mostly semi-expensive electronics her girls gave up on.  The first \"full christmas\" I had after the divorce my mom had to go into then severe debt to get me and my brother gifts that were \"as valuable\" as what the still married relatives gave me and their own kids.  \nShortly after that, I was \"old enough\" to understand (and accept) the bit about \"My Mom had a very hard time matching the $$$ values of what her siblings could spend, yet she was doing everything she could in the sentiment department.\"\n\nThe \"siblings\" in this story are around the age where they can (and probably should) understand that sometimes parents (ex & wife) can't \"match up\" in $$$, but always put in the sentiment.  If that point can (is) being made, NAH.  If this whole issue is a \"scam\" to make them (ex & wife) \"look better\" at the expense of your daughter's \"well being\"...", "NTA", "I grew up with divorced parents and my mom was on food stamps and my dad could afford to take us on two vacations a year (not rich rich but well off for the area). I think it helped me growing up to experience these disparities. I’m now super frugal because I grew up that way at my moms. But I make a good amount and have good financial habits and stability from being raised by my dad. NTA. Your daughter doesn’t deserve to be forced into not receiving stuff because someone outside of the family is jealous.", "NTA. Just because Jane and her sister's parents raised them (or rather, Jane's sister) to be jealous of another's wealth, does not mean that Hailey and Jane are raising their daughters the same way, in fact, they don't seem jealous or resentful at all, and trust me, they would have started showing at by this point in their lives, especially at 14, you really start to understand. Sounds like all 3 of you raised wonderful daughters, don't let Hailey throw it all away because of some Aunt. Auntie is not the parent, and what you and everyone except Jane's sister is doing is not hurting anyone, Jane's sister has no say in how these children are raised. Tell Hailey to tell her to mind her own beeswax.", "It's your money and your daughter. \n\nAs long as she doesn't act like a spoiled brat, it's completely fine. Nobody is starving here. Even if there's a wealth gap, it is what it is and you're not obligated to worry about that \n\nThe only key factor here is to make sure you're also inculcating important values in your daughter; like humility, kindness and empathy.", "NTA you’re a fucking sweetie and a king if you keep things that civil after a divorce and even give consideration to things like these. I grew up in one of the other divorces and didn’t find out till I was 14 you could actually speak and be friends with an ex wife. \n\nMaybe what you could do is split her allowance into portions that she can spend when she’s with you or without you. Encourage her to spend yours on experiences rather than stuff so no one gets jealous. Or tell them to go shove it and raise your daughter how you want to. Either way is fine.", "NTA. Jane’s sister needs to butt out. She is creating problems where there are none.", "NTA the same should be spent by the parents in the same household, but not by the other parent outside of the household. You could have her keep her purchases at your house if you want to tone it down for the other house. But it sounds like the younger kids are gonna remember their older sister sharing her stuff more than anything.", "Nta, It seems like it been 10 years of your current arrangement and there hasn't been any problems", "NTA. Why are Jane and Hailey talking to Jane's sister about the allowance YOU give your daughter? That's none of her business. Either they're talking about your personal life to others, or Jane's sister is asking nosy questions. Either way, it needs to stop. There are no issues with the relationship the girls have, and the jealous adult involved is about to cause one when she shouldn't even be involved.", "the other two girls are only 14 & 10 ... maybe Jane's sister doesn't remember being that young , but they most likely look up to your daughter as the cool older girl in their life . NTA - spoil your baby girl because it sounds like you couldn't make her rotten if you tried . as long as Jane & Hailey continue to have conversations with their two young girls about the situation as they grow older , i don't see a resentment forming between the 3 of them .", "Why would you care about a person’s judgement if they are not a part of your immediate family? Getting caught up in that stuff can seriously drain you, especially with all you’ve been through with family restructuring so far. It sounds like you’ve been perfectly reasonable and, so long as it’s not causing clear issues between the kids, it sounds like you can continue without causing much harm (remember that parenting will always inflict a little bit of pain on children because they are involuntarily under your care).\n\nThe daughters of your ex are more like neices to you than anything else; I had a cousin very close to me who received very different types of accommodation than I did and, in terms of gifts and handouts, there was not ever much thought or comparison because she and I both love eachother so much. It’s possible that the relationship between your daughter and your ex’s kids isn’t as strong as you think it is, but then again that may just be an impression coming from that unnecessary comment from your ex, who heard it from her SISTER! So, all in all, not much to worry about in my opinion, You are not an asshole.", "Consider giving your daughter a bit less allowance, and put the rest in a savings account or investment account for her. She still gets the money in the end, but it might ease any potential friction. \n\nThen tell Jane’s sister-in-law to mind her own damn business.", "NTA. Jane’s sister needs to butt out.", "NTA. Tell Jane's sister to mind her own damn business. Is there's anything that is causing an issue it's her. She's placing seeds if doubt and will be the one that causes the dynamics to change. She sounds jealous because she can't afford to spend the same on things. Tell her to stay in her lane and to suck her nose out of your business.", "Jane’s sister is the AH for getting into something that isn’t her business. Sounds like you’re raising one hell of a good daughter", "Everyone is a financial genius when it comes to spending someone else’s money.", "Is Jane’s sister’s name by any chance… “Ursula”?  Just kidding, Ursula is awesome. 👏🏼it will only be a problem if Jane’s sister gets more chance to interact with the girls and poison the well. Talk about it with the girls yourself and with the moms. Sending messages of love and family and sisterhood, but also setting up examples of clear communication and values of love and friendship. “We share things because we love each other, not because we owe each other. Things make me feel good and happy, I assume they would make you feel good and happy too, that’s why I share them with you. But you are your own person, you might not feel the same way about the things I share with you. You can say no or reject them. I’m old enough to handle that and respect your free will. And I’m happy to be part of your journey of forming your own opinions about things. Expensive things only means it has a bigger price tag, but value and price number are two very different things. Even if we don’t have expensive stuff to share, we are still sisters, no? Are we only going to have a good time growing up together when there are expensive things around? “ anyway, you know what is best for your kids. But seriously, that Jane’s sister? You need to keep an eye out on her.", "NTA, but it may be worth having a discussion with Anna about whether everything between the girls is as copacetic as you think it is. Maybe Jane is just being a busy body, but maybe Anna needs a little more guidance. It won't hurt to check.", "NTA. She is 3+ years older than them, just say it's her maturity tax.", "NTA.. why is new wife’s sister sticking her nose in where it doesn’t belong.. she is your daughter and where it is nice you treat other kids well your first priority is your daughter.. \n\nNo matter the amount of allowance you give is high or low your financial circumstances is different than exes family. \n\nKeep doing for your child as you see fit.. you are going above what most people would do for exes kids.. your child sounds like a good girl sharing things you give her with her sisters..\n\nDon’t punish your child over a noisy busy body aunt that isn’t even part of your family.. she’s jealous of your lifestyle.. you aren’t spoiling your daughter otherwise you wouldn’t give to other kids.. keep being a good dad.. your ex had no right to try and take away from her daughter because of wife’s aunt..", "NTA. You're going far beyond what I'd do in that situation. I'd be all about my child and my child only.", "Jane's sister can mind her own business.\nIf she thinks there is a problem, she is welcome to contribute to the younger girls' allowance to make up the difference.\nAlso, in what world does a 10yo get the same allowance as a 17yo? \nDo not punish your daughter because some busy body is giving out unsolicited parenting advice.\nIt has nothing to do with you.\n\nLife isn't fair, and parents need to teach their kids that they don't always get what someone else (EVEN SOMEONE IN THE SAME HOUSE) gets.\nIt's Jane's job to manage her sister, and her daughters' expectations; not your responsibility to punish your daughter so that Jane doesn't have to do the heavy lifting that comes with being a parent of a blended family.\n\nEmphatically NTA", "NTA.  Jane’s sister’s opinion means nothing. \nHowever, keep an eye on things.  Maybe your spoiling Jane could go into things like a college fund, or memberships for the whole family to places.  Her sisters are still young, but they may expect cars or other things from you.", "So the sister of the new wife of OP'S ex thinks the arrangement they've had for years without problem doesn't work? Why even take this as a serieus remark? This is none of their business.\n\nNTA\n\nNot even close, sounds like you have a really good thing going despite all thats happened. It's rare to see a splitnup family do as well as this (espacially on this sub...)", "NTA- speaking as both a child of divorce and a mother with one child from a previous relationship, there are going to be some discrepancies between siblings and who gets what. When my son sees his dad, he usually comes home with a bag of treats from daddy’s house and I let him know that because that is stuff daddy gave him that he can share or keep it to himself and he usually shares with his brother and sister. \n\nI actually took a class after separating from my oldest’s father and they told me that unless there is abuse going on, you cannot control what goes on at the other parent’s house or how the other parents has a relationship with their child. Hailey and Jane need to ignore Jane’s sister and realize they cannot control your relationship and your time with your daughter. I would also point out the fact that you get really nice gifts for Jane’s children when you don’t have to. My ex has never bought my other kids presents and my mom only bought my sister a present one time so I would have something nice to give her the first time I met her right after she was born.", "It's not even been mentioned, but lemme guess: \n\nJane's sister has kids who aren't as well endowed in the monetary extras department so Jane's sister is asserting her opinions to keep your child's cousin's-in-law from resenting? \n\nNot your problem..NTA. Jane's sister needs to MHOFB and raise her kids to appreciate what they have and take care of it.", "You need to tell Hailey to fuck off. It's ludicrous that she thinks she can straight up abandon and destroy your family and then tell you not to give nice things to your kid just because she can't afford those things for her new kids. That's so fucking wrong, and frankly you are much too kind with Hailey to begin with.\n\nAnd it's none of Jane's sister's business, and you need to tell her that yesterday.", "It sounds like it was the exes decision to make your one household into two different households. It speaks of entitlement to then want to control your fractured household for the benefit of their new household. I can sum up a good answer to them for you.      No.     Who do they think they are? It’s your relationship with your daughter. Maybe instead of asking you to put training wheels on they could even it out by working harder to make more money.   NTA", "NTA. Newsflash to Jane's sister: children who have rich parents get more stuff. Full stop. They need to teach their children how to cope with that reality, which it looks like they're doing.", "How does Jane’s sister know how much allowance Anna gets? And why?", "NTA", "Nta. Get the other kids father to pay up.", "NAH I understand both parents sides here. You never want to create or contribute to conflict between siblings, but I can also provide a third perspective. I was one of the stepsiblings to a “spoiled” sister. My stepsister was an only child at her mother and stepfather’s and they were very wealthy, so she always had more expensive toys and clothes, expensive brands and all the accessories, etc… She also wasn’t great at sharing. When I was very little, I’d sometimes get jealous and our baby brothers would sometimes sneak into her room to “borrow” said toys. However, by the time I was wrapping up elementary school, I had long since gotten over that. I definitely understood by ten and didn’t resent her or anything. A few decades later and we’re still good friends. Your daughter’s stepsisters should be old enough to understand that, while you’re a good family friend, she’s your daughter so it makes sense that you’d be getting her more, especially since, as you said, she also shares well with them and gets along well with them.", "NTA.", "NTA. I feel sorry for you that your ex-wife approached you with her new wife’s sister’s recommendations on how to raise the one kid you all share together. But props on the successful business.\n\nI personally wouldn’t throw cash at a kid, but teach them how to make money instead, which will be way more valuable in the long run. But I’m broke and don’t know any better, I’m sure there’s a method to your madness", "Your daughter is 17 and will soon be out of the house and off to college. Whatever you spend on her then will be far less noticeable to her sisters, because she won’t be around as much. \n\nThis is what I picture happening. She will still spoil them as the older sister. If they need something, they can go to her and she’ll probably say yes or work out how to help them. \n\nJane’s sister is poking her nose into something that isn’t broken and what, trying to break it? NTA and you should keep being the awesome dad and ex.", "Sounds like the one complaining about it has no bark in this \"battle\". Of course she can voice opinions,  but in the long run, sister needs to bugger off and mind her own plate", "NTA \n\nJane's sister needs to mind her own business and stay out of yours. How you raise your daughter is none of her business.  How you spend your money is none of her business. \n\nIf Hailey and Jane are having issues with finances, then they need to discuss it between themselves and leave you out of it.\n\nThe amount of money you give your daughter for her allowance has nothing to do with your ex since she decided to divorce you.\n\nThey all need to stay in their own lay.", "NTA,\nBut I feel you should think about how this amount of useless stuff like designer bags and clothes and whatnot is helpful to your daughter.\n\nMaybe you can tone this down a bit and put the money you save into a fond to support her during college?\n\n(And maybe, if you want to and are able set up smaller fonds for the other two girls.)\n\nWould be a kind gesture and helps the girls way more than splurging in useless bags...", "NTA.\n\nTell Hailey & Jane to get better / 2nd jobs to provide for THEIR children.", "NTA!  \n\nOnly AH here is Jane’s sister who needs to mind her business and stop seeing imaginary problems where none exist. If Hailey has no indication that an actual problem has manifested, then don’t fix what ain’t broke. \n\nYou, Hailey, Jane, and your Venn diagram of family all sound *amazing.* Respectful of one another, loving of all the kids, attentive to making sure all the kids feel cared for … this sounds to me like Parenting Done Right. \n\nAlso, given what you’ve said about Anna’s tendency to share, and the rules about sharing during family events, there’s *ZERO* indication here that Anna is at all spoiled. She sounds like she’s internalized your generosity … and that’s lovely. \n\nMy advice is talk to Hailey again - see if she’s noted ANY actual issues, and if not let her know that should something arise, you’re absolutely willing to take action - so she knows you’ve taken her seriously. But that, absent that, it seems premature to reduce Anna’s allowance based solely on the fear that a problem could arise.", "NTA *but* Jane's sister's concerns are well founded. I was from my father's first marriage. He had two from his second marriage (which also failed). The kids from the second marriage got over four times the child support that I did, even though my household income was much lower (we qualified for government cheese while they lived in an upper middle class neighborhood and both kids had their own stock portfolios). That sense of resentment and unfairness persisted well into adulthood. Even though I have tried very, very hard to move on, I think it still subconsciously colors my relationships with my half-sibs (and my father) despite all of us being well over 40.", "NTA. \n\nChildren can and do understand money differences.\nRose and Mel will be fully aware (even the youngest) that Anna gets more money because her father has more money. They are incredibly lucky that you have such a good view of their mothers and their family unit. \nThey also probably feel lucky themselves that you spoil them on special occasions. \n\nThe only reason this will cause issues is if they hear adults arguing over it. \n\nTry to have the same conversation with your ex wife that you've had here. \n\nPersonally, I feel as though Jane's sister is stirring things up and needs to wind it in before it becomes an issue for the children!", "NTA. Tell Jane’s sister, AKA the insufferable busybody who likes to stir up trouble where none exists, to mind her own 🤬business. Buy your daughter whatever you want.", "NTA. Children from different homes will have different realities and different economic experiences depending on the affluence of their parents or adults in charge of them. You said yourself you buy equally expensive presents for your daughter's step sisters and your daughter is not a spoiled brat, she always shares with them.\n\nLooks to me like the only people who should discuss how the children are raised are the parents of the children, not the aunt. And I say this as an aunt who dotes on her niblings. I ADORE my godsons to pieces but I would never even DREAM to say a peep to their parents about their allowance or gifts they get from them! Unless they were wildly inappropriate or dangerous, they are they children not mine. Sister of your wife's partner shouldn't have any opinions here", "NTA. You may lose either way you go on this at this point. So since it is working let it ride. \n\nAnd tell Jane’s sister to put up or shut up. If she is so concerned t then open her purse and give the other two kids more money.", "Fuckem you are nice enough already tell them to make more $$$ or stfu", "NTA.", "The only one planting resentment seeds is Jane’s  sister. Mind her own business.why does she have an opinion in your daughters life ???? Sister needs to keep her nose out. And if Jane has a thought then she should voice it. I hate meddling family.", "Nope", "NTA. Jane’s sister appears to be making an issue where there isn’t one. You are already going above and beyond.", "Jane's … sister? NTA.", "NTA, Jane’s sister is being ridiculous.", "NTA but you should have a talk with your daughter because it’s ridiculous her mother expects her to share her money that you gave her. Talk with her and make sure he actually is OK with it or if her mother is forcing her to do it or manipulating her? You need to let her know that it is OK if she doesn’t want to share something and that the money you give her is for her.\n\nThey should be thankful that you are so generous and get their daughters Nice presents when you don’t have to.  You need to have a serious conversation with your ex and tell her that she should’ve told that person to mind her own business and this never should’ve been brought up to you in the first place. Tell her it is ridiculous She expects you to treat your daughter differently just because they can’t afford to do the same thing and that it would not be fair to your daughter. Remind her that she is also the mother of your daughter and should want what’s best for her.\n\nEven if the sisters were jealous, you still should not stop doing what you’re doing because your daughter deserve everything you can provide for her. Her siblings are not your responsibility and it would not be fair to your daughter if you give into these ridiculous demands", "NTA\n\nIt's your kid. None of her business what you give YOUR daughter as allowance.\n\nI'd bring this up to the ex directly", "NTA. You’re going above and beyond by spending a bunch of money on the other kids too", "Jane’s sister needs to shut up\n\nNTA", "NTA  Jane's sister needs to butt out - what kind of entitlement does she have to be able to send your ex to you to talk about how you spend your money? Keep eing and amazing father and a great ex-husband, too.", "NTA. Your kid is almost in college anyway. The issue will resolve itself in a year and a half.", " NTA you slay", "NTA\n\nJane’s sister needs to mind her own business. How you raise your kid isn’t any of her business.", "Nta", "NTA at all. And it’s none of the sisters business. Your daughter is 17, it’s kinda expected at that age to have more allowance and maybe even a job so therefore have access to more money than younger siblings. My teenagers work and earn a decent amount, my 9 & 6 yr old get a weekly allowance that goes into their go Henry accounts that they can spend on sweets or save up for bigger things - there’s zero resentment as the younger ones understand that any differences really are due to the stage of life they’re at more than anything. If my 9yr old wants a new outfit I’ll take her to buy something, but if my 19yr old wants something like that then I’m more likely to give her money and let her choose herself and go with friends if that’s what she would prefer. My older kids are my ex husbands kids, my younger two are my current husbands kids, they’re all super close and have a great relationship the majority of the time, even the youngest understands that any differences in treatment are more to do with age than anything else and I’m sure your daughter and her siblings are also aware of that dynamic - kids really aren’t daft", "I treat all children the same sorry", "NTA. \n\nJane's sister is possibly legitimately worried because a large financial discrepancy in siblings, particularly in a blended family where relationships are typically more complex could easily cause issues. Maybe Jane and Hailey saw some validity in her concerns and are worried about the future relationship of their daughters.  But you have been very fair, gifting your daughter's half/step sisters with \"on par\" gifts for special occasions and holidays and you and Hailey have obviously raised your daughter exceptionally well if as a teenager she is not only level headed and appreciative of her good fortune but generous with her younger sisters. Anna is 17, so while I do understand this concern of future resentment etc (even if originating from your ex's SIL is strange) if things are good now I doubt the financial disparity is going to cause major problems with the girls later on, as Anna will be a legal adult/out of the house. It's much more likely if it later becomes an issue it will be between the younger girls and their Moms (perhaps Hayley more so than Jane) that they aren't being given the same financial liberties that their sister was afforded at their age. Which is 1000% not your fault, and if Hailey and Jane raise these kids with similar values as you two did Anna, even with teenage angst it might cause some arguments but nothing relationship ruining.\nMaybe try having another conversation, taking a bit of time to get over being blindsided. Perhaps tell her you understand that she has concerns but you would like a little time to consider a change in how you treat your daughter, not wanting Anna to feel she did something wrong or resent her Moms or sisters. Hopefully being prepared to articulate a response to her concerns, calmly voice your own and show you aren't being dismissive will help. The three (four/six) of you seem to have had a very successful relationship, I don't see why this as long as it's handled with respect from all sides should ruin it.", "Idk man. If the parents don't bring it up. I think your good. Specifically if you are good friends. The sister is putting unnecessary guilt where there isn't any.", "This sounds very fake and as if a 12 year old wrote it", "I don’t think you’re the asshole. I want to ask, though, what is Anna doing to earn such an exorbitant allowance? What is she learning by having this allowance handed to her?\n\nHaving work with a lot of well off youth as a (broke) teacher, sometimes there CAN be a disconnect between their realities and the realities of life. And so when things come easy / they don’t have to work for something, when a problem CAN’T be solved with money … sometimes they struggle more to adapt/goal set / work through it. Obviously not saying this is the case here. Just things to consider. NTA though.", "NTA Janes sister isn’t in your family sphere, which seems to be working extremely well based on the relationships you’ve explained. It’s not her business and unless it starts to effect the families negatively I wouldn’t entertain her opinion. You sound like a great coparenting blended family and all of the girls are beyond lucky for this", "NTA sounds like everything was working fine in your family until Jane’s sister stuck her nose in. It is the responsibility of your daughter’s mother and step mom to explain any concerns the younger girls have over the discrepancy in treatment.  Which doesn’t sound like much of one since you are taking on an uncle type role to these girls. \n\nJames sister needs to stay out of family business.", "NTA. This is just a potential outcome when families are blended.", "NTA! The sister needs to mind her own business. I can’t imagine being in such a good situation and then someone tries to muck it in you guys. You all have a great co-parenting relationship. Things are smooth and no one has financial worries here. You and the wives have done so well in all the transitions. You’ve been so kind to the other girls and you and your daughter are both so sweet! \nAll of a sudden there’s a problem where there wasn’t one before and it’s coming from an outside source.", "NTA and Jane's sister sounds like an idiot.  I'm pretty sure a 14 and 10yr old are not oblivious to the notions of wealth and class and are pretty happy with how things are considering their big sister shares everything with them so they aren't lacking.", "A lot of the folks here aren't in blended families, and it shows.   \n\n\nNTA, but not because Jane's sister is necessarily wrong or 'meddling'. You just received a blessing in this conversation: someone is trying to prevent future strife for you and yours. People here seem to think the insular nuclear family is the only model that works (that's where this idea of 'meddling' comes from), but you've already shown evidence otherwise. You're in a blended family. That means you do things like listen to a mom's sister, because that extended network of people (particularly if the people are all amazing, as you say) is full of good information.   \n\n\nAside from your pride, what's the harm in moderating things a little as Anna's sisters get older? You already said you'd rather she have an amazing relationship with her sisters than more merch, so the suggestion already aligns with your values. I'm not sure there's a problem here so much as a very functional blended family unit and just a lil bit of dad pride.", "NTA. She is 17 and your daughter.  If you can afford it, it is your choice what you give her. The other two girls are not your daughters or stepdaughter, so the fact that you buy them anything makes you a good person. They could end up resenting her for anything like being prettier, older, or going to a better college. As long as you're raising your daughter to not be entitled and to appreciate what you do for her, then that is all that matters. \n\nIdk your business, but what if she starts working for you? Bad has a good salary. Are they going to complain that her income is better than there? The two girls need to learn that not everything in life is equal. They will be treated differently throughout life. Maybe they need to be talked to instead of you and your daughter to ensure there is not resentment.", "1. It's YOUR money. \n\n2. She's YOUR daughter \n\n3. Whoever is Jane's sister should shut up--she's creating unnecessary issue and drama in your family.\n\nNTA.", "NTA .. but Hailey asked you to tone it down. Janes sister isnt asking you, Hailey is. So clearly she and Jane want you to tone it down, but are blaming janes sister.\n\nSince you all seemingly get along super great and never have conflict maybe Hailey is just nervous to bring this up to you and needs a scapegoat. Maybe there was a conflict at home or a money change for them that they are trying to skirt around/avoid discussing with you. \n\nYou, Hailey, and Jane should sit down together and have an open, honest, relaxed discussion to share all your thoughts (not janes sisters thoughts!)", "NTA. Jane's sister is TA", "NTA\n\nSounds like you’re raising a good daughter. Jane’s sister needs to mind her own business. The girls will understand because Hailey, Rose and Mel are very different ages. By the time they’re Hailey’s current age and want more money, Hailey will be an adult and on a different allowance/support around college.", "You should like an amazing person and father. Unfortunately janes sister seems to be externalizing her own issues onto you.", "Does Jane's sister have a Deadbeat Dad in her life anywhere? This sounds like projection and bitterness on her part.", "NTA - if your daughter behaved spoiled and wasn’t kind or generous I’d say stop because it’s not good for kids to get everything they want without understanding the privilege of having money or the value of money. And in a blended family, these issues come up and the moms need to address them rather than telling you not to provide what you can for your daughter. \n\nI think it would be wise to actually ask a professional psychologist about this. Also, by the time the younger girls are old enough to care more, your daughter will likely be out of the house. \n\nWe all want to provide our children with the life we’re financially able to, and it sounds like you’re very considerate and conscientious around holidays to ensure the younger girls don’t feel left out. \n\nThis is the type of issue that comes up with divorce and blended families and it just needs to be worked through in their household. \n\nIf your daughter was spoiled and cruel regarding her privilege I would say stop spoiling her. But not because of the sisters, but because you don’t want to raise an entitled adult.", "NTA. Why not speak to your daughter privately and offer an option to \"tone down\" her allowance, but instead have the difference transfered into some type of fund for her?; As incentive you could offer to match the \"allowance contributions.\" It  wouldn't need to be disclose it to anyone else, and you still get to spoil her responsibly.", "NTA.  I think it is a reasonable request, but not something you are obligated to do.   You spoiling your daughter has a very good chance of causing tension with her other siblings, but is also your right to do.   Any chance you might be able to spoil them too?   Either way, she is your child and I get wanting her to have the best.\n\nThe reason I'd completely ignore the request:   You weren't asked to because there is tension.   You weren't asked to because your ex thought it was inappropriate.    You were asked too because the new wife's sister thought it was wrong.   I don't see what she has to do with anything, and should be dismissed from the conversation.", "NTA\n\nJealous much? The only person who has a problem with this is your ex-wife's wife's sister. She doesn't get a say in how much allowance your daughter gets, she has nothing to do with you. You, your daughter, Hailey, Jane and their daughters are all fine with this arrangement. They are the people whose opinions matter in this situation. The opinion of a step-aunt means nothing. She is the one creating resentment, and it's not even her business in the first place.", "I agree with you. NTA. Im sorry but you have ONE KID, your ex-partner decided to have more of them without you, you are NOT those girl’s dad like you are Anna’s dad. Anna deserves to have HER dad take care of her, the others have two moms to spoil them.", "NTA\n\n> She believe you can’t raise kids in one household with different lifestyles without creating resentment\n\nWhen it’s from favoritism this is a problem - but this is a blended family situation, where the children have different parents.\n\nSo here it’s important to help guide kids through those feelings, not demand someone else have money or gifts taken away.\n\n> that might change when the two girls get older and start to understand concepts like wealth and class. \n\n…they are 14 and 10. They definitely already understand the concepts. \n\nJane’s sister is either being a busybody, or is trying to advocate for something your ex is worried about and isn’t willing to speak to you directly.", "NTA. What the hell does the sister have to do with any of this? Just makes me wonder what kind of conversations are talking place for this topic to even be brought up… It’s not as if it’s a casual conversation amongst sisters is it? \nWeird that they would even try to limit your daughters allowance as a way to quash “resentment” lol, like that is in any way fair.\nThe answer is obvious here… Carry on regardless.", "NTA - why should she have to downgrade her lifestyle just to match them? I would do as you like with her. If anything just tell her to be discreet about it", "NTA you sound very considerate of her step sisters anyway", "NTA. I just want to say that I think it is absolutely amazing that You, Your Ex-Wife and her Wife are good friends! It is not necessarily the norm for divorced couples to remain close after a divorce and I love that y’all work with each other. Also, putting some stipulations on Anna’s allowance (such as the family trips, etc.) was a good arrangement on your part. You are teaching your daughter to be a loving & caring sister and you have her absolute best interest at heart. Keep it up Dad, you are doing great!", "NTA please correct me if I am wrong no one had an issue not your daughter her sibs your ex or her new wife. Janes sister suddenly says something and all of a sudden there is an issue. Sounds to me that the only person that really has an issue with how much money is being spent is Janes sister. Want to bet she is after money from Jane has been told no as we try and treat the girls the same so she wants less spent on the girls so there is spare money for her.\n\nWow Reddit has really made my cynical.\n\nEdit realised Jane was the new wife not the new wife’s sister", "NTA.  It's strictly Jane's SISTER'S problem NOT any other family member's problem.  Annie is your biological daughter so whatever.  That you still have a good relationship with Hailey and her wife Jane and even their two kids is awesome, everyone should be so lucky!\n\nTell Hailey it's your money and if no one except her SIL is objecting then there is no sense creating a problem where there isn't one.  Be polite but firm on this point.  Your daughter shares and no one had an issue until a certain someone opened their mouth.", "Huge NTA.. Your relationship with your daughter is between the 2 of you. What you give her is up to you, and she shouldn't be penalised because her step sisters parents don't give them as much as you can give her. Besides, she will be off to college soon (or whatever she decides to do when she turns 18) and will need that extra money. \n plus age matters in this the other girls are younger and won't need to pay for as many things as she dies like fuel for her car. Going out later with friends, female things like pretty underwear and such. The older she gets, the more expenses she has.. plus Jane's sister really just needs to butt the hell out and not stir shit up that's not even an issue", "NAH\nhang on a minute, I've been scrolling for ages and everyone is seriously just going to fall over themselves to accept this at face value and gush about him being such a good dad?\n\nI'm sorry but the daughter *sharing* with her sisters is a nice idea but how does this work in reality? He wardrobe is totally open to them? Or they ask and she graciously allows them to borrow something? Or they get her hand me downs? All of those acts are generous, sure, but none of those things is \"sharing everything\" unless she literally splits the cash of every allowance or say, at least every shopping trip with them equally.\n\nI'm not saying she should do that, I'm just surprised everyone's saying \"hey, she shares everything, there's no problem!\" As though \"sharing\" could never be seen as flaunting by someone mean spirited.\n\nAlso, pretend that they are not half-sisters, but full sisters. (Because even if there is another adult in the mix, even if one sister isn't home for some of the week, if they've grown up together then they are just sisters, half doesn't really actually mean anything.)\n\nPretend it's YOUR sister.\nShe lets you borrow her stuff, she's lovely, whatever.\nNone of that stops a bit of jealousy rearing it's head. Annoyed thoughts here and there. None of her kindness stops that little feeling of \"what did I do wrong? Why does she get this from the universe instead of me?\"\n\nThere's no easy answer to that, I'm not saying anything in this situation should even change, just surprised everyone is skipping over this line.", "Absolutely NTA. You rock, and the sister of Jane needs to stop being so mundane. (God strike me for this pun)", "NTA \n\nThis is a game of telephone: Jane's sister to Jane and wife to you. Who is Jane's sister to have an opinion? Is she a child development specialist? It seems that Jane's sister has the problem. Is she envious of the life you are able to provide to your daughter. The sister is stirring the pot, for what reason, who knows. \n\nAs long as your daughter isn't bratty about it and continues to include the other children, there isn't a problem. Tell Jane's sister to mind her own affairs.", "the sister is TA", "NTA My step siblings have million plus dollar trust funds and I grew up rolling quarters to buy milk, we’re still extremely close.", "NTA The only asshole is Jane’s sister sticking her nose where it doesn’t belong. Period. \n\nThe fact that this wasn’t an issue until that cow made such a statement tells us all we need to know. You are not responsible for the other children in that household, only Anna. However, it sounds like you have gone out of your way to be generous to the other two, as well, in a situation where you absolutely have no legal or moral obligation to.\n\nCarry on, OP… carry on. \nJane can kick rocks while she pulls her nose out of her sister and sister-in-law’s business.", "You NTA, but you should be aware that there are consequences for spoiling your children, even if you can't see them now. I've known a lot of people who were spoiled like you describe, and every one of them regrets it. Every one of them has indicated that they felt it handicapped them in adulthood, and were a detriment to their relationship with money.", "NTA - Jane's sister  has no right to chip in. Your daughter, you spoil her as YOU please.", "NTA! Those 2 girls are not yours to raise. They have  2 parents to provide for them. They aren’t your responsibility & I think it’s awesome (and unnecessary) that you even buy them gifts during special occasions! My own step parent has NEVER bought me a damn thing! They aren’t even your step kids. You have no obligation to them at all. Why should you change what you do for your child (which may make her resentful) because your ex wife & her wife can’t take care of the 2 girls they have together, in the same manner? That’s absolutely ridiculous!", "NTA\n\n\"Thanks for your concern. I will continue to monitor the relationship dynamics and make changes if I deem them necessary.\"\n\nBut for real, she does need to mind her own business.", "NTA Jane's sister needs to mind her own damn biscuits. She's jealous as hell and is being a nosy brat. You need to sit down and ask the two, why the hell does her opinion matter? Cause' she isn't raising the girls. You all are. They certainly need to tell Jane, to mind her own damn business.", "NTA Why is Hailey so weak that she is letting her sister come into her family and create a situation that doesn't exist? And convincing her that she needs to tell her Ex-husband what he can buy/give his daughter? Literally, Jane is not the boss of you. \nGive Hailey a hard no on this.\nHowever, YTA if you really are spoiling her which implies showering her with material things while requiring zero responsibilities. \nMaybe just say that you're providing your child with the lifestyle that you can afford, which is your right as a parent.", "So I can see both sides if you still want to give her more maybe give her some and put the rest in a savings account for her that way once she's 18 she either has a nice nest egg or has college money.", "Nobody had a problem with her allowance until Jane’s sister butted in. Your daughter is 17, she’s practically grown. The allowance hasn’t caused issues yet, and you’re doing nothing wrong by providing it. Don’t change a thing.", "NTA in the slightest.", "NtA, you shouldn't be sorry about giving your child the best you can, but that includes raising them as a person. If your kids are all sharing and getting along, especially at high school age, you all did a good job.\n\nThe SIL should really be told that her jealousy is not appreciated in the home.", "NTA,  First, it is none Jane's sisters business.  Second, you aren't even obligated to spend a penny on the other kids, but you do.  Three, it sounds like there are stipulations you put on your daughter's allowance.  Jane's sister either likes starting drama or is jealous.\n\nThe only thing I may suggest is to talk to your daughter and get her take.  You said she is 17. She is old enough to grasp the situation.   You don't want to risk any resentment that can brew between you and your own kid.  This also will show your daughter you respect and value her thoughts.", "If you reduce your daughter allowance for that reason you will start the resentment. Nobody take kindly to receiving less than what they're use to have.", "NTA. The other girls aren’t your daughters. And this isn’t Jane, it’s Jane’s SISTER? What right does she have to tell you how to distribute your money? No one in this story sounds like an AH except Jane’s sister.", "NAH- I think that this warrants a deeper discussion. Jane’s sister has a good point, it just may not apply here. \n\nAnna is 17, which means in a year or two, she is off to college or whatever her next adventure is. Rose and Mel will not have the financial differences in their face from their sister. Rose is probably already aware of these differences. If not, high school will likely enlighten her. \n\nBut unfortunately at some point when the two younger girls get older this might very much be an issue. And depending on where things stand as a family, there might be shifts all of you make in order to help the younger ones learn the realities of class and income with the least amount of pain possible.", "NTA. Jane's sister seems to be the only one complaining about the arrangement and needs to butt out.  Until if or when either Hailey or Jane say anything, keep on keeping on.", "NTA. Your hard earned money can be spent on your daughter and you are careful to include the other girls, so it's OK. You are not being obnoxious about it.\n\nHave you talked to your daughter about investing some of her money? It's nice to have merch and what not, but that would be a good long term plan.\n\nAt some point you may have to address disparities in college education funding and inheritance and it will be what it is.", "What’s the allowance??", "Carry on exactly as you are doing, by being a good generous hard working dad with a generous minded daughter. \n\nYR ex's sister in law should keep out of this. Nothing to do with her at all. Jane should have backed Hailey up on this .\n\nBe gracious and carry on regardless.     \n\nincidentally, if and when your daughter has a spat with you , speaking from experience, the issue will probably be random and totally unexpected like , as the eldest I had to be responsible for younger siblings but they didn't have to be responsible for me.. ? \n\nOr why did you buy me a motorbike helmet at aged 7 ? I was on the back of a motorbike behind  you , my supposedly responsible parent at aged 7 - so my new girlfriend/ boyfriend doesn't need to have a job ... etc \n\nGood luck. Dont worry x", "I don't think you should stop spoiling her, but there is a modicum of truth that living with someone who gets everything you want while they do not does cause somewhat of a divide/little jealousy etc.. The messed up part is no one is in the wrong... But that doesn't mean the reality of life doesn't exist either.", "NTA. You sound lovely, that’s all I came to say. Great job parenting!", "NTA.\n\nIt's your daughter and you are making sure her needs are met and she can buy things she likes for herself.\n\nThe step-sisters should understand that and all of you can sit and explain to her why it is not her business how much money Anna is getting. Anna is a young adult and to me, it sounds like her little sister is getting a bit entitiled esp if Anna shares her stuff with them.\n\nA grown up conversation with this girl, outlining boundaries and the structure of the family should be done. Your ex and her wife should let their daughter know that Anna's dad can afford to do things that they cannot, and she should not have to tone down Anna's allowance to make her feel better. It is best they nip this in the bud bc that little girl sounds like she is a bit entitiled.\n\nEdit: Grammar", "I can see both sides. No one is the asshole. \n\nBut maybe set aside the difference from what you usually give to the amount that they’re ok with and put that money towards a saving for your daughter. It can grow and maybe give it to her on her 18th or before college. Since you are the father, that money saved is warranted if it’s used towards college.", "NTA. You dont technically have any obligation to the other girls. Its amazing that you buy them nice things for special occasions and that your daughter shares her nice things with them. But you don't have to. \nIf it's really bothering you though, you could always \"cut\" her allowance and put what you dont give her into a savings account for her.", "If you take away your daughters allowance now it’s gonna make her resent them.", "NTA but it’s true there will always be a slight resentment. It’s good that your daughter is thoughtful of others but maybe if you tone it down for now and fill a trust or something for her so when she’s graduating and moving out she will be able to spend as her heart desires without it being so visible to her siblings.", "I don’t think you’re doing wrong. You have the right to continue to do for your daughter as you see fit. Things didn’t work out for you and her mother, her mother went and became a new family with someone else and that’s great that she found happiness. Your daughter has showed that she doesn’t act like she’s better than her step sisters but her mothers choices should not affect your daughter’s lifestyle.", "NTA, Jane's sister is such a nosy lady that shouldn't meddle with other people's lives. She should know how to practice boundaries. Don't let other people dictate how you raise your  kids unless it's harmful.", "When my father got with someone who had her own kids, (I was 15f at the time, living with him, she had her youngest (12f) with her, all of us moved in the same apartment) she would get angry anytime my father spent money on me (I asked for deodorant and razors because I ran out) and expected him to give her daughter money equal to whatever he would give me (if I wanted to go out with friends). It didn’t matter to her that her daughter was spoiled by her father, or that she would give her daughter money without giving me money, I was the only one expected to “lose out” due to their new relationship and my father was the only one expected to “treat all kids equally”. \n\nLooking back, his inability to be /my father/ first when it came to me was a big reason a rift between us started. \n\nI think you’re NTA OP, it’s your daughter and the other two aren’t. If anything you’re more an uncle to them, you shouldn’t be expected to change how you treat your daughter for children that aren’t your own (this does differ with stepkids, but they’re not your stepkids). It’s one thing if you’re constantly showing up with extravagant gifts and parading them in front of the other girls faces (which it doesn’t sound like you are), it’s another to expect you to stop doing what you would do for your daughter otherwise simply because other people ended up involved in her life. \n\nOP, I would advise you ask yourself, how would your daughter feel if she knew you started doing less for her because she has siblings in her mothers home?", "If your ex-wife and her partner wish to make it even , let them contribute the extra. It's not their business what you do with your daughter as long as it's legal and you obviously busted your back to make it fair for all of them.", "NTA !\n\nThe only asshole here is Jane's sister.\nYour daughter shares her stuff with younger siblings. She doesn't flash her much bigger allowance in front of them. And she is older, and older kids usually get more pocket money. As someone mentioned already, it is a great opportunity to teach her about savings, spending habits, etc, so you aren't spoiling her, you are teaching her \"money responsibility\" 😉", "Nta", "Jane'  Sister sounds like the villain in this story that indulges in ruining harmonious relationships and families. Calmly tell your Ex that Jane's sister needs to eff off cause she has no right to dictate how you parent your daughter. People like Jane's Sister suck! NTA.", "I don’t think you’re an AH, but this can end up being a win-win. My idea was to level your allowance to the same level (or at a level more people are comfortable with), and put the rest into some kind of a trust or savings account that she’ll have access to at 25 or whatever. I think there are creative solutions available. Good luck!", "You've heard the phrase \"easy come, easy go?\" \n\nHow old is Anna and does she earn her own money as well? Smart rich people make sure their kids understand the value of money and the pleasure of self-sufficiency. Aside from creating stress with her sisters, which is probable, too much free money can be destructive.", "Big NTA, you can spend your money however you want and it sounds like you all have an awesome family dynamic.", "NTA. The sister-in-law needs to mind her own business. Sounds like she 1) had a solution in search of a problem and 2) might be jealous of how much you’re able to spend on her nieces if she can’t do the same.", "Music teacher here.\n\nThis is not a problem to be overcome, but an opportunity to be the father you want to be.\n\nTL;DR at the bottom\n\nBoth are true; we live in a shallow, luxurious world and we often forget and don’t appreciate what we have, so teaching that humility is important.  But we also paradoxically and simultaneously need to feel loved unconditionally.\n\nShe’s daddy’s girl and you love spoiling her, but there are a lot of men these days that think the material aspect is the only important when dating, and they use it to lure women in that they have maybe don’t actually see as people, or maybe these men never had anyone model loving behavior outside of just providing and being a walking paycheck.  That’s how women end up with rich guys who abuse them, and it’s also how those abusers end up being the creeps they are.\n\nThis is the trap of working hard and making money as a parent: you get your kid used to a certain lifestyle and they feel inadequate if they can’t maintain it on their own for whatever reason, even if only temporarily, and they let people who can help them maintain it manipulate and exploit them and sacrifice autonomy or self respect for it.\n\nIs your daughter responsible? Does she have a balance of good work ethic, enjoyment of life, and humility?  Then there really isn’t a problem.  She’s also older, so OF COURSE she should have a bit more allowance because that’s what happens as we move through our teens.\n\nHowever, it’s also important for her to understand “lack” in the home before she gets out in the world so that the dynamic I mentioned further above doesn’t cause anxiety that can lead to said exploitation. (i know that wasn’t your question but it bears mentioning here)\n\nI can speak from experience and observation about the whole “resentment” thing but I won’t tell you the story outside of a DM.  I’ll say this: resentment between sisters can absolutely happen in this case if it hasn’t already started. You can’t control everything, but your Ex is the orher parent and yes you should compromise somewhere, somehow.\n\nHave you spoken to your daughter about it?  Have you asked her how her relationship with her sisters is going, gently, lovingly and without judgement so she can be open and honest with you? Maybe if you sit down and have a convo with her and just explain it to her.  I don’t mean to tell you how to raise your kids but you are asking; so maybe this is just one of those moments where you need to sit down and teach her about how jealousy can ruin friendships, relationships, and families without demonizing the jealous person, and that sometimes we have to ask ourselves: what’s more important: Material possessions or the people we love?\n\nI promise you; this is an opportunity to be a better person, and to teach your daughter to be a better person.  It’s also a HUGE opportunity to be a good model of an emotionally available man that loves her, and wants the best for her so that she finds a a good partner in her life if she’s into guys.\n\nWe also need to learn to receive the resentment and jealousy with empathy, compassion and grace, and this is another great reason to have this discussion with her.\n\nYes, you want to spoil your daughter, just like you wanted to spoil your wife when you were together. It’s not bad, but there are just more important things in life than the material and it’s important for your baby girl to start that lesson in the safe environment of your home instead of “out in the wilderness,” while also seeing that there are different ways to show love to one another.\n\nTL;DR\nSwallow your pride\nThere’s 2 parents that need to work together and compromise\nModel emotionally vulnerability from a man that loves her for your daughter; yes, I mean cry in front of her; probably the most valuable thing\nHer families love is more important than material goods: explain it to her as lovingly as possible, while being truly open to feedback.  Don’t raise your voice, don’t chastise; reason, converse share emotions.\nSpoiling women is what boys do, not men.\n\nHope this helps, and good luck!! 👍", "Dont stop,j ust ... you know, tone it down a bit. No one has objections, problem solved!", "I don’t feel you’re wrong here at all.  No NTA.  Tell her to mind her business.", "Sounds like you, your ex, her wife, and all 3 kids are doing well and working together as is best for everyone *involved.*\n\nJane’s sister is not part of this and should not be*involved* in making these decisions. Since you seem to have a good (great?) relationship with Hailey and Jane, it might be helpful to have a chat and go over this? “You know, I appreciate your sister is trying to look out for your girls. And while that is kind of her (give her the benefit of the doubt, or at least pretend to for your relationship’s sake), she isn’t privy to all the dynamics of our relationships. I know you both love all 3 kids, and so do I. Things are going well they way they have been, I’d like to continue that. I think the three of us work great together already.”", "NAH but you could consider teaching your daughter to save some of the money you give her. One day she’ll be 100% on her own financially. Learning to save now will help her long term", "NTA. I would have exploded if someone said something thst stupid to me. Are they joking? That is your fuking daughter. Of course you shouldn't lower her allowance or stop providing the very best for her. That's literally your job ad a parent. I wouldn't give a rats ass if her stepsisters like it or not. Mommy and mommy need to do their job and teach their daughters how trashy jealousy is and to make sure their daughters don't develop that toxic childish trait.", "NTA. One HUGE thing that's glossed over when it comes to allowance is ages. Younger children should never get as much as a great adult in my opinion. My siblings never got as much as I did for the same work and neither do my children. Younger isn't as knowledgeable and definitely not as experienced in the chores or items they need to do so why should they be paid the same as the now experienced? That's my main thing. There's a base allowance and it grows as they get older. Just my opinion though", "The other thing is Anna at 17 will be out of the house soon. If Jane’s sister would STFU the income disparity will remain a non-issue. NTA", "NTA ...do what ya like , it's your kid.", "NTA. Your daughter. Your money.", "NTA. However, as Anna is 17, she seems mature enough to be brought into this conversation to give her input. Given the age difference, I think it's reasonable that children wouldn't have the same things. I always viewed my older cousins as grown-ups and of course they have grown up money and I don't.", "I know this isn't germane to the conversation, but how are they \"step\" sisters? Did Jane already have children when Hailey married her?", "So my initial reaction is nta BUT then i started thinking about my own personal experience. My dad, like you, is pretty well off. He was always the one who took me on vacation and bought me things. My mom had full custody of me, and she was not well off, we were evaporated milk instead of regualr milk and cinnamon sugar toast as dessert poor. I had two step siblings from my step dad (not at all related to me, his kids from a previous marriage) and one step sibling from my step mom ( also from previous marriage, no contact with biodad) and i have absolutely no relationship with my step dads kids. The older of the two constantly said i was spoiled, ruined my things, and terrorized me, now he also has a host of mental health issues and is probably a literal sociopath, which can explain the more... severe... things, and their mom and dad did not get along, whereas mine did. But they did seem to resent me. My other stepbrother, however, i still talk to. We had a great relationship, but there were times that i was jealous of him, he has never known the kind of struggle i have. He went more places, got more things, and did more stuff. There was a point in time i did resent him a little bit for it.", "your daughter is on the brink of becoming an adult. i think this could be a great opportunity to discuss with her the power structures and imbalances that can come with money, having it or not. help her understand what it might be like to not have the money she has, so she can have sympathy for her sisters and be kind as her money grows. \n\nher sisters aren’t entitled to what’s hers, that is never true. but, her sisters are entitled to a home environment that feels safe, welcoming, loving, and balanced. so, i vote mutually working (between yourself and hailey/jane) to instill compassionate spending into your daughter, in which she recognizes that not everyone is as lucky as she is to have this. \n\nhopefully this will help all the girls grow, learning to build friendships and relationships that cross the lines of class and social status, and instead challenges them to love one another on personal and moral merit. \n\nmoney is power, and you don’t want there to be a power imbalance between your daughter and her sisters. but, taking money from your daughter because she has more than her sisters would also be a power imbalance that is unfair. the best course of action is to teach these girls how to move through these financial differences with grace and compassion for one another. teaching the young girls to be happy for the people they love when they succeed and thrive, and teaching the elder girl to be considerate and not boast about our wealth, especially in the presence of those who are not so lucky. \n\nmaybe even as far as teaching her about the gifting nature you yourself have, of spending large sums on gifts for the girls for special occasions and such, showing her how your money can be spent on others as well as yourself, and still feel just as good and rewarding. \n\ni hope this helps <3 it sounds like you have a beautiful and lovely family, i dont think anyone is an asshole here.", "NTA\n \nYour kid’s sisters already understand wealth and class because of social media. Even if they had zero access they are already at the age when it is most important. This is a silly notion.  You sound like a wonderful dad with a wonderful kid.\n \nEven if you tried to honor the reqiest you couldn’t accomplish it.", "NTA \nSeeds of resentment could be planted in many ways, such as Jane's sister pointing that out.....", "Nta. Jane’s sister needs to mind her own beeswax.", "NTA, you're doing what's right, your daughter doesn't act spoiled, is kind and shares her stuff, she's also responsible with her money and caring for what I read. On the other hand, Jane's sister is not on the right, she's not the one to tell you this, Hailey or even Jane only have that right, maybe even Anna step sisters could tell you about this, but this woman is not in the right position.", "Also, things *aren't* equal.  Rose and Mel get to be with both their parents all the time in the same house.  There's only one fridge to display your test on when you get an A.  \n\nOP's daughter has to have a foot in two households all the time, which is a lot to navigate even if both households are supportive and amazing.  She always has to \"choose a fridge.\"  No extra gifts or allowance really makes that equal.", "I don't get the \"when they're older\" argument in relation to the 14 year old. She's absolutely already old enough to notice those things.", "Jane's sister has no say in the situation.  File that where if belongs...the trash.", "Agree NTA and on the flip side he will be planting that seed of resentment if his daughters’ allowance is cut because of her step siblings. You have great rules in place like requiring her to include the girls vacations and theme parks.", "Yeah “learning about wealth and class” sounds more like the bitchings of a leftist academic who only goes around trying to solve non existing problems.", "Just saying he doesn’t have any responsibility to provide his ex wife’s kids with any of the things you mentioned. He is generous enough to pay for their expenses on family trips and outings. He didn’t decide to have two more kids and giving them part of his inheritance would take away from what his own daughter is entitled to.", "The sister in law has no right to a seat at the table regarding how OP parents his daughter. She absolutely is the asshole here.", "I also disagree with the NAH, because Jane’s sister is an AH. It’s not of the sister’s business. However, I agree that OP could put the money in an account or a trust, and set up his daughter for future success with a financial education on how to use it. I think that is more of a good or best situation, where OP could do more to prepare his daughter for a life of success instead of just current stability.", "Jane's sister sucks! People like her are manipulative pests.", "Hopefully he teacher her that other peoples jealousy isn't her problem, not different than their drug addiction. That's a disgusting trait they need to address.", "Agreed. Jane's sister seems like the bored type who invent drama where there is no drama for fun.", "He's NTA but if you think teenage girls wont feel resentment over this I have to ask. Have you MET a teenage girl? They're petty, jealous and immature. It will become a \"thing\" without a doubt. I don't think his daughter should get a lower allowance but if there is a way to mitigate the resentment somehow, it would be a win-win. Why not be a fun uncle?", "He is calling them step-sisters, so that would suggest they have a 2nd parent or the ex's wife became a single parent but later married.", "This! ☝️ You’re absolutely right. This will cause more resentment! \n\nNTA", "This. I was going to comment about this too. If there was going to be resentment between the girls it would have already started some time ago.", "Is it normal?  I stopped getting an allowance when I was old enough to have a job at 14.  Same with my wife.\n\nI did in fact need more money as a 17 year old, but that's because I was expected to pay for most of my own stuff outside of necessities and holidays.", "Yeah, except the other two aren't going to age into a huge allowance.... they aren't going to suddenly be able to afford what she is when they get to her age ..", "Would it be different then if the youngest was the half-sister who had the bigger allowance from her dad and it was up to her to decide if she wanted to share with her older sisters?", "Learning thst jealously is trashy ass behavior and it is never your concern is a great lesson for a kid. Fuk janes bs. I would have laughed in her entitled face if she said something that stupid to me.", "I did say that, that he doesn't have to do anything for the kids that aren't his. My question about inheritance, college fund etc was meant to point out the absurdity/ridiculousness of the whole thing...with Jane's sister and the fact that his ex-wife even brought it to his attention...ex-wife should have either ignored the SIL or shut that shit down. And not involve OP at all.\n\nEdited.", "Yeah this is what I would do. She’s nice about sharing her free stuff from Daddy, but she also needs to learn how to afford stuff without his help. \n\nSaving more is the best of both worlds for everybody.", "That does make a difference, but I'd think the same.  \n\n\nTrying to foster division between the sisters by making a big manly deal of how much money HE can afford to shower on HIS daughter? AH.", "Personally, it just feels like Jane’s sister has been sacrificed as a pawn to express feelings that Jane herself probably has but is too afraid to own up to. You know make this person, you have no affinity with, out to be the baddy so you can remain on good terms.", "He’s not obligated to his ex wife’s step kids. He doesn’t need to be the fun uncle, but it does sound like he does for them equally on occasions.", "Sure but maybe Anna feels resentment that she doesn’t get both her parents and the other kids do? I mean there’s no way to equalize this situation and it’s not OPs responsibility to provide for the other kids.", "It sounds like he already is. Plus if daughter is already 17 it's a bit late, I'm guessing she'll be off to college in less than a year and the point will be moot, unless they get jealous because she can afford a better college or something, but... that's life. The only real problem I see is Mom and her unreasonable request.", "I suspect OP is simply unclear on terminology. But since people are repeating it.... If all 3 girls share a parent (i.e. OP's ex) Anna is a half-sister to the younger girls. It doesn't matter if that parent is biological or adopted. If, on the other hand, the girls do not share a parent, they would be step-sisters. For example, if the younger two came into the marriage with Jane, and OP's ex is a step-mother who has not adopted Jane's daughters, they are Anna's step-sisters.\nSince this post is all about differential treatment, it helps to identify the different relationships, since legal, as well as emotional possibilities are involved. Step-siblings usually come into a familial relationship later in life. If a marriage fails, it may completely end any relationship between step-siblings. Not so with half-siblings. They would or will be part of Anna's life forever.\nBTW Jane's sister should butt out. It's useless and potentially.counter-productive, to base parenting decisions on feelings a child might develop some years down the road. You all have enough on your plate without her adding things.", "That’s not what I meant was normal. It’s normal because the activities you have to pay for and adulthood is around the corner you need to save and so on. What I meant might be normal is an older sibling being generous to the younger ones and doing stuff with them with their money and so on. \nI too worked my ass of as a teen and paid for everything myself 🤷🏼‍♀️ but wouldn’t it have been nice to focus on schoolwork and having an allowance instead? OP has the means to give her an allowance like that, I know what I would prefer my kids had. Also no where does it say that Anna doesn’t have a job too…", "But that isn’t OP’s problem..", "But that’s not what’s going on here, so what’s the point of discussing that?", "Got it! Misunderstood your intention in that part. Completely agree.", "Because there's no evidence whatsoever that it's over jealousy. It could be, but you need more info to make that claim.", "She had no right to bring it up at all. I could see a concerned aunt trying to advocate for her other nibblings, but the fact remains that Anna has two parents and a stepmom, while her half-sibblings only have two parents. Her father shouldn't be punished for being successful and wanting to give his (only) daughter the best he can. Anna seems to have been raised well, not rubbing it in her siblings' faces, and sharing a lot of what she has with them. And OP is giving the siblings a lot more than they're entitled to from him (which is nothing, actually, since he has no obligation to them whatsoever). This obsession with levelling the playing field when it's not warranted is only going to drive a wedge between Anna and her siblings. And if the two moms keep pushing the matter, I could see OP withdrawing his generous support. And Anna may well decide to move in with him full time (she's 17, so a judge would listen to her opinion if it came to that) and go LC with the rest of the family. All because of a busybody who has no skin in the game.", "It's your money and you can spend it however you want,", "Exactly. We can only look at the situation as it is today. Maybe the two younger sisters parents will win the lottery and move to a magnificent mansion when the eldest has moved out 🤷🏼‍♀️ is the retroactively unfair to her? The children have different parents, should the eldest have less out of principle just because? One could argue that she would probably give up her extra pocket money if that meant she could’ve grown up without her parents divorcing. Life isn’t fair like that. It sounds like they have a great system going where OP is very generous and warm towards the younger siblings too. \nAlso why isn’t the mother worried about her eldest being resentful over her allowance being cut because her 10 year old sister might be jealous possibly someday and find it unfair. What has the 17 year old done to deserve it? If she had been bragging and rubbing it in the younger ones faces and being a privileged brat, then yes by all means please cut her allowance. But her being generous, loving and sharing and actually responsible with her money? How is it fair to cut it in half when she is being kind with her privilege?", "It doesn't sound like an obsession from the post, it sounds like a level-headed conversation. I think you are adding a lot more vitriol to the conversation than what OP said in his post. I am not saying OP should change what he is doing, I am just saying Jane's sister and the ex are not assholes for having this conversation.", "I too think the age thing is important. If the step sisters were the same age and one had way more then I could see an issue but older children often get a bigger allowance anyeay as they are learning to budget school supplies, dates, clothes gas, phone plans lunch coffee etc and younger teens mostly only have money for treats etc.", "Also children at that age already have a concept of wealth and class. It may be limited, but they very much do. Which is why they tease and bully each other about not having trendy clothes or being unable to afford something, brag with rich relatives and stuff like that.", "They might not have formed any opinion on designer stuff, but younger sisters usually look up to the older. At least that's my experience with my friends growing up. As @JolyonFolkett said, older kids usually gets more, and the younger ones know Anna has another father who buys her stuff and she SHARES! Borrowing older sisters clothes was a big thing when we grew up, it was cool to use what the older had. Reducing Anna's allowance means she'll have less to share with the younger. I doubt they'll be happy with aunty Jane.", "Reddit likes to push every scenario to being the most nefarious, dramatic situation possible. Seriously, people think different, and both reasonable and unreasonable people can have poorly thought out ideas. \n\nAs long as everyone involved keeps a conversation calm, respectful & full of good intentions then what's the problem with having the conversation? \n\nTrue its not like they have a right to demand what the father does with HIS money, but if they have legitimate (from how they see it at least) concerns about how money *might* affect the dynamic of the sister's relationship, then it wouldn't be a good idea for OP to get all overly offended and accusatory like these comments are seeming to encourage. \n\nIf he truly does have a good relationship with his ex wife & her spouse, then it shouldn't be a problem to lovingly confront they about any jealousy the parents might be projecting on their kids (assuming that there IS any). \n\nHonestly, it could be as simple as the parents are secretly struggling financially and feel bad that they can't give their younger daughters the same thing as their sister, & worry about what that could do to the family dynamic. That can be solved with how they teach their kids to view money & the values they instill in them BEFORE any issue could come up. Teaching them to be greatful for what they have, that relationships are more valuable than material goods, to work hard for things they want, and gratitude for what they are given by others will keep resentment from taking root \n\nOP, just use your best judgment, refrain from being defensive or accusatory when the topic is brought up & things should be fine.", "It's a conversation that didn't need to be had.  At no point did OP mention that anyone seemed to have any problem with the situation or arrangement they had until AFTER Jane's sister decided to give her unsolicited opinions on what she observed.  It's not like she pulled Hailey aside and said \"Look, this is something that has been bothering Jane and she can't talk to you about it, so I thought I would\". Literally no one had any issues with this very successful blended family dynamic until Jane's sister did.", "I totally agree with this. Plus, there are going to be differences as this is not one family living under the same roof. You are Anna’s father and are legally required to provide for her. The resentment would only come if your daughter flaunts what she has or puts down her sisters for what they don’t have.  It is important to remember that kids need to learn life isn’t fair, people will have different opportunities, experiences, etc. just due to the situation they were born into. How people treat each other despite these differences is what is important.", "Sometimes people have conversations that lead to nothing, but that's okay. Jane's sister had a concern, it might not be warranted, but it can be brought up in a polite manner."]}