{"id": 28500, "submission_id": "172ym0t", "title": "AITA for a 2nd date boundary because of smoking & my reaction?", "selftext": "I (35F) have been on 2 dates with a guy (34M) I matched with on Bumble.\r  \n\r  \nDuring our 1st date we had things in common such as a love for film, as I saw on his profile. However, also on this profile he said he \"never\" smoked, which is pretty important to me. I don't mind the odd cigarette on holiday, but to live forever in a cloud of smoke is a big no.\r  \n\r  \nAnd he smoked heavily: 5 cigs in a 3 hour date. Anyway, we had some chemistry & because I'd had a couple of glasses of wine, I didn't say anything when we kissed a few times but... it tasted \\*horrible\\*. Like an ashtray.\r  \n\r  \nAnyway, he asks me out again & I agree because as I say, there was definitely a connection - and that date was yesterday. When I arrived we started chatting etc & then he got a cigarette out. So I said, you'd better kiss me now before you light up, because I won't want to afterwards! He looked FLOORED by this, as though I'd told him we were both about to grow horns and a tail . He asked if I was serious & I said I was. He then gave a speech on how he doesn't need me to guilt trip him about it and he's going to quit soon anyway and I can't make him stop then & there.\r  \n\r  \nI calmly listened & said he didn't \\*have\\* to stop, but that he was smoking we wouldn't be kissing, as simple as that. It was a choice. Then we had a kiss and he lit up.\r  \n\r  \nThe rest of the evening he smoked several more - repeatedly pulling me in for a kiss and time & again gave him my cheek & a smile. He made a big deal, raising his voice with \"she's trying to say I can't smoke blah blah blahhh\"\r  \n\r  \nAnyway, the night ended realising there was pretty much no clear way home for him from the place we were, I reluctantly said he could crash at mine. Reluctant because he wouldn't stop advances for a kiss numerous times during the night, & I was concerned that if I mentioned another boundary (like the fact I wasn't going to sleep with him) he would try and try again like he had done all night.\r  \n\r  \nI started working up some serious anxiety about it, which he could see on my face when we were about 10 minutes from mine. He asked me what was wrong and I told him and I also said there was a night bus he could get back to his place if he did want to go home, he could now do so more easily, from this location.\r  \n\r  \nInstead of saying \"omg, I'm so sorry I made you feel that way\" - he replied \"it's too late, I’m too tired to go home now (around 4:30am at this point)\" and then joked \"anyway, I'm not going to sleep with you, you'll have to work for these nuts\"\r  \n\r  \nHonestly I felt beyond stressed at that point and didn't want him coming back to my home at all and it was written all over my face. He noticed and said \"Cmon, it was a joke!!\" and said \"Nah I can't do this, you keep picking at me and I'm not a perfect person!\" He then walked away and presumably went home.\r  \n\r  \nI'm 100% relieved he didn't come home with me, but AITA for setting the smoking kissing boundary and how his repeated attempts made me feel?\r  \n", "created_utc": 1696770101, "permalink": "/r/AmItheAsshole/comments/172ym0t/aita_for_a_2nd_date_boundary_because_of_smoking/", "score": 139, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. The action was that I set a boundary based on my judgement and feeling about my date smoking and then kissing me\n\n2. That I may be the asshole because I implied that he wouldn't respect a further boundary in my house and essentially making him have to go (a very long way) home alone?\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA, but I'm a little confused as to why you first continued the date and then agreed to a second date when you realized he was a regular smoker. Don't be afraid to set your boundaries and hold firm to them - if smoking is a dealbreaker, then when someone lights up, walk. No amount of 'chemistry' is worth the crap this guy was pulling, particularly when he made it clear that he wasn't going to respect your wishes about not kissing him after smoking. Much better to be single and enjoying life than coupled up and miserable, after all.", "Don't go out with him again. \n\nNta", "NTA. I’m waiting to hear about the chemistry you claim was there and why you even entertained the idea of dating a dude who actively LIES on his dating profile. Besides his gross behavior and making you feel uncomfortable, what does he have going for him? \n\nLook, it’s more than ok to have deal-breakers and for me, smoking cigs is a deal-breaker. His whole attitude about it is shit, but the fact he lied would have been enough to send me running the other direction. Not you though, and I can’t figure out why. He’s a liar and he knows he has to lie in order to even get a date. Then he knows he’s making you feel uncomfortable, the unwanted kissing attempts, it all sounds so creepy and uncomfortable. Please don’t go out with him again.", "NTA. Smokers shouldn't date non-smokers. Full stop, no exceptions. I learned the hard way too. Besides, this guy is an obvious AH, even without the smoking. Why would you ever want to see him again?", "NTA - I'm a smoker, and his behaviour was I don;t know how to describe it. Suffice to say, he made you uncomfortable, and things probably would not have progressed well had you let him stay at your place.  Also when people say \"it's a joke\", they're usually trying to turn it around on you so you feel guilty. You're better off unmatching from this guy and not having anything to do with him again.\n\nGood luck in the dating game in the future.", "Very weird how you just brushed past the blatant lie on his profile. You do you I guess?", "For transparency I should probably add that this came along with me mentioning a couple of other things that I wasn't a fan of during the evening: not asking me any questions about myself (it was a 2nd date! ! ) - his response being that \"he learns about someone by watching and observing them, not asking them questions; plus I also mentioned that he kept getting up, and walking ahead without me whenever he was ready to leave a particular section of the venue. I'd just have to get up and run after him. I started to feel ridiculous trotting after him again and again, so I mentioned it, and he dismissed it off-hand. I feel like I should share this, as he felt like I was nagging and prodding at him all night, which although I don't feel I was doing, might be the case which I understand and feel bad about if so.", "NTA but honestly shouldn't have gone on date #2 knowing the smoking was a deal breaker. I'm a smoker, I get why non-smokers draw a like there, I wouldn't want to go on a 2nd date with someone that considered my habit a hard stop. I'd consider making this a one date situation for you instead of multiple dates", "NTA. He's a boundary pusher.", "NTA\n\nIs this even real?\n\nWhy would you go on dates with a guy who: lied to you about smoking, got angry when you questioned hi smoking, raised his voice in public? OMG so many red flags.\n\nThen you invite an angry liar into your house? It's probably not going to end well if you keep doing things like this.\n\nYou need to pick better guys.", "NTA. He misled you on his dating profile, then kept doing something that bothers you and pouted about it. Bullet dodged.", "Setting boundaries doesn’t make you an A/H. But all of his behavior(s) certainly leans in that direction. The question isn’t whether or not your an A/H for setting an obvious boundary. What you should be asking yourself is why you would be attracted to someone who was so obnoxious that you would even go on a second date with them. Was the chemistry really that good? Or, are you fooling yourself into thinking that it was for the sake of justifying a second date? \n\nNTA but you should definitely reconsider if you have issues with self esteem or raise your standards in what your looking for in a relationship.", "If smoking is a dealbreaker, you can ask, but once he says no, continues chain smoking, and starts teasing you about it, you have to realize it’s part of who he is, at least for now.\n\nYes, he lied, but you can’t start a relationship by seeing who someone is, then arguing about it all night.\n\nNTA for setting boundaries, but you will be an AH to yourself if you don’t just acknowledge this is who he is and keep staying and trying to date a guy who isn’t right for you.\n\nand let the red flags go party with each other somewhere out of your life.", "NTA. I would've cut the first date short as soon as he lit up his first cigarette. He lied on his profile - and you stayed. So he knows he can keep trying to cross your boundaries.", "NTA.  The relationship between the two of you started with a lie.  And it's apparent you aren't happy with the fact he is a smoker.", "“You can make out with me or smoke”\n\n*Chooses to smoke*\n\nLOL what an idiot.\n\nNTA. Look, you set your boundary, it was reasonable, he acted like a moron, you did nothing wrong. Let someone else “work for those nuts”", "If smoking is a no-go for you that’s completely reasonable. But you can’t date one then haha", "Former smoker here.\n\nYou are NTA.\n\nThis dude was super toxic.\n\nMaybe don't see him again.", "NAH. Not smoking is important to you. He is a smoker. It's easy to see that the relationship won't work out.", "Honestly, I’m going to say YTA just because you took the time to write all this out. Otherwise ESH. You two aren’t compatible for many reasons and based on the things in the post, I really don’t think you’re mature enough for a relationship anyway.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (35F) have been on 2 dates with a guy (34M) I matched with on Bumble.\r  \n\r  \nDuring our 1st date we had things in common such as a love for film, as I saw on his profile. However, also on this profile he said he \"never\" smoked, which is pretty important to me. I don't mind the odd cigarette on holiday, but to live forever in a cloud of smoke is a big no.\r  \n\r  \nAnd he smoked heavily: 5 cigs in a 3 hour date. Anyway, we had some chemistry & because I'd had a couple of glasses of wine, I didn't say anything when we kissed a few times but... it tasted \\*horrible\\*. Like an ashtray.\r  \n\r  \nAnyway, he asks me out again & I agree because as I say, there was definitely a connection - and that date was yesterday. When I arrived we started chatting etc & then he got a cigarette out. So I said, you'd better kiss me now before you light up, because I won't want to afterwards! He looked FLOORED by this, as though I'd told him we were both about to grow horns and a tail . He asked if I was serious & I said I was. He then gave a speech on how he doesn't need me to guilt trip him about it and he's going to quit soon anyway and I can't make him stop then & there.\r  \n\r  \nI calmly listened & said he didn't \\*have\\* to stop, but that he was smoking we wouldn't be kissing, as simple as that. It was a choice. Then we had a kiss and he lit up.\r  \n\r  \nThe rest of the evening he smoked several more - repeatedly pulling me in for a kiss and time & again gave him my cheek & a smile. He made a big deal, raising his voice with \"she's trying to say I can't smoke blah blah blahhh\"\r  \n\r  \nAnyway, the night ended realising there was pretty much no clear way home for him from the place we were, I reluctantly said he could crash at mine. Reluctant because he wouldn't stop advances for a kiss numerous times during the night, & I was concerned that if I mentioned another boundary (like the fact I wasn't going to sleep with him) he would try and try again like he had done all night.\r  \n\r  \nI started working up some serious anxiety about it, which he could see on my face when we were about 10 minutes from mine. He asked me what was wrong and I told him and I also said there was a night bus he could get back to his place if he did want to go home, he could now do so more easily, from this location.\r  \n\r  \nInstead of saying \"omg, I'm so sorry I made you feel that way\" - he replied \"it's too late, I’m too tired to go home now (around 4:30am at this point)\" and then joked \"anyway, I'm not going to sleep with you, you'll have to work for these nuts\"\r  \n\r  \nHonestly I felt beyond stressed at that point and didn't want him coming back to my home at all and it was written all over my face. He noticed and said \"Cmon, it was a joke!!\" and said \"Nah I can't do this, you keep picking at me and I'm not a perfect person!\" He then walked away and presumably went home.\r  \n\r  \nI'm 100% relieved he didn't come home with me, but AITA for setting the smoking kissing boundary and how his repeated attempts made me feel?\r  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. You can’t make him quit but he can’t make you kiss him. You each have a boundary.  The pulling you in and trying to guilt you are red flags.  Let him go. Even if he does quit, the possessive actions would give me pause to start anything.", "Nta…. But the real issue is you need to get comfortable keeping boundaries. Otherwise, you’re at risk of accepting behavior that will harm you and others in the long run. You’re worth it.", "NTA.\n\nBULLET DODGED.", "Nta\n\nI have done the same several times. With not dating smokers and not kissing a partner who only occasionally smoked when going drinking. It is totally gross.\n\nAlso, find your voice. Speak up when you are uncomfortable. Don't rely on the guy to realize you are uncomfortable. Because it's the guy who doesn't know better or doesn't care that will put you in that position. Be your own advocate.", "NTA lying on your profile about something as fundamental as smoking is an immediate deal breaker. Smoking affects every part of your life: your house, clothes, car, hair, and breath smell. You have to always be going outside, leaving ashes and butts around. I'm surprised you saw him a second time.", "NTA this is a real problem for you.  Don't go out with him again. Skip smokers all together. Never date another one!", "NTA! His behavior was way out of line. Disagreements on stuff like smoking and kissing after are pretty normal but he made it weird and didn’t care how uncomfortable you were. Glad it’s over though! Be safe out there.", "NtA I dated someone who smoked heavily and I hated kissing them. I've always promised myself to never date a smoker again. I ate the smell, taste, and anything else to do with smokers.", "In what universe do you think you’d be an asshole here?", "EW NTA, that man is a walking red flag", "NTA. Smoking is a hard line for me too. I watched my grandfather die from the effects of lung cancer. Listening to the gurgle of someone drowning on their own sputum sticks in the brain, even 30 years later. \n\nAlso cigerette smoke gives me the absolute worst migraines. I told my husband that smoking is a real breaker for me, as is being drunk all the time. Thankfully he had quit smoking 3 years prior to me, and once we got serious he stopped drinking his nightly beers.  I didn't care if he had a beer to unwind, it was the getting drunk that scares me, but he decided he just wasn't going to drink at all,  and I appreciate him for that. We have been married 10 years, and besides trying a bit of moonshine when in east Tennessee, and the occasional glass of wine(usually at New years), there has been no alcohol. \n\nThere is someone for everyone out there, but you have to pass on the ones that aren't for you to get to them.", "NTA. The smoking is a far smaller issue than the lying. He said he didn't smoke but he smokes a lot. If he is willing to lie about smoking, he is probably lying about a lot more. Lying about things is problematic and a huge red flag.", "NTA, but I do think you could have been more upfront before the second date (or more correctly - not gone on a second date). I don’t say this to be mean, but to save you time and headache. Similarly don’t playfully give your cheek - stand firm in the boundary you set. You’re not wrong for it and deserve someone who fits your needs and lifestyle. I say this as a smoker. \n\nAlso the moment he was a dick about it - game over in my mind.", "...is his name Jimmy? Because this sounds like my ex completely. I'm so sorry. Nta. Dude, don't continue dating this man. He doesn't respect you and its clear", "NTA.  \"Going to quit soon\" is code for \"Never\".  The smoking wasn't the only \"ick\" this guy gave off.  Luckily, he didn't go to your home!", "\n\nNTA- \n\nSo he stomps your boundaries, pushes and coerces, makes you uncomfortable and lied on his profile… you’re two dates in, time to make sure there isn’t a third.\n\nSeparately (and not your fault he behaved the way he behaved) you should examine why you don’t feel comfortable asserting yourself better, to help you in the future. He’s not the only sleazy pushy prick out there…", "No. But no date 3. Somethings off. And its not his smoking.", "YTA, only because you don’t respect your own boundaries and are putting yourself in this situation. \n\nCut the drama and cut that dude out.", "i’m confused why she offered to let him go to her place… how was there no way home", "It’s the drama and game she likes. Her boundaries are secondary.", "Smokers are fine in my opinion but I lying should be the real deal breaker.", "NTA, you dodged a bullet. Hesounds like a dick. But honestly, they lying on the profile about smoking would have done it for me. Were you really prepared to move to another date with ylthe 'no kissing after smoking ' rule? That sounds like straight up incompatibility. \n\nAlso, what chemistry did you have on the first date with someone who asked you no questions about yourself?", "Just for future reference, those sound like manipulation tactics you'd find online for pulling women.\n\n-make her follow you to different places, either inside the venue or to different venues.\n\n-don't ask about her, take about yourself or ideas and events. Tell her you'll observe her behavior to learn about her, so she behaves s certain way...", "Don't ever, ever continue seeing a guy who disses you like that. That's not what good people do. It doesn't matter what you did or didn't do.", "Sorry, but why did you stay with him until 4:30 a.m.? Definitely NTA, but you should walk away sooner!", "Lol \"observation for information\"??\n\nIf a guy said he'd learn through watching me I'd just shut up and eat. Not engage and let him walk off. Or better get up and leave. Hope he learned enough\n\nNTA you never have to host someone at your place. There's never an excuse. He was trying to get you in bed with backwards manipulation.", "NTA\n\nI’m just confused on why you went on a second date when you realized he was a smoker and it being a hard boundary. And why the hell did you invite him back to your place when he made several attempts on kissing you when you told him you didn’t want to kiss him?!\nNext time have a bit more faith in yourself, you don’t have to put up with crap for only a few qualities…", "YTA for going on a second date. If smoking is such a hard no for you, why did you go out with him again? Dumb move on your part. Lol very few people are gonna want to date and not kiss, and no one you just met is going to quit for you. You set up your own failure with this one.", "Honestly YTA to yourself. So many red flags, why did you agree to him staying at your house when you were concerned he’d force himself on you? Why did you even agree to a second date when he lied about something so important?", "You went on a date with an Arsehole whose behavior will only get worse the more you date him.  Also kissing someone who smokes is absolutely disgusting. Those of you who put up with it, I salute you!", "You're continuing to go out with a liar because???? ???\n\nSorry \"chemistry\" ain't a good excuse. You either agree to date a smoker and liar or you don't.", "You dodged a bullet. NTA but he sounds potentially dangerous", "So you know he smokes and the first date you say nothing. Then you ask if he wants to come sleep at your place and you change your mind again?  Are there any reasons you don't tell him the truth immediately but first act as if everything's great and then make a U turn?", "> However, also on this profile he said he \"never\" smoked\n\n> and he's going to quit soon anyway and I can't make him stop then & there\n\n> He made a big deal, raising his voice with \"she's trying to say I can't smoke blah blah blahhh\"\n\nLook... at *best* he's trying to get credit in advance for something he hasn't actually done (i.e. quitting) and may never do, and at worst he lied because he knows it's a dealbreaker but he figured if he could get a foot in the door he could pressure you into pretending to be okay with it.  From his reaction to your objections, I'm guessing the latter.\n\nNTA I guess, but you knew he was a liar from the moment he took out the first cigarette on the first date.  There are other dudes out there you can make a connection with who *actually* don't smoke.", "NTA\n\nSetting the boundary should have happened sooner mind you. Like \"I thought you said you didn't smoke\" **after the first glass of wine.**\n\nThen I would have left.\n\nYou had a lucky escape though.", "NTA. I do hope you are not going to date this AH again. He is a gaping, gigantic AH. Did not care about your comfort, safety, or likes or dislikes, and tried to force himself and his viewpoints on you. I could see him doing worse if he had stayed at your place. Good riddance! Do not feel badly- he didn’t care about you, why should you care about him! Glad you found out early!", "I’m", "You dodged a huge bullet, he sounds like a guy who would continuously push your boundaries.\n\nBut you also need to stand firmer in your boundaries yourself.\n\nDon't EVER feel obligated to let someone stay over if you don't want them to. But that's your responsibility to enforce your own boundaries.\n\nThe dating world is tough..... you need to advocate for yourself.", "Not the asshole. It's pretty simple really. I dislike kissing women who've been smoking just the same. The only time it's different is if it's one of the few in a blue moon times I'll smoke a cigar or break out the pipe tobacco. \n\nEven then, cigarettes have a different smell and taste to them. Not sure I'd be interested much in a cigarette smoker. \n\nAnyway, you set a boundary based on preference, he disrespected said boundary and tried to push the line. He sounds like an asshole. If someone tries to consecutively push one boundary, they typically try and push others as well. \n\nGood on you.", "NTA, but imo you made a mistake trying to go on a second date with this guy - like if you feel you legitimately have to put up a boundary that you’re not gonna kiss a smoker any time after he smokes, what did you honestly think was gonna happen here? If you’ve ever been around smokers, you would know they get irritable if they can’t smoke (and even sometimes if they still can lol)\n\nIt can be tough, because turning down people you otherwise like sucks, but all you really did here imo was unnecessarily create more emotional pain for the both of you. But I *am* glad you were assertive with your boundary (which is why you’re NTA imo, in addition to him being kind of an ass), because lord knows there are plenty of women who have a really hard time with that", "NTA. He sounds disgusting", "NTA\n\nGross to smoke that much on a first date after saying on your profile that you're a non-smoker. Gross to keep trying to kiss you after you made that boundary clear. Gross to react so defensively. And I think it's almost certain that he would have tried to find his way into your bed if you'd taken him home.\n\nYou behaved fine by this account.", "I am the smoker and have a perspective that might help. \nI met my guy on a dating app and I think it had that I smoked on there. I didn't smoke at all during our first date, and forgot to mention it to him. After the second date I started a text convo about it (cause I still didn't smoke on the date), just to be upfront so he could factor it in. He's not a smoker, and doesn't love it about me, but I do my part to make him comfortable and he gives me the understanding that I'd like to quit, I'm just going through a lot and it won't happen right now. \n\nI met him 5 years ago and we're getting married this week. \n\nNTA, you simply set your boundaries around it and instead of respecting that he handled it like a dick. This was way more about that than the smoking.", "Quite simple, really he smokes you do best thing to do is find someone who doesn't smoke.\nIn my opinion, from what you wrote, you both are nta but again  both of yau are yta.", "NTA.  Throw that one back.  He sounds like bad news.", "YANTA. We put our best selves out there in the early possibility of a relationship. If this is him putting his best self out there, imagine what the future holds!", "Why were you gonna sleep with him after all that?? Have some self respect, Jesus", "NTA. Don’t have any more dates with this guy. He has zero respect for you and your boundaries.", "NTA. He sounds like a jerk. You're better off without him.", "He is a liar and gaslighter. Get rid.", "As I always say, you don't need to have a \"good\" reason for dumping someone, or for just failing to pursue a relationship.  If he's unappealing he's unappealing, and you don't owe him the effort of trying to convince yourself that you find him appealing.\n\nYou aren't pursuing relationships because you have any obligation to make him happy, you're doing this to make \\*yourself\\* happy.  And he's doing the same.", "Yeah like this guy kept grabbing her for a kiss after she made it crystal clear she doesn't want that. This guy isn't even worth being with. He's a red flag 🚩", "desperation.", "Should have ended date 1 when he pulled out the cigarette.", "Exactly this. You say living in a cloud of smoke is a big no yet he lied on his profile and smoked throughout the first date and you still went for a second which seems confusing/contradictory. Did you tell him during/between dates that you don’t/won’t date a heavy smoker and/or ask why he put he didn’t smoke? He was definitely wrong for lying/his behavior but being clearer from the get go about your boundaries is just as important.", "You really need to look at why you're not listening to your intuition and putting up with obvious red flags. This guy made it clear he's an asshole from the start, yet you kept giving him chances.\n\nYou seem to have a personality that would be easy for someone who is a dick to manipulate and take advantage of so you really need to be careful of who you choose to date and you need to work on building your confidence and self worth since it seems you are second guessing yourself a lot and let a total dick make you feel bad about something he is doing wrong. I don't think you should be with anyone until you work on that because the chances of you ending up with an abuser are quite high.", "What on earth were you thinking inviting this asshole back to your place. Do you have no sense of self preservation?", "I'm a non smoker. I've dated a couple of smokers. That wasn't the issue that broke us up at all.", "I don't smoke and am married to a smoker. The horror.", "Big city, minimal public transport at 4:00AM?", "\"better kiss me first\"\n\nSuch a deal breaker for OP lmao", "Yeah, kissing a smoker is like licking a wet ashtry. Hard pass. NTA but he is for lying on the profile.\n\nI once sat in a pub for 30 minutes waiting for the 6'2 35 yo tri-athlete with a full head of dark brown hair. He was there all along....5'9, hadn't been on a bike or a run in years and was almost bald. And at least a decade past 35. He recognised me as I got up to leave. I (very politely, promise) explained to him that yeah, people WILL notice the missing inches and hair and the extra years.", "What? How is this supposed to make women want you?", "Like immediately after he lit up his first cig on the first date.", "Vancouver Canada shout out lol", "Arranging a 2nd date with someone you really don't want to sleep with in which it's close to yours and he'll have no real way home is just, ridiculous. If you have a 2nd date and don't make arrangements to be able to get home you're also ridiculous and magically when he wanted to go home when he realised sex was definitely not going to happen he decided to just go home. \n\nIn other words OP ignored it and the guy intentionally created a situation where OP would feel it was the 'nice' thing to just let him crash at her place, where he'll then pressure the hell out of her for sex and may or may not take no for an answer.\n\nOP doesn't deserve anything bad to happen but she needs to wake up and be less naive. Maybe op is colour blind, sees a giant red flag and thinks it's green. When he lights his first cig OP should see a liar, someone she doesn't want to date and not kiss him or arrange a second date, let alone a second date that will leave him 'unable' to get home and inviting him back to hers. It's just, have some common sense ffs.", "Taxis, Ubers exist", "She probably just signed up for a third date.", "bruh he could smoke the cig, blow the smoke at her and spit in her face and she'd probably marry him"]}