{"id": 28595, "submission_id": "173yew0", "title": "AITA for moaning while getting a professional massage?", "selftext": "Hey Reddit, need to know if I'm in the wrong on this one. I had a massage booked for this morning and I was excited to go because I've been needing to relax and unwind after a stressful few months.\n\nSo the massage was amazing... which ended up being a problem. There was one point where it felt so good that I accidentally moaned. The masseuse didn't seem to mind so I let a few more out to just fully relax.\n\nShe asked me to stop and I felt embarrassed and said sorry and stopped. However, she ended the massage early and said that she feels uncomfortable and that I should leave and book an appointment with one of the other masseuses.\n\nI still had to pay full price for the session and got into an argument with the receptionist about it. I told my friend about the situation while I was driving back and she said I was TA for moaning and \"being weird\" during a massage session.\n\nAITA?", "created_utc": 1696874445, "permalink": "/r/AmItheAsshole/comments/173yew0/aita_for_moaning_while_getting_a_professional/", "score": 70, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) Moaning on purpose while getting a massage, 2) it made the masseuse uncomfortable\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA. I could understand an accidental one, but moaning more on purpose is creepy and weird.", "I think the moral of the story is not to interpret people’s silence as consent. I also think it’s reasonable to assume that it’s inappropriate to moan during a massage. I don’t think you can be held fully responsible for her reaction though, another masseuse may have taken it in good humour. Mild YTA", "Massage therapist here. There are all kinds of sounds that happen on a massage table, and moaning is one of them. However, depending on the type of moan, and if it's followed with a \"that's a sore spot\", or something to qualify why the moan happened, moaning can be considered really creepy. Because MTs get hit on all the time, due to the misconceptions that some people have of therapeutic massage, we can get really antsy when it comes to certain comments, sounds etc that happen in the clinic room.\n\nWithout knowing any other context, I'd say N T A, but it is also completely within the MTs rights to end a massage at any point that they feel uncomfortable and/or threatened by the client. There are too many instances of MTs who have been sexually assaulted for us to not be hypervigilant about things.\n\nEdit to add - somehow, in my sleep addled brain, I missed the \"let a few more out to just fully relax\" part of that. Oh, you were definitely creepy in that instance\n\nYTA", ">I accidentally moaned.\n\nSh!t happens. You good bruh.\n\n>The masseuse didn’t seem to mind, so I (purposefully) let out a few more.\n\nPlease tell me you’re joking :O\n\nNone of us were in the room, so have to imagine exactly what actually happened, but if it was enough for her to stop early and ask you not to book with her again, YTA.", "I get massages all the time and moaning is completely unnecessary and inappropriate. You made the massage therapist uncomfortable and embarrassed- everyone knows the stereotype some massage parlours have- with “happy endings”. The poor masseur was probably mortified. \n\nIf you want to moan during a massage, get your partner to do it in the privacy of your own home. \n\nYtA", "YTA, accidently is one thing, purposefully is very creepy.", "YTA.  And stop moaning during massages.  It‘s inappropriate.", "YTA. An involuntary moan is different than letting out a few “to relax,” whatever that means. Since we don’t have an audio recording of the incident I’m erroring on the side of the professional, who hears all kinds of people make utterances on her table, being correct that you were making sexual noises. As someone else pointed out, silence is not consent. Don’t make sex noises in public and especially don’t do it in a contained space in front of a woman who’s just trying to do her job.\n\nI’d suggest that in the future you book male masseuses and inform them ahead of time that you have a tendency to moan during massages. Then they can make the decision ahead of time as to whether or not they want to work on you.", "YTA, take  the L, stop making the therapists uncomfortable.   They catch shit all of the time from creepers.", "This gave me the ick.\n\nYTA.", "YTA. It happened once by accident and a few more times on purpose. Creeper gotta creep", "YTA \n\nI don’t know man, this woman gives massages FOR A LIVING, so she’s gotta be used to the occasional moan of pain and/or pleasure from people on the daily right? I can’t help but wonder what was so different about YOUR massage, and YOUR sounds that, she was so uncomfortable that she had to put an end it early AND miss out on a tip. \n\nLook dude, moaning ONCE because a sore spot took you by surprise is one thing. But PURPOSELY moaning through the whole thing is just unnecessary and inappropriate. I probably wouldn’t of made you pay full price for the message, but I wouldn’t of forced her to finished it and I don’t blame her for ending it early if you were making her uncomfortable either.", "AAAAAH. I wanna say NTA because the first bit was involuntary. But as a former massage therapist that had this happen? It's creepy on our end and doesn't happen nearly as much as people think in professional settings. Sleeping? Yup. Snoring? Yup. Moaning outright? Not so much. I expect that just as you would like to be comfortable during a massage, your therapist also need to be comfortable working on you. Your moaning clearly made her uncomfortable, and as much as it might be an involuntary response in some ways, it just adds to the stereotype of massages being sexual. I feel like moaning on purpose is where this becomes YTA. Do you moan if someone comes up behind you to rub your shoulders a bit? It's just...a lot.", "YTA I think you can be forgiven for the first involuntary one but to continue simple because your masseuse didn't immediately protest is where you cross the line. I feel like you knew it was taboo because continued \"because she didn't seem to mind\". You obviously knew this was something someone could be uncomfortable with .", "YTA. One accidental moan, okay. Continuing to moan is just creepy and uncomfortable.", "YTA\n\nGross", "YTA you were continuously moaning….& you didn’t stop to think that it was inappropriate or that it would make the woman uncomfortable….. you had to pay full price but how far along in the massage was it? If it was almost over then I think you should obviously still have to pay, but if it was at the very beginning I don’t think you should have to pay, but your actions were still wrong just learn from this man 😂", "YTA I was in a room beside someone who was moaning and both myself and my massage therapist were uncomfortable. For a split second I thought, wait this isn’t that kind of place is it? Knowing I had been going there for years and it wasn’t. So you look gross and can make them look bad too", "YTA for the second and third etc ones. Accidental, sure, but you continued, kinda on purpose. I've gotten a lot of massages. I don't know how the moans help you \"fully relax\".", "YTA. Do you usually moan when you feel relaxed? No, you don't. You were being a creep.", "accidental moan is fine, but to follow up with a couple more is definitely YTA and creepy.", "YTA. Making a noise when a therapist hits a tender or sore spot is one thing. \"moaning\" is entirely different, especially when you made the assumption that \"The masseuse didn't seem to mind\". They were probably taken aback, and didn't say anything until you kept doing it, and they had to tell you to stop. \n\nIf you were NTA, you would have apologized immediately to the therapist, paid for the session  and moved on. Instead, you assumed that no objection meant consent, then got an attitude with the receptionist about it.   \n\n\nIf you haven't been blacklisted/banned from the place, I'd be surprised.", "Monica is that you??", "YTA.", "YTA. Speak only when spoken to or when saying hello or goodbye/thanks. Massage therapists deal with creeps all the time, but after Deshaun Watson, everyone should be highly aware of this and not add to their discomfort.", "YTA. The first one was an accident but then you kept doing it to \"just fully relax.\" That sounds like you went a bit overboard and creeped her out.", "Did you have to ask? YTA. Once, accidentally, okay. But then continuing to do so, on purpose, is creepy. You intentionally sexualized the experience. She’s a masseuse not a hooker.", "I (F) get massages regularly, from both male and female massage therapists and I have not ever once moaned repeatedly or on purpose to feel relaxed. I have made noises or have had deeper breathing during moments of discomfort or release - and I usually tell the therapist everything is fine or if I need something changed (pressure) after making a weird or unexpected noise - I imagine the moaning you were making sounded sexual in order for the therapist to tell you they felt uncomfortable.  Yes, massage therapists should be used to involuntary noises but in my opinion continuing to make moaning noises is kind of weird, and now you know. \n\nIf you've never had a massage before and don't know the etiquette  then like, fine - but I think  YTA for arguing with the receptionist - You are not entitled to your money back - it isn't as if the therapist could get her time back from you, or could fill the remainder of your time with another client. \n\nChalk it up to a lesson learned.", "YTA- that is a very uncomfortable situation for the masseuse. She probably thought you were expecting a “ happy ending “", "YTA. Have you read your post?", "YTA. That would’ve made me really uncomfortable too. Accidentally I get, it happens. But you literally started purposefully moaning after that, during your session. That’s weird and inappropriate.", "YTA\n\nIt is weird. Maybe practice better breathing than letting out moans.", "If I understand correctly a moan escaped and you moaned several more times afterwards more intentionally (?) but this made the masseuse feel uncomfortable so she stopped.  Is that right?  Anytime a masseuse stops a massage bc of something you did, YTA.  FYI charging you the full amount is completely understandable.", "YTA.  Yikes, and the fact that you don't understand why this is icky is kind of scary.", "Making your own lien noises? Always YTA.", "YTA and quite frankly weird.", "YTA- “let a few more out” are you for real? Just out here, naked under a sheet, rippin out moans like they’re uncontrollable farts. Gross my guy.\n\nAlso it’s “massage therapist” not “masseuse.” \n\nAlso did you actually expect a discount because your MT had to refuse service because of your behavior? I would pay just to hear that convo. “Ok so your bill would have been $110 but since Cheryl got disturbed by your caveman tendencies that’ll be $95!”", "YTA wtf", "YTA - It doesn't matter what we think, all that matters is that the woman felt uncomfortable. That's your answer.", "YTA.\n\nOnce being accidental is understandable. But doing it more is just weird.\n\nWhat solidifies you as an AH is arguing you shouldn't pay full price. You paid for use of that timeslot: you got use of the timeslot, so you have to pay for it. And its not like they can sell the rest of the timeslot to someone else, either. And heres a reminder: YOU CAUSED IT TO END EARLY. It's not their fault they had to end it early; its due to your own actions. Major levels of entitlement there.", "YTA. 😬😬😬. So very inappropriate. This is not a sexual encounter, do not vocalize pleasure in that way.", "YTA. C'mon.", "Yes.  That’s very inappropriate.  You should have immediately apologized after the first one and then shut your damn mouth.", "I’m thinking there is a part of the story we’re not hearing.", "How can anyone moan themselves to relaxation with a complete stranger massaging them in a professional setting and not think “hey this might be a little creepy” after the first one", "Lol yeah right the first one was accidental. I'd put money on the real story being that you were attempting to...test the waters...and took her silence as consent. YTA, creep.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHey Reddit, need to know if I'm in the wrong on this one. I had a massage booked for this morning and I was excited to go because I've been needing to relax and unwind after a stressful few months.\n\nSo the massage was amazing... which ended up being a problem. There was one point where it felt so good that I accidentally moaned. The masseuse didn't seem to mind so I let a few more out to just fully relax.\n\nShe asked me to stop and I felt embarrassed and said sorry and stopped. However, she ended the massage early and said that she feels uncomfortable and that I should leave and book an appointment with one of the other masseuses.\n\nI still had to pay full price for the session and got into an argument with the receptionist about it. I told my friend about the situation while I was driving back and she said I was TA for moaning and \"being weird\" during a massage session.\n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "YTA. Better start looking for a new massage place. I'm sure she'll warn all the others about the creep that you are.", "YTA\n\nDon't do that shit. That shit makes masseurs super uncomfortable and makes you look like a creep and perv.", "Genuinely I don't understand how moaning makes one more relaxed? Is that real?? Someone explain.", "YTA. Aside from safety concerns, there's the fact that licensed massage therapists can lose their license for doing anything of a sexual nature with a client. Maybe you two know it wasn't anything like that, but if someone in the hallway heard you, would they have gotten the wrong idea?", "YTA. This is just creepy, she was there to do a job. You also booked the slot and got kicked out, it wasn’t an extenuating cancellation.", "YTA \n\nPut yourself in her shoes. Wouldn’t you feel uncomfortable if this guy you were massaging was just moaning loudly purposefully? It makes sense as to why she felt really uncomfortable", "YTA without a doubt. You would have been NTA if it was just the accidental moan but continuing to do it is extremely creepy and I applaud her for cutting the appointment short. Her not saying anything was not an invitation to keep doing it and you know it.", "Former massage therapist here. I did a lot of deep pressure massages so my clients would moan or groan but I knew WHY they were doing it (I could feel the knots in their muscles in the areas they needed work in). I was never uncomfortable with that because it’s natural and would only happen when I worked those specific areas and I could physically feel the affected areas. Now if the therapist working on you couldn’t feel any obvious knots or areas of tension, then yeah that’s a bit odd. I personally would have probably done the same if I were in her position. If there’s no clear tension or even communication that there is tension in specific areas then YTA", "YTA.  The first accidental one was fine.  It happens. You should have stifled the rest.  Find a new RMT and do better next time.", "YTA. One slipping out is understandable, but then you added more on purpose. Ew.", "You moaned but she finished early! Something is not right 🤔", "YTA I am the office manager for a professional massage office. We have 2 males and 2 females. While moaning is a normal thing, when a client gets excessive at any time the therapist can say they are uncomfortable and the client will be expected to pay full price. It’s hard to be a professional massage therapist when people are always assuming other things. And honestly sounds like you continued to do it on purpose and that’s one way to get yourself banned (and trust me massage professionals talk!).", "Haha, I read the topic of this to my wife and said \"Well that depends. Let one out by accident? Or are we talking several minutes of moans?\"\n\nAfter reading, yup, 100% yta. \"Let a few out to relax.\" Glad that relaxed you, but you have to understand that was wildly inappropriate and would certainly do the opposite of relax your RMT. \n\nAs for the full charge for partial service, I really think that comes down to the time allotment. If you were 15 minutes into an hour, then you are right to be upset. Even though the situation is your fault, I think some compromise should be made. If you were past the 30-minute mark of an hour, take your L and learn from it. \n\nSide question. If it was a male massage therapist, would you have \"let a few more out\" after the first one slipped? If the answer is yes, then we can at least assume that while you were TA, you came by it honestly. If the answer is no, then you already knew you shouldn't be doing it.", "First of all, it’s a Massage Therapist, not a masseuse. She should lose money because you made her feel uncomfortable? Imagine someone came up to you in your line of work and started moaning at you while you were working and then argued about having to pay for your services. Yes, you are TA. A huge giant asshole. I hope you have enough self awareness to never return.", "YTA...tacky, cringy, gross.", "YTA. Double YTA if you are a dude.", "YTA for complaining about the duration,  the woman isn't running a rub and tug ffs", "Isn’t this a Monica/Phoebe situation? 😅", "INFO. What kind of moan was it? If it was remotely suggestive or sexual, YTA, otherwise you got scammed.", "Did you follow-up the moan by saying “me so horny”?", "[deleted]", "This seems more like a TIFU than an AITA, and I actually am very conflicted because on one side of the lady felt uncomfortable she is entitled to it. But when she told you to stop and you did, she should’ve been professional about least refunding half. I’m going to go with a very light ESH. You more so being unfortunate rather than an AH.", "nta - they should have refunded or rebooked you. A masseuse who can't deal with a bit of moaning is not ideal. Moaning is a compliment that it is a good massage. If you can't fully relax during a massage, what the f is the point of having one.", "INFO: What is your gender? It may have felt suggestive and uncomfortable for a female masseuse to have a half nude man moaning while she’s touching him. I’d be uncomfortable with that too. Especially personally knowing people that have gotten a massage and paid extra for a “happy ending”. \n\nRegardless, I don’t agree with some of these commentators saying Y T A, you’re NTA for verbalizing tension being released. If anything, it’s an indicator for the masseuse that she’s doing something right and using the right amount of pressure. Unpopular opinion, I guess. 🤷🏻‍♀️", "I'm tempted to say YTA, but I'll say NAH. You have the right to let out a little moan of relief from a massage, but the masseuse being creeped out by it is also 100% legit.", "NTA.  Unless it was exaggerated or otherwise clearly faked, moaning is a reasonable and natural response to a massage.  The masseuse is the AH for not acting as a professional.", "NTA.\n\nShe asked you to stop, you did. \n\nIf you are honest and you really moaned just out of non-sexual pleasure, and you stopped once you saw it made her uncomfortable, then NTA.", "NTA moaning in a non-sexual way when getting a professional massage doesn't seem like a problem to me. if I were a messause myself I would kinda consider it a compliment, not only do you enjoy the massage so much that you feel like moaning but also that  you feel safe enough to act like yourself. And besides, if that made them that uncomfortable, they could've warned you.", "Are all the people commenting here teenagers? NTA, even with a quick Google you can see that massage etiquette does not ban moaning. I think the massage therapist was very unprofessional and should choose a different career if it makes her uncomfortable. Some people moan after a good bite of food, it's not just a sexual thing. Leave them a review letting the clients know noises aren't allowed, lol. You're supposed to be relaxed and enjoying yourself during a massage. It's supposed to feel good! As long as it isn't orgasmic moaning it's expected and what you pay for, relaxation.", "ESH\n\n&#x200B;\n\nWhy would you pay full for a service that was stopped from THEIR side. She can feel comfortable on her  own dime.", "change your moans to \"thats the spot\" , or \" its a little tight in there\" lol", "If you used a credit card you could request a charge back. You didn’t get the full time and it’s reasonable to not pay the full amount imo.", "NTA. Masseuse sounds like she's overreacting. It's certainly not unusual to make sounds of relaxation I'll call them while having a massage; a good massage anyway.\n\nI've never heard of anyone having this reaction to a massage so not sure how else to respond.  Maybe she thought you were getting sexually aroused, but a good masseuse knows the difference.\n\nYou shouldn't have had to pay the full amount either. If it was substantial, you could write to the owner and complain.", "Info - are you a guy?", "NAH. You didn't know any better, now you do.", "UHHHHHH.    OHH YEAAAAA! FFFHUUUUUCKKKKKKKK", "NTA? They should’ve refunded you for the time you didn’t get, unless there was an explicit rule against moaning. I’m assuming the moan wasn’t overtly sexual, just letting out the stress. I don’t get YTA responses at all.", "NTA\n\nI would have refused to pay the full amount. 1 hour massage only got 45 mins, just subtract it.\n\nMake sure you give a 1 star review. That will hurt more", "Someone touched you in a way that made you feel good, so your mouth made the \"oh that feels good\" sound? NTA", "No. My flag stands high and mighty and waves occasionally depending on how active the winds are", "YTA lol op don’t be moaning like that an involuntary one is excusable more then that people are going to be wondering what’s going on in there lmao 🤣", "You also have to realize that moaning is a way to show someone that you’re getting excited/aroused or already there. Continuing to moan after the accidental one is very creepy and the MT probably thought you were getting off.", "So the first one wasn't intentional - no problem, awkward, it happens, move on. Then you keep going? To intentionally freak her out, yes? You enjoyed your power over her? Yeah. We know your type. YTA.", "I call this was a Friends episode. (the One with the Secret Closet)", "So what kind of moan was it? Like the same moan you use during sex?", "INFO can you post an example of the type of moan? I don't think I can judge without it. Alternately spell it out phonetically.", "YTA. It’s one thing if you let it out by accident, but it’s weird to do it on purpose. Like who the heck wants to hear your moans.", "Gross. And Cring. YTGCA.", "FYI. They’re massage therapists, not masseuses. A masseuse implies they’re involved in a form of sex work.", "NTA. I have sighed & moaned during massages. My massage therapist loves it, considering i get really deep tissue massages he knows when he's getting into the spot, or finally releasing a bad knot, but being a woman, maybe there is a double standard. 🤔", "Lol ok Monica, that’s why Phoebe won’t give you a massage anymore", "yes. you weirdo moan purpose on", "“I let a few more out to just fully relax.” \n\nMoaning is not an outcome of relaxation. Moaning is an outcome of pleasure. While sure you might have enjoyed the massage, but to say you moaning out of relaxation would be a lie. If that’s the case do you moan while you get a pedicure or your nails done? Do you moan while you’re at the salon? I doubt it. I’m surprised they didn’t ban you from the establishment. \n\nYTA", "YTA, but I fall asleep and drool, so I can't talk", "I really don’t understand how op just kept moaning and not think its weird. Perhaps they should practice breathing techniques to de stress?", "....they literally said it was accidental?", "Because my shoulders and back are made of, apparently, concrete, I usually just make vague ‘gnh’ sounds if a knot is found but usually have the masseuse end things early because they’re tired 🙁", "Thanks!", "Yeah BUT if the massage ended early, OP should t have been charged full price.", "I think you're in the wrong line of work.", "[removed]", "Omg this makes me feel so much better about a time where I snored myself awake 4 times in a massage. I was so mortified.", "r/unexpectedfriends", "Glad I wasn’t the only one who went here", "Moanica.", "Agreed, thanks!", "well they kept making moans the accidental moan", "Thanks so much", "Thank you for making me not feel like a jerk. I have back problems and have often accidentally moaned during massages. I never mean to make anyone feel uncomfortable or be creepy but my back is really messed up.", "No he should absolutely have to pay for the full session. He was asked to leave because his behavior was inappropriate, the masseuse shouldn’t be financially penalized because of it.", "Right? Probably shouldn't have a job touching people's bodies in a way that feels good if you can't handle an occasional human reaction.", "Exactly... thanks", "Exactly! Thanks so much", "No he should absolutely have to pay for the full session. He was asked to leave because his behavior was inappropriate, the masseuse shouldn’t be financially penalized because of it. And leaving a negative review over it is COMPLETELY out of line. That can really hurt a business, especially if it is a small business, and this was 100% on him. No experienced masseuse is going to terminate a session for moaning unless it was severely inappropriate.", "exactly what im gonna do, thanks man", "The first one was accidental. The subsequent ones weren't. They literally said that lmao", ">The masseuse didn't seem to mind so I let a few more out to just fully relax.\n\nThe first was. The rest weren’t.", "Try a Thai massage! They really get in there and beat you up (in a good way).", "Why is this getting downvoted? \n\nMassage therapist commenter explains why OP was TA, including their uniquely relevant experience. OP got the judgement, and learned a valuable lesson of how not to be an AH in the future.\n\n\nWhat's wrong with saying thanks?", "Definitely not. OP paid to be there during a time slot they had. OP being there takes up that full time slot, because they can't sell the rest of that time. Its not like they can sell a partial timeslot to someone else.  \n\nPlus, the reason it was cut short was due to OP making the masseuse feel uncomfortable, not some external factor like a storm forcing the place to close early. \n\nSo, OP needs to pay for the time received, as well as the unused time, because they were the one causing it to go to waste.", "If you get kicked out of a bar for being too drunk/loud/whatever, you don't get the cover charge refunded. If the bar has to close because they run out of beer, you ought to get a partial refund. The one responsible, pays.", "Quite the tantrum you just threw, you actual tiny baby.", "Is that you, penguinz0?", "Thank fucking god someone else hates that shit", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Another licensed massage therapist here, we take the snores as a compliment 😁", "Didn’t know about this sub but I love it lol", "How were they supposed to pick up the clue that the masseuse was not at all cool with it? Personally, I see moaning as related to feeling good, even outside of  sexual context. If the masseuse had dropped a hint or let OP know that she found it extremely uncomfortable, and he still did it anyway, I'd 10000% say YTA.  \nNot to mention there's a tonne of different ways and tones to moan in, some of which are clearly sexually suggestive, others not. Impossible to say what OP did, but I believe to give the benefit of the doubt to them.", "he’s only replying to people agreeing with him too. idk why he chose to even post on the sub. so creepy.", "I'm not convinced his behavior was inappropriate; I'd have to hear the \"moans\"!", "Based on the fact that you make a beeline to kiss up to the minority that thinks your behavior was ok (it wasn't, it was really creepy) you don't actually care about wondering if you're an asshole and need to change your behavior. You just wanted validation and will take whatever crumbs you get as a victory\n\nYTA", "I mean, they violated the contract, not you. Arguably, you could have asked for all your money back since they did not fulfill their end. A more reasonable stance would be just to ask for the money for the remaining time.\n\nLook at like this, you pay someone to perform at a kids birthday party for an hour. They decide to leave cuz your kid is annoying, 30 mins in. Do you owe them for the whole hour? No way in hell", "Im a girl", "So you're gonna target this business because of _your_ weird behaviour? Come on, girl.", "No girl talks like this, man. \nWould you have been moaning being touched by another man?\nYTA if anything you should call and apologize profusely. Registered massage therapists are professionals and you tried to undermine that.", "Misread that to be a \"didn't fight not to\" I suppose.", "Did you even read the post?", "Hmm don’t think I agree with this, they have every right to not continue the massage but equally they can’t charge for a service not given, if op stopped the massage then yes they have to pay the full time, the masseuse cancels the time they can’t then charge still, I open a shop, don’t even need to be good, just tell everyone I feel uncomfortable as soon as they walk in the room, yea still pay for that hour on the way out, next…….. I would not have paid for something I didn’t receive.\n\n\nEdit : not to say it’s a normal thing to start loud moaning though lol", "I love how everyone getting mad about this is a teenage girl or a mentally ill feminist lmfao", "what other slang are y'all weirdly whiny about", "I wish I could pay for a $30 hour addon to just nap after the massage, hahah", "Thank you! It was a magical massage at a time when I was incredibly stressed. I'm going to make another appointment, thanks!!", "S/he was moaning *deliberately*. What purpose do you think that is supposed to serve?", "I absolutely guarantee it was inappropriate. Masseuses deal with casual moaning on a daily basis. For them to have stopped the service 3/4 of the way in they had to have felt EXTREMELY uncomfortable.", "Ok, that doesn’t change anything though.", "How's that .. different?", "OP started some portion of the timeslot (and never specified how much of their time was cut off, be it 50% or less). So OP did receive services. The issue becomes that they are not going to change for any less than a full increment of time. Its like billing by the hour: as soon as you start into an hour, you are billed for the full hour. And again, they can't sell the rest of that timeslot, as the whole timeslot was being sold to OP. They can't sell half a massage.\n\nPlus, OP's actions caused the service to be cut short. I do not view that as being any different than OP asking to end early; an action taken by OP, be it asking for the session to be over or by acting inappropriately, marked the end of the session. OP ended the session, so the burden is on them to pay for the whole timeslot.", "Companies build their business on repeat business and word of month. Your fake company would be hemorrhaging money", "Every troll is a pathetic loser. Find a less embarrassing hobby.", "It's not slang, it's normalized baby talk. The amount of downvotes shows just how young most of Reddit really is. Children.", "Right? Wrap me up like a burrito and roll me into the corner!", "I have made the suggestion for a nap upgrade! Good to see that would be a viable option for y’all!", "Please do! Tell you therapist your goal is relaxation and you want to just tune out and you should be blissfully relaxed 😴", "Where in my comment did I say it did", "Where in my comment did I say it did", "Do they list on the wall to not moan? Yea it made the masseuse uncomfortable so they should be able to end it when they want but if he didn’t breach any conditions, they’ve revoked the service due to personal reasons, you shouldn’t pay for a service you didn’t receive, they paid for an hour they didn’t get, it becomes like this to me, either they were so weirded out they don’t care about trying to charge the time they didn’t provide or they want the money that much put earbuds in and zone out to his moaning, there is no middle ground, you’re either happy to ditch the customer and not get paid or the pay is enough to put up with the customer.", "Taking money for no service doesn’t sound like haemorrhaging money, it sounds like a lot of what we deal with in life lol, maybe that’s where people go wrong.", "It's literally slang lmao. You remind me of when Boomers would whine about \"bad means good???\" in the 90s.", "I’ve decided the word “normalized” is childish apropos of nothing. Hey look, guess you’re a child now 🤷‍♀️", "Common sense. I'm sure they don't have \"don't pee on the table\" on the wall either.", "Common sense is don’t eat yellow snow, not making noises during a massage is common courtesy but if you’re goi g to deny service due to it, it should be said", "Moaning excessively most certainly counts as sexual harassment, which falls under the legal territory, and \"don't sexually harass the staff\" is 1000% common sense."]}