{"id": 28637, "submission_id": "174llew", "title": "AITA for not “compromising” with my cousin after he essentially doubled my rent for the single room he was renting to me?", "selftext": "Edit: I just had a consultation with an attorney and his advice was to not move out, laws very much favor the tenant in California especially since I have it in writing what our deal was and that he didn’t want a lease. For now I’ll be taking that advice but my question is still about me being AITA for not compromising with him?\n\nEdit 2: I’m 24 female so I do feel a little bit more comfortable living with someone else, which is certainly playing into my thought process.\n\n\n\nIn September I left a relationship and was desperate for a place to move into. My mom told my auntie who then apparently told my cousin who then contacted me out of the blue saying that he was having trouble paying his mortgage and that maybe we could help each other out if I rented a room from him. \n\nI asked him how much and he said $1600. It was way more than I wanted to pay for a single room but I figured it was quick, saved me the search and I could get right in. So on September 20th I agreed to move in on October 1st. I must have asked him 20 times let’s please go to legal zoom and get a lease. He kept telling me…”we don’t need that we’re family.” With the cost and his reluctance I was getting very annoyed but I was pretty much stuck at that point.\n\nI moved in October first and paid him $1600 in cash. The first week was fine. It’s a nice condo close to the beach in Southern California and i was pretty happy.\n\n Then on Saturday he reminded me that rent would be due in a week. I asked him what he meant and he said our deal was “$1600 every two weeks.” I was livid and told him rent is always monthly. He said he was pretty clear over the phone and e-mail. I scoured every text and email and while he never specified monthly, he certainly never said every two weeks. When I confronted him about this he said that he’s never been a landlord but he pays his mortgage every two weeks so that’s when he needs the money and I should have known that.\n\nI said ok, next month I’ll pay him $800 on the first and $800 two weeks later but $3200 is most of my pay check and I can’t afford that. He said ok his compromise would be “1300 every two weeks.” I said that’s utterly ridiculous to pay $2600 a month for a single room in a shared house and this was why I wanted to sign a lease. He said he would lose the house if I didn’t pay $3200 a month but he was desperate so he would compromise.\n\nI told him now I didn’t trust him and I was going to move out so I’m in the process of finding a couch to sleep on and I keep getting calls from my family saying how I’m leaving him “high and dry” and I need to continue to work with him and my refusal to come to a further compromise or try to work something out with him is “breaking up the family.” \n\nAITA for being done and not trying to work with him?", "created_utc": 1696945433, "permalink": "/r/AmItheAsshole/comments/174llew/aita_for_not_compromising_with_my_cousin_after_he/", "score": 399, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I’m refusing to try to work with my cousin to come to a compromise after I felt he ambushed me by doubling my rent. I may be the asshole because if I don’t work with him, he may lose his house.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\n>He said he would lose the house if I didn’t pay $3200 a month but he was desperate so he would compromise.\n\nThat explains the whole thing. He can't afford his house, so he's trying to scam you into paying the difference. His refusal of documentation was\n the first red flag. I'd leave asap.\n\nDon't let him abuse you because you're \"family.\" If he truly thought like that, he would have never manipulated you in the first place.", "NTA. I think your inclination is correct and he is being shady. He refused to document the agreement and I'd have a REALLY hard time believing this was all incidental and a miscommunication. I think he pulled the rug out from under you, purposefully. \n\nAlso why would you know he pays his mortgage every two weeks? In my experience both rent AND mortgages are generally paid monthly. \n\nGet out as soon as you can. You are NOT leaving him high and dry. He is free to find another tenant with this same arrangement of $1600/2 weeks (but I doubt he'll be able to). It's sad to me that your family is all ganging up on you. Best case scenario, this was a simple misunderstanding and this is simply more than you want to or can afford to pay, in which case you still aren't screwing him over in ANY way.", "NTA - he is scamming you and you should tell the family he is cheating you. $2600 for a room in a condo is price gouging a family member.\n\nYou paid for the whole month. Move out and find another place.", "NTA.  Your cousin is swindling you, you need to get out.  How on earth did he qualify for the property if he still is $3200 short on the mortgage every month?", "NTA\n\nYour cousin just hustled the hell out of you. There's no way the rest of your family knows what's really going on if they think you're \"leaving him high and dry.\" I'm assuming he's selling himself to them as some sort of magnanimous savior while trying to fleece you for everything you've got. Absolutely sickening behavior. $1600 a month for one bedroom is outrageous, especially for a family member in need, and $3200 is mind boggling.\n\nGet out, find a place for half the cost, and leave your cousin to lose his house. He doesn't deserve your help after trying to manipulate you like that and essentially stealing the first $1600 from you.", "NTA....farthest thing from that. I loved in San Diego up until 6 years ago so I know rent is high, but your cousin is a huge AH. Looks like he's trying to get you to pay the rent for him. I'd have left as well. There's a reason he didn't want to draw up a lease and I think he had this planned all along. Good on you for not being a doormat. Don't feel bad. You are not the reason he will lose his place....he is. Block him if need be and other toxic family members if you don't care to talk to them. 3200 to rent a room is too much. You can find your own place for that price. Once again stop feeling bad. You are not the AH, but he sure is by being deceitful and taking advantage of you. Good luck. I hope you find a place soon and have some good friends that will let you couch surf until you can secure a place.", "Absolutely NTA.\n\n>I keep getting calls from my family saying how I’m leaving him “high and dry” and I need to continue to work with him and my refusal to come to a further compromise or try to work something out with him is “breaking up the family.” \n\nThis is beyond daft. They're not all lining up to pay for a house that he can't afford, are they?\n\n>He said he would lose the house if I didn’t pay $3200 a month\n\nIt looks like you'll both be looking for somewhere new.", "Tell your family they can pay his $3000+ a month if they are so worried about him.", "Just move on from that user.  Good lord!  Block him and then blast his BS to all of your family.\n\nNTA", "NTA- he is baiting and switching, his mortgage is his problem. Tell him to get another job", "NTA  He is a MAJOR AH.  Get out ASAP.", "NTA - there is nothing to work out. Everyone talks about rent in terms of the monthly cost. If he wanted it bi-weekly he should have explicitly said that. \n\nUnless it’s the Playboy mansion, no room is worth 3200/mn. \n\nHe clearly was trapping you, expecting you to just fold.", "He is either shady or just stoopid. Either is a possibility. Neither is a good quality in a landlord/roommate. Find somewhere else, and he can find someone else. It's not \"breaking up the family\" - that's just manipulative hyperbole and can be reasonably ignored. NTA.", "NTA….ask him to see his mortgage payment.   He is asking you for 1600 every two weeks?   So, his mortgage is at least 6000?  I find that hard to believe, but, even if it is, you are paying for a room, common area and bathroom.  Not the whole house.  I would not pay him more than what you originally agreed to and start looking for a new rental.  And lesson learned, get things in writing before moving in with anyone or more specifics.   I think your cousin knew from the get go he was duping you.", "NTA. Move out he’s tryna scam you. How the hell is he expecting you to pay 80% of his mortgage and you rent only a room. I would GTFO and tell him to kick rocks he’s obviously being a shady DB.", "NTA, he sounds shifty", " NTA, your cousin is mooching off of you so you make his full mortgage payment. I would look for a different place ASAP if I was you as your cousin is 100% taking advantage of you.", "NTA - he purchased a property. How was he planning on paying for it before you were in the picture?", "NTA . It sounds like he just wants you to pay the mortgage. Your family can round up the money to \"help\" him if they're so concerned.", "NTA.  What compromise is there to be had with this scam artist?  “Please rip me off less”?  If he can’t afford the mortgage without charging insane amounts of rent, that‘s his problem to fix, not yours.", "NTA\n\nYou need to get off Reddit and find a new place to live.", "This isnt an aita issue. Just move out.  Wtf expensive house he has that your share is $3200 a month?", "NTA run! Get out of that situation ASAP he’s scamming you and trying to take advantage. Wouldn’t be surprised if that’s 3x his mortgage", "Lol nooooo NTA. He's trying to force you to pay his mortgage because \"FaMiLy\". He absolutely knew he was going to stiff you, thats why he was shady about getting things drawn up on paper. Don't give him a penny more than what you agreed to, and get the hell out of there asap. Best of luck.", "NTA, this fing guy trying to get you to pay his whole mortgage for him.  I'd look up what rooms are going for in your area find a few examples and send him an email with comparable rooms, also send this email to any family members giving you stress.", "Absolutely NTA even after your edit.  I can't think of any court in CA saying that a landlord \"meant\" two weeks without that being spelled out.  (I was actually a landlord in CA for 10 years).  At the same time, I would stay the month and do anything I can to move out right after that - it can't be a comfortable living situation.  Plus it is creating so much strife within your family.  Poor you.", "NTA what he tried to pull was shady as shit. Glad you consulted a lawyer", "NTA total scam rug pull.\n\n\"Breaking up the family\" You don't rip family off like that, the fact they think he's in the right in any way and you should \"work with him\" after what he's pulled is completely ridiculous.\n\nGet the hell out and fast.", "NTA.\n\nAsk him to see his contract and the payment conditions.", "This is super shady. If this is in the US, the standard for rent is monthly, and the onus was on him to tell you if he meant something other than that.  It’s like any other unit of measure.  If you are in the US and it’s all Americans speaking, if they say they weigh X, the default meaning is pounds, not kilos.  If they mean kg, they need to say that.", "I’d be asking to see his mortgage payments.", "Nta Going forward pay rent by check or money order don't do cash so you have records", "NTA. If he said $1600 and didn't specify a term, monthly is likely the default.", "INFO: What's the usual rent for a room in a condo where your cousin lives?", "I feel like we are all assuming things about the place his cousin owns. Would like to know which beach it is close to and how close are we talking? \nThe condo could easily be worth what he is asking. \nDont have enough info about the place in my opinion", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nIn September I left a relationship and was desperate for a place to move into. My mom told my auntie who then apparently told my cousin who then contacted me out of the blue saying that he was having trouble paying his mortgage and that maybe we could help each other out if I rented a room from him. \n\nI asked him how much and he said $1600. It was way more than I wanted to pay for a single room but I figured it was quick, saved me the search and I could get right in. So on September 20th I agreed to move in on October 1st. I must have asked him 20 times let’s please go to legal zoom and get a lease. He kept telling me…”we don’t need that we’re family.” With the cost and his reluctance I was getting very annoyed but I was pretty much stuck at that point.\n\nI moved in October first and paid him $1600 in cash. The last couple weeks have been fine. It’s a nice condo close to the beach in Southern California and i was pretty happy.\n\n Then on Saturday he reminded me that rent would be due in a week. I asked him what he meant and he said our deal was “$1600 every two weeks.” I was livid and told him rent is always monthly. He said he was pretty clear over the phone and e-mail. I scoured every text and email and while he never specified monthly, he certainly never said every two weeks. When I confronted him about this he said that he’s never been a landlord but he pays his mortgage every two weeks so that’s when he needs the money and I should have known that.\n\nI said ok, next month I’ll pay him $800 on the first and $800 two weeks later but $3200 is most of my pay check and I can’t afford that. He said ok his compromise would be “1300 every two weeks.” I said that’s utterly ridiculous to pay $2600 a month for a single room in a shared house and this was why I wanted to sign a lease. He said he would lose the house if I didn’t pay $3200 a month but he was desperate so he would compromise.\n\nI told him now I didn’t trust him and I was going to move out so I’m in the process of finding a couch to sleep on and I keep getting calls from my family saying how I’m leaving him “high and dry” and I need to continue to work with him and my refusal to come to a further compromise or try to work something out with him is “breaking up the family.” \n\nAITA for being done and not trying to work with him?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA\n\nYOUR cousin is a huge asshole who tf charges rent every two weeks!!", "Nta", "NTA - Who needs enemies when their family is like this? Parasite cousin and other family members who support him.", "NTA", "NTA in a lot of places, what you're paying is more than the full mortgage. Absurd.", "NTA. Given his shady bait and switch actions I would not pay him a dime. You really should find another place ASAP. Cousin is a giant asshole. He is trying to make you pay his entire mortgage when you are renting a room.", "NTA but be prepared for a whole lot of family members claiming you are.", "Nta. He is expecting you to pay the full mortgage.  He is scamming you. Move as soon as possible.  He refused a lease so you are a month to month tenant.  He has no right to expect you to stay. He didn't want a lease and now you know why.", ">\"But my question is still about me being AITA for not compromising with him?\"\n\nTranslation, babe: would I be an asshole for **escaping my cousin's exploitation of me???**\n\nBuddy, how damaged are you that you actually think you might be the asshole for escaping from *very obvious mistreatment*?", "NTA.  With family like that, who needs enemies?", "Well that's just insane so you'd be paying his mortgage for him? But you're the bad guy? Sometimes family is crazzzyyyyy", "NTA $1600 for a single room is already extremely high and double that I’m no!", "What in the nightmare price gouging?\n\nNo, NTA. And, yep, if you are in California and choose to take this to court, sucks to be your cousin.\n\nMy dude, document everything and stick to your guns. Without a lease, he's screwed and if you take it to court, he's going to get stuck with some hefty fines.\n\nHow in the frilly heck did he get approved for a mortgage if he can't afford $3200 a month?\n\nI'm betting he saw you as a sucker that would pay for his house for him while he went and blew his $$ on stupid stuff.\n\nNope.\n\nAnd tell your family to kick rocks.\n\nBest wishes dude.", "NTA 1600 for a bedroom was already highway theft.", "NTA Wow, he has shown his colors. Run and don't look back.", "he is a major AH. a major one. listen to your attorney. NTA i cant believe your family doesnt support you", "NTA. He's trying to shake you down for likely his entire mortgage and then some. I have to imagine you can find a decent apartment or roommate situation for 1600/mo.", "Nta", "NTA... if it is unaffordable and you dont have a lease then there is no need to stay. You offered what you could.", "NTA. As you said, rent is understood to be paid monthly unless other arrangments are specifically made. He lied to you, and now He's trying to pull a bait & switch. Phrase it that way to your family. \n\nGood for you for seeking legal advice.", "NTA. If he’s charging fair market rate then he can get a new tenant when you move out and it’s not your problem. If he’s charging you silly money then he’s asking for rent + charity, in which case your family giving you grief are just as morally obligated as you are to bail him out. Tell them to pay up and help him if they want.", "Move! Move fast, get the f out of there.", "Sounds like he wants you to pay more of the mortgage than just renting a room. I thought he was just increasing and would have advised there are laws about the amount an increase can be but this guy is trying to get a lot more out of you. NTA in any way. You can find a single room for way less. My goodness, I'm in the bay area and know some areas where renting a room is reasonable (like $800 with utilities) but not in all areas.", "NTA\n\n&#x200B;\n\nHe is either an idiot or lying. Everyone knows rent is paid every month. Any amount given would be assumed to be monthly unless he was super clear on it.", "Nope. NTA and anyone who agrees with him is!", "NTA. That’s crazy even the $1600 for one room is pretty ridiculous. I have two family members living with me and they basically get the whole second floor of my house to themselves and I charge then less than $1600. It seems like because he thought you were a push over for the $1600 he thought he could manipulate you and guilt you out of more money. Even if laws favor you in California living with a crazy person isn’t the smarted thing so start looking for a new place ASAP especially since it might take a few months to find a good place", "NTA, not even a little bit!  \nI realize that CA is very expensive but I'm on the East Coast and $3200 for one room is insane.  Thirty-two hundred dollars is considerably more than my mortgage, homeowners insurance and city taxes combined (2400 sq ft plus a fully finished basement)!!   \nNo one quotes rent based on every 2 weeks, it's always monthly for a long term residency. He arranged to pay his mortgage every 2 weeks, it's an option that he chose. It cuts down on the overall payment (bring principle down and therefore interest payments). I can guarantee you he was presented with monthly payment amounts before he chose the bimonthly route.  \nYour cousin is a creep who is trying to take advantage of your situation. He should be ashamed of himself - and so should be the relatives who are berating you. Too bad that $1600 a month still leaves him short. How did he get a mortgage if he can't make the payments even with that much extra income?", "You initially tried to establish a clear agreement: You made multiple attempts to create a lease or clarify the rental terms with your cousin before moving in, which is a responsible and reasonable approach..", "NTA.\n\nRent is always monthly.\n\nHe got fucked by the raising interest rates and now he's trying to fuck you.", "Anytime someone refuses to put an agreement in writing, it means they do not intend to honor that agreement. He wants you to pay his entire mortgage and that is some absolute BOLLLSHIT. \n\nLook up the home on Zillow and see how much he paid for it. That will give you some kind of idea of what his mortgage actually is, because he is obviouslylying to you. But follow the lawyer's advice and secure your valuables. Stop taking calls from \"family\" who want you to pay someone else's mortgage, in exchange for a single room. Save all written communication with your cousin and don't have phone calls that are not via Teams, Zoom or another method that you can record, with everyone's knowledge. \n\nNTA.", "Move. He is a liar and thief. If it’s his house you are in a long term losing situation. You are month to month without a lease. NTA.", "I work for a mortgage company. I’ve never heard of paying your mortgage every 2 weeks. He’s lying and being shady as hell. Too bad you’re out $1600.", "NTA. He's trying to scam you and kind of succeeded if you agreed to pay $1600 a month to rent a room.", "Run run as fast as you can", "Your family is the pits.\n\nYou are not leaving your cousin \"high and dry\" if you move out.  He is being a total AH if he thinks you should spend $3200 a month on renting a room from him.  There's no way that he meant that to be $1600 every two weeks.\n\nSecondly, he shouldn't have bought a house he couldn't afford.", "NTA\n\nHe's scamming you and likely lied about how far into debt he's gone with the house.\n\n>told him now I didn’t trust him and I was going to move out so I’m in the process of finding a couch to sleep on and I keep getting calls from my family saying how I’m leaving him “high and dry” and I need to continue to work with him and my refusal to come to a further compromise or try to work something out with him is “breaking up the family.” \n\nTell them to help him out then!", "NTA, im a realtor and property manager in CA. Make sure your mail sent to this address. Don't pay him another cent and tell him he can just go through the eviction process if he wants you out. Eviction courts around here are backed up with like over 4000 cases, tell him you aren't paying anymore and if he wants you to move he can pay you a relocation fee, often they're around 20k. Even literal squatters with no lease agreement, or even verbal agreement have a lot of rights here. Usually I'm on the other side trying to help my clients deal with \"professional tenants\" who stop paying rent as soon as they get in the door or family members tenants leave behind when they move out trying to claim the home as their own as they know they can't be easily kicked out. I usually feel bad for the landlords when this happens but the laws here favor tenants for cases like yours with abusive landlords. He wanted to get over on you, screw him.", "I don’t even think that’s the difference. For that amount, depending on where he is, that might be all of it.", "I bet OP’s rent is the entire mortgage", "Can pay mortgages biweekly weekly monthly etc. Biweekly weekly actually gets you an extra payment per year or so and reduces your balance faster.", "Exactly this…and tell your relatives on his behavior lol", "This. OP, find another place to live. Your cousin is being insane. He thinks you're desperate, so he's trying to take advantage of you. I'd find another place to live and never talk to this cousin again. I'd tell family that if they want to pay him $3200 a month, they can.", ">  Also why would you know he pays his mortgage every two weeks?\n\nOP would not know that, OP would not expect that. I have literally never heard of anyone paying mortgage anything other than monthly. \n\nPays his mortgage every two weeks? Really? Who does that, and why? Does his employer pay him monthly or weekly?  \n\nI call BS on it, because he didn't mention this \"unusual fact\" upfront.", "I, too, always thought mortgages and rent were paid monthly, until we had a house.  Money saving tip:  pay your mortgage bi-weekly instead of monthly, and you save money over the long run.", " It has 2 bedrooms and a garage. Mine is about 2600 a month, I think.", "I ever saw a monthly THAT low even with 1% APR.", "I pay my mortgage every two weeks. It's a biweekly plan, the payments are cut in half, and since there are more weeks in a year it works out to an extra month worth of payments which is nice for paying down the mortgage amount because less interest... it cut a few years off my mortgage.", "Yeah, I’m willing to bet the cousin is giving their family the same hazy, half complete level of information he tried to give OP. They almost certainly Lu don’t know the whole story, and OP should start being very, very honest.", "Yeah why does OP have to pay it? Why can’t the rest of the family chip in?", "Also, if it’s such a fair deal, he can always rent to someone else. I’m sure there are plenty of people willing to spend 3200 on a room in a condo", "Right off the beach like I am, it’s probably pretty close to what I’m paying.", "It’s OB pretty close to the pier.", "Just to be clear I don’t think they don’t support me, they just want me to try harder to find a compromise with him before moving out.", "I would love to know what state OP lives in because $3,200 for half rent is crazy to me. If they are supposedly splitting it. My entire mortgage is $400 a month.\n\nI wonder if the cousin owes somebody money.", "Almost 100%. OP is buying their cousin a house.", "Still, I see no reason why OP would have been expected to know that. Additionally the idea that rent must be paid in concert with mortgage payments is kind of bogus to me, I see no reason why that must be the case, other than the cousin wanting to simply collect more in order to more easily make his payments.", "You're better off with an extra principal only payment than an extra P+I payment, though.", "If you can make the arrangements, it's better to pay every two weeks because over the long run it saves you thousands of dollars in interest and reduces the time it takes to pay off the loan.\n\nAlso, I didn't know this until I owned a house myself.", "Paying your mortgage every two weeks is the way. If your mortgage is say $1000 a month and you pay $500 every two weeks (so sqme payment amount) you pay down the interest faster (more money does to the principal). You knock off up to 8 years of a 30 year mortgage.", "It's not super common but it does happen. I don't think anyone that isn't at least looking into a mortgage would know that, though,  unless maybe their parents did it.", "I million dollar mortgage would easily cost $8 to 10k a month but after having time to think about it some more the way your cousin went about it definitely seems like he was trying to swindle you. Or at least he should have considered what your income is before he asked you to move in and pay that type of money. Cuz it's definitely not normal to rent out a room for 3600 a month", "if you say so", "What kind of compromise, he writes over the house to your name? Because this sounds like you are paying for his house.", "OP said California and SoCal is gnarly. My parent’s house went up in value 5 times from when they got it in the late 90s. Their mortgage for the exact same house would be $4,000 more than they pay currently based off that and it’s what would be considered like a “normal house” not super fancy or anything.", "3200 a month rent isn’t insane (in general). But for a single room it sure is. My old townhouse we sold during covid is being rented for about that now. But if you are renting it your getting about 2100sq ft, a basement (unfinished) a single car garage, 3 BR, 2.5 bathrooms. And we’re about 20 minutes from multiple beaches in NJ.", "Where the hell are you that mortgages are $400?! That is insanely cheap. I paid more to live in a converted closet in the 90s in my area. OP said it's a condo near the beach in socal. Even so, $3200 sounds closer to the entire amount rather than half though.", "It's California, so it is possible his mortgage is that much. My sister-in-law and her husband paid a million... for a small house.  It has 2 bedrooms and a garage.   Mine is about 2600 a month, I think.  But, in any case.  If he can't afford the mortgage, he needa to sell the hous.e", "At current rates that's like maybe a 50k mortgage. What are you supposed to buy for that?", "You can pay every 2 weeks without making an extra payment and you’ll still pay it off faster than if you pay every month. Interest is calculated daily and applied monthly.", "A 1.3 million mortgage with bi weekly payments is 5500 per month at a decent rate.  If he’s on a floating rate it could be 8-10000 per month.  \n\nI’m\nGuessing he’s the latter.", "It doesn’t matter, no bank would give a mortgage that large to someone that couldn’t afford it and even then, 3200 a month would be more than half the mortgage on a 800k property.", "It's almost definitely one of three things: A very old mortgage, a very small/cheap house, or a rural area with incredibly low cost of living. \n\nI worked mortgages across most of the US for several years before the housing market imploded in 2022 and I don't think I ever saw a monthly THAT low even with 1% APR.", "I live in a Pennsylvania city. One bed, one bath with a large basement, and a nice big yard. I lucked out.", "Detroit?", "A shoe box in Nebraska.\n\nhttps://oldhousesunder50k.com/c-1890-nebraska-tiny-house-for-sale-under-50k/", "You're just making an extra payment without the flexibility to decide whether or not to make it. You're not somehow better off having the extra payment added in to start.", "I mean it's possible that Cousin either lost his job or bought the house with a SO who has moved out so he's now responsible for the entire mortgage, but that doesn't make a single room worth $3200/month.\n\nEspecially when you intentionally have to trick someone into trying to get them to pay it.", "You’re right 2008 never happened and certainly isn’t still happening", "Probably all of the above. Still shocked someone would use this as a frame of reference. You gotta know that's basically unheard of", "Well good for you, that sounds amazing!", "No, the timing of this matters. Every two weeks ends up on paper as an extra payment but the  prevented interest is \"accrued\" with every payment.", "The point is, its unrealistic for many reasons.\n\nWhy did the guy ever think that he could afford a $6400 a month mortgage? Why would he have paid that much for a condominuium? Why would a bank have given him a loan on such a stupid purchase? Those are three separate idiotic choices that have no immediate explanation.", "Yeah it's possible there are extenuating circumstances I'm not thinking of, but it just reeks as being out of touch. Like maybe he put half the house down on a down payment? But then you should have the wherewithall to be like oh, my mortgage isn't 800 a month *because I paid for half of it up front*"]}