{"id": 28639, "submission_id": "174n2ra", "title": "AITA for telling my cowoker to walk down the hallway or buy a lunchbox?", "selftext": "I have a coworker who is a bit awkward. She lingers after conversations are finished, interrupts when I'm doing prep without asking if it's a good time, etc. She's nice so I don't say much about it, like I said, she's just awkward.  On occasion I've mention \"now's not a good time,\" and I'm met with \"it'll be quick.\" Little irritating things here and there but not worth creating a bigger issue out of. I believe she's just very bad with social cues.\n\nNow the main issue of the post. I have one of those small mini-fridges wedged between my desk and the wall. One of the ones that fits a handful of drinks, a sandwich, and has that useless little freezer at the top. I bought it and it's plugged in with permission from school admin. After lunch when there's space some of the student athletes run in to pop a gatorade in and then grab it at the end of the day (relevant later). \nTwo weeks ago she asks if she can keep a drink in there. I said sure, no problem. Her class is next to mine, I figure she'll grab it during lunch, no biggie. Today I slid my chair forward, thinking she was dropping off her drink for the day, nope. She shoves a sandwich and some tupperware in their crushing my sandwich. I asked what she was doing, she said it's, \"easier than walking down to the teachers lounge.\" I pointed out that she crushed my sandwich and I only told her she could keep one drink in there. She asked what the big deal was and I honestly felt like a 5 year old saying, \"well it's mine and I got it for my stuff.\" She mentioned that I let students use it and I told her that's after my food is out for the day and they don't have access to another fridge like she does. I followed it up with, \"if you're too lazy to walk to the lounge you can get a lunchbox and an ice pack.\"\n(I'm self aware of my laziness, that's why I bought the fridge, I don't want to waste sweet sweet prep or lunch time bobbing and weaving my way through the hallway)\n\n\nWhile I know I'm not wrong for evicting her tuna salad from my fridge, I think I might be the asshole for how I handled it/worded things. AITA?", "created_utc": 1696949293, "permalink": "/r/AmItheAsshole/comments/174n2ra/aita_for_telling_my_cowoker_to_walk_down_the/", "score": 660, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole because my response to my coworker was immature and I might have been able to handle the situation more appropriately.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA\n\nShe is human creeping ivy.  If you don't prune it, it will take over everything.  You proved it, she won't take a hint, won't leave, thinks her input is more important then yours without any other info and now wants dibs on your fridge.  Hopefully this bluntness may have other benefits like respecting you, your time and your possessions.  Most people like this are oblivious so expect her having an attitude and talking badly about you.", "NTA\n\nEstablish boundaries and stick with them. Good luck this year! Kids are wild.\n\nTeachers can be special sometimes… limited exp working in anything but education really messes one up.", "NTA. She doesn’t understand subtleties, so you needed to be blunt and unmistakably clear. Your property, your decision who you share it with.", "NTA\n\nSometimes you have to be direct with people.  She was literally arguing about you not letting   \n her taking liberties with your stuff.", "NTA. She brought up it being “easier than walking to the teacher’s lounge,” which opens the door to your comment. She overstepped.", "NTA.   She made the conversation more difficult and left you no choice but to crack a rib to get to the heart of the thing.", "NTA\n\nShe smashed your sandwich, and didn't even apologize?  So rude!!  You said a drink, not a bunch of containers.  If she had asked first, would you have been ok with her adding her lunch?  No matter your answer you are still NTA here.  She could buy her own tiny fridge; they are fairly inexpensive.", "Nta but I understand your ire.", "NTA, but I wonder if your coworker might be on the autism spectrum based on your description", "NTA. Perhaps you were a little blunt but who reacts to \"you crushed my sandwich\" with \"what's the big deal\"?\n\n100% NTA.", "NTA. You were nice to offer it at all and when she pushed beyond what you offered you told her no and why. Given what you said about her having difficulty picking up social cues you were direct and clear.", "Nts she is.  Why are you second guessing when she clearly took advantage and did not respect you?", "NTA. She seems to not take politeness, so being blunt may be the only way to go with her. Why she even brought up the students drinks is rude.", "NTA, letting others use your stuff is the nice thing to do but not to the point where it suddenly gets considered as communal. Next thing you know it she'll be taking your sandwich out and dumping it on your desk because she needs more space.", "To avoid such a situation,  you  should not have let her use it in first place.", "NTA she sounds like the one of the worst sorts of coworkers", "Very mild YTA for the way you said it, but otherwise NTA; there was a more polite way to say what you said (\"It's my fridge so I get to decide what goes in it, who can share it, and when; if you dont like my rules about my fridge then I guess the lounge fridge is still your best option\") but she was annoying and I don't blame you for getting annoyed", "Soft YTA. I would say the way you worded that was more jerky, than AHish. Also, you don't owe her an explanation for how you choose to use your stuff. If she doesn't want to take that walk, she can get a fridge like you did.", "Both\n\nYTA for being emotional about it and using emotionally charged language to make your point.  It seems like you could \"feel\" that you lost the moral high ground when you lost your temper a bit, which is generally the case.\n\nHowever, NTA for standing your ground and evicting her after she crushed your food.  Holy crap, that is sooooo selfish of her to do...  You deserve to be able to use the fridge that you bought yourself for your food without someone selfishly crushing the food you put in there. Definitely NTA for that part.", "ESH. Your delivery sounds mean and you seem very judgmental. She’s lazy and rude", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI have a coworker who is a bit awkward. She lingers after conversations are finished, interrupts when I'm doing prep without asking if it's a good time, etc. She's nice so I don't say much about it, like I said, she's just awkward.  On occasion I've mention \"now's not a good time,\" and I'm met with \"it'll be quick.\" Little irritating things here and there but not worth creating a bigger issue out of. I believe she's just very bad with social cues.\n\nNow the main issue of the post. I have one of those small mini-fridges wedged between my desk and the wall. One of the ones that fits a handful of drinks, a sandwich, and has that useless little freezer at the top. I bought it and it's plugged in with permission from school admin. After lunch when there's space some of the student athletes run in to pop a gatorade in and then grab it at the end of the day (relevant later). \nTwo weeks ago she asks if she can keep a drink in there. I said sure, no problem. Her class is next to mine, I figure she'll grab it during lunch, no biggie. Today I slid my chair forward, thinking she was dropping off her drink for the day, nope. She shoves a sandwich and some tupperware in their crushing my sandwich. I asked what she was doing, she said it's, \"easier than walking down to the teachers lounge.\" I pointed out that she crushed my sandwich and I only told her she could keep one drink in there. She asked what the big deal was and I honestly felt like a 5 year old saying, \"well it's mine and I got it for my stuff.\" She mentioned that I let students use it and I told her that's after my food is out for the day and they don't have access to another fridge like she does. I followed it up with, \"if you're too lazy to walk to the lounge you can get a lunchbox and an ice pack.\"\n(I'm self aware of my laziness, that's why I bought the fridge, I don't want to waste sweet sweet prep or lunch time bobbing and weaving my way through the hallway)\n\n\nWhile I know I'm not wrong for evicting her tuna salad from my fridge, I think I might be the asshole for how I handled it/worded things. AITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA…you can get mini fridges cheap all the time off of fb marketplace.   As for when she said it will just be quick, then just ignore her.  If she says something, “you may think it is quick, but I already told you I do not have the time right now.  Excuse me, I need to get this done”.   But… “well then, e-mail or message me and I will get to it when I can.  Goodbye”.", "Nta. But shoutout to you for letting kids cool their drinks and such", "Wow what a vivid description", "Not to mention squishing the sandwich\n\nThe amount of care I take in making sure my bread stays fluffy while cutting and putting it in a bag, omg\n\nKudos to OP for handling this so calmly\n\nEdit: spelling", "Yeah, lesson learned", "Yeah I had a visceral reaction to that image, good one", ">She asked what the big deal was\n\n\"You have no respect for *my* belongings that are in there.\"   \n\nNTA.", "Ever hear the phrase \"ask for an inch, take a mile\"? Ya that's your teacher friend here", "NTA - she squished ur sandwich :(", "NTA- You can literally get a mini fridge that fits 6 cans of soda for 30 bucks at Walmart. It is perfect for storing a sandwich and a drink.", ">She's nice\n\nIs she really if she pulls stunts like this? I mean she may be because I am just a scrutinizing reddit stranger.. But people sometimes have blind trust in other people's niceness and kindness.\n\n If she doesn't get social cues there may be decent reasons, but I personally know that some people just don't give a fuck about them. They test waters a little and then lose every sense of respect towards others. I don't know how to describe it. \n\nThey may not get it because they're dull or just simply do not care. NTA.", "NTA- this reminds me of that book “if you give a mouse a cookie”. Except “If you give a weird coworker permission to put a drink in your mini fridge, she’ll take it over with her stinky tuna salad and crush your sandwich”. I’m glad you nipped it in the bud and told her it’s unacceptable. I can’t believe you even had to explain that to a grown woman. She’s extremely inconsiderate and stupid for not only trying this crap but also arguing with you after you called her out on her shitty behavior.", "NTA, OP, as so many wonderful folks here have expressed and explained so beautifully!\n\nSo allow me to add that after your post, and their replies, this: (*I'm self aware of my laziness, that's why I bought the fridge, I don't want to waste sweet sweet prep or lunch time bobbing and weaving my way through the hallway*) may be the most enchanting and sincere thing I've read today. I feel you, and I'm with you 100%!", "NTA.", "Nta", "NTA and it was fucking tuna?  You don’t put fish in someone else’s space. Ever. It’s stinky. It’s also a common food allergy. No. No. No.", "NTA, she wasn't taking hints and she WAS taking liberties.", "Anything less than throwing the tuna salad at her head after the first time you said no is grace on your part. NTA.", "NTA for being brusque after she crushed your sandwich.", "She overstepped on your generosity and crushed your sandwich. Thus removed half the taste but keeping ALL the calories! Better phrasing might have been, \"If you don't want to walk to the lounge\" instead of using the word lazy, but with a fresh sandwich crush to deal with its within acceptable parameters. \n\nNTA", "Be awkward back, remove the fridge, and say it's because of you. Then put it back once the problem stops.", "Why would you put a sandwich in the fridge? You'll both fuck your lunch up.", "Might be against the tide here, but I'm leaning towards ESH. Her behavior is annoying, not harmful. Based on your description of her awkwardness, I'd be willing to bet your coworker is autistic. The thing people tend to get wrong about autism and social cues is thinking the communication problem can be solved by leaning into the social guessing games even more. The only way to get your intention across is to drop the polite bs and tell her the truth. If you wouldn't appreciate being coddled yourself, why would that be the solution with her?\n\nThe comment about being self-aware of your laziness comes across as snide - I think you feel like a five-year-old because you're kind of acting like one. You presented her with a solution to her problem (needing a closer fridge), and she took full advantage. If you don't want her using your fridge, you need to state that directly. There is nothing to be gained here by dancing around the issue - she's not doing it to be a nuisance. You're giving all kinds of mixed signals that she is struggling to interpret.\n\nNeither of you are assholes, but there are much more efficient and kind ways of communicating with someone who thinks differently than you do.", "NTA. She's overstepping, something she seems prone to do. You weren't mean, just straightforward.", "Meh. People push boundaries, then whine when ppl push back.\n\n&#x200B;\n\nNTA", "Put a chain around it and have the students you trust with keys and tell her only you have a Key. 😂", "NTA\n\nShe crushed your sandwich. She was rude. She needed to be evicted.", "NTA. She can get her own mini fridge.", "NTA. You told her she could keep one drink there, not her entire lunch box and snack and she messed up your sandwich. If she is lazy she can buy her own mini fridge", "NTA.  You tried to be nice and allow your coworker to leave 1 bottle in the fridge. You also said that she doesn't understand the normal polite social cues.\n\nI'm afraid that it you weren't so blunt, she would never get the message. So while you were very, very direct it is prolly what appropriate to her situation.\n\nShe also has choices: buy her own fridge, lunch box with a cold pack, or walk to the teacher's lounge. Please don't spend more time worrying about her.", "NTA. She's inconsiderate not awkward though.", "Tell her to sell enough Scholastic Books and earn her points. Enough points will buy a mini fridge. That's how I got mine a gazillion years ago. Only took 4 or 5 years of pushing those damn book club pamphlets every month.", "NTA you set the boundary she ignored it. She got what she deserved.", "NTA.  \nLet her buy her own refrigerator if it's that big a deal for her!!", "NTA but she is an a hole", "I can understand why you wanted to say what you did, but I don't think it was wise. You have now made an enemy. \n\nAfter eating her tuna sandwich, I would have politely but firmly said, \"Sorry, there is enough room for you to keep a drink in my fridge, but no more.\"", "I know exactly the type of person you mean and I cannot stand those people. You do them a favor one or two times and then they get it in their head that they can keep asking you for shit and start pushing boundaries. Fucking lazy assholes is all they are.", "This exactly describes a new person at my work. She has latched onto me and will NOT leave me alone. After causing me to break down (she WAY overstepped and ignored a boundary) she has been told to leave me alone and not speak to me unless it is specifically about work and she STILL will not stop.\n\nNext time I might be super blunt and straight up rude to her and quote this. Being polite didn't stop her. Stating boundaries didn't stop her. Having a HR meeting did not stop her. Maybe being unpleasant will be >.<", "“…human creeping ivy.” 🤣! That’s awesome!", "I love this terminology", "She's like the camel's nose!", "Good description", "| human creeping ivy\n\nI love this!!!", "More likely she’s just an asshole.", "You would let a sandwich with potentially cheese or meat just sit out unrefrigerated for hours????", "I have a friend like this. I love her to death but omfg she is terrible about this. I had to sit her down and tell her if I offer you x, it is not your invitation to ask for y or if I offer to do a OR b it does not mean doing a AND b is on the table. Whatever I'm offering is what I'm willing to do. I wish I could have been a little more lenient on it and say I'm offering whatever and I need you to realize I'm only willing to do something in the ballpark of that offer. Unfortunately, she doesn't get that either so I have to be really strict. Like if I offer to drive her home suddenly I'm just offering to drive her around in her mind and it's \"can we stop at the pharmacy and then the grocery store?\" and the 30 minute ride is now a 3 or 4 hour excursion.", "Sometimes you don't even need to do them a favor. There was always that one student every year that thought because I happened to look up and accidentally make eye contact when they walked past my door that I was their new best friend. Considering my desk was usually covered in confidential information their showing up to tell me about their life was just not a go. So glad to be behind two locked doors now.", "Be super blunt. And if she continues to bother you about non-work stuff, report her to HR: she should get a written warning, imho, starting formal termination steps if the HR demands are not followed.", "ESH...\n\nAs you said, you had every right to evict her, but you crossed the line when you called her \"too lazy\"...\n\nMind boggling that everyone is letting you off the hook for being an AH back to her... but, this is Reddit, so...", "Get a lock", "Come on /u/EpiJade, it's on the way! /s", "I agree. It's all been noted and written down already. It has become straight-up harassment IMO, especially after she went to my partner to ask them about things I'm interested in to try and buy me presents as an \"apology\"\n\nThis was AFTER the initial meeting where she was told to stay away from me. She decided to ignore those boundaries and made a beeline for me the next time I was in work\n\nIt is stressing me the heck out", "What’s mind boggling is the Chutzpah of some people and I ain’t talkin’ bout OP…", "hahaha that's exactly what she says! Her idea of time is also super warped. One time she swore somewhere was \"on the way\" and it would only take 40 minutes, we'd be in and out and home \"so fast.\" It took us 35 minutes just to GET there (this was in the mapquest days and she was navigating)  then we had to fuck around while she puttered around with another friend then we finally returned home at nearly midnight. I was seething! We were moving the next day and had to be up at 7."]}