{"id": 28635, "submission_id": "174pgvq", "title": "AITA for telling my niece she’ll have to move out if she’s not my nanny anymore?", "selftext": "I’m a single mom to 2 kids (8 & 6). I work as a nurse. 3 days a week, I work 12 hour shifts (12 pm-12 am). After my husband passed, I needed a nanny to tend to my kids from the time they got off school (3 pm) onwards. I decided a live-in was the best choice. I have one guest bedroom. \n\nI live right near a university. Around this time, my niece had just gotten accepted. She wanted to save cost on dorms and offered to watch my kids those 3 days, if she could live there rent free. I agreed, and said I’d also pay her $22/hr (a competitive rate for our area). She’s done with her classes by 1, so it works out. She fixes them dinner and puts them to bed. Then she’s free to do whatever. But of course I pay her from 3 pm-12:30 am. It worked for 2 years. My niece never had any complaints.\n\nNow, however, my niece is getting an (paid) internship related to her major that starts in January. She wouldn’t be available to watch my kids. I congratulated her and said I could help her look into student housing or an apartment. We’d have 3 months to do this. She was confused. I said since I would need a live in and only have one guest room, she would have to move out. My niece got upset and said this isn’t fair, she won’t be able to save any money if she gets a dorm or an apartment (she could afford to live on her own, but wouldn’t have much savings). I pointed out that this would work best for me as I had to put my kids in aftercare the other 2 days I work (I get off around 5) and the nanny could just pick them up from  school vs them having to stay there so long.\n\nMy niece argued that the nanny could leave at the end of her shift but after speaking to some nannies, they understandably don’t want to drive home so late. Plus, I’m fine with the nanny (and my niece) sleeping after the kids do. So, there’s no sense in them sleeping then waking up and driving so drowsy. Even I feel nervous driving home so late, especially after my long shift. \n\nMy SIL (her mom) feels this is unfair to my niece but she moved in under the condition that she’d work as a nanny. My SIL and brother live 3 hours away, so niece couldn’t commute if she moved back in with them. They feel I should try to find a nanny who’d be willing to drive home at 12:30 AM (it’d take me a half hour minimum to get home), but all nannies I’ve spoken to have said no or expressed concern about their safety driving so late. \n\nAITA?\n\n\nEDIT to answer from FAQ: The internship is all semester long. My niece isn’t interested in nannying at all going forward and will instead be pursuing internships. She has no desire to work after her internship is over for the day.\n\nShe knew from the jump that I was only looking for a live in specifically for childcare.\n\nI have also provided her written notice and am covering my ass legally.", "created_utc": 1696955354, "permalink": "/r/AmItheAsshole/comments/174pgvq/aita_for_telling_my_niece_shell_have_to_move_out/", "score": 5817, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) telling my niece she’ll have to move out. 2) I could try to convince a nanny to drive home at 12:30 am.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA at all.  I'd go for the jugular and ask them why they feel a widowed single mother who's just trying to hold it all together is obligated to provide their adult daughter with free housing.  I'm surprised you were paying her as much as you were considering the free housing.", "NTA\n\nShe fully knows she moved into a room that was intended for a nanny. As she fulfilled that role for two years. It is unfair for her to now demand a change to the arrangement. Especially since this would be at a heavy cost to you.     \n\n\nThey are also an adult who has been paid a nice hourly rate between 3pm and 12am, without any rent being charged. What were they doing with that money? After two years they could have something set aside. Tuition isn't cheap but holy have they squandered a great opportunity if they can't be ready to move out in three months.", "NTA. You need to get a lawyer to draft an official move out document with a 30 day date. Her parents are going to tell her to just stay and call your bluff because \"FaMilY\". Don't let her screw you and your kids over.", "NTA\n\n \n\n>They feel I should try to find a nanny who’d be willing to drive home at 12:30 AM\n\n Or they could pay for their kid to live somewhere else. You gave her free rent for 2 years, since you paid her to work as a nanny.", "NTA. The living arrangement was for the *Nanny,* a position that your niece was filling. It was NOT made for your *Niece,* specifically.  If your niece is quitting the Nanny job, then that means she is also giving up the accouterments that came with it.  It sounds like she is mis-remembering or just plain rewriting the terms of the arrangement to suit herself. Regardless, this is a problem that she has created for herself through wrong assumptions and lack of planning. Stand your ground - it's her problem to solve, not your burden to shoulder.", "NTA - she had a double great deal - you gave housing and competitive pay. Now she’s moving on but doesn’t want to give up free housing - such a shame she and her mother are being childish and don’t understand you need the room for the next nanny.", "NTA\n\nI doubt you will find a Nanny willing to work those hours and then drive home late at night.\n\nStart interviewing and make it clear to your Niece she has to be gone by the time the new Nanny starts.\n\nShe is a big girl she can live in Halls with the other students.", "Nta. So you need to find a nanny that doesn't want to live with you.  This would upset your whole lives. Your nice agreed to be the nanny if she could live rent free and get be a your paid nanny.  Now she wants to end your agreement and wants you to sacrifice you family routine so she doesn't have to change anything in her life?  Tell her you will be charging $1000 a month plus utilities and food if she stays. Is your whole family so self centered. It is your job to put your children and your life before what niece and sister want. Stand up or be walked on your choice.", "NTA\n\nYou agreed to let her live with you while she was your nanny. She's now trying to continue to live with you rent free, while preventing you from having space for a nanny.", "NTA. A mutually beneficial arrangement has come to a natural end.", "NTA- Aside from free housing, she was paid an overly fair wage that most would consider livable income (totally depends on area of course). If she did not manage her personal finances properly, it would be difficult to make this transition but that’s not OP’s fault. \nUltimately, the niece may find herself in a bind but has no right to point the finger at anyone but herself for not creating an emergency fund. It almost comes across as entitlement, because it’s her situation that’s changing not OP’s.", "NTA\n\nShe moved in with a specific understanding that the terms would be mutually beneficial. She changed the terms and the agreement is no longer mutually beneficial. So she lives elsewhere. Seems clear.", "nta. the room is for a live in nanny. she is no longer a live in nanny. \n\ntry this: look up the price for such a room in your area. tell your niece that if she really wants to live there, she will have to pay that rent. \n\nor just tell her a date to be out by. tbh demanding free housing because otherwise she “won’t be able to save as much” left a pretty bad taste in my mouth. your life does not, cannot, revolve around your niece. you have kids of your own. if your sil feels so strongly that her daughter should live rent free she can pay her daughter’s rent once she moves out. \n\ngood luck with your search for a new nanny.", "NTA\n\nShe entered an agreement with terms, so she should not be surprised to be bound by them.", "NTA. You are supporting YOUR children. Your niece's parents need to support their child. You hired her for a job that included a place to live, she's leaving the job, the place is no longer hers. If she worked at Wal-Mart and quit, she would no longer be able to drink the free coffee in the breakroom. She had a good situation, but she is choosing a different option, which is reasonable for her career, but it isn't your job to house her.", "Nta. You've been paying her $600 a week, plus free food and housing, for two years, and she's not been able to save ANYTHING?", ">She wanted to save cost on dorms and offered to watch my kids those 3 days, if she could live there rent free\n\nShe, herself, set the condition of her living there rent free.    \n\nNTA", "NTA.  Her being the nanny in exchange for housing was the deal. It's still the deal.  She basically now wants to live with you rent free while you have to figure out to manage a new nanny.  Nope.   You're not responsible for helping her save money by giving her a free place to stay.  You have your own kids to worry with and she needs to find other living arrangements.", "She apparently understands the requirements for the internship and is willing to commit to that knowing it would prevent her from keeping her agreement with you to be the nanny.   Contract is being broken by her, why should you be expected to continue your part?  Entitled child person in college", "NTA. She is quitting her job so she loses her room & board benefit. What if she nannied for a stranger? Would she and her parents expect the former employer to continue to give her free room & board? Your niece, brother and SIL are being greedy and selfish. Your only concern is your children not your niece. She has two parents to help her. Your kids only have you. Hire a live-in nanny and move niece out.", "Nta - she and her mom only feel it’s unfair because they no longer get things slanted in their favour.", "NTA. Your terms for her staying there were clear from the beginning and she agreed. She can no longer fulfill her end of the agreement, so then its reasonable for you not to continue your end. If she quit a job, she wouldnt expect the employer to keep paying her a salary would she? \n\n&#x200B;\n\nUltimately it is your house, so its your choice.", "NTA- She moved in under the condition that she be a nanny to your kids. That's a verbal contract. Since she can't do it anymore, she has to move out.", "I had Y T A wound up after the title, but no.   NTA.\n\nThat spare room is for the nanny.  And, as you're already seen, most nannie aren't going to want to drive home so late.", "NTA. The terms of her living with you were clear and based upon her being a nanny. It is especially reasonable considering the fact that all of the nannies you've spoken to have clearly expressed that they are not willing to drive home that late.", "NTA. Your live-in nanny is quitting so will move. Her parents are at liberty to pay for housing elsewhere", "NTA.\n\nShe offered to watch your kids 3 days a week, and be paid $22/hr, in exchange for free lodging. Why on earth does she expect to continue living there when she knows you planned to use the room for the nanny?\n\nIt's rich that she and her parents think it isn't \"fair\" for you, a single mom,  to hire a live in nanny, instead of providing free housing to your adult niece. WTF!", "NTA- she doesnt get to have  a say in who uses your guest room.  If you need a nanny for child care then that is what you do. She is getting it very easy really.. 3 days of work, free room and gets paid for it.", "NTA, her living with you was contingent on being your nanny. It's no secret you desire having a live in nanny and need the guest room to do so. You are also offering to help your niece find a new place to stay.", "NTA.  She doesn't want to perform the job.  You need the room.  Period.  Doesn't even matter if she can or can't afford a place of her own yet alone save money.  It isn't your responsibility to provide for her.  That's her responsibility as an adult and her parents if they wish to take on that role.  You are a mother of 2 working and doing the best you can.", "NTA\n\nShe didn't warn you about this prospect.\n\nShe could have been saving.\n\nMaybe her parents will have to pay up to help her rather than holding you responsible.\n\nYou have been more than generous to her.", "NTA.  You set the conditions out clearly at the start.  It is not up to you to find any solution for your niece.  You gave clear requirements for your children’s care.  Ensure you give your niece proper written notice to vacate.", "NTA. You treated her more than fairly. Now you have to do what is best for your kids. It’s not your job to financially support her by giving her a free place to stay.", "NTA\n\nAnd i don't see why your niece is so upset. \n\nThe deal was nanny service for free housing and a wage. Even if she would keep living with you, stop working as the nanny you would charge her markt rate for rent anyway - so how is it different for her to which landlord she pays rent? Or did she expect to keep not only housing, but FREE housing? That would be very entitled. \n\nIf you have friends around who would be willing to rent her a room for cheap its oc nice to ask them. But she can't occupy the nanny room any longer if she isn't a nanny anymore. Or you can try to find a nanny at the campus nearby. Students often are awake studying long and if you raise the wage a little i'm sure you will find a student who will gladly take the job while keep living on campus. But i would still expect your niece to pay rent for continuing living with you. \n\nBut i guess your situation is just another example why you shouldn't mix family and business. Family becomes entitled very very fast...", "Well, damn, I'm sure that you, too, would prefer to be Rich Auntie Moneybags! I bet you'd love to let your niece stay in your house for free, but that's not feasible. You have children, a job, and a responsibility to look after your kids.\n\nYour sister and niece are being incredibly unreasonable. You had an employment offer, she took it, and it worked out for both of you. This was always a symbiotic relationship, not a grand favor. \n\n**NTA**", "NTA. The conditions were very clear. It sucks for your neice, but your kids needs come first. The spare bedroom is for the use of the Nanny. Period.", "NTA.   The free accommodation  came as part of her job as a nanny, and is now needed for her replacement since she isn’t going to be working for you anymore.    If she was working for anyone else there’d be no question of giving up all perks of employment when she quit.", "NTA, she moved in as a nanny and has now decided not to be a nanny\n\npossible nannies have all declined the fun and very late drive, so needs to be a live in", "Nta. Good for you for getting the lease agreement!", "NTA - you need the room for the nanny. Your niece is no longer going to be the nanny, therefore she moves out. It is not your problem that she will not have as much money.", "NTA,  the housing is tied to the employment.\n\nShe no longer wants the job, but wants to keep the free room? 😂😂.\n\nTry doing that with any other job with tied housing. I'm sure the military would just let you live rent free in their accommodation after you left the job.\n\n\nIt's time she joined the workd of being an adult. Of course your sister is going to side with her daughter  not your problem.", "Ask her to move out. No nanny will want to stay so late. But I don’t understand would t your niece come home after work so 5 or 6pm? Why wouldn’t the nanny not be able to leave like at 8pm?", "NTA and the arrangement was that she would be a live in nanny, not just get free rent while in school. Where's your brother in all this or is the SIL the only parent?  Obviously things would change at some point as she gets going in her career or has internships like she has. Her situation has changed so she needs to find a new place to live.", "Nta the room was hers on the condition she work for you, now you need it back. Nothing against your niece but she’s just being selfish and only looking at it from her poV", "NTA.  You have been beyond fair and your sister and niece are expecting you to subsidized her wants at the cost of you and your children's needs.", "NTA but the math is confusing me. \n\nYou were giving her a free place to live, which is a big chunk of change, AND you were paying her $22/h so over $600 a WEEK, even though for about 40% of the time the kids would be in bed?\n\nAnd now she and her mom think it's \"unfair\" that you don't house her kid for free while she gets paid elsewhere? What planet do these 2 live on exactly?", "NTA!   \nYour conditions were very reasonable and clear from the beginning, you need the room for the new nanny and she needs to accept this and find a new option that works for her", "NTA. Your house, you need to do what works for your closest family. Where is all the money she saved up/earned for 2 whole years? And her internship is payed for, so she has better footing than most. How entitled thinking she should just keep living there for her own benefit only.", "Nta", "NTA", "NTA - your niece wants to save at your expense.\n\nHelp her find accomodation.", "NTA. Free room and board + $22/hr is a very, very sweet deal. Now she wants free room and board in exchange for nothing? She’s your adult niece, not your minor child. Put yourself and your children first.", "NTA\n\nBut, may I suggest offering to let your niece stay if she starts paying rent? You could then pay the new (not live-in) nanny more money for the hassle of working late shifts. Plenty of people (yourself included) work odd hours.\n\nIt may be good for the kids to have the consistency of your niece being around, especially while they transition to a new nanny.  Good luck!", "You’re definitely NTA you need to make sure your children are taken care of. However, I’m just wondering if you need a nanny to stay till midnight. It’s just assuming your niece’s internship maintains regular office hours, she’d be home most likely between 6pm & 8pm, at which point she could relieve the nanny, allowing the other nanny to drive home at a decent hour. Since you live near the college she probably could even find one of her friends to take care of the kids between 3-7ish pm for a semester. Just an alternative to consider", "NTA. The room is predicated on providing nannying. No other thing to say.", "How long is the internship? Could you both go back to your previous arrangement after it's over?\n\nEither way NTA", "NTA this situation worked until it doesn’t. You are responsible for the children you gave birth to not your niece. It is not your responsibility to make her finances better because it’s convenient for her. \nIf you had not been related and hired her for the job would your SIL call her boss and demand that she continue to live there rent free, No because it would be completely ridiculous. So it is no different.", "NTA - That was the agreement you offered in the beginning, rent for babysitting plus hourly pay on top.  She can no longer babysit with this internship and you can no longer give her a room to live in.  You need that for another live-in.  What is so complicated for her on that?  Tell her you have a home and not a flophouse.", "No. You are NTA. It’s wonderful that your niece has all this going , but your children’s needs supersedes hers, and you have clearly stated live-in plus cash = nanny services on agreed upon days/times.", "NTA.. you were up front from day one. She nor her parents should expect you to choose her over what’s best for your children..", "NTA. Tell her that she will either have to pay rent, which in turn would go to a nanny's apartment nearby, or she has to leave, period. Tell her that if she doesn't leave by a certain date, you will have to evict her, and that she won't be able to find a place to rent with an eviction on her record. She can't have it both ways, where she is saving money or spending more on herself, while you have to struggle and ask others to sacrifice.\n\nThe room is for the nanny. She is being selfish, and not thinking about you, your kids, or your prospective nanny. I was also widowed when my kids were little, and finding decent, reliable child care is difficult and can be exhausting. She is making it harder on you to do your job as a mother.", "NTA.  But if your niece can still watch your kids on those three days from the time she gets home until 12:30am, the nanny, or babysitter really, can leave when niece arrives.   No need for there to be two adults in the house each capable of watching the kids.  In this scenario niece can stay.", "What hours would she he working at the internship??  Maybe nanny could work till niece gets back, then niece takes over and nanny can go home earlier??  Maybe nanny could just stay thru dinner...then she would not heed a room???  Just a thought", "NTA.\n\nYou've already done been extremely generous to her by giving her 2 years of free housing. Now that she's getting a paid job, it's perfectly reasonable for her to expect to pay for her own housing. She should be thanking you for your kindness instead of complaining that she can't continue to get free housing. Life doesn't work like that.\n\nBased on your SIL's response, would I be correct in assuming an \"apple doesn't fall far from the tree\" connection happening here?\n\nWith that said, if you are able to accommodate your niece, it would be nice of you to do so. But it's definitely not required. Ie if you have a basement and your niece would be willing to sleep down there, maybe y'all could make it work. I've slept in a sleeping bag in a friend's basement before, but that was only for a few days.", "NTA, but tread carefully.\n\nYou and your niece both had a live-in situation that worked well for both of you.  Since she's been there over two years, she has probably grown fond of you and the kids.  Respect that.\n\nCan your niece watch the kids AFTER she gets home from her internship?  You may only need child-care until 6 at night, for instance.  If that's the case, get a babysitter until your niece gets home from her internship.\n\nIf your niece is still going to be in the area, that seems like the most sensible solution to me.", "Absolutely NTA.  Your niece wants to have her cake and eat it too.  She was happy enough to live rent free and be paid for nannying, but as soon as she got a different deal for herself, she doesn't care how it impacts you.  \n\nShe needs to put on her big girl pants and live on her earnings and give you back your guest/nanny room.", "NAH.  No h of you have conflicting needs.  She sat your kids as a favour, but it was never part of her career plan.  She is young and probably should have had some conversations with you earlier in her search for an internship (or you/ her parents should have thought about what was potentially next for her too), but being young, never thought of it.\n\nAs an alternative, can't she pay rent and you use this to subsidize the cost of a non-live in nanny.  I know lost don't want to drive home that late, but surely there are others at her college that could use some cash (and maybe the \"sleep time\" as study time).\n\nSince no-one is being malicious, maybe just open a conversation and see what you can all do by putting your heads together.", "NAH\n\nYou have specific needs\n\nYour niece also has specific needs \n\nBut this will definitely ruin the relationship between you and her", "NAH. But in the end, your situation matters to you more than hers does. And she CAN afford an apartment. It's just less convenient, and she doesn't want to. Makes sense from her side, too. SIL can kick rocks. She's not putting out the money for her kid's room and board.", "YTA. Not for not being able to house her anymore when you need to hire a nanny, but I'll be honest, it sounds like you were never clear upfront on the fact you saw her as hired help who could only stay as long as she was in your employ and not a family member that you were housing as part of a favour exchange. I'm willing to bet she was expecting the conversation to go along the lines of \"I'm not available at those times anymore because I have an internship now\"-- \"Okay, how about instead of helping with the childcare, you help with XYZ or pay ABC boarding rent amount instead?\"", "Info.  Is your niece going to start paying rent? Also, our live in nanny was actually cheaper than a live out nanny. Is that the case where you are?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m a single mom to 2 kids (8 & 6). I work as a nurse. 3 days a week, I work 12 hour shifts (12 pm-12 am). After my husband passed, I needed a nanny to tend to my kids from the time they got off school (3 pm) onwards. I decided a live-in was the best choice. I have one guest bedroom. \n\nI live right near a university. Around this time, my niece had just gotten accepted. She wanted to save cost on dorms and offered to watch my kids those 3 days, if she could live there rent free. I agreed, and said I’d also pay her $22/hr (a competitive rate for our area). She’s done with her classes by 1, so it works out. She fixes them dinner and puts them to bed. Then she’s free to do whatever. But of course I pay her from 3 pm-12 am. It worked for 2 years. My niece never had any complaints.\n\nNow, however, my niece is getting an (paid) internship related to her major that starts in January. She wouldn’t be available to watch my kids. I congratulated her and said I could help her look into student housing or an apartment. We’d have 3 months to do this. She was confused. I said since I would need a live in and only have one guest room, she would have to move out. My niece got upset and said this isn’t fair, she won’t be able to save any money if she gets a dorm or an apartment (she could afford to live on her own, but wouldn’t have much savings). I pointed out that this would work best for me as I had to put my kids in aftercare the other 2 days I work (I get off around 5) and the nanny could just pick them up from  school vs them having to stay there so long.\n\nMy niece argued that the nanny could leave at the end of her shift but after speaking to some nannies, they understandably don’t want to drive home so late. Plus, I’m fine with the nanny (and my niece) sleeping after the kids do. So, there’s no sense in them sleeping then waking up and driving so drowsy. Even I feel nervous driving home so late, especially after my long shift. \n\nMy SIL (her mom) feels this is unfair to my niece but she moved in under the condition that she’d work as a nanny. My SIL and brother live 3 hours away, so niece couldn’t commute if she moved back in with them. They feel I should try to find a nanny who’d be willing to drive home at 12:30 AM (it’d take me a half hour minimum to get home), but all nannies I’ve spoken to have said no or expressed concern about their safety driving so late. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "She can either move out or pay rent.", "NTA. She should have been saving for the last 2 years.", "What are the niece’s hours? Could a nanny or babysitter get them after school and then the niece take over when she gets home?", "NTA.\nYou’re priority should be your life,not theirs.please don’t budge.you already have enough on your plate.you also need peace of mind.", "NTA.  It’s a life lesson for her.  She will have to really weigh the pros and cons.  I can see both sides of it but ultimately it’s your house and your call.", "NTA. The conditions of the deal have changed and you gotta do what you gotta do. Your niece got too comfortable and now expects handouts.  Not cool. Stay strong.", "NTA. That would burden you greatly. She sounds incredibly entitled wanting to make things harder for you because she wants to save money. I’m sure we all want to save money and live for free but that’s not how it works. What are you supposed to do for childcare if you let her freeload off of you? It would be unsafe for a nanny to drive that late. Your niece can afford to move out, she just doesn’t *want* to. Kick her out", "Nta she's quitting the nanny job. Why would she continue getting the benefits of the job?", "NTA conditions were clearly set from the beginning, she changed a condition that changes everything.. so yeah niece has to find some place else to live! your priority is your kids and what;s best for them.", "NTA. You need to prioritize your needs and your kids, not your niece’s savings account. Congrats on her internship, but the room is no longer available.", "NTA.  Your niece knew the deal when she took it.  Her reality changed, but your need for a nanny didn't.  Wish her well and move your new nanny in ASAP.", "NTA\n\nEven if you do find a nanny who is willing to drive home after, your niece shouldn’t expect free board. That was contingent on taking care of your kids. Maybe try scaring her with rent. Tell her you’ll need to charger market rate for her room starting when she stops nannying", "I don't understand - is this internship overnights? Because otherwise she should be available after work right?", "Nta. How on earth can she think she’s owed free rent?", "NTA, you moved her in on the agreement she can be a nanny, she can no longer do that, the agreement is over.", "NTA. It’s practically impossible to cater to both your live in niece and a nanny given the new circumstances. Your children take priority over the convenience for your niece. She made an agreement when she moved in. Part of being an adult is honouring commitments. \n\nYour sis and niece are not entitled to tell you how to use your space and your home.", "NTA. you’re not her mom, if she can’t figure this out herself as an adult, her mom needs to help. she’s not your kid, she’s not your responsibility.", "NTA. This was a business arrangement that is now concluding. You have nothing to feel guilty about.", "NAH. She’s understandably disappointed,  but she chose another job that will probably pay off more in the long run and college students are masters of cramming into cheap housing.", "NTA.\n\nShe moved in under conditions and when she broke those conditions she moves out. That’s not unfair, that’s life. She should have been saving up this whole time if that’s the worry she has. She didn’t pay rent for TWO YEARS!! She had a great deal living with you, I’m not surprised she doesn’t wanna lose it. But you have your life and family to think about too. It sucks but it’s what you have to do.", "Nta\n\nShe is no longer fulfilling her lease/contract.  It is not on you to have to find someone who will accommodate niece's wants.\n\nTell your SIL to pay her new rent.  Not your responsiblity.", "How the heck is this unfair to your niece?  I can see it is a bit inconvenient for her, but unfair???\n\nYour house, your kids, your work schedule.  You set the job requirements.  If your niece cannot fulfill them, she has to move out.  You only have one guest room.  You do not have to jump through hoops to accommodate this girl.  You have already found out the prospective nannies are not on board with the late hours driving home.", "NTA. You were clear in your needs and she is the one changing the terms so that’s on her.", "NTA. Your niece knew the deal when she moved in. It's a paid position with housing, not free housing where she can work or not as she chooses.", "NTA\nShe is quitting her job as a nanny, you need to find a replacement and you will need the room. \nHave you try contacting an aupair agency", "Nta. A deals a deal. End of story", "NTA. She was an employee who quit. She doesn’t get the benefits of being an employee after she quit. You need to be firm and give her a move out date.", "NTA. I can't understand your SIL and her logic. They are extremely entitled. You have an obligation to care for your kids, it is your highest priority as a parent. You could help your adult relative if you want and if you have means to do so. You don't.\n\nSo it is up to your SIL to help her daughter. For example to pay for her dorm, so she can save her money. \n\nYou are not putting the girl into dangerous and disadvantaged situation. The opposite, you gave he a very good deal, advantage compared to her peers, but now you have to take it back. And she needs to live/pay/save her money just like the most of students on the campus.\n\nBtw, you don't even need to explain them and convince her to move out. You can say that it is not working for you and she has to move out by ... I would look at the laws to see if you have to send her \"notification of lease ending\" letter or something. So they will not try to drag it. If they will - it can get ugly and it will take long time to evict her officially. \n\nAlso, talk to your brother, maybe he could talk to them and make it easier.", "NTA. Get a lawyer on it bc families love to sneak around agreements which would screw you and your kids over. They already put her savings over your needs and your next nanny‘s safety. So make sure they know your dead serious.", "NTA - It's not surprising that your niece and sister want to work out the best deal for her, but since you will incur a greater cost and hassle to let her stay, you should also charge rent.  If your sister wants to pay the rent, so be it.", "Nta", "NTA  \n\"She wanted to save cost on dorms and offered to watch my kids those 3 days, if she could live there rent free.\"  \nWhy would you continue to provide her with a place to live rent free?  She no longer offers the service that she offered in exchange for rent - and you pay her on top of that!! She had the best set up possible!!", "NTA.  If you had the space, it would be nice to let her stay and pay rent.  But you don't, and your niece's housing is not your responsibility; your nanny's housing is.", "NTA. The entitlement of some people is WILD.", "NTA. You had an agreement and she has decided to not be your nanny, which is her right. What’s not her right is to expect you to continue housing her when she’s not the nanny. You need that room for the next nanny. \n\nYou helped your niece, she helped you. Now she doesn’t want to help anymore. She made the decision, not you. You need to do what’s right for your family.", "You could charge her rent & also hire a nanny that will deal with driving home late at night. NTA though.", "NTA. She lived rent free at your house while attending school AND you paid her. Where the fuck has her money been going? Why hasn't she saved ANY money for her own place in years of having little bills and getting paid well for essentially a part time job? She's just upset because she assumed she could still take advantage of you since she's been there so long. She can figure it out.", "NTA. Your niece moved in under certain circumstances. She's the one opting to change them. They're better for her career/education choices, but with doing things for your career/adulting, that means actually having to think things through. She saved on money for rent and got paid to look after your children. She expects to continue saving on rent while forcing you to find other means to look after your children. The room was offered to whoever watches your children that live in there. She is no longer watching your children. It's not rocket science. She can be mad all she wants, but it's up to her if she wants to save money or not. And hey, adults don't often have savings anymore. Putting someone else at risk for her 'convenience' sounds like a selfish move and maybe she needs to not be coddled so much.", " NTA, I’m quitting my job but i still want health benefits.  🙄", "NTA..and tell your Niece, Sis, and BIL, that *this is what you are doing*-- getting a Nanny--and that it is *Non-negotiable!* Then reiterate that she has almost 3 months to find a place and that she better start looking now.", "NTA. You had an arrangement, and she can't modify  some parts and expect the rest to be unchanged. You need a live in nanny, if she chooses not to do so, then she's also choosing not to live in your home. Not your choice, hers.", "NTA. The deal was the deal.", "NTA\n\nYou have been very generous with her. Not only do you pay a VERY fair wage for the time she is with the kids, its also rent free. Its very reasonable that you want a live in nanny because your hours do make it difficult otherwise. \n\n&#x200B;\n\nHer family can pay for her dorm room if they have that much of an issue.", "Hang on, so you're going to look for a replacement live in nanny for 3 days a week of 3pm - midnight hours? 27 paid hours a week? Will they live with you the other 4 days? \n\nWouldn't it be easier to have your niece pay a little rent and find a non live-in nanny for those hours? Your niece says she doesn't want two jobs but would she be willing to 'cover' for the hours the kids are in bed? You could just need a nanny for 3-8/9pm 3 days a week.", "NTA- this is a pretty normal request and the idea that you are there to bankroll her is silly. You are not there to pay for her housing. You have children. You did a lot for her already. Free rent. Probably free food. And 22/hr was quite the excellent arrangement. \n\nShe should have been saving money that whole time. It's ridiculous tht anyone would expect you to bank roll her living expenses.", "NTA. I'm not sure why everyone's going on about lawyers and eviction. You have 3 months. Simply say you are sorry that you can't provide her with the room any longer now that her employment makes it impossible for her to hold up her end of the employment/housing agreement between the 2 of you and that she's got a three month window in order to find new housing...she might be upset and her mom too but that is their problem. You are trying to care for your kids and work as a single parent, and the care of your children takes precedent over the care of your sisters adult child who can afford an apt. Let her parents offer to pay some of her housing. That's their job. Just stand your ground and make sure they know you love them but won't stand for any nonsense. Also, hire a nanny asap and introduce her to your kids before moving her in. Use the three months to allow them to get to know eachother ect. It's stressful enough to hire a nanny, let alone a stranger moving in...last thing you need is this nonsense. All this get a lawyer stuff... I mean, that is some drastic stuff imo. The care of your children is way more important than worrying about anyone thinking you are an AH. Sorry for the ramble. 😀", "NTA. And if SIL keeps whining, threaten to send your kids to her and she can sort out childcare at her own expense. After all, since you're taking care of her daughter it's the least she can do.", "NTA. I was fully prepared with a Y T A but everything that you've done has been completely reasonable.\n\nYour niece is acting in an entitled manner which doesn't bode well for the next 3 months but at least you were smart enough to create a written lease to cover yourself.", "NTA.  You seem incredibly well organized, logical, and responsible.  All things come to an end at some point.  If the internship is a good one, she should want to move on anyway.  She had a great deal for two years and should focus on that.  It isn't your fault if she didn't save from all that time.", "She was confused.  🙄", "NTA", "NTA.  None of us can save.  She is lucky she can actually afford rent.\n\nThus is the world now, best she gets used to it now", "NTA.  Your family needs to really reflect on what they are asking.  Your niece is expecting to live at a place - for free - that she no longer works at.  Where in America can you do that??  Her 'rent free' was based on the nanny job she held, not on you just having space.\n\nShe has had no rent and earned an income for over 2 years - why does she not have any money saved up??\n\nYour family are that AHs here, not you.", "NTA. i mean the condition was clear. you need a live-in nanny, she took the job. now she quit. so she has to move out. there is no assholery involved. well until your SIL got on the case.", "NTA. It was great while it lasted, and now it’s time for everyone to move on.", "NTA BUT…what time does her internship end? If she could get there to relieve a nanny at a normal time, this could be great for everyone. She is getting paid and could contribute to groceries—still saving her rent and saving you money, and you could find a nanny that would be okay leaving at, say, 7?", "NTA. This was a mutually beneficial arrangement you both chose to enter into. She's no longer able to uphold her end of the bargain and now wants to just continue living there rent-free. That's not feasible.\n\nOf course her parents are on her side, she's their child.  Of course she'd rather stay there rent free vs paying her way. Neither of those things can be *your* primary focus.  You're looking to ensure your children are taken care of.\n\nDon't let them get you feeling guilty. It was a great arrangement until it wasn't.  Things change, time to adapt.\n\nNTA", "NTA - Your family is being ridiculous. Staying at the home is clearly dependent on working in the home as the Nanny. The room is for the Nanny. \n\nIs another option charging her rent that could be paid directly to the Nanny to try and find someone who would be willing to drive to/from, but for a higher wage? Or could it be used to provide a nightly cab?", "NTA. \n\nGive her verbal notice now and again 30 deys before the end of the agreement. Start interviewing nannies at least a month before the start date you need.", "NTA of course but can't she sleep on the couch or something or is there no space at all besides the spare bedroom? Just curious if there are options were she could stay and you get your nanny anyway.   \n\n\nBut yes a dorm is not that pricy and she should have saved up enough in 2 years.", "She saved up that money, but as she’ll be earning less at her internship, she won’t be able to save up as much.", "We have a lease agreement, which ends every 6 months for this reason. I knew there was a chance she may change her mind about living here. So legally, I’m protected and can choose to simply not renew the lease.", "I agree OP and their their had an agreement—room and board for nanny services. She cannot hold her room for her if her needs and kids needs aren’t being fulfilled", "If you need a lawyer to handle this, then you probably lack communication skills.", "No no. She gave her free rent *AND* paid her well. It was already super generous.", "[deleted]", "[removed]", "With zero rent/utilities and gross pay of $2600 per month for two years I have to wonder where TF her money went that she doesn’t already have a large chunk in savings to help cover the cost of a dorm or shared apartment with her new internship income.\n\nShe’s worried about building more savings While in school?  Most would just be deliriously happy to be a lot less in debt than anticipated after two years of invaluable help.", "Yeah it's not \"I'll be homeless if I can't stay here!\" It's \"I don't want to give up this incredible convenience of having free housing and being able to save money for two semesters!\"\n\nLike she can break even for a little before she goes off on her career. She got a massive head start being able to save what she has. Now that she can't hold up her end it's time to go.\n\nThe aunt isn't just doing it on principle either (though she would have every right). She's doing it because trying to make it work any other way is honestly untenable and the kid should be thanking her for what she got in the first place as it is a lot more than most would be willing to give.", "She has said that she doesn’t want to work 2 jobs, which is understandable.", "That’s asking the kids a lot in regard to trust and bonding. They need consistency.", "I have no way to accommodate her. That is the only spare room. My kids share a room (not because of this, they just prefer it), so it’s not like I can give my niece one of theirs. Not that I even would in this situation.", "She doesn’t want to do that. I respect not wanting to work 2 jobs on top of going to school. I also don’t want to hire multiple caregivers. I need one person to stay with my kids.", "She did know, though. This all came about because I was searching for a live-in. She told me she’d do it. I clarified that she understood she had to nanny those 3 days and that was the only reason I was letting her live there. She said yes.\n\nAlso, I don’t know if she’d be willing to pay rent, but just curious as to how that would solve the issue of me not having childcare as no nanny wants to drive home that late. Not being argumentative but this was never about money. It was about childcare.", "Niece is being asked to leave, so a live-in nanny can start in January, when her internship starts.", "She isn’t going to pay rent. \n\nLive-in isn’t any cheaper than live-out around here.", "No, I would need the nanny 5 days a week. As of right now, my niece couldn’t work all the hours (she has evening classes twice a week) so I put my kids in an after school program for the days that I don’t work nights. They’re not big on the program and it makes for a very long day at school. So, the nanny would pick them up those days as well and stay with them until I got home. Yes, they would still live there the other days. \n\nAnd no, my niece doesn’t want to be responsible for them. So, she can’t just “take over”.", "She doesn’t want to work 2 jobs on top of school.", "It's great that she saved the money she was paid, but this is exactly the reason why someone should have savings.", "That is even worse. She can move out but wants to instead have a free ride provided by you.", "That sounds like a her problem. You were quite clear about the residency terms:\n\n>she moved in under the condition that she’d work as a nanny\n\nAnd since your niece is choosing to break those terms, she must find new lodging. NTA.", ">She saved up that money, but as she’ll be earning less at her internship, she won’t be able to save up as much.\n\nOh, boo-fucking-hoo!  Being an adult is weighing the pros and cons of every decision and making the best one.  Better she learns this now than later.  Your sister needs to let her grow up.", "Think of it as a service to her even if she can't see it now ... it is a lesson in how the world works ! \n\nNTA.", "This type of situation is exactly why she saved!  She's taking a job that pays less but is better career-wise.", "But that is *NOT* your problem and that she can even save *any* money after moving into her own place, makes her much more fortunate then a lot of people! Tell her this is Non-negotiable and stick to it.", "You still likely have to give her a 30 day notice. If a lease expires, they are automatically month to month in most areas. If you want her to move, send her a certified letter with the notice.", "Get a lawyer anyway. You have to complete the eviction process to have a stubborn tenant or ex-tenant removed by law, wether they are not paying or the contract expired. What I'm saying is, if she decides to make things difficult, don't wait to get started on that process when you could instead start tomorrow.", "How long is her internship supposed to be? Just January break, the entire spring semester or longer? If it’s a short-term internship, I’m not sure it makes sense to have her move out if you only need a few weeks of childcare. She might even have a friend from school who’s staying on campus over break and could sub in for her. \n\nIf it’s a longer term commitment, it’s understandable that you need to find someone else.", "If she overstayed the lease, it could be months before you are able to remove her.", "you should inform her in writing of your intention to formally not renew the lease, regardless of your discussions up till this point", "Smart.", "*But* sometimes  getting someone out, even though their lease is up, takes an act of eviction through the courts. Time to get an eviction notice to keep on hand, just in case. Good luck 🍀", "Most people her age don't have much savings so that's really not a reason for her not to move out.\nYou were not only letting her stay there rent free but also paying her $22/hour. It's not your fault she didn't save up her wages.", "[deleted]", "Smart.", ">So legally, I’m protected and can choose to simply not renew the lease.\n\nYou should still talk to a lawyer. It seems like your niece is effectively subleasing from you, you may have legal requirements not to terminate your lease without giving YOUR tenant X days notice.", "NTA. I was initially thinking this would automatically be a case of you being TA but that’s far from the case here.\n\nShe moved in with you under the joint agreement that she’s getting paid to be there for child care and her housing is part of the agreement.\n\nYou have now specifically stated that you indeed have a drafted lease agreement which is due for review every 6 months.\n\nYou have given her 3 months notice to figure out her housing situation.\n\nShe no longer will be caring for your kids for the agreed rate (a more than reasonable amount of $22 an hour just to watch two kids) so as such she no longer meets the conditions set forth for her to remain with you.\n\nAsking someone else to commute at 12:30 am is ridiculous and I think you’re right to be concerned about the safety of anyone who you’re looking to hire. \n\nDo yourself a favor and don’t renew the lease and get a lawyer involved with the eviction process. Protect yourself OP.", "Depending on where you live, you may want to provide a written notice confirming you won't be renewing the lease", "That just means you're allowed to evict her, it doesn't actually do so. \n\nIn the US, if a person does not leave voluntarily at the end of a lease you still need to go through an eviction process. It's typically illegal to change the locks or take other steps towards removing them yourself.\n\nEvictions usually require a 30 day notice, although it depends on the jurisdiction. If you're not 100% confident she will leave voluntarily, service of this notice protects your ability to legally remove her.  Consult an attorney to find out what the requirements are where you live.", "If you consider that she got free full time housing as a benefit for her part time job, thats in fact a very good deal. \n\nI get a competitive and reasonable wage too, still my employer is not paying my rent additionaly or gives me other free housing. But it would in fact be a very great deal for me if they would.", "I agree that op doesn't need to be put on a pedestal for giving the niece a job but it still is a great double deal for a college student. Many college students would consider it a great deal to not have to pay rent at all for the price of babysitting 3 days a week, getting paid on top of that is definitely an added bonus given the circumstances. OP wasn't going above and beyond or anything by making this deal but it is still two good things for the niece", "Okay, you said 3 days a week in the original post. I don't know what the supply/demand is like for live in nannies and guessed it might not be an appealing gig for 27 hours paid work a week. But if that's not the case then yeah, maybe you need that room back.", "OP- one hundred percent this. She may dig in so you need to show formal steps of ending this living situation.", "It’s an entire semester, but if all goes well, she could get another internship come fall, with the same company or another. Summer, she’d be able to go back with her parents and not have to worry about bills.", "Who cares. She had two years of rent money she should have saved. Time to grow up and move on.", "[removed]", "NTA \nYou’re doing what’s best for you and your kids. Don’t allow anyone to gaslight you. You’re not the ahole.", "Yes, I already have.", "*sickening*", "OP can't find anyone else to do the job without the housing, you might notice.", "Live in nannies always get housing as part of their salary. She's also doing three 9 hour shifts a week, including late at night, without any breaks.", "I mean it's great she didn't take advantage of niece, who didn't know her worth, but most nannies aren't college educated. I just resist normalizing taking advantage of family. 🤷", "I have nannies interested so it won’t be an issue :)", "NTA, Her parents are her support structure, and as it is a matter of 1-2 years, it should not be that difficult to manage between them. As you have kids to look after whose priority is first, it is not your lookout", "Have you considered or talked in depth her schedule? If she can get them by 5pm from day care there wouldn't be a need to move out.\n\nOr even just child care till she gets home at 7-9pm? You could ask her to cover half the cost of the babysitter (A much better deal for both of you financially) and you have a trusted family member when the kids are going to bed.", "NTA, but maybe give her a grace period during this internship?\n\nIf you have her move out, then she'll never come back to nanny for you, but if you let her stay through her internship, maybe you charge a small amount of rent for the room and let her know that her lease will end X months after her internship unless she is able to nanny again.", "Two years of free rent PLUS $22/hr for the babysitting.", "More entitled, then anything!", "OP says that she's happy for niece to sleep when the kids do. I doubt the kids will be awake after 9pm so technically its about 6 hours 3 times a week", "I think that's a fair point (not sure about the most nannies statistic but hey, I'm not gonna Google it so I may as well believe you) but I don't think anyone is trying to normalize taking advantage of family in this thread. In fact the original post is about op not wanting to get taken advantage of by their family and I hope we all think that op is in the right for that.", "How was I taking advantage of my niece?", "She doesn’t plan to come back and nanny for me; though. She plans on working internships as building blocks for her future career.", "And how is that going to work? Is the nanny she *has* to hire supposed to live in the living room? Sleep on the couch? What?\n\nOP has exactly one extra bedroom which is needed by THE NANNY. If the niece is not going to be the nanny, she needs to vacate the bedroom so the person that is the nanny has a place to sleep.", "And do what with her kids during this \"grace period\", exactly? OP said other nannies aren't interested if the position isn't live-in. \n\nNiece is spreading her wings and focusing on what's right for her, including internships. That's right and proper, and also comes with some drawbacks, such as having to pay for housing. Nothing wrong with that.", "I repeat, OP cannot find anyone else to do it for less.", "You weren't! Can no one read?", "But she isn't looking for someone to do it for less??? She'll pay the same rate and give housing to the new nanny which is why niece needs to leave", "Niece absolutely needs to leave! She's not doing the job anymore. I'm just arguing against the theory that OP is in any way giving her more than a job.", "NTA, the niece is just young and upset.  I don't blame her for wishing she could carry on rent free with a family member but that wasn't the agreement.  She probably just needs extra time to process because she's young, and young people are impulsive about their feelings.  As for the adults in her life, I understand why they are hoping for a different outcome but if they are mad or upset, thats kind of crazy.", "She won't be able to save as much? AS MUCH?\n\nShe was able to save for two years AS A COLLEGE STUDENT. She will still be in the black with this new position. She has absolutely no standing to complain.\n\nIf you quit your job for a lower-paying position because it serves your career, saving less money is the trade-off .\n\nWelcome to arithmetic.", "You don't \"need\" to do shit. \n\nYou are not responsible for providing your niece free housing. You are obligated to provide your kids with childcare in a way that works for you practically and financially.\n\nHer parents can supplement the cost of her renting a place if they're so concerned about her getting to save up money. Or SHE can find you a nanny who can do the late night arrangement AND your niece can start paying you some rent. If they want this convenient arrangement to continue they can be the one's bending over backwards. They have no right to demand you do so for them. Choosing beggars and all. \n\nPersonally, I think it's time to move her out either way as she seems to have a fundamental misunderstanding of your role in her life. \n\nI would inform her that if she doesn't move out by agreed upon date you will move forward with a formal eviction process which will be on her permanent record and will cause her problems renting elsewhere in the future as that goes into the public record and she legally has to disclose it if asked on a rental form.", "NTA\n\n> she won’t be able to save any money if she gets a dorm or an apartment \n\nSo what?", "So she basically wants you to struggle to find a nanny because her spoiled ass wants to save more money? Don’t we all.. she sounds like an entitled little brat and her parents reaction speaks volumes as to where she got it from. You had an agreement when she moved in, and now she’s changing her mind. Well so are you. Fair is fair.", "Gah dayum", "Too bad you aren't near me. I can drive at 1230 no problem.", "NTA\n\nTell them you tried and failed to find someone.\n\nYour niece's bank account is not your responsibility, a suitable situation for you and your kids is.", "NTA. You’ve helped her save up and now she’s feeling what it’s like to not have as much of a budget surplus. College kids being able to save money isn’t very normal or necessary.", "Oh boo hoo! She won’t be able to save much. Welcome to the real world! Most of us are barely scraping by. She agreed to your terms. If her circumstances changed, that’s on her. I’m not sure why young adults feel they still need to be coddled until they have things just how they want them. That’s not how the world works unless you’re ridiculously wealthy.\nNTA", "Damn, you’ve been paying this girl $600 a week plus providing her with free room and board for two years - no wonder she doesn’t want to give up that sweet deal! You’re absolutely NTA. Now that she is not going to be doing the work, she no longer gets the deal. Get something in writing and get that girl gone!", "NTA at all. The arrangement was made with conditions.  The conditions have changed.", "NTA. You had an agreement. The agreement will no longer serve you and your family. You cannot accommodate her and your nanny to which all parties (her and her parents) were fully aware of this. So she has 3 months to find a solution.", "So her mum thinks it’s ok for her daughter to take advantage of her single widowed aunt? Where is her sense of family support? \n\nI’d go to my brother and ask him why the burden of caring for his adult daughter sits with you. Why you have to add extra stress into to your live to navigate a new situation which does not benefit you or your children just to ease the burdens of his daughter. \n\nLife’s tough. It’s time your Neice learns this. She moved in to perform a paid role. She is no longer able to do the job she was hired for. The room is for a nanny. She is not the nanny anymore therefore it is not her room. \n\nNTA.", "Nta. You were clear with her, she has just gotten entitled after settling in with the situation.", "NTA. Niece needs to understand that not having much savings is part of early adulting. She has had a sweet deal with you for a couple of years. Now that she doesn't want to participate in what was part of that deal, it is time for her to adult for real.", "Nta there were specific conditions when she moved in, that's why you allowed it. Why should you let her live there totally free?", "Absolutely NTA. You gave her a free place to stay in exchange for a specific service. You will need someone else to provide that service and that includes making your guest room available.", "NTA She assumes she can change the deal from mutually beneficial to all to her benefit. Not OK.", "NTA, she stopped fulfilling her part of the agreement (babysitting in exchange for free accommodation and some money), and you need the room.\n\nHow entitled is your SIL that she does not realize that?", "NTA. How did your niece/her parents expect to arrange for housing when she accepted going to university? \n\nYour child's care is less important than your SIL's child care?", "NTA", "NTA. She says it's not fair for her but in what way is her plan fair for you? She's not taking care of your kids, not paying rent, and even if she was your kids aren't getting the care they need if she stayed. Maybe frame it as whether her current situation is fair to you and your kids. Especially to your SiL", "NTA - the deal was free board for nannying duties. She is no longer providing nannying duties so no free board - out she goes.", "Nta. \n\n>I said since I would need a live in and only have one guest room, she would have to move out. My niece got upset and said this isn’t fair, she won’t be able to save any money if she gets a dorm or an apartment\n\nIt is fair. She got free housing plus 2k a month for 2 years. She should have been saving some of that. She knew that there was 1 room and it was for the nanny. Your kids are still too young to be by themselves, so she will need to vacate the space since she no longer can/wants to be their nanny.\n\n If your SIL doesn't think her daughter should pay for housing, then she should pay herself. It's funny that your SIL is so worried about her adult daughters wants but so dismissive of her niblings' needs.", "This is an obvious NTA, not even sure why you needed to post it here, really.\n\nYou made it clear that living with you was part of her compensation package for working as a nanny. You helped support her decision of doing internships rather than nannying by offering to help her figure out housing. She is being entitled at this point. Good on you for sticking to your guns and drafting the proper letters up to do it all legally to CYA.", "NTA.\n\nIt's a difficult situation, but you're not kicking her out for any personal reason. You need the room, and the agreement under which she moved in included her taking care of your kids. Why are you expected to make more accommodations, after already letting her live there for free?", "No.  She had a sweetheart deal and doesn’t like the real world slapping her in the face now.  You should have a clear conscience.", "NTA at all. You provided conditions for living with you and she’s no longer able to meet those conditions. You’re doing her a favor; not the other way around. You’re paying her letting her stay with you. It’s time for her to take out a student loan to pay for room and board on campus like most students 🤷🏼‍♀️", "You don't \"save\" money during college...she was paid well, free rent for 2 years. You need the room for the new nanny\n\nNta", "Wait she still wanted to stay rent free but not provide the service that was a stipulation of living there rent free? Do i got that?\n\nNTA the gall. This was a 'you scratch my back ill scratch yours' kinda deal. But she now wants all the perks without having to do anything. Cheeky bugger", "NTA. Quick idea/question….Would she be open to perhaps looking after the kids when the internship finishes for the day? Then she could stay in the house and the nanny would be relieved earlier?", "NTA. The room goes with the job. End of", "Your SIL can definitely pay the nanny note if she wants to. That bill is going to be there for you. Meanwhile you're taking all the expense. Why don't they pay her rent? NTA they are taking advantage of you.", "NTA. You had a system that worked with your niece and she wants to change it to something that doesn’t.  Obviously it has to work for you both. Your niece is learning a tough lesson but she wants to stop being a nanny and you need one.", "NTA. Her situation has changed. Yours has not. You are not obligated to change your situation to meet her needs - just as you have not asked her to change her situation (i.e., refuse internship) to meet your needs. \n\nThis is a good opportunity to learn important life skills:  how to weigh options, make a decision, and live with/learn from the consequences.", "NTA\n\nIt's not a negotiation. You have a specific need. It's that simple.", "Wow, that's some entitlement. You are not obligated to give your niece a free place to live just because she's your niece. You need a live in nanny, period. Bye bye niece.", "NTA. This is a legitimate logistics concern. You don’t have the space even if you wanted to let her stay. I’m all for helping family when you can, but if the terms of your agreement change and she’s no longer performing the job of a live-nanny, you need to fill that role with another person, who will need the room she currently occupies to be said live-in.", "You've been incredibly generous to date. What did she do with the money you paid her plus her savings from not having had to rent? NTA and it's a shame they are not being more supportive of a single Mom.", "NTA. Don’t hire family next time though.", "NTA, your niece seems to think that \nA) her ability to save money is your responsibility \nB) her room/board was not part of her compensation.", "Nta. Your niece had an employment contract which provided room board and a wage. She's decided the employment is not something she will continue now that she has graduated. She doesn't get to keep the benefits of the employment  nor does she get to dictate to you who you should hire next based on her desires. She  can either continue her employment with you or move out. Her expenses are her issues and something she should have planned ahead. You were paying her generously well and not charging her rent she should have banked that. And she can cut her living exoenses thru student housing or having roommates. she can work a 2nd parttime job.or  If she wanted rentfree maybe she should apply for jobs near her mommy sonshe can live there. Your responsibility is to your underage children not to your adult niece", "NTA. This isn’t your problem & your niece &  sister are idiots for thinking she would just get to stay there rent free without contributing somehow. How is that any fair to you?", "NTA. This was what your niece agreed to and she had two years to save some money. She also has 3 months to figure out living arrangements with your help, if she chooses. \n\nYour childcare situation trumps her living situation here.", "NTA she was offered the room under the condition that she nanny the kids, so obviously it’s fair to ask her to move if she’s no longer willing or able to nanny them.", "NTA \n\nThe arrangement no longer works for you.  You need a new nanny and due to your hours you need one who can stay nights in your home.  Unfortunately for your niece this means her free ride (rent) is over", "NTA. You need someone to look after your kids. She can no longer do that and now you need to hire someone else to live in and take care of them.", "NTA. The room is for the nanny, a job she will no longer be working. If you actually had another spare bedroom then perhaps things could be different but you don't. No nanny wants to drive home from a shift between 12:30am and 1am 3 days a week without a bump in pay.", "NTA - self-absorbed people make me laugh. You need the room for childcare. Bye Felicia!  Good luck in life!", "NTA\n\nYou are handling this very well. I get why she’s disappointed, but you have to think of your kids first", "NTA. You held up your end of the bargain. Your niece needs to hold up hers or move out. If she stayed, she should be paying rent.", "NTA and 3 months notice is plenty of notice. At the end of the day, it's your house.", "NTA.  Tell her that if she isn't going to be your nanny but still wants the room, then she will have to pay you rent equal to what you will have to pay for a nanny to live close enough not to worry about driving home late, or equal to rent at a nearby apartment.  Once she knows it's no longer a free arrangement, she'll be happy enough to move out.", "NTA.  Your niece got room, board and wages. Now she's not available to work anymore and you need her space for another nanny.  Kudos on getting a lease in anticipation of this situation occurring.", "NTA\nThere was conditions to your niece moving in and she can't meet thise conditions any longer so she can't have the room.  You were very generous to pay her so well, while also giving her room and board. Hire your nanny to start and give niece a moving out date.", "NTA. If your niece can no longer work as your nanny, she needs to move out so you can find another. \n\nOf course your niece does not want this sweet deal to end, but it is not your obligation to see that she has plenty of spending money in her pocket. If your sister feels that strongly about it, SHE can be the one to start setting aside savings for HER daughter.", "NTA…You both helped each other for two years. If she needs to find a dorm room or an apartment, her parents now need to do their part. Plus she was paid a nice wage for the time she’s been with you.", "NTA.\n\nImmediately adopt a new practice, and that's how you refer to the bedroom your niece has resided in for two (2) years:\n\nEMPLOYEE HOUSING.\n\nYou do not have a guest bedroom. She isn't a guest.  She was / is a part time intermittent EMPLOYEE and her lease agreement was for EMPLOYEE HOUSING.\n\nOnce she's no longer an employee, the employee housing is no longer available, as it's intended for the next EMPLOYEE -- the new nanny.\n\nStop calling it a guest room or \"the spare room\" right away, and give it the proper title and description, and stick to your guns.  You need the housing for your next employee.  Period.", "NTA, the arrangement has changed and she is the one changing it.", "In what universe is this \"not fair\"??\n\nNTA.", "NTA.\n\nWith free room you were already paying her insanely with the $22/hr without her having to pay rent. Now she wants free rent and not to do the job? \n\nYou're effectively subsidising her massively and she doesnt' want that to end, but that subsidising of her was due to her working as a nanny. She already got a very very generous deal and now she wants a insane deal for free.", "NTA. You need what you need. You need that room for a live-in nanny. You're not obliged to provide a room for your niece.", "nta, she moved in because she was going to watch your kids.  now she wants to stop watching your kids so, that's on her.", "NTA", "NTA she cannot do the role she has had to be living with you and 3 months is enough time to find an accommodation, she can’t expect to just keep saving money living with you", "NTA and she sounds super entitled to expect to live there for free and not help like I get she will be busy but that’s exactly why you need to find a REPLACEMENT like wtf", "NTA. It's not unfair at all; it's just inconvenient for your niece. If you worked days it would be different since the nanny could drive home at a reasonable hour.", "NTA.  She lived rent-free for two years and got paid to nanny. She should be able to afford housing with money saved, plus it's unfair for her to think her housing is your problem. Housing is for the nanny, which she will no longer be. Tell her she'll have to pay rent equal to or higher than what is available in the area because you're going to have an increase in expenses. Your children are your priority, not her housing.", "NTA\nI would say that you did her a huge favour letting her live rent free and having a steady income without leaving house. She needs to grow up and understand that people won’t always bend to her will. I know it’s sounds weird, but she should grateful for having easy 2 years. \nGet yourself a lawyer just in case. Some humans are unpredictable, especially family.", "NTA. This caregiving arrangement has housing baked in for a reason: OP’s work hours. That said, I am curious about how OP’s colleagues who are parents handle their childcare needs when faced with the noon-midnight shift clock.", "NTA, you had a written contract with her.  Any other nanny will save you on after school care for the other days.  Talk to a lawyer and take the proper legal actions.", "What exactly is unfair about this?  Niece moved in knowing the arrangement was free room for childcare.   This worked good for her while taking courses. Now as her life develops and she is closer to Graduating she wants to take the internship. This is great for her career and future.  However she needs to quit the childcare for room job to do so.  What exactly is she expecting here?  To quit the childcare but keep the free room?  How is that fair to you or your kids?  And that wouldn’t be “fair” for niece, it would be a super sweet deal if you could swing it.  But you’re in no way responsible to do that and I can’t figure out why they would even expect it. \nNTA", "NTA \n\nentitled relatives are a pain", " NTA. Your children trump your niece. Your niece and her parents gave a right to feel disappointed but they need to learn to accept your decision.  Your niece has had 2 years to save her money with her rent free life and wages that you paid her. \n\n\nI wonder if she reported her income for tax purposes.", "NTA - She lived in the room because she agreed to watch the kids and she was getting paid for that, too. Once she is no longer watching the kids the agreement changed and she's got to go. Even if you could find a nanny that would leave once you got home, you are not obligated to let your niece live at your house. Her parents should help her as she is their responsibility and not yours.", "NTA. Your kids and yourself come first. You don’t have someone to go stay with if you can’t pay your bills.", "when she came to stay with you there was an understanding she was the full time nanny, so I don't understand why she is upset.  She is looking at things from her viewpoint, but you also have to do things from your viewpoint, so you shouldn't feel bad about asking for your room.", "NTA but do talk to a lawyer and make sure all your ducka are in a row", "This whole \"isn't fair\" shit is so weird. What do they think that word means? Her getting free housing is what wouldn't be fair, her blocking you from having the help that you need isn't fair. She's an adult, she needs to provide for herself, including her housing. The way most people do that is by earning money or in-kind payments. Time for her to grow up. \n\nNTA", "NTA. You have been more than reasonable. You have paid her well, and provided 2 years room and board. \n\nShe moved in as a nanny. She is no longer a nanny.  Time to move on.", "NTA. She needs to sort herself out. She and your SIL are acting super selfish.", "This is going to get messy, I hope you have a lawyer on retainer. She is not going to want to leave and you may have to evict her. \n\nAlso, Christmas is going to be awkward. She has a cushy situation and does not want to give up the free place to live.  \n\nIf your SIL thinks it is so unfair then she can pay her daughter's rent near school.", "NTA. She no longer can nanny your kids and it’s outrageous that she still expects you to house her while ignoring that she was only there to take care of your kids. Her housing is now up to her and her parents to figure out.", "NTA you had an agreement, she cannot uphold her side of it anymore, so she needs to find alternative housing.", "NTA. Niece and sister sound insufferable.", "NTA 3 months is plenty of time to find housing. If she didn’t pay rent, you e already been very generous", "NTA - You had a deal with your neice.  Now that she is breaking teh deal, her free rent no longer applies.", "NTA. You had an agreement and it is no longer viable.", "Dont let SIL and bro guilt you into prioritizing their kid over yours. Tell them if your husband was alive you’d be glad to help your niece but since he isnt you need that room for the nanny.\n\n\nEven if you could find a nanny willing to drive home at 12:30 that means you can never stop for milk, gas, etc on the way home. No need for the extra pressure. \n\n\nAnd then your niece’s stay will increase. What if they offer her a job after college? I doubt she’ll want to move back home. \n\n\nThey are doing what is best for them. You need to do what os best for you and your family. And that is a live-in nanny. Let SIL and bro pay out of pocket a bit. Why didnt they save more for her etc. Eyes on the prize mama. And im sorry for your loss.", "Your niece is being incredibly selfish, along with her parents. You need a live in nanny. Your niece is no longer your nanny. The new nanny will need the room your niece is staying in. Your niece has to move out. That is the end of the story for all involved.", "NTA. You are a great auntie and she had plenty of time to save up. She knew that living with you was conditional.", "NTA. You had an agreement and it is no longer viable.", "NTA. The situation has changed and there shouldn't be any hard feelings. Did she expect to stay forever?", "NTA. Entitled jerks. Where’s your brother in all of this?", "NTA. She had a fantastic deal for two years. It wasn't a gift , it was a mutually beneficial agreement. If the internship is for a couple months, sure you could maybe have short term nanny arrangement to help your niece keep the room but this sounds like it will be an ongoing thing. You don't owe her anything.", "NTA. that’s not your kid and she was “hired” as a live in nanny. if she’s no longer “working” she has no right to stay there. you need to put yourself and your children first. that like quitting a job at a restaurant but still demanding free food😭 yeah it sucks for her but overall you need to do what you need to do for your family.", "Your neice is an adult and renting is an adult thing. She wont be free to do what was agreed, so its time for her to move on. Why should she get to live rent free?  Expecially since you need that room for another nanny.", "*offered to watch my kids those 3 days, if she could live there rent free. I agreed, and said I’d also pay her $22/hr (a competitive rate for our area).*\n\n**She got paid a competitive rate, and room and board.**\n\n*My SIL (her mom) feels this is unfair to my niece but she moved in under the condition that she’d work as a nanny.* \n\nNTA.  You were clear what you needed, and what you were offering.  You weren't offering free room and board, but a job.  Niece isn't going to be doing the job, so the perks of the job will be gone, too.  Reasonable.  Predictable.  \n\nYou need another person to do the job, with the same offer.  Also reasonable.  \n\nNiece needs to adult here, and apply logic to the situation.    Niece's mother needs to let her daughter be an adult, accountable, responsible, and handle her own issues.  This isn't SIL's business.", "Say to your niece welcome to the real world. You have no obligation to provide for her ( niece ). You need to look after yourself and your needs and she can look out for herself.", "She needs to grow up and realize she put in her resignation and will loose all the benefits she had. Too bad she didn’t save when she lived with you for 2 years!  You looked at this situation as a business deal and she looked at it as Aunties taking care of me too!  Tell her mom that you love ____ however she has resigned and you have to hire someone new and the benefits will now go to that person. Sorry sis. It’s just business", "NTA. The housing was part of the job. She’ll no longer be doing the job. End.", "NTA. Your niece knew the room and pay was for a live-in nanny. She needs a reality check. She doesn't HAVE to take the internship if she'd rather keep her current position. 🤷‍♀️", "NTA. She moved in to help with the kids. You’ll need the space for the next person you hire, it’s not a hard concept.", "Nta, your a job, not a freebie.", "Why don’t you put the kids in after school club it’s free and most finish at 5", "NTA for sure, 100%.\n\nThis is just typical family bullshit where folks think they can take advantage of relatives with disposable income.   You were giving her free rent & 22 bucks an hour,  for a college kid that's great. \n\nShe should be looking to move on anyhow, if she is doing a paid internship.  Get a APT with other interns and focus on her next phase in life... I don't understand where folks like this get the entitlement. \n\nAlso, OP - Just a note, you really have you shit together and plan for today but with an eye for tomorrow (based on some of the comments), I salute you for that.   Too few folks don't want to deal with the hassle of looking just a few months down the road.", "Nta. Why on earth she would expect anything different?", "No. you laid out what was a reasonable terms, ad your niece could have said no. Evict her.", "NTA. Your SIL needs to get a grip. Sounds like everyone knew the ground rules prior to her moving in. She hasn’t had to pay bills in 2 years, so if she didn’t save her pay for the last 24 months, who’s fault is that? Certainly not yours! They sound like entitled brats. Get some legal paperwork done & find yourself a new nanny and don’t forget to do a thorough background check! Good luck. Dealing w/family in times like this, sucks!", "Wait she wants a rent free room without helping you in return?", "Offer her the couch?", "NTA. The room came with the job. She leaves the job, she leaves the room. Seems pretty evident. Your niece and her parents are being selfish and have no right to limit your choice of nannies to those willing to drive late at night. Geez.\n\nI’m very sorry for your loss.", "NTA.\n\nIt is simply an incompatibility issues now. Niece understood that her stay was conditional with the duties she performed.   \n\n\nSIL and brother need to help their child find accommodations. She's been able to save on her living situation for the last two years, that should count for something.", "NTA. Having Just the one guest room and needing it to offer a prospective Nanny a safe and attractive arrangement, is the best and only and most valid reason to evict your niece. If you had two potential guest rooms, you could arguably be expected to continue to house Niece for VERY cheap rent as a favor to her \"because faaamily\", but your housing situation is not Like that and your SIL is DEEPLY unreasonable for demanding you severely inconvenience yourself and Hurt your chances of finding childcare at all, Just so their daughter can continue to enjoy a privilege (free housing) that Most College students never get.", "You were more than generous with your niece - paying her well on top of housing. She's awfully entitled thinking she can stay with you as long as she wants, even if it affects your child care. It's sad for her, but she doesn't have a right to live with you for as long as she wants. Your family's needs come first (your kids).", "Absolutely NTAH. Your niece is not your responsibility to accommodate. You had an agreement that worked for 2yrs but no longer works for you and your family. It’s completely unacceptable for anyone to expect you to make your life more difficult than it needs to be. Stand your ground, she’s an adult not your child to house. It also appears that you were more than generous providing both room, board and an income for what was essentially a fairly easy job with significant time off. While I can see why she would not want to give that up it’s not in your best interests that she’s worried about, it’s hers.", "NTA", "Nta", "NTA this is your house and your rules and what you know is best for your family. Don’t let them try to sway you.", "NTA. I'm not sure how she thought she had a room in your with no limits, when she had an *actual lease* that specified both conditions and an end date.", "NTA. You are within your rights. You had an agreement that she no longer wants to uphold. You have your own needs to consider.", "NTA. You had a business agreement that is separate from your personal relationship. The business agreement is ending.\n\nIt ends there. \n\nHer parents can \"help her save money\" but honestly, this reason is losing merit since the majority of people can't save money right now. \n\nShe is an adult & part of that is making choices about her future. This is one of them.\n\nGood luck finding a nanny-hope it's a quick turn around time for you!\n\n(NTA)", "NTA. It sounds like the arrangement was clear. She no longer wants to Nanny, so she will have to give up the Nanny flat.", "NTA. The deal was free rent and a generous hourly rate alongside it for her to be a nanny. The accommodation came with the job. Time she learned about contract law. As for the fAmiLy argument: she was family when she also took your money along with the rent-free accommodation. Family didn’t seem so important to her then, did it?\n\nYou don’t owe your niece anything. You owe your kids.", "Charging her rent instead is not an option?", "It is your decision but I don't understand why you need a live-in when they only need to be there from 3pm to 12:30am 3 days a week?\n\nHer expecting to live there rent free was a bit ridiculous as well.", "NAH. You both allowed her to live there free and compensated her generously. She has benefitted a lot. How much would she have made if your weren't paying her? How much would she have paid in rent? \n\nYou've done plenty. Her and her parent's are being very entitled/greedy.", "NTA\n\nCan she couch it while not providing nanny services?  If it’s just for a semester, maybe you could have the nanny for that long and then switch back to your original arrangement?  She could pay you a reduced rent rate basically to cover expenses such as food etc", "NTA but I can feel the sting on your niece. It feels abrupt but you've got to put your kids first. Hopefully you both can resolve this without any serious damage", "NTA, but.... I find it odd that the prospective nannies are concerned about the drive. A significant portion of the work force has to drive home late.  Bar Workers, Late shift at hotels/motels. Fast food workers. They all have shifts that end late into the evening or past midnight. Maybe nanny's are kinda soft if they worry about driving at night. I worked  8pm-4am at a warehouse and never had a problem as I adjusted my sleep schedule accordingly.", "Could you work 6-6 instead of 12-12? That way your kids can do the after school program at their school and you pick them up when you get off", "It's cruel, but it's perfectly in the terms of what you two decided at the beginning.\n\nI would still look at different options (carve a temporary guest room for niece somewhere? Idk) before giving her notice and making her leave.", "Jesus christ what is it with you leftists and just having the most miserable, greedy, untrustworthy people as your \"family\"? I can't relate to this shit at all", "NAH - I can see why OP needs a live in nanny and why her niece would like to stay. There is a work around but it would mean talking it and finding daycare for a bit. Niece should understand that OP needs a reliable nanny however. The kids come first.", "Technically NTA.\n\nBut I mean, maybe try to work something out?", "NTA legally but man what a shitty way to treat a family member you ostensibly care about.", "NAH - Neither of you have done anything wrong. The new arrangement just doesn’t work for you, so she needs to move out. Not personal. Just reality.", "So you’re punishing your niece for moving ahead in her career? For most careers, you need an internship to even get an entry level job after graduation. Not only that but do you even know how expensive rent is now? I make a little over $22/hr and I can barely afford my rent as it is. Plus, I was on a waitlist for six different complexes in my area for nearly a year before I was accepted. Plus, she will need PROOF of solid income that is two to three times the cost of rent AND an amazing credit score. Unless she wants to live in the dangerous parts of town. And seeing as how you love somewhere with a hospital and a college nearby, I’m sure there’s a lot of bad areas. YTA a thousand times over. In your own words, there were no issues for two years. You don’t “need” a live-in, you’d just prefer it. In college, I babysat and nannied well past 1:30 AM and still was able to drive home.", "Info: how long is the internship? \n If it’s a few months and then she goes back to school you could put them in the aftercare and your niece could pick them up around 5 like you do the other days (assuming she got a 9-5 job).  Kids are usually happy to be at these kind of place because they can play with friends there.  It would also eliminate the need for your niece to find a temporary place to live and let her save more money, while being convenient for you because you wouldn’t need to worry about a new person living in your house.", "INFO: When would your niece be getting home from her internship on the 2 days you need someone for the kids? Couldn't she take over from the babysitter/nanny when she gets home then?", "NAH. She absolutely needs to take the internships. They are the best professional decision for her. And you absolutely need a nanny who can stay with the kids on those nights. You are paying well, and deserve reliable care for your kids. Good luck to you both.", "Yta and good luck because a good nanny will want to know why your last nanny left and they won't let $22 slide. You'll lose more in the end.", "[deleted]", "YTA, she is family and as soon as she tried to go after her dream instead of helping you live yours you kicked her the fuck out... people like you end up alone because you're selfish and cold.", "NAH. But I'm not sure you're thinking this one through. You're considering sharing your home with a stranger. You are opening yourself up to all kinds of risks. And if your new caregiver doesn't work out, you will be stuck with no one. Talk this all through with your SIL. See if your niece will babysit those three nights and hire a sitter to fill in the gap.", "ESH. You and your neice both should have discussed this possible outcome and planned accordingly. If anyone *might* be TA it’s you, because you have entirely set the constraints of the agreement, which in the broad light of day is a business agreement. But your neice is an adult, and failed in her due diligence. I hope you can both admit to each other that you dropped the ball, and part on good terms.", "22 an hour?  Yeah that's trash pay. Good luck trying to find a new nanny.  As for your niece moving out.  It's for the best, once she realizes what garbage pay that was.", ">My SIL (her mom) feels this is unfair to my niece but she moved in under the condition that she’d work as a nanny\n\n\"My niece isn’t interested in nannying at all going forward and will instead be pursuing internships.\"\n\nI'd think this is enough.", "Yeah. She had a dream deal for a college student. Getting paid $600+ a week for three fairly easy afternoons/evenings plus free rent. Not to mention you get to study while still on the clock after you put the kids to bed and even paid for a few hours of sleeping per week. I assume OP also paid for her dinners those three nights, and she may even have been paying her under the table so it would all be profit. Most college students would kill for a job like that.\n\nEdited: removed repeated word", "This.\n\nNot only is OP NTA, but the nieces parents are huge AHs. If they want their daughter to save money so badly, THEY can pay for her rent while she completes her internship. If they don't think that solution is reasonable, why in the world would they think her staying with OP is reasonable?", "Nailed it", "This is unhinged. \"Go for the jugular\"?? Grow up. \n\nAssuming OP doesn't want to end her relationship with her sibling and niece, this is just awful advice.", "Even if she can find a nanny to do that, it's still inconvenient to have the nanny and the niece around all the time. She'd for sure have to start charging the niece rent even if she did stay, right?", "OP even paid her on top of this!!", "Rent is not an option when OP needs the room for a new nanny.", "WHAT? OP needs a nanny, that is what her spare bedroom is for, for the person watching her children while she works. If the niece is unwilling to continue providing childcare, for which she was well paid for along with free housing, HOW is OP treating her niece \"shitty\" by saying if she can't/won't watch the kids, then she needs to move out so a new nanny can have the room?", "Why am I getting downvoted for making a suggestion based on the information given. A live in nanny for 3 afternoon/evenings a week sounded unusual and like maybe there could be a compromise for everyone. But if it's 5 days a week that's trickier. \n\nY'all are mean downvoters 😂", "OP has 2 kids to care for, not 3. She’s making an entirely reasonable decisions based on the needs of her career and children. She’s not punishing her niece.", "OP's neice doesn't *need* a cost-free home that she no longer contributes to, she'd just prefer one.\n\nShe's not being punished. She had a room in exchange for being a paid, live-in nanny. She quit her job. The room was a part of that job. Would your employer continue paying you or providing you any kind of benefits when you no longer work for them?", "Except the niece doesn't want to watch the kids at all anymore, according to OP's replies.", "The internship is all semester long, but she’ll qualify for more internships for the following semester. She doesn’t want to watch them anymore, regardless.\n\nMy kids also don’t like the after school program.", "OP wanted cheap child care with as little effort on her end as possible. Niece might be an entitled bitch but once she moves to her own place she's going to regret ever wasting some of the best years of her life taking care of someone else's kids.", "OP has said in many comments that the niece doesn’t want to work two jobs", "Having free room and board, PLUS $22 an hour is a good deal. Figure a college town, rent could be over $1k, without utilities, and without food.......pretty sure OP can find another nanny. As to why last one left, well, she wanted to live there for free while contributing nothing.", "OP is responsible for her kids. Full stop. Their care is the priority.", "Oh bbbbbuuuutttttt ffffaaaammmiiilllyyy! 🙄  It was a contract for services provided, she's breaking her contract and will no longer be providing those services, therefore doesn't get to receive payment anymore. You bottom feeders are so freakin' entitled.", "[removed]", "OP didn't drop the ball though. They already said that niece knew the deal when she took the position. It is a business arrangement, pay+room and board for nanny services. No nanny services = no pay+room and board.", "It's not trash pay when combined with free meals and no rent.", "What jobs do you know that come with a rent voucher (and probably utilities and groceries) and pay you a competitive wage for the area with little to no experience? \n\nIs this common practice where you're from? Please do tell. \n\nThe way I would have KILLED for this during college... some of you are quite delusional. \n\nA simple google search will tell you the average pay for a live-in nanny in the US is $19-$25 working 40hrs per week. Homegirl was working 3 days (barely, as the kids were sleep most likely by 9pm). \n\nGOOD LUCK to the niece in trying to find a sweeter deal. WHEW! The entitlement... my lord.", "According to OP's replies the niece doesn't want to watch the kids after work. She wants to live rent free and not have to take care of the kids anymore.", "> She sat your kids as a favour\n\nNo. This wasn’t her being altruistic by any means. She got paid for her services via free room and board AND a good hourly wage.", "NTA and maybe share the math with her parents if they come for you again because holy cow that’s audacious.\n\n$22/hr x 9.5 hours x 3 days a week for 2 years (104 weeks) is $65,208 plus the value of rent (lets conservatively say $700 for a room rental in a house, $16,800 in rent saved though I expect that’s the low end) less taxes (if she claimed the income at all) and she’s now complaining you need the space? Even if she only saved half of that income she’s not hurting financially.", "Well, her parents saved room and board that whole time too, so they can fork over her room and board for the next year.  They had a sweet deal. It could continue.  Their daughter is ending it.  Their problem.  Not yours.  NTA.", "Life is giving her a clear lesson on how well you treated her with free rent plus a good hourly.  Hard lessons sometimes take a bit to sing in.\n\nMaybe ask her parents to cover the gap between what you paid her and an outside nanny.\n\nObviously NTA", "The accommodation was tied to the job, and should have been specified in your agreement. She has no legal right to remain, if she is no longer doing the work. \n\nThe entitlement is astounding. \n\nNTA", "How many college students does she think are in a position to be *saving* money, exactly?", "She made around $66,000 in two years from you. She’s saved a lot unless all she did in her off time was shop and party!", "Not being able to save money while working an unpaid internship in college is normal. It is not a tragedy. She’ll recover. \n\nNTA", "She's an adult now. You already did her a favor with both paying her for her services and housing her. Heck, out of college with a degree I made much less than $22/hr in 2014 and had to figure it out myself.", "Yeah, sadly internships are usually paid outside minimum wage because it's considered a reimbursement for internship -related expenses only.", "If I may suggest, the lease should have a provision that the room be occupied by a live-in nanny or a renter for X amount of money per month, however much you decide having that room be unavailable is worth.\n\nMost likely your niece will decline both, so this is just more of a CYA.", "You will want to look up the law on ending leases. Some jurisdictions automatically convert to month to month once the term ends. Check to see if you need to notify her in writing that you are not renewing the lease.", "If she drags her feet, then what?", "I don’t know which country you’re in but here not renewing the lease is not the same as giving someone notice to vacate. Check the terms of the lease but a very standard clause here is that the lease automatically switches to month-to-month at the end date.", "Depending on where you live and the terms of the lease, you may still need to give her notice if you want to be able to evict her on the day the lease ends.", "Lol I love when people understand just enough about the law to put themselves in a terrible position. \n\nI don't think you need to go scorched earth on your relationship with your brother and niece, but since that's the route you're planning on going down, you absolutely are not protected by merely having a lease agreement. \n\nTalk to a lawyer, not AITI", "You’re getting downvoted but I agree with you. Taking legal action instead of trying to handle it in a civil manner starts putting OP into AH territory.\nIs there a point where it would be reasonable to get a lawyer? Absolutely. But from what I see, it’s not there yet. Not even close.", "Not in college.  I would.love this gig.", "She makes almost as much as I do LOL", "It’s not unhinged to remind her rude family members of the reality of the situation she’s in. She is a widow. She is single. She needs a live in nanny. Her niece doesn’t want to be a nanny. None of that is a lie or exaggeration, how is it awful advice?", "Oooo! Found the SIL!", "Agree. It's a big perk for the Nanny to have a place to stay, and the more enticing the perks and benefits, the better quality Nanny OP will be able to find.", "And I think niece could probably continue to work the evening hours after she's off her day job, but she doesn't want to nanny at all, putting OP in a bind. The girl is completely unreasonable. It is after all just 3 days a week in exchange for all the benefits she has received.", "$62K over 2 years!", "While I agree with your overall point, niece's net proceeds may not be as high as you indicated. Unless I missed OP saying this somewhere else - what did niece do during breaks? Did she go back home for the typically short fall and spring break? How about winter break? Surely she went home during at least portions of summer break? If niece was doing 3 days a week literally every week for two years, your number would be right. I assume her average monthly pay was less than that.\n\nNiece still received an exceptionally cushy gig, and as I said I'm shocked to hear that she doesn't have a decent safety net underneath her. Even if niece was only getting paid for weeks where school is actively in session, that's still like $640/week for...what, 36 weeks a year? That's still $46k over two years. And since her only expenses being gas, maybe some food, and the occasional class supply, there's no reason niece should have anything less than $30k in savings. That is plenty of runway to get her through a six month internship in probably any city in the world.", "Tough cookies.  Very rarely does anyone actually want two jobs.  Life isnt fair that way.  \n\nHer choices are 1 job + apartment and be less financially secure or two jobs and a free room.\n\nThe guilt tipping would piss off. She isn’t your child and not your responsibility to make things easier for her.", "I have 2 college students both female and I would be thrilled to have them\nWorking for you. One has been a summer nanny for past 2 years. \n  Your sister and niece just realized how good the deal for housing was of them and don’t want to lose the deal. Even though they will no longer be participating in important part of contract ie being a nanny. Either nanny and keep the room or leave but I’m afraid you will have to fight your family even though you are in the right. NTA", "Doesn’t sound like you have much choice then", "Hope she’s never a working mom then. But she definitely needs to understand first, how contracts work (very helpful in business and life anyway) and second, either she continues nannying in some capacity or she gets an apartment.", "Which, fair. But then she needs to move out. It's unfair to you to expect anything else.", "That's very reasonable. I totally didn't mean for you to give her space at the expense of your kids. I was thinking that you may have an empty basement.\n\nAlso, who is down voting my reply? I don't think I said anything inflammatory.", "Then this is her choice and it's pretty clear-cut.  In this case, she needs to move out so you can hire a nanny.  You've actually given your niece a really good deal:  free room and board +$22 an hour.", "OP isn't a stranger though, they're cousins. Her disappearing for a while and coming back isn't the same as a stranger with no ties.", "The OP offered this up to help her get a nanny for a family member who needed something, so it worked out well. But instead of trying to work something out like “well you can stay but you have to pay rent” and use that new income to help pay for a nanny to not live-in but stay longer and visit early, the way this is framed is just shitty. Why would you treat a family member you supposedly don’t hate like you’re a landlord and they’re just a tenant or employee? \n\nSome people on this site, man, treating every single relationship as transactional instead of caring about actual community and relationships. It’s disgraceful.", "I didn't see those replues.  OP should add that in an edit to her AITA.  Thank you", "But if she doesn't want to watch them any more (regardless) why does she think that she can stay living in your house?\n\nNTA", "Just because she'll qualify doesn't mean she'll be guaranteed one. I would really stress with her all the options since I see that's she resistant to the idea of even picking up a few hours. Like flatly lay out all the options and let her choose.", "Market rate + room and board is cheap childcare suddenly, how ?", "Those came after I asked. Thanks :)", "Here’s a question: \n\nDid OP do the same paperwork for her niece that she would have done for any other employee? Contract, in writing, legal and tax filings, etc.?\n\nIf the answer is “no, I did not onboard my niece as an employee, though I now expect to treat her as one” then OP is part of the problem here.", "I'm saying she's better off", "It's also the reason why internships are largely a structural benefit for the rich. Most people can't afford to take them. She has been lucky to be saving money while in college. That is another luxury most don't have. Time to go into debt like everyone else.", "What a sweet deal free board and also getting paid. Sign me up!", "I was about to write this very thing, complete with the 'boo-fucking-hoo'.\n\nShe won't be able to save *as much*? AS MUCH?\n\nShe was able to save for two years AS A COLLEGE STUDENT. She will still be in the black with this new position. She has absolutely no standing to complain.\n\nIf you quit your job for a lower-paying position, you save less money. Welcome to arithmetic.", "Seriously. At that age I had a job through my college and made I think $9 an hour (for far fewer hours per week), plus paid for housing. A situation like this is a dream deal for any student!", "Just so you know that is pretty much the going rate for two kids. More experienced nannies would charge more, 25 or 30+ benefits etc depending on expertise and region.", "Some places (like where I live) specifically regulate tenancies where the housing is tied to employment, so that when the job ends for whatever reason, the tenancy ends. Sounds like this job is ending.", "She’s giving her 3 months…", "This is awesome advice.  Hiring a lawyer now will almost 100% avoid her trying to make this difficult.  She won’t want to spend HER money on hiring a lawyer to fight you.", "I don't think it's fair to expect OP to have to find other child care for even one semester. The niece is getting free room (and board?) plus the going nanny rate. This is a sweetheart of a deal and OP is under no obligation (even out of kindness) to have to continue giving out rent free space which she needs for her own use just to keep spoiled niece happy.", "While I get what you're saying, I believe there are different rules when the landlord lives in the same space.", ">A vast majority of them were folx who didn't renew the lease, but still would not leave. \n\nThis is called a holdover.\n\n>This is called a 30 day notice and goes thru the eviction process faster than a 7 day notice (which is usually lease breaching or non payment)\n\nYou're describing state law and practice. This varies by jurisdiction. For example, where I am licensed to practice non-payments and breaches require 30-day notices as well and must be served on special dates.", "She’s already given her 3 months. But yes, she still needs to talk to a lawyer because she could very well have to evict her.", "I am taking the legal steps to cover my ass.", "I have provided written notice :)", "You ought to hit OP up and see if she's still looking for a nanny lol. Sounds like a cushy ass job and you'd have plenty of free time for another part time job.", "Found the drama addict who doesn't care that these are real people with a history of affection for each other.", "Yeah, the fact that niece doesn't want to continue nannying makes me think there is something else going on.\n\nOr it could very well be that niece is fully aware that an internship will suck all the energy out of her, that she might need to do overtime and that she will be too flaky to do nannying regularly.\n\nBtw, I don't understand why OP wants only a live in nanny. Does she come home after 1am? Before that, I'd say it's very reasonable to drive for three days a week.", "Oh, I was using gross income.\n\nI did assume niece mostly stayed in town since OP had no backup care arrangements like she would have needed if niece went home for long periods during the summer.", "Welp, sounds like you’ve given her options. It is fair on her end but it’s also fair to understood her situation has changed and yours must too, then. Either she adapts or she gets a new place.", "Unless they bond with the new nanny.", "If she's better off leaving, why is she so desperate to stay then?", "Ummm..... this is a **paid** internship though? OP even says the neice could afford to live on her own.", "Several people IK pay for school w/ internships lol. Any internship worth it's salt in 2023 is paid.", "Agreed.", "I’m almost positive that an internship while in school where you just can’t save AS MUCH isn’t a luxury for the rich.", "Can I just say you have your shit together?", "Give us an update on this mess when you get a chance. I hope you stick to booting her out and don't get bullied over this!", "Plus room and board?", "Good to know. I don’t have kids and the only pay rate I can compare it to is my own as well as the fact she’s getting paid at all and not being told she’s going to do it for free “because we’re family”. The amount of times I’ve seen the justification for not paying someone for childcare being due to them being family is far too frequent.", "Correct, this isn't a tenant/landlord relationship, it's an employee/employer relationship.", "Pretty soon we'll all be living in our little Amazon workers' dormitories, able to be fired and thrown out on the street at any moment so you better work hard for daddy bezos or else.", "And has a legally signed lease that gets renewed ever 6 months. OP is nobody's fool.", "She needs to give it in writing, following whatever laws their jurisdiction has about this, for it to hold up.", "I think most people think that after a contract is expired, a landlord can just call the cops who will show up withing the day to jail and then throw on the streets the tenant pronto.", "FWIW-you don't have a guest room. You have a Nanny's room that is specifically designated for a live in nanny\n\nYou just don't have room to indefinitely house a guest", "NTA but I think the niece is crazy….could the kids go to care until she is off each day? She could then babysit and do dinner and bed time on the THREE DAYS it sounds like you need. If she wants to save money so she can move out and have a bit of a nest egg when she is done school I would think this is a heavy ticket for her. I mean she’s have to be in the house but you would be paying her to study, watch tv, text etc.\n\nI would have loved this set up in school!!", "And look twice for apartments? That's a very big burden.", "This here. It may be unfortunate for the niece but the arrangement was clear. She changed the deal, and you need to make choices that best suit your life, not hers. OP is NTA", "I never said it was. I only asked if the internship was for January break only, which is common, or if it was for longer.", "Not in my state, but it's possible this is different as well in other states. I have only practiced landlord tenant law in one state.", "It’s the same. You still have to go through the process of eviction.", "This is the way.", "For real fuck the internship lol", "No actually I hate drama, which is why I have boundaries and don't allow people to push them to the limit. It is healthy to have boundaries and Niece, SIL and Brother are pushing OPs way past the limit. I don't enjoy entitled people and so they do not remain in my life. So no, sorry to disappoint I don't enjoy drama, I keep it firmly from my door. Just like OP should with the Niece :)", ">Btw, I don't understand why OP wants only a live in nanny. Does she come home after 1am? Before that, I'd say it's very reasonable to drive for three days a week.\n\nOP said that the 3 nights that the niece was nannying were the nights where she (OP) doesn't get home until 12:30am. The other two nights of the weeks, she's home by 5ish and the kids just do an after-school/after-care program until OP picks them up.\n\nSecondly, I don't blame any of these potential nannies for not being enthusiastic about basically needing to stay up until past midnight and then drive home. At least the niece was able to just put the kids to bed, go to bed herself, and get a full night's sleep WHILE being paid to do so.\n\nIn fact, it's pretty messed up that the niece didn't even bother to discuss the internship/her plans with the aunt before applying. She just applied, got the position KNOWING that it would impact her availability, and thought the aunt would just, what, accommodate her at the expense of OPs kids?\n\nBoth the niece, and her parents, need a reality check. She's getting paid for the internship, so sounds like she should start utilizing some of those money-saving skills to dip into her savings in order to cover rent for the semester.", "Oh please. We had plenty of different sitters growing up. I’d elaborate more but I’m late for my abandonment session.", "Because she doesn't know better.", "I read it as she could afford it because she has saved money while being a nanny, not that the internship would cover her expenses. Perhaps my experience is out of date though. I graduated nearly twenty years ago. Back then I couldn't accept an internship and come anywhere near paying my bills.", "If you read the comments above, the neice is taking a major paycut for the internship. Getting $15/hr isn't enough for a single apartment in most cities.", "I’ve been doing this on my own for awhile now. It was sink or swim.", "I know, right? She’s the type of person who should be an influencer and have people emulate her, not the current types!", "I don’t have a choice. I need live in childcare, which she can’t provide.", "OP sounds pretty savvy. I don't think she'll jeopardize her job or her children's stability over this.", "And isn't that a refreshing change?", "She gave thre emonths, in writing.", "That’s a good way to put it", "Unfortunately OP posted an update that niece has no interest in nannying after her internship is over for the day so it’s not really an option unless niece changes her mind.", "Or just not pay her for those hours and put that money towards a babysitter", "[removed]", "[removed]", "# ^^ This actually an interesting option. I hope OP sees it!", "What about the OP's childcare needs? Niece is moving on with her career. She cannot expect free rent.", "$65,208 is what the niece made if she did this 3 days a week, for 104 weeks (2 years). \n\nI’m betting that wasn’t taxed which is a freaking steal. Which means she had more than enough money to save up and put toward an apartment of her own or even a down payment on a place. \n\nOP’s niece and her parents are TAH. She owes them nothing, if they can’t understand “Hey you can live here rent free if you nanny but can’t if you don’t” then they probably can’t understand how to even dress themselves that statement was so simple (like their minds)", "Which unless Mom is really lucky and experienced, was close to half Mom’s pay during those hours.", "It's her own damn fault she hasn't been saving any money. The entitlement is off the charts here.", "OP has already said upthread her niece is not interested in being her nanny after she’s done with the internship. She just wants to keep living there.", "Someone mentioned it could be different when employment is tied to the lodging? Would that affect it? And yeah, lodger vs tenant might apply depending on the location", "No one in this comment chain said OP isn't allowed this reasonable boundary. They said telling someone to \"go for the jugular\" is unhinged and I agree. If you read stories in this sub about someone going for the jugular in conflicts as often as Redditors suggest it, most Redditors (and maybe you) would consider them an unredeemable asshole.", "* I can read, that just wasn't relevant\n\n* big assumption for something that isn't the point anyway", "We don’t realize how strong we can be until we have to be and you are so impressive. Keep it up! You are being so smart and so reasonable. Three months is so much time, and she’s had years of no rent to have a good nest egg. Stay strong.", "Sink, swim or nanny.", "You don’t need us op. You sound incredibly fair, reasonable, and on top of things. The fact that this arrangement worked for 2 years is a clear indication of this. It’s a great step forward for your niece and hope she finds a place that suits, and you find a replacement quickly as well.", "She’s being ridiculously shortsighted. I hope she’s ready to pay $2k a month for rent!", "[removed]", "Bot comment stealer. Partial comment stolen from below. u/purplelilac2017", "In that case, it's definitely time for her to find new living arrangements. Since she has a few months to sort it out, she should be able to find a room somewhere that'll work. It's not fun, but it's life.", "Oh, they understand alright. They just don't want to give up such a sweet arrangement without a fight!", "/r/theydidthemath", "She has 65k plus the approx. $1000/month in rent and utilities she saved plus she probably ate at OP’s house too.  I am sure at least the three days she worked she ate OP’s food.  What a deal!", "With free rent , utilities, probably groceries too. She should have worried about savings then. NTA", "Living costs (food) and schooling costs are zero too?", "Unless she's been using it to pay for school.", "Yeah, on the thread that I started. Which means my comment came first.", "I don't believe stating the facts is really going for the jugular? But I agree with the original commenter'a sentiment that OP should state the facts and openly express what the situation is - as it is true. Niece, SIL and Brother are being entitled and nothing short of firm boundaries and honesty will work. If that doesn't work and they continue to push she is with her rights to evict the niece.", "She can, just not one who wants to work until 12:30.", "Procuring a nanny is swimming. Obviously. Are you under the impression OP should quit her job and have zero income to support her kids?", "This is a bot, content copied from https://reddit.com/r/AmItheAsshole/s/cVPQdWdcPG\n\nPlease report spam -> harmful bots.", "OP never said whether or not her niece is paying for school herself. I will recheck the comments, so this may be where her money has been going.", "Until we get more clarification from OP, I’d assume she’s paying for the food as she would a live in nanny (most have their food paid for since they’re using the families food to cook lunch and dinner for the children). \n\nWhy are you nitpicking? You can read my other comments about this.", "So? Other people asked the same question—and OP answered it. But go on with that saltiness!", "Even if she is paying for school herself she mad emore in two years than most people make in a full time job woorking three days a week from 1 to bed time.  Still a steal!!!", "Yeah if she’s paying for her own school, then I will take it back. But even if she’s using some of the money for school, she should be saving the rest.", "Do you understand how time works? I asked the question 6 hours ago, I was the first person to ask and the first person she gave an answer to. My comment isn’t going to magically change just because OP has added new information over the past 5 hours.", "Schools in the United States can cost 50,000 a year 😅😝"]}