{"id": 28652, "submission_id": "174t517", "title": "AITA for audibly saying \"Bruh..\" when my sister announced she was pregnant AGAIN?", "selftext": "Hello! I'm(F16) a younger sister to laury (26f) \nMe and laury have never been close since we had different dads, I was an affair baby. She's always resented me for \"ruining her family\" but whatever \n\nLaury has SIX KIDS. YES. SIX. \nTwin boys beck and Joe who are 7, (planned) \na girl lilliana who's 6 (unplanned) \nanother girl, angel who's 5.(planned)\n Another boy, Keith who's 2 (planned)\nand another baby boy Karl who's 9 months(Not planned) \n\nDespite the fact that Laury is incapable of taking care of these kids, 4 of them were actually planned. Because she KNOWS my pushover mom will give her money and watch the kids. My mom even quit her job to do so, even turning her work room into a nursery for Karl. \nWe're pretty well off, but we can't do this forever. \n\nI try not to judge, and just ignore laury like she does me. Even though when my mom is busy doing something like changing a diaper I have to step in and help. Especially with the twins since they're very rough with each other. \n\nTonight at dinner laury's boyfriend joined (a father to just Karl) as well as laury's father. \nThis wasn't abnormal so I didn't think anything of it, until my sister said she had some exciting knews.. I wished she'd say something else.. But I knew what she was going to say. \n\"I'm pregnant!!!\" \nShe would say. Everyone went dead silent until I said \"bruh..\" \nI didn't mean to say it out loud, but COME ON. \nLaury gave me a Death Stare, and said if I wanted to say something I should just say it. So I did\n\n\"Laury this is your... (I take a moment to COUNT) sixth child. You know we can't keep supporting you. Without mom you'd be on the streets, and you know that. Look at mom, she's so tired! She's always taking care of your kids and so am i. I'd bet I've changed more diapers than you have you selfish bitch.\" \nShe began to cry. And ran out into her boyfriends car, he followers her and drove. \n\nMy mother then began to cry... She left to go out Karl back to bed since he woke up. \n\nIt was just me and Laurie's father. He began to yell and told me a I was a brat and laury was a great mother, then he stormed off. \n\nAs I'm sitting here in the morning watching the boys, I'm thinking, was I too obnoxious? My mom says that a lot, I don't mean to be because of my autism but come on! \nPlease give me some feedback, Reddit, AITA??", "created_utc": 1696964547, "permalink": "/r/AmItheAsshole/comments/174t517/aita_for_audibly_saying_bruh_when_my_sister/", "score": 5991, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I think I might be the asshole cause what if this was by accident, and I shouldn't of called her a bitch. It's her body. Her choice.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA 😂sorry I’m a mother to a 17F and 15F and ‘Bruh’ is a common saying in my household.\n\nGood on you for calling her out and sticking up for your mother. It’s not fair to these kids or your mother.", "NTA. If it were me, I completely stop helping watch kids, but I CAN'T STAND when people pawn their kids off on family members. It really pisses me off since it happened to me as a kid.\n\nMy parents decided to have more kids when I was 10, 14 and then again when I was 17. Guess when I moved out? At 17.", "The dramatics in this post 😂😂😂😂\n\n“I take a moment to COUNT”\n\n😂😂😂", "I can't give credit, because it was from a random reddit comment, but to (mis)quote a wise random redditor :  \"It's a uterus, not a clown car\"\n\nNTA.  You were blunt for sure, but at some point, shit needs to be said.  She can't take care of her already present children, bringing more of them in the world is completely insane, both for her, for your mom, for you (who end up he;ping way too much for a 16 years old), and most importantly, for those kids.", "If Laury’s dad thinks she’s such a great mother then perhaps he should quit his job and be the stay at home grandad. NTA.", "😭😭😭", "NTA\n\nIf she can’t take care of the kids she has then she doesn’t need to be having more. I’d be aggravated if I was expected to take care of her kids as well.", "Bruh, you're definitely not the asshole here. Your sister needs to learn how to use birth control or at least take care of her own damn kids. And your mom needs to stop enabling her lazy ass. NTA for sure.", "NTA. Do you have an exit plan for when you turn 18? You’re already having childcare pushed on you, it will get worse once you finish school. Can you get a part time job and/or start spending a lot of your time at a friend or friends? Make yourself scarce to minimize being forced to babysit, maybe that will force your Mom to make your sister more involved or push her to force your sister to find other sitters. Six kids is too many!", "NTA at all. In my very own opinion, I think 6 children is fucking ludicrous and painfully unnecessary given the world is already quite overpopulated. \n\nAlso, your sister doesn't even appear to have custody of all these children?  Why was Karl at your house and his mother and father both took off so easily?  They don't seem like the best parents, even if it *was* socially acceptable to have so many cattle.", "Nta and stop taking care of her kids.  Get a job and start saving so you can get out asap.  You know you'll get $0 for any higher education- its all going to the baby factory.", "Your sister sounds like she loves being pregnant, and all the at she gets with it, but doesn't really want to be a Mom.\n\nNTA. \n\nOne day she will know the joy of being no contact with the children she pawned off on your Mom.", "INFO\n\n> Laury this is your... (I take a moment to COUNT) sixth child.\n\nIsn't it her 7th child?", "They left you with the kids the morning after?! I mean, I think that kinda proves your point here. Where tf was your sister?\n\nYou are a little bit TA for how/when you said it but you’re also a teenager and your sister is supposed to be an adult with a fully developed brain.. so I’ma rule NTA. It absolutely wasn’t your place to say anything but clearly no-one else in your family was going to. You definitely need to save up and move out. Those kids are not your problem.", "So her youngest Karl doesn’t even LIVE with her????? Why does she want a baby if she’s not even taking care of the baby she already has??? NTA", "NTA. ‘Bruh’ should be the least of her worries. People who can’t support their kids without so much external help, should not have more kids. Your sis has already taken your mum and you for granted.", "Sounds you are parentified a bit with someone else's kids. \n\nNTA.", "NTA she clearly is selfish. She gets her feelings hurt and proceeds to leave her children to go home and cry about it with her boyfriend? Real moms don’t get breaks like that you pack those 7 kids around with you. For events, work, date nights I understand needing a sitter but to just go about life half assing parenting is a joke. I would’ve bruhed her too", "NTA\n\nPeople need to stop having kids when they can't/won't take care of the ones they already have.", "NTA. If having a child requires you to rely on everyone around you to support the child then you shouldn’t have children.", "NTA. Some people need a serious splash of cold water to wake up and see the situation for what it really is.", "This story cannot be real:\n\n-Your sister resents you for being \"the affair baby\", but she doesn't have any grievance with your mom for having the affair?\n\n-She *planned* her first pregnancy at only 19???\n\n-Someone pointed out the names of the twins are similar to two major characters in the show *You*, so unless all names in this post are fake, this is pretty wild.\n\n-Going back to the affair thing, her dad and your mom agreed to have dinner together after everything?\n\n-And of course, you have to include the detail that the kids have *at least* two different dads amongst all six of them...\n\n-The use of future tenses in this post feel like it's fabricated and planned out.\n\n-You counted wrong, the pregnancy would be baby #7.\n\n-You said that without the help from you and your mom, she \"would be on the streets\".  Does she live with you, her dad, or her bf???  Does she or her bf work?  Does she receive child support at all?  You never clarified anything, so it seems a bit strange that she would somehow end up homeless if she had to take care of her own kids.\n\n-What does you being autistic have anything to do with this?\n\nIf someone this is actually all real, than of course NTA because your sister is incredibly irresponsible, and both you and your mom shouldn't be raising her kids, but again, this seems like obvious fiction.", "If your sister wants to keep having babies, you cant stop her. If your mom wants to keep supporting her, you cant stop her. All you can control is your words and actions. If you dont wish to support your sister, bow out of those responsibilities.", "Correction, it's her 7th child.  NTA", "NTA. That is really the only appropriate response.", "Honestly, at that point, there is no other appropriate response. NTA", "NTA\n\nAnd why isn't she dumping the kids on her dad instead of always on your mom? Let him share in the upbringing, then see how great he thinks she is.", "I have a rule that if you are not supporting me you cannot comment. No one supports me so no one can comment. You are watching her kids. It impacts your life. NTA. When is enough, enough? You are not a good mom, if you have so many kids you cannot afford to take care of them and have to rely on others heavily.", "The fact that your sister stormed off and your mother had to go and put the baby back to sleep. Just wow. NTA obviously and I probably would have said something similar two kids ago.", "NTA, id stop offering your help. Youre a kid yourself and more responsible to this spawn point of a woman.", "Ask her whats her plan when (hopefully not soon) mom dies? She gonna make money from the trees??", "NTA + NO To Appeasement and Enabling!\n\nGood for you, OP!", "NTA you sister is very selfish.", "NTA. The truth hurts sometimes. Don’t have kids if you can’t support them and parent them.", "NTA. You were spot on. Maybe Laury's dad should quit his job and take care of his grandkids, if he thinks it's not a big deal for your mom to be saddled with caring for yet another one of Laury's kids.", "You were sitting there watching the boys and wondering if you were TA?\nPretty much says it all.\n\nNo, you are NTA, your sister is a frickin idiot and selfish and lazy to boot.", "NTA. You’re not wrong. She has no business having more kids if she can’t take care of the ones she has. She has also never heard of birth control either apparently. Someone needed to give her a reality check, and your mom and stepfather refuse to so…\n\nSave up money and get out of that house.", "NTA, stop helping your mum with the kids, i bet she’d change her tune real quick", "A nice collection of AITA regular components. YTA for making up this bullshit", "NTA.  I should say you are since you killed me.  I am dead.  Bruh was the perfect response because you are legit sitting there doing her parenting while she does who knows what while you’re making this post.  I hope at 18 you can move out with friends or to college or whatever.  You may also consider talking to Mom about how she’s allowing your sister to parentify you, which isn’t healthy either.", "NTA\n\nGet a job. Excel in school Get some savings.\n\nThat way when you turn 18, you can stop being your sister's baby sitter.", "NTA. I would have laughed out loud.", "NTA and please tell me Joe and Beck are not the twins real names???", "NTA", "NTA, but go get a part time job and see how long the child care lasts without you there to help as often as you are.", "NTA, you can always make an anonymous CPS report saying shes an unfit mother and let CPS make an investigation.", "NTA  \n\"You ruined her life as a kid\"...She's an hypocrite, SHE ruins your life, at 16 you shouldn't take care of your sister's kid but have fun, explore the world ! Your mom is basically a free nanny and it's crazy she dropped her job for your sister.", " NTA, she needs to get spayed.  And you all need to stop enabling her.  I’m sure you love your niblings, but I’d stop helping and I’d move out the second you turn 18, if possible.", "NTA and are you being paid to baby sit? Start with that", "NTA. Since nobody is standing up for you, you had every right to stand up for yourself.", "NTA. People who make poor decisions and who continually take advantage of their family members need to be called out. \n\nFurthermore, very few parents (if any) can appropriately raise 6 children, especially being that close in age. Your sister needs to get her entitlement in check and stop having kids that she can’t care for. I’m sure her father hasn’t helped out with the kids like you have so his opinion means nothing. Your mother has no backbone so she needed the support of you speaking up on her behalf. Seems to me you did the right thing here, even if the language used was considered harsh. You said the words your sister needed to hear.", "NTA. How many different fathers are involved in this? How do these kids get supported? She is too old to be living off her mother and having her little sister who is just 16 doing all the work. Honestly, everyone at that table needed to hear the truth that OP supplied.", "NTA. Your mom needs to stop enabling your sister.", "Nta but now you have to stop helping if you don’t want to. You need to show your family what they are getting into and let the balls drop because laury needs to pick them up", "NTA, and you may want to look up parentification, where children are forced to take on parental duties - it is a form of abuse. \n\nIn all likelihood you are stuck in an abusive household, they're going to pressure you to put your life on hold to care for your sister's kids, and given your mom's comment I'd be worried about how she might in particular be leaning on your neurodivergence to try and convince you this is normal and ok. \n\nIt's not. \n\nFigure out an exit strategy. Get your documents together, think whether there's extended family or friends who might be willing to let you stay, earn money and DO NOT give it to Mom, and by all means keep asking questions like this here and elsewhere, so that you can get an honest answer instead of one that's designed to keep you quiet and in place.", "I have this vague feeling like i read this story somewhere else…\nDid you post this anywhere else by chance?", "NTA.", "NTA. I know someone just like this and it makes me so angry. If you’re not willing or able to look after your own damn kids, you shouldn’t be having more.", "NTA\n\n\nShe showed she couldn't care for the kids when she straight up left her baby.", "NTA. if you can it is time to find a job, start saving and move when you are 18", "NTA\n\nGood for you for having a spine!!!", "NTA\n\nSomeone had to tell her to close her legs.  Six children, different fathers, live with you and your mom?  Does the sister live there too?  Why won't she start actually taking care of her children instead of just making them.", "NTA. Your sister needs to learn what birth control is. Move out as soon as you can. Your poor mom.", "LOL. NTA. 100% NTA.", "NTA - Bruh indeed\n\nJust... Damn Laury, wtf", "NTA\n\n>I'm thinking, was I too obnoxious?\n\nNo more obnoxious than the grown adult woman who keeps having kids she can't take care of.", "NTA ask you parents if there is the same moneytary savety net set up for you in case you want to go to college etc., and tell them you don't want more child carong responsibilities. You are allowed to. \n\nMan your sister is acting insane", "NTA\n\nJust because you have the ability to have kids, doesn’t mean you should. \n\nIf she can’t raise a child without the help of others, having another isn’t a good idea.", "NTA. \n\nWhen my youngest sister announced her 4th pregnancy, I said the same thing, without the bruh. Told her we were all tired of taking care of her kids for her and that she only gets by because of my parents' money and us putting in the time doing her job and we were tired if raising her kids. My youngest was 12 at the time, and I was over diapers and crying.", "NTA your sister sounds like a train wreck and it’s unfortunate a 16 year old was the only one to tell her.", "NTA. \n\nWho names a baby Karl?", "Sounds like Laury is both busy punishing your mom for having an affair while simultaneously filling an endless void in her own life by being pregnant.\n\nNone of this is your fault, you did nothing wrong, and bless you for helping your mom but slso start planning for your own future away from this mess.\n\nNTA.", "Lol at the shady misdirection of this title. It’s not due to you saying “bruh” it’s due to you calling your sister a selfish bitch. \n\nYour sister may be irresponsible but YTA in this situation.", "NTA. Maybe take some diplomacy 101, especially if you want your message to be recieved and things to change. But you told the truth.", "NTA, bruh sometimes the truth hurts.  Could it have been kinder?  Yes.", "I find the dads response of his daughter odd.  By your own admission your mom cheated on him and you are the result.  I can’t fault him for being upset at your mom for that.\n\nNow your sister is doing the same thing. Having multiple kids with multiple guys and not caring for them. He views this a fair because of the cheating. This isn’t fair to you. You didn’t ask to be born and he should man up and accept that. \n\nIf his daughter needs the help he can do it.", "NTA. \nSo, her dad yelled at you and then stormed off? Not, yelled at you and told Laury to come live with him and he’ll do childcare. She needs a real way to feel productive other than having kids. She probably needed the reality check.", "NTA, why the fuck is she “planning” these kids? Was she married? Just trying to baby trap the random of that particular hour? If her dad feels so strongly he can take the kids for the next few months. Wtf", "They left without their baby?! NTA", "You could’ve been nicer about it, sure, but you didn’t say anything that wasn’t the truth. \n\nIt’s also pretty dangerous to have babies so close together. Pregnant again when the youngest is only 9 months old? My uterus is shrinking just thinking about it.", "Info: She planned to have twins at 19? \n\nThere's only 11 months between some of the other kids. That's medically inadvisable.", "Repeat post", "Man, nothing like a fresh slap of reality from a 16 year old.  Harsh but maybe needed.  Maybe she wanted a big happy family that she didn't get to have, but can't seem to keep it together herself either and more kids is the solution?", "Ewww she has a 9 month old and is already pregnant? She wasn't even cleared yet to being able to have safe, comfortable sex. Blech 7 kids is too many use protection if it's that easy to get pregnant. NTA", "LMFAO. omfg. the scream I just laughed out 😂🤣🤣😂😂😂.\n\nOh to be a fly in the wall as this happened. No OP, NTA. Those are your true sentiments as hers was that *”you ruined her family”* fuck her. Stand your ground! She needs a reality check and you gave it to her. As much as everyone was trying to avoid giving it to her, all they’ve been doing is enabling her behavior.", "This is something I did to my sister; You’re not necessarily wrong, but YTA. Criticizing someone when they’re excited about their news at a family dinner is asshole behavior. That being said, sometimes there’s a necessary asshole who calls people out. I don’t think you’re a bad person, but this is assholery.", "I'll take things that never happened for $600.", "Bruh, I swear I’ve read this post before.", "NTA \nYou and your mother are enablers. Y’all need to Stop assisting her .", "NTA. Hey Laury-it’s a vagina, not a clown car.", "When the Good Lord handed out tact and diplomacy, you must have been out of the country. I know you said you're autistic. But that doesn't excuse boorish behavior.\n\nAnd this may sound like I'm going to vote Y-T-A, but I'm not. Laury, on the other hand, needs to hear the truth. And obviously, her father is not going to tell her. A great mom? Not by any stretch of the imagination. Even though you went past brutally honest and went right into abusive with the \"selfish bitch\" comment, I'm going to say NTA. Someone had to deliver the news, and your mother and stepfather obviously weren't going to be the ones to do it.", "HAHAHAHAHAHA \n\nNTA and bravo. I’m about at this point with my sister. She had baby number 5 a few years ago, and I’m waiting for a 6th. They keep saying her husband gonna get a vasectomy but he never does. And they ALL have been unplanned.\n\nThey all live at my moms house, which was fine while my mom was living with her then bf, but once they stopped dating she moved back. The original plan was that they’d sell their old house (they used to live in another state but moved back closer to home) and once they sold that they’d buy their own house here. But instead, my sister kept having kids even though they only have her husbands income, so my mom eventually had to put an addition on the house because they couldn’t afford to move out and they were running out of space. \n\nMy sister never once has said thank you to my mom. She just complains about EVERYONE AND EVERYTHING. Including her own kids, as if they asked to be born. \n\nI’m so heartbroken for my mom because her dream her whole life has been to buy a lake house. Except now she won’t be able to afford one because of the addition she had to put on the house. And now that she’s nearing retirement she’s just gonna be stuck in a house with my miserable sister and her miserable family, instead of enjoying retirement in a lake house. \n\nSorry I just used your own post to rant but I had to get that out. So yeah again NTA", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHello! I'm(F16) a younger sister to laury (26f) \nMe and laury have never been close since we had different dads, I was an affair baby. She's always resented me for \"ruining her family\" but whatever \n\nLaury has SIX KIDS. YES. SIX. \nTwin boys beck and Joe who are 7, (planned) \na girl lilliana who's 6 (unplanned) \nanother girl, angel who's 5.(planned)\n Another boy, Keith who's 2 (planned)\nand another baby boy Karl who's 9 months(Not planned) \n\nDespite the fact that Laury is incapable of taking care of these kids, 4 of them were actually planned. Because she KNOWS my pushover mom will give her money and watch the kids. My mom even quit her job to do so, even turning her work room into a nursery for Karl. \nWe're pretty well off, but we can't do this forever. \n\nI try not to judge, and just ignore laury like she does me. Even though when my mom is busy doing something like changing a diaper I have to step in and help. Especially with the twins since they're very rough with each other. \n\nTonight at dinner laury's boyfriend joined (a father to just Karl) as well as laury's father. \nThis wasn't abnormal so I didn't think anything of it, until my sister said she had some exciting knews.. I wished she'd say something else.. But I knew what she was going to say. \n\"I'm pregnant!!!\" \nShe would say. Everyone went dead silent until I said \"bruh..\" \nI didn't mean to say it out loud, but COME ON. \nLaury gave me a Death Stare, and said if I wanted to say something I should just say it. So I did\n\n\"Laury this is your... (I take a moment to COUNT) sixth child. You know we can't keep supporting you. Without mom you'd be on the streets, and you know that. Look at mom, she's so tired! She's always taking care of your kids and so am i. I'd bet I've changed more diapers than you have you selfish bitch.\" \nShe began to cry. And ran out into her boyfriends car, he followers her and drove. \n\nMy mother then began to cry... She left to go out Karl back to bed since he woke up. \n\nIt was just me and Laurie's father. He began to yell and told me a I was a brat and laury was a great mother, then he stormed off. \n\nAs I'm sitting here in the morning watching the boys, I'm thinking, was I too obnoxious? My mom says that a lot, I don't mean to be because of my autism but come on! \nPlease give me some feedback, Reddit, AITA??\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA I have come to realize that people like this are not always just being irresponsible, they are sort of addicted to being pregnant and having babies. Having kids specifically in “the baby stage”. I don’t get it. You did nothing wrong. Your poor mom.", "NTA. I honestly would had have a similar reaction. \nJust stop caring for them. I know you are doing it because you love those kids and your mom but you are 16. She is dumping her responsibilities on you when you at age 16 should be worrying  about  your future and plans for education an discovering life.", "A great mom, move out and stop helping, let's see how good of a mom she really is.\n\nNTA", "NTA.  ...\"As I'm sitting here in the morning watching the boys, I'm thinking, was I too obnoxious?...\" I think this says it all. Even after being called out for being a baby factory- She still insists on \"I'm a good mom, what are you talking about?\" card. She should have her tubes tied.", "Bruh indeed\n\nNTA", "Look, you're NTA for saying Bruh, or even the fact she has six kids and is relying on a support network she is burning out, without seeming to care. You're kind of TA for calling her a selfish b!tch. \n\nAll in all, I would have probably called out the fact she was irresponsibly having kids as well. I'm sorry you're in this mess.", "NTA- but start making an exit plan for when you turn 18 so they don’t try to stick you with the childcare.", "NTA. Your sister should know that if they ask someone with Autism what they really think, they will tell them what they really did. She asked. You said what everybody was thinking but too polite to say to her face. \nAlso, you are 16 and helping look after her children? That is super unfair to you. Your sister needs to take care of her own kids.", "The fact that Laury ran out and drove off while her mom left TO GO PUT HER KID TO SLEEP 😭😭", "NTA just reflex from someone watching her mom lose herself and money to raise kids.\n\nJust don't point out to anyone about which were planned and which were accidents. That's cruel to the kids.", "She's a year younger then me and will have 7 children by my age.\n\nShe has enough. I think you need to talk with your mother about steps forward - ***not excluding having the sister getting sterilized if she wants to keep her current status quo of getting help. At this point it should be required of her to do so before anymore assistance is given.*** It's utterly ridiculous to be having so many children and not even be 30 yet. By this time next decade, she will have a classroom full of children if she doesn't stop it.\n\nLaury's father can complain as much as he wants and call you a brat, but ultimately he isn't giving her housing or raising her brood now is he? That would be you and your mother, and he can damn well show some appreciation for it - and no, before he says she's a good mother, he needs to rethink that - especially if she's leaving her large brood to be cared for while she goes out and makes another baby. If she has time to breed, she's not using it to raise her children or work to pay for the things her children need.\n\nAt 16, your focus should be on school. The fact you were left watching the boys, I am assuming all 4, the morning after speaks volumes. I assume the children were left overnight if I am not mistaken? She just got emotional and so easily walked out without her children? A good mother doesn't just do that.\n\nObnoxious is also objective. Having 6 children running and screaming about, with you complaining in the background would be considered so, but objectively, it's well within your right to be upset and to complain given your autism - people with it enjoy quiet and like scheduled routines. Children by nature don't. If there were fewer instances of the children being in the home, I bet you would be feeling much more calm and contented, and less likely to be \"obnoxious\".\n\nYour mother may have the financial means to care for these children, but she clearly doesn't have the mental or emotional capabilities now - especially if she didn't defend her daughter and instead cried and went to put one of the children back to bed.\n\n***If everyone is silent, they aren't excited either. I have half the mind to think Laury's father only said something after the fact since his subconscious mind likely actually feels the same way about another addition to the family, you just lacked the filter everyone else had and stated what was on your mind. And rightfully so. There was nothing more appropriate to say in this case.***\n\nYour sister has plenty of children, and needs to consider sterilization at this point if she's not going to make better use of family planning and birth control. I'd tell your mom about this option since she is very clearly overburdened and overwhelmed.\n\nNTA", "NTA. Six kids, in this economy??", "NTA. Well done for standing up for yourself. Please keep standing up for yourself, because you should not be forced to be your sister's nanny. \n\nYou were a bit rude, but that is forgivable considering what you have been dealing with. Your sister is awful, and so is her partner. They deserve to be told off. Your mom is being negligent for allowing you to be treated this way. \n\nI think you should stop helping with the kids.", "Wasn’t this posted before (pretty recently)?", "Seven kids at 26 years, seven kids from different fathers and heavy relying on your family to do the shit for you. \nHoly hell, she deserved that comment and even more than that, and so does her dumb father, who, I have a feeling, doesn't lift a finger to help his dumb daughter with a breeding fetish to use her braun instead of cervix. A great mom, my ass. What a sad life these kids are gonna have :\\\n\nAbsolutely NTA.", "I for one heartily second that “Bruh” with an emphatic “BRUH!”  NTA", "NTA. My youngest sister has 5 kids. She is a SAHM, but is always pawning her kids off on our parents. My dad is retired, and my mom is nearing retirement and i know they dont want to spend all their time watching her kids but they do it anyways. My dad even drives to her house every morning to sit with the non school age kids while my sister takes to school age kids to drop off just so she doesnt have to load 5 kids into the car. She takes advantage of them and it pisses me off but it isnt my place to say anything", "She had a planned kid at 19? She's an idiot\n\nNTA", "NTA, and it sounds like you're facing a severe case of parentification. And sadly, it's one that won't change for the better without your mom putting her foot down. \n\nIf I were you, I'd start arranging things so you're just not around. Look into extracurriculars you can do outside the home. See if you can get a job you can manage with school. Start studying at the library. Start saving up and prepare to move out the moment you can legally do so. (also, if possible, maybe reach out to your paternal side of the family to see if they can help. I know it's probably slim chances, but still a suggestion). Also consider speaking to a school counselor if that's an option and explain the situation. Ask *specifically* for options on getting your life in order post graduation so you can move out and get a job/secondary education. \n\nEventually, your mom will have to force Laury to put on her big girl pants and get her life in order. \n\nGood Luck OP.", "My sister has seven. The last three (at least) weren’t planned. I love all my nieces and nephews to death but I have a hard time feeling bad for her when she talks about how overwhelmed she is. Girl, you should know by now how this happens!", "As I read six kids even I said “bruh” out loud. Damnnn ..", "NTA, Quit taking care of your nieces and nephews **immediately**. Your mom should stop enabling her as well, because you just *know* a SEVENTH child is literally around the corner. (She just has to give birth to the current one, to make room for the next one.)", "Man, why is your mom supporting this. I’m sorry, but your sister Laury is a complete fucking waste of space, how dare she pop out kids and not care for them and make you and your mom do it. You let her off easy, next time, tell her you aren’t helping and get your mom on board too.\n\nDon’t let this nonsense continue", "Understandable her father defended her but how would he feel if he were actually taking care of her kids physically and financially?  \n\nYour sister resents you for ruining her family?  How about her eating up all your family’s assets by having so many kids and not taking care of them?  She’s a hypocrite. \n\nYour sister doesn’t want a life outside of being taken care of because of her children so she doesn’t have a reason to stop. It’s so sad to me she can’t be responsible enough to take birth control when she can’t support the kids she has. \n\nIdk if it will do any good but your mother needs to stop enabling her. \n\nI’m so sorry you’re a stuck with everyone else’s poor choices and selfish decisions. I hope you really put some thought into what you want for your future. Work hard at school. Start a career before a family and be very choosy who you have a relationship with and don’t sleep with anyone without birth control and condoms.", "NTA, but stop babysitting and helping.  Every time you're asked give them information on local resources.  Encourage your mom to grow a backbone.  Being your sisters nanny isn't going to help her when she retires.", "NTA \n\nAnd stop watching her kids. You didn’t birth any. Go be a teenager.", "You are the hero of your family. Truths need to be laid bare. You did that. Your family will benefit from the truth being spoken.", ">As I'm sitting here in the morning watching the boys, I'm thinking, was I too obnoxious? My mom says that a lot, I don't mean to be because of my autism but come on! Please give me some feedback, Reddit, AITA??\n\nIf you are still looking after those kids after saying that to their Mom, NTA. She proved your point eloquently.", "NTA. My kids are 17 and 20. They probably would have gone with \"skill issue.\" Stop watching her kids. If mom wants to martyr herself, that is a mom problem. Your sister is in for a huge wake-up call if mom becomes unavailable.", "NTA. The \"bruh\" part had me laughing hysterically. \n\nThe situation is obviously a disaster. \nBut that is the best one-liner response ever.\n\nI don't have any good advice for you. \nYour mom needs to step up, and her dad needs to man up and back your mom on getting her out of there, like give her 6 months or so.ething to figure it out and then vammose. And if she doesn't like the fact that that is happening while she is pregnant she should not have gotten pregnant literally right after her newest child.\n\nShe needs to stand on her own feet or she's just gonna keep popping babies like a rabbit.", "NTA. If she's already incapable of taking care of her existing kids, having another is selfish and irresponsible.", "NTA,\n\ntake care of your mom and talk with her tho. Maybe she is keeping things to herself and see what is her opinion on taking care of your sister’s children. Does she want to? If not, it’s time to go shred some light into Laury’s head about the real truth. Also, such an immature dad, calling you slurs when you’ve been taking care of his grandchildren and he does what, sit around doing nothing 💀", "NTA. Stop looking after the kids and tell Laurie’s father that he is welcome to take on your role to see how good a job she is doing.", "You got thinking if you were obnoxious while watching the boys? Even with the fight the Kiss stayed there?\n\nNota.", "Anyone taking bets for the final number of kids?\n\nI’m thinking 17-18 by the end.", "NTA - also, I feel like there should be an 'Absolute Legend' option for the swift \"bruh\" response, that had me dying 😂 \nYou gave a good explanation for yourself afterwards, and it's not fair that so much unwanted responsibility has been placed upon you because someone else doesn't want to face the consequences of their own actions.", "Lmao, I would expect nothing less from a 16yo. Actually, ngl I’d be a little disappointed if you hadn’t said it. NTA. I wish I had been a fly on the wall, just sitting there holding in a snort laugh.", "NTA just because your moms other child wanted to open her legs doesn’t mean you’re obligated to take care of their overgrown sperm cells. You deserve to grow up with your moms attention just like she did and you deserve to grow up being a teenager not a mother to kids you didn’t have. Don’t feel bad for saying what you did because what it sounds like every word you said was the truth and the truth hurts sometimes. I wouldnt feel bad either to someone that tells you that you “ruined our family”. A side note if she was so upset with you being an affair child why does she have more than one baby daddy? That is a genuine question because you’d think she’d be family above all else at that point but ig it’s ok for her to make your life hell as she can be a hypocrite. Not saying she had an affair but saying as in when you have a kid with someone it’s not your choice anymore you work on your problems you have with your s/o till you solve them because that’s now a kids life you’re dealing with and I thought she’d understand that since she deemed u like that growing up.", "AITA for laughing at the comment she made?", "Maybe she should consider being a surrogate if she likes the attention of pregnancy but isn't interested in parenting. \n\nNTA", "Nta, but plan a escape plan before you become a 24/7 babysitter as I feel 6 won’t be her only amount of kids. She might get pregnant again and again.", "NTA. She needed the reality check. Maybe she'll abort this one like she should and realize that opening her legs and simply making a child isn't what being a mother is about. \n\nIts about raising your child into the best person they can be and providing a good life for them. She forgot the other 99% of what it is to be a parent. Instead she fucks around with all these different men while your mother and you sit at home like cuckolds and take care of her kids. I'd report this to CPS and see what they say to be honest. I'd never change a single diaper of a child that wasn't mine if I wasn't being paid to do it.", "My brother has 8 and somehow takes care of them even though he works 2 jobs", "Probably multiple baby daddies….needs to keep her legs closed", "NTA bruh is an understatement if anything, I ironically consider what she's doing to be child abuse, every child deserves to grown up to at least one parent who can give them a certain amount of time and attention.\n\nsadly only the upper class could reasonably give 6 kids sufficient love and attention, a couple with literally no job or hobbies being bank rolled by some means.", "Sounds like you know what to do when you turn 18...\n\nNTA:  Your sister can bear as many children as Genghis Khan had.  She just has to be able to pay for them out of pocket and take care of them.  No?\n\nAlso, where are the fathers in these kids' lives?  A father to only one children implies a lot...  Mother dearest also needs a reality check.  Sadly she's an enabler of this whole mess.", "YTA\n\nBruh is the worst slang I have ever heard, how could you even think to utter it. Let this be a lesson, never say bruh again.\n\nEVER", "Snip snip ✂️ your sister may consider a spay 😬", "I would ask her if she knows what contraception is like come on just put a cork in it ffs", "Does your mom have a husband who can weigh in?", "Off topic but are Beck and Joe named after the series YOU where Joe is a serial killer and Beck is one of his victims, cuz YIKES!", "I kind of feel like ESH. \n\n1. It's really self-centered of your sister to think everyone was going to be excited about her having another kid, especially if there had been no previous conversations that they were trying for another and read the room's responses to her planning another pregnancy. \n\n2. Why hasn't your mother explained how much stress caring for her grandkids puts her under? She needs to find a way of setting boundaries in this situation. \n\n3. As funny as your reaction was, and honest, IMO the announcement is never the time to offer criticism. Say congratulations and silently judge her, then the next time you see her alone be like, \"WTF are you thinking - don't you see how exhausted mom is from taking care of your kids? Figure something else out for childcare.\"\n\n4. Laury's dad is just an AH. \n\n*Edited to add #4", "I was on your side till the end when you pulled out your autism shield. Stop using that as an excuse, it’s pathetic. You said it, so stand by it. In this situation you are NTA, your half sister sucks, but back up your words with conviction, not an excuse of autism. It makes autistic people look bad.", "Laury has resented OP her entire life. Laury has 6 kids from multiple fathers. Laury lives at home and completely upends OP's childhood. Laury can't financially or physically support her children and is relying on OP's mother to quit her job and provide housing. Laury also relies on OP, the sister she hates, to take care of her children.\n\nLaury decides to have another child. No one celebrates. OP said 1 single word. Laury goads OP into saying what's on OP's mind. Then, Laury gets upset at the literal truth. Laury is, in fact, a selfish bitch who is spread too thin to properly parent her 6 current children with a 7th on the way.\n\nLaury gets so upset that she abandons her children and relies on her mother and OP to take care of them. This further cements how selfish Laury is.\n\nThe sheer number of Y T A comments is disgusting. OP is NTA. Laury is an irresponsible monster.", "YTA-stop blaming your autism. You don’t like it, say it. Don’t fucking hide behind a disability. You knew you were wrong when you said it. Not your life. Not your circus, stay in your lane. Stop excusing obnoxious behavior on your disability.", "ESH, but a soft one in your case. You’re an asshole, but with justification and you’re right. Your sister is using you and your mother as a daycare for kids she can’t afford. \n\nIf I were you, I’d tell her boyfriend that inbound kid is his, hers, and nobody else’s. If they’re upset about that, it tells you all you need to know.", "NTA. Sometimes truth nee3ds to be spoken. Now, stop helping with her kids. And gently urge your mom to pull back, siting her being tired, running low on $$ and giving up space at a time when she should be exploring her won hobbies. GENTLY.", "Another perfect example of why we need a TNR program for humans.", "**I'd bet I've changed more diapers than you have you selfish bitch.\" She began to cry. And ran out into her boyfriends car, he followers her and drove.**\r  \n\r  \n**My mother then began to cry... She left to go out Karl back to bed since he woke up.**\n\n&#x200B;\n\nSo... she is having kids that she is not taking care of. I thought your mom was just babysitting, but it sounds like some of those kids live with you. Just no. She needs her tubes tied.\n\nNTA NTA NTA", "Does Laurys dad help with his grandkids? And the others kids dad? \n\nNTA and while your mom is responsible for her own actions, I would put pressure on the actual father figures to help", "This is the funniest title I've seen in this sub.\n\nNTA, btw", "ESH The time to talk to your sister about having more kids was not at the announcement of her pregnancy. It was probably 3-4 kids ago but that night was probably the worst time to do it.", ">Laury has SIX KIDS. YES. SIX.\n\n>Laury this is your... (I take a moment to COUNT) sixth child.\n\nYTA for doing a creative writing story and not even bothering to keep the basic facts consistent.\n\n>You know we can't keep supporting you.\n\nYou forgot to include any details in your story to support your claim here.", "Yta for trying to blame your autism for how you went about it. You were right, but you went about it in a very shitty way.", "ESH. Your sister is definitely taking on more than she can handle and is the AH for expecting you and your mum to pick up the slack. But I don't think you should have called her a selfish bitch in front of everyone. Decline to babysit your younger siblings; sure, after all you aren't their parent. Withdraw your help with the kids. But calling her a selfish bitch is unnecessary.", "NTA.  But also none of your business.  Her, the BF and her parents need to confront this problem.\nBe thankful,  your the only one with common sense in the family.", "YTA there is no “we”. We can’t keep supporting you, “we can’t do this forever”.\n\nYour parents relationship, and support, of their daughter and grandchildren has nothing to do with you and is not your business to judge.", "YTA. Your autism isn't an excuse for it, either.", "ESH.  You were in the clear until you called her a bitch, because sometimes people do need a truth bomb.  Everyone else sucks for either being a shitty adult or enabling shitty adults.  All I can suggest is getting the heck on out of there when you turn 18 and never being guilted into coming back for childcare.", "[deleted]", "At 16 years old this was out of line. Finances of your parents and your mothers choice to take care of the children isn't your business. If you want to not help, then don't.", "LOL, what you said was the definition of asshole, and I mean that in the way that sometimes you have to be an asshole to assert yourself.\n\nBut this isn't your fight, that's your mom's call to claim she is fed up or not.  And then you went in for the personal attack.  Also not useful.\n\nSo you yeah YTA.\n\nBut your older sister is a mess, leaning heavily on others for help, that many kids, not married, different fathers.  A mess, low character, etc.\n\nBrutal take down though, kinda hilarious.", "YTA With Nuance. like for sure you were being an asshole for saying it like that but you totally were right and I would’ve said/done the same thing.", "Soft YTA\n\nI agree with you on that she should not be having another child, and I get that you were very annoyed but you didn't just say \"bruh\" to her, you also called her a \"selfish bitch\" which I feel is a step too far. Just say she's selfish, people are much more likely to listen to criticism when it isn't laced with such hurtful words.", "NTA for saying “Bruh”. But definitely the asshole for calling her a bitch and all. It wasn’t your place to say whatever you said. Your mom should be the one setting that boundary, if it’s getting too much for her. You can just opt out of any baby duties. Now is this the responsible thing for Laury to have so many kids on top of one another when she can barely take care of them? No. But was it your place to rudely express that in front of the whole family when she announced her pregnancy with words like bitch? hell No. So, YTA I would say after reading the complete post.", "I suppose soft YTA for how you delivered your message. I agree with the content of that message but the name calling was completely unneeded.", "You're an idiot for saying \"bruh\" you're an asshole for calling her a selfish bitch. Yta", "[deleted]", "ESH.\n\nOP is out of line because it's not the place of a 16 year old to say \"we can't keep supporting you\".  OP's mom is the adult here.  She's the one who gets to say when enough is enough.\n\nOP's sister is a walking clown car that needs to grow up and handle her own responsibilities and the consequences of her own actions instead of dumping them on others.", "YTA, YOU’RE A BRAT AND LAURY’S A GREAT MOTHER.", "My first thought was YTA.  Because I get a lot of rude remarks about how large my family is, I’m a bit defensive. But then I continued reading the part where the rest of the family is basically having to subsidize her lifestyle, and I changed my mind. I have absolutely no issue with people having as many kids as they want AND CAN TAKE CARE OF. Your sister is missing part of that equation. Truthfully, bruh would have been probably the nicest thing I would have said🤷🏻‍♀️. We work our butts off to make sure our children have what they need, most of what they want, and plenty of opportunities to go places or do interesting things. And we don’t rely on other people to help us. The choice to have a large family should not causes bigger burden for the extended family.", "YTA. It’s none of your business what your mom does support her other daughter. “We” are not supporting anyone, your mom is. If you don’t want to help your mom when she’s watching the kids, your issue is with her not Laury.", "YTA. \n\nIt isn't your problem. It is your sisters and your mothers problem.", "So she left all her kids to go pout and your mom and you had to take care of them? Typical. How come the fathers involved aren't caring for this gaggle of kids? \n\nYes, you were out of pocket with calling her a selfish bitch. You didn't lie, but you ended the conversation and spoke for your mother, when you had no place to. You can'tmake any decisions here, so you need to learn the value of silence. Leaving the table would have been such more effective, and wouldn't have shifted the focus from her behavior to yours. Ideally this is something she needs to talk about with your Mother and her father. Perhaps it's time she move in with them. But none of that is up to you. Think whatever you want but you have to learn to control your words. All you did was distract people from the actual conversation and make her the victim.\n\nESH.", "I don’t really believe this post is real, but if it is, I’m gonna go with a gentle YTA for a few reasons. \n\nYour frustrations may be valid, but you are 16 years old and not even her real sister, it is not your place to tell her how to live her life. It’s also never anyone’s place to attack someone as you did over their decisions, no matter what you say, the second you call someone a selfish bitch, you’ve lost the moral high ground and your point will not land. \n\nIf you don’t want to watch the children, don’t. Tell your mom you won’t help. But it isn’t your place to tell your sister how to live your life, or to make decisions about what your mom can and cannot handle. News flash, she’s older than you and an autonomous adult, she is capable of standing up for herself and doesn’t need her 16 year old daughter doing that for her. \n\nI know you meant well, hence the gentle YTA, but it wasn’t your place to say this, and even if it was, you approached it wrong.", "YTA. At the point of pregnancy announcement it’s a bit late for the truth serum. What is your sister supposed to do with the info you’ve given her in this exact moment? Do you want her to get an abortion?", "For saying Bruh? No not at all, a fair reaction given what you typed here.\n\nHowever, this is an ESH for then calling her a Selfish Bitch at dinner lmao. Maybe that was deserved, but it didn’t seem 100% called for. At least not in that moment.", "ESH. You were fine until you called her a bitch.", "So listen to me before you down vote me to smithereens. \n\nYTA \n\nThe fact that you or your mom have taken care of her previous children shouldn't be cause to rub her face in it.\n\nIf you resent doing that maybe you shouldn't do it and could have communicated that to her instead of publicly humiliating her ? \n\nBruh is not a bad response to pregnancy .\nBut it is all the blaming and finger pointing that came after .\n\nShe is your sister even if it is from a diffrent set of parents , she is blood . If your mum bless her heart finds taking care of her grandchildren an unwanted chore she could have said it herself . And I wouldn't have minded doing that at all but not in this fashion . \n\nThink about the intention she is happy she is having a new child and you in one fell swoop made her feel that the unborn kiddo is unwanted  , that she is a bad mum, and made her feel guilty for asking for help.\n\nIf you don't want to help her Don't \nJust don't do it then rub her nose in it \nAnd don't do parade it in a family meeting tell her privately sis I cant be involved in caring for the kids anymore .\n\nPlus one day you might be on the receiving end of her or your mum help would you like her to have said the same response to a good news that you had .\n\nGeez that made me get abit fired up \n\nBe kind to each other , even parents can't get everything right all the time that is why family is there fix up these situation and stand by each other .\n\nI ll say what I hope you can go and tell your sister \n\nI hope you have a healthy baby and be will throughout you pregnancy and afterwards.", "Just by reading the title ik this story gonna be crazy", "Same! Ma to a 14M and 9M. I've said it to my eldest before in a jokey way (\"bruh, I mean, come on!\" In response to him not taking a plate through to kitchen or something) and he laughs and rolls his eyes!", "I have a toddler and even she says “bruh” lol", "Right? 😂😂 I feel like my teens say bruh as often as they breathe 😂😂😂", "My four year old came out with a “bruh” to her father over dinner. He looked at me and said “did she just say bruh?” And then almost fell out of chair laughing", "I'm in my 30s and I sua bruh MULTIPLE times a day.", "I got my teenager a shirt that says “Bruh” off of Amazon. He didn’t think it was as funny as I did.", "IKR, I am actually ordering a tee shirt that says\n\nMama\n\nMommy\n\nMom\n\nBruh", "I have never once said BRUH lol. I say \"dude\" a lot but never \"bruh\".", "I’m in my 40s and I say “bruh” when I’m shocked by something.", "My 10 year old daughter ‘bruh’s me at least 5 times a day. It makes my eye twitch. She did it one time and got to the mom eyes and immediately apologized lol.", "I have a 16 year old daughter and she's said it so much that I find myself saying all the time now without thinking. Sometimes I hear it said in my dreams.", "Yeah i noticed sister and bf left the house in a huff but apparently their 9 month old (and maybe the others) lives with grandma and OP??", "OP needs to start planning her exit now. It might be difficult to refuse to babysit while she’s living at home. But it’s only 2 more years until she’s an adult. Who knows how many more kids her sister’s gonna pop out in that time period.", "Me too! I feel so bad for the kids but OP deserves to be a teen too!", "I'm right there with you. I was the oldest of all my cousins and usually got roped into watching them for free. I hated it.", "My sister tried bringing up that she wanted me to watch her future kid(s) 5 days a week while she and her fiance worked and then got offended when I told her no.", "Tfw OP is more motherly than her sister. \n\nIt's so awful that some parents try to pawn off kids to someone else is because that person can't win. Saying no only makes you feel bad that there's a kid being neglected. But saying yes makes you the miserable person taking care of a kid with 0 appreciation.", "Uh am I right that Lauru is such a great mum that she ran off put of the house and left her kids behind without making sure they would be ok. She kind just proved OPs point", "We have only one kid, especially for that reason. We are NOT poor, but we just know a second child (financially, emotionally, etc) would break our neck and us.\n\nOur kiddo loves going to \"Yaya\" (Spanish nickname for grandma) on Saturdays, cause we want them to have a good relationship. Especially with my side of the family not close and my MIL being 70.\n\nBut we would NEVER shove our kiddo all the time to our parents/relatives. It's our kid to raise.\n\nSo sorry your parents parentificated you.", "You know if op stops the mum will carry on anyway. Not disagreeing with you at all, I'd do the same but it makes it more difficult for op", "Also, was Laury medically cleared to even have sex again if she is already pregnant and has a 9 month old? Yikes", "OP Has no filter just like her half sister has no birth control\n\nAs someone who often doesnt give a fuck about what I say, NTA", "Honestly this is the best reaction I’ve seen. OP is NTA. The simple fact is that if you can’t afford to raise your kids on your own then you shouldn’t be having any. Add to that the fact that OP is Autistic so is very likely dealing with sensory overload pretty regularly. I’m Autistic too and honestly I would have opened my mouth after the 4th one….", "\"AITA for this honest but uncomfortable moment that ended with me still looking after this persons kids?\"", "And the crappiest part of all was the next day when Op had to watch the twins.... I hope Op can get out of that circus of a family and live the life she deserves.", "how the fuck is it not an asshole thing to call your sister a bitch at the dinner table", "This is as fake as these stories come, and it's not even a little entertaining.", "YTA. It was not her place. If you don’t want to support the kids, don’t support them. But as it stands, that is OP’s family’s choice, not hers. She’s 16 and has nothing to do with it one way or another.", "And to top it all off, her counting is off. She just named the six kids Laury already has.\n\nWhich would me that this is Laury's SEVENTH child, not sixth.", "But then counted wrong.  It’s going to be child number seven.", "Fiction writing.", "\"I take a potato chip... AND EAT IT\" vibes", "Yeah, if there was ever a moment to begin a sentence with \"My sister in Christ....\"", "YES", "Someone actually called my mom a clown car. Because she's up to.....12 kids. None of which she actually raised.", "\"It's a uterus, not a clown car\"  - best quote EVER!  🙌🏻\n\nAgree totally, OP is NTA.", "Or as Alice reminded Frank Jr. on F.R.I.E.N.D.S., 'She's a woman, not a gumball machine.'", "Not sure if you got it from me but I know I did on a post.", "She's collecting the child support while her mother actually pays the bills and raises the kids. She's decided this is her job.", "NTA. You were nicer than I would have been to her. I would have asked if she figured out how to stop getting pregnant yet or did she need another sex ed lesson? I would also start referring to her as “Clown Car” - but I’m an AH. \n\nI’m way too happy that other people also thought of the clown car comment.", "That was from a very old meme about the Duggars I remember it from my TWoP days", "I feel like that’s a Melissa McCarthy quote?? Idk why but I can picture her saying it. \n\nRegardless, it’s apt.", "I remember that line on a meme about the Duggars.", "Groucho Marx said to the parent of a very large family “I love my cigar too, but I take it out of my mouth every once in a while”.", "One day I will use that on my sil", "That's been around since the Duggars only had [14](https://imgur.com/gallery/R0rCS) kids.", "Really? That’s what you’re proud of? A gross, crass description of someone’s genitals?", "Right? lol", "Same here.", "Your username fits perfectly with your comment", "yeah even at the end of that post she’s watching 2 in the morning and grandma put one to bed that night while mom ran off to the car", "Yes, plus the absolute AUDACITY that Laury has for ignoring OP and blaming her for \"ruining her family\" and then also expecting OP to give her free childcare is just.. unhinged mental gymnastics to say the least. What a selfish awful person the big sister is.\n\nNTA", "OP also needs to stop helping. If they are so great parents, they can take care of the kids. Or let her unload it Laurie's father who fancies shouting at minors for speaking the truth. NTA for sure. They are royal assholes tho.", "If 4/6 kids are planned, I’m not sure learning to use BC will help.", "They all live together. Sounds like she has custody, but she's just used to other people watching the kids whenever. That doesn't mean she doesn't have custody.", "I think they all live together. Got the strong sense the older sister lives with the mom and younger sis and all the kids are just raised by whoever the fuck happens to be around?", "All this and wtf is Laurys father even doing to help?", "6 children is also ridiculous when you're 26! Like holy shit if she keeps going, she's going to reach Nick Cannon numbers.", "> I think 6 children is fucking ludicrous\n\nDoes anyone think that our current population is sustainable? IMO even just replacing yourself and your spouse is shitty. Having more than that means you're totally cool with there not being enough resources for everyone. Hard to say you're not an asshole even maintaining the current over populated earth.", "I know some people can look after 6, but I just don’t understand how anybody manages to! It’s so hard with just 2, I’d no way manage 6.", "This is idiocracy happening irl.", "Overpopulation as an issue is exaggerated, most countries have declining birth rates at this point. Having six kids is an issue because there is close to zero chance that every one of those kids will receive the attention they need and deserve.", "The twins only count for one haha.", "Ah, but consistency would mean this post is real, which it most definitely is not.", "Once you need a second hand to count them, does it even matter?", "i would argue it is her place to say something since she’s often stuck taking care of said kids. nta", "She's not at all the TA for speaking the truth, even if it hurts them. \"Bruh\" is putting it mildly, I'd have gone with \"what the fuck is wrong with you\" personally.", "You don't actually have a fully developed brain until you're about 25.\n\nNot judging anyone here, but that's the biological truth.", "This is what I am wondering. Why are they all living with grandma and not mom? If I was grandma I would have stopped the enabling after the twins. Mom should be taking care of her own kids and they should be living with her.", "Because she knows OPs mom will take care of it and do the hard part while she gets to do Kodiak picture moments for attention", "I was getting the impression that Op, Op Mom, Op Sis, and all the nibblings live together.", "Yeah, at this point she's not a mom. She's a breeder. Thats it.", "lack of education = stupid people having teh most kids", "DING DING DING! Yup. If you’re relying on everyone else around you to take care of *your* kids then you shouldn’t be having kids to begin with. I mean seriously, what happens if the mom gets cancer or breaks her leg or gets in a car accident or gets COVID?? What then??? The sister won’t have all that free labor to rely on anymore, and I highly doubt her Dad is gunna step up and wrangle all those children, or her boyfriend. \n\nI am of the opinion that having more then three kids is abusive to all future and existing kids. I’m sure some families can make it work, but everyone I know who grew up in a family where they had more then three siblings experienced some form of (usually unintentional)neglect. Medical issues slipped through the cracks and got overlooked and exacerbated, possible abuse outside the home goes unnoticed, older siblings were parentified, important milestones/life events are missed, and none of them get the mental/emotional support they need or the one on one bonding time with a parent that is crucial to a child’s overall development.", "Tbh, with how her mom reacted, it's clear she's struggling too. Wouldn't be surprised if this turns out to be the trigger for mom to realize this isn't what she wants to be doing.", "Yeah, justified NTA.\n\nI'd go as far - farther than most probable posters - that Laury basically owes it to her other children to abort the current fetus. What she's doing is crazily reckless.", "Because then Dad would have to say no and would probably start being forced to confront how bad of a father he is for enabling this bullshit", "Amen.", "Judging by the number of kids, I'm pretty sure what Laury is doing..", "I TRIED TELLING HER THE NAMES WEREN'T GOOD. \nshe told me they weren't my kids.", "I mean that age gap makes me wonder if theirs not something more going on- is OP sure that Mom is mom?", "No way it’s less than four different fathers", "Totally agreeing with this.  Refuse to compromise your studies because the babies need care, if you can't move out now do as much studying as possible in a child-free safe space such as a library, earn what you can and save it all, and when your mom wants you to look after the niblings - tell her to ask the children's actual parents to do it.   If you want to go to college, start working towards scholarships NOW, talk to your school counselors about how to qualify and how to start the application process, because that's your best ticket out of that house. \n\nYou've said what your parents think, but what they are unwilling to say. Follow it up with action.", "This here 🙌", "I was thinking the same thing, so I did some digging. \n\nI think it was the one where the sister says “again?” when her sister announced she was pregnant with twins. \n\nhttps://reddit.com/r/AmItheAsshole/s/c5gruWLexP", "No, but I'm sad to hear someone else is going through this :(", "Yeah, if it was just \"bruh\" it would have been hilarious as an unintentional reaction. But then going off about financially supporting the kids really isn't the 16-year-old's place. That's the sort of thing that should come from the parent. OP could have potentially been okay if it was only about what OP was being made to do to help, but veered off real quick. And then swearing at the sister was an AH move too.\n\nWe can only hope OP's sister's prenatal care provider brings up permanent (or at least long action) birth control methods. Once someone hits the 7th child range it starts getting brought up, even if the parent is still relatively young.", "Everyone’s acting like it’s perfectly okay for this 16 year old to tell an adult how to run their life. The “we can’t keep doing this forever” implying that any of the money belongs to OP. 🙄", "Who the fuck believes this soap opera level nonsense", "Because idiots keep having children", " Those are her grandchildren. The legal duties may be limited to her underage offspring, but the biological imperative extends far beyond it. The childcare for her grandkids is not a \"favor to her daugther\", but an endeavor (at least half) as valid as caring for her daughters.  \nHaving children is not something one should \"stop enabling\"", "She’s such a great mom she ran out of the house and left at least one child behind…", "You lose the right to tact and diplomacy when start hurting others- like when you pump out kid after kid just to neglect them.", "Yeah, on the behalf of autistics everywhere, never blame calling someone else a bitch on autism. There’s directness and bluntness, and then there’s using intentionally insulting language. If it was about this, then I guess I’d say ESH, but given OP is a child themselves and has been saddled with responsibilities from the sister’s choices, overall definitely NTA for letting out a “bruh” at the news.", "Oh her behavior is boorish when left to watch her sisters children?  Come off it.", "There’s no way nowadays parents can take care of that many kids . And it’s their duty to take care of the kids they made. Not their parents nor aunts nor neighbors nor babysitters. It’s tough being a young mom to two kids and give them enough attention and affection. It’s impossible she gives all that to them all. \nAnd if that’s the case, they’re not being good parents. \n\nSimply my opinion, please don’t hate on me.", "No, I mean her boyfriend lives with us but he's said he wants nothing to do as a parent when it comes to this stuff since he's been with us for 8-9 months by now so he's not really a \"dad\"\nJust a guy my mom dates who brings home McDonald's,", "I’m hoping OP is just a fan of the show and used those as fake names cuz yeah yikes", ">Laury's dad is just an AH.\n\nI'd say he's the biggest one in this story. He's defending Laury, and you just know he isn't doing a damned thing to help his wife out with the child care.\n\nHe'd probably be dumbfounded. \"Naw. Dat's wimmun's werk.\"", "I agree! A lot of nta votes but I would say esh too. OP is not wrong, but he behaved like an AH.", "It’s my biggest pet peeve when I see people do this, I totally agree", "It is OP’s circus tho considering the kids are being shuffled over to OP and her mom.", "Except the fact that she is taking care of these children more than their mother and she is about to lob another one at them kindof does make it OPs circus. At the very least she is having to take care of someone else’s monkeys.", "What’s the sisters excuse?", "Laurey's pregnancies impact OP's life, because they're being used for free care, I think that gives them the right to be angry at more work literally being created for them.", "It has everything to do with the OP, and the OP is well within their right to judge.", "I will give you that. She is probably fully aware of what SHE herself is doing. But like a horse with blinders on, narrowing it's vision to what is just straight ahead. She is either wearing dumb or self-centered blinders, and she might not seem fully aware of what she is doing or the consequences of her doing to her family. \n--or she just dumb/mean", "I mean she’s watching the kids so she has every right to comment.", ">But this isn't your fight\n\nOP had to help with the kids as well, so it kind of is.", ">But this isn't your fight, that's your mom's call to claim she is fed up or not\n\nExcept that OP is also getting roped into taking care of Laury's kids", "-19? pft\n\nThe AITA AH-circlejerk(aka support group) strikes again!\n\nFriend all your points are true and these nimrods just don't want to hear it.", "I mean, OP is already being pressed into service as free childcare and probably the future source of support once Laury sucks mom completely dry. OP was doing it for themself as well as their mother.", "Seems to me she's watching two of them today so she has plenty to say about it...", "But it affects OP. You say it's not the place of a 16 year old to say she can't keep supporting her sister, then her sister shouldn't rely on a FREAKING 16 YEAR OLD!", "The 16 year old is supporting the sister by babysitting the horde and picking up the slack when their Mother can't do it anymore.\n\nShe definitely has a say.", "if a 16 y/o has been doing more childcare than a mother of 7+ years then its very justified.", "Found the father", "Go back to bed, Laury. And for God's sake, close your goddamn legs!", "She obviously should.", "It may prevent child number 8, 9, and 10…", "Yes, abortion is the mortal thing to do.", "I have a 17, 15, 13, and 10, and I work in a school.  I swear every 6th word is \"bruh\".  It is equivalent to \"like\" in valley girl.", "[removed]", "My 5-year-old nephew says it so often that he's got *me* saying it! 🤣", "This sounds hilarious, tbh", "I’m 27 and same", "Me too is it cause I spent years in mmo online communities and the language changed over the years when the young ones came in and I just soaked it up?", "45 and same. It's a great workplace okay alternative to the f-bomb I really want to drop.", "Same I say dude all the time", "Gen X? Is that you? 😂", "Same shit, different generation.", "Bet ALL kids live with grandma - grandpa and boyfriend enjoy runtime with them and mom and OP raise them 🤢", "She(sis) left and mom went to soothe Karl. Yeah they live there.", ">It might be difficult to refuse to babysit while she’s living at home. \n\nWell, they left her with their children: mother, sister, the fathers of the children... everybody left and didn't care about their kids, so it's already happening.", "> Who knows how many more kids her sister’s gonna pop out in that time period.\n\n2, max.\n\nedit: 8, max (didn't see the triplet thing)", "If the kids are dumped on OP against her will she can call the police for child abandonment", "This this this.", "Also deserves a mom who can be there for her. Think of all the high school things she is probably not a part of because mom is too tired and broke. That's sad that she's being robbed of her mom's time and attention.", "[removed]", "Oh no she won't get too her best bet is to get a job save everything and look at colleges.  Meet some friends and maybe some will wanna get an apartment after the first year starting I'm the summer.  Never moving back home.", "[removed]", "Samsies!!! Then when they got older and broke the law apparently it was my fault!?! Like, I didn't tell Chris to drink and drive! I wasn't even in the same time zone as him when he got that dwi!!! Wtf!!! \"If you raised your cousin better he would have known better!!\" Brah, he's 18 months younger than me!!", "Same. All my cousins and any kids of my mom's friends. God, I still have nightmares about it sometimes.", "Me too.  And guess what -  I do not have kids now.  Flat out refused to raise any more.", "I'm guessing there was no talk of paying you either.", "What do you mean you didn't want to raise someone else's kids for them? For free probably. The nerve!", "Hell, my mother lives out of state and comes to visit a couple times a year, and I still feel guilty about asking her to watch the kids (who are honestly old enough to look after themselves for a few hours anyway) so my wife and I can get out for a while.", "Well, you know why. Mom feels guilty because op exists. The sister made her feel so bad for years over it that she'd do anything to make it up. Not saying it's wrong to feel guilty but what's done is done. Don't become a doormat to your kid over it.", "Generally you only need to wait 6 weeks after birth to have sex, not 9 months.", "/r/badwomensanatomy/", "THANK YOU", "Ah so will this one be a wizard then? Or does it need to be the seventh son of a seventh son? I forget...", "Often happens in fake posts.", "yeah this is where I was sure. couldn't keep their own story straight and the dramatic word for word retelling.\n\noh and the autism twist at the end for that reddit buzzword bingo.", "I mean I love sex but come on get fixed at that point right??", "WHY?!?!?!", "It’s a saying that’s been around for years, if heard it since I was a teen and that was more than 20 years ago.", "TWoP! I have mugs and t-shirts.", "I think “bruh…” was a perfect response (maybe you should have just left it there, but I don’t blame you for voicing the rest).\n\nBut I sure would love this story better if that’s all you said and your sister got mad because that shit would be funny and you would still be NTA", "Is it possible that you can move in with your dad assuming he and ur mom are no longer together and he's still an involved parent?", "Lmao. NTA. I would have probably said the same thing (the bruh part, maybe not the rest cuz I'm very scared of confrontation,  but someone had to give her a reality check. Maybe it was rude, but, come on. Birth control, condoms,  these are all things someone needs to introduce to her)", "NTA and stop helping take of the kids. You don’t deserve to be roped into this circus. Fuck that.", "Emancipation. Now.", "I picked up on that too. At least 3 of those kids spent the night with OPs mum looking after them instead of laury and it didn't seem to be for any particular reason, like a date night or something. Is OPs mum basically their parent at this point?", "That’s a lot of expectation from your family for someone who can’t keep her legs closed.", "Yeah, re-reading im inclined to agree with you.", "Probably money and the list stops there, has zero idea of what she does day to day which sounds like the square root of fk all for her kids and let's her mom do it. Mom at this point is lighting herself on fire to keep them warm", "Earning enough for a family of 6 kids with a 7th on the way can't be easy. Lets say 13k per year per kid so he needs to earn 90+k just for the kids. If he doesn't have a decent job/skills/degree I can see him needing to work strenuous jobs with long hours.", "I know a woman who had 4 children before she turned 22. Her oldest son grew up and started fathering kids left and right, had 3 by 21. It sounds like a hard life and I don't know why anyone would choose it.", "The current population is actually experiencing a decline, especially Asia. I made a comment above stating how many countries’ median age is rising much higher and fertility rate is declining. In fact, my ethnic country, Korea, is dying off.\n\nBut yeah, 6 kids is a lot because it’s clear in this situation that everyone isn’t receiving the care they need and OP/OP’s mom is forced to take care of OP’s sister’s children.", "resources are not equally distributed.", "I always assumed that posts were generally real but once I started reading ppl commenting the absurdity of some and thinking vack to some of the stories, I realized it cant all be real......this certainly being one of them with the tell tale sign", "I mean, do you have the proof to back this up? Sure, it's reddit. People make up shit all the time for fake internet points. But saying something like this is fake? I'm not so sure. I can't definitely say that it's fake. These kinds of situations happen a lot, more than we are even aware of, I would imagine.", "Even if she wasn't stuck taking care of the kids it impacts her- her mom quit her job to raise her sisters kids. That's costing OP opportunities that would otherwise be available to her- be it extracurricular activities they can't afford/don't have time for, college funding, ECT.", "yes exactly…they are talking about the 26 year old", " Those are her grandchildren. The legal duties may be limited to her underage offspring, but the biological imperative extends far beyond it. The childcare for her grandkids is not a \"favor to her daugther\", but an endeavor (at least half) as valid as caring for her daughters.  \nThis is nothing that needs to \"stop being enabled\", it's not up to some random reditoor to tell to a woman to stop raising her extended family.", "Wait, now I’m confused. At 9 years old you told her the twins’ baby names weren’t good, presumably because you’d read those books????", "Naming twin sons after characters that not only slept together, but one murdered the other??? That's, uh, bold.", "& the, “You know WE can’t keep supporting you.” 🤔🤔🤔", "Because even though she's only 16, she has to take care of her sister's children with her mom. In that way she literally IS supporting her sister. It might not be direct financial support but it is support that allows her sister more financial and time freedom. Otherwise her sister would either be forced to care for her own children (oh the horror!) or pay for daycare or a nanny. The sister is still financially benefiting from OP and her mother's continual unpaid labor in caring for sister's 6 children.", "And since their mom put him back to bed, the implication is that he pretty much stays there full time. But that child is nine-months old.\n\nI'm not a parent, but do nine-month-olds sleep in beds, or is it best that they stay in cribs. Although at nine months, it's quite possible he's walking.\n\nI really despise the dad in this story. \"Laurie's a great mom!\" says the one who obviously isn't doing a damned thing to help with the child care.", "I read it as her having left all 4 boys at least, since OP had to watch them the next morning!", "That's a very self-righteous position.\n\nDo you imagine that calling her sister a \"selfish bitch\" will do anything to correct the problem? If anything, Laury is likely to keep pumping out kids just to be spiteful.\n\nIt's not a question of what Laury has supposedly \"lost the rights to.\" The question is, \"What's the best way to deal with this problem?\"\n\nCalling her a \"selfish bitch,\" while Laury may have deserved it, isn't likely to open the channels of communication and address the problem.", "Yeah, I would say that calling someone a \"selfish bitch\" at the dinner table, in front of her parents qualifies as \"boorish.\"\n\nShe could have made her point without doing that.\n\nCome off it yourself.", "If you look at Op's comments, nope. The names are real.", ">\"Naw. Dat's wimmun's werk.\"\n\nWhat accent are you trying to replicate here?", "Are there comments elsewhere you're basing that on? I didn't get that impression from the OP", "Not really. She’s 16. She’ll be out sooner than later. Unless she continues to blame her disability. She’s aware of what she said and how inappropriate it was. Big sister needs to stop popping out kids. But ultimately the mother is letting this happen. So mom is the biggest AH. But OP, in the end, is responsible for what she said. Which is what she was asking about.", "It really doesn’t matter. OP is trying to justify her rudeness on her autism. She knew as soon as she said it that it was the wrong thing to say. She’s trying to justify it.", "[deleted]", "She never mentioned that she’s being forced to do so, and she can certainly decline.", "OP is volunteering into this free service out of guilt. Can always opt out and if their parents force OP to take care of the kids, then OP can simply say that it wasn’t their decision to be reckless with popping kids left and right, so it’s not their problem. OP can only set boundaries for themselves", "She's not relying on a 16 year old.  She's relying on her mother.  Presumably this 16 year old kid just still lives with the mother and doesn't want to help take care of a bunch of little kids.  Which is fine, I get it.  But I think it's a safe bet that she's not the one baring the brunt of the time or financial burden that laury is putting on the family.", "SHE’S AN AMAZING MOTHER, MY WIFE’ DAUGHTER IS A LIAR AND A BRAT.", "Most likely too late or potentially illegal at the point of announcement if OP is in the US.", "You've brought up memories of my mom trying to wean me off \"Vally Girl\" lingo", "u/hatefulscottie is a bot, and their comment was stolen from someone else in the thread who'd posted it an hour prior", "Is that nibling from young Sheldon?", "😂😂 it’s the perfect word to encompass “what is going on it’s a bad decision and I’m sick of this happening”", "Bruh....", "It is she dropped a Lego block she was playing with and having trouble getting to fit with the other one and when it dropped she just looked at it and said “bruh” 😂😂", "If you’re 30 bruh was popularized by your age group lol", "At my workplace I'm allowed to swear (it's trucking lol) but I absolutely can see bruh used that way", "YIKES.", "Until she has quads…", "I wouldn’t be so sure, sister has a history of multiples…", "Triplets twice in a row", "Most likely police won't do much considering she's living in the same home. It's also likely that she won't be living in the same home any longer if she calls the police on her mum.", "Every thread there's always some moron with this advice", "She should be spayed. And you must all stop supporting her. You must adore your little ones, but if I were you, I would stop being a helper as soon as you became 18 and move out.", "Easier said than done if they live at the house", ">if you raised your cousin better \n\nWHERE WERE HIS PARENTS???", "Thats fucked up!!!!", "That's so fucked up it cycles back into being hilarious, I think", "Yeah, she expected me to do it for free because we're family", "Funny thing is that it would have been for free. I told her she was crazy 😅", "Yep, exactly this.\n\nOP's sister has had resentment for years because of mom's affair. Guilting her at every turn because her mom ended their original family unit. Sis doesn't think anything of dumping off the kids on the mom because, to her, it's the least mom can do for messing up her life (OP, as well).\n\nOP said exactly what the other adults should have. Mom was crying because she knows that OP is not only right, but that she should have put her foot down with her eldest three or four kids ago.\n\nOP is NTA and truly needs to stop the babysitting. Mom can do whatever but let her know that she's on her own if she wants to continue this vicious cycle.", "Hopefully her sister will get the same treatment from all of her kids. She keeps choosing to have them.", "She’s already announcing she’s pregnant at this point so I’m assuming she’s 3 months along. Depending on how Karl was delivered she shouldn’t have been having sex yet", "Yeah... i cant ger past the \"I told my sister she has too many kids she can't look after\" then she stormed out leaving the kids behind ...", "Yeah, I had a hard time believing Laury's mom welcomed her cheating ex-husband to dinner.", "Also the spelling of the sister's name. Laury/Laurie. Would think she would remember?\n\nIn case it is real, stop helping, and tell your mom that you will well in advance.", "The fact that it was a story about a woman that has babies and  is bad and lazy and got put in her place by a teenager was enough for me. Women and babies are bad. Angsty autistic teens are good.", "It was the dead silence and then at the end \"oh yeah lol I have autism\" that solidified that this is definitely a fake post...   \n\n\nlike, that's seven.. and autism isn't an excuse to get mouthy with someone. yes, if this were real, yeah laury shouldn't have anymore kids but like.. your autism would not be the reason you told her off, cmon, let's be sensible now.", "A very dramatic speech for a teenager at the dinner table.\n\nBut hey. Reddit is clapping.", "It's literally the only way to get anything upvoted on the subreddit is to write a \"woman bad\" story. All the incels love it.", "But how would she get those government benefits?! CPS kept taking her checks- I mean - her kids and she couldn't get a JOB, she needs kids to survive.", "Well, she doesn't like to work and if she pumps out a kid, that's a blank check from the government that she gets every month. Unfortunately, she and my father never got the memo that you have actually TRY to keep that kid alive so CPS kept taking them away. So she'd just pop out another. Rinse and repeat for years.", "Yeah OP deserves to be a teenager, not a nanny", "Date night!?! This broad needs to stay home & take care if her kids! If not for their sake, then for her Mom & to keep from coming home pregnant all the time.", "I couldn’t imagine doing the parenting for my grandkids. That’s BS. She really is screwing herself here", "We had two girls in my high school that everyone swore were competing to have the most kids. Someone got suspended senior year for hacking the score board to say \"Alejandra\" 4 \"Rebecca\" 3\n\nI ran into rebecca and shes at 9 kids now and basically takes up a whole new at her church. Alejandra got her uterus removed at 24 after a cancer diagnosis so she lost the competition with a measly 6", "Could depend on where they're from. A lot of old friends from small towns usually said sex and drinking were all they had to do.", "Cuz they’re fucking stupid. \n\nThey grow up less intelligent because of their relative lack of resources\n\nAnd the cycle continues", "It always seems like children of teen/young parents, often wind up themselves becoming young parents. Not sure the correlation, if it's poor parenting, or being young with a kid is just normalized to them?", "To me it’s super weird that OP named all the kids, and the storytelling feels weird. I don’t think we can be certain, but no, I don’t think it’s real either.", "Etc, short for et cetera", "Idk what books you mean, and I don't like the names either", "Yeah I don’t see how everyone is “NTA”ing this entitled child.", "Because the op is also put in charge of taking care of the children, no?", "> she has to take care of her sister's children with her mom. \n\nDoes she though?  She is choosing to babysit, not being forced into it.  16 year olds can make that decision.", "Yeah, OP babysits. That’s pretty normal for a 16 year old child. These are choices for the adults to make. When I was 16, I didn’t like my parents’ choices so I moved out.", "9 month olds normally are in cribs or pack n plays.. they should not be sleeping in beds. It isn’t safe.", "I mean, you can put a baby to bed in a crib.", "I’m guessing deep south", "Two years is still a long ass time, especially if she’s going to be expected to finish high school(presumably with decent grades) and take care of six children/infants. It’s also unlikely that OP would be able to get a job while taking care of the children.\n\nTheres also the fact that they’re not OP’s kids. The sister shouldn’t expect a positive reaction to “hey, ik I’ve already basically given you five other young children to look after, but now there’s a sixth!” It’s entitled and selfish to just assume everyone will be excited to raise another one of her kids.  \n\nWhile I agree that OP is responsible for what she said, I don’t think it was in any way unwarranted.", "Shame can be helpful sometimes. It's what makes a person clean their house under an hour when they suddenly have people coming over, when they hadn't been able to get themselves to clean for days.\n\nWhether or not OP sister had any shame from her actions being called out, that's the question.", "Yeah but if sisters asking for help then she gets every right to help and make fun of the situation. U sound like someone who pawns off their kids lol.", "OP is a 16-year-old result of an affair in a house dedicated to enabling Laury's whims and bad choices to the point that her mother quit her job and gave up her retirement dreams. \n\nExactly how many options do you think she has?", "did you read the post. Support isn't just financial. If she's watching the kid(s), changing their diapers, reliving he mom then the sister is being supported by OP's unpaid labor. She has a right to say something.", "Thanks", "My wife is a twin, which increases your chances of giving birth to multiples... Luckily we're not trying right now and her IUD is holding the line, but one of my biggest fears is the ol' 2-for-1 special...", "I knew a family that had 1 baby and then had a set of twins. They decided 4 kids was the right number of kids for them and tried for another baby. Enter the triplets. 6 kids under 6.", "ohh shit.\n\n8, max", "Oh okay, I thought OP would be an exception since she’s a minor", "Well I don’t fucking know how it works; OP is a minor and they’re not her kids, what’s stopping her from just not lifting a finger to help them?", "That sentence reads fine as “stop being a helper”. You didn’t birth those children, they are not your responsibility. 16 is a fun age to be enjoying life. Parentification is child abuse.", "You spell it COUSINS now.", "Hahahahahahaha! Bruh.", "Something about cheering on generational trauma doesn't feel right to me. Or maybe I'm just weird.  At the time of writing, you're at a net of 10 upvotes.", "If she's 3 months along, which considering how much she wants to be the center of attention I'd doubt she'd wait that long and most women do tell immediately family sooner than that, then that still puts her getting pregnant at 6 months postpartum. She would have had to have had a truly traumatic labor and delivery for the Dr to tell her not to have sex for 6 months.", "6 weeks is the standard for no sex, for vaginal births and c-sections, not 6 months.", "i found out i was pregnant at 4 weeks, im 31 weeks now. i feel like i’ve been pregnant forever. told my family the same week i found out.", "If mom has OP, wouldn't she be the cheater?", "It wasn't the husband that cheated. Op said \"Lauries dad\" they have the same mum. \n\nBut yes, i have a hard time believing it either way as well.", "The name spelling isn't really anything. I go by Roxy but sometimes spell it Roxie, whichever I feel like at that moment.  So could be the same thing", "Doesn't CPS just take the kids directly after birth once you have enough taken from you?", "Some people like to speed run snap benefits😅", "It’s literally inhumane behaviour. The fuck. After a while they should just take the kid as soon as it’s birthed. No bennys, no baby, thanks for being an incubator!", "How much money can the government possibly give you to make the unbearable pain of childbirth worth it? And the constant pain in the ass of having a literal human being completely reliant on you? You literally couldn’t pay me to have a child I don’t want. Unless it was just an obscene amount of money. Then I could pay for a world-class au pair and therapist for their inevitable mommy issues, a therapist for my guilt, and live a life of luxury.", "I'm a mom of 3 and I really hope I never have to raise any grandkids BUT, I would be open to caring for grandchildren on a temporary basis. I think it's a great thing when grandparents can step in to help when their families are struggling, but from what I've watched it only works with limits. \n\nIn my family there's a grandma and an aunt who have taken in all 4 of the brother's kids at various times and the aunt actually ended up adopting the youngest. The aunt/grandma made it clear to the baby mamas each time they'd take in the kid and help them out any way possible as long as they were actively working on themselves. It worked out great with the first 3 but the 4th mom was waaaaay too invested in pills... adopting that kid was the boundary. After like two years of it being a one sided effort they were done trying with the bio mom and the brother.\n\nAnyway, these women are legit heroes to these kids and their moms and I believe it's because they set expectations and held boundaries. I hope I never have to walk in their shoes but if I did at least I know there's a path.", "Sounds like nobody won that competition", "Brother I have sex and drink but there's condoms and birth control, and know what it means? I can keep having sex and drinking because I'm not taking care of 12 kids.", "Yes we're all from the same very small town so I get the boredom part but it doesn't mean you can't try to prevent pregnancy. I left a lot of details out but trust me- no precautions were taken by these folks to prevent pregnancy.", "It's a vicious cycle for sure. In this case, I think it's the second. I knew them all growing up and she was ON TOP of educating her children about sex and reproduction,  providing them with condoms, birth control, a safe space, anything they needed to not make her mistakes. It worked for 3 out of the 4.", "The show ‘You’ on Netflix has a main character called Joe and in the first series he is obsessed with a girl called Beck, stalks her and eventually kills her. The show came out in 2018, so I assume the twins were named from the books that it’s based on, as the twins were born before the Netflix show came out.", "Because this sub is full of children", "Except it's not her parents making the choice to pop out baby after baby, it's's her sister. And yes, 16 y/o can babysit but taking care of 6 children without compensation almost every day is far beyond normal babysitting. She is a proxy parent to these kids at this point.\n\nAlso, legal emancipation isn't an option for everyone.", "No, we are NOT normalizing children being forced to raise other children. You have no power here, witch!", "Thank you.", "Probably.\n\nNot super thrilled about folks using a regional/cultural accent as a caricature of sexism, especially not in the context of someone having too many children.", "She has 6 kids, 4 of whom were \"planned\" that she can only raise by leaning on her mom for assistance.\n\nShame hasn't been a factor for years here.", "Please explain logically how you came to the conclusion from two comments on the internet. I would love to know.", "The only thing we have control over is our own behavior in life. Nothing else. So all that OP can do is not indulge in any enabling behavior towards the sister or helping mother with the unnecessary stress she volunteered to bring in her life. OP can move away from this hellhole when she’s of age and in the old age when the mom comes to OP for support, she can choose to turn her away and focus on her own life/retirement instead. The mother is making horrible choices for herself, and the daughter (Laury) is following that lead too. They both have to deal with the consequences of their own bad decisions. Why give advice to people who are 1. much older and supposed to be wiser than you, 2. didn’t ask for your advice, 3. Don’t appreciate your advice?", ">My wife is a twin\n\nFraternal or identical?", "My paternal grandmother had two sets of twins. My sisters and I lived in fear.", "I don't plan on having kids anyway but Jesus my uterus shriveled up when I read this 😳", "This is one of those things where OP legally *could* do so.  \n\nHowever, OP is a minor living at home with her parents and likely without her own job/income and so on.  Being openly deliberately antagonistic to the people she's currently living with is an unwise decision.  \n\nThis is one of those situations where OP is legally and morally fine to report it, but on a practical level it's unwise to start a conflict like that.", "Oops, I must have misread!", "I stand corrected!", "They did for babies 7,8 and 9. She had the others out of state. And abandoned baby 12 when she realized that the baby was going to cost more than she would get in benefits. I don't think she named the baby, she disappeared that fast.", "Unfortunately not usually. Each new child is treated as a new case though the evidence does stack up more quickly", "She is THE welfare queen.", "They did for 3 of the kids.", "True", "This guy fucks", "True", "I guess Cain and Able are just out of style", "Joe and Beck are common enough names to have been thought of independent of You.", "40 year-old mom of 2 here. This 16 year old IS part of the \"we.\" They are obviously watching and helping bring up the children while the mom is doing fuck all. A 16 year-old is also a child. Not an entitled child, but a child. They have a right to their feelings, especially when they aren't even able to be a kid because their grown ass sister can't keep her legs shut. If I'm bringing up two kids, I have a say in what happens in their lives. OP is helping with the upbringing of their nieces/nephews, so they should have a say. Maybe OP could have thought to wait until after the announcement and taken sister aside to talk to her about the impact this will have on the family, but I fully understand their POV and agree.", "You really think this 16 year old is an indentured servant? Please \n\nYou can see from the way that the conversation went, that OP, like many 16 year olds, is very dramatic. I would hazard a guess that since Gma built a nursery, she does a lot of the work. And yeah, most parents expect their children to deal with whatever circumstances are present in their household until they grow up and move out. OP talks shit on their sister getting financial support from the parents, it’s not their place.", "Not if she's so self-centered, that if no one else was truly complaining about it, would she think anything was wrong with what she's doing.\n\nI hope OP gives us an update on whether her sister pulls back on her laziness, or even better that the mom starts saying no and erecting boundaries.\n\nBut you're probably right, if the sister had any shame she's learned to live with it this long.", "Ur real defensive of a person who is clearly in the wrong. My guess is ur projecting, or plan to do the same thing. It is just the internet, but the offense ur taking indicates I’m on to something. I’m not taking u to court and accusing u to ur friends and family, I made an observation on a forum post.", "I belong to the Fraternal order of Twins", "Bruh!", "💀💀💀 goddamn", "God damn, poor kids. My mom was pretty shit, but that's next level.", "This is beyond queen. She's the welfare empress.", "That definitely is an appropriate use of the word bruh.\n\nBruh.", "I actually listed out some of her abuse and was informed that it went against the Geneva convention. I was 3 years old and my mother was committing war crimes against me. Somehow she didn't end up in jail.", "That's seriously fucked up. I remember reading that some things that are against the Geneva convention and are war crimes aren't all technically crimes when done outside of war.\n\nI believe it was in regards to some of the things the police were doing during the George Floyd protests. \n\nHope you're in a better place in life now."]}