{"id": 28704, "submission_id": "175fcnf", "title": "WIBTA if I dont give my half sister anything from my fathers inheritance", "selftext": "Some context my dad passed away a month ago and left a pretty massive inheritance to me accounting for his life insurance his businesses and his houses its more cash than i could reasonably spend in a life time. So heres where my moral dilemma begins my parents divorced about 6 years ago when I was 14 and my half sister was 11 cause my dad figured out that she wasn't biologically his. My dad wanted nothing to do with my sister or mom so ive been no contact with my mom and low contact with my sister.\n\nIm currently wondering if i should give my half sister a bit of my inheritance cause i really dont need all that money  and she did lose her dad cause of what our mother did so shes really at no fualt here for loosing her inheritance. However I do know that my dad wouldn't want any of his estate to go to her", "created_utc": 1697034574, "permalink": "/r/AmItheAsshole/comments/175fcnf/wibta_if_i_dont_give_my_half_sister_anything_from/", "score": 114, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > for not giving my half sister anything from my dads inheritance\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You would not be t a if you do that.  But, keep in mind, this is entirely up to you.  Don't let anyone pressure you into doing anything. *You're very young, and money grubbing people will think they can manipulate you because of that.*   I see that a lot on Reddit. \n\nIF you decide to do this, don't tell Mom. Don't tell anybody. Go to a lawyer, and set up a trust (or whatever it is in your country) so that she can get a portion you deem worthy when she comes of age - or an age you feel would be appropriate. For some countries that's 18, some it's 25, it varies.  Protect yourself, don't let the vultures come pecking at you for money.  Make them talk to the lawyer for anything involving money, so it takes you out of the equation.  It will be much easier for you to say, \"Ask the lawyer\" if someone shows up at your doorstep begging for cash.  Then, it's the Lawyer that says no, not you.  Does that make sense? \n\nAnd you would not be an a h if you decide not to give her money right now, you don't have to do anything ever, really.  Your Dad was punishing the kid, and the kid's not at fault, but then, neither are you.   I don't think you'd be wrong if you kept it, or if you gave her some.  \n\nThink about it this way.  Now that you have inherited this money, it is no longer his.  It is yours.  Do with it as you please.   But don't feel pressured into doing anything right now.  *Research your options, and take your time.* This just happened a month ago.  \n\nYWNBTA, just be careful.  But even if you don't do anything else, keep a lawyer on call.", "NTA Your Dad left it to you you are not obligated to share with anyone. I understand how you feel because your sister did nothing wrong she believed that he was her Dad. \nYou mother on the other hand really well cheating, lying and completely destroying your family yeah she’s awful.", "This is now your money to do with what you please. I don't think it really matters if your dad didn't want any of it to go to her. He got his wish and it went to you. Now it is your money to do with what you want. \n\nBut I will say that it's not really fair that you went low contact with you sister. She already lost the only father that she knew. She basically also lost a sibling. It's not her fault that your mom cheated and she was the product of that.", "NTA.\n\nWhile it's a nice gesture, you're not obligated to give her any of the inheritance. Your father left it to you. Of course, that means you can do with it what you want, including not sharing it with anyone.", "She's not entitled to your father's money, but, if you feel like giving her a part of the inheritance it's entirely up to you. On the contrary, if you don't feel like giving her a piece of the pie, it's also entirely up to you. YWNBTA on both scenarios.", "The money is yours now, you can do whatever you want with it", "It’s really up to you. You dad is gone and the money is now yours. I don’t think either way you go is wrong.", "NTA / YWNBTA - Sorry for your loss.\n\nThe money is yours now, you can do with it what you wish. You're not an AH regardless of what you choose to do.\n\n&#x200B;\n\n>However I do know that my dad wouldn't want any of his estate to go to her\n\nThis is kind of moot, though. He doesn't really get to decide for you anymore. I mean, what if your dad said, \"you get all my money, but I want you to use some of it to make annual donations to a Neo-Nazi foundation\" or \"you get all my money, but you have to give up that one hobby you enjoy immensely that I never approved of\" as his last wishes? Would you still feel obligated to do so?\n\nHis wishes aren't really relevant at this point. What happens with that money is up to you. And you can decide what to do with it regardless of what you *suspect* his wishes may have been (assuming he never actually wrote down he didn't want your half-sister to see a dime, given your wording). For all you know, he could have been regretting his actions towards the end of his life and never got a chance to update his will.\n\nLike I said, you're not an AH regardless of what you choose to do. But I wouldn't use the \"my dad wouldn't have wanted it\" thing as an excuse. That's a foundation that will rapidly crumble as we ALL make decisions, good and bad, throughout our lives our parents disapprove of and I'm sure some of that money will be spent on those decisions.", "So wait, your dad raised your sister for 11 years and then abandoned her. \n\n\nThe person I feel most sorry for in this situation is your sister\n\n\nBecause of her parents actions she lost the person that raised her, I'm assuming her biological father isn't in the picture. \n\n\nHer brother also stopped contact with her (you haven't said why) \n\n\nAnd now her brother has come into a massive inheritance and doesn't consider she is entitled to anything. \n\n\nTo be clear, none of this was her fault, but she seems to be the one punished the most", "INFO-   Is she demanding/asking for the money or what discussions have you had with her about it and what is your relationship with her, generally, i.e. why is it low contact?\n\nIs your mom pestering you to give your sister money?\n\nMy vote will be NTA either way, as no one is ever an an asshole for not giving away part of their inheritance, but I think this is important for context and a more nuanced understanding of the situation.", "NTA\n\n If your dad wanted the money to get to her, he would've left it to her. It's not her fault, but she isn't his daughter. By that logic, you can give it to anyone else.", "NTA\n\nIt's your inheritance. Do what you will.", "YWNBTA if don’t give you’re half-sister your father inheritance because she’s not entitled to it. \n\nMy question is would you feel guilty if you don’t give her anything ? If yes then maybe can set a trust fund for her college studies. If not then keep everything for yourself and enjoy it.", "I can't imagine being a child  and my dad suddenly says, you're  not mine, so get out of my life.   Poor kid.\n\nNTA  if you keep it all.", "NTA. The inheritance was meant for you and you alone. It is what your father wanted. \n\nYou wanting to share it with her and thinking about her does show how generous and nice you are. Wishing you the best.", "NAH (except your Mom and Dad)\n\nThe way it sounds is that your half sister was the one who has lost everything here. Her Father, her family, and now what would have been her share of the inheritance - through no fault of hers.\n\nBecause the inheritance is (as you have said) 'more than you could reasonably spend in a lifetime' then the right thing to do, would be to give her some of it. You dont need to give her half, but a nice amount would be wonderful, and would be fair.\n\nYour Dad is gone, and so he has nothing to do with any decisions you make. He left it to you, so now its rightfully yours to do with as you please. If you wanted to give the whole entire lot to Charity, it wouldnt affect him in any way -- so the same holds true if you wanted to share some of it with your half sister.\n\nBy the same token, if you wanted to keep the entire thing for yourself, you wouldnt be the Ahole either, because it was left to you, to do with as you please.", "NTA\n\nHowever none of this is your sisters fault and she was denied a father and sister in all of this.  This mess is probably on your mum.\n\nThe money is yours and it doesn't matter what he wants done with it now he has gone.  \n\nIf you have more than you would ever need then it would probably be nice for your sister to have something for her future.  If you ever want a relationship with her in the future this is a very good way to build the first bridge.", "You can help and still get it so that your mother (the instigating partner here) can't touch it.\n\nSet up a trustfund, for education, and for other life events. But make sure you have all the control of it, so that your mother can't handle anything of it.\nThat way, you won't be leaving her (sister) dry, but your mom gets nada.\n\nNTA", "NTA.  Set up a trust for her. Don't tell her because then mom could find out and try something. Tell her when she is old enough mom can't touch it.", "YWNBTA if you gave your sister some. If anything, what you could do is set aside an amount of your choosing for now into its own separate account, and then give it to your sister when/if you feel the time is right. You didn't say how old you both are now, but if she's not hurting for money ATM, there's no reason for you to rush to a decision. Just do yourself a favor, and try to keep it purely between you and your sister if you do give her money soon. I don't know what your mother is like, but anytime free money comes out, people tend to look for free handouts.", "NTA, it's your money now, do whatever you want with it. If you do want to give some to your sister, I suggest you talk to a lawyer about setting up a way to guarantee that your mom can't touch it.", "NTA but get a lawyer. Shit is about to go down.", "NTA. It's your money now and you can do what you want with it. You're under no obligation to part with any of it but if you want to try and mend the bridge with your sister and you've got more money than you can spend there are worse ideas than buying her a house or whatever. If you're not that fussed about your sister and you just wanna feel less guilty about having way too much money, there's a lot of worthy causes out there that will not say no to a few grand. Do what feels right.", "YWNBTA whatever you decide to do.  Your sister is almost an adult, so, especially if she moves away from your mother, you can decide if you want a relationship.  Your Dad probably wouldn't approve, but it's up to you, now.   Whether you are close to her or not, you might consider helping her with college if she doesn't otherwise have the money, or helping her establish herself as an adult, e.g., give her a down payment for a condo.\n\nOnly do this if you want to, don't do it out of guilt, or allow yourself to become an ATM, especially for your mother.", "Hi its me, your half sister.  Yes you should give her a bunch of your inheritance.  \n\n\nNTA- It was your Dad's money to do with as he pleases.  He chose to leave it to you so its 100% yours.  If you want to give some of it away you have that right, but you wouldn't be wrong to keep it either.  Don't let anyone guilt you into anything here, they would still be LC/NC if you didn't have money.", "Info: why would you go low contact with your sister when she’s an innocent party in this?", "NTA either way.\n\nYour father left the money to you.  Now it is up to you to decide whether to give some of YOUR money to YOUR sister.\n\nAnd I say \"sister\" because even if she had a different sperm donor, you were her big sister for the first 11 years of her life at least.  And as you say, none of this was her fault.\n\nIf I have the math right, she's 17.  Fully funding her college would be a great start.", "NTA OP. It’s a great thought. However, I’d suggest you set up a trust fund for her or make sure that her education is taken care of, without your mom having any access to the money.", "That money is now yours now, no strings attached. Follow your good instincts. Do the kind thing and help out your sister.  As you say, she did nothing wrong and this rejection from the man she believed was her father (who in all the ways that counted WAS her father) had to be devastating.\n\n&#x200B;\n\nEdit: I misread the title and I thought you wanted to give your sister the money (what I get for multitasking). You don’t HAVE to give your sister anything so you’re NTA. Hopefully, you hold yourself to a higher standard in life than just being not an asshole.\n\nWhether or not she is your dad’s bio child, she is your sister. At 11 she suddenly was rejected by her father and, apparently, by her sibling, too, for reasons that she probably did not even completely understand.\n\nYou say that you now have more money that you can possible spend. You are not an AH if you keep it all. But a good person would share it with their sibling.", "NTA respect your father's wishes and keep your money", "NTA\n\nyou already have your answer **\"However I do know that my dad wouldn't want any of his estate to go to her\"**\n\nAbide by his wishes, if he had wanted any of it to go to her he would have left it to her", "NTA. She's didn't lose a dad. He wasn't hers and they have no contact with each other. He wanted YOU to have the money only.", "NTA - but it’s not his money anymore. It’s yours. He left it all to you so you could decide what to do with it. If you think your half sister deserves some for being a victim in all of this as well, then why not? Or give what you don’t need to charity. Plenty of ways to do the right thing with all that money.", "Is not up to your dad. Its up to you. Your money and you can give it to anyone you want", "If you like your sister give her some money. Simple.", "I'm very sorry for your loss. It is your money to do with as you please, but keep in mind your half sister did nothing wrong. She was just born. I think your dad's anger and hurt was misplaced and she ended up paying for your mother's actions and lost the only man she knew as her father (twice). Whatever you decide to do, do it with the above in mind and do what YOU want not what you think your dad (who was still hurt and angry) would want.", "Do you love your sister? Do you want to keep a relationship with her?  If would be a kindness to help her out.  You don't owe it to her, but since you are never going to be able to spend the money, why not, just to help out someone you love? But it is your choice. It wouldn't hurt to help some now, and then more later when you guys are both older and more nature.", "Your a wonderful sister what a amazing gesture for you little sister your are right she did nothing wrong and your kindness she will remember forever", "Yes\n\nYou're talking about a completely innocent child and the childish adults treating her as an object rather than a human who had zero responsibility in the circumstances concerning her birth. I hate cheaters. But more than that, I hate those who are so selfish that they blame the innocent child. Their common denominator is that no one is more important to them than themselves.\n\nYou get to decide who and what you are. Are you your parents?", "YWNBTA and I think it’s kind, specially if it’s a lot for you. It doesn’t have to be too significant.\n\nAdditionally if it’s really that much pls throw a few thousand my way - it would make all the difference for me and all the good karma will come your way 😅", "NAH  regardless of what you do. But I think you should take your father out of the equation and decide what you think is the right thing to do. \n\nPeople tend to use \"but dead relative would have wanted...\" as an excuse to do what they want to do. Sometimes it's greed, sometimes it's pettiness. Sometimes it's \"justice\" against people that have abused or mistreated them. All of these are OK. I just point this out because it's very easy to hide behind a dead person's wants and needs. But as sad as it is that your dad is gone, he is not here anymore and his feelings died with him. \n\nYou need to do what you think is the right thing to do and what will help you sleep at night, because you're the one that has to live with yourself. \n\nIf you're looking for an excuse to give your sister some money, your father obviously wasn't an amazing guy if he immediately ditched an 11 year old girl that he spent 11 years building a bond with, out of anger for his ex-wife. Even though obviously she sucked for cheating, he punished the child he spent 11 years raising and knew no other dad. Your sister lost a dad and a brother that day. \n\nIf you're looking for an excuse to keep the money, your father left the money to you, and it's yours. You have no legal obligation to share anything with anyone, and this money will help you live a comfortable life. \n\nWhatever you do, just understand that this is your choice, not your dad's choice.", "YWBTA\n\nYour sister had no control over what your mom did and your dad dropped her like she helped plan the whole affair. That's disgusting. Don't be like your dad. Don't be disgusting and abandon her to because your mom was unfaithful. She literally had no control over it. Plus your dads not here. His spirit isn't going to come back and haunt you if you help out your half sister.", "You and your mom are both ahs in this story. Your mom for cheating and you for going nc with your sister for no reason. I feel bad for your dad and sister.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSome context my dad passed away a month ago and left a pretty massive inheritance to me accounting for his life insurance his businesses and his houses its more cash than i could reasonably spend in a life time. So heres where my moral dilemma begins my parents divorced about 6 years ago when I was 14 and my half sister was 11 cause my dad figured out that she wasn't biologically his. My dad wanted nothing to do with my sister or mom so ive been no contact with my mom and low contact with my sister.\n\nIm currently wondering if i should give my half sister a bit of my inheritance cause i really dont need all that money  and she did lose her dad cause of what our mother did so shes really at no fualt here for loosing her inheritance.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. As you've stated, it's entirely yours. If it's too much that you could ever spend, you can technically afford to give her some but you certainly don't have to, especially since your dad would not have wanted her to get any", "I’m going to go NTA either way as it’s your money now. Do with it as you see fit.", "it’s your call, I think either way, YWNBTA - your Dad cutting her off was kinda petty, it’s not her fault she isn’t biologically his and that must have hurt her in some way, it might be a nice thing to give her some money but like it’s not a necessity", "NTA for giving her some money. It really wasn’t her fault your mom cheated and at some point your father did love her as his own for many years.\n\nMaybe set aside money to cover all of her possible schooling and education, with enough left over for a reasonable down payment on a house.\n\nYour father did give you the money, but in the end it is yours and ask yourself if it is fair to punish her for something she didn’t do?", "NTA whatever you decide but consider helping with university education as she was an innocent child and did nothing wrong.", "NTA. The money is yours todo what you wish with it but it would be nice to maybe help your sister with college or give a bit of the money to her. Obviously,  you don’t need todo this but it would be nice especially since even that leg up of not going to school with debt is pretty invaluable. Your mom’s the one who did something wrong not your sister.", "I don’t think you would be TA Op, no matter what you decide to do\n\nI would probably give her some of the money, but I’ll admit I don’t really care all that much for money outside of it’s necessity anyway", "You have to live with the decision , be ok with the person looking back at you from the mirror.", "Did he remove himself from her birth certificate?", "NTA.  It was left to you so you can do what you please.  If you do give her some make sure she knows it's for her, not mum.", "NTA whether you give your half sister some of the money or not. The money is yours to do as you please.\n\nIf you do want to give your sister a part of the inheritance, set up a trust.\n\nDo not tell anyone about your inheritance, and refer all requests for money to your lawyer. The vultures will be coming for you shortly.", "Yes, your father didn't leave anything to her.\n\nBut this is YOUR money now.\n\nINFO : I pressume NO ONE is pushing you, forcing you, manipulating you, etc,  into doing this.\n\nIf YOU honestly want to give something to your half sister, you CAN.\n\nAfter all, your father's grudge is with your mom. Unfortunately for your sister to him she was the living testimony of what her mother did to him.\n\nNTA", "Нет не стоит", "At the end of the day, its your money and your decision to make. Unless if someone is pressuring you to do it. \n\nI dont know how much money it is, but unless we are talking several millions, you may need that money for the future: good house, car, day to day stuff, not working so much, trips, etc \n\nI guess if your father wanted your sister to have his money he would leave it to her also. Would he be upset if you did this?! \n\nEven if you end up dont share your money, you can help your sister, maybe pay her college tuition or something like that\n\nYWNBTA", "NTA! \nIf you want to give your half sister anything you need to keep quite. Set up a trust fund/college fund.", "YWNBTA - But if this were me I'd setup something to help with education for her. But no judgment if you don't decide to do this.", "NTA This is all on your mother, not you. Not everyone gets a big inheritance. Not everyone gets any inheritance. If you want to give your sister a gift, go for it, but the fact that you have inherited from *your* father, not hers, does not play into that at all.", "NTA. It's your money to do as you please, not his. You have no obligation to give her any, but I do encourage you spread the kindness and forgiveness your father never did and give her some. After all, someone needs to break the generational logic of \"F-U, I got mine\".", "It would be a nice gesture,  but not an asshole if you don't", "So where is her actual father?", "NTA.  I guess you can share your inheritance if you want.  You're not morally obligated to do anything since she's not your father's daughter.  Before you do anything at all, discuss the money with a financial planner.  Setting up a trust for your sister may be more practical than handing her a big check.", "NTA but YWBTA .. your poor sister lost her dad in one of the most devastating ways. Abandonment.  This isnt your fault and legally you are not obligated BUT \nYour dad owed her much more and if you can make things better for her then something is better then nothing. (Help with education... anything)\n\nI am sorry for your loss too", "NTA. \n \nTake the money, and do as your father wished. Deposit it in your bank account. Open your bank app and repeat the incantation \"this is my money and I'll do what I want with it.\" as many times as you need to. Then do whatever you decide, it's your estate now.", "Sorry for your loss. \n\nYour sister didn't do anything wrong and it would be a kind and generous thing to do to make sure that some of YOUR money goes to her future. It's not your Dad's money anymore, because he is gone. \n\nTalk to your lawyer or financial planner and consider setting up a trust for her, to pay for schooling, or to give her a set amount each year. It shouldn't be accessible by your mother. Let someone else manage requests to the trust and include language that if either of them contest the will, they get nothing.\n\nNAH.", "NTA.\n\nYour dad basically walked away from your sister after finding out she's not his biological child.  I guess a lot of people would do that.\n\nSince you inherited a LOT of money, set up a trust for your sister.  Do not let your mother near the money.", "NTA Do what you feel comfortable with-but consult with an attorney and financial advisor before you do anything. I'm sorry for your loss.", "Your dads estate belongs to you. What he thinks no longer matters. What you think is what matters. Being generous when you are in a position to be so is never a bad idea. So ponder it and act accordingly. But it’s now your decision. Your father made his decision,you make yours. His thoughts are one factor, not the only factor or not even the most important one.", "Best advice ever. I 100% agree in the getting a lawyer you have money get a really good one.", "My vote will be NTA either way, as no one is ever an an asshole for not giving away part of their inheritance, but I think this is important for context and a more nuanced understanding of the situation.", "I think it was more that op went nc with mom, and half sister was 11, so a little tricky to keep in contact with. Also op was a kid too whose family got destroyed. \n\n> I don't think it really matters if your dad didn't want any of it to go to her.\n\nYes, it does.", "That's kinda what OP is saying. Infact OP is trying to be nice by sharing it with her.", "Yea OPs mother should give his half sister the same amount because it her fault she cheated on OPs dad and she lost her father figure. It’s not OPs fault or his dead dads that his mother decided to cheat on her husband and try to pass of the child as his.", "No ive just been in a lot more contact with my sister now that my dad isnt there disapproving", "I know right \n\n\nPeople saying he's not her father\n\n\nIf I found out one of my children weren't biologically mine it would destroy my relationship with my wife, however, they are my children, I have raised them. \n\n\nThe idea of abandoning them is horrific", "By going nc with mom, it was harder to keep in contact with half sister, with her being 11. At least i think so. It's also possible that op blamed her for the parent's separation. It wasn't her fault obviously, but op was a 14yo kid too.", "Really? Continue to punish the child who was completely innocent? Who at 11 suddenly was rejected by both her father (in every way that mattered to her) and effectively her sibling, for no fault of her own.\n\nIt is OP’s money now, no strings are attached, if OP wants to be a better person than their father, let’s not discourage that.", "Yes she did. \n\n\nShe lost the person who raised her for the first 11 years of her life, that's her dad", "That is absolutely not true and a horrible thing to say. My stepdad has been in my life since I was about 5 or 6 and I will 100% be distraught whenever he passes, even though he's \"not my real dad\". He is a father to me, and it's always been that way for both of us. Just because someone isn't biologically related to a child doesn't mean they aren't their parent.", "No it doesn't. The money is now hers. She can do what she wants with that money. He was able to do what he wanted with his money, which is to give it to OP. Now it is OP's money and she can do it with it how she likes.", "As he should IMO", "And that's the thing.  Your sister is an innocent here.  To your dad she is the embodiment of your mother's transgression, so it is understandable that HE rejected her.  And you had to go along or also be cut out of his life.\n\nIt doesn't matter if your dad didn't leave her any money.  It doesn't matter if he didn't want her to have the money.  Unless it is stated in the will that you will lose the inheritance if you give her money, it is yours to do with as you wish.", "Was your dad actively preventing or arguing against you having a relationship with your sister? That’s pretty shitty, despite all of the obvious pain and anger he feels. He should never have been making you feel like he disapproved of you have a relationship with her when she is an innocent party in all of this.", "The thing that is said often on the personal finance subreddit is that you don't do anything for an entire year after a death. Your emotions are all over the place while grieving and it's a good idea to really think about what you want to do. Secure the money and wait one year - it'll fly by - and don't tell anyone you have money because people LOVE to spend other people's money. Above all else, do not let any relatives talk you into investing in their business or buying them a new car. Hide the money and wait one year. \n\nOh, and don't let any relatives move into any of the houses; you will never get them out and they will never pay you a dime. People get really greedy and conniving when there's a young person coming into a lot of money. Get cameras for all properties.", "But why would she go no contact with mom if the family found out at age 14 that a  different guy was the father of her sister?\n\nI mean I get that the dad wouldn't want anything to do with mom but I'm surprised a 14 year old kid would cutoff contact with her mom over an affair + deception.", "[removed]", "Not according to him and his will.", "But it would still be a betrayal to give it to someone he didn't wanted it to have. He already paid 14 years for a kid that's not his, it would be a betrayal to have more of his money go to it.", "I don't understand how a man could reject the child he raised for 11 years.  Reject the mother, but how do you just turn off a father's love like that?", "Because some people are understandably upset at their parent when they find out the parent cheated, lied, and deceived the whole family.", "Obviously there were more things at play. I went low contact with my mom as soon as it was possible too, and she didn't cheat on my dad. I also have no relationship whatsoever with my half sister. Long story. But i suppose that just like in my case, it's more complicated than it seems. \n\n Maybe op was a daddy's girl and this hurted her a lot. Cheating affects the kids too, not just the spouse.", "So a child realized one parent betrayed the other and effectively destroyed their happy family. Your question is why a child would go NC with the person who hurt their parent and destroyed their family?", "He was her father for 11 years then both he and her sibling suddenly abandoned her.  You don’t think that was devastating? Whatever her mom may have done, she is completely innocent. But she is the person that has been paying the price for this since she was a child.", "Maybe, but that doesn’t mean OP shouldn’t do it if they want to. I would rather “betray” a dead parent than continue to make life harder for an innocent party when it’s already more money than I need for a lifetime. \n\nI’m not saying OP has to give their sibling anything, just that whether or not anyone but OP considers this a “betrayal” shouldn’t in my opinion be a factor.", "1) what kind of monster refers to a child as “it?”\n\n2) her dad was being vindictive to the wrong person.  It MIGHT be an ah move to give money to the mom because the mom betrayed the father, but OP wants to give money to her half sister, who hasn’t done anything wrong.  That the father left her nothing is irrelevant, he’s dead and got his wish of washing his hands clean of his ex and her other child.  Now it’s his daughters to do with as she pleases, and if she wants to help her half sister that’s appropriate, so long as it’s what she wants.", "[removed]", ">continue to make life harder for an innocent party\n\nBy that logic, she should give the money to everyone out there. Also, her not giving the money to her half sister isn't \"continuing to make her life harder\"... it's not op the one who made her life harder in the first place. \n\n> I would rather “betray” a dead parent than\n\nI think that would depend on the family relations. The dead parent is predumably someone op loved very much, while half sister is someone she is low contact with.", "All you care about is assigning blame. No one is disagreeing with you on that. The problem is that the person who is paying the price is not the mother. It was an innocent child, who lost both her dad and her sibling for no fault of her own.", "Your missing the point\n\n\nYes the blame is on the mum, but the daughter has left at her father twice", "No actually, logic does not follow that since OP could provide financial support to someone they have a direct relationship with they should also do so for “everyone out there”. Nice straw man though. \n\nHalf sister is someone OP is low contact with because, according to them, their father disapproved of a relationship which is frankly a shitty thing for a parent to do even in these circumstances. So again, whether OP considers this a “betrayal” should be up to them, and whether that betrayal is justified should also be up to them.", "[removed]", "It was to her \n\n\nNot her biological father, but for 11 he was her father, the only father she has ever known \n\n\nThat 11 years doesn't suddenly disappear because he found out he was not her biological father", "Exactly.  I would venture to guess that his name is still on her birth certificate.  He also would have been paying child support unless he demanded a DNA test.  In some cases/places he would STILL be responsible financially since he WAS HER FATHER for 11 years.", "[removed]"]}