{"id": 28712, "submission_id": "175i4pp", "title": "AITA for Not Listening to My Roommate’s Girlfriend", "selftext": "So I moved in with a friend of a friend and his girlfriend. For the most part, everything goes smoothly. The girlfriend doesn’t pay rent but pretty much lives here. She has her own place but is always over. I don’t love this setup but I was aware of the situation when I moved in so I just moved past it.\n\nThe issue is, the girlfriend is a bit…neurotic. I’ll find my stuff reorganized in common areas to the point where I can’t find anything. I’ll wake up to her putting dishes away at 6am. I can’t help but feel her actions are a bit passive aggressive. I asked her to stop moving my things and she started giving me feedback about how I organize/do my chores. I point blank told her that I’m not taking feedback from someone who doesn’t pay rent and if my roommate had an issue he could take it up with me directly. She was not stoked about this and now my roommate is upset with me for hurting his girlfriend’s feelings.\n\nI’m not the cleanest person in the world, I’ll admit that, but I don’t let dishes sit in the sink for more than a day and I consistently do bigger chores when needed. This wasn’t a matter of my stuff being out, it was her moving things out of drawers to make room for something else. I understand I could’ve made more of an effort to meld into their organization, but I’m not going to take that feedback from someone who doesn’t actually live here. AITA", "created_utc": 1697041345, "permalink": "/r/AmItheAsshole/comments/175i4pp/aita_for_not_listening_to_my_roommates_girlfriend/", "score": 110, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) refusing to listen to my roommate’s girlfriend 2) because I wasn’t taking feedback from someone who is in my house a lot\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Obviously NTA but don't be surprised if they're both passive aggressive now.\n\nAre you on the lease?", "NTA\n\nShe was touching things that don't belong to her without permission and then got upset when someone told her it wasn't okay. Sounds like you are pulling your weight around the place. \n\nMaybe try having a better conversation with her where you start out nicer and get snippier as it goes on. That way you can hear her side (yes you should listen to her) and she can here yours and hopefully come out with something you both can live with.", "NTA\n\nShe disrespected you by treating you like a child in your own home. Then she got upset when you fired back.\n\nTell your roommate that his gf needs to stop touching your stuff and treating you like a child.", "NTA, but get ready for lease renewal time because either you should move out or they will move out. Don’t be blindsided.", "I’m gunna say NTA. You shouldn’t have to listen to someone who doesn’t pay or technically live there, and she shouldn’t be touching your stuff. If it was left out, she can just let you know to move it so things are tidier. However her putting away dishes at 6am I wouldn’t say is an issue? At least she’s helping with chores instead of JUST being a freeloader.", "NTA\n\nBut it annoys me when dishes are in the sink, of course this is not my flat.  Do you leave trash or clothes laying around in the common areas?  Do you have your things just everywhere?  \n\nI get she has no right at all to wake you up, but is she trying to be helpful?", "NTA - She doesn't get to tell you how to clean a space she's living in for free, nor does she get to touch your stuff / reorganise your stuff", "NTA. Someone that doesn't pay rent doesn't get a say in how the household is ran and organized. If she has a problem with it, she can go back to her own home where she is in control.", "NTA", "So your friend's GF is trying to parent you? They need their own place if they want to play house. NTA.", "NTA. We show others how to treat us by how we react to their behaviour. Put her in her place hard a few times and this issue will sort itself out", "Wow, you’re definitely NTA! She’s not paying rent, and she’s moving your stuff to store her stuff without talking to you, which is a serious invasion of privacy and disrespectful of your stuff. I’d definitely talk this out with your roommate, maybe ask for an agreement that neither of your things should get reorganized without permission.", "I may be different that everybody else, but I think YTA, because it seems, from the info you gave in your post, that you are not putting an effort to do the chores and keep the place organizated; your roommate´s GF has done the dishes or organize things you didnt do properly, trying to give you friendly feedback to help you as you are even leaving the dishes in the sink for like a day.\n\nIt is true that your roommate should have told you if there was a problem, but maybe sit down with him and have a proper chat.", "YTA Unless it was explicitly stated when you moved in that your habits and preferences would take precedence over someone who clearly already had authority on how the household was run, it's pretty shitty of you to treat her like she no longer has a say simply because you pay rent. \n\nShe should be treated like a roommate if that was the dynamic when you moved in. At the very least, she should have been treated with respect and not dismissed out of hand as if she is beneath you. \n\nYou need to sit down with your roommate and agree on what everyone's expectations are as far as cleaning and who gets a say in things. Your assumption that she doesn't isn't more right than her assumption that she will conti to have as much of a say as she's always had.", "INFO: Do you pay rent", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo I moved in with a friend of a friend and his girlfriend. For the most part, everything goes smoothly. The girlfriend doesn’t pay rent but pretty much lives here. She has her own place but is always over. I don’t love this setup but I was aware of the situation when I moved in so I just moved past it.\n\nThe issue is, the girlfriend is a bit…neurotic. I’ll find my stuff reorganized in common areas to the point where I can’t find anything. I’ll wake up to her putting dishes away at 6am. I can’t help but feel her actions are a bit passive aggressive. I asked her to stop moving my things and she started giving me feedback about how I organize/do my chores. I point blank told her that I’m not taking feedback from someone who doesn’t pay rent and if my roommate had an issue he could take it up with me directly. She was not stoked about this and now my roommate is upset with me for hurting his girlfriend’s feelings.\n\nI’m not the cleanest person in the world, I’ll admit that, but I don’t let dishes sit in the sink for more than a day and I consistently do bigger chores when needed. This wasn’t a matter of my stuff being out, it was her moving things out of drawers to make room for something else. I understand I could’ve made more of an effort to meld into their organization, but I’m not going to take that feedback from someone who doesn’t actually live here. AITA\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA but good luck getting your roommate to care since he has allowed her to live there rent free already.", "Yea, both the roommate and I are", "Yeah I’d usually be grateful but my room is right by the kitchen and it wakes me up every morning. I work nights so it’s kind of an issue", "I mean I’d like to agree but she’s literally moving my things to make room for her own in a house she doesn’t live in", "Yes", "Then you should be fine, they won't be able to brigade you out.", "Then that is what you need to bring up to your roommate and get yourself a sound machine.  There are different types of noise besides white noise and some of it cancels out a lot.", "nta", "NTA\n\n&#x200B;\n\nShe does not even live there, and she is a shitty guest.", "NTA. She isn’t in a position to make suggestions.", "NTA.  Time to have a boundaries talk with everyone.  “For all our peace of mind, let’s discuss each little issue and come up with a solution that we can all live with.  What everyday chores are required and what triggers them? ”\n\nDiscuss: Quiet hours.  Dishes, who and when and how long can they stay.  Feedback on how you do and store things in your area, you don’t need it.  Who owns what storage space.  What to do with things left out - like a dedicated kitchen counter space with separate boxes for people’s stuff-  if you have to move it it goes there.", "ESH.  She shouldn't move your stuff.  But leaving your dirty dishes in the sink for a day is also inconsiderate and makes me wonder what other habits you have since you say you aren't the cleanest.  Clean up after yourself.", "Kind of BTA?\n\nShe shouldn’t be moving your things without your permission. BUT she is practically a roommate — your friend is on the lease, and he’s dating her. She helps with chores, albeit at times that don’t agree with your sleep schedule. (Silicon earplugs are great BTW.) There are other ways to contribute to a living situation besides paying rent, and I feel you’re focused on that part because she’s pissing you off. I’d be pissed too. Even if she was paying ALL the rent, she shouldn’t touch your things.\n\nI think the three of you need to have a house meeting. She may not be on the lease, but until/unless they break up, she’s gonna be in your space.", "NTA...about listening to roommates gf. BUT learn to clean up after yourself. Wipe your ass, flush toilets, clean up after you cook and put your shit away. This is what adults do.", "She just changed the subject from the fact that she was moving your stuff. How about we address that first, and go from there.", "are you missing the part where she touches his things without permission? it sounds like she doesn't see him as a roommate or someone on their level but instead a guest in her and her boyfriend's place. she doesn't have any say in where his stuff goes paying or not.", "There are also (free) apps you can download (because noise machines can get pricy)."]}