{"id": 28736, "submission_id": "175wvzd", "title": "AITA for telling my MIL to Shut the fk up about my miscarriage?", "selftext": "I (22F) is married to my hub for close to a year, we have a little bub (K) together and to be honest they means the world to me . HOWEVER, i have been on a short fuse with my mother in law. For context, my mil is someone who thinks she knows everything and has a need for control. \n\n Here a TLDR on crap that had happen till now.\n\n1. i had to go to the hospital quite frequently as i had recurring UTI. My mil decided to tell me \"hospital bill is expensive you know? \" Mind you i paid my prenatal bills on my own.\n2.  the day i was discharged, my mil called the entire day asking is i was going home with the baby. While on the cab , she called and yelled at us  why arent we home yet, dont we dare bring the baby out. \n3. she constantly hovered around me and my hub regarding the baby, constantly yelling at my hub about everything he did . My hub was so angry he told me to take care the baby myself .\n4.  When we fell sick, my mil berated and questioned my hub, why did K got covid , is it my hub passed to her?\n5. we moved out in jan and when Chinese new year rolled over, bub was down with fever and flu, we decided not to do visiting . My MIL brought her mokeys up to my door and proceeded to have a screaming match and waking K who was about 2 to 3 month at that point. \n6. she constantly berated me on what i feed K.\n7. constantly ask my hub is he a henpeck becos i earn more then him so he listens to me.\n8. constantly call K a strawberry and a drama queen for crying?\n\nso now we have finally put K into a routine, K sleeps at 8.30 everynight , We were visiting my mil the other day as we do not want a repeat of monkeys at my door and  updated her on K's 1 year old birthday plan happening next month. We let her know cake cutting is at 6.30pm. \n\nshe decided to tell me how my hub nephew has lessons and would be late , how 6,30 is too early and how we should make it 7,30 instead?  i told her off and explain this is for K's schdule , needless to say she was unhappy and was trying to argue. My hub decided to  response to prevent a fight.\n\nMy Mil then asked about how was i as  we lost our angel baby.We hadnt told anyone we were expecting as when we found it it wasnt looking good, and eventually the baby left. We are heartbroken per say and he just briefly said that the doctor couldnt determine whats wrong. My mil decided to tell me how it wasnt fated and it not mine so the baby would have gone even if it grew.  i snapped and told her to just shut up, took k up and  we left to go home. My hub sides with me and we been on low contact but my mom says we should have just let it be and to give my mil a part of the things to do such as allowing her to order the buffet food. so   \n\n\nAITA? Should i just apologise and let the old lady have her way?\n\n&#x200B;", "created_utc": 1697080400, "permalink": "/r/AmItheAsshole/comments/175wvzd/aita_for_telling_my_mil_to_shut_the_fk_up_about/", "score": 55, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > i snapped and yelled at my mil and at the moment went low contact. refuse her help with K due to what she has done to me. Possibily forbidding her from seeing her only granddaughter.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You are never TA for telling anyone to shut the fuck up about your miscarriage.", "NTA. Mil owes you and hub an apology. Time to keep setting boundaries.\nHAVE hub tell her everytime she yells at you, there should be a time out imposed on her, and tell her the repercussions.\nTell her to stop with the constant criticisms you will seek advice from other parents that can give you guidance in a calm, caring manner.", "A bit more context I'm on Asia.  I'm chinese but I'm a very Modern thinking . I don't believe in religion and whatever the older people thinks .  I'm bringing up K in a very different way from my hubs cousin and his family. Child respected and child first learning", "NTA. Not her baby, not her body, not her decisions, not her discussion, and on and on. The next step from low contact is no contact. Just sayin'.", "NTA. Your MIL sounds like an invasive, nosy, judgmental control freak. I hope not, not that's how she sounds. \n\nYour health is NOT her business, especially something as personal as a miscarriage. I'd be tempted to move away from her or cut contact with her if I were you. Yikes.", "NTA, I would have went one further and blamed her for your miscarriage as untreated UTI'S sometimes cause miscarriages and she didn't want you to get yours treated.", "NTA- my blood boiled so much, i would be no contact if anything. She needs to deeply apologize.", "NTA - I just let out a tired sigh. You are not obligated to give her anything. You are an adult who has a home and a life, if she wants to be in it she has to learn to act right. And this should go for your own mother two since she seems to think this behavior is acceptable.", "It easy to say go no contact.  I love that idea and as much as I wanna push for that I have to also put my husband feelings into the mix. I don't have much say with his parents but I did draw a line with my baby. \n\nMy hub is the only child. There no siblings he can 'pawn' his parents to. And you have to understand.  36 years of constant filial guilt , he ofc have a guilt to take care of his elderly.parents. \n\nNot to.mention, the last time we went no contact , his aunts , the monkey, came up to the door and yell at us. Ofc I am the bad Guy but if I push for nc , I legit forsee a shit storm and constant harassment coming our way \n\nNo police does no shit cos it family dispute and my hub has filial obligations to his parents.  Unless they disown him, all problems goes to my hub", "YTA for not cutting contact sooner jfc that woman is delusional and entitled. Actually tho NTA she needed to hear it, I live for entitled people getting a hard reality check 😈😈", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI (22F) is married to my hub for close to a year, we have a little bub (K) together and to be honest they means the world to me . HOWEVER, i have been on a short fuse with my mother in law. For context, my mil is someone who thinks she knows everything and has a need for control. \n\n Here a TLDR on crap that had happen till now.\n\n1. i had to go to the hospital quite frequently as i had recurring UTI. My mil decided to tell me \"hospital bill is expensive you know? \" Mind you i paid my prenatal bills on my own.\n2.  the day i was discharged, my mil called the entire day asking is i was going home with the baby. While on the cab , she called and yelled at us  why arent we home yet, dont we dare bring the baby out. \n3. she constantly hovered around me and my hub regarding the baby, constantly yelling at my hub about everything he did . My hub was so angry he told me to take care the baby myself .\n4.  When we fell sick, my mil berated and questioned my hub, why did K got covid , is it my hub passed to her?\n5. we moved out in jan and when Chinese new year rolled over, bub was down with fever and flu, we decided not to do visiting . My MIL brought her mokeys up to my door and proceeded to have a screaming match and waking K who was about 2 to 3 month at that point. \n6. she constantly berated me on what i feed K.\n7. constantly ask my hub is he a henpeck becos i earn more then him so he listens to me.\n8. constantly call K a strawberry and a drama queen for crying?\n\nso now we have finally put K into a routine, K sleeps at 8.30 everynight , We were visiting my mil the other day as we do not want a repeat of monkeys at my door and  updated her on K's 1 year old birthday plan happening next month. We let her know cake cutting is at 6.30pm. \n\nshe decided to tell me how my hub nephew has lessons and would be late , how 6,30 is too early and how we should make it 7,30 instead?  i told her off and explain this is for K's schdule , needless to say she was unhappy and was trying to argue. My hub decided to  response to prevent a fight.\n\nMy Mil then asked about how was i as  we lost our angel baby.We hadnt told anyone we were expecting as when we found it it wasnt looking good, and eventually the baby left. We are heartbroken per say and he just briefly said that the doctor couldnt determine whats wrong. My mil decided to tell me how it wasnt fated and it not mine so the baby would have gone even if it grew.  i snapped and told her to just shut up, took k up and  we left to go home. My hub sides with me and we been on low contact but my mom says we should have just let it be and to give my mil a part of the things to do such as allowing her to order the buffet food. so   \n\n\nAITA? Should i just apologise and let the old lady have her way?\n\n&#x200B;\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  MILs are the worst, followed by SILs and BILs.", "NTA This MIL of yours needs to learn to be kinder to all three of you or just go away. It almost seems like she's trying to cause tension in the marriage to get you two to divorce.", "I'm so tempted to tell you to just let it be because she is old and I was raised that way. However, it's so so wrong. She really crossed a line with her miscarriage wisdom. It might be easier to keep the status quo but it might also be more taxing for you. Is she old? How long would you need to tolerate this? if she's got some years left, I think you need to bite the bullet and reinforce some boundaries/expectations.", "You are Asian yes?\n\nYou are NTA.\n\nIt's hard. That's a family member and going no contact is highly recommended BUT being Asian makes that ever so awful.\n\nDo not share anything with her. Create a schedule and stick to it. So things with her away from your home so that you can keep your schedule by just leaving.\n\nI'm sorry for your loss. Good luck with MIL.", "I’ll put this simply…. No. NTA.", "I'm guessing you come from a culture where you're supposed to accept a lot of harassment and abuse from older family members just because they're older and family members. \n\nBut you know what?  Times are changing. This is your life, your baby, your home.. and this woman has constantly harassed you and brought trauma into your lives, and now she's done this too.  She can go fuck herself.  NTA.", "My mom feels I probably should be nicer to my mil so that my life won't be so difficult 🙃", "Tbh my hub always end up telling her off about saying shit about me . Then she starts crying to her sisters about shit and then they go after my hub for being unfilial to his mother. It a whole circus. He cant stand his own family tbh", "I'm the same. Thankfully, my mil is more open-minded too. However, when she tries to bring up \"old people\" superstitions and beliefs about my kiddo, I shut her down immediately. \n\nShe's tried to steamroll some of my practices like exclusive breastfeeding, no water, no bottle/pacifier, homecooked foor when weaning etc. I just greyrock her and say \"times are different now\" and my child, my way. \n\nIgnore your mil's flying monkeys and go low contact. Your hub must be on your side.", "I want to but my hub is the only child . So I can't be the one to say such things ... plus I will get monkeys constantly blowing our place up .", "It kinda different in the Asia culture but my mom is worried that if we fight eith her my life would be made miserable by her.  Plus since she old she not gonna last long . Yes my mom is mean spirited .", "I'm only been married for a year . With my hub being the only child going, no contact is like hell. There won't be a possible way to do so . We don't even stay in the same area but the thing is she will come to make trouble for us.  My hub is morally tied to his mother despite not wanting to cos he expected to. If not, he gets a whole lecture from his relatives, and he doesn't even want to deal with them. \n\nWe are really just being quiet and away at this point . Once or twice a month, we bring bub to let her play but never overnight.", "Tbh she is 3 year older than my grandma so she like 65 but den she behave so much worst than my grandma. She expects us to bend to her will and her sisters constantly cos she did that with my hub when he is younger. It basically the line her sister over her family and to be honest  the salty one is the cousin who constantly complain to his aunt and then in turn starts telling my mil shit 😒 😑.  \n\nI'm rather hurt cos I made sure my hub goes back to see his mom and do his duty but den I'm being said to be the bad guy.", "Yep we only go over we don't want her over at our place . Yes being Asian and in Asia makes this 1000x worst than ever. Cos we are bounded by filial piety", "People like that need to be stepped back, a time or two. You can't appease her.", "Probably wrong. Your MIL seems like the type who will always push boundaries l, no matter what they are.\n\nIf that's true, then you need more restrictive boundaries, not less, because otherwise she'll ride roughshod over you.\n\nIf your Mom is a reasonable type, she may not be able to fully comprehend the challenge that non reasonable types present.", "Or… your MIL could also be NICER TO YOU!\n\nI’m so sorry for your loss", "You know what would also make your life less difficult. Limiting contact with her or going no contact.", "If you want your life to less difficult then go nc with mil. She emotionally abusive. You, your child and husband dont need that. Do you guys really want your child to witness or be emotional abused?", "Have you tried telling your mom to STFU too ?", "Yeah, my mom has a lot of feelings too. 🙄", "I shut her down with those , but she will try to guilt my hub. My hub can't stands hwr but he feel obligated to take care of her. I'm just annoyed it been a 11 months thing and running . Idk how many married Asian women stand this", "Then hubs needs to be the one you're talking to about this. He needs to manage his mother with firm boundaries. One of them needs to be she can't come at you.", "Who or what hat are these  monkeys?", "Well you’re very nice, nicer than me. Keep setting boundaries and standing up for yourself! Best of luck.", "Dude, that sucks. You and your husband need to come up with a game plan because you MIL is so problematic and she is only 65. It's just a matter of what is the lesser of evils. Is it easier to put up with her, or is it easier to disrupt the status quo?", "I'm so sorry. May your life be calm and full of happiness.", "We wish she would . Most of the time she doesn't say it to my face but when she does it I feel annoyed cos it like so fake. 😒  \n\nI told my hub I won't be surprise if eventually he wants ro put her in a home and I probably won't say anything.", "You took the words right out of my mouth", "It more of a moral thing in Asia it belief wr can't do that cos eventually our child will do the same to us. However as much as I want to go nc , it almost impossible as if anything happens to them my hub will.be responsible and forst contacted. As much as we don't like it it more of low or deal with her", "Tbh my mom was on no contact with me for 2 years. Recently just got back talking . My mom is fine and I kinda have no choice cos she my back up support  if k is sick and It really not much a choice. Plus I can't deny her love for k. She really puts a lot of effort at this point so I kinda let it slide with her", "We made it a pact never to go to her place alone . But she does take the time when hubs at the toilet or out of ear shot to try to tell me things . My hub always yells at her to quit it or shut her up but old lady relentless", "My husband aunts. My mil sisters sadly.", "There no easier with her . It just her way or the highway. I tell my hub that is his mom his circus to deal with so he is always the one fighting with her I stay out of it but when she gets on my nerve we just take a long break but eventually we need to deal with her xos at rhe end of the day anything happen my hub is their person of contact ,only son.\n\nCo currently my own dad is on no contact 🙃 😕 just that we been too busy to even visit notnthat I want to and my dad doesn't wanna ask cos I'm talking to my bio mom.", "For your own mental health you need to go low or no contact. I get that it’s his mother, but you do not deserve to deal with this bullshit.", "Okay.    \n\nMIL wants to dictate how you deal with your child and the party and your life then has  the gall to chime in on your miscarriage.    \n*Shut the fuck up* is completely appropriate.", "I live in the U.S. and my family is not first generation. Do you live in the U.S.? What is the main culture your family lives by?", "Neither one of have wants to deal with her crazy to be honest . We are currently in agreement not to bother or even contact her atm .", "We live in Asia.  So it really different . Family is like important also listening to ur elders even if they are dumb . It always the just listen to them don't comment dont rebut . Even if they are wrong", "Then why do you care about being TA ?", "Man I'm so sorry. I have a sister in law from South Korea but she is chill and her family seems pretty chill.", "Tbh as much as it is, they are mt child grandparents and in Asia context family is important and how dare I possible forbid them to see the little one", "Not all Asians are like this in Asia but it just over years tradition is always shitty. Like I'm wasnt allow to celebrate my girl 1 month or 100 days as my hub grandma passed and it hasn't been a year. I'm technically not allow to have celebrations due to that. \n\n\n\nOr like if u get married or any happy occassion  you cannot attend another happy occasion", "So it's yet again an Asian family. Put a warning at the beginning of the post to warn us that you'll find every excuse in the world to have contact with toxic people. You're not doing your future kids and future family any service by allowing disrespect like that", "Curious. It must be difficult living in a culture with so many traditions, expectations and rules.", "U can't say that when I do wanna but when my hub can't cos he the only child. Anything happens he still have to deal.with it plus I rather not have monkeys at my door yelling the shit out of us or every event with them.yelling at us as much as possible. The only thing I as a wife can do is push for low contact . Nothing else. In Asia that just how it is.  If not u can social worker coming up ur door regarding ur elderly parents. \n\nIt not like it is in USA where u can fuck off to the next part of town X.X", "For me it is . I'm very open minded and I do things very differently. I don't like the upright and rigid of the traditions tbh.  It like dont do this , dont do that.  Ur pregnant u can't only eat a , dont eat b"]}