{"id": 28748, "submission_id": "175zksv", "title": "AITA for walking out of my bday dinner after seeing my ex is there?", "selftext": "I’m new here and i made this account just to get your opinion. Also, english is not my first language so sorry for any mistakes.\n\nI (32f) was with my ex-boyfriend (43m) for a little over 2 years. I broke up with him a month ago because he took our relationship for granted. He thought because I loved him and I did love him, that I would never leave him even if he didn’t make any effort to show me that he cared and loved me. I was the one who’s always trying to see him and I was the only one that would share everything with him even if it was a stupid thought or idea because I loved that and I loved having his opinion but he wouldn’t do that. He was so private and to the degree that asked him if was married. I know he’s not but it got me thinking. Another issue i had with him, is me wanting him to meet my parents. It’s something important for me and i thought that after 2 years it shouldn’t be something not normal. He would always come up with an excuse to not do that. He even said that my parents wants to me him in order TO GET RID OF HIM and set me up with someone else. I told it was my wish to introduce them and not my parents request’s and that’s not true my parents would never set me up with anyone they let me pick who I wanna be with. It was after this that i thought maybe we wanted different things in life and that we should go our separate ways.\n\nAnyway, coming to the reason why I’m posting here, my birthday was a couple days ago, a mutual friend of ours told me she wants to take me out for dinner for this occasion. I accepted because we are great friends, we work together and we do hang out all the time. She jokingly said that she will invite him too. I asked her please not to do this and that if he’s coming I’m not going to go. She assured me that she’s just kidding and that she wouldn’t do such a thing. I then explicitly said to her if he came I would leave and she told me not to worry. Well we walked into the restaurant and guess who’s sitting at our table? If you guessed my ex than you are right. I immediately left and went home. She tried to stop me but I left anyway. She then got mad at me because I made her look bad for not staying. She said that my ex drove 45 minutes one way to be with me on my birthday and that i should’ve suck it up for the duration of the dinner. And now she’s not talking to me.\n\nI asked some other friends for their opinions. Some were with me but others told me that maybe I could’ve stayed because he made an effort to show up and maybe he would start to change now. Yea he showed up but it wasn’t his idea in the first place it was my friend who asked him to come. So AITA for leaving?", "created_utc": 1697089726, "permalink": "/r/AmItheAsshole/comments/175zksv/aita_for_walking_out_of_my_bday_dinner_after/", "score": 1062, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > The fact that i left my birthday dinner even though my ex drove a long way to be there. I think that maybe i could’ve stayed and heard if he had anything to say.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "You are NTA. Your friend is the asshole and your ex-boyfriend is a walking red flag.", "NTA, that's not what a friend does. I'm disgusted by both her and your ex-boyfriend. \n\nShe had no right to invite him. And the fact that she did it and joked about it, even as you said no, is not ok.\n\nShe disregard your wishes, overstepped your boundaries and is now gaslighting you. She's TA.", "NTA, You just did what you said. Your Friend is an asshole who thinks nothing of your requests and tries to force a relationship without consent. When you have such friends, you don't need enemies. Go NC with them. Maybe it was a mismatch or whatever but your ex-BF had 2 years worth of chances with you not 2 days.", "NTA. it’s not about anyone changing lmaooo your friends are delusional and hopefully not your friends anymore. They dont respect you if they think your ex driving even a million miles matters. They ruined your birthday celebration w that bs.", "NTA that Person is not your Friend she is His.\n\nA real friend does not invite an ex. Espescially when you told her over and over you don't want him there and will leave. She played a stupid Game and Lost\n\nThe other friends who told you to endure and that He made an afford, Tell them 'well that's your opinion and i respect that but i deserve the Same respect. I espescially told FRIEND that i want nothing to do with him and i will leave If He comes to MY Birthday Party. If you like sitting with someone who broke your Heart and you want to stay away from than that's on you and not on me. I Made my bounderies clear and that's it'", "NTA.  When your friend tells you that they don’t want to see their ex, you respect that.  You sure as hell don’t invite the ex to a celebration for them!", "Does your friend like your ex or something? Seems like she's more his friend than yours.", "It takes the minimum amount of effort to show up for dinner. \n\nHis window of opportunity to try was during your relationship. He did not. Tell your friends they are welcome to date him if they think this shows effort.\n\nIt does not. Him hijacking your birthday dinner and planning on backing you into a corner, is NOT effort. He was probably banking on you not wanting a scene in public. \n\nNTA", "So she repeatedly lied to you and then got mad when you followed through on your warning that you'd leave. This is not your friend.    \nNTA.", "NTA this is pure disrespect from your \"friend\". Cut her off. This is not a real one. My friends would never put me in such an uncomfortable position.", "NTA\n\nYou didn't make her look bad. She acted badly. Really, really badly. This would be a friendship dealbreaker for me. \n\n*I asked some other friends for their opinions. Some were with me but others told me that maybe I could’ve stayed because he made an effort to show up and maybe he would start to change now.*\n\nYou do not owe anyone ANYTHING just because they showed up. **AT ALL.** Yuck. WTF is wrong with these people.", "NTA you told her what your boundaries were and what the consequence of crossing them would be.  She crossed and you showed your proud shiny spine.  Be very proud of yourself. Ignore her she is the one who is wrong.", "NTA.  You owe your time and a second chance to nobody.  I would have left too.  She felt you out to see how you would feel about your ex being invited.  You told her how you would feel and she chose to ignore it thinking you would be \"too nice\" to \"create a scene\" by leaving - and then chose to guilt you when she turned out to be wrong.  \n\nShe may have believed she had your best interests in mind, but that doesn't matter.  She doesn't get to decide what is in your \"best interests\".  You do.  You decided it was not him... and not spending time with him.\n\nNot only is she the asshole, but she ruined your chance to spend your birthday doing something fun with people you actually wanted to be with.  She's not the one with the right to be pissed.", "babes dw youre not the asshole at all", "NTA shitty friend and shitty ex.", "Abso-fucking-lutely not TA. Your friend is an idiot.", "you told her if he showed you would not go. she knew you didn’t want him there, so she hid it until you were *at the dinner* most likely anticipating you would feel forced to stay to keep from rocking the boat. \n\nshe’s not your friend. she’s his friend. she sucks. nta.", "NTA  Your friend is not your friend. Did you ask why she did it after you said not to?", "NTA f*ck that friend. Don't sweat about someone who can't respect your wishes. You told her what would happen and you followed through. You're not a deceptive individual, she is.\n\nI would feel differently if it was my mom, but it's not it's a stranger you happen to work with who has this fantasy about playing cupid and really should have listened to you.\n\nEnjoy your life being strong and walking in truth.", "You did great!  I applaud you for sticking up for yourself in an uncomfortable moment.  Happy belated birthday.  NTA", "NTA and your 'friend' is not a friend. A friend would have your back and support you. This one failed miserably.", "Look, at your core you seem to know what's right, but you surround yourself with shit people.", "NTA. \n\nBut funny thing is that your friend is and those siding with her. They are not your friends.", "NTA\n\nYou warned her and she did it anyway???\n\nDisrespectful and dismissive of you and your personal life.\n\nYOU should be the one maintaining NC with her!!!", "NTA but to any friends who said you should take it as a sign he's changed, you need to tell them \"And that's great for his next girlfriend. Maybe she can have a real relationship with him. But there's no chance of he and I getting back together. I'm done with him.\"", "NTA. Even if he came from other side of the Earth you don't want to see him. Period. There is no reason to \"suck it up\" for anyone. Also dump that friend and all ppl who said you should stay.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI’m new here and i made this account just to get your opinion. Also, english is not my first language so sorry for any mistakes.\n\nI (32f) was with my ex-boyfriend (43m) for a little over 2 years. I broke up with him a month ago because he took our relationship for granted. He thought because I loved him and I did love him, that I would never leave him even if he didn’t make any effort to show me that he cared and loved me. I was the one who’s always trying to see him and I was the only one that would share everything with him even if it was a stupid thought or idea because I loved that and I loved having his opinion but he wouldn’t do that. He was so private and to the degree that asked him if was married. I know he’s not but it got me thinking. Another issue i had with him, is me wanting him to meet my parents. It’s something important for me and i thought that after 2 years it shouldn’t be something not normal. He would always come up with an excuse to not do that. He even said that my parents wants to me him in order TO GET RID OF HIM and set me up with someone else. I told it was my wish to introduce them and not my parents request’s and that’s not true my parents would never set me up with anyone they let me pick who I wanna be with. It was after this that i thought maybe we wanted different things in life and that we should go our separate ways.\n\nAnyway, coming to the reason why I’m posting here, my birthday was a couple days ago, a mutual friend of ours told me she wants to take me out for dinner for this occasion. I accepted because we are great friends, we work together and we do hang out all the time. She jokingly said that she will invite him too. I asked her please not to do this and that if he’s coming I’m not going to go. She assured me that she’s just kidding and that she wouldn’t do such a thing. I then explicitly said to her if he came I would leave and she told me not to worry. Well we walked into the restaurant and guess who’s sitting at our table? If you guessed my ex than you are right. I immediately left and went home. She tried to stop me but I left anyway. She then got mad at me because I made her look bad for not staying. She said that my ex drove 45 minutes one way to be with me on my birthday and that i should’ve suck it up for the duration of the dinner. And now she’s not talking to me.\n\nI asked some other friends for their opinions. Some were with me but others told me that maybe I could’ve stayed because he made an effort to show up and maybe he would start to change now. Yea he showed up but it wasn’t his idea in the first place it was my friend who asked him to come. So AITA for leaving?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.. you very specifically told her not to invite him and what would happen if she did.. rest was on her.. you only did exactly what she had been told would happen.. \n\nHim not meeting your parents after 2 years together is rather strange.. \n\nLet her stay mad and not talk to you.. she is the one that disrespected you on your birthday..", "NTA", "NTA - she crossed a line with you and invited him. He wouldn’t have drove 45 mins if she didn’t tell him about the dinner. It sounds like she thinks she knows better than you.\n\nWho cares if she isn’t talking to you. I wouldn’t want a friend that doesn’t respect my request.", "NTA \nYou clearly stated if he is there, I will leave. \nHe was there, you left.\nWhat did she think was going to happen.", "What the hell is wrong with your friend!  And the ones who fell sorry for him driving 45mins!", "so much for that \"friendship\". that is an absolut AH-move. NTA if you slapped her on the way out she would even have a defence for that. horribly exfriend", "NTA but that is NO friend of yours. Clear away the rubbish and have a great life.", "NTA. \n\nLet the lying friend be upset. She was taking you for a fool and did not respect your decision. HER actions made her look bad to the audience but mainly toward you. Glad you left the bf behind... just time to do the same with the fake friend. Good job!", "NTA- and SHE LIED- to your face, more than once! You TOLD her you wouldn't stay if he was there, she had ample evidence that having him there would be a BAD IDEA! What a truly crappy thing for a \"Friend\" to do on your Birthday! Don't you apologize to her, she should beg for your forgiveness!! SHE RUINED your Birthday!", "NTA - I don't think I've ever seen such a clear case of FAFO\n\nPS - DON'T give your ex another chance! If someone is only willing to change AFTER it has negative impact on him, he'll go back to the bare minimum as soon as he has you \"locked down\" again", "Who cares about his effort? Who cares about him at all? This isn't about him, but about your friend. You explicitly told her you didn't want him there and you would leave if he showed up, and yet she insisted on using your birthday to set you up. NTA. Your love life isn't your friend's business!", "NTA. Get rid of that friend.", "Not even a little.", "NTA.  Your friend was out of bound and was forewarned what you would do if he was at your celebration.  This is on her and making an effort of driving 45 min to be there, oh wow what bug sacrifice.  Seriously the only person who is allowed to be upset here is you and everyone should stay out of your business,", "He didn’t want to meet your parents after 2 years???? Nta I wouldn’t give him another chance. He needs therapy", "NTA", "NTA. You told her repeatedly, she totally ignored it. News flash; she's NOT your friend, she's on his team. Block her and move on with your life. He was too old for you, it would never have worked long term.", "All of the people who think you should have stayed aren't your friends. Been there, done that, tried to sustain those friendships, ended up with very destructive chronic low level drama until I fucked them all off. NTA.", "NTA", "NTA  \nYou told not to do very spefcific thing. She should she wouldn't. You told her what would happen if she did. She said she understood and would not do that. \n\nShe then did that. \n\nAnd then is angry you stuck to your word and left. She lied to your face and then she is the angry one? This of course after sticking your nose in something that was none of her business in the first place.", "NTA. He's doing too little, too late. \nWhat's the point in driving 45mins after you have broken up?", "NTA. She chose to disregard your explicitly stated feelings.", "NTA you set boundaries and your friend crossed them. It’s YOUR day— neither your friend or ex respected that", "Who gives a damn if he \"made an effort\"?\n\nHe's your bloody ex! Do these people not know this? What part of NO does your \"friend\" not understand? If he wants to get pissy then get pissy at the boundry stomper who for some reason wants to play matchmaker.\n\nAnd if they think you were rude for just leaving, well I'd have loudly chewed her out right there in the restaurant.\n\n&#x200B;\n\nNTA", "NTA\n\nShe made herself look bad, and , she's not your friend because she was orchestrating her agenda instead of caring about your feeling.", "NTA. She's not your friend. She's trying to manipulate you. \n\nShe might be your ex's friend - but she's not yours. \n\nStay away from that guy - he sounds horrible. Date someone closer to your own age, who wants the same things from life and values you.", "NTA. If she stopped talking to you, good riddance. Take it as the blessing it is. You told her multiple times that you didn't want to see him, and she lied to you to your face. You shouldn't have \"sucked it up\", you didn't ask her to invite him, quite the opposite, and everyone telling you otherwise is wrong.", "NTA and No thats Not a friend of yours", "Nta.  That person is not your friend.  I would make a gc including the ex and so called friend so no one can say you are talking behind their backs.  I would let them know you told friend you didn't want ex there and she assured you he would not be invited.  I would also let them know that you told her if he was there that you would leave and she assured you again he would not be there.\n\nMake sure everyone knows she is a liar and was deceptive to you", "Nta.... that is not your friend", "NTA. You expressed a boundary, the consequences of pushing past the boundary and then you followed through. Ditch the supposed “friend” who thinks they know better than you on how to live your life.", "NTA, but your friend isn't your friend. Definitely not worth your time. Best case scenario, they aren't cheating but it seems wildly inappropriate to have set things up at all let alone to have actively misled you on it. Seems like she believes the nonsense he was selling, so take that for whatever it's worth.", "NTA. Your ex spent more time manipulating your friend after you broke up than he did on your relationship when it was still ongoing. Also the betrayal by your friend must sting.", "NTA your friend is a manipulative asshole cut her out along with the ex.", "NTA\n\nShe did the thing you *explicitly* told her not to do. You even told her what you would do if she did the thing you told her not to do. That’s establishing a boundary, and you enforced that boundary. \n\nShe’s the asshole here and doesn’t get to act all butthurt. I’m guessing that she fancies your ex and went crying to him after you were mean to her.\n\nDrop her as a friend Since you can’t trust her.", "NTA - nothing else need's to be written.", "NTA It's always a psycho move to meddle in other peoples relationship.", "NTA\n\nFuck that shit, you told her exactly what would happen if she pulled a stunt, and she pulled the stunt! \n\nNO ONE is ENTITLED to your time or presence.", "NTA she was warned what you would do. You just followed through", "NTA!!! Your 'friend' was massively misguided here. She lied to you! What was she thinking?? \n\nYou behaved sensibly and consistently with what you had already told her. If she's basically a nice person and just had a brain fart of some kind on this occasion, hopefully she's now learned a useful lesson.", "Well some people congratulate me when i left him so you are right.", "Wow. Went back up to check the ages. 30’s and 40’s, assuming your friend is the same. That’s something I might expect from early 20’s, definitely not seasoned adults. Totally within your right to leave! Sorry your friend is so immature and inconsiderate.", "NTA - I don't think I've ever seen such a clear case of FAFO\n\nPS - DON'T give your ex another chance! If someone is only willing to change AFTER it has negative impact on him, he'll go back to the bare minimum as soon as he has you \"locked down\" again", "I can’t go full NC because we all work for the same company. But I will limit the contact to only work related stuff that’s for sure.", "He is a nice person to everyone. That’s why they thought he maybe deserves a second a chance. But I waited so long for him to change and i knew it wasn’t going to happen.", "She said that because i refused to stay that it means I never loved him. But I did, I’m just trying to move on, it beaks my heart every time I remember how I had to fight for his attention and to feel his love. Yes I don’t want to be put in that position again.", "The fact this friend had to be told in the first place is kind of wild. And then to ignore multiple requests not to invite him just makes the friend a no doubt AH.", "It might be true. And i might be harsh because after she defended him a lot i told her you go date him if you think he is that good. I don’t know what to think.", "I’m usually a people pleaser and not confrontational so yes she thought that I would just stay and accept the situation like I would always do.", "She didn’t give me an answer and she would change the subject and goes back to the fact that i left the dinner.", "Good grief.  How many times did you need to say No. Do not invite him.  \nWhy did she even bother asking you to then totally ignore you.     \nGood for you for walking out.", "That's nice to hear. Your friend also doesn't respect you, so there is that.", "NTA, it sounds like your friends loyality lies more with your ex than you, so i'm sorry, but i don't think she is a good friend of yours but more a good friend of him.", "NTA \nI applaud you for standing up for yourself. \nYou need to re-evaluate your friendship with that particular friend and anyone that supported her actions. \nWhat she did was wrong and unacceptable. She needs to respect you and the boundaries you set.", "Tell your friend that she can date Mr. Mystery if she is so hot on him.", "I’d watch this “friend”. That’s shady af.", "Drop the friends who are against you on this. You're young and you deserve happiness and it's not going to be with him. NTA", "Only thing you did wrong is you should have asked those there except your shitty AH former friend and the ex to go somewhere else.", "I think everyone means \"friend\" - because someone willing to put in the effort to disrespect you and unvalidate your feelings and wishes like this is NOT your friend.\n\nOP, NTA. You did yourself a favor by walking away from what was a bad relationship, further self-favors for establishing boundaries and adhering to them, but go a step further and call this \"friend\" a co-worker only. Limit contact and discuss work matters with them only. If they're willing to disrespect you like this, there's no limit to what they're willing to do.", "I thought more teenager - someone who hasn’t yet learned how the end of serious relationships feels.", "Exactly!!! \nLimit the contact to only work related stuff. Have it at the back of your mind that she’s not your friend.", "So how long has your friend been in love with your ex?", "He can be a nice person, but still not be the right person for you. I would have also found his refusal to meet your parents after two years of dating to be a deal breaker. \n\nYour \"friend\" who planned the birthday gathering is not your friend. She thinks she knows what's better for you than you do, after you were VERY specific about not wanting to see your ex. She lied to you, repeatedly. You warned her that you'd leave. Good for you for carrying through !\n\nNTA.", "\"Deserves\" shouldn't come into it - you're not obliged to give him a second chance.  You owe him nothing.", "It doesn't mean what she said. Not only is this \"friend\" an AH, she is full of s\\*\\*\\*.", "See she is not your Friend and never was. \n\nSo you deserve to be unhappy and need to be his loyal bangmaid so that his happyness is ensured? \n\nYou deserve happyness and that means cutting Out all the things that harm you. It is hard and you get hurt in the process but it needs to be done", "Why does she care if you ever loved him or not? How is that an argument at all? Does your friend have a habit of meddling in other people's lives?", "Ask her how you never loved him.  Ask her about how many times he refused to meet your parents, or put you down or didn't give you attention. Ask her when she was in your relationship to know what was going on..  Tell her that if she seems so desperate for him to be loved she can do it.", "Her opinion doesn’t count.", "Your friend has emotional maturity of a teenager.", "Please do not speak to this awful person outside of professional capacity, and document everything you can about work that women is a snake.", "Seriously.  Unless someone asks you to include their recent ex, the default is to not try to bring them together (or should be).  That one is just basic common sense.", "Regardless of her feelings for him, in whatever way she likes him, she still disregarded yours, and that's not cool for friends to do. You told her you don't like him to be there, and she had the audacity to be mad when you left.", "Well then it's a huge step forward that you didn't and I'm proud of you for that.  You may not have celebrated your birthday, but you did something far more important.  You took that next step on the path to personal growth and reclaiming your power/strength.", "Never be a people pleaser or a doormat. People will just walk over you. Always put yourself first. \nNTA", "Stay away from her. For some reason she is trying to cause you problems. Watch your back at work too.", "[removed]", "Or that “no” means respect my wishes and please don’t interfere", "This 100%.", "On multiple occasions she told while joking that if he was christian she would’ve dated him since she would only date someone if her own religion so idk if that might be the reason she cares if love him or not. And yes, she does that a lot. We have a colleague who have been hurt by an ex big time and she goes out of her way to bring him up every time she sees her.", "You now have 2 ex's . Block the \"friend \" too", "This. Life is not a movie where people around you know better than you.", "> **We have a colleague who have been hurt by an ex big time and she goes out of her way to bring him up every time she sees her.**\n\nYour friend is VERY MUCH an AH. \n\nI know this sort of person. The kind who pretends to be your friend but secretly revels in pushing your buttons and \"accidentally\" bringing up painful subjects over and over again.\n\nFrankly they remind me of the kids who enjoy ripping the wings off butterflies...slowly, or tormenting some other insect under a magnifying glass. Only they never grew up or grew out of their narcissistic/sadistic tendencies.\n\nThis is NOT a friend that you need to have. And the fact that she's now trying to turn this around, and blame YOU for leaving, while giving you the silent treatment?\n\nSpeaks volumes.\n\nYou're better off without her and anyone telling you that you should have stayed is ridiculous. It doesn't matter how far your ex drove (or even whether you should forgive him). It's about not wanting to stay at a gathering organized by someone who not only shows zero respect for you and your wishes, but actually seems to delight in you discomfort.", "Your ex-friend is a toxic asshole of the highest degree, in fact she sounds genuinely abusive. Cut her out as much as possible and do your best not to fall for her manipulations.", "Sounds like maybe she has something going on that makes her cruel around relationships - has she been single a long time?  Sometimes people who struggle with something can get really mean to people they see doing that thing, especially if the people doing the thing are doing it “wrong” or ”don’t appreciate it enough.”  Some of them are willing to do pretty nasty things to correct what they see as failing to appreciate whatever it is or doing it wrong, and the ones that are really twisted up think they’re doing the right thing and “helping.”", "This.... Best Comment", "I’ll just go ahead and sign off on all this 👍", "*<She jokingly said that she will invite him too. I asked her please not to do this and that if he’s coming I’m not going to go. She assured me that she’s just kidding and that she wouldn’t do such a thing. I then explicitly said to her if he came I would leave and she told me not to worry. >*\n\nSo far so good. All logic to me.\n\n*<Well we walked into the restaurant and guess who’s sitting at our table?>*\n\nWell, your \"friend\" gaslighted you and even though it was YOUR birthday celebration, she disrespected your EXPLICIT wishes\n\n*<I immediately left and went home.>*\n\nYou EXPLICITLY warned your friend that you'd do this. And you did. Kudos to you.\n\n*<She then got mad at me because I made her look bad for not staying. >*\n\n\\- She already looks bad for inviting them, \n\n\\- she also looks bad for not respecting your EXPLICIT wishes,\n\n\\- she also looks bad for lying to you,\n\n\\- she also looks bad for not believing what you sad,\n\nso I guess it's ok to add her being mad at you for no reason at all to the list. \n\n*<She said that my ex drove 45 minutes one way to be with me on my birthday>*\n\nI have to admit, for someone who made no efforts at all for his then GF during their 2-year relation, driving 45 minutes was a major effort!\n\nBut too little, too late.\n\nINFO: Is your \"friend\" trying to get with your ex ?\n\nNTA", "Nta she manipulated you and lied to you. Why.", "You’re NTA and she’s not your friend. Friends don’t do that.", "General life lesson for everyone on this sub:\nIf you set reasonable boundaries, and someone does not respect those boundaries, they are the asshole. You are not an asshole for standing up for yourself. \n\nNTA.", "NTA. Your buttinsky so-called friend disrespected you and she *deserved* to look bad for pulling such a stunt. Looks like your ex got the ‘mutual friend’ in the breakup.", "NTA.  You told her multiple times.  Why would someone do this on your birthday?  Seems like a big fat low blow to me.", "This is ridiculous. Who invites someone’s ex to their birthday party? Like a horror movie. NTA.", "Just ask your friend - \"why don't you respect me or my wishes (especially on my birthday)?\"\nThat's all it is - she respects him more than you, and she thinks that your feelings are less important. \nAnd do wait for an answer. \nAlso - if he wanted to reach out- there are millions of ways he could do that. Send you flowers, a gift, write you letter, or even a poem. It doesn't matter. Being an unwanted intruder on your birthday is not the way.\nThis also confirms your judgment. He does not see you as a partner, a separate person, who has her own will. It's like my ex, who (after I broke up with him) decided to reach out to my parents and my friends, so that they would convince me to stay with him. Fortunately all of them told him, that I'm the one to decide and they don't have a say.", ">And now she’s not talking to me\n\nNTA Since she is not a friend that is a most excellent thing. Drop that thing like you did your Ex.", "NTA. Your friend however is a massive one who is either stupid or suffers from some sort of cupid complex. It is bad enough for her to try to meddle with your relationships, but to do this on your birthday against your expressed wishes is simply beyond the pale. And then to complain you made her look bad?!  I'd drop her along with your ex!", "NTA…if he has not made an effort in two years, he is not magically going to now all of a sudden.  Be glad this friend is not talking to you.  She us really not a friend, especially after she did this to you knowing how you feel.", "NTA\n\nYou don't have to maintain the fiction of politeness to make someone who violates your boundaries feel better about it.\n\nShe floated the idea, you told her what your boundary was and what response to expect, she knew in advance that if he was there you would not be. That's it.", "NTA Your friend though is a liar AND an AH.", "NTA. You warned her that you would not go if he were to come and you did exactly that. \n\nShe must really like this guy if she wants you to give him a second chance, but she should not have lied to you and invited him against your express wishes.", "NTA\n\nThat is not a friend!", "NTA you made it very clear that’s what you would do.", "NTA. I fucking hate ambushes.", "NTA. Your friend isn't a friend. She's a lying liar that doesn't respect you, nor your boundaries.", "Nta. You tell her you dont want to have him to your birthday dinner twice. She have no say in your relationship with him and how you deal with it. And how it s logic you have to suckvit up for your birthday.", "NTA you’re “very good” friend apparently doesn’t respect your decision. Friends I think that you should’ve stayed and she gave this guy a chance don’t know the insight you have about the relationship. If you feel he is not the one then you should stick to your guys and stay away from him. As everyone knows break ups are hard. Lastly, he must be in communication with your friends behind your back. This makes me wonder whose side they are really on. Good luck.", "NTA\n\nShe had one job - to NOT invite your ex - and she failed.\n\nAfter you explicitly asked her not to and told her what would happen if she did.\n\nThis is on her.\n\nShe's not your friend. She walked all over your boundaries.\n\nDump her in the same bin as your ex.", "NTA.  You are an adult and can decide who you want to spend your birthday with and who not.  Your friend was the AH for deliberately doing what you asked her not to do. You told her that if he was there you would leave.  Let her be as angry as she wants. And honestly? She's not your friend.  A true friend wouldn't do that to you. She would honor your choices for yourself.", "Absolutely NTA. She KNEW this would happen, she just clearly didn’t believe you would do it. And she clay doesn’t respect you or your feelings!! Real friends don’t do shit like this, ruining your birthday. \n\nI’m gonna take a stab in the dark here and say that either she was trying to get you back together or he enlisted her help to get back with you. \n\nEither way what she did was wrong and disrespectful. Sorry they ruined your birthday!!", "Oh hell no NTA \n\nnomber one they an ex for a reason one you may or may not have shared with friends. You explicitly told her not to invite him and what would happen if she did. She's a mutual friend and I am in her situation with some of my frineds its hard being friends with two people who have broken up or dont like each other but I make sure to be friends to both of them, but in this situation she was being HIS friend not yours and it not fair on you to on your birthday a day thats for you  to not only have to hang with your ex but also a friend who showed through her actions she was thinking of him and not you. I don't blame you for leaving, especially coz she knew what would happen if she invited him, not sure why she thought you would stay because to me it seemed as if she manipulated or tried to by not telling you and having it in a public space hoping you would want to 'save face' and not leave, which is why she didn't tell you allowing you to then decide to still come and have dinner or decline.", "Nta. Your friend is trash.", "NTA\n\nYour friend is an idiot. It's not like you were unclear.", "Oh no, full NTA sweetie, you warned your friend, she can feel bad all she wants.\n\nShe knew what would happen.\n\nThat's a beautiful spine you have right there!", "NTA. She played stupid games and won stupid prizes.", "NTA you told her what would happen, she assured you she wouldn't invite him. Now she's shocked you kept your word? Oh, he drove 45 minutes? Whyyyyy when you said you didn't want to see him? Did she think it would reunite long lost lovers? I wouldn't be upset about losing a \"friend\" like this either, because she obviously doesn't listen to the words that come out of your mouth. It's like she's got elevator music going on in her head.", "NTA.  You told your friend you would leave if he was there.  He was there.  You left.  \n\nNot sure why she got angry.", "NTA. You told her what would happen if she invited him and you followed through. It’s not your fault she didn’t believe you.", "NTA. Block her, she's not your friend", "NTA. You have a poor quality friend there who thought she could manage things and get you two love birds back together.  You did the right thing.  Applause for you.", "NTA\n\n&#x200B;\n\nYOu handled that well.\n\n&#x200B;\n\n&#x200B;\n\n\"She then got mad at me because I made her look bad for not staying.\" .. That's good, because she IS a manipulative and lying AH and the only thing YOU did was caling her out for it.\n\n&#x200B;\n\n&#x200B;\n\nAnother option would have been: Everything but ex and her, come to my place instead! There will be pizza! Because your other friends were not at fault.", "NTA.\n\nWhen you're ambushed, all bets are off.  People do this specifically because they're betting that you will be too timid to make a scene.  Their fault if you prove them wrong.", "**NTA**\n\nYou made your feelings clear. You did not want him there. You had your reasons for leaving the relationship. Reasons which are valid and don't need to be justified to others. You followed through on what you said. Your friend needs to listen to you and respect you when you say no.", "NTA- You set a clear boundary and stated what would happen if it was crossed. She violated your boundary (your ex being at the dinner) so you followed through to make yourself comfortable (leaving). If she was worried what people thought then she would have respected you when you said not to invite him. You warned her, she learned you weren't messing around.", "NTA. You pleaded with your friend not to invite the ex, she said wouldnt, even reassured you she wouldnt. Then she did....not a good friend, and she has no reason to be mad.", "NTA you need better « friends »", "Yes, if an ex/abuser etc making efforts to se you, you can't be unpolite /s\n\nNTA \n\nShe was not a friend at all", "NTA\nYour \"friend\" is TAH for inviting him in the first place? What was she trying to do? Why does she even have his contact info? Why did he bother showing up? Why was she surprised by your response when you stated, clearly and explicitly, that you would leave if he was there. I guess she didn't think you were serious. Joke's on her. That was a huge overstepping of boundaries on her part and you will probably be better off without meddling, nosy people like that in your life.", "NTA. You did the right thing. They deserve each other. She is not a friend to you. I would end that friendship.", "She’s not a friend. A friend would not put you in that situation.", "NTA \"haha jk i did it anyway\" is not the correct response to \"please do not invite <person>\"", "Your friends who agree with her and your ex are All AHs. I would dump all those friends if it were me. NTA wtf was she thinking", "NTA. Your friend and your ex are.", "1. She's not what I would consider a friend to be. \n\n2. NTA.", "NTA but your friend is for sure.", "Nta bothe he and her are going to drain you of life. Keep them out", "NTA- you legit told her what would happen", "NTA it sounds like you could not have been clearer to your 'friend'.", "NTA. Your friend didn't respect what you asked and stepped on your boundaries..", "NTA. Good riddance to your worthless ex. And good riddance to an awful friend.", "NTA: You were given information to which you responded with a perfectly reasonable request and course of action should that request not be met. You followed through with your promise. The time your ex spent was irrelevant. The only time wasted was yours.", "Unless you are in Europe or someshit 45 minutes IS NOT A LONG DRIVE. That is BARELY a morning drive to work.", "Nta. \n\nAsk your friends how would they feel if you invited their exs after they said not too? \n\nYour friends have no respect for you", "NTA - who invites someone's ex to that person's bday party?  \n\n\nThis person is NOT your friend.  They betrayed your trust, they LIED to you, and then they tried to gaslight you into making it YOUR fault.", "You told your friend before the dinner you would leave if he came, also asking her to NOT invite him and she has the nerve to be mad at you for making her look bad? She made herself look bad and never take that man back. It’s a popular cliche and meme for a reason but the term “when someone shows you who they are believe them” works for your friend and your ex. She showed she doesn’t care what you want and prioritized your ex’s feelings over yours.", "NTA. You explicitly warned her what you would do then she got mad when you did exactly that. I would've done exactly the same.", "NTA. You made your boundaries clear. Your “friend” broke them.", "Your friend played the stupid game, so she won stupid prices...", "Yeah now that he doesnt \"have\" you he is making the effort, drop the friend like you did with your ex. NTA.", "45 minutes eh?  Damn the bar is low lol", "NTA dump the friend too", "NTA,", "NTA. Ditch that friend, she doesnt respect you. Simple as that. Dont go overthinking this, you did the right thing, your friend is massive AH, no recovery for her at all. Find better friends, and those who told you to suck it up, lessen your time with them.", "She is not your friend. And the people who say you were wrong to leave are questionable as well. NTA", "Tell the Ex Friend.  If she likes your ex boyfriend so much.. go ahead and date him .. No is a complete sentence.. She is not a friend.", "Tell her she’s a toxic AH and from now on, “dont talk to me unless it’s about work”. Show her you’re not a pushover anymore, be firm and let her go crazy whatever. Good riddance", "NTA - \"with friends like this.......\"  Time to break up with your friend also.", "At least you now know who are truly your friends.", "No, that's bullshit. Whatever your \"friend\" had in mind, you specifically told her not to invite the guy and you'd leave. She fucked around and found out.\n\nNTA - but your friend is. Oh - and she's a liar as well. She's not your friend.", "NTA. Your friend crossed a boundary and you enforced it. I’m happy you have enough respect for yourself to follow through with your promises to enforce those boundaries. And for the friends that are saying maybe he’ll change, don’t take their advice. He was unwilling to try for two whole years, you deserve more from a partner than waiting around to see if they’ll ever care enough to put effort into being with you.", "Why the hell is she trying to get you back with him? NTA.", "How controlling and manipulative of your ex and friend. I say friend  but this is not the behaviour of a friend. This is the bahaviour of someone with no respect for you, your feelings or a stated boundary. \n\nNTA Good luck with finding a better partner and better friends.", "NTA - you told her you would leave if he was invited- what else could she expect", "NTA you told your friend EXPLICITLY that you did not want him there and that you would walk out. Why is she surprised?", "Nta. She was warned. Its on her. F**ked around and found out", "NTA dear. You have CLEARLY exprimed your boundaries and your friend didnt take them. You have done the right thing in leaving the restaurant !   \nBTW your ex is such a reg flag, you was right to dump his a\\*\\*", ">She said that my ex drove 45 minutes one way to be with me on my birthday and that i should’ve suck it up for the duration of the dinner.\n\n\"I went through a lot of effort to hurt you\" makes it worse, actually. NTA.", "NTA. You said no. No means no. Whether or not he made an 'effort' to show up is not a consideration. Your friend is not your friend. She's his friend. She threw you under the bus and tried to coerce you on behalf of your ex. \n\nIs your culture one that heavily emphasizes women being married and having children? It seems like a lot of people are very invested in you having a relationship, even if it's with a loser.", "Of course you’re NTA. She knew she was playing with fire. Be glad she’s not talking to you anymore. No one needs that toxicity.", "NTA\nditch your so called friend too. \nBoundaries are in place for good reasons and she just stomped all over yours", "She's not your friend. NTA.", "NTA. Your “friend” made herself look bad", "NTA. He's your ex. This woman is not your friend.", "NTA - You were clear with your friend about your boundary. You told her what would happen if she crossed it. You followed through on what you said. The only asshole here was her. No one gets to decide what you should do but you. Any friend that would lie, bully and then get mad at you for their bad behavior is not a friend. She owes you an apology. But even if you get one u probably shouldn't't trust her again. Whatever her motivation was she didn't hear you when you clearly expressed yourself.", "You are NTA\n\nYou asked your friend not to invite him. You told her how you would respond if he showed up. She ignored your request and then became embarrassed by her own behavior when you enacted on your clearly stated boundary by leaving. Basically, she FAFO.\n\nAgain, you are NTA, and your friend is definitely TA.  Drop her, like you did your ex (who is also TA, both for showing up to your dinner and for the way he treated you while you were together).  You are better off without them both.", "NTA.  You told your friend you would leave, she assured you that you didn't have to worry and then betrayed your trust.  As for not talking to you, you should be FURIOUS with her and cut her out of your life.  Time to be cold and dismissive in all interactions.  She is no friend.", "NTA.  Your friend and your ex are AH.", "NTA dude is trying to be nice and ‘care’ to reel you back in. Continue to not engage with this loser.", "That is not a friend, she wanted to see OP suffer. This was supposed to be a day for her to enjoy, NTA.", "Nta", "NTA! You gave specific instructions to your friend, who completely ignored them. Now she’s not talking to you? You dodged a bullet with her!", "NTA. They are not your friend.", "Absolutely NTA. You told your (ex)-friend what would happen if she invited your ex. \n\nShe FA and she FO.", "NTA, the effort was to little too late, and your friend was being shady trying to force you into a situation that you had already told her you were uncomfortable with.  By the way, that isn't your friend, she's his friend now, she chose him and what he wants over you and your comfort on your birthday.", "NTA\n\nYou: Don't do this thing.\nFriend: Okay.\nFriend: * Does the thing *\nYou: * Leaves *\nFriend: Why?!\n\nYou may want to reevaluate these \"mutual friends\" you have.", "NTA, I would’ve walked out too!", "NTA. Bruh. You guys are way to old for this shit, don't put up with it.", "NTA. This makes no sense whatsoever.", "NTA, and that’s no friend.", "„ I then explicitly said to her if he came i would leave“\nNTH, not even a bit, your friend on the other side… very big AH, if you can even call her a friend", "Tell your friend she can have him. NTA", "NTA.  People should really stop trying to force other people into situations they clearly don't want to be.  The ex and the \"friend\" are totally AH's.", "NTA\n\nThis “friend” is not your real friend.    \nThe X is an Ex for a reason. \n\nCongrats on losing the 200 lb anchor!", ">And now she’s not talking to me.\n\nGood..... Keep it that way.  \n\n\nNTA", "Gezz ur friend is not the star in a romcom.. this is your life and your feelings and choices. No way. Very disrespectful and imposing. Screw them both. Happy Birthday and you're better off. Also if it seems he is hiding something then he is.. 2 years without meeting parents? Common... secret family or con artist.", "NTA. Your friend and ex both have disrespected your boundaries and it would be perfectly understandable to tell both of them to get out of your life and never come back.", "Yes it is a cultural thing, but thankfully my family aren’t one of those who sees a woman’s marriage is her biggest accomplishment. They only want me to be happy single or not. They never interfered in my love life and never pushed me to find a partner.", "I also congratulate you, because it sounds like you got rid of some dead weight when you broke up with him. Way to go!", "I would think hard about the \"friendship\" With the friend.", "Distance between the friends who think he deserves another chance.  Drop the friend that ambushed you with him.  Keep those good friends who supported you", "Also, OP - he drove \\*forty-five\\* whole minutes to be there? Boo-Hoo. That's my commute to work... Your friend is nuts and deeply insensitive to YOUR needs.", "I agree. Good riddance to him. And now you know that your friend isn’t your friend either. That’s unfortunate but it is informative and I would cut her out of your life too.", "I hope they are an ex friend", "Are your friend and your ex hooking up? I’d bet they are lol", "Why would your friend invite your ex in the first place ? I don’t see how it’s funny at all, and why your ex would even think he’s welcome also makes no sense. You’re NTA at all, tell your friend to fuck off though", "/u/AdriannDelong is a karma farming bot. This comment was stolen from [here](https://www.reddit.com/r/AmItheAsshole/comments/175zksv/aita_for_walking_out_of_my_bday_dinner_after/k4jmnx1?context=3)", "This is all you need to hear", "Yep, gray rock whoever gave you any pushback", "Is he nice or is he friendly? By what you describe he wasn't that nice to you, he behaved selfishly and didn't appreciate you, those aren't nice things. Maybe he's just a friendly person that's pleasant to be around when nothing is required of him or the relationship.", "So? Let her say stupid stuff all she likes. Like, what if I said that if you like vanilla that means you hate chocolate? That's as stupid as what she's actually saying to you!", "The audacity she has to tell you how you feel and how you should act. \n\nHonestly, you really sound better off without these two people in your life. They clearly do not respect you, care about how you feel, or take you seriously. Good riddance.", "You deserve love and attention!  Don't back down now - you are strong - and you know he is not going to give you that love and affection.  The parent thing is also very off.  NTA!", "You weren’t harsh at all!  NTA, and it takes a lot of strength to stand up to a bully, and your “friend” IS a bully, and enforce your boundaries.  You should be so proud of yourself, and if any of your “friends” disagree, tell them to go pound sand.", "I would have said the same.", "You weren’t harsh honey.  I would have wanted to ream her a$$ but I understand the work thing.  Just don’t ever trust her again.", "I'm so happy that you have the parents you do. Too bad they haven't rubbed off on your 'friends'.", "Friends who want to engage in these power games are the worst. NTA OP, lose them both. Disrespect to a no is not acceptable from anyone.", "With a friend like that who needs enemies?  Maybe OP's ex and her friend should rather be together.  I'd dump the friend too honestly.", "Or she's one of those \"People are only happy when they are in couples\" types. Damn that's responsible for some terrible relationships.", "Nah, OP don't ever talk to her again except for work stuff. She'll be dating him in 3, 2, 1...", "Just what I came to say. Watch your back at work!! It’s almost like she wants him back in OP life for a reason? Does she want to see him more herself? So strange I can’t work out why she would do it but it might escalate and she doesn’t care about OP for sure. Troublemaker", "She's toxic and likes to stir drama.....Stop trying to get an explanation from her because you'll never get it.....I'm getting slight narc vibes from this.  Cut her out of your life.  You don't need shit stirrers and gaslighters.  You need actual friends.", "She’s been single for a long time yes. But she always brags about how all the guys likes her and when ever we’re out she would say look at all those people checking me out. So she says she’s single by her choice.", "Yeah, right... In my experience, people with no life of their own are the ones who keep meddling on others'."]}