{"id": 28761, "submission_id": "1766i5t", "title": "AITA for telling a guy he’s socially incompetent because he was rude the entire dinner?", "selftext": "So yesterday I was sitting at dinner at our college dining hall with a friend of mine, a guy I met from my class, and his friend. His friend was fine at first but gradually he became the most annoying person I’ve ever met, lemme explain. \n\nHe constantly interrupted everyone at the table, told stories that were completely unrelated to the stories being shared at the time, and everything that came out of his mouth was about him. Literally nobody else. No questions, no comments about what someone previously had said, just what he wants to say next about HIM. This man was 23 acting like a 10 year old.\n\nBy around what felt like the fifth time he interrupted me, he proceeded to cut my friend off when she was right in the middle of a story with some bullshit. I said “excuse me, my friend was talking.” He said sorry. And fucking continued to interrupt us when we were talking.\n\nI was ready for this dinner to be over since he already ruined it, and his friend could tell we were done with his social incompetence. His friend said they had to go and we breathed a sigh of relief. As we were leaving, he tried to hug me and I dodged the hug. He said something along the lines of “this was really fun, I want to ask for your number” , hitting on me, and I just said seriously? no. He said why not. I hesitated, looked at my friend, and told him the truth. That he was rude all night long, constantly interrupted us, and did not seem to understand any social cues. He seemed visibly upset and his friend shook my hand and they walked off. Every part of that man made me uncomfortable to my core, his behavior was just horrible. I wish you could’ve seen his behavior to understand what I mean. I promise you I’m not overreacting; usually people like this seem ignorable but he was speaking every five seconds.\n\nMy friend told me she understood why I said that but it was really bitchy of me and that I need to work on my reactions. I told her that I was so done by the end of the night with his audacity and blindness that I snapped. I feel pretty bad, but at the same time, our other roommates told us that I was being reasonable after I explained the situation. My friend said that “I shouldn’t put effort into pleasing weird men or making them feel comfortable.” I still feel shitty.\n\nUpdate, I blocked his snapchat account and he dmed me on instagram. I am so done with this creep. Like I didn’t even know that people like this existed", "created_utc": 1697115854, "permalink": "/r/AmItheAsshole/comments/1766i5t/aita_for_telling_a_guy_hes_socially_incompetent/", "score": 3302, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I went out to dinner with some friends and a guy that was there completely ruined the vibes by being super socially blind and rude to everyone. Just super annoying. He asked for my number to hit on me at the end of the night and I didn’t just reject him but also snapped at him and told him why I didn’t like him. I might be the asshole because of my reaction and how aggressive I was in telling the truth.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. This is a learning lesson for that guy. I have adhd and I have the HARDEST time NOT interrupting others. It’s just takes a lot more effort on my part to wait my turn to speak. I know everyone is different and some have a harder time being social or reading social cues but it’s not impossible. Just takes more effort for some of us. Also being told by someone to stop interrupting isn’t a negative thing. Give them the time to speak just as you’d want someone else to do the same for you.", "**My friend said that “I shouldn’t put effort into pleasing weird men or making them feel comfortable.” -** You're friend is wise NTA", "NT A - he asked for your number, you refused. He asked why, you answered truthfully. There is no reason for you to feel shitty about this.", "“it was really bitchy of me and that I need to work on my reactions.\"\n\nNTA and your friend is way off base.   Do you want more Andrew Tate's in the world?  That's how you make more AT's.  Anyway, he demanded to know why you weren't interested, so you told him.\n\nDon't ask a question if you can't handle the answer.\n\nMy friend said that “I shouldn’t put effort into pleasing weird men or making them feel comfortable.”\n\nThis friend is correct!", "NTA. Maybe he’s acted that way because no one has ever been brutally honest.", "NTA\nDoesn’t sound like your the AH. If someone was being rude and cutting everyone off all dinner I would feel the same way. I think you “snapped” after he asked for your number, I hate when this happens and it’s really awkward to say no but also you shouldn’t have to give someone your number that makes you uncomfortable. Good for you it’s probably the first time anyone corrected the guy or called him out on his behavior.", "NTA\n\nThat bahaviour is a massive pet peeve of mine. You did him a favour by letting him know what he dis wrong. It's up to him now to see if he can fix his shitty social habits.", "“You shouldn’t put effort into pleasing weird men or making them feel comfortable” is the right take here.  NTA.", "NTA - realistically, he needed to hear that and hopefully will take it as a learning moment.", "So here’s the thing, maybe he doesn’t know, maybe he has no idea what he’s doing, maybe he really just doesn’t see those social cues, maybe it’s not his fault. But it’s also not your fault, or your responsibility, and honestly you may have done him a huge favor by slapping him across the face with reality to say “hey buddy re-calibrate it’s time to get your shit together”. You’re fine, and honestly you may have helped him.", "NTA\n\nAlways trust your gut.  This man made you feel a way, and you should trust the feeling.  \n\nMy ex-husband was an over talker, it was miserable.  He would never stop, no matter the subject, either he was an expert, or his buddy was an expert.  I now see that he acted this way because he was nothing but a wimpy little boy who needed to show others he wasn't.  \n\nMaybe he listened to your feedback, maybe he didn't, either way you don't have to put up with him.", "NTA", "NTA. Shun him", "NTA. The guy was acting like an ass as a way to get attention/to hit on your and/or your friend. He's a buffoon.", "NTA. The friend who told you that you shouldn't put effort into pleasing men and making them feel uncomfortable is correct. They are not entitled to your time and attention, and it seems like this particular guy may have believed that since he continuously interrupted people and tried to make it a night about him. Good for you for calling him out and being honest.", "NTA - I feel like it’s really hard to be the AH (or an unjustified AH) when telling the truth. \n\nIf you were honest about how abhorrent his behavior is, it might do him more good than harm in the long term. Hopefully he can take what you said and better himself and learn not to interrupt people and be more polite. Sometimes you just need a wake up call even though it might hurt in the moment. \n\nGood for you for not putting up with that and for shutting his request for your number down. Many woman would have just given it to him just to get him to go away.", "NTA\n\nEw. If your friend feels so bad for him, *she* can give him her number.  Oh, she doesn't want to do that?  Of course she doesn't.  And of course you don't.\n\nAaaaand now he's stalking you.  Of course.  You may need to bring this to the attention of your university.", "NTA. I have a horrible suspicion you have been in the presence of a thoroughly misguided acolyte to some online so-called \"pickup artist\". If this is the case, he (thought he) knew what he was doing and it was a deliberate (and insane) attempt to seek some kind of social dominance. And then the poor fool was thoroughly confused you didn't find his commanding presence incredibly sexy.", "If he's still hitting you up, you weren't rude ENOUGH. NTA.", "Your friend is wrong. You do not have to feign interest in people that you find unsavory. He may be on the spectrum and unable to process social cues, but he isn't deaf. You asked him to stopped interrupting your group and he did not. You told him you were not interested in him and he STILL continued to contact you repeatedly. He does not respect boundaries and that is the worst kind of person to \"be more polite to.\" They will take that as encouragement and suddenly, you're a bitch for leading him on. The fact that he went in for a hug shows he didn't hear anything you said to him. \n\nContinue to trust your gut when people creep you out. Your job in life is not to make yourself feel worse in order to make other people feel better.\n\nNTA.", "NTA, I would have told him to shut the fuck up a few times by the sounds of it", "NTA \n\nYou asked him nicely. \n\nHe has selfish vibes. \n\nHe asked why you said no, which is very weird to me. You told him.", "NTA dude was an asshole. He deserve no consideration. You did well to shut him down hard. Your friend should give their number to that insufferable asshole.", "NTA. I think this was something he needed to hear. If he hears it often enough, from different people, it might start to sink in.", "NTA - Your friend in the last statement is correct. Hopefully, the guy will take your statement to heart and learn a lesson that he is not the only person who matters, and that listening is a skill he should work on. Imagine going on a date with him - you will not get a word in edgewise.", "that was not bitchy of you in any way, shape, or form. you set a clear boundary and, when asked, you explained yourself. he sucks. any friend that says you were wrong is an ah.\n\nNTA.", "Your friend is also weird bc wtf?? Good on you for saying SOMETHING bc he needed to be put in his place. Weird. NTA", "NTA and THANK YOU for being clear with him\nI get so frustrated when we're told to be polite and skirt around behaviour like this. This guy had zero self awareness and seems like nobody has ever told him this.", "NTA\n\nWhen I was 17, someone told me point blank about a behavior of mine that was socially inept. 40 years later, I'm still regularly thankful that they did so. Because of them I was able to grow into a better person, and I shudder to think of what my life would have been like had they not spoke up when I was still young enough to fix it before it became part of my adult reputation.\n\nYou did him a favor, and hopefully one day he will be thankful for it.", "Honestly he can’t learn what he did is rude if nobody calls him out on it. It would have driven me crazy at some point as well too. \n\nAlso by the other comments you told him politely your friend was talking and to stop interrupting. All courtesy was already used up at that point. You didn’t say it till he actually asked you why. NTA", "I feel you girl. I actually have a similiar problem sometimes and I actively work on it. When I get excited or am happy to talk about something I can interupt but over the years I have worked on it. If I end up doing it I am now very good at catching myself, stop speaking, apologize for cutting them off, and allow them to continue speaking. Ive noticed most people appreciate that gesture and understand especially if they are aware I have ADHD. \n\nNTA he needed a little kick in the ass to realize whats wrong with it and realize he won’t be able to have comfortable social interactions till he realizes the sound of his voice isnt the only thing people wanna listek to", "NTA, he hasn’t had enough of people like you in his life to point out his bad behavior to make him feel a need to change. People like your friend, who say just to let it go, are why he feels it is acceptable to be that way.", ">>but it was really bitchy of me and that I need to work on my reactions\n\nYour reactions are perfectly fine, you refuse to be in the company of strange and inappropriate-acting people. Might hurt their feelings, might save your life.\n\nNTA", "Anyway, let me tell you about the time I...\n\nKidding.  NTA. If you'd stood up to leave and just unloaded on him about everything, I'd say ah.  You said bye. He tried to HUG you [what?] and then asked for your number, you declined. The *moment* he kept pushing with \"why not\"   the gates are open. You said no--end of discussion. You don't have to validate or justify that. \n\nYou weren't rude or aggressive--you were honest.  Hopefully he's self aware enough to take what you said in, after the initial sting dies down. Hopefully, the fact that it stung, bc you're someone he liked, helps it hit home.\n\nIs he neurodivergent? Possibly. But we can't approach life just letting folks behave badly to us because they just might possibly potentially be. If something's present I need to be aware of [don't touch Billy with your left hand, it triggers him and he'll bite you] make me aware so I understand the interaction. \n\nYou feel bad bc you're not an ah. Stop--you may have given him the teachable moment he needs.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nSo yesterday I was sitting at dinner at our college dining hall with a friend of mine, a guy I met from my class, and his friend. His friend was fine at first but gradually he became the most annoying person I’ve ever met, lemme explain. \n\nHe constantly interrupted everyone at the table, told stories that were completely unrelated to the stories begin shared at the time, and everything that came out of his mouth was about him. Literally nobody else. No questions, no comments about what someone previously had said, just what he wants to say next about HIM. This man was 23 acting like a 10 year old.\n\nBy around what felt like the fifth time he interrupted me, he proceeded to cut my friend off when she was right in the middle of a story with some bullshit. I said “excuse me, my friend was talking.” He said sorry. And fucking continued to interrupt us when we were talking.\n\nI was ready for this dinner to be over since he already ruined it, and his friend could tell we were done with his social incompetence. His friend said they had to go and we breathed a sigh of relief. As we were leaving, he tried to hug me and I dodged the hug. He said something along the lines of “this was really fun, I want to ask for your number” , hitting on me, and I just said seriously? no. He said why not. I hesitated, looked at my friend, and told him the truth. That he was rude all night long, constantly interrupted us, and did not seem to understand any social cues. He seemed visibly upset and his friend shook my hand and they walked off. Every part of that man made me uncomfortable to my core, his behavior was just horrible. I wish you could’ve seen his behavior to understand what I mean.\n\nMy friend told me she understood why I said that but it was really bitchy of me and that I need to work on my reactions. I told her that I was so done by the end of the night with his audacity and blindness that I snapped. I feel pretty bad, but at the same time, our other roommates told us that I was being reasonable after I explained the situation. My friend said that “I shouldn’t put effort into pleasing weird men or making them feel comfortable.” I still feel shitty.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Well, somebody had to tell him. NTA.", "NTA and even if he acted accordingly you don’t owe him your number\n\neta : or a hug", "NTA", "You’re NTA at ALL.  You gave this person honesty and a reality check he sorely needed.\n\nMost people would t have bothered. I was pretty annoying when I was younger and nobody bothered to say anything to me. They would talk and laugh behind my back and try to avoid me.  I wish somebody once had told me flat-out how annoying I was. I went for years wondering why my “old friends” avoided me.  \n\nGood for you. Very good.", "NTA, this is what happens when raised by parents who dote on you, put you on a pedestal & always telling you how great you are. He needs to know that he's not the bee's knees.", "NTA. He behaved badly and you called him on it WITH details. You should never feel obligated to spare someone’s feelings especially when they didn’t give two shits about anyone else’s.", "NTA - good for you no need to tolerate that annoyance- you weren’t even mean you sounded clear about what happened. Hell, if he any self awareness you told him what he can do to make himself more approachable.", "NTA.  Sorry to hear about your horrific experience.  Sad to see many young men who behaves like this.", "NTA. Unfortunately plenty of people like him exist. Congratulations on your answer to him.", "NTA. He asked you why not, and you told him.", "You are certainly NTA, but be advised, there are LOTS of people like this.  Stuck at a dinner table and then confronted by him, I would say your actions were appropriate, even if harsh.  But you can expect to find this type of person (not gender specific) in most workplaces and you might need a better coping mechanism for professional purposes.  However, you never need to explain yourself for rejecting unwanted advances socially.  Again, nta.", "NTA.  You didn't give the creep even half of the dressing-down he deserved.", "NTA. You saying \"excuse me my friend was speaking\" should have been his first clue. I'd be pretty pissed too. Also the fact that he thought after all that to ask you on a date? Dude read the room ffs", "NTA at all\n\nand you have nothing to feel bad about.  When he specifically asked you \"why not?\", after he propositioned you, it was TOTALLY ok for you to be honest with him.\n\nit sounded like something he needed to hear, and he should be grateful for you being honest with him.\n\nMaybe he'll do a little soul searching", "INFO\n\n> I need to work on my reactions.\n\nFFS, *why*?\n\nSo you don't offend people acting rude?", "\"My friend said that “I shouldn’t put effort into pleasing weird men or making them feel comfortable.\" Your friend is 100% correct. And guys like this are never going to figure out why everyone runs away from them if everyone just ghosts out and doesn't say anything. NTA, and good for you for calling out his bad behavior to his face.", "NTA and mad respect.", "Trust your instincts. Not only was he rude, but the hug and the dm after lead you to feel like he is a creep. He probably is.\n\nNTA, but keep an eye out. If he starts showing up places, let campus police know.", "NTA. Honestly everything you’re listing sounds like autistism… so the people saying he’s Andrew Tate or whatever are a little bit off base I think. Having Autism doesn’t preclude someone from learning social cues though, in fact, a lot of the time it’s autistic men who are visibly autistic because they don’t have the same social pressures as women.", "He isn't taking the hint is he?\n\nHis social cues are so far off I wonder f he is on the spectrum rather than just free range rude. \n\nNTA you do not owe him anything. Your friend is correct.", "NAH\n\nI know people like this and they're some of the most annoying people on the planet. A conversation is something you share, it's not just an opportunity to blabber on without listening to the other person.\n\nThat said, I don't think this guy was being an asshole on purpose. He seems socially incompetent like you said, and he doesn't seem to notice when other people are bothered by him. Since he asked for your number, I'd assume he was trying to make a good first impression and just failed miserably. It's not like he was trying to piss you off.\n\nYou did this guy a favor by calling him out. Hopefully he'll use it as an opportunity to work on his social skills. It wouldn't shock me if you ran into him in a year or two and he's a lot more respectful/pleasant to be around.", "He may be a decent fellow with very poor parental socialization. ADHD is possible. Narcissistic parents could be an issue. He probably has no idea how to interact, but it is a bit early to let him have both barrels. Save the ammo for later?", "NTA but I am wondering if he is on the spectrum scale? \n\nThat does not make it right. People with autism need to be taught social niceties and how to be respectful. It is harder for them to learn them but it can be learned. \n\nThat this guy then DM'ed you is odd and concerning to me. You dodged his hug and told him he had offended you, yet he persisted in trying to open even more lines of communication. \n\nProceed with caution.", "told to him in the right way, it might have been a good way to help him in the future.", "NTA but you probably could've phrased it a bit differently.", "next time tell him he is a narcissit and you dont date narcicisst. nothing wrong with what you said. your friends is out of line. NTA", "[deleted]", "NTA, but you need to work on your emotional intelligence as well. There is a difference between being aggressive and assertive; sounds as if your reaction was an aggressive one and that's why it came off so off-putting. I do think you owe your friend an apology for being aggressive, but then re-affirm your position in an assertive manner. Your feelings are valid, but remember to consider others as well.\n\nNTA", "NTA. Maybe, just maybe he was on the spectrum and he really liked you. It is amazing how often people despise the people who like them the most. He didn't understand how to process his emotions and got ahead of himself. It happens and I hope this guy finds someone who appreciates him. I also hope you learn to take these \"compliments\" in stride and understand you won't always be \"hit on\" by those who interest you, sometimes you will be hit on by \"heels.\"", "nta", "NTA;  Sounds like he may have been autistic as that behavior is not atypical in my experience.  On your end, you turned him down and when he once again missed the cue you had to drive it in.", "NTA. Don't give it another thought. You are allowed to say no and no is a complete sentence. In no universe are you supposed to go on pity dates with nasty guys. Your friend is way out of line saying that you should have been nicer to him.\n\nKeep him blocked and do not communicate with him.", "He seemed to feel it necessary to share every thought he had, the minute he had it, so can't really complain when you reciprocated. Especially when you were specifically asked to.\n\n&#x200B;\n\nNTA", "Oh it was “bitchy” of you to tell him that *he* had been unbelievably rude all evening? Your friend sounds like she is a doormat.", "Soo... ADHDer... I motermouth like a mofo but wait my turn to do so. It's a learned thing. So he either neither had someone point out his flaws, or someone has and he refuses to work on them. It's an effort. One that he didn't care to give.\n\nAnd red flags on being blocked and then hunting you down on another social media", "NTA - was he on coke?", "NTA- You did that guy a favor.", "NTA I can only hope this guy learns from it. My ex-boyfriend was like this, if you were talking he would nod impatiently, interrupt, and immediately try to get his own story in. He never, ever, ever unlearned this behaviour it only got worse", "NTA. He was socially incompetent. End of story.", "Nta. He's exactly like someone i know. That person has autism. Maybe he has it to?\nIt's hard to deal with that tho", "NTA - He was being rude and you called him on it.  And then he asked why, so you explained it.  He asked for it.", "NTA", "NTA. \n\nI have a very high functioning autistic kid. most people at first wouldn’t realize he is. His biggest issue….. Social interaction. \n\nAt 24 I still work with him on not interrupting, active listening, not taking only about D&D, social cues, etc. \n\nYou are absolutely ok telling him what he did wrong. Many times people don’t say anything and for someone who is neurodivergent they don’t know what they are doing wrong if someone doesn’t say anything. \n\nNot saying this guy is. He could just be self centered and rude. But you should always call out unacceptable behavior becuase for some people it may be the first time someone pointed it out and gave them clues on what to work on.", "NTA! You have nothing to regret.  \nDon't give it a second thought, he's not worth the energy.   \nTalk about not understanding social cues!! Your words weren't even enough to cut him off.  Tell him that you are not interesting in any contact from him and any further attempts will be considered stalking behavior. Then block him everywhere.", "NTA \n\nNo one ever told him he sucks. Now you have, and he can start the introspective process or trying to be better.", "Rooster syndrome. A male who thinks that by strutting around and making a lot of noise, he's going to attract his chosen mate. He's the 9-year-old who sabotages your homework, only larger and louder. NTA.", "Info: were they high or maybe on the spectrum?", "He was literally asking for it when he asked “why not”", "NTA he literally asked and given he seems to have trouble with social cues, I would’ve thought he’d appreciate the bluntness", "NTA.  You were honest about how he was acting.  Alsl, you aren't required to go out with any man who asks.  It sounds like you dodged a bullet.", "I told him very nicely the first few times. I also have struggled with ADHD since childhood and struggled with interrupting people. It finally took me 15 years to realize that it puts people off because nobody ever told me to stop until my dad said something about it, then boom I worked on it. I get it’s not as easy for others but over the course of one singular night I told him so many times to stop doing it, and he refused to work on it. I honestly wonder if he simply can’t control his vocal cords like maybe hypervocalization? Idk, whatever the case is, he’s gotta work on it.", "It kind of sounds like the golden child is out on his  own, and hasn’t realised he isn’t everyone else’s golden person\n\nor he is Mummy’s special little guy", "[removed]", "I'm just a random geriatric millennial Auntie, but honestly, I was prepared to give OP the same advice lol \n\nFriend is very wise.", "I want this tattooed on my forehead. F*CK POLITENESS.", "I also loved this so much.", "I love wise friends", "Yeah like OP was not unpleasant until he challenged her rejection of giving her his number. \n\nSorry but that’s hugely inappropriate, you don’t challenge someone’s “no” and if a man did that to me I would get extremely harsh and rude.", " Good for you for calling him out and being honest.", "Plus, Creeps McGee wasn't fixated on the friend. He was fixated on OP and getting her number. It's really easy to tell other people that they should be nicer when you're not the one at risk of unsolicited dick pics", "I really hope you're not saying that the friend who said she shouldn't put effort into making weird men uncomfortable is off-base. If you are, kindly fuck off with that nonsense. It is in no way the responsibility of women to keep men from being Andrew Tate.", "This is often the case with young adults who were pampered and sheltered by their parents during their formative years. A proverbial cold glass of water in the face is what they need", "Shun the non-believer!\n\n\\*flees to go hide in a dark, old corner of the internet\\*", "Excellent post.", "Too many men act like it's ok to talk over and plow through conversations. Autism does not equal talking over others.", "You can’t just write off every case of social incompetence as autism, some people are just assholes and completely unaware", "He could have definitely had a touch of the tism. Though I’ve had plenty of homies who struggle with it and they aren’t nearly as off putting or unwilling to listen to social suggestions. He’s not andrew tate but what I will say is he was “mansplaining” things to us all night long as if we were stupid", "I agree that's a possibility, and would add that because society sucks, sometimes guys with autism get majorly babied/enabled growing up and are not taught about respecting boundaries, and their autism gets used as an excuse for unhealthy behavior, instead of an explanation for why they need more support and guidance to behave in a respectful way. Kind of a neurodivergent extension of weaponized incompetence. (Meanwhile many autistic gals are often either not diagnosed or expected to 'overcome' their autism, because autism is seen as more normal for boys, and there's a lot more stigma and pressure to hide it for girls.)\n\nBasically I would say there's a big difference between 'I miss social cues sometimes' and 'I don't have to respect social cues because I'm different' and unfortunately some autistic guys end up internalizing the latter. \n\nHopefully the dude in the post isn't one of them (if he is autistic/otherwise neurodivergent) and ends up learning from this how to treat people with more consideration.", "dude's smart enough to challenge her \"No\" when asking for her number though", "Woman on the spectrum here, and this sounds like just another a self entitled immature guy tbh", "I think it was a good way to help him, even if it takes a bit for him to swallow his pride and realize that she had a point.", ">it sounds to me like he might have a developmental or social disorder.\n\nPlease stop equating being rude with having a \"developmental or social disorder\". Some people are just rude and diagnosing them based purely on that is insulting.", "if someone has the audacity to ask “why not” to someone saying no then they deserve the truth, even if it’s not nice or if they can’t help it. NTA", "\"I'm just not interested\" leaves this guy, autistic or not, thinking his behaviour was acceptable. He thinks he behaves acceptably. Since apparently his parents and friends have not disabused him of this notion, eventually someone else is going to. \n\nBeing neurodivergent is not an excuse to do and act however you want (speaking as a ND person). If you are rude, people will not want to be around you. But if he doesn't know his behaviour is rude, he can't fix it. Honesty was absolutely the best policy, for everyone concerned.", "NTA.  He asked for your number, you said no, that should have been the end of it.  He asked why, you told him honestly.  He won't get any better socially if nobody tells him how he's messing up, not that it's your job to help him get better.", "Yeah. To me, even if he was barely rude….you weren’t rude until he *asked why you turned him down*. That’s weird and off putting. You don’t challenge a woman you just asked out. You don’t challenge her no or ask her to justify it. That alone puts you in the right- you needed to be rude in that moment because yikes", "He wanted to know why you didn’t want to hang out again, you told him factually. You would have kept your disdain to yourself unless he pressed you. This is entirely on him", "I'm glad I read the comments first because honestly my comment was going to be \"If he doesn't have something that blocks him from noticing when he's being rude, he's just an AH, and if he does, then he NEEDED you to tell him.\" NTA", "Not your problem, whatever it is. You don't owe him a pity date or a pity friendship if you don't like him.", "NTA. Shun him..", "First, you are not an asshole for being uncomfortable with his behavior. You felt he was behaving inappropriately and when asked you told him. \n\nThat being said, this man is Autistic. Not an excuse for his behavior, but can offer some insight into why he nay have behaved the way he did and reacted the way that he did when you rejected him. Autistic people (not all, Autism is not a monolith, but myself and many others on tne spectrum) tend to react to stories by relating them back to themselves or their interests. This can manifest like the following;\n\nYou: we went to x last weekend, it was a lot of fun, we really enjoyed ourselves.\n\nHim: oh, ive been there before, this is what i did when i was there. \n\nIt can also manifest like such;\n\nYou: i'm a biology major.\n\nHim: oh that's interesting. Here is every fact i know about deep sea microbes. \n\nObviously he has crossed your boundaries and is not worth salvaging any kind of relationship, but perhaps this information will prove useful to you the next time you find yourself in a situation similar to this one.\n\nEdit: accidentally said probe instead of prove. Post now involves 100% less probing", "[removed]", "He's 23, though. I assume he has been in social situations before without Mummy.", "another older poster,  easing towards 60 and I believe very strongly we should not coddle people who treat us like this", "As a GenX Grammy, same.", "How can you be both geriatric and a millennial when the eldest of us are maybe 43?", "And stay out of the forest!", "?\n\nAh, I quoted the wrong friend!  Shit, my bad.", "🙏 AMEN    🙏", "Maybe the answer is to take him to Candy mountain", "The good side of the Internet", "No but the asking for her number after she clearly was not interested? That’s pretty clearly missing social cues. Yes, autistic men do that much more than autistic women because", "Plenty of people are assholes, but usually when people are unaware of social cues that’s autism. Like that’s literally one of the main symptoms in men. People can be autistic and assholes, and a specific kind of asshole because they have autism.", "Yep and then felt entitled to challenge your “no” when he asked for your number. \n\nSure maybe he’s neurodivergent. He is also a selfish and obnoxious AH and even more unfortunate, that means women cannot take the risk of further engagement with him. Significantly poor boundaries and entitlement issues make him an unsafe choice", "Yeah exactly for sure", "Being autistic doesn’t make you stupid? Jesus Christ", "You are probably right. I do know that some folks on the spectrum have a habit of interrupting people, that does not mean it is the case here. I was just wondering if that was possibly the reason.", "[deleted]", "[deleted]", "Based on the update, it seems that even bluntness was not enough to get through this dude's thick skull.\n\nOP, he sounds legitimately awful, and you started off with more gentle reminders, which puts you firmly in NTA territory.", "Oh this is one of things that drives me absolutely nuts as a woman. That we have to justify saying no to a guy and then make certain we didn't hurt their feelings. I'm married and even THAT sometimes isn't enough to put guys off. Frankly I shouldn't have to invoke a relationship to get a guy to leave me alone. No is a complete sentence and tell your friend you don't need to be nice to people who aren't giving the same courtesy. We need to stop coddling mens feelings and THEY need to learn they are not entitled to our attention\nNTA", "I don't think she was being rude when he asked her why she said no.  She responded truthfully to his question.  He does not deserved to be coddled after his bad behavior.", "No is a complete sentence...", ">That being said, this man is Autistic.\n\nThis man **might** be autistic. He might also genuinely just be rude and creepy. You cannot diagnose someone over \"he talked over us, he questioned me when I turned him down and now he is messaging me on things\" *Pleanty* of self absorbed and entitled neutotypical men act how OP described.\n\nAnd even if he was, how would the information prove useful to her if the situation happens again? She behaved fine", "As another woman OP’s age, agreed.", "GenX here too - your friend is a treasure and you should keep her around. The other ones, not so much.", "\"Geriatric millennial\" has become term for the earliest of the millennials as people born in the early 80s and people born in the mid 90s are both technically millennials but things changed so much in that time period that their experiences were more different than one might otherwise expect.\n\nI personally prefer to think of myself (early 40s) as an X-ennial: a microgeneration between the two who identifies with both. :)", "I believe the term geriatric here is used as a description of where on the Millennial range they are, not that they're geriatric AND a Millennial.", "43 is GenX.\n\n I'm not saying I'm geriatric. Middle aged lol but not geriatric. \n\n Geriatric millennial is just a funny term for the eldest of us born in 81 82 and 83. instead of being upset about it I just own it.", "If you’re 43 you’re Gen X. Younger Gen X but still X.", "In that case I retract my downvote. Strange things happen in the C/P buffer sometimes.", "Why do you think there’s such a clear distinction in female and male autism presentation, socially speaking? Why do female autistic people learn to mask and camouflage at young ages while males aren’t socially conditioned to do similarly? Those with the function capacity, of course. Men aren’t held to the same standards of decency and this is one factor why; people are used to accepting that it’s just how it is. Nah. My autism doesn’t make me an asshole.", "what is wrong with you, no one called the guy stupid. you are claiming that due to autism he can be as obnoxious as he wants, basically coddling him.\n\nautism doesn't mean you can feign ignorance at just some stances, dude knew he was pushing it when he didn't accept the no\n\nautism means you don't understand a no? that's it for you?", "There are only \"signs\" if you stereotype autistic people and the only thing you \"know\" about us is that we're rude.\n\nStop framing your ableism as acceptance.", "“I told someone who could potentially be autistic (but that’s not my problem) specifically why I don’t want to be around them anymore when they asked” \nBeing autistic doesn’t give a get out of jail free card, if anything that just makes everyone who’s friends with him an asshole too. Why hasn’t anyone stopped this behaviour yet??? Even when he was told to stop interrupting he kept doing it", "If he has an actual issue that makes it difficult to read social cues, then he needs more specific feedback so he can modify his behavior (if he wants to), not for everyone around him to secretly hate him but never explain why.", "But why?\nWell because I opened my mouth and that's the word that came out. Let me try it again. NO. see, I should probably just trust it!", "I agree with you. Gosh. People should really learn how to accept a NO and the reasons behind it if they pry on the why.", "No is such an alien word to men with fragile egos so I’ve seen!", "We don't. No is a complete sentence. Let men nurse their hurt feelings elsewhere. I also hate that people say \"I have a boyfriend, I have a husband, etc\" just to avoid saying no. No should be a complete sentence even for a single woman.", "Yeah, I've heard Xennial before (and I am one as well, being 40), but not geriatric millennial.", "Weird way to describe an older Millennial though.", "He should also absolutely be held to standards of not being rude and talking over people.", "Exactly that’s what I’ve been saying. I’m not a man, and I am not defending this man. I don’t even think what OP did was wrong, but labeling him Andrew Tate which is a man who is literally evil, an abuser and advocates for abuse, just because this guy can’t read social cues and is a man living in a misogynistic society, seems ableist. There is nuance and intersection in the world.", "This person is right. We don’t know if he was autistic, and even if he was, I’ve heard that the symptoms can range widely (I could be incorrect about this) and even if he was autistic, would you rather me play fake nice just to suck up to him because he struggles with that? He’s a grown man , he can walk and understand what others have to say and what others expect when it comes to being social", "And a guy doesn't have to explain HIS rejection at all, they can just say no and nothing else is required. I think we should be completely honest: why? Because I don't want to bang you, now go away.", "Women often do a risk evaluation and come to the conclusion that saying \"I have a boyfriend\" is the safest way to get out of that situation. We think survival is more important than not being a liar.", "You hate that they do it? Or hate that the world exists in such a way that makes people feel like they need to? Because that's an important distinction", "It's actually a very common way to describe an older millennial", "If someone treats me badly because they mean to, vs if someone treats me badly because they don't understand, doesn't really matter to me because I've still been treated badly. It's not ableist to not want to be treated badly.\n\nIf this was a person with whom she had an emotional investment, then it would matter, because she'd want/need to continue to interact with him. But this is a stranger. She doesn't owe him anything. He can fix himself or not -- it's not her problem to solve.\n\nThe man challenged her \"NO\". Autistic or not, that's an asshole move on his part. She was honest with him about why she didn't like him when he asked. She doesn't owe him anything else.", "As an autistic/adhd person, no, personally I wouldn’t prefer that you enable and essentially encourage his behavior. Autism and adhd aren’t an excuse to act the way he was behaving. Also, I don’t really see why people are trying to say he might be autistic, it’s not like there aren’t plenty of neurotypical people that behave the way he did. If the only reason people are saying he might be autistic is because he ignored social cues then they seriously need to think about their opinions. I’m tired of reading comments on different threads where people bring up autism as a potential reason/excuse with very little evidence to support their opinion.", "i understand that and I don't like that that is our reality. We should be able to say no and I do now.\n\nAlso, not sure it is just about survival but also about not hurting the guy's feelings. I should not have to protect his feelings when I don't want to go out with him.", "I hate that the expectation is to say there is someone else so i can't go out with you. I don't want to, so NO should be a complete answer. People like the friend calling OP \"bitchy\" don't help. No is NO.\n\nI have stopped doing it though it was easier to say I am not available. I don't owe anyone an explanation for my no.", "Funnily enough, this is the first time I've \"heard\" it, and I'm an xennial/\"geriatric\" millennial myself.", "Again, not saying OP didn’t act appropriately. Also not saying he shouldn’t learn social cues and should get a pass for being rude. What I’m saying is equating autistic traits to being an abuser is ableist.", "You're posting on reddit. Every other reaction will be about how 'he's possibly neurodivergent and that while that's not your responsibility, you could have been nicer'.\n\nBut I say you're out there doing God's work, NTA", "Nta lol \n\nEven if he's the sweetest coolest guy that just has some issue with socializing...like...he needs to be told. I kinda get why he asked \"why\" (you acted totally incredulous as opposed to \"flattered, but nah\").  But if you ask why, it's actually a kindness to get the truth", "NTA. And bow he can’t take rejection. You were completely correct telling him why after her asked.", "NTA\n\nHow exactly did your friend want you to handle the situation? He asked you out, which in and of itself shows how oblivious he is because you'd told him off for interrupting, dodged his hug at the end of the dinner, in what universe would you have accepted a date with him after all of that?  I suppose you could have just kept your reason vague with \"ohh, I just didn't feel a connection, sorry,\" but why should you make such an effort to be polite to someone who made *no* effort to be polite all evening? It sounds like no one has ever bothered to tell this guy he's obnoxious in social situations, *someone* needed to say it.\n\nIs it possible he's neurodivergent? Yes, but that just means you don't pick up on social cues, and things like hints and passive language go over your head, it doesn't mean you're *incapable* of learning etiquette and social norms, you just need that stuff spelled out for you more explicitly than others.", "NTA. It sounds like he has a problem with social cues that he really needs to work on. (Perhaps ADHD or something similar?) In any event, you explained the exact problem, and he can chose to work on the problem, or he can sulk and keep acting the way he has. But you did him a favor letting him know he had a serious issue.", "NTA. Sounds like he needed a reality snap. Sounds like he is really dense. Best to avoid him and tell your friends you never want to be where he is.", "NTA. There are people who legitimately do not know how to read social cues or who are just ill-mannered or have never been taught how to act appropriately when they are in a group or crowd of people. You clearly did not hit it off with this guy and he was a source of great annoyance to you. The bigger concern is that he DMed you after you clearly stated that you were not interested.  Keep your eyes open, OP. This weirdo could be lurking in the shadows, but NO MEANS NO.", "People with Autism and ADHD are like this. Perhaps he has one or both. My son has both and although he takes ADHD meds, they don’t help with Autism. Or perhaps he’s just an AH", "NTA You said no and he kept pushing. That fact that he proceeded to dm you on insta after you blocked his snap is WILD. He needs to take no for an answer.", "NTA OP.  This is what happens when people only communicate via text and are not taught social ques.  He needs to learn it somewhere.", "NTA. He asked you why you wouldn't give him your number and you told him. It's not like he was silently getting his coat and out of the blue you started telling him he was undatable.", "NTA, your friend who said you need to put in effort needs to explore her deep seeded misogyny. WOMEN DO NOT NEED TO BE NICE TO CREEPY MEN. He could have tried to be nice to you by not interrupting a thousand times but he didn't so you get to be mean, rude whatever.", "NTA.  Contrary to how some women were raised, women do not have to sacrifice themselves or their time or their effort to make any random man happy.", "NTA, people like that need to be reminded they aren't the main character.", "NTA. Was on a band trip to Europe this summer and you just perfectly described a certain person in my section. You’re not obligated to cater to or help fix their social ineptitude. It’s perfectly fine to distance yourself.", "Maybe autistic… no social filter,etc. consider this a possibility.", "A million times this: \"I shouldn’t put effort into pleasing weird men or making them feel comfortable.\" \n\nI wish I learned that lesson a lot earlier in life.", "NTA. He found you on social media after all that? Extra super creepy.", "Aa de boa vontade de boa vontade de boa vontade de boa vontade de boa vontade de boa vontade de boa vontade de boa vontade de boa vontade de boa vontade de boa", "To be honest, it's pretty rude to dress down anyone like that in public just because they are socially incompetent.", "Very soft YTA (even possibly NTA). one word really makes me question how you said it though: \"seriously\". Now text doesn't convey tone well but it reads mean to me.\n\nNTA for saying no to giving him a number, Nta for getting frustrated at him (as somebody who is ASD I get it), or being honest when he asked why.\n\nBut you said, \"seriously, no?\" \n\nYou already claim he's socially incompetent, he definitely sounds like he might have been ASD, and didn't pick up on hints very well. So why rub that in, why deliberately try and highlight his social inability and make him feel stupid for it.", "YTA", "You’ll be married to him in 5 years.", "100% NTA", "nta", "NTA. Don't blame you for curving this clown!", "Nta you weren't even mean. You didn't scream or call him names or hit him. All you did was say no. You wouldn't have told him he was socially unaware if he hadn't strong armed you into defending your right to reject him.", "Definitely NTA. He asked. You were just honest. Clear messages are a kindness", "Being rude is how he ends up at dinner with you. The non-rude guy isn't there.", "> He said why not.\n\nNTA. Don't ask the question if you can't handle the answer", "How bubbly and high-spirited of him.  What a big personality!  I know the type.  People who are incapable of shutting up for 20 seconds and have to express every thought that comes to their mind, and they suck all the energy in the room.  I would have moved with your friend to a different table, and say there is something private you needed to discuss.  I no longer waste any time with those types of idiots.  NTA.", "Are you sure he isn’t on the spectrum?", "He probably thought he was being charming and engaging. Holding the attention of the entire table with his tales of daring and what not.\n\nNot that it matters, but I wonder if he has a hearing problem? Its easier to know what being said at the table if you control the conversation after all.\n\nAh well. You aren't obligated to like anyone or give them any kind of break you don't want to. NTA.", "NTA.  You did him a favor by telling him exactly how repulsive his behavior was.  If he’s smart, he’ll try to learn from this experience and grow as a person.  I doubt it though.\n\nEither way, you did nothing even remotely wrong.", "Obvious NTA. You can argue why he is doing this at this point is that not enough people bitch at him for his behaviour.", "NTA, he was being rude as hell the entire time. And then he tried to hug you? \n\nHe asked, you answered. There's no need to coddle rude people.", "NTA. He’s a child.", "NTA, this is a valuable service you have provided this person. They never knew, it was hard to take, but they might learn from it and become better", "NTA aaand did he try to add you on socials after the shutdown? EXTRA creepy!", "NTA.\n\nEverybody who has never called him out has done him a disservice. They've enabled him to think he's socially successful, instead of letting him knownhe's a boor.\n\nThank you for your good work!", "Normalize telling rude self absorbed narcissistic assholes the truth about their behaviour. You are probably the first person to not coddle him and tell him the truth about his obnoxious behaviour. You did the right thing. Your friend seems like a people pleasing doormat that enables entitled rude assholes.  NTA", "NTA  \nDude he asked you why, you told him.  \nAlso It may not be so bad for him as hopefully he will put a better effort into changing.  \nIf your other friend knew about this and maybe had let you known, because it seems he may be on the spectrum, maybe you could have taken it differently.", "NTA! Directness is a kindness, and even if it's really, really hard for him not to be annoying, it's still annoying. \n\nAlso dming you after a firm no is completely unrelated to \"not understanding\" so he clearly has the ability to be better, at least in that department.", "Was he on the spectrum?", "Nta and you don't owe him anything so why not be truthful? The only down side, which is stupid we have to worry, is him being crazy.", "Pk", "NTA. You just spoke your mind, and told him the truth about how you felt. Lying to someone and hurting them more later down the line is worse than telling them the truth and hurting them a little in the moment. Besides, you don’t have to give your number to anyone if you don’t want to!", "NTA. You weren't even mean about it. Just were honest. It'll help him in the long run. Not like you lit the mf up lmfao", "NTA, telling someone they have been behaving rudely is not itself RUDE. It may have been upsetting for him to hear, but why should you protect his feelings when he cared nothing for yours?", "NTA. My BILs ex was just like this and my husband, his parents, and I all just started to continue with what we were saying every time she tried to interrupt. For a few seconds it’d be her and whoever talking speaking over one another but we’d keep going until she gave up. She’d kept trying initially but eventually got the hint and waited her turn. Just some advice for if you ever run into someone like this again lol.", "\" I didn’t even know that people like this existed\"\n\nWhat, you've never heard of incels? He may not be officially diagnosable yet per DSM-5, but it seems inevitable. lol", "NTA. Also I'd report his stalking to the university. Might not be a big thing, or even matter much at all right now, but it might escalate. At least you should make it known so if he does escalate, they can take it seriously.", "NTA. The world would be a better place with more bitchiness ;)", "NTA.  \nPeople like that (regardless of why they're like that) need to hear it.  If they're far enough gone this may not even register.", "you are giving him so much credit\n\nhe didn't learn anything, he's going to call OP a bitch or a lesbian and go bother other people.", "While possible, I don’t think it’s likely - these types of people are often impervious to feedback", "I was thinking he really liked OP from the beginning and was a nervous blubbering idiot trying to look cool to her. But same. Hopefully he learns acting like this is not the way to get someone to like you back. NTA.", "Right?", "This dude is absolutely autistic, and while i don't think it's wrong to be truthful about why not, i do think OP might have handled the situation differently if that was taken into consideration. So I'd say NAH about the initial interaction, but definitely not cool that he's still trying to talk to her after she clearly said no. Autistic people understand literal instructions, so there's no misunderstanding there, just creepiness...", "He *may* be, but he didn’t act like a decent fellow.  And she was under no obligation to consider every hypothetical possible motive for bad behavior before answering an entitled question honestly. The end of the night after being treated rudely all evening was not “early”. \n\nAnd the dude’s follow up social media behavior is a pretty clear sign he’s a creep, not a “decent guy”.", "Is this supposed to be funny or something??", "Ew.", "Wow, you said a mouthful here.  I have adhd too and I think you made a good point:  some of the shit adhd makes us do *can* be controlled.  Like, the moment someone called you out on it, it put something in your mind that this is unacceptable.  I agree too it’s harder for some than others.  But I appreciate how you simplified things here.", "OP, you are the designated HAND OF KARMA. With great power come great responsibility use the power sparingly but with no hesitation.", "He obviously also doesn't understand \"No\" which is problematic. No is a complete sentence, you shouldn't have had to explain why -- and now he's harassing you even after you were \"rude\".", "I had a cousin my age that was very candid with me about it. I worked hard, tried not to just burst out with whatever thought popped into my head. It was hard for me, still is at mid 30s. But it's worth the effort.", "She also just described his behavior as she saw it, she didn’t call him names, insult his character, make fun of him, anything like that. He asked, she answered bluntly and honestly but not meanly. NTA at all.", "Generally speaking, people with autism feel bad as soon as it's clear we've misread a social situation. I'm hyperaware that I might not be reading social cues, so I pay extra attention and it's upsetting to find out when I've made people uncomfortable. I certainly wouldn't double and triple down to make them more so!\n\n\nBeing autistic and extremely enabled since childhood to be rude and entitled to other people's complete attention, however, might explain this jerk's behavior.", "Definitely, and this pisses off the autistic women who inevitably have to put up with their bad behavior. Autistic boys get coddled and enabled by people who think \"oh but he's autistic, he just doesn't know any better\" - he CAN know better if you explain things to him and explicitly set expectations. But autistic girls are still expected to have impeccable grace and etiquette, and can face consequences for even the slightest misstep in social situations. No one ever says \"awww but she's probably autistic, be nice,\" but they do tell autistic women \"awww but he's probably autistic, you know what it's like to be different, be nice!\"", "It's always important to point out in these convos (for passersby who might not know) though that masking is not good, nor is it even possible for some low support people.\n\nMasking, the suppression of ASD traits, is a response to social trauma and isolation and carries costs. It's linked to increased anxiety, depression, and has a substantial energy cost. The fact more women mask is a bad thing for women, it's not more men need to mask.\n\nI would add though, just because you can recognise there's an issue, doesnt mean you know what you did/if it was you/how to fix it. \n\nIt also doesn't mean you can fix it. ASD individuals will often interrupt because they can't judge the tempo of conversation well and pick up on when genuine breaks are. They can also become fixated on a convo point and struggle to move on if it's not brought up and begin to panic if the conversation is moving away from it.\n\nAlso info dumping can easily look like mansplaining.\n\nImo, one of the ways women often mask and avoid talking over is by reducing their contribution to conversation (that or booze), but men are deemed weird if they don't contribute as much so they can often go the other way in social situations.", "Nothing smart about that. Pure asshole behavior.", "So what I'm wondering now is, was he challenging her, or was he genuinely trying to understand why she wasn't interested? I guess it's hard to tell. But either way, definitely stressful as a gal to be put on the spot and have to justify your 'no' like that.", "Yes. See When Harry Met Sally.", "Ex x2", "No disrespect, but I know non-autistic assholes who behave this same way.  It’s called self-centered.", "You'd be surprised..", "I definitely agree with you, and want to be clear that I'm not advocating masking. (As a probably though undiagnosed autistic myself, I know how awful it is to have to hide every aspect of your personality and natural tendencies in order to fit in.) What I am advocating is looking for accessible ways to communicate that are respectful of the needs of others. And I do think there's a difference between arbitrary social ettiquite (which society seriously needs to chillax on sometimes, as it contributes to a lot of pressure to mask) and times where a boundary or hurt feeling is being stated and ought to be honored.\n\n(It is true that the latter can often be difficult because autistics prefer/need directness, and neurotypicals may prefer to be indirect or hint at an issue, which an autistic person may not pick up on. But once clear communication about a boundary or genuine need can be had, there's a duty on the listener to be considerate as best they can. This is what I am mostly referring to in my comment above when it comes to autistic men sometimes not respecting boundaries because of the way they have been taught.)\n\nI think you are absolutely right to point out that autistic people often have a hard time with judging the flow of the conversation, or processing transitions between topics. I really like the way you explained it, and I think it's something that should be better understood and talked about more often. Because if someone is able to identify that a person is just having a hard time with those sorts of things, and not intentionally being rude, it goes a long way in helping clear up misunderstanding and frustration. It's easier to be patient with them and accomodate their way of processing (eg asking 'did you have anything you'd like to add?') and if they do end up deeply treading on someone's toes, it's easier to explain gently (eg 'hey could you please let me finish? would love to hear your thoughts after I'm done.') I really do wish a lot more NTs thought about that and were willing to meet autistics (at least!!) halfway in conversation styles. \n\nAlso, didn't know that distinction between men and women masking differently in conversations! It makes actually a lot of sense. \n\nThank you for sharing your thoughts, I agree that that side of the conversation needs to be had and I'm sorry if I wasn't more clear!", "that's why autism can't justify his attitude", "Urgh.\n\nI was at a club with a friend-through-friends (no longer someone I speak to or associate with for a multitude of reasons) and he was **aggressively** hitting on a woman. To be fair, she was very much flirting back at the beginning and it was a 2 way street.\n\nBut SOMETHING happened that made her decide she was no longer interested. Common sense would dictate that he leaves her alone now, yes?\n\nHe asked for her number, she declined.\n\nHe asked her out on a date, she declined.\n\nHe started demanding to know why for both reasons. He got so loud and animated that I heard him clearly over the music and crowd from several metres away.\n\nWe ended up having to drag him out and tell him to go the fuck home.\n\nFor MONTHS he complained about getting rejected and that she \"Wouldn't give a good reason\" for not going out with him / home with him.\n\nAbsolute fuckhead.", "> That we have to justify saying no to a guy and then make certain we didn't hurt their feelings.\n\nAdd on to this that so many of them don't get the hint when we try to be nice and polite about things, and we end up having to be mean to them to get our point across.", "Can I just say though, that probably the most common advice my women friends give me when I talk about my dating struggles or confusions is \"well you should ask for feedback from the people who turn you down\". I never have for a few reasons, but I do have to imagine if I'm getting that advice I'm not the only one.", "I've had this argument with many a guy on Reddit. If someone asks if you want something, anything, and you say no, that's the end. We don't need to justify it. It's just a no. The lack of wanting it is the reason.", "Correct. Many neurotypical men demonstrate some of the behaviours OP describes, but few neurotypical men demonstrate ALL of the behavior OP describes. Also my source is that i know multiple autistic people who behave EXACTLY as OP describes (i live with one (: )\n\nShe did behave fine. I literally said she wasn't an asshole. I said that the information may prove useful in case she encounters someone on the spectrum who behaves like this and she wishes to help steer the conversation better. Understanding why behavior occurs can help you empathize with those people. Just because this man was a lost cause doesn't automatically mean the next one will be.", "Autism isn’t relevant to intelligence here. \n\n\nI think where we are probably in agreement is that this guy being an asshole shouldn’t be excused by “he might be autistic”. It’s an insult to neurodivergent people that neurotypical assholes take advantage of to get away with predatory behavior too often.", "learn to read social cues better and maybe normal people won't think you're rude", ">I also hate that people say \"I have a boyfriend, I have a husband, etc\" just to avoid saying no.\n\nI agree! I hate that sometimes women feel like they have to say it even more, though. I hate the idea that I need to be someone's \"property\" in order for them to accept my saying \"no\" and I hate that it sounds like I might have said \"yes\" if I didn't have a boyfriend.", "Last week, a 15 year old girl in the UK was stabbed to death on the bus because she rejected a boy who tried to give her flowers….\n\nIt’s all well and good to say “no is a complete sentence” but the FACT is that your own self-preservation should rise above principle. If a woman wants to mitigate the fallout from rejecting a man, don’t feel ashamed that you had to make up a story about a fake boyfriend, or your lesbian or whatever the hell you want to say. At the end of the day, our safety is paramount.", "I don't think this is bad advice, but there's a significant difference between saying, \"Hey- I understand that you're not interested and I'm not going to push you on that, but would you mind if I asked why? Maybe there's some feedback I can use in the future,\" vs. continuing to hound a woman, demanding that she give you a \"good reason\" for not wanting to go out with you. It's all in the execution!", "Why would you ever want feedback from people that don't like you or dead relationships? That's bizarre. Why alter something to suit someone you're not even suited to. I mean apart from possibly annoying them or scaring them if they said no from the start, that sounds like ridiculous advice. \n\nIf there's any relationship feedback worth a damn it'd be feedback from and during a successful relationship with a person that actually likes you, that way you can pull yourself up if you're falling into behavior patterns that make them miserable.", ">but few neurotypical men demonstrate ALL of the behavior OP describes\n\nYou have lived a charmed life if you think tht.\n\n> Also my source is that i know multiple autistic people who behave EXACTLY as OP describes (i live with one (: )\n\nYour source for if neurotypical men behave like that is knowing autistic people? Or your source for thinking you can diagnose autism based on this post rather than saying it's a possibility? Because either way that is not an adequate source.\n\nThe information that someone who acted like that **might** be autistic is not going to prove useful if she encounters someone on the spectrum. If she meets someone acting like that she has no responsibility to \"help steer the conversation better\" *and even if she wanted to this \"information\" provides no advice on how to do that.*\n\nAnd if she meets someone who she knows is on the spectrum and is not acting exactly like that the thought that this man might have been isn't going to help.", "the guy i replied to does imply autism excuses being an asshole :)\n\nby smart i was leaning to aware enough, conscious enough but eh", "As an autistic person, I honestly want to be told when I am missing social cues, interrupting people, etc. I fallnall over myself apologizing when I realize I have been dominating a conversation, because I don't mean to. I just can't tell I am. Dude was told point blank several times and kept at it. He's just a garden variety asshole, OP, not you.", "Wow\na) you make the assumption I can't read social cues.\nb) you make the assumption people find me rude.\nc) you consider me not \"normal\" based on a diagnosis.\nd) you feel the need to interject into my conversation with someone else purely to insult me.\n\nAnd you have the gall to call me rude.\n\nGo take a good look at yourself.", "You stated it better than I did. Yes, I am nobody's property and I don't have to protect someone's fragile ego pretending to be one when I just don't want to go out with some guy.", "Yeah, there's a difference between \"Heard the no loud and clear, all good, do you have any tips for me?\" And \"but why, i'm amazing, you must have a good reason for turning me down, and if it's something i can change maybe you'll reconsider if i promise to work on it\"", "By that logic no one should ever work to improve their job interview skills. Dates are by and large interviews. You might be the most compatible people in the world but if you bottle those first dates then it won't matter because you will never be dating long enough to figure that out. Also I trust and respect my friends a hell of a lot more than I do you random stranger so I don't appreciate you calling their advice ridiculous.\n\nEdit: additionally just because someone doesn't find you compatible romantically does not mean they don't like you. I've gone on to become friends with many women who I initially dated at first.", "Funnily enough, what you have \"heard\" isn't the bar for what's common. You being an older millennial is not really important to that.", "Sometimes the two go hand in hand - guys have murdered women for hurting their feelings. You never know when refusing to coddle someone is going to cost you your life.", "I would never have compared dates to interviews, in my opinion interviews are an unpleasant task that has to be got through before I can get what I really want. \n I see dates as a pleasant social occasion where I enjoy someone's company enough in a romantic way that I want to spend time with them, not an obstacle to beat or a chore.  \n\nBut even if we do compare them, does alteration to suit someone that doesn't have any interest in the outcome always mean improvement? There's basics that everyone should have or work on like integrity, consideration of others, good hygiene etc, but as far as specifics go like \"you talk too much\" or \"you don't talk enough\", the feedback is gonna be completely subjective and really only counts as improvement to the ideas of the person giving the feedback. Also if you don't know these people well (the rejections or dates that went sour) how can you weigh their credibility as a judge of your behavior? Ideally if you really want to improve your behavior you'd be asking someone whose judgment you trust and who you actually want to please and who has an interest in the outcome, like a girlfriend or wife you want to keep, or even these friends of yours, why can't they tell you if some aspect of your behavior is deemed unpleasant to the female hive mind.", "If the effect is the same on the person being harmed, I don't see how it matters. I don't think you should say, \"Wait! What if you're being ableist? What if he's autistic, not deliberately abusive?\" to someone who is trying to escape an abusive situation. And I think that is a thing that is said to women all too often.\n\nWe are talking about a grown man who ruined OP's evening by talking over everyone and then not accepting her NO when he wanted a hug and a date from her. I have NO sympathy for him in this situation. Regardless of his reasons for it, his behavior was rude, entitled and abusive.\n\nHis autism might be the reason for the behavior, but it is not an excuse, and it is still his responsibility to fix it.", "I refuse to enable bad behavior. And i won't live in fear.", "I agree with your point, though while not as frequently, the shoe does land on the other foot. Murderers are just murderers. Male or female.\n\nJust saying, this may be less of a gendered issue and more of a personal boundaries issue.", "Being ableist does matter. Ruining someone’s evening by being an asshole is not equivalent to abuse. You you shouldn’t have to have sympathy for this guy to know being ableist is bad.", "I agree with you about nuance and intersectionality. But I think that too often, \"ableist\" is used as a slur to get people to put up with behavior that they shouldn't have to put up with. Especially women.\n\nIf he can't learn to control his behavior, he doesn't get to go on dates because women will perceive him as a boundary-stomping asshole who doesn't listen. That's not ableist. That's just how he comes across.", "NTA- you gave him a chance to correct his behavior when you went “my friend was talking” and he still disregarded it. It’s not your job to coddle strangers’ annoying characteristics. You told him exactly how he made you feel. You’re not “bitchy” for being real with him.", "NTA Unfortunately actions have consequences and this is how people learn. If no one calls out his behavior, he will continue to do it. You did him a favor and hopefully he reflects on it", "NTA, because he literally asked why not. If you don't want to know/can't handle the answer, don't ask. Simple.", "Women are often pressured to apologize or \"take the high road\" in social situations and behavior, don't let anyone tell you that you were the ah.", "The inability to read social cues is a characteristic of the autism spectrum isn't it?", "NTA, you weren't rude, you spoke firmly and honestly. That's enough of a clear No. And any man that's a creep doesn't need to be let down easy cause that's how creepy behaviors continue and put another woman in danger", "1) he can't take No 2) hes a creep 3) women are CONSTANTLY told by EVERYONE to tailor your emotions to not make annoying ass men upset when theyre being dickwads. NTA!!!!!! trust your gut", "NTA. He was trying to hard to be cool. By stomping all over everyone else and not listening. It’s an early teenage thing he just never green out of. It’s ok if he’s upset, he should be upset. At himself, for realizing how he was acting. Learning is an acquired skill and he needs to practice and work on it. \n\nThat being said him refusing to take a hint and stalking you on other accounts needs to be shut the hell down because he’s approaching harassment levels. Message him back, say you are completely uninterested in being friendly with him, and any additional attempts to contact you will be considered harassment and reported, then block him. He either gets the hint or you escalate this to authorities. Protect yourself.", "not fully TA, however this hits close and fits with my irl stuff going on.\n\nJust helped my sister with her thesis and she wrote about pragmatic behavior needs, basically having an issue with stuff like eye contact, knowing when it is your turn to speak etc. People who struggle with that genuinely do not realize that they are doing this, interrupting people etc.\n\nShe chose this bc both our little brother and I struggle with it, although I have it mostly under control a lot of the times now with the help I got.\n\nSo yeah, he genuinely didn't realize and probably never got the support to work on it", "Soft YTA. He sounds horrible. And he deserved to hear he behaved horribly. But if you can't deliver that news in a non judgmental way a white lie is probably better.", "It was unnecessary to be that rude. Also, why do people like this exist? What if he is autistic or something? You could have just said I have no interest in talking again. You definitely do not have to talk to men you don't like but that was taking it too far.", "NTA\n\nYOU DID THE RIGHT THING YOU ENGAGED A NEW PERSON WHO'S COMPANY YOU DID NOT ENJOY IN THE LEAST SO WHEN HE TRIED TO MAKE THIS MEETING INTO SOMETHING MORE YOU STOOD BY YOUR FEELINGS AND TOLD HIM AS SUCH I KNOW TOO MANY PEOPLE STUCK WITH A PERSON WHO AFTER THEIR FIRST MEETING FOUND THEY DID NOT LIKE THEM ON ANY LEVEL BUT DID NOT WANT TO COME OFF AS MEAN, AN ASSHOLE OR A BITCH SO THEY ALLOWED THEM TO BECOME ANNOYING BUT RECURRING ACQUAINTANCES WHICH THEY TOTALLY REGRETTED", "When people act a bit off socially I tend to assume its something they cant help eg adhd or aspergers and give them the benefit of doubt. Given what your friend had said you were perhaps a bit over the top (perhaps snappy? Tone of voice idk) when he was complimenting you by asking for your number. I think it was good you delivered the feedback to him however, so he can work on whatever his issues were if he is able to.", "NTA. I think you were doing him a favor by teaching him that it was inappropriate.", "As the guy who, when I was younger, would probably have been this bloke, you have done him a massive favour by being so direct. \n\nBeing polite and saying nothing to save my feelings (or to avoid conflict) let me run on far too long in a state of smug superiority and obliviousness, and robbed me of time to work on myself to be a better man. Not that they owed me that at all, but I really would have liked to have known earlier.\n\nOne response I don't agree with though, from your friend. Being kind and gracious isn't about pleasing other people. It's about being the best version of yourself and treating others as you would hope to be treated. Be the change you seek to see in the world.", "Nope", "You did the right thing", "NTA - he ASKED.", "NTA", "NTA. The fact you blocked him on Snapchat and he block evaded to message you on Instagram is so telling. Ew.", "NTA you should also distance yourself from that guy from your class", "Im so confused 'his friend is fucking awful'.\n\nSo HE went to hug me and I called HIM rude. Isnt it this guys friend you had an issue with? Im so unbelievably confused why youre treating this other guy like shit.", "Uhg…the description of this guys behavior reminds me so much of my teenage cousin. I’m terrified he is going to end up in situations like this over and over again because he is so socially awkward and it’s almost like he feels some compulsion to always be talking (even when it’s beyond obvious no one is listening or receiving him well), interrupting, one upping, exaggerating, and such…\nI don’t know how to tell my sister she needs to get him some help. She is very defensive of him.", "NTA.  Why should you be courteous to a rude ass person?  He made the mistake of asking. \n\nHe probably learns zero lessons from this but if he was capable of learning a lesson your comments are probably the only reason why.  He just imagines he is truly the most interesting man in the world.", "NTA. More men need the cold hard truth without sugar coating. I’ve only EVER seen this kind of oblivious, tone deaf behavior from men and I for one am beyond sick of it and sick of the social convention that tells women to just grin and bear it so we don’t hurt his precious feefees. Thanks for giving this dude a reality check that he’s not actually the most interesting and perfect and special little boy like his mommy told him he was\n\nI would love to say maybe he learned something but obviously the insta dm proves that once again these types aren’t teachable. Don’t listen to your friend, she’s used to accommodating this kind of ridiculous behavior and it’s scared her that you might have antagonized him. She’ll snap out of it eventually, you don’t owe him jack shit. In fact keep doing this to men that talk over you, you deserve to speak just as much as they do. If he tries again to talk to you loudly tell him to leave you alone and that if he tries to get near you again you’ll be informing campus police. No obviously doesn’t work on him", "NTA. \n\nPeople need to be told. \n\n\nEven if he is neurodivergent, he won’t learn unless someone tells him, and unfortunately you were the one who had to do it.", "Nobody likes being criticized but OP could be doing him a favor. Somebody saying “you are being rude when you did XYZ and it made me like you less” might really benefit him if he able to actually consider the criticism.", "I don't understand a word from this comment. You don't interrupt people because of ADHD. You interrupt because you weren't educated properly.", "Well done for all of your hard work! I don’t have ADHD, but I’ve struggled with social cues my whole life. It takes so much work to appear ‘normal’, and I applaud you for your efforts.", "You were asked, you responded kindly, but truthfully, and it was feedback he quite clearly needed to hear. If you hadn't someone else would have said it more rudely and less helpfully. (It's me. I would have done that.)", "I am going to offer really crappy advice. I wonder if he is one of those people that as his personality developed the people in his life just learned to ignore his more annoying traits rather than waste any further energy trying to correct his behavior. That would be the better of the two options because as long as you can avoid or minimize any and all social contact with him. Because the second option is if he becomes fixated on developing a relationship with you (romantic, platonic, academic peers, or professional colleagues) that can turn dangerous or downright fatal. If it is leaning towards this option do everything you can to avoid ALL DIRECT COMMUNICATION OR SOCIAL INTERACTIONS. But make sure you keep in contact with someone that is connected to him or have a friend do it on your behalf.  For your own peace of mind and safety it would be very helpful to keep tabs on him from afar -- that way someone can track and/or verify any changes in  his behavior or attitude that would be a cause for concern or a threat to your safety & well being. Document everything and keep a record of all of his repeated attempts to become a part of your life. ALWAYS TRUST your instincts over following social decorum EVERY SINGLE TIME . Stay safe out in these streets sis", "Or go full British vengeance mode: give him dirty looks and make sarcastic comments!", "And he's still not taking no for an answer - she's blocked him on one social and he's dm'ing her on another. He's a creep, it's official. And OP is NTA.", "Start saying, “Only if my husband joins us,” and watch them backpedal because “ew no that’s Gay™️”", "I used to wear a fake engagement ring when I went out dancing. One time I flashed it at a guy like usual when he was getting too handsy and he leaned in and said \"well, that looks like an engagement ring but it's not a wedding ring.\" Just wtf lol.", "i swear its like talking to a child! \"No\" \"buuut whhhhyyyyy\". the men who do that are jusy overgrown children 🤢", "No matter what reason you give, they will try to talk you out of it. \"Because I don't like you\" should be enough but even that doesn't work and you get the \"Why?\" They think that 'no' is just the beginning of a negotiation and they can talk you into it. I don't care what they say, I can't be talked into liking them. The problem is, when the tables are turned, they are rude and mean to a woman they don't like who likes them and act like they are pathetic. The double standard was handed to them at birth and it's difficult to ever get them to see things from your perspective. \n\nNTA but don't bother to explain again. It always gets twisted into you being the bad guy for not giving them a chance and forces you to argue with them as to why you have the right to say no for any reason. They think the act of asking you out means you can't say no and they won't accept it.", "r/WhenWomenRefuse", "He should also understand that no means no.", "What did Margaret Atwood once say, that men are afraid women will laugh at them, and women are afraid that men will kill them? Yeah. And so little incels were created.\n\nI remember when a boss once asked me out, and I refused because I had an actual boyfriend. He said, \"That's OK, we'll keep it on the down low.\" I replied (shocked), \"I would never do that - I love him!\" That actually shamed him (and fortunately he was fired soon afterward). I'm not ashamed to say I used that same response when I no longer had a boyfriend - anything to get rid of a clueless jerk quickly (and I never GAF about their \"feelings\"). BTW, you're definitely NTA.", "r/WhenWomenRefuse", "There have been multiple mass shootings by men who feel so entitled to women that their brain breaks. There are thousands and thousands more individual murders and assaults because of this. Come on."]}