{"id": 2879, "submission_id": "z14wok", "title": "AITA for not wanting to get rid off my office so my boyfriend’s kid can have his own room?", "selftext": "I {f33} met my boyfriend Ash {m39} 7 months ago. 4 months ago, he lost his job and couldn’t afford his rent. We were only seeing each other for 3 months so we’ve never discussed moving in together. I was surprised when he asked me to move in. He promised it’ll be for a month, two tops and then he’ll find someplace else.\n\nIt’s been okay living with him and he’s stayed until now as he’s still looking for a job.\n\nI inherited a house after my grandparents which I own on my own. It’s got a ground floor with sitting room, kitchen, bathroom, drawing room (it’s not an actual room, it’s more like patio with windows around it).\nUpstairs, there’s a master bedroom and a bathroom. It used to have 2 other bedrooms but I run a small business for a living  (think Etsy and stuff) and I have been very successful for the passed 5 years so I remodelled those 2 bedrooms into a huge office which I need for work. \n\nI wasn’t made aware of this before he moved in but he has a 12 year old son that he sees once a month. I haven’t met him yet but Ash wants it to happen soon. \n\nAsh started hinting that we should do some changes and paint and change the office into two bedrooms like it used to be (he saw photos) so I can use one as an office and one for his son.\n\nMy first reaction was “absolutely not!” I explained that I need my office the way it is and can’t downsize it, especially now, during Christmas rush. He pushed and I clarified that I am not going to make a bedroom for a child I haven’t even met yet and he only sees once a month.\n\nHe started crying and called me a selfish bitch. He started saying that I didn’t care if he has a bond with his son and he couldn’t believe that I didn’t want to meet him.\n\nTo make matters worse, he keeps pushing me to do it, sending me photos of boy’s rooms, making a wishlist for amazon and every time we meet my or his friends, he tells everyone that I don’t want his child have his own bedroom and I may turn into an evil stepmother.\n\nI keep having to do damage control but some people believe him and think I’m a bitch. And my head is a mess, I’m starting to think I may be selfish here considering the boy lives with his mother and siblings and he shares his room with 4 other kids.\n\nam I the asshole for not wanting to convert my office into my boyfriends son bedroom?", "created_utc": 1669052344, "permalink": "/r/AmItheAsshole/comments/z14wok/aita_for_not_wanting_to_get_rid_off_my_office_so/", "score": 1178, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be an asshole because I don’t want to change my office into my boyfriends son bedroom\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "* He lost his job and couldn’t afford his rent. We were only seeing each other for 3 months so we’ve never discussed moving in together. I was surprised when he asked me to move in. \n* I wasn’t made aware of this before he moved in but he has a 12 year old son that he sees once a month. I haven’t met him yet but Ash wants it to happen soon.\n* Ash started hinting that we should do some changes and paint and change the office into two bedrooms like it used to be\n* He started crying and called me a selfish bitch.\n* he tells everyone that I don’t want his child have his own bedroom and I may turn into an evil stepmother.\n\nWhy are you with this person, he is a jobless mooch who lies to you and tires to control your belongings and possessions while using up your kindness and generosity. Kick this fucker to the curb ASAP.\n\nNTA.", "NTA. \n\nLook, time to open your eyes here. You met this guy 7 months ago. 3 months after meeting, he moves in \"for a month or two tops.\" Now it's been 4 months and not only is he not leaving, he's not working and he wants you to change your house around to accommodate a kid who is there once a month whom you've never met.\n\nIf you can't see the laundry list of red flags here, I don't know what to tell you. Get an eviction notice in writing so you are legally covered and serve it to him. He's gotta go. It only gets worse from here.", "NTA \n\nThis guy has zero intention of moving out or looking for another place to go.\n\nHe also didn’t tell you he had a kid until he moved in 🤨\n\nAnd expects you to give up your work space for a child he only sees once a month.\n\nThen he tried to manipulate you by crying and when that didn’t work he went straight to name calling.\n\nHe won’t respect that you’ve said no and keeps pushing.\n\nHon, I don’t know how many red flags you need before you dump this guy but you’ve gotta be getting close right?", "NTA- girl you are being played. He is NEVER going to leave. He’s pushing boundaries and trying to take over your home. I don’t often suggest chucking him but here I think it’s the best. Calling you names just proves he’s too immature for an adult relationship.", "Honey, you need to get this guy out of your house and your life.\n\nJobless, liar, only sees his kid once a month, emotionnaly abusive... \n\nNTA. Protection yourself from this asshole.", "NTA, it's your house. I am, however, wondering why you're with him. he called you a selfish bitch when you wouldn't alter a home *and* business space you own to accommodate a kid he barely sees when he doesn't even formally live with you and it was supposed to be temporary.  You've only been dating for a few months, this sounds like way more trouble than an unemployed mooch could possibly be worth.", "So your unemployed boyfriend wants you to give up the space you need for your business so that you can pay bills while he pays none? This dude sounds like a trainwreck. Next thing you know you'll be paying his child support for him. NTA", "NTA\n\nKICK HIM OUT! HE IS USING YOU FOR HOUSING!!!!!!!!\n\nC’mon girl!!!  You’re better than this!!!!!!", "NTA\n\nPutting aside all the other red flags related to him being a scrub, he **didn't tell you he had a child until after he moved in with you**.", "NTA you’ve only been dating 7 months and he is already making demands, the fact he called you a selfish bitch is terrible and that alone should make you re evaluate things. I hope things go well OP but he seems like a bit of a nightmare already", "NTA unless you allow him to keep staying there and leeching off you..he had audacity to call you selfish b, while he's living in your home for free..cmon..go peruse this sub and you will see how bad it gets when you let an unemployed friend, family member or SO live with you", "Why is he even still in your house? You agreed initially that he was going to stay a couple of months at the most. He'd already failed to follow through on one agreement. How do you know he isn't planning to move his kid in and have him there more than once a month? Why would you remodel and sacrifice your workspace for a child who's only there once a month. This guy has been dishonest with you at every turn: he didn't tell you about the kid at the start of the relationship, he's overstayed at your house and he still hasn't managed to find a job in that time. NTA. You aren't responsible for a child that you haven't ever even met. Imo it would be a good idea to get rid of this manipulative dad as well. He's taking advantage of you.", "NTA.  BF needs to move out.  Yesterday.  He's getting very comfortable with your house.  How long does the child even stay?  A couple of days?  Fix up an air mattress in one of the downstairs spaces and call it a day.   But, truly,  get the BF out of your house while you can.", "NTA. For someone who is basically homeless and relying on your goodwill, this bloke seems awfully entitled. Even on a strictly utilitarian level, even if you knew and loved this kid, setting aside a room for him to use once a month would be inane.\n\nHow much to bet he wants the kid to move in full time?", "Guy finds girl who is financially independent home owner. Guy 'loses' job and moves in after only three months for 'a month or two'. Guy remembers that he has a son and expects girl to remodel house to accommodate son who only visits once a month, for this 'month or two' situation. Girl would be NTA for kicking guy out on his ass, STAT.", "Congratulations, you have found a hobosexual. A person who goes from relationship to relationship so they have a place to sleep. He's already far too comfortable in *your* home making demands on *your* income for *his* benefit. Kick him to the curb and block him. NTA", "NTA. Dude's asking this when this move was supposed to be temporary. nope nope nope. I don't trust this guy.", "NTA. This man started dating you and within months wanted to move there \"for just a month or two\". Now you find out about a son that needs a room at your place. How long has he been staying with you? You need to get him out ASAP. That man is going to get himself some squatters rights or try to baby trap you, you need him out like yesterday!", "NTA. Please break up with him. Now before he gets in any deeper. He is using you. It was supposed to be a month. You can meet his kid when bf takes you both to a restaurant to meet. Get this leech out of your house! Or one day you may just come home to a surprise redecorated office!", "NTA, this man is manipulating you like hell. Get out.", "NTA and you need to kick this guy out ASAP. If he's only going to live there for 2 months and sees kid (you didn't know about?) once a month - he wants you to spend $$ to reno for maybe two visits? NAH NAH NAH - he has other plans", "You need to check the laws where you live and figure out how to get him out of your house ASAP. And make sure you stand firm that NO changes are being made to YOUR HOME. If it is such an issue then he needs to hurry up and get a job so he can figure it out himself. Since it is HIS responsibility.\n\nETA NTA", "Yikes get out now - NTA \n\nHasn’t been working for months and is crashing at your place (I guess that’s the least serious offence if he is seriously looking for a job) \n\nDidn’t tell you about the kid from the start \n\nIs expecting you to remodel your house when you’ve been dating for less than one year and you haven’t met the kid\n\nIs emotionally blackmailing you and calling you names \n\nEtc\n\nIs this post even real? What are you doing ?", "DUMP THIS MAN", "NTA and your bf is being extremely manipulative to the point where you should be asking it this relationship is a good fit.", "NTA - Kick this guy to the curb. He is acting like an entitled child. You never should have let him move in with you in the first place. He is using you and has been from the start. You are not responsible for housing a deadbeat you barely know.", "Nta. Kick him out. Why would someone you barely know who doesn't even have a job have a say at all? He's behaving like a lazy, unemployed, self-important liar.", "NTA...is showing you who is. Believe him. He's a taker. In this economy he should have been able to get a job. The fact that he moved in without telling you he had a son and then DEMANDING that you rearrange your house for a kid that will be there 1x a month. Then when he doesn't get his way he yells, pouts and calls you names. Please kick him out", "NTA. It's your house and you pay the bills, so you can decide how you want it modeled, especially since your actually use the rooms for your personal business. I do feel bad for the kid, but it's really not your fault he's in the situation he's in, and there are some big red flags coming from your boyfriend that you should probably assess for yourself.", "NTA- You need to kick this entitled mooch out. You let him move in after 3 months of dating when he lost his job. Now months later and still no job but a surprise son you never knew about. He's trying to dictate what you do with your office that is important to your business and using friends to make you feel guilty for saying no. This sounds pretty planned out to me but that might just be me.", "NTA\nYou haven’t been dating this guy long and he wasn’t forthcoming with big news (having a child). Plus he is unemployed and living off of you (unless he is paying you with his savings?). Now he wants to change up your home for his benefit and is trying to make your friends turn against you.\n\nPlease rethink this relationship and end things cuz he doesn’t seem worth it.", "NTA and you need to dump this guy. He weasels his way into your house after three months of dating and FOUR MONTHS LATER still hasn't found a job so he can contribute. And now he wants to take over your office and is calling you names when you won't go along with it?!\n\nDude - please - serve this man eviction papers and move on with your life.", "NTA. Show him the door.", "NTA this guy is just trying to up end your life after afew months of dating. You honestly havent invested enough time in this relationship where you should cut it off get him out of the house before it gets harder.", "NTA\n\nWhat does he bring to the table for you? \n\nHe sounds like an unemployed freeloader to me. Is he helping you pay bills? Is he helping out around the house? \n\n4 Months is more than enough time to get a job. \n\nThe fact that he called you a selfish bitch speaks volume. I wouldn’t take that and if I were you I would rethink this “relationship”", "NTA but you need to evict him. He pushed you to move in.", "NTA.\n\nYou mean EX-boyfriend?", "NTA. Dump him. He can't be that close to his son if you were together for months and never knew about him. I feel like it would be different if you had a room that you used for eg. Storage and refused to turn that into a bedroom, but you run a business from home.", "NTA OP, \n\nYour \"BF\" needs to get himself a new job and get his own place. Give him 30 days notice to move out. If he hasn't got a job then, he still needs to find somehwere else to live. Because asking you to change YOUR Home and Business to suit him is 100% ridiculous. \n\nAlso, for what it's worth. I don't think you  have a BF, I think you have a mooching worm pretending to be a BF. He is clearly not your \"friend\" or he wouldn't be asking for you to do this. I'm guessing he has a long history of not being able to keep jobs. You are financially independent, hard working and own a home (even if you inheited it.) So he sees you as his meal ticket. At this point, he's not capable of being a partner. \n\nAlso, If he's not working, how is he paying his child support?", "NTA he is literally trying to manipulate you in front of others by prefacing you as an evil stepmother....this probably won't change with time at least he showed you his true colors so early on", "Girllll please respect yourself. Do not stay in this relationship one minute longer. Your boyfriend is using you and absolutely stomping your boundaries. The fact that you even typed this thinking you were in any way shape or form an asshole (NTA, by the way) just goes to show that he is already succeeding in making you doubt yourself / messing with your mind. \n\nKick him to the curb.", "NTA- but you should really kick this man out!!! All he’s bringing to this relationship is THE AUDACITY", "NTA but Omg. So. Many. Red. Flags. Kick him out now before me tries to manipulate you in to putting the house in his name. Wow.", "[removed]", "Hahaha \n\nYour boyfriend is never moving out and he’s never paying rent. If you make a bedroom for his kid, consider yourself the proud mommy to two teenagers! (NTA)", "NTA. You realize how ridiculous this is, right? He’s using you for a place to live. There is no reason he doesn’t have a job right now, even if it is part time in fast food.", "NTA.  Remind him he's supposed to be moving in for 1 month, 2 max.", "NTA. I feel like you're being used and are blind to it. \n\nHe sees his kid once a month. The kid doesn't need a dedicated bedroom. It would be nice if you have a guest room but you don't so you make do however. In your case I would ask the boyfriend when he plans to get his own place since you will not be changing your house to suit his needs", "Red flags, my friend. NTA", "NTA. He is the ass. Tell him he can have a bedroom for his son in is own House, you make and arrangement that he living with you was only temporality. He is living with you more that you agred. \nIf he want a room for his son, he can find a job asap and ha place for himself. \nThis is your House and you are make him a favor. \nHe as no right to ask for that if he realy is tinking to move out. \nRED FLAG here. You have a problem in your House right now.", "NTA But it's time to get tur BF to move out", "NTA who's pocket book is paying for this remodel?\nSounds like bf needs to stay in a hotel while his son visits and then slowly introduce the two of you. It's crazy to think the kid is going ti stay the night in a home of someone he doesn't know.", "This hombre has no plans on moving out. Why would he need a room painted and furnished for his son when he is only planning on being there for a month or two?\n\n>He started crying and called me a selfish bitch.\n\nAw helllll no. That would be the end of the relationship if I were you.", "NTA.\n\nSo, a homeless, jobless, lying, mooch who lives off your generosity calls you a selfish bitch *to your face*, and he still lives with you? He doesn't even like you!\n\nSeriously? \n\nThis guy is either breathtakingly stupid or thinks he's got the completely under his thumb and is teaching you what to expect next time you're disobedient. Which is it?", "NTA, but dear lord, why do you still let him live with you, not mentioning still dating him?\n\nYou took his unemployed homeless ass in and as a thank you he is badmouthing you to your friends? Are you insane? Why do you let this happen to you?", "NTA my god this man found himself a really sweet deal, huh? I hate all of this for you. I’m a bonus mom and it’s my world’s greatest joy. This man is looking for a new mom for himself and his kid. Because he’s the kind of man who makes his partner his mommy. I’d get out now.", "Nta three months is too soon to start living together imo, and he invited himself and now doing the same with his kid, you are not reaponsible for his child needs, and how someone who is jobless is planning redo a boy's room? When he say \"we\" means you be the one paying for it. He is public pressuring you into doing this. Try telling a friend at the time your reasons for needing your space and if people take his side good riddance on them.", "Nta.  You need the space for work and you dont need a room if he comes over once a month.  The kid can sleep on a couch.  Also, he has no right to make demands and you should probably reevaluate your relationship.  He sounds like a deadbeat to me", "NTA\nGet the dude out of your house NOW!", "NTA- sounds like your boyfriend is manipulating you… big red flags asking to move in with you after briefly dating, bigger red flag not mentioning he had a kid till he moved in AND huge red flag demanding you renovate. Ask him to leave ASAP", "Tell your boyfriend that his son can have his own room in his new place.  NTA", "NTA\n\nSo many red flags.\n\nHe says he’ll only stay for a max 2 months but now you’re at 4 months.\n\nYou weren’t even aware he has a son until after he moved in.  \n\nAnd now he’s trying to run how your house is and using social pressure as a means to make you cave.\n\nFor a temporary guest it sounds like he overstayed his welcome.  The house is yours and you were only trying to help him get back on his feet.  You shouldn’t have to feel bad that you don’t want to provide for his child that you never met or even knew existed.\n\nYour boyfriend sounds extremely manipulative.  Do yourself a favor and kick him out of your house and life.", "NTA - it is easy to get a job this time of year, and you haven't met the kid yet! Try a blow-up mattress or a rollout for the once-a-month. But if he thinks you are unreasonable, maybe you need to rethink this relationship or have a \"Come to Jesus\" Meeting with expectations, wants, desires and come to understandings or move on.", "NTA. It's your house. You shouldn't feel any need to rearrange for a child that he sees once a month.", "NTA\n\nHe won’t put any effort into his own relationship with his son and wants to dump the financial burden on you. \n\nHe called you that?!? Oh no! Tell him to GTFO. You are supporting his ass and he calls you selfish and a slur.", "NTA, but you really need to ditch this guy. Whatever good qualities he has surely can't be outweighed but what I've read here.", "NTA figure out your local laws. This is very manipulative and not health of him.", "He started  crying??? WTH\n\nyou should  convert your house to a solitary  inhabitant....you\n\nTime for him to go", "Omg NTA!!! \n\nOp you do realise he's taking advantage of you, manipulating you, gaslighting you & tarnishing your reputation at the same time? \n\nHe's not looking for a partner... He's looking for a roommate who'll pay for his everything & sleep with him & expect the bare minimum from him. Him moving in with you & expecting you to renovate your house to accommodate the son he sees once a month says that he's not there to stay for the time being. Kick his ass to the curb & move on. \n\nHe's a parasite in your life!!!", "NTA\n\nThis is called a hobosexual. He can fake a relationship to keep a roof over his head. Evict him ASAP.", "Yes he’s looking for a mommie he needs to move out it’s time for him to put on his big boy panties and figure out his own life", "N T A, but you will be if you don't kick his ass out.", "NTA but this guy is nuts. There’s a lot to unpack. I mean…he didn’t even tell you about this child but now expects his very recent gf to rebuild her house around this kid? Was planning on moving out, but now isn’t…and is that quick to anger? He sounds crazy…and I would at the very least get him out of the house and into his own place. This is not your responsibility…and this dude just sounds unbalanced…", "NTA-\nYou need to kick him out, NOW!\nHes trouble with a capitol T.", "NTA Why does his child need a room in your house if your bf plans to move out as soon as he's got a job? Isn't he already staying longer than you agreed?\n\nHe's moved himself in with no intention of leaving! Or getting a job! So he expects you to pay for him. \n\nThis sounds like he's slowly getting you used to being his provider. You need to wake up! \n\nNext time he brings it up say: “ I'm a bit confused. Why would your son need a room in my house? He's going to visit you at your place as soon as you found work, right? We agreed this was temporary. Btw, how's the job hunt going. It's been four months now.”\n\nI bet he's going to play victim right away and will get defense and accuse you of being selfish for not dragging this freeloader through life.", "Nta.  Sorry to say but so very dumb to let him move in only after 3 months.  You didn't even know he had a son.  Now he feels entitled to have a say what to do w your own house. Please kick him out before you are trapped in a situation you can't get out of and meet someone that respects you.", "NTA. Leave him. 7 months and and this level of manipulation? He's only supposed to be staying for a month or two until he finds another place, so why should you be making permanent accommodations for his child?", "NTA\nHe needs to leave before he gets some kind of rights.", "NTA.  he is using you.  He has had plenty of time to find a job. Any job.  He does not intend to go back to work, he wants you to take care of him.  He now wants to convert YOUR house to suit him.. he has no intention of finding his own place.  He also lied by omittion that he even had a child in the first place, and I'd be wondering why he only can see him once a month.  Get him out, change the locks, and don't look back.", "...this is YOUR house.... why does he want to make changes to YOUR house....?  \n\n\nNTA.", "NTA. Kick him to the curb and change the locks.", "NTA. Ask him how HE plans on paying for the remodel as well as the rent for a new offsite office space. Or if he’s going to give you the $$ you would be missing out on every month.", "NTA. I know I don't know you or him. But seriously get out of this relationship. If this is how he is after not even a year, I don't want to imagine how he will be in the future.", "NTA he using you", "NTA\n\nRun!", "NTA, and RUN. He’s obviously looking for a woman to help him raise his kid so he doesn’t have to do as much.", "NTA. He sees this kid once a month, and he wants to blame you for his poor bond? \nI hate how reddit is full of people always telling people to break up over the most trivial matter, but he's called you a selfish bitch, won't respect your needs for your business, and refuses to respect your decision to put your business over what is basically a token gesture to his son, from him, at your expense.\n\nAlso, he promised he'd be there for a month, two tops, but four months later, he's still there scrounging off you and now planning to halve the operating space for your business, which has been supporting his lack of employment for the past four months now.\n\nAt the very least, you guys need to have a conversation and get on the same page.", "God no, NTA\n\nHe said he’d only be there for a month. Looks like he’s overstayed his welcome", "NTA. You can free up even more space in your home by telling Ash to move out. 🚩🚩", "He is  a hobosexual using you for your house. What does he bring to the table? Dump him", "NTA. It's your house, not his. When you purchase a house TOGETHER, or he CONTRIBUTES to your household, then he can warrant having a say. All the while he is freeloading off your good nature, no way.\n\nWhy are you still with him?? Lots of red flags here.", "NTA. Kick him out immediately and never look back. It only goes downhill from here.", "You need to send the boyfriend to his own apartment. He is manipulating you.", "NTA. Break up and kick him\nOut", "NTA - but you need to throw him out. It sounds like he's taking advantage of you.", "NTA and get this man out of your life ASAP.", "NTA \n\nI'd be alarmed with how much he's pushing you and calling you names for refusing something you're not confortable with in your own house.\n\nTine to rethink this relationship cause your bf's behavior is 🚩🚩🚩", "Nta. Dump him before its too late. He's planning on living at your house as a freeloader. Is this really the type of guy you wanna date and spend the rest of your life with ?", "Nta. This isn’t a permanent living arrangement. You were nice enough to take in a guy you had been dating for a very short period of time, and now he wants you to remodel your home for him? And he has the nerve to call you selfish? My lord! If he wants his son to have a room so bad, he needs to get a job and a place of his own. Get rid of him asap.", "NTA. Get rid of the entire man before you end up supporting him and his son. And the crying??!!?  Please how manipulative is he?", "RUN !! And do NOT 🚫🚫 look back. He's a waste of your time, energy and money. I know you can do better than this. Don't do this to yourself girl", "OP.  This is serious red flag territory. Time to wake up and smell the coffee. You've been seeing this person for 7 months and only now you find out he has a child. I had only been seeing my partner for less than a week before we spoke about our respective kids. Next he says he will only be staying a month or two and then he's asking you to remodel YOUR house to accomidate for his kid. Your post should have read. \"AITA for wanting to kick out my feeloading BF who wants to take everything from me\" And the answer is. Definitely not the AH. I'd seriously consider where your relationship with this person is going, because from what I've read, it's nowhere good.", "NTA. I would throw out anyone that called me a bitch for standing up  for myself in my own home. He found a way to move in and is planning on staying.", "NTA, Op why are you with a man who is using you? you've been generous enough to give him a roof over your head and he still \"demands\" he didn't ask did he demand a room for a child? I am a man and I say that an independent and successful woman like you deserves so much more, I would dump him the moment he called you a bitch being under his roof, and he will not change, he will be a parasite in your life yours lucky that the signs appeared early on. (Sorry for any typos)", "Girl, run. Take all his stuff and put it on the curb. Dude lied so hard, he said it was a temporary move for a month or two and now he wants to convert your office to a room for his son. Hell no, throw the whole man out.\n\nNTA.", "NTA. DTMFA. You were dating seven months and he never mentioned he had a KID?", "NTA, I see red flags!", "NTA - but you need to have someone that invited himself to move into your needs to remove himself from your home.\nThe longer he stays the harder to remove him and the more rights he has.", "NTA\n\nHe is starting to treat your home as if it his. I think at this point your post is so filled with glaring red flags, that there's no salvaging this relationship. He is manipulating you and your friends to get his way in your home he has no claim to. I'd give him eviction notice and let him know as it is, living together is not working for you.", "NTA\nYou are not even sure of this relationship  \nHe needs to move out yesterday! If he brings it up tell him he should find another place to live. Say: I get how important he is to you and maybe it us time you find a better place for you to live that will work for the both of you since this isn't it. Also explain you have no intentions of sharing finances since he sounds like a leech!", "Kick this guy out", "NTA Is he crazy he said he would stay a month and find a job. It looks like he moved in and want you to take care of him and his child. He found someone he could Leech off of. Three months you weren’t supposed to let him move in you guys are still getting to know one another. Now you know how he is when he can’t get his way. Do not change anything ask him when can he move out. He is showing his true colors and he still hasn’t found a job. You would have to do everything", "NTA You need to be more assertive. He's only supposed to be staying with you temporarily and given that, it would be crazy to change your house for him and a child you've never met. The fact the he is being such a prick about it as well as trashing you to others would have me questioning the living situation and maybe the relationship itself.", "NTA and he needs to find a job asap and move out, sounds like it's over for you two.", "NTA but please love LEAVE HIM NOW", "Eviction ASAP! NTA", "NTA But you need to breakup with the one trying to take advantage of you & his flying monkeys", "NTA. But OP, wake up and smell the play here. Moves in, no job, no job in sight and wants to remodel your house for his once a month visit son.", "NTA. Kick this man out of your life now.", "So let's break this down:\n\n1. He lost his job\n2. He asked to move in with you after only seeing you for 3 months\n3. He hasn't gotten another job since then 4 months later\n4. He wants to move his 12 year old in (who he doesn't see more than once a month meaning he is basically an absent parent\n5. He called you a bitch when you refused to convert your revenue-generating office into a room that will be used only once a month by a 12 year old\n\nDid I miss anything? If a girlfriend of yours went to you and asked you what she should do in this situation, what would you tell her? Why haven't you kicked him out? He is mooching off of you and you are enabling him to do so, and now he is insulting you? Does he contribute to housework? Is there any part of this relationship that is actually worth this future?", "YTA to yourself if you don't make a stand on this. You offered 1 month, he has taken 4 so far. Instead of getting a job like he promised, he's asking you to actually harm your ability to do yours. Have some fucking self respect and serve eviction papers ASAP. You may also want to get photos of the current state of things in case he throws a fit and does damage on the way out.", "NTA and tell him it’s past time for him to move out. He is waaay too comfortable taking liberties with your home.", "Have you not noticed the *red flags* he's planted all over YOUR HOUSE since he moved in for that so called \"one month\"? \nYNTA\nHe is though and a heavy duty user. \nThis one needs to go and quickly. He's not respecting YOU at all.", "NTA. Run 🏃‍♀️ this man is a walking 🚩 ! Maybe if he took the time he’s spent on amazing windows shopping on applying for jobs & networking he could have his *own* place with a room for his son. \n\nToo heavy for 3 months dating. Seems like a mooch.", "Please kick him out, you barely know this man and he’s already moved and trying to take over your home. Check your state tenant laws but I’d start working on getting him out asap. He lied to you about his intent and he never told you that he has a son, what else is he hiding??", "NTA for reasons previously stated.", "NTA.  He needs to move out ASAP.", "NTA, NTA! Boot this dude out ASAP! Only a couple of months, he takes advantage of you to move in, then springs a son on you, wanting you to change your house around for the kid he sees once a month? You being nice to him in no way entitles him to impose on you further. Watch out, because there's probably more demands on the way. Get him out now, before he becomes entrenched (if not already). Document your temporary living agreement, and tell him he's broken it already.", "No no no no no no. Drop him like he’s hot honey. This guy is a user and you are looking like a sugar mommy to him. You’ve only known this guy for 7 months and he wants to take over your life and rearrange it to his specifications. It’s a hard pass. Tell him to get out. NTA", "NTA\n\nThe moment he called you a selfish bitch, he showed his true colours. He needs to move out.", "NTA. Tell him he can remodel whichever room he wants, in his own place. This was only supposed to temporary and he should be more focused on getting a job and place. Not wishlists of what he wants to do to YOUR place. \n\nWho was supposed to pay for the remodel anyway? And how is he going pay for a new office space and possible loss of income while that happens? \n\nThose that don't contribute, don't get a say.\n\nAt least he's shown you who he is though.", "Jesus Christ. He demanded you make permanent changes to your home that would impact your livelihood and he called you names? Name calling is completely unacceptable as is his entitlement to\nyour home. And he’s bad mouthing you -\nTrying to use social embarrassment and guilt to get his way. Very manipulative. Dump him now before he gets it in his head to demand squatters rights or some shit \nNTA.", "So you're selfish for letting him live there.  It's always suspicious when the bf or gf loses a job and has to move in, and then never seems to be able to get another one.  Meanwhile the other partner is paying all the bills.\n\nAsk yourself what is so great about him that you are willing to foot the Bill's?  And what chores does he do?  Heck do a pro and con chart and I bet there are very few pros in the relationship.  NTA but think about evicting the deadbeat.", "No, this was only supposed to be temporary, so he has no right to expect you to create a room for his son who you haven’t met yet.\n\nI get he wants to see his son and build a bound with him, however, this is not only way to do, spending time with his son, listening and engaging about his interest can do it just as well.\n\nGiven he has no job who is paying to make this changes, likely you. \n\nThis is your home and it’s your choice who lives there and what changes you make. Your business is how you earn a living and as such, that work space is essential for you.\n\nI think you need to make a decision about this relationship where it is, what you both give to it and where you want it go.\n\nIf/when your partner gets a job, do you want him to still live with or do you hope he will get his own place?\n\nYou are NTA, for refusing to create a room for his son as this situation was meant to be temporary and you are not responsible for his son, yes he is a child but there are others ways for him to maintain his connection without you providing dedicated bedroom.", "NTA You need to end this relationship now. He’s calling you vile names because you won’t bow to his demands and that’s alarming. He’s using you. You allowed him to move in, he still doesn’t have a job and now he’s demanding you change your house for a son you were not even aware of. Get him out of your house now.", "NTA.  Find out what eviction laws are where you live and begin the process to get him out of your home.  And then break up with him.", "Nta he needs to go that YOUR house and thats your livelihood. He needs leave asap!", "NTA -- Ash is colored in red. Move in for 1 m tops (did not happen), unemployed (flag 2), never mentioned the 12 yr old (surprise 3rd), lets change the room and you said no--4th flag-shocker--he does not respect you. He talks shit about you to his 'friends' (5th)...He is literally bulldozing your life.  Stop the madness and set boundaries. Let's start with: He rents a hotel room and spends time with his son. He secures and attends a job in 1 week. Etc, etc. Best to you", "NTA, time for your deadbeat dad boyfriend to be an ex.", "NTA, remind him he was supposed to move out months ago. It’s ridiculous to remodel a useful space for someone who MIGHT spend 2 days a month there.  It’s time to reassess this relationship.  Ash sounds like a manipulative user that really does t bring much to the table.", "Why is he still your boyfriend and why is he still living in your house? NTA - his living arrangements are meant to be temporary.", "NTA, you need to get this guy out of your house.  And your life.", "NTA, why would you remodel your house for the kid that only spends 1 (weekend) a month with a person who was only supposed to live with you for a month. \n\nAlso, look into common law marriage laws where you are. Make sure he doesn't get to claim marriage when you kick him out and he demands half of your house.", "NTA but this isn't sounding so temporary to me, why would you renovate when he is moving out in a few months. My opinion is you made a huge mistake by letting him move in with you. It's way too soon, you don't even really know this man, he hid the fact that he has a child and us now living off you and is already taking advantage of you. If it was me I would be giving him 1 months notice to find a new living situation and I would be re thinking the while relationship. So many red flags", "NTA - Obviously!  These are HUGE asks for a very new relationship. Please don’t let yourself be gaslit by this guy - HE is TA", "NTA. If his son is such a priority to him, why hasn’t he worked harder to find a job and his own place to live. He clearly thinks he can take credit for what you provide. That way he can tell everyone what a hero he is for ‘providing’ for his family.", "NTA\n\nSo your unemployed homeless boyfriend is pressuring to spend YOUR money renovating YOUR house on HIS kid he only sees once a month.  He’s a deadbeat dad, and expects you to fund everything for him. \n\nI don’t get it?  Is the man like Johnny Sins in the sack or something?  I fail to see the attraction to a continuing relationship with this man.", "It’s time for him to move out. You are NTA. This guy is using you.", "NTA. You need him to move asap and reconsider this relationship. He told you he would only move in for two months tops but now hes got his feet under the table hes badgering you to remodel your house just for him??? He called you a bitch, hes bad mouthing you to friends and calling you an evil stepmother after only a few months together??? Nope nope nope. You need to make a break with this.", "NTA and you need to lose this mooch bf. No job and he calls you names? He can gtfo of your house today.", "Sounds like you found yourself a hobosexual. Id look at any local laws for how long someone can stay before youd have to end up evicting them… you know just in case you dont want to continue here. NTA", "I'm just not believing these stories today.", "NTA, but why are your standards for men so low?", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI {f33} met my boyfriend Ash {m39} 7 months ago. 4 months ago, he lost his job and couldn’t afford his rent. We were only seeing each other for 3 months so we’ve never discussed moving in together. I was surprised when he asked me to move in. He promised it’ll be for a month, two tops and then he’ll find someplace else.\n\nIt’s been okay living with him and he’s stayed until now as he’s still looking for a job.\n\nI inherited a house after my grandparents which I own on my own. It’s got a ground floor with sitting room, kitchen, bathroom, drawing room (it’s not an actual room, it’s more like patio with windows around it).\nUpstairs, there’s a master bedroom and a bathroom. It used to have 2 other bedrooms but I run a small business for a living  (think Etsy and stuff) and I have been very successful for the passed 5 years so I remodelled those 2 bedrooms into a huge office which I need for work. \n\nI wasn’t made aware of this before he moved in but he has a 12 year old son that he sees once a month. I haven’t met him yet but Ash wants it to happen soon. \n\nAsh started hinting that we should do some changes and paint and change the office into two bedrooms like it used to be (he saw photos) so I can use one as an office and one for his son.\n\nMy first reaction was “absolutely not!” I explained that I need my office the way it is and can’t downsize it, especially now, during Christmas rush. He pushed and I clarified that I am not going to make a bedroom for a child I haven’t even met yet and he only sees once a month.\n\nHe started crying and called me a selfish bitch. He started saying that I didn’t care if he has a bond with his son and he couldn’t believe that I didn’t want to meet him.\n\nTo make matters worse, he keeps pushing me to do it, sending me photos of boy’s rooms, making a wishlist for amazon and every time we meet my or his friends, he tells everyone that I don’t want his child have his own bedroom and I may turn into an evil stepmother.\n\nI keep having to do damage control but some people believe him and think I’m a bitch.\n\nI need an opinion, am I the asshole for not wanting to convert my office into my boyfriends son bedroom?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "This is emotional abuse, and good luck getting him to leave, he's already undermining your job, undermining you.", "Get rid of him, now.", "NTA. This is your home and your livelihood. He did not disclose he even had a son prior to moving in. If he is acting like this now and calling you degrading names instead of being reasonable, you should rethink the relationship. These are red flags that should not be ignored.", "NTA and he needs to go away. If he wants a room for his son he can get one that’s not in your house. Why do you want to continue this relationship?", "NTA, but you are a sucker for letting him move in at all. Evict this man, change your locks, and   don't let him come back.", "NTA - this guys a major LOSER.  DO not get involved with his child and tell him to find his own home.", "Kick him out and break up.\n\nHe's pushing way too hard way too fast. He's clearly trying to get a free house for himself and his child.\n\nNTA", "Nta\n\nGet him OUT!!!!!", "The first time he called you a bitch you should have dumped his loser ass.", "NTA \n\nTime for him to move out, his 2 months are up, he is planning to stay and leech off you", "NTA", "Is the boyfriend worth all this drama that he created ?", "NTA. He moved in way too soon and is now trying to take over. Serve him an eviction notice.", "NTA.  The office is for your livelihood (and his as he is living under your roof with no job).  Beyond that he is two to three months overdue on getting his own place where he can have rooms designated for whatever he wants.  You also do not sound very enthusiastic about him living there as you statement was just \"its been okay living with him\" and not that you have enjoyed or have liked how it is.   To do a room remodel to add walls is a major and long term adjustment and really a solid commitment from you for a seven month old relationship.   If you think this is \"the one\" and think marriage is in your future then maybe you can consider it, but if that is not in your mind yet than I would say there is no way you should remodel the house for someone who kept vital information from you for far too long into a relationship (having a kid).  So far this person sounds a bit like a leech and a deadbeat.  I hope that is not the case, but it comes across as such here with their manipulative tactics and still having no job while asking for you to change your home to suit them better.", "You are clearly being taken advantage of. NTA", "NTA\nThis guy is making YOU responsible for the consequences of his irresponsible choices. This is way, way, way too early in a relationship for you to be providing for him. Somehow HIS failure to provide for himself and his child means YOU \"have\" to?!?\nWhat does HE do to pull his weight in this relationship?", "As someone from a domestic violence relationship, i see a massive red flag here. I really think you need to look into abuse and see if there are any other indicators. \nWhy the hell would you change your house around for a child youve never met for a boyfriend of only 7 months. Hes trying to manipulate you into doing what he wants. Id get out now if i was you", "NTA Why is he still there? Did you agree to become his Sugar Mama? He was supposed to be there for only two months. You gave him an inch, and he is wanting a mile.\n\nAre you in love and contemplating marriage? You only met him 7 months ago and he has been unemployed for 4 of those. When did this relationship become so serious that he would expect to make remodeling changes to your home? At his age what does he bring to the table? Are you sure you aren't being conned and manipulated here? This sounds very sus to me.", "You got to drop this ash-hole.", "NTA you've known him seven months, and he said 4 months ago he'd only be staying for a month. Do not change your house for his benefit, and do not let him stay there any more.", "NTA. Have you asked him when he's moving out? Considering it was way early in the relationship to be moving in in the first place. You got a serious moocher on your hands. Get ready for everything that is yours to be his if you don't get rid of him soon.", "Past time to break up with this entitled, bullying asshole.", "I'm guessing he also wants you to pay for this remodel since he's unemployed? For a child you didn't even know he had until uou were living together.\nThere are so many red flags in this post its unreal.\nDo yourself a favour and ditch his ass before it gets even more complicated with his kid being involved.\nHe's using you and trying to manipulate you. And he's getting his friends on board to help.\n\nYou are definitely NTA. Run!", "NTA. The fact he took this discussion public instead of keeping it between the two of you is at best immature but in this case comes across more as emotionally abusive. He's using social pressure to manipulate you, and it's working and messing up your head. Kick him out, and if he can't respect that, dump him.", "NTA.  You need to get this pathetic, ridiculously entitled leech OUT OF YOUR HOME.  Immediately.  Today.", "Red flags 🚩", "What the actual fuck?! Mom here. You've only been seeing this man a couple months, you let him move in *for a short period of time*, and now he's trying to remodel your house to suit a child you didn't even know about? No. No way. Res Flag number one, that he has a 12yo should have been 1st or 2nd date info. Not going into full details or setting up a meeting or even showing pics, but definitely mentioning he has a kid. Red flag number 2, he is obviously planning on staying more than a couple months, but hasn't bothered telling you this. Red flag 3, he's trying to guilt you into *remodeling your house*, which I'm assuming you'd have to pay for since he doesn't have a job. And finally, red flag 4,  he's trying to push his kid on you. Nope. No No No. You're NTA and please get this asshat out of your house ASAP. At best he's clueless. At worst, and more likely, he's planning on making you his sugar mama.", "NTA, I would tell him to pack his bags and GTFO. You've been dating for less than 6 months and he has the nerve to demand your room and calls you a \"selfish @!@#$!\" He's 39 and broke, yet he's become a choosy begger.", "NTA. I do think you should ask him to leave and find a new place in 30 days. Issue him the proper notice and consider paying a lawyer a little of money to make sure the notice is done correctly.\n\n\nRealize this will probably end the relationship.", "NTA\n\nHow hard is it to find and keep a job? Places are begging for workers in my area (midwest USA) and I think it is like that almost globally at this point. I don't think he is trying hard enough and can you blame him? You are letting him stay with you (I assume rent free) and he is probably mooching off your food and not helping with utilities or anything else that comes with living in a house. \n\nThis guy is a mooch and is trying to manipulate you into making a room for his son. THEN you really won't be able to get him out of your house. I do not see this guy's future being bright and if I were you I'd just drop him now before he tries to entrench himself more in your house.", "[removed]", "Are you certain he lost his job? Or did he conveniently quit and love bomb you into supporting him?  \n\nYou are not a b*tch.  Why are you rescuing a man you barely know?  Why are allowing Ash the AH to emotionally bully you into changing your home?  \n\nNTA.", "NTA. Time to kick him out, OP.", "NTA.\nHis move was meant to be temporary but he is acting like it is permanent. \nI’d dump him if I were you to be honest. Not his place to remodel or make amazon wish lists. \nAnd he sure was quick to insult you when you voiced your very valid reason for not doing it.", "NTA. you were only dating for a few months and honestly sounds like he has no plans to move out or probably even find a job. Also why does he only see his child once a month? That seems like a red flag to me. Him calling you a selfish bitch is another red flag, any guy calling you a bitch is not good for you. Just break up with him and focus on your amazing business", "Ahaha. No way. NTA. \n\nHe sees his son once month. He doesn't need a whole room. Plus, it's your house. You haven't even been together a year, it's weird for him to ask and expect that of you. Seems like he's not expecting to go anywhere. Taking advantage of you having a house.", "NTA. This is supposed to be a temporary arrangement and he wants you to make big permanent changes to your house for a kid you haven't met? Maybe consider evicting him.", "NTA, no one should ever call you a b$tch. He doesn't respect you and will never respect you. You are only 3 months in and it will get worse. Please take this giant🚩and get him out now.", "Nta - Unless he’s going to pay 2/3 of rent an office space he can get his own shit together he’s just leeching off of you", "NTA, but your bf is throwing 🚩 left and right. I would seriously consider ending the relationship because if he moves in, and is so insistent on changing your house, who knows what he would do if you’re out of the house to do errands or what not.", "Nta. You need give him a letter in writing when he needs to move out and run the other way. These are serious red flags", "You knew this man for 3 months and he started freeloading off you and is getting progressively more demanding.\n\nYTA for staying with him.", "NTA for not wanting to do this buy YTA for still seeing this guy! He is mooching off you! Tell him to get out and find a better man.", "NTA, he's moving out anyway! WHY THE FUCK should you remodel YOUR home to inconvenience yourself for a man who isn't permanently living with you?!?\n\nHis kid probably wouldn't even mind camping on the sofa, it's ONCE A MONTH. Plus, I reiterate: He's moving back out!\n\nOP it sounds like he's going to try to make living with you VERY permanent, whether you want that at this point or not. Otherwise he wouldn't be wanting an office of his own, as well.\n\nKick him out before he's there long enough to claim residency - some US states will make it *very* difficult to remove him.", "Anyone who would call me a b** would have his bags on the porch 10min later. Please respect yourself and get rid of this leech. If he already treats you like this after 7 month, how will he treat you in 10 years?", "He needs to move out", "NTA \n1) If he is only staying 2 months until he finds a new place, why do you need to make permanent changes to you house for him;\n2) You were dating 7 months and he hadn't mentioned a 12 year old son!?!? \n3) The public airing of this perceived slight to him is more than telling.\n\nHe needs to move out now. Let's see if he gets a 2 bedroom apartment so his son can stay.\n\nAlso, why does he only see his sone once a month?\n\nRed-flag-city.", "Not nearly long enough with him for him to be making suggestions about your house, much less demands - and for when he only gets to see his son one weekend a month! And it would impact your business?\n\nHe’s a freeloader & it will only get worse from here. \n\nNTA. Get him out or dump him. The audacity.", "RUN 🏃‍♀️. Get rid of this mooch now. He ‘lost’ his job? Are you sure? \n\nYou should be reminding him that he is not a permanent resident and to get his ass in gear to get a job and find his own place.\n\nHe feels entitled to YOUR house. You are not even with him a year ffs\n\nYou will be an ass to yourself if you don’t nip this now\n\nNta", "NTA. Time to kick this guy to the curb. Hmmm...\n\n1. He moved in while unemployed. Is still unemployed. (I'd work 3 fast food jobs if it kept a roof over my head, so I'm not dissing someone down on their luck.) \n\n2. He's in your house, presumably paying no rent.\n\n3. He has a child you've never met, but has decided you need to change your home to suit this child you've never met (and whom he rarely sees). (Triangulation)\n\n4. He's sending you pictures of ways to you should change your home for his child. (Manipulation)\n\n5. Now he's turning people against you by making you look like the bad guy. (DARVO)\n\n6. You're doubting yourself when you said no to the changes. (Gaslighting - we sometimes do it to ourselves.)\n\nThis is an emotionally abusive relationship. Bail. Out. Now. If he gaslights and manipulates you to get his way this time, he'll never stop. This is who he is and how he handles interpersonal conflicts. It will stay this way until you decide to leave.\n\nGood luck, OP.", "Wait, he was only meant to be staying a couple of months till he found somewhere - send him links to rental properties in reply to his bedroom design messages!\n\nNTA - on a more serious note, I think he likes the financial freedom he gets from you, I’d be thinking very hard about whether this is a relationship I’d want to be in", "NTA, this should be a huge red flag. Dump this dude while it’s still early and while you still haven’t met the kid. He is not planning on leaving. If you didn’t know, now you do.", "NTA. \n\nStart sending him listing ls of places for rent, shared accommodation or not. Also all the places that are hiring. Because next he might ask for your help to pay for child support, but that's just me being distrustful.\n\nHis son can have his own room in his own place (meaning dad)", "Holy moly, you know this dude 7 months! I have cans of food in my cupboard longer than that.  He's moved in, calls you names, doesn't tell you he has a son and now pressures you to adapt your house?? Wtf! when he goes out, pack his shit, change the locks and thank your lucky stars he showed you who he was nice and early.  NTA", "NTA\n\n4 months ago he promised is would only be for a month or two. \n\nNow he wants to sanatorium your income and take half your office for his kid. \n\nHe’s not planning on leaving. And he’s acting way entitled.", "**This guy took one look around at you, your house, and your lifestyle, and said to himself,** *“Yep, there’s room for me, my son and finally I’ll be able say I created the perfect family! This / she will do just fine.*”\n\nYou’re ruining his plan. He’s gonna use every tactic he knows how to convince you to change your mind. So far his tactics are Denial, Gaslighting, and Toxic Campaigning to your peer group. I bet there’s more you’re not mentioning, or more that will arise over time. \n\n*Seven months?* Not worth it. \n\n##NTA.\n\n\n\nRun.", "NTA. There are so many red flags here. \n\nHe needs to get his story straight. Is he here for a few months until he gets a job or is he permanently moving in? If he’s only here a few months the boy will be here once maybe twice. \n\nWhy is he making an Amazon wish list? If he is here only until he gets a job then he won’t have money for that stuff until after he moves out. Meaning he wants you to spend your money on it. \n\nI have never wanted to tell someone to run so fast in my life. This guy sounds like he’s trying to use you to play happy family with his son. He probably thinks if you have a house and the son has a room he can fight for more custody and be a stay at home dad.", "RED FLAGS EVERYWHERE, holy shit so so so so NTA. \n\nRed Flag #1: Asking to move in after three months. Based on his recent behavior, it’s likely that he was lovebombing you (please look at up, abusers commonly move the relationship at an accelerated pace to insert themselves into your life quickly before you can see their true colors). \n\nRed Flag #2: Hiding the fact that he had a son from you\n\nRed Flag #3: Acting entitled over a space that you own, a space that HE HIMSELF promised he’d only be in for 1-2 months (a promise that he has already broken). \n\nRed Flag #4: He only sees his son once a month\n\nRed Flag #5: He is presumably still unemployed and living rent-free in your home and expects you to pay to re-renovate the space to reverse the work you already paid to do. AKA he feels entitled not just to your space but to your money, in spite of the fact that he is contributing nothing (I assume) to your home and its maintenance. \n\nMASSIVE Red Flag #6: He is not only ignoring your very reasonable boundaries, he is escalating his attempts to try to manipulate you to do what he wants. He has not respected your very reasonable refusals. This is a huge huge huge red flag, and he will continue to stomp all over your boundaries in increasingly invasive ways the longer you stay with him. \n\nGlaring Red Flag #7: In the process of stomping all over your boundaries, he is also DARVO-ing you. I’m specifically referring to his temper tantrum at being told no where he cried and called you a selfish bitch for *checks notes* refusing to fund a redundant home renovation in the home you own that would also hinder your ability to make money with the VERY BUSINESS THAT WOULD BE FUNDING THE RENOVATION. DARVO (please google this one too) stands for Deny-Attack-Reverse Victim and Offender. It’s a manipulation tactic that abusers use to make you feel like the bad guy when you don’t do what they want. This guy sees his son once a month and is trying to blame YOU for him not having a good relationship with his son??????? GTFO\n\nRed Flag #8: He is trying to poison the well against you by spreading his (likely full of shit) version of events to people you both know to make you look like the bad guy. Again, this is an abuse tactic designed to turn others against you and make you seem crazy and unreasonable so if you ever speak out about what he’s doing, they won’t believe you. This is an isolation tactic. \n\nRed Flag #9: You say you’re feeling confused and starting to doubt yourself. The reason you feel confused is because he’s likely psychologically and emotionally abusing you. Please please please research signs you’re being emotionally/psychologically abused, I’d be willing to bet a lot of them will ring true for you.\n\nOP, I am fired up here but none of it is at you. I am worried for you and this behavior will only get worse, and the fact that it has only been 7 months tells me that it will likely escalate fast. \n\nYou seem kind and reasonable and lovely and I just want to encourage you to live and die by your gut. Deep down you probably know that something feels majorly off with this. Trust that and do not listen to a word he says. He’s manipulating you and I can’t stress enough how important it is to start planning how to get him out of your house permanently. Might be worth checking out r/NarcissisticAbuse if you need help safely planning your exit strategy. \n\nNTA NTA NTA NTA", "NTA\n\nGet rid of this manipulative guy. Moving in after 3 months and demanding you to change your place. That's a no-go.", "NTA...but he needs to go.\n\nThere are so many obvious reasons you just have to see that he is just a mooch and using you.  Don't need to list them.  \n\nDo NOT let him bring his kid into your home, at all, and have him pack his bags.", "NTA. Get rid of that guy. He’s making an awful lot of demands for someone who’s bringing absolutely nothing to the table. And then calling you out your name. Kick him out today.", "Omg NTA, don’t event consider changing your office for a bedroom, also, he is overstaying in your house and now he demands you to make changes, red flag here girl.  🚩", "Converting your office into his bedroom implies he has no intentions of moving out. It’s time to kick him out because he is being ridiculous NTA", "You don’t have a boyfriend. You have an abusive leech.", "Okay I know Reddit always immediately jumps to “leave him” but in this case it’s legitimate.\n\nPlease dump this guy.", "NTA - do all these people know that you're essentially housing him for free.\n\nYour next step is official eviction papers, your BF requests are unreasonable and the fact that he's using \"flying monkeys\" Trying to shame you are HUGE MAJOR RED FLAGS!", "NTA\n\nRUN.\n\nThis is a common toxic relationship tactic.", "NTA. Please kick this user out of your home and your life immediately, before he qualifies as a legal spouse with spousal rights! He will take and take until you have nothing left. \n\nThe red flags here are flapping you in the face! RUN!", "YNTA", "NTA you need to kick that hobosexual out. You're not going to get rid of him if you don't and he's going to take over your home. \n\nHe is manipulative and his son has no right to a dedicated room in your home.\n\nYour first massive red flag was him asking to move in so early in your relationship. Don't fool yourself  he planned this all along", "NTA- you’ve been played though. Keep your office. Lose the mooch.", "NTA. KICK HIM OUT", "NTA, you aren't that serious with this guy and this move-in is temporary, right? Keep your office the way you want it. Also, kick him out already.", "NTA - OP, why are you with this man?  Seems like he’s using emotional manipulation to better his situation.  Wondering if he had a bedroom in his previous apartment for his son? Is he paying you rent?  Even if he is it’s your house.  I would think for the holidays you should vacate from the relationship and concentrate on your business for the holidays.", "Heck no. We went from \"I just need to stay 1 or 2 months tops\" to 4 months later arguing with you to provide a bedroom for a kid you didn't even know existed until after this guy moves in? \nAnd crying and calling you a selfish bitch? It's time for this guy to go. \n\nNTA.", ">He started crying and called me a selfish bitch.\n\nWhen he begged to move in after only 3 months of dating, and has spent 4 months unsuccessfully trying to get a job? \n\nIt's time to take back your keys from this entitled 'man' who is going on 40 and didn't even tell you he has a 12 year old son when he was moving into your house! What a lot of nerve! Get to bootin'!\n\nNTA!", "Okay  I'm not going to immediately say 'dump him' bc clearly you like this guy. But there are some things to consider:\n\n1. Power imbalance. Power imbalance in couples is difficult even for 'seasoned' couples. He is already indebted to you. Regardless of how he acts, you both feel it. For some people, this makes them feel insecure, and they handle this by subtly trying to bring the other person down, often through subtle or unsubtle negging. Please think through if this has happened to you. Also, if it wasn't for you, would he be homeless? Extreme power imbalance. Not healthy in any relationship, downright dangerous in new ones.\n\n2. Entitlement: you are in a relationship. It seems serious. But how is it he seems to find it fair to make demands of your home? It is not his. If he acted in any way humble about this, and took your no for an answer, I wouldn't be concerned. This seems not to be the case. I wonder why he feels entitled to space that isn't his.\n\n3. Not telling you about his kid before moving in is just such an enormous red flag I can't even tell you. For me, that alone would be reason enough to not pursue this further.\n\nYou're putting this on reddit for a reason. You don't need to ask us, you already know what to do. It's going to suck, but sometimes things suck. Wishing you the best.", "NTA.  You need to run and run fast.  You barely know the guy when he moves in.  He was supposed to move OUT and yet here he is trying to remodel YOUR home to suit HIS needs.  Oh hell no.  And the second he called me a selfish bitch in my own damn home he would have been shown the door.", "NTA, you were dating for 3 months. You allowed him to move in when he lost his job, first unselfish act. It was only supposed to be for a month or 2 and has now been for 4 months. You are still allowing him to stay, second unselfish act. You didn't know he had a son and now he wants you to change YOUR home to accommodate a son he didn't warn you about and also doesn't seen to be looking at moving. He's selfish and needs to get a job and move out, he's going to keep trying to guilt you and force himself further in to your life.", "NTA. How many red flags do you need before you run for the hills? Get him out of your house. He never planned to leave after moving in clearly. Why are you okay with suddenly finding out he has a kid half a year into the relationship? What else is he hiding?\n\nWhy are you okay with him trying to pressure you into giving into his demands? He's alienating you from your social group on purpose by bringing this up with them.\n\nThis guy is bad news.", "Why the fuck did you let this deadbeat unemployed bum move into your house? After only 7 months of knowing him? You can't see that he is just using you and offers nothing in this relationship? \nAre you seriously this desperate? Throw his broke ass to the curb!", "NTA and good luck getting him out. Dump him, now.", "Definitely NTA for not accommodating, but soft YTA (towards yourself) for letting someone you're housing call you a selfish bitch.... Seriously.", "3 months and he already thinks about:”stepmother?” No one should ever tell you what to do in your own home! Kick that mf out! NTA", "I would have dumped him the minute he called me a bitch. \n\nNever mind that your home office is how you pay the bills that are *currently supporting his manipulative ass.*\n\nNTA", "You need to leave him, and kick him out of your house. He is being manipulative as hell. You're NTA but he sure as hell is. He's taking advantage of you.", "You need to dump this guy ASAP.  He's an entitled AH.  \n\nNTA.", "Madam!!! Get out of this relationship!!! This is so bad!!", "NTA  \n\n\nReddit is usually too keen to recommend people to break up.  \nThis is one of the situations Reddit is right.  \nDude moved in temporarily, then just stayed, then wants you to change your office for a kid he sees once a month. He also pushes you and tried to publicly shame you to make changes that he probably can't even afford.", "NTA, oh dear you're dating a hobosexual. Why would he find a job when you're housing and supporting him and when he has a good chance of guilting you into providing childcare. \n\nNot to mention I bet he's not proposing to pay for coverting your office back into a bedroom.\n\nIf he's like this after only 7 months imagine what he'll be like in 2 years when he's sure he's got you locked down.\n\nRed flags everywhere! Please give him an eviction notice from your house and from your bed. You need a partner not a parasite.", "KICK HIM OUT", "NTA, dump the boyfriend and this problem will disappear. He moved into your house and now expects you to upend your whole life for a guy you MET seven months ago and his kid you've never seen or met? No way dude. If you don't stop this now he's going to wreck your life.", "NTA. This relationship has run its course. Is this how you want to be treated when he doesn’t get his way?", "NTA I think you need to give him notice to leave, he asked to move in after loosing his job and didn't pre warn you he has a child then expects you to remodel your home to accommodate him,  he is not planning on getting his own place, I would question how hard he is looking for work.  You are being used time to move on.", "NTA\n\nKick the freeloader out.", "NTA", "NTA. Honey, he ain't NEVER looking for a job. You are supporting him, his kid and providing a house.  Give him one month to be gone.", "C’mon.  You know better than this.  NTA.  Feel for the kid but his dad is a deadbeat and that’s not your problem.  This guy isn’t the one.", "... why are you still dating this man?  I mean seriously.", "Dump him and kick him out. No you're not making major changes to your house that will hurt your business for a dude you've dating for seven months for a kid he has once a month and didn't mention to you. NTA.", "NTA, but what is the plan for him when he stays, assuming you aren't kicking the bf out?", "YTA for allowing him to move in to begin with. Good luck. He’s unemployed. He has a kid you didn’t even know about. He is a loser and now you have him in your home.", "NTA- You need to tell him that if he wants his child to have a bedroom, he needs to get his own place.  It is absolutely insane that he expects you to give a bedroom (that you need to earn a living that he is mooching off of) for a child that he sees once a month and that you’ve never met at all.  Boyfriend can move out.", "Your choices are:\n\na) allow BF to continue living with you and convert the office. It is not the child's fault this situation exists and should get his own space if possible\n\nb) ask BF to move out\n\nAs with everyone else I think you should do B but if not I think Y W B T A for not converting.", "If you stay with this controlling man, YTA.\n\nYou haven't even dated a year yet!!! He forced his way into your home because he guilted you, and now is trying to guilt you into building a bedroom for his kid that you have never even met?!?!?!\n\nSeriously, ***RUN***. Far and fast away from this \"relationship\" before it's too late.", "I think Y T A because you are still with him. F...  him, calling you selfish went you extend your hand to help him. NTA for no wanting to change the room. Love yourself more.", "Your boyfriend is one massive red flag. \n\nNTA", "NTA . Why do people put up with this crap ? Why are you still with this user", "Yep. NTA. It’s time to give him his 30 day notice. Try to do it as legally as possible since he might not leave willingly.", "He is using you as financial support and is whining when you don’t support him. Either keep letting yourself get used or leave.", "Nta...give him a set time to move out. When he gets his own place he can do with it what he wants. Does he not realize your work is paying for his unemployed ass and you will be the one to pay for all the stuff he wants done. Ffs......", "NTA - If he doesn't have a job, how is he paying child support or his portion of the bills?  If the mother of his child has 4-5 children in 1 room, which I doubt, and no child support coming in, this is a permanent move.\n\nKids are expensive, are you ready to raise 2 at the same time?  His trash talking is especially concerning.", "Nta \n\nRed flags galore here \nHe has no job \nHe called you a bitch \nHe doesn’t respect your boundaries \n\nGet him out!!! Pronto", "NTA but you’re dating a bum, have some self esteem and kick him out.", "NTA. I would remind bf that his stay was temporary and you are not remodeling your home for a temporary situation.\nI would also give him a specific time frame to move out. This whole situation sounds sketchy, like he is using you to basically support him & his son. You may want to rethink this relationship", "What happened to his staying with you briefly?\n\nDoing what he asks appears to be his planning to never leave.\n\nThat he called you a selfish bitch is unforgivable.  What is he contributing?  He could get s job in fast food to bring in some money. \n\nSuspicious that he didn’t tell you about having a don before moving in with you.  What kind of an apartment did he have before losing his job?  \n\nThink you are being used. Tell him when he needs to move out.", "Yikes! I got so many red flags that I had to write a comment! Kick him out! NTA", "NTA. But what the hell do you see in this loser?", "NTA. Make this your hill to die on. Ash is stomping all over your boundaries, and as far as I can tell in the relationship mainly for what is in it for him. It is very easy to be generous with other people's (your) resources.", "Oof. Dump him. He is manipulating you whereas you've been together a minute. Just no. Not worth it. Run. And NTA of course.", "How are you this desperate for a relationship?", "NTA\n\nHe started crying and called you terrible names?\n\nNOPE. Please gift yourself with no more Ash for Christmas.", "NTA\n\nIt sounds like he is trying to move in there permanently with you.  Is this what you want?\n\nIf not, you need to get him out of there ASAP.\n\nIf you do decide you want to make a go of it with him you need to  address sleeping space for his son at some point but at this point I would not make any renovations to your house and I would be very wary of your \"BF\" trying to make unilateral changes to your place.", "There is a good term, hobosexual.", ">Why are you with this person, he is a jobless mooch who lies to you and tires to control your belongings and possessions while using up your kindness and generosity. Kick this fucker to the curb ASAP.\n\nI believe there is a name for this kind of man... I believe the term I've heard others use is \"Hobosexual\"", "Literally, all of this. Get him OUT before he's there long enough to claim tenancy and you have to pay $ to evict him. This is only going to get worse. If ANY partner got mad and called me a bitch, selfish or otherwise, they'd be out on their \\*ss before they knew what was happening.", "This.", "NTA - and keep in mind she hasn't met the mother of the kid yet either. He seems wayyyyyy too complicated and she should simplify. The nerve of this dude!!!", "Right here ☝️", "👏", "Girl, ACT NOW. The longer you delay the more difficult it will be to get rid of this man.", "THIS RIGHT HERE.  This guy 100% knew what he was doing. He lied about only needing a place for one or two months. He was never planning on moving out. AND he brings up a son he's never mentioned before? OP, you need to think about what else might be coming your way.  This man needs to go NOW. NTA", "This 100%! This man expects you to provide for his son when he clearly cannot! The first red flag was him asking to move in after 3 months, the next red flag was him expecting you to remodel to accommodate his son, and now you’re at a point where he’s trying to bully you into doing it by telling anyone that will listen how horrible you are. How many red flags will it take before you toss him? NTA", "This. OP, this is a bad beginning to a relationship, like really bad if he is acting this way already. Get rid of his manipulative lying self, listen to this person and kick him out, today. NTA.", "THIS! I hope OP reads these comments and takes them seriously. That dude NEEDS TO GO PRONTO. NTA AT ALL.", "Not even 7 months, though? The timeline is confusing me. I feel like she met him seven months ago, but has only been seeing him for three of them? Which would mean they got together after he had been out of work for a month? Which makes me think that was why they got together?\n\nThe whole thing sounds like a manipulation.", "THIS! Plus he told OP that he'd only be staying for one month or two tops, and no it apperas that there's no talk of moving out AND he's demanding that her house be remodeled. I hope OP can get out of this mess without too much hassle, but depending on where she's located she might be in a bit of a mess. NTA", "The child shouldn’t be staying in her house. Period. The hobosexual needs to get his own house. \n\nHouseguests don’t get to invite more houseguests.", "As cruel as it may sound,  I wouldn't let OP or the child into my house if I were in OP's situation.  She's already being 100% taken advantage of and letting them in will make it more difficult for her to make them leave in the future. NTA", "Oh dude you’re totally right about the baby trap. OP if you continue to sleep with this guy make sure you are in charge of your birth control.", "Wow that would be even worse! And then with one or 2 more children may be out of no where !", ">he wants you to spend $$ to reno for maybe two visits? **NAH NAH NAH** \\- he has other plans\n\nFYI: Be careful --> If your post moves to be the top; the bot will have issues with thinking these are \"No Assholes Here\" votes - rather than \"No No No!!!!\"\n\nI have a similar issue with using Na.h for \"nope\" in this tread and needing to catch myself.", "Nope. Not just you!", "THIS - especially if you're in the USA. If he refused to leave then you'll have to file formal eviction proceedings. OP, think seriously about what's happening here. This man promised to stay one month, or two tops and now he's been with you for double that amount AND pushing you to remodel your house for his son he barely sees! NTA at all.", "I’m definitely getting meal ticket vibes.. OP.. kick his butt to the curb! \n\nNTA", "Not to mention these are a lot of changes being demanded by someone who was only supposed to be there for a month to begin with.", "NTA \n\nThis is toxic. You can do better than this person. He is clearly using you.", "THIS! I didn't realize that OP didn't have a clue about his son until after he moved in! I must've not read that part carefully.  That by itself should be sufficient to kick him out. If he hid something that big, what else is this man hiding? NTA", "I 77 O8 O8", "I'd worry he has tenants rights if he established residency by getting mail at her home. She needs to speak with a real-estate lawyer like yesterday to make sure all of her ducks are in a row. It's odd that they've only met not even a year ago & he's already encouraging her to alter her home (albeit revert it to its original layout) for a child she wasn't initially aware of & has never met. It'd be one thing if she could fit a daybed in her office but she isn't working a desk job, she's running her business which can take up quite some room if she's worrying about the holiday rush.", "Yeah if this is real, this is the only reasonable answer", "THIS!!", "Also, I'm not sure where you are located. But where I am, almost every retail store and restaurant is looking for help. Why is he still unemployed?", "This post is the Macy’s Thanksgiving Day parade of red flags. Balloon flags, marching flags, baton twirling flags, dancing flags.", "Also I would never stand for my significant other calling me a b****. He can GTFO", "And just to clarify you had NO IDEA he even had a kid before he moved in?? Run as if a banshee is after you girl. Run", "Yeah this one seems a bit on the nose.", "Also, I swear this was posted a few months ago.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "She met him and they started dating 7 months ago. 4 months ago he lost his job and asked to move in. \n\nMore recently he's been pushing for these renovations", "YUP. This man knew what he was doing. He was never going to move out.", "THIS! OP, if you're in the USA, he'll likely be considered a tenant given he's stayed beyond 30 days. If he refuses to leave, you may need to start the eviction process which can be more or less complex depending on local laws. The longer you put up with this guy, the more he'll take advantage of you.  NTA", "THIS. The likelyhood of more major revelations coming OP's way is pretty high. Who knows what else this man is hiding or being hiding dishonest about.", "So they start dating. After three months, he’s jobless and asks to move in. In the past four months he has been “looking” for a job, and hounding OP about converting a room for his kid?\n\nWhy do I feel it is suddenly worse than when I was confused…?", "Just in case you’re reading all of these replies and struggling with any questions or doubts about just how necessary it is to pull the fire alarm - pull it.\n\nI went through what you are experiencing now - except it turned into losing 14 years of my life to a vampire.  The red flags have been listed for you and there should be zero doubts about what is happening to you.  It will only get a lot worse.  \n\nThe moving in was too soon.  The reasoning for moving in was not sound as you barely knew him and he certainly should have other options.  \n\nGet him out.  Now.  I promise you that you will only have regrets that you didn’t do anything sooner.  I had to come to terms with accepting the loss of those years and that there was nothing good to be saved out of that “relationship.”  Every “nice” moment is a manipulation.  They do not act or think like normal people, so do not try to understand him by looking within.   You’re not in a relationship.  You’re a host and you’re already being drained.  \n\nNormal people in his situation would be looking to ensure their own struggles are not affecting a new relationship.", "NTA. Unemployed 39 yr old boyfriend of  7 months, who pays NOTHING doesnt get to tell you how to rearrange the house YOU own.  If he were a responsible adult/parent he would have $$$ saved and wouldnt have asked to move in with you.\n\nYou said \"people believe him and think I’m a bitch\".  Who cares what people believe? .if they care so much, they can have your mooching, ungrateful, demanding BF move into their house and they can configure the home to suit him, as they expect you to \n\nIf he was contributing ANYTHING to the relationship it would be slightly different, but you only knew him for a few.months when be moved in and he conveniently neglected to tell you he has a son who he sees only once a month.\n\nWhy would you want to allow him to keep living with you after he had the audacity to call you a bitch. He contributes NOTHING to your life but drama, demands, and expense.\n\nYou said \" i may be selfish here considering the boy lives with his mother and siblings and he shares his room with 4 other kids\".\nNone of his son's living arrangements are because of you, and are not your problem to resolve.  If it were a big enough problem to you BF he wouldnt be without a job, and he would have worked to assure that he got his son out of that environment sometime.over the past 12 years\n\nYou need to make your BF move out immediately.  He may already have tenant's rights.\n\nDo not allow your bf to bring his son over and do not change the rooms. \n\nIf you allow him to bring his son  to your place,  and his son sees the difference in standard of living between where you are versus where he lives.  he will never want to go back.  then you'll be stuck with a boyfriend you hardly know and his son, whom he doesn't provide for, and you'll be providing for both of them probably for years", "You're dating a hobosexual", "NTA I am begging you, please break up with this man and get him out of your house ASAP. I couldn’t even finish the post before anxiety for you kicked in.", "NTA he is using you. At least this will be a  good measure on what kind of friends you have. He only moved in because it was an emergency and not you guys making the next step. I also question a father who hasn't even introduced his kid to his girlfriend before moving the kid in to a place that is not his.\n\nYou have said he was OK to live with not great. You need to dump him and let him go stay with the friends who support him.", "NTA but that is a scammer, he didn´t lose his job, he probably never have a job, he is not looking for any job, just pretends to do it, he is not interested in you, only in your money, your business and your house.  Get rid of him asap, nobody who calls you the B word should be allowed to set foot in your house ever again", "NTA. Your boyfriend is a freeloader. You're not being a \"selfish bitch\" at all, he's just using you. Why should you give up YOUR office in YOUR house for a kid you've never met? It's also a MASSIVE red flag that he didn't even tell you about his kid until he moved in, and now he wants you to give the kid his own room? Your boyfriend has no respect for you. Dump him and kick him out.", "NTA - dump this moocher. Get him out now. It will only get worse.", "NTA, you don't need to stay with this person.", "NTA\n\n\nAlso run, like now.", "NTA. Time for a new boyfriend. This guy is using and manipulating you. He didn't even tell you he had a kid before he moved in? What else has he not told you?", "NTA. Hopefully there's an edit saying ex boyfriend. He's too old to be behaving like a toddler and there might be a plethora of good reason why he only gets to see his son once a month...", "NTA. Kick him out.", "NTA\nHis arrangement was to live with you for only a month.  Now he wants to do permanent changes to YOUR house when he doesn't even have a job nor has he seemed to be actively looking for a place for him and his son. A kid he didn't tell you about when he moved his ass into YOUR house.  I don't think he should be making these demands and then telling every one who will listen that you're the AH when it is clear that he is.  He needs to have been gone, like three months ago.", "This is controlling abuse.... He's gaslighting you", "NTA. He was only supposed to stay in your home for a month or two. Now he's trying to remodel your space on your dime obviously since he is without a job. This man is taking advantage of your kindness. Please ask him to leave.  Btw, it sounds like he omitted the fact that he had a child intentionally prior to moving in.", "NTA get that man out of your house ASAP", "*I don’t like it when people just outright say dump somebody.*\n\n**But unfortunately, this is one of those times.**\n\nYou don’t owe him anything you are doing him a favor by allowing him to live with you rent free. He is demanding you make adjustments to your home for his son. \n\nIsn’t he supposed to be moving out soon? Why would you make adjustments if he’s leaving soon? When I read the title I assumed you all were in a committed relationship and his son would be there full time. \n\n**His father isn’t a permanent resident so why would you make permanent changes to your home?**\n\nTrying to guilt you into giving in is a GIANT RED FLAG!\n🚩🚩🚩🚩🚩🚩🚩\n\nIf he’s acting like this now less than a year in, he will become a nightmare! Get him out of your house now! Everyone taking his side can subsidize his life!\n\n**INFO: Did he have a bedroom for a son and his apartment?**\n\nNTA!", "Clearly nta, Girl…Kick him out. You were only seeing him for 3 month and him moving in should have been temporary…now he demands a room for a child he only sees once a month? Is he nuts? That’s a waste of space and you need the space for your living. Now he is badmouthing you everywhere because you don’t do like he wish’s…that’s a major red flag and it will only get worse. That’s your home - protect it and get a boyfriend who treats you right and cares about your opinion and boundaries", "YWBTA if you don't kick him TF out. Don't wait, don't hesitate, just out", "NTA. Kick this guy out. Be careful op. I feel like he probably feels entitled to all you have and will get aggressive once his crocodile tears don't work.  Change the locks if you can get him out.", "End the relationship. This guy is pushing you to do something you are uncomfortable with and you haven’t even been dating for a year yet? You are certainly NTA and honestly I can’t believe he’s making such a big ask in such a new relationship for a kid he sees once a month and also the fact that this living arrangement was not supposed to be permanent so why would you make changes that make your life more difficult and will negatively impact your business.", "Don't call me the b-werd and still ask me to give you something? What the heck is that about? I'd suggest BF move out frankly if he thinks being abusive is how he anticipates living in the future?\n\nI have a home office. And when the door to my office is closed, I am unavailable to everyone. I need a space to finish projects or plan them and manage household finances. I even confine my crafting to that space. YOU RUN AN ACTUAL BUSINESS out of your space. Where are you supposed to work? The uninsulated garage won't lend itself to you being able to support your  life.\n\n I get your BF is just moving way too quickly for you. But, right now, all I see here is he has problems and he has no solutions to resolve them - just knee jerk reflexes.\n\nThat won't work for anyone.\n\nNTA. If he gets a two bedroom apartment, this will resolve itself and not threaten your income *or* jeopardize your sanity.", "He is trying to trap you! Don’t fall for it. \n\n\nNTA.", "He called you a bitch?\n\nKick him out. Yesterday. \n\nNTA, but he sure is.", "NTA Get him out of your house", "NTA. You shouldn’t have to rearrange your life for a boyfriend you’ve had only 3 months. And you absolutely shouldn’t be asked to rearrange your life for the son of said boyfriend of only 3 months, when his son is only with him once a month. \n\nHe’s using you. My suggestion is dump him and find someone better.", "NTA and anyone who says you ate should know that he kept his kid a secret from you", "NTA Look into tenant laws in your area and serve this dude an eviction notice. Get him out of your house and out of your life!", "NTA; everyone has made excellent points (about the joblessness& name calling etc). I would like to add: do you want to be complicit in modeling to a 12-y/o boy that the way to be a “man” is to use, lie to, manipulate & verbally abuse women?", "NTA \n\nGet him out of your house now! \nYou should’ve kicked him out when he called you a selfish bitch like his broke isn’t living in your house, eating up your food and using your electricity. HE DIDN’T EVEN TELL YOU HE HAD A CHILD UNTIL AFTER HE MOVED IN! You only been with him for 7 months! It’s raining red flags with him.", "NTA. Get him out of your house asap.", "NTA. Make him leave. Immediately. He didn't BOTHER TO MENTION HIS CHILD to you??? And he's calling you a selfish bitch for not doing renovations on YOUR HOUSE??? That he was supposed to live in for a MONTH???\n\nTHIS IS GOING TO GET A LOT WORSE, QUICK. Have him legally evicted. Move your valuables to a safe location and end this relationship, before he destroys your workspace or demands to be put on the deed.", "Leave that leech you call a boyfriend lol. For the love of god, I can’t never understand the audacity of unemployed people asking for endless favours.", "“It will only be for a month, two tops!” Girl he is NESTING. He’s not moving anywhere. If you’re fine with that, then yes the kid needs a room.\n\nHint: you should not be fine with that. Run. NTA", "NTA,  not only have you not even known him a year, but you haven't even met the kid and he only sees him once a month. Not to mention he was only supposed to be staying with you temporarily and it's your home.  So many red flags in the way he talks to you and guilts you. I'd be breaking up and kicking him out asap.", "NTA girl don't let his tactics work on you.. he will rally people against you and continue to make you feel like you're in the wrong, and a \"monster\" for your decisions. Please get rid of that leech!!", "If he's only staying for a couple of months \"tops\" like he claims, why do you have to convert your whole office for a mere 2 visits?  Because he only sees the son once a month?  You realize this guy has no intention of moving out of your apartment and he's here to mooch right?     \n\n\nStay Firm. Don't give up your office.  NTA.", "He has no intention of ever leaving. Get him out now. NTA.", "NTA kick this mooch out of your house ASAP", "You’re not at a carnival and these red flags waving everywhere are not for decoration. Dump that mooching liar before you’re in too deep. \n\nNTA.", "YTA, entirely to yourself.\n\nYou've been dating for three months, you think he's going to move in for a month or two then move right back out, you don't even know him well enough to know his basic family circumstances, he insults you when he doesn't get his way, he manipulates you.\n\nYTA for not simply booting him out of your life entirely.\n\nThere is NO way this turns out well if you stay in a relationship with him.", "This dude that isn't even supposed to be living with you, except he lost his job, is pitching a fit because you wont turn your in-constant-use-office into a room for a child he sees ONCE a month?\n\nGirl, get him out. Get him gone. This is only gonna get worse from here.\n\nNTA.", "NTA. \n\nHow dare he not enclose that very crucial information?? You did not know about the kid before letting him stay with you. Had you known, you may not have agreed to letting him stay in the first place. And that doesn’t make you an AH either. \n\nI would remind him he is a guest in your home. He doesn’t live there permanently, he is staying there until he can get a place of his own. If he continues to try to act like he permanently lives there and demand changes, he’s going to have to find a different place to crash. Give him a month and if he hasn’t found a job yet,  he’s gotta find a different place to crash. He’s got 1 month to find a job and another place to live. \n\nHe’s a moocher and a bum. He doesn’t have any intentions of finding a job or a new place to live bc you provide it all.  He’s got it made.  If he had the intention to find his own place, he wouldn’t be demanding permanent changes in YOUR home.", "NTA. He has played you like a fiddle though. Really impressive work, in a very sad way.", "Lol you need to serve an eviction notice. \nNTA", "And seriously, what kind of 39 years old man can’t afford rent? If you have been working for at least 10 years and have a son yet you still cannot afford to rent a house, there is something tremendously wrong with you.", "Get rid of that man", "[removed]", "moving in after 3 months??? 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩", "Your boyfriend's a loser.", "NTA if you're in the uk, please think about doing \"Claire's Law\". Something about this guy is really scary", "NTA - Get him out now. This sounds like a relationship where once he actually moves in moves in, he'll demand to be on the title since you are committed (so that when you break up, he can take half the house).", "I lost count of how many red flags this guy is waving, NTA, and toss his ass out!", "SERIOUSLY, you need to get rid of him. Like yesterday. I don't say that lightly. Your love to him or his love to you doesn't matter. He's trying to guilt trip you - this is a form of abuse. He is damaging your reputation - you don't do that to someone you love. \n\nNTA", "I think you need to get this person to move out. It's not like you are planning on getting married, you've been together a few months and he didn't even tell you about this child before he moved in. Looks like he sees you as a meal ticket. Do you want to be with a person that makes you feel this way? Really?", "Why are you with this leech? He's trying to badmouth you to others while he's living in your house and jobless...dude needs to look in the mirror. NTA but you will be if you keep tolerating this behavior.", "How does stating a couple months turn into manipulating you to make a room for his kid in your house? Has he even talked to you about staying? Like wtf is his thought process here, mooch as long as possible?", "Girl you need to get that man out of your house yesterday", "NTA. He is being financially abusive and now verbally abusive. Call a local landlord attorney and ask them to help you evict him. Tell the attorney about his actions and see if there are any laws on the books about evicting abusive tenants quickly. Before you evict, put a sturdy lock on your office so he can't sabotage your business, and put a camera focusing on the door so if he breaks in you will know. If you serve an eviction notice, have a couple of strong, sturdy friends with you so he doesn't get physical or throw a violent tantrum. You might want to have some friends stay at your house until he is gone. In other words, you need protection from him until he's out.", "NTA! Please throw this leech out immediately. He mooched his way in and is now trying to bully/guilt you into changing your home. This is all bad news.", "NTA - However, YTA for not evicting this guy already. He's taking advantage of you and acting entitled. 7 months is too soon to move someone in with you. Also he's jeopardizing your work, when he's unemployed. He's also spreading rumors about you and creating a bad reputation about you. Is he not an adult to solve his own relationship problems without bringing random folks/ voices into the conflict. Evict him and consider breaking up with him.", "You’ve only been dating for 7 months and he’s not only moved in but is now trying to guilt you into changing your home for a kid he barely sees?\n\nJust dump him and kick him out. He’s using you. You didn’t even know about the kid when he moved in- that should tell you a lot.\n\nNTA unless you let him stay.", "NTA, let him go find somewhere else to set up home as he wishes.", "NTA. Another dude who thinks he can horn in on a random woman and then take over all her living space and resources. You'll probably also be on Mom duty while he plays video games.", "“SCRUB can’t get no love from me.”\n\nNTA", "NTA please dump the manipulative jerk, yikes", "It sounds like he sees you as a way for him and his kid to live free and easy off of you. Do you even want to be a stepmother? Is your relationship with your bf at that kind of commitment stage.\n\nNTA but it sounds like you should run", "“You didn’t care if he had a bond with son”. Would that be the same son that he neglected to mention he even had? GTFOH he is a mooch and sees an easy target. Also lose your friends who are siding with him. NTA", "This guy is supposed to be moved out by now, not taking over your house and jeopardizing your income and guilting/manipulating you about it. Lose him.", "NTA oh wow! I don’t make a habit of saying this but you need to lose this guy.  Red flags abound here.  He’s manipulative, he’s lying about you. You didn’t even know he had a son.  It seems to me from what I’ve seen here young women are constantly being taken advantage of by guys who suddenly lose their jobs and then can’t pay for their apartments and need to move in with girlfriend. I’m thinking three months isn’t long enough to know and let a guy move in.", "There's a reason why you didn't know about the kid until he moved in.\n\nWhy is he asking for a room for his kid when he's supposed to be moving out?\n\nGet a firm move out date from this guy or you're going to be a step-mom before you know it.", "NTA.  Don't do the remodel.  He needs to focus on getting a job, and his own place, instead of demanding you remodel your place.", "NTA \nYou're bf doesn't plan on moving out!  Give him his walking papers now cause he's not going to stop treating your house as his and guilting you.", "You need to look into protecting yourself and your house before him and his son start claiming they have squatters rights...NTA", "NTA. GET HIM OUT ASAP!!!! Sounds like this guy found out you had your own house and immediately started making moves to get in. I wouldn't be surprised if he quit his job.", "NTA, the red flags here are huge! Kick him out and change the locks!", "YTA! like he's walking red flag and you're still with him.", "NTA. Dump the guy. This Calling you names for not doing what he wants. Guilt trips not a keeper.", "NTA, but if you let Ash continue to live in your home and call you a stupid b\\*\\*ch, I recommend therapy for YOU.  You don't deserve to be called names, and he doesn't get to decide how you organize your home.  Figure out why you are letting Ash stay.  He can find another place to crash.  I get the sense that he is using you and certainly doesn't respect you.", "NTA. Girl, run. The red flags are everywhere.", "NTA. Your boyfriend is a leech. He isn't working, so I assume he wants you to not only give up your work space but also foot the bill to remodel for a child you've never met. I also find it a bit suspicious that he claims he's supposed to get his son once a month, but he's been living with you for 4 months and you have yet to see a kid at all.", "NTA \n\nDon't allow him to guilt you into giving up your needed business space.\n\nYour home is yours. Your business is yours. Your income is yours. \n\nHe sees his son rarely. You have not met his child. He is way out of line for expecting you to devote a room in your home to his child. The additional manipulation od crying and sending you photos of boys rooms are giant red flags. \n\nYou said that things are \"okay\". They're not. He's unemployed. He's trying to manipulate you. He wants to move in a preteen that you've not met. \n\nIt's time for him to go.", "Is the sex that good you’re willing to overlook all the red? NTA. Give yourself the Christmas present of being single and having your home to yourself.", "Nta. Get him out. He contributes nothing but problems.", "#RUN", "NTA\nI usually don't advocate for this but y'all need to break up. like it's only been 7 months. it's not worth the headache. Expect him to stay exactly the same but more 'comfortable' (ei dependent, immature, entitled). like it just seems so annoying.", "sounds like your christmas gift this year should be a clean house - clear out the barnacle masquerading as a man.", "NTA.   \n\n\nWhy are you with this parasite?", "Wait what? You knew him for 3 months🚩 and he invited himself to move in with the old \"if you don't I'll be homeless\" routine 🚩, was supposed to be out in ONE month, it's been TWO 🚩. Now he wants you to make room for his son 🚩. This guy has NO intention of moving out! Do You Want To Pay For Him And His Son For The Rest Of Your Life?  NTA, but kick him to the curb Now before it gets any worse! Please! If he really loves you and not your money/material possessions, then he'd be willing to move out and take it slow with you.", "NTA.\n\nIt's a new relationship, you're doing him a favor, you haven't discussed living together permanently, why the hell should his kid (that you didn't even know about) get a room at your place?\n\nSeems to me like he's using you.\n\nAlso, it's a new relationship, you're a few months in and he's calling you a bitch for not bending to his wishes? Dump him.\n\n&#x200B;\n\nEdit: oh yeah, forgot to mention:\n\n\"He started crying and called me a selfish bitch. He started saying that I didn’t care if he has a bond with his son and he couldn’t believe that I didn’t want to meet him.\"\n\n\"I keep having to do damage control but some people believe him and think I’m a bitch. And my head is a mess, I’m starting to think I may be selfish here considering the boy lives with his mother and siblings and he shares his room with 4 other kids.\"\n\nemotional manipulation and gaslighting hon'. he's a giant red flag.\n\nAlso, it's not your problem if HIS kid shares his room with 4 other kids. Your bf should get a job and an apt with 2 rooms. (And you should get a new bf)", "You are NTA. I would suggest that your answer to this conversation every time and everywhere should be along the lines of \"I'm not remodeling my home or my life because you have a child. Why would I remodel to make a room for the child of a temporary house guest? This sounds important to you and I am sure your child will enjoy the room you provide in your own new place. Btw, how is the job hunt going?\"", "NTA. I thought his stay was temporary? He's making a lot of permanent plans for *your* house, OP. You got duped by an irresponsible hobosexual.", "The minute  he called you a bitch I’d be packing his bags. Plus your already letting him stay longer then planned", "NTA.  Anyone moving in temporarily while they get a new place has absolutely no say on your housing situation.  You need to realize he probably quit his job and expects you to take care of him and he will use you to get his son and pay less or no child support.  Evict him now.", "Why is he in your house, again? Does he give you any $ for rent? He just sprang a kid on you? Your hiuse. He's a freeloader. Maybe kick his ass out. NTA", "NTA- he sounds like a con artist.", "NTA. Run, Sis....", "Soooo he feels entitled to space in your home for the sake of his son you haven't even met yet, he gets angry when you don't give in to his demand, verbally disrespects you, emotionally manipulates and attempts to gaslight and guilt trip you, plays victim about your affect on his bond with his child, he makes a grand leap assumption that you'd even consider marrying him....my god is this guy a fucking train wreck. Zero emotional intelligence, zero maturity, zero communication skills, zero conflict resolution...and he's a parent? Poor kid.\n\nYou most certainly ARE NOT the asshole, but this guy is and he's about to take you for a ride. This behavior is very telling and I hope you're paying attention.", "So very NTA. 7 months is not nearly long enough to make these kinds of requests. Also, is he offering to pay for the remodel? If not then an even harder, No.", "NTA and you might need to hire an exterminator to help with your leech infestation", "NTA, run...", "From the timeline of things, I think he's been using you from the start. Boot him.", "NTA\n\nThe one month, two tops, is now four. He still doesn't have a job. Is he collecting unemployment insurance, or is he simply living off you? And now he wants a room for a child he sees maybe once a month, which would hamper your ability to do your job the way you want to? He seems to want a lot without contributing financially to any of it. So how does he propose to pay for the changeover? Oh, kick this one to the curb. I'm sure he has friends or family he can move in with.", "not only has she never met the kid, but from\nthe way she wrote it, it sounds like she didn’t even KNOW he had a kid in the first place", "You forget that not only she has not met the kid yet, he did not tell her before moving in...", "He doesn’t want a room for his son.  He wants a room he can lock himself into and play video games all day.", "Wait, he’s been there 4 months and SHE HASN’T MET HIS KID. So clearly he isn’t there once a month, he isn’t there at all. Why does this nonexistent kid need his own room?", "He’s using you 100%", "Call me a b-werd *and* then cry *and* then rant about *my* selfishness? Dude I get you are feeling overwhelmed with your life right now. But, what I don't get is how you figure I can magically save you from yourself? WTH? This is like peeing on my boots and telling me its raining inside the house.", "Right? All she should be doing for him is handing him a 30 day eviction notice.", "And to add he was only supposed to be there for 1-2 months tops. Why does his son need a room.", "This. Wow. DON'T DO THIS. He's establishing residency.  You barely know him. This seems like textbook bait and switch on his part. NTA unless you buy into the con. He needs to go.", "Sounds like OP caught a parasite. Best to remove it now before it gets any bigger. NTA.", "Ahe described the house in detail. There nowhere near enough room for all those red flags, especially with her busy season coming up.", "Also I would not be surprised if he also planning to have the “once a month” kid move in permanently. This whole thing smells.", "And the space he wants her to give up is her work space that she uses to put food on the table. As a crafter, she really does need all that space.", "And they’ve still only been together for less than a year. Has OP even met the kid yet? They’re not serious enough where she has to change her entire setup for a kid.", "Why is nobody talking about who is paying for the room !!!! Like he is jobless and now she is suppose to buy his son a room and lose her space because he comes to visit him once a month and didn't he say he would move out !!! Doesn't it mean he will never move out when his son actually has a room in this house . why would he", "The dick can’t be THAT good.", "My thoughts exactly. Someone who is just staying there temporarily would not be asking OP to renovate and create a room for their child. This man is planning on staying and will beat OP down until he gets his way.", "I’ve said it before and I’ll say it again\n\n> The politburo wishes to know why you didn’t wave your red flag at yesterday’s parade, comrade ಠ_ಠ", "seriously", "I can't imagine dating someone for months before mentioning that I had a kid.  \n\nLike, even if the kid is only once a month, having a kid is a dealbreaker for people so why waste time by not being up front about that?\n\nLike, it should be in a dating profile, and if you met organically, sometime during the first date there should be a \"btw I have a 12 year old son that stays with me once a month in case that would be a dealbreaker\".", "He's also not looking for work. Seriously, if he wanted to be working, he could be working.", "Notice how he slipped in her being a horrible future evil stepmother.  He said that hoping she would get excited about him marrying her in the future.\n\nWhat a manipulative bum he is.", "Agree 100% as well\n\nIf you toss him, change the locks after and install a security camera incase he tries to come back.", "You did well to pick one out of the forest of red flags lol", "No,  he has a solid plan for avoiding child support.  Don't get a job,  don't have money,  can't be bad to pay. \n\nIf course it relies on someone deciding to support him,  which is where OP comes in. \n\nWonder if he ever had a job,  or 3 months was the time for the previous gf who was supporting him to find out about him seeing OP forcing him to need somewhere else to live since than he expected.", "Teenagers? A teen can at least get a job and take some responsibility, this dude is a toddler at best.", "*Hobosexual* I think I’m dying lol", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "That's the WILDEST red flag. I have no problem with parents holding off on introducing their children to their significant other, having agreements with the co-parent on when and how that is done, et cetera. All of that is often quite healthy.\n\nBut to date someone for three months and not even tell them you are a parent?! Every person I've dated who is a parent has disclosed this pretty quickly, because they're proud of their children and being a parent is a major part of their lives, so naturally they want to find out early on if that's a dealbreaker to a prospective partner.\n\nThe red flags here are many, but that's a major one.", "Bingo!  Maybe the kid doesn't even exist...", "Yep that is all this is.", "THIS! Tell the man he has a couple of days to leave. His reaction will determine what kind of mess you're in. If you're in the USA, generally he likely has already established a month to month tenancy and you may have to start formal eviction proceedings to get him out.  NTA", "Odds are he’s already considered a tenant. OP needs to look into the legal process to get rid of this parasite.", "He's been living their for four months. Most jurisdictions consider that a very well established tenancy.", "Remember, this is not a 'partner', partner.  A real partner contributes to the household.  He's a leech and a user.  And this is a camel getting his nose under the tent situation.  If she gives in on this, next it will be unrelenting pressure for her to second-mortgage her house and give him the proceeds so he can 'invest.'  \n\nNTA - kick this jerk to the curb sooner than later.  You don't remodel and upend your life for a kid to spend one weekend a month with you.  I doubt he'd spend any as this seems like a control thing.", "It’s well past that already.", "Right?!  Wild that he still has a girlfriend, a roof over his head and is vilifying her. He’d have been out that day.", "A partner who she is sheltering while he \"looks for a job\" no less. \n\nOp deserves to be treated better", "Listen to this!! You need to tell him to go, that the agreement was for 1 month and you don't feel you know each other well enough to be living together after such a short dating stint. That you feel you missed a step,  there was no courtship and then after a couple of years start living together or get married but 3 or 4 months dating is just too short a time to know how you feel.\n\nI'm sorry but I think this guy has seen a good situation,  a single woman who owns her own home, there's no question of paying rent. How convenient he lost his job just a month after you started dating.  I wonder how long has he ever held a job? It's bad news if he has a child and a man in his 30's can't pay rent and expenses for a couple of months until he finds a new job.  He was out of work and had to move in with you after one month?? If that was his situation and he knew he needed a place to be with the son, he should have taken any job he possibly could get. He saw a golden opportunity when he saw you.  Is he working yet? Paying the bills for the house at the very least? Or is he a freeloader? Giving you the broken record of \"I'm trying but no one has called me back, no jobs are available \".?? He has NO right to start making changes to your home to accommodate his son!! Don't let him do this, you need the space for your business which pays the bills; don't let him mess with your workspace! If it were me, I would tell him you've been together too short a time to start breaking down walls. He needs to get a job first and his own apartment first so he can show you he has a steady job and a steady income. My bet is once you make him move and show you he has what it takes, he'll find someone else to latch onto and will let him bring his son too. NTA but pls get him out of there asap and let him prove to you he can stand on his own two feet.", ">There is a good term, hobosexual.\n\nLooks we had the same thought at the same time (or... within a minute)\n\nAlso... Happy Cake day!", "Happy cake day", "Exactly. Get that shit notarized and rolling. He's a leech.", "My thought exactly. Dude was supposed to leave two months ago but he's clearly making himself very comfortable.", "Nobody is talking about it because none of this will ever happen.", "Probably has a wife or GF somewhere", "Exactly. I am curious what his job was before he lost it.", "100%. My oldest son applied to his first job just last week, had an interview two days later and was hired on the spot. There's work IF you want it.", "Whatever the exact timeline, he waited an unconscionably long time to mention that he had a child. And she waited waaay to long to kick him out after he called he a bitch.", "I tend to think the same - hence the getting him out yesterday.  I was just pointing out that a brief visit of a couple of days isn't justification for turning OPs house upside down to create a bedroom.  There is a whole host of options before giving up the office space should even be in the conversation.  OP is nuts if she does not kick this guy to curb right now.  It's only going to get worse.", "It will pick up the NTA at the beginning of the post, as I understand it.\n\nAlso, not that it counts, but your quoted 'nah' would be picked up by the bot if it were a top level comment.", "I did not invent the term, but it really fits here", "Agree. Even without the other stuff, that one alone would be a dealbreaker.", "Also what kind of parent is only allowed to see their kid once per month?", ">If you're in the USA, generally he likely has already established a month to month tenancy\n\nDoes this vary by state?\n\nHere in Canada, specifically in Ontario: they are basically a \"boarder\" without much in terms of tenant rights (because of shared living areas).", ">Tell the man he has a couple of days to leave\n\nThis is bad advice. If he's as smart and vindictive as he sounds he can make her life hell in court over it.", ">Odds are he’s already considered a tenant. OP needs to look into the legal process to get rid of this parasite.\n\nDepending on jurisdiction - he may be a \"[boarder](https://www.tenants.org.au/factsheet-14-boarders-and-lodgers#:~:text=Unlike%20tenants%2C%20boarders%20and%20lodgers,agreement%20whereas%20lodgers%20do%20not)\"\\* rather than a \"tenant\" since OP lives in the dwelling; and (again depending on jurisdiction) that \\*MAY\\* make it easier for OP to evict him. OP will have to look into it.\n\nThe scarier thing for OP would be if he stayed long enough for a \"Common Law\" marriage - which \\*USUALLY\\* is 5-10 years - but have heard that can be even shorter in some countries. That said --> This [source](https://www.ncsl.org/research/human-services/common-law-marriage.aspx) shows that Common Law marriages are rarer & harder to enter than some fear they are.\n\n(\\* I acknowledge my randomly chosen Boarder/lodger quote is from Australia --> We don't know where in the world OP is; so I did not have reason to look for a more specific source; and this source gives a good differentiation)", "No, not when the landlord lives with tenant.   Tenancy rights don't apply in this scenario.  And since he likely wasn't paying rent, he can be kicked by at a moment's notice as he's a guest that was overstaying his welcome.", "Thanks, did not notice myself.", "Probably had a girlfriend he did the same thing too, and promised her he'd leave when he \"found a job\" aka found another woman to take him in.", "There probably wasn’t a job. He was mooching off the previous girlfriend i bet.", "Totally agree with you.", "I do agree re giving him notice can be dicey. But sadly (if he's in the USA), if he knows what he's doing he can make her life hell anyway, because he's likely already established a month to month tenancy.", "NTA. Remodel by getting more space in one easy step. KICK OUT YOUR HOBO BOYFRIEND! Tell him he can share his bunk at the shelter with his son.", "It's pretty bad. I have no idea why she's acting like anything about this was normal until the renovations thing.\n\nPretty likely that he found out about her house and hatched a scheme to get himself living there. Probably so he could try to get more custody of his son or something.", "Yes! They started dating, he saw she had a nice, big house, and conveniently “lost” his job and “needed a place to stay, just for a month!” Four months later, still no job, just a 12 year old, and demands for renovations of said house, for which he contributes nothing.\n\nOP, I have a feeling that he had ulterior motives for being with you."]}