{"id": 28951, "submission_id": "1788u9n", "title": "AITA for making my mom cry", "selftext": "Hi. I (F19) have been interpreting/translating for my older deaf sister (F26) as long as I can remember. My sister lost all her hearing at the age of 3. My parents are not fluent in American Sign Language (ASL), so they only use \"home-signs\" (made-up signs including pointing). I am the youngest of 7, and the one who knows the most ASL. Because of this, I have been interpreting/translating for my sister to my parents, sometimes older sibilings, etc. Growing up, I'd always get irritated when my parents/sibilings would make me interpret. I've increasingly gotten more irritated with them over the years (not my deaf sister; it's not her fault). My older sibilings have made a small effort into learning more ASL. My parents on the other hand, have not. Yesterday, my deaf sister vented to me after struggling to understand what our mom was trying to tell her. This wasn't the first time, but for some reason it made me angry (unlike the other times where I was just frustrated). I approached my mom and told her what my sister had said. My mom replied that she can't remember signs because of her age (she's 50). I told her that she had 23 years to learn ASL, but didn't make an effort to. My mom then said that it wasn't her fault because there are not many resources to learn ASL for Spanish speakers (my parents know very little English). I brought up how I've translated (in written format) English videos teaching ASL to Spanish, but she never utilized my papers. I then told her that she can't even sign \"what's your favorite color\" and that she was never there for my sister when traumatic things were happening. This is when she started to cry and ask why I was blaming her. I did not comfort her. I just left to my room. I love my parents and my deaf sister does too, but it can get hard sometimes. We have our good days and bad days. And I am honestly tired. I think that is why I snapped. After the argument, I felt bad. My parents are immigrants. They never finished Elementary school. Maybe that is why they couldn't learn ASL. I've never gotten into a big argument like that with my mom and have not apologized.", "created_utc": 1697349405, "permalink": "/r/AmItheAsshole/comments/1788u9n/aita_for_making_my_mom_cry/", "score": 11, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I made my mom cry during an argument concerning my deaf sister. I have always interpreted for my deaf sister and confronted my mom. AITH for making her cry during the argument is my question.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "23 years. 23!!! Definitely NTA OP. I think your mums does felt guilty for letting both you are your sister down by to having made more of an effort. True hurts, but her not learning ways to communicate with her daughter is not on you.", "NTA. Crocodile tears from mom. \"How dare you make me feel guilty about something I very much should feel guilty about.\" She offloaded this task, her task, to you and is using the crying move to keep things status quo. The one who should be crying is your sister, whose own fucking mom won't even work to communicate with her.", "That is some tragically shit-tier parenting on their part.\n\nI am flabbergasted at the degree of neglect and disregard.\n\nNTA, obviously.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nHi. I (F19) have been interpreting/translating for my older deaf sister (F26) as long as I can remember. My sister lost all her hearing at the age of 3. My parents are not fluent in American Sign Language (ASL), so they only use \"home-signs\" (made-up signs including pointing). I am the youngest of 7, and the one who knows the most ASL. Because of this, I have been interpreting/translating for my sister to my parents, sometimes older sibilings, etc. Growing up, I'd always get irritated when my parents/sibilings would make me interpret. I've increasingly gotten more irritated with them over the years (not my deaf sister; it's not her fault). My older sibilings have made a small effort into learning more ASL. My parents on the other hand, have not. Yesterday, my deaf sister vented to me after struggling to understand what our mom was trying to tell her. This wasn't the first time, but for some reason it made me angry (unlike the other times where I was just frustrated). I approached my mom and told her what my sister had said. My mom replied that she can't remember signs because of her age (she's 50). I told her that she had 23 years to learn ASL, but didn't make an effort to. My mom then said that it wasn't her fault because there are not many resources to learn ASL for Spanish speakers (my parents know very little English). I brought up how I've translated (in written format) English videos teaching ASL to Spanish, but she never utilized my papers. I then told her that she can't even sign \"what's your favorite color\" and that she was never there for my sister when traumatic things were happening. This is when she started to cry and ask why I was blaming her. I did not comfort her. I just left to my room. I love my parents and my deaf sister does too, but it can get hard sometimes. We have our good days and bad days. And I am honestly tired. I think that is why I snapped. After the argument, I felt bad. My parents are immigrants. They never finished Elementary school. Maybe that is why they couldn't learn ASL. I've never gotten into a big argument like that with my mom and have not apologized.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA.  ASL, which I have just learned, isn't a one for one translation into english.  The sign for blue means blue in spanish as well.  \n\nYour mom is 50, she's not 206.  She's at a vibrant age and that's just an excuse.", "NTA \n\nYou're a wonderful person and the only compassionate person in your family. I cannot imagine giving birth to a deaf child and not learning ASL. Your parents had the opportunity to learn alongside your sister since she was born. 23 years of them consciously choosing to not be able to communicate with their own child is asshole behavior. \n\nAs you know, learning ASL is not that hard. They don't even want to learn how to communicate in the language of the country they live in. I'm born in the US 6 years older than your mother and I learned ASL and French even though I have nobody to talk to in those languages. You don't need a college level education to learn languages. My mother is an immigrant with the equivalent of a 6th grade education, too. She worked her way up in a job to become a department manager. Your mother is full of invalid excuses and is using tears to manipulate you. \n\nI'm glad your sister has you.", "NAH. You were honest with your feelings and your sisters feelings and your mum seems to have understood that. Right now your bridge to her heart is open, now is the time talk to her. \n\nYou obviously don’t hate your mother and neither does your sister. You should see if you can sit her down and try to help her learn ASL with you, start with something simple and meaningful like “What’s your favourite colour”. More often than not, people will avoid learning something out of fear of messing up. \n\nThere’s no greater sorrow from a parent who can’t communicate with their children. Good luck and I hope it works out for your family.", "I've read the first few sentences and know all I need to. \n\nYou're NTA. You're parents especially are and your siblings kinda are. I get sometimes siblings don't have time to learn with their own bullshit. \n\nParents better damn well learn how to communicate with their own kid instead of treating them like a fuckkng ape and pointing at shit. Are you kidding me with that?", "NTA\n\nYou are an amazing person and your sister is so lucky to have you in her life. There is no excuse your parents can give that make it right.\n\nYour sister grew up without the adults in her life being able to meaningfully communicate with her. That is on them and I can only imagine how hurtful it is for her that her parents were not invested enough to learn to have a conversation with her.", "Sounds like mom never even tried to learn.", "People can try and fail and it can really get to them and hold them back. I’m not defending the mother, she had 23 years to put in some effort and 50 isn’t even that old, it’s rather appalling. \n\nBut when everything is out and feelings are raw, in these situations it is the best time to learn."]}