{"id": 28971, "submission_id": "178h4cx", "title": "AITA for sending my son to boarding school", "selftext": "Ok so some context me and my my ex wife share a 11 year old son together. Up until now she was a sahm while I worked full time. After the divorce I got full custody due to some unrelated reasons but i realised I couldn't feasibly care for a kid full time while focusing on my business. So I made the decision to send him to a good boarding school in state so that my ex could get her visitation with him.\n\nSo recently my ex wife called me called me after his first month at school to ask if I could bring him back home instead of boarding school since she believed it would be better for him to be raised by a parent rather than at boarding school. I told her if thats what she wanted for him she could take care of him and id be happy to pay child support to her.\n\nShe told me that I was being a bad father and I know why she cant spend time being a full time parent currently and its my turn to step up for him. I told her i simply didnt have the time or energy to balance being a good parent full time and working and this was the best for the both of us since he would be well looked after and taken care off.", "created_utc": 1697381759, "permalink": "/r/AmItheAsshole/comments/178h4cx/aita_for_sending_my_son_to_boarding_school/", "score": 665, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > for sending my son to boarding school instead of raising him at home\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "INFO\n\nAlright I'm gonna ask. Why did you get full custody? What makes you so special that you can't be both a parent and have a business like everyone else on the planet?", "Boarding school in general isn't a simple good/bad decision, and there's certainly not enough info here to determine it anyway. It's also a little disingenuous to title the thread as if it's about \"school choice.\"\n\n>I got full custody due to some unrelated reasons\n\nIt's odd that the court granted you full custody, especially considering your commitments to your business. It would imply that your wife was unfit in some way, yet here you are offering to have your child live with her anyway...?", "YTA\n\nSorry, but the way you write about your son... without empathy and care... as he was a dog you can rehome when he became inconvenient... or a old toy you can put in the closet and this is the end. He is \"taken care off\" and that's enough? Maybe for you, but not for YOUR child. For any child.", "INFO: Does your son like boarding school? Are you in regular contact with him and checking on his well-being?", "ESH except for your kid. Your ex wanted to “take a break from being a full time parent and take tiime to focus on her career since she let it take the back seat for the last 7 years?“ That’s shitty. And you ship him off to boarding school because you couldn’t focus on raising your kid and on your business at the same time? That’s also pretty shitty. I feel bad for your kid because he’s realized neither of his parents want him.", "ESH. What is the point of having a son if literally none of you wants him???", "I mean, I get why boarding schools exist, but it just seems wrong to ‘not have the time’ to be a parent, and send your kid away like you’re boarding a pet whilst on vacation. \n\nIt’s a lot to have your parents divorce at 11, have your whole life change, and neither parent seems to be willing to…actually parent. Then you get shipped off like a nuisance. \n\nYour post is vague about your ex, and so I’m not sure if she’s also an AH, but I feel you definitely are.\n\nBeing ‘well looked after’ by a boarding school is NOT a replacement for actual parenting. \n\nYTA", "YTA.\n\nWhy do people have kids if they're not going to be parents? It's one thing if a kid is out of control and parents have reached their limits and this is the best option; but no, this kid has simply become inconvenient. You didn't accept that making the decision to create a human being came with sacrifices and instead of making them, you're gunna pay to make it go away.\n\nYour wife is right. And you're fulfilling every fear this kid probably has about the divorce being his fault. He will learn you aren't dependable and don't have an interest in him. He will learn you throw money at problems rather than expend your own energy. And he will learn *that's* what it means to be a parent and possibly repeat the cycle in the future.\n\nJustify your actions all you want, not like Internet people are going to change your mind. Just be ready to live with any consequences. You can't put zero effort into being a parent and then complain about how your kid turns out. And you also can't put zero effort into being a parent and then complain to the school about any methods you disagree with. Parents who delegate raising their child to teachers and then expect them to raise an entire classroom of different children exactly how they themselves would are just pathetic.", "Info: What is your job that you can't care for him at all? Did you try any other solutions like a nanny?\nWhat did your son want?", "YTA, you know know your kid called her about this, right?", "ESH\n\nSo let me get this straight, your ex doesn't want to parent, and you don't either.\n\nPoor kid. At 11 he will likely know you 2 are not fighting over him to get more time with him, but arguing why you can't be bothered. \n\nUnbelievable, your son is not a dog you can kennel while you go on holiday. Do better", "That poor kid\n\nCan you imagine your own parents saying they don’t have the time, energy etc to parent?\n\nYou are freaking crazy", "YTA\n\nI hope he LIKES boarding school, because it sounds like his parents suck.", "YTA. You got custody so you didn’t have to pay child support period. You don’t care about your son. Let him live with his mom who does love him. The child support will be less than boarding school.", "\"Me and my ex wife share a kid\" \n\n\"I couldn't feasibly take care of a kid\" \n\n\"if that's what she wants she can take care of him\" \n\n\"she can't be a full time parent\" \n\n\"I simply don't have time or energy to be a full time parent\"\n\nJFC both of you are abhorrent assholes. He's probably better off with neither of you but yes, you're definitely the asshole. So is she. I really hope \"your burden\" has some aunts or uncles in the picture that can teach them what family should be.", "YTA\n\nHe's your son. Your son is more important than your ever-fucking business. Another poor kid who will grow up without a father meaningfully in the picture and worst of all, it's not because you OD'd or something. It's because you just don't care.\n\n~~Give your ex full custody and make payments. At least then he'll have a mother.~~\n\nOh wait, I should have thought: if you have full custody it's because his mom has to be a total wreck. So you can't send him there because he'd probably be in danger.\n\n&#x200B;\n\n>After the divorce I got full custody due to some unrelated reasons but i realised I couldn't feasibly care for a kid full time while focusing on my business.\n\nGod, YTA. Divorced and just threw your son to the curb. Raised, unloved, by fucking boarding school staff.\n\nI can only hope this is a fake ragebait post.", "YTA. Just... ugh.", "YTA. Why not get help at home instead of shuffling off your child so that they wouldn’t be a bother. \n\nYou nor your ex deserve him.", "I’m going to say esh- it seems that neither of you actually want to raise your son and that must be so hard for him", "YTA. I was sent to boarding school and my parents never made any time to see me. You're setting the poor kid up to be a member of r/emotionalneglect. My childhood abandonment issues still mess me up as a 43 year old", "Yta. Your kid should and will always come before work. Idk how you find the right compromise to make it work but you should. Whether that be the assistance of a nanny, stepping back hours etc. Money alone does not equal raising or caring for a child. Though yes it is important part of it. Do better for your son.", "NTA for sending him to boarding school because honestly, you and your ex wife both sound awful and hopefully he'll get to build some decent relationships with people who give a damn about him.\nYTA for every other reason.", "Yta", "YTA to both of you for putting your careers above raising your family.  Why did you even have a kid if neither of you wanted him around? \n\nI feel really bad for your kid, since he is just in the way and shipped off to live with strangers. Once you have a child, that is your priority. If something else is more important, you have screwed up your life.  When you are old and dying and little Billy never comes to visit, he has probably been spending his Christmases with his former teachers since they were the ones there for him when he was growing up.", "ESH, you have a son to raise, and this should be the priority. not focusing on your business and shipping the kid away, parents of the year right here!", "YTA. So is your ex. \n\nNeither one of you want to bother to be a parent to that poor kid.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nOk so some context me and my my ex wife share a 11 year old son together. Up until now she was a sahm while I worked full time. After the divorce I got full custody due to some unrelated reasons but i realised I couldn't feasibly care for a kid full time while focusing on my business. So I made the decision to send him to a good boarding school in state so that my ex could get her visitation with him.\n\nSo recently my ex wife called me called me after his first month at school to ask if I could bring him back home instead of boarding school since she believed it would be better for him to be raised by a parent rather than at boarding school. I told her if thats what she wanted for him she could take care of him and id be happy to pay child support to her.\n\nShe told me that I was being a bad father and I know why she cant spend time being a full time parent currently and its my turn to step up for him. I told her i simply didnt have the time or energy to balance being a good parent full time and working and this was the best for the both of us since he would be well looked after and taken care off.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Honestly man it seems like a lot of the older, successful entrepreneurs on r/entrepreneurship who put their business over family for years and years end up regretting it. I would focus on your son and bring him home. If you are making enough money hire a nanny to help out (note: help out, not raise your son for you). Your son likely need a lot of support, even if he seems fine, a divorce often takes a big toll on a kid subconsciously. Now, on too of that, he is probably feeling rejected by his father since you sent him away.", "Hugs for your kid.  Let him be where he is thriving.  If you are engaging with him and he’s happy, let him stay at boarding school.  I would have preferred that to my home life.  \n\nNTA", "NTA\nI went to boarding school and there were plenty of kids there who boarded because their parents were so busy. \nWe had a great time!\n\nIt's sure better your child is somewhere being well cared for. \nYou explain it factually and reassure your child that they are much loved. You take child out over weekends and on school holidays, you take some time off to spend with your child.\n\nGood luck", "NTA. The primary responsibility of a parent is to ensure their child is well cared for, and it can mean different things to different people. In your case, it means sending him to a state-level boarding school. You're ensuring his core needs are met when you're unable to be present due to work responsibilities. When your ex objected, you offered child support. As the parent with full custody, it falls to you to make reasonable arrangements. Just make sure you listen to him if he says there's some sort of problem and ensure you're there to advocate for him when he needs it.", "NTA but I feel bad for kid.", "NTA- boarding school is a perfectly normal thing where I grew up. It was a way to ensure your child has routine and typically the academics were higher standard than public school. \n\nJust make sure to make time for him on his school breaks when he comes home.", "I would have loved boarding school. I seriously wanted it and everyone I know who’s been to it loved and. Sigh.\n\nYou’re not a bad parent for sending the kid there if he wants it. Probably better than being in an unstable house. \n\nIf he’s fine with it, NTA.", "NTA.  An alternative would be to hire a Nanny, which probably isn't more than a boarding school.  But you have to do what you think is best for your son.", "NTA As long as your son is comfortable with the position he's in now. If your son is happy and content in boarding school, then the mother doesn't need to be upset about it. Your ex gets to spend time with her son and also know that he is safe and sound.", "ESH. That poor child. There is a huge difference between being \"well looked after and taken care of\" and feeling loved. \n\nYes, he is better off at boarding school than being with cold, uncaring parents, but my heart bleeds for the poor child. One day he will grow up and be a bad father as well, because that is what he knows by your example.", "ESH", "Ehs poor kid", "What does your son want? If he is not happy, you are the A H. If he is happy, you are not. But, why did you get custody of a child you don’t want?", "INFO: What were the unrelated reasons? Why did you go for full custody if you didn't want to care for a kid? Was it just to stick it to your ex?", "ESH\n\nBoth of you should quit playing games with your kid as a pawn due to your failed relationship.\n\nIf you didn't want to raise him, why did you get full custody?\n\nPoor kid", "I think we got a double asshole situation going on here, you both suck, be fucking parents or don’t do the one thing that creates parents, ever heard of a condom?🤦🏻‍♂️", "ESH. End of story.", "ESH. Damn. I feel bad for your kid.", "ESH. It's sad that neither of your son's parents actually want to parent him. If neither of you is willing to step up and be a parent, I'm glad your kid is safe at boarding school, but \"I want to focus on my business\" isn't actually an excuse not to raise your own child.", "ESH. Poor kid’s parent’s are fighting, not over who gets him but who has to take him. Wether he’s “cool with” boarding school or not, he knows that his mother who raised him for 11 years gave him to his father who then gave the kid to a boarding school. The message he’s getting? “Nobody wants me.”  Tell yourself he’s “cool with it” all you want; I guarantee you he feels unwanted.", "YTA - you want full custody but you don’t actually want to be a father? This is beyond bizarre", "ESH if you can afford a boarding school why not just pay for a babysitter/nanny? It’s terrible that neither parent wants to actually be a parent", "ESH except the kid. Why did the two of you have a kid if neither of you wants to take care of him?! He’s better off at boarding school where people won’t dip in and out because they are “too busy”. You both should be ashamed of yourselves.", "There are these people called Nannies.  It’s okay to get one. It’s obvious to me that son is asking mom to come home.\n\nYTA", "YTA \"i simply didnt have the time or energy to balance being a good parent\" then why tf did u go for full custody, based on the feeling of the post it feels that u went to the extreme of isolating your son from your wife for no reason due to u having full custody, u never mentioned a babysitter u never thought of him taking care of himself home alone since he is around that age where people think its acceptable for a child that age to stay home. based on this post it feels like u have no love for your son since u hadnt thought of anything other than boarding school. i hope your ex wife goes to court against u to get full custody or even half custody against u, ur a terrible father op and u knew it the moment u sent him to a boarding school with no thought or remorse, u obviously want you child to be as far away from you since u also ripped the mother away from her own flesh and blood", "NTA for sending your son to a boarding school. However, your motives for sending him are wholly selfish. You describe the tug of war between you and your ex wife, but the only party affected by being sent to boarding school is your son. Hopefully, you sent him to a school where he feels secure, is exposed to a challenging educational program, and can socialize with a wide variety of youngsters.\n\nAnd here's a reality check: most single-family households DO manage to keep their children at home. Being a single parent is never easy, but countless families do manage.  In doorstepping your child at a boarding school, you took the easy, lazy way out.", "NTA.\n\nShe changed the deal & is blaming you for not accepting abuse.", "ESH, hopefully the kid thrives in boarding school, and learns never to be like the egg and sperm donors.", "Info, what type of business, how many hours a week do you work, and why did your wife not get custody?", "Will one of this kid’s parents actually step up to be a parent, or continue sending him away? I feel so bad for him. YTA 100x over", "YTA this post is just gross.", "YTA why did you get custody of all you care about is your business? What does the kid say? He's 11. Suppose there's a chance he's pumped to be away", "Poor boy. Sounds like both his parents are prioritising their careers over him. Honestly, he'll be an adult in 7 years. Can't both of your careers wait till then while you concentrate on being parents?", "Are there even boarding schools nowadays?", "YTA\n\n\nIt’s so sad, why to have a child when it seems like no one wants him?", "Yta\n\n\nI see an organ-need in your future, and I see your son losing your number.", "ESH. I hope he gets better treatment at the boarding school, because neither of you should have him near you. This is why we have such emotionally unstable adults harming others in retaliation from their awful lack of attachment from their supposed caregivers.", "Well, you may not be a AH, but you should have given exW the option from the get go to take care of son", "YTA. You are offloading your child. You got full custody and still havent stepped up?", "YTA. It's amazing that rich people can neglect their children and get away with it. Get a vasectomy if you don't want kids.", "I went to boarding school, and while I didn't personally love it, it sounds like your kid isn't against the idea - as long as you didn't force him. Both you and your wife are keen to focus on your careers, and that can leave a kid in a weird spot, but boarding school is exactly for kids with those kinds of families. NTA for now, and your wife is a hypocrite - but just make sure you stay involved in your son's welfare and have an exit strategy if boarding school turns out to not be the best thing for his well being. He should be the most important consideration here.", "This just makes me sad", "ESH. Get a vasectomy NOW.", "NTA for this situation. \n\nBecause tbh, the kid may find some people who actually give a fuck about him at that school. AND he doesn’t have to be around either of you. \n\nHowever as parents? You’re both an asshole. Gimme his @ so I can slide him emancipation paperwork.", "Not OP.  I'm self employed ( sub S) with an employee.  My typical work week is 50 to 60 hours. Luckily I will work 2 to 3 days a week in the field the remainder in office.  6 to 7 days a week is typical.  Times could easily do 80 or more a week.  Heck from mid 2021 to mid 2022 could have easily worked more hours than in a week.  \n\nWithout knowing what type of business it is impossible to know how many hours he may work.  If this is in the US a wife not getting custody even partially something is happening beyond what is known.   \n\nWay to much unknown to pass judgment.  Other than OP is probably karma farming.", "No it was more of her wanting to take a break from being a full time parent and take tiime to focus on her career since she let it take the back seat for the last 7 years", "Indeed. Some people make me wish I'm wrong in my agnosticism and there actually is a hell...", "How is this not ESH? She also abandoned her child to pursue her career after the divorce op claims.", "I think anyone who believes that boarding school is the best way their child will be raised to adulthood is probably right.", "hes cool with it and he stays at home most weekends and i call him every other night", "This poor kid - I’m not even involved in this and can tell that no one wants the kid - imagine how the son feels.", "There’s a lot of psychotherapists specialising in ex boarding school pupils. More than that, most of the early psychologists who studied and defined parent and child attachment went to boarding school- Bowlby, Winnicot etc. It’s the feeling of rejection that going to boarding school causes, the breakage of attachment between parents and children due to school terms and the lack of ability to rely on parents if there is a problem at the school. Also all the well documented sexual abuse, both from teachers and fellow students.", "This! There are many options for people of financial means to have the children cared for. A nanny, even a live in nanny would help! I would feel abandoned, can’t imagine how your 11 year old feels.", "Brings to mind the saying \"In 20 years you wont remember all the extra hours you worked, but your kids will.\"", "In what universe is it *not* cruel asshole behavior to divorce, demand full custody, then send the kid away?\n\nParents like this should not exist. He should never have had a kid. \n\n(Yes I'm well aware that people have historically used boarding schools. That doesn't make it ok. He's throwing out his kid. Christ, he could pay to have a nanny and at least spend *some* time with his son)", "My old boss put her kids in boarding schools. She's a workaholic divorcee and it always came across skeevy to me.", ">Way to much unknown to pass judgment.  Other than OP is probably karma farming.\n\nAnd that's where I was at. At that point I'd just be making assumptions and how Reddit is, it's a full spectrum of what could be going on.", "Your kid must feel horrible knowing neither of his parents want him around.", "So I guess both of you feel the same way about parenthood. Too bad for your kid.", "so you're both as bad as each other. your poor kid.", "Why did you people have a kid? Neither one of you wants to raise him, so why bother?", "Huh, probably because as a FULL TIME PARENT she needed to now support herself after the divorce\n\nWhy you had a kid together is baffling, as you clearly didn't want to be a parent", "So have you ever actually been a parent? If she did everything full time until recently what have you done?", "Sometimes you come across people that should have been born infertile. You? Prime example.\n\nYTA. I pity your poor child.", "Poor kid", "Lol trash woman. I feel so sorry for your child. \n\nYou need to be better by holding her accountable. She should be paying child support too.", "Was that before or after you divorced her?", "Hell is empty and all the devils are here.", "Maybe he added this in comments after he got YTAs, there was (is?) nothing like this in original post.", "If he is good with this arrangement then let it be. The courts gave you full custody which is rare for fathers. I would suggest keeping engaged with your son and perhaps for his overall education this will work out for him in the long run. Plus he gets to come home on the weekends so it’s a bonus there.", "So at 11 years old your son is \"cool\" with going from being cared for by his SAHM to being cared for by boarding school staff and with leaving all his friends behind and having to make new ones?  And leaving behind any other family like aunts, uncles, grandparents, and cousins?  Your son might be afraid to tell you he's not happy because he's afraid your next choice might be to abandon him altogether.  And he's \"cool\" with his mother not wanting him around because she wants to focus on herself and her career?  You and your ex are delusional and assholes.  Don't be surprised when your son decides to go NC with both of you as soon as he can.  YTA!", "He is okay with the boarding school and comes home on the weekends? I'm fine with it. NTA", "You don't actually even talk to him everyday? A simple couple minutes of phone conversation? He's 11 not 31.", "Then NTA. I went to boarding school at 13 and loved it, never felt unloved or unwanted (I went home every weekend too). As long as the kid in question is fine with it then I don’t think it’s a problem at all. Boarding schools aren’t always a horrible experience as many people think, you get to spend time with friends in the evenings and have pastoral support throughout.", "[deleted]", "Winnicot!", "Situations change. Was this a foreseeable thing or is this person adapting? Decisions we made yesterday were made with the information reasonably available to us. Ripples.", "Maybe the kid will be better off away from them. At least at school he'll have some kind of community to belong to.", "Yeah. If I were the kid, all I'd be hearing is \"Mom doesn't want me, Dad doesn't want me....\"", "THIS. ^^^Nothing Steven King ever wrote was as terrifying as the news.", "Full fathom give this asshole lies", "If both his parents are assholes he might be happy with the situation because he got away from them lol", "Boarding school can be great for kids- don’t immediately discount it. I went at 14- albeit significantly older than OP’s kid. This kids age suggests not US as very few middle school Boarding schools.", "Jfc. Calling your parents every day at 24 is definitely a sign something isn't right, and the tone of this comment really drives that home.", "Too true. I had a shit childhood and a shit  single parent and one of my number one ‘playing pretend’ scenarios was boarding school 😆. Consuming children’s books such as Madeline and the Harry Potter series really helped enrich my imagination and sense of escapism…", "[deleted]", "YTA. That said, the kid is likely better off at boarding school if it’s a decent one. I say this as someone who was far happier in boarding school than at home.", "Listen to me, and listen hard. I sent my son to a boarding school in 8th grade because his Dad was diagnosed with glioblastoma suddenly. We were in the same town as the school. He came home on weekends. I thought the school was a haven amid the turmoil of his Dad dying. \n\nI thought the school was good to him/for him and also had him with a therapist. I did not know the older boys on campus were bringing Spice to the younger kids. My son took it. \n\nHe is turning 30 this month. The spice affected his brain. He is a shell of what he could have been.\n\nDO NOT. DO NOT SEND YOUR PRECIOUS SON AWAY. Keep him with you, love him with all your might, adjust your job. NOTHING IS MORE IMPORTANT IN YOUR LIFE. I GUARANTEE YOU WILL REGRET THIS.", "As long as the kid is ok with boarding school, NTA. Most of the people I've known who went to boarding school loved it.", "Why would you have children if you didn’t have the time or energy to be a full time parent? Clearly you’re one of those parents who sees his children as an accessory to take out every once in a while when it’s convenient. YTA for being a crappy parent, your ex is right.", "Both of you are assholes.  You two could be the poster children for birth control.  Did you two not realize when you bring a child into this world, your lives as you knew them end?Gosh, you suck.", "You said your son goes to boarding school during the week but spends weekends at home with you. I don't understand why so many of the responses are opposed to this. A good boarding school can offer structure, socialization, and consistency a single parent can't, especially if the parent has a demanding job. It sounds like having your son be at the boarding school during the week gives you the freedom to engage with him more fully on the weekends,  when he is home. If you truly want to see what is best for your son, arrange for him to meet witha counselor to get a professional opinion of whether his being in boarding school is negatively impacting him or not before making a decision to change the situation.", "Both of you suck. Poor kid.", "YTA. WOW. Just... I can't even.", "Yeah, asshole", "Not only an asshole.\nA terrible father aswell.\nEw. Ew. Ew.", "NTA. \n\nThere are worst places you could’ve sent him. I’d ignore the people saying YTA because they are thinking with their hearts instead of their heads. \n\nNot everyone wants to be a parent, not everyone is good with kids. You could’ve easily sent him into Foster Care or shrugged him off on a relative. You even offered to give the mother Child support if she wanted him closer. Yes, it sucks that your clearly not emotionally invested in your kid but it’ll be worst IF YOU PRETENDED. \n\nThat’s what everyone is forgetting here. A lot of parents PRETEND to like their kids, I have more respect for parents who are straight up honest. And not only is he being HONEST he footing the financial bill for the kid. The child could’ve ended up with worst, that’s all I’m saying.", "NTA. Contrary to many, I think your son is better off in boarding school than with an emotionally/physically absentee parent. It's not ideal, but at least you're self aware enough to recognize your lack of availability.", "YTA. I hope he spends just as much time choosing your nursing home as you did his boarding school.", "YTA. And an absolutely terrible father. You actually don’t deserve to be called a father. The way you talk about your child is despicable.", "YTA but only because of how you said it and not necessarily what you said.", "Nah there really isn’t enough information to go on in your post. As long as your kids needs are met, you are keeping in contact with them regularly and are aware and cater to their mental, emotional and physical needs your fine. I don’t know if this would be a good fit long term though.  Being that your family has gone through a big change because of divorce and separating the household I would suggest family counseling so you now were you and your child stand as far as your parent/child relationship. Make sure that you can communicate well and that he is comfortable with talking to you when he’s having problems or a hard time. Distance and family upheaval can cause a child to minimize their issues because they don’t want to burden a already tense situation.", "YTA. If you have a kid and choose to have custody of your kid, you need to make time for them. Family comes first, do a better job at making time for your kid. \n\nKids are people. You can’t just send them away because you can’t take care of them.", "I went to a school like that, it was pretty cool! I was pretty pissed when In high school I had to go to a shitty public school. \n\nIt is not that bad if you got shitty parents to begin with, it can be a blessing I was pretty far ahead of my peers in hs. But the social aspects where very hard for me, and a lack of special education did me no favours in public school hs. As you can tell by my complete lack of word smithary.\n\nEdit: yet again I am bad at words.", "ESH - and I'm not sure why there aren't more ESH votes. It sounds like neither you, nor your wife, actually wants to put in the work required to be a parent.", "YTA", "Oof! I feel bad for your son. YTA. You see your son as a chore, not as your son. He's just something you pay and send off and just have to deal with, rather than your boy. Nah.", "YTA. There is nothing mentioned here about what your son wants.", "For all Comments\n Life is not a TV show sitcom where everyone and everything works and is perfect or works out. Life is messy and hard and full of work maybe this is what is best for this person’s family for now.", "ESH and I feel so sorry for the kid, he has some really shitty and self centered parents", "As someone who endured ten years of boarding school I have great reservations that this is the best solution from your son's point of view", "I was sent away to boarding school at age 8 and it severely damaged me psychologically. Nearly 50 years later I still bear the scars. YTA.", "YTA he is your child! You choose to have him so you need to put your big pants on and make it work for him. Parents divorce and he has to go to boarding school. Poor boy.", "NTA only because your post lacks any depth or real info. You will be getting a lot of YTA because of people's bias against boarding schools, myself included. Your wife refusing to be a SAHM to focus on her career is kind of a big nugget of info to leave out of your post.", "Just can’t believe some people think kids have a shelf life. At what ? 12,13,14,16 ? They get in the way of you living your life or being able to provide and earn an income??! I had a child at a young age, dealt with all of these issues but never ever once did it cross my mind to palm my child off because it was inconvenient for me. I can’t begin to imagine the hang ups you’re going to be giving your child. Step up and do something about it. Put them first. They don’t remember the expensive clothes or shoes they remember the time you spent with them without social media or distractions or you kicking and screaming you have other things to do. Build your kid some memories and yourself for that matter", ">  I told her if thats what she wanted for him she could take care of him and id be happy to pay child support to her.\n\nokay i'm confused why did you go for full custody if you didn't him to begin with? \n\nESH since none of you really want to deal with him and do what is best for the him.", "YTA. YTA. YTA. YTA....OMG, YTA. I'm surprised you didn't leave him on the side of the road with a bowl of water/food and his favorite toy... I mean, he'll be okay, right?", "This is a hard situation but overall you seem to care about your ex wife’s thoughts than your children’s thoughts. Your leaving out what your children thinks about this. That’s an important detail.", "NTA because the kid is far better off there than in the homes of parents that don't want him", "NTA - I went to a boarding school since I was 13 and I hear everyone saying that this is bad parenting etc, but good on you for recognizing that you are not capable of being an active parent. Yeah you could have a nanny sure. But for me, I think my boarding school saved me in a way from a bad home environment. It might be a better alternative for your son too.", "Do either of you even like the boy? It doesn’t sound like it. YTA. But you both are.", "Did you ask your son if he wants to go to the boarding school or just plainly told him he'll go?", "Probably ? N-T-A, but WHY did your ex Not get custody If you being unable to Take Care of the Kid due to Work, was a known Factor AND you'd be willing to pay child Support for the Kid living with her full time AND the Kid living with a parent rather than at a Boarding school was important to her? That Sounds a bit too implausible to be \"unrelated reasons\"...", "ESH< mom is all about her. You are all about your career. \n\nI do think that having a therapist, your son, and you and your ex need to sit down and really find out if he likes it there. If he is telling you that he is fine with it but then tells Mom differently you need to know why. \n\nIf he is feeling thrown away you need to stop thinking about your job and think that you and your ex made a choice to have a kid, raise the kid till this age and now you want to stop doesn't work. \n\nGet down to the real reason.", "Your ex is mad at you for sending your kid to a fancy boarding school that will allow her to visit? NTA.", "ESH. Neither of you are willing to make time for your child. That’s just sad. \n\nHopefully you sent your son to a good boarding school that will provide counseling services in addition to educational services.", "NTA, you admit you can’t give him the best future, so you are doing the best by giving him that. \nOther parents may judge but it takes a lot to self reflect and know that you can’t give him what he needs. I’m sure it weighed heavy on your heart, but your making the right decision. \nThe mother is just judging you, she doesn’t even want him to raise him, she can’t judge you here for wanting him to have a promising future. It is also norm in some families and cultures to attend boarding school so you may not get the same response from people with different financial backgrounds", "ESH. OMG you and your ex are horrible people. Neither of you are willing to step up and parent your child who is at least school age? You can afford boarding school, but not a nanny to help care for your son after school hours? This poor little boy. Imagine knowing neither of your parents GAF about you and your well-being.", "NTA, boarding school is not juvenile hall.  It is generally not a punishment, usually provides an excellent education and gives the kid a stable and supervision during the school week such that when he comes home for the weekend his father is fully present.  I know several people who went to boarding school and provided that it was not a therapeutic or a military boarding school, they all loved it.  Even at the therapeutics at least half the kids say it was good for them.  You people act like he’s svsndining his child by sending him to boarding school.  That is ridiculous.", "YTA. Why did you have a child, why did you take the child from the mother, and then send the child away? Was it all for revenge on your ex? Do you even care about your child?", "ESH", "ESH. Step into your son's shoes just for a moment. Your ex currently can't be a full time parent and you don't want to be a full time parent. Imagine being an eleven year old boy knowing neither of his parents want him? Both you and your ex should hang your heads in shame. In fact you know, this isn't a case of ESH because you're both AH.", "Yta the fuck kinda parent ships thier kid off so they don't have to raise then. Shame on both of you", "I can’t say, some boarding schools are great, and I wish I had gone to one rather than being stuck with my mother. \n\nActually I’m going to say NTA. At least you’re being realistic.", "Just admit you hate your son. YTA", "INFO: What about your visitation with him? How often do you see him? Is there the option to meet up with him for weekends, etc.?", "Your son will remember you shipping him out when he was a child because it was “inconvenient” to have him around. When you are old and become an inconvenience to him, he will give you the same treatment and ship you off to a nursing home, focus on his business, and never see you. Remember it’s the best place for you you are being taken care of.", "YTA. Shipping your kid off to boarding school because you don’t feel like taking care of him really sucks. Not working with his mom to have him home with his parents also sucks.", "The only person who can answer this is your kid", "INFO: why did you get divorced?", "YTA. Don't have kids if you need convenience. Oh, wait - you already have one. Raise your kid, loser, don't outsource and warehouse him.", "YTA\n\nI don't even know what to say to someone like you.  I mean are you wanting points that you don't throw him on the street or something?  He's your son.  He's your responsibility.  And between you and your ex, all you argue about is that neither of you want him.  That's the message your giving him.  Loud and clear. If you intend it or not, this is what your doing.  Your actions matter,  not your intentions.  Responsible adults know this.\n\nIf he tells either of you that you don't love him and don't care about him.  Know that he's right.  Your son knows what's up and can see through all of both of his parent's excuses.\n\nIf either of you actually cared you'd use your words and problem solving skills and figure something out.  So far this is just a game of duck duck goose, and your child is the one left without a chair.", "YTA, this dude is serious about this..\n\nWhat an asshole.", "Do you know where your son wants to be? Do you even care to know?", "YTA. You've got it backwards. Your son comes first, not your job. You basically shipped him off because he's an inconvenience. I hope he's in therapy.", "Meh that kids for sure will feel neglected but I went to boarding school and was able to avoid my dysfunctional family bc of it. In that way, it was a blessing. Plus I loved boarding school", "Yta. I sent my son to boarding school for high school,  but it was his choice. He got to choose between that and it local very good public school and chose the boarding school.  Your son is 11, and yes,  kids are a lot of work,  but he should be pretty self-sufficient by that age... it's not like he's a toddler who needs supervision 24/7. You chose your business over your son, and your exwife did the same.", "NTA - if your son has no issues with going to boarding school then I say let it be.\n\nYou’re paying for the boarding school not your ex-wife. Unless she’s the one paying for it I don’t see why she has a say. Plus you’ve offered for the alternative of her taking care of him and you paying child support which she has turned down.\nShe’s telling you to look after him with zero support from her plus is also something that would have no effect on her lifestyle. I would say the AH is your ex-wife.", "INFO: What does your son want?", "Boarding school is not necessarily a bad choice.  In some societies it would be considered the optimum, like you are giving your child the best possible start in life.  Why in the world are you asking here?  Where you should know what assumptions everyone will make?\n\nWhat does your son think?  Did he want to go to boarding school or beg you to let him live at home?  Is he calling your wife now asking her to intervene?  Is there no live in help you could hire to provide care when you’re at work & son is out of school?  Did you explore that alternative?", "This is what happens when people have kids that they don’t want", "Misleading title. Should read: “AITA for not knowing how to parent my son?”\n\nAnd yea, yes YTA", "You sent an 11 y.o.  whose family just went up in smoke thanks to divorce to boarding school because you had to focus on business?  What can I possibly say to you that won't get my response deleted for lack of civility (which you don't actually deserve)?\n\nI'm pretty sure that nannies cost less than good boarding schools.  For sixth graders.  Are you kidding me?  \n\nI can only hope that when you're older and would like to see your grandchildren, or perhaps have a relationship with your adult son, or need some care or compasssion, he sends you a nice antique record with Harry Chapin's \"The Cat's In The Cradle.\"  Gift wrapped in shiny paper in his boarding school colors.\n\nAnd that father didn't even exile his child to boarding school because hey, he had to go to work.\n\nYTA, and so is your ex.", "YTA. You don’t have time for your son? Really? Wow. Poor kid.", "This sounds like the plot to *Parade's End*. NTA - you have custody. Just ensure he is neither the poor kid or the rich kid. Pay for the activities that  make him part of the 'in' crowd.", "ESH", "Man my dad is dead. He died at 10. At 31, You make me feel like I’m not missing out on anything the way you write about your son. \n\nYour Business is everything huh? That shits crazy to me. I’m holding my little 1.5 year old girl and I’m just shaking my head. \n\nYTA", "Damn, does anybody actually want this kid? YTA", "YTA. Damn, is he your son or a stray dog? I can’t tell the difference.", "YTA so your wife now that she is free from you wants to restart her career and wants you to step up and be a father. But you're busy, just like when she gave up her life to be a sah wife and mother so you could focus on your career. Of course it's not your problem to make sacrifices for your child, that's not your job right? Is your son really \"ok\" with boarding school? Or is it that he doesn't want to hear you say you don't have time for him. Cats in the cradle and the silver spoon, you might want to listen to that song.", "Yta, Your child is not a pet that you can send away just because you can't be a decent parent, he needs you and you sent him away.", "Wouldnt alimony be cheaper than boarding school? Just saying, that way your ex can slowly get her carrer re-started while your son is with a parent\n\nOn the current arrengment: for the love of God at least call that poor boy daily", "YTA if you don't want to be a parent you shouldn't have accepted full custody of your son.", " YTA. Why fight for full custody just to send him away? He will grow up to hate you.", "NTA: how is OP a horrible father??? People all over the world send their children to boarding school, there is one on the big island that has multinational students along with American students, the Brits send their kids to boarding school all the time if they can afford it. He is doing what is best for the child while he works an undisclosed amount of hours, the child is well taken care of and who is to say that dad doesn’t see him on weekends? Mom didn’t want him because she wants to work on her career????? Priority??? He even offered to pay her child support if she didn’t want him in the boarding school and she says he’s a  ad parent ??? She needs to look Ton the mirror. Sorry just me. Also the education the son is receiving you can bet is top notch. So no dad is in the clear, no latch key child looking to join gangs or drugs. Think about that.", "i mean, the way you wrote this for sure makes you sound like the asshole. However, im a member of the sent away for being a problem club, so i have feelings about boarding school lol (not all of them are bad tho). \n\nThere really isnt enough information here tho. Like is this a permanent thing till he graduates or just till your work gets more stable and predictable?? \n\nCos ngl the way you wrote this makes it sound like you dont really wanna be a dad beyond paying for things.", "So, after reading your comments,  it sounds like you and your ex wife both decided that your son is a burden rather than a priority.  The only one I feel badly for here is your son. ESH", "What a duche bag. You are the asshole!", "YTA only if she isn't paying the cash she owes to your son.", "YTA for not telling the court you did not want full custody. Also, why aren’t you both asking the son what he wants?! If he’s old enough for boarding school, he’s old enough to discuss this and his feelings. Maybe he is fine at the boarding school, making new friends, etc. or maybe he’s miserable, being bullied, lonely, or feeling unloved. If he is having problems, you need to pay attention, and act as a caring parent!! If your wife was denied custody, stop acting like she can just take over again. Finally, if you’re going to write into Reddit, be honest about the actual situation so people can give honest, considered answers.", "I went to boarding school and hated it, mind you home was worse.", "YTA and ESH your kid isn't an accessory. FFS step up and be a father.", "ESH.  You and your ex-wife are both AH!  You don't have time?  She doesn't have time?  Too fucking bad.  I feel really sorry for your kid!", "NTA. Keep him at boarding school. She doesn't have custody for a reason. And make sure you see your child whenever HE wants because that's your fucking job.", "YTA.", "ESH\n\nThe ex wife gave up custody to pursue her career, therefore abandoning her son. You got full custody and decided that “iTs ToO hArD” and treated him like a puppy that could just be rehoused.\n\nYou BOTH made a decision to have a kid. If you BOTH didn’t have time to look after YOUR son, then you probably shouldn’t have had a kid. BOTH of you have a responsibility and decided the YOUR 11 year old son was too much of an inconvenience. \n\nSo therefore, ESH", "YTA\n\nI don’t see your son’s best interest mentioned anywhere.  Is he happy? Does he feel loved? Does anyone in his life think he’s important?\n\nYou know your money and your business will never love you back.", "YTA and your kid is going to end up with serious abandonment issues if you keep it up. Imagine being a child whose life has already been uprooted and turned upside down because your parents got divorced and then your dear old dad ends up with custody of you and says, “Sorry, kid. My business matters more to me than you do, so off you go. See you at term break, I guess.”\n\nListen, buddy, you and your wife made the choice to bring a kid into this world, which means you need to be a parent. You don’t get to ship your son off and pretend he doesn’t exist because you’re so tiiiired and it’s inconvenient to you to raise him. Makes me sick, tbh.", "AH. AH. YTA.  Just send the offspring away because that's all he is to you.  Offspring.  You are not a father.  You  are a sperm donor.\n\nYou're such an AH, he's probably be better off at a boarding school", "YTA.\n\n**This is your child, man**.\n\nThis is what you signed up for when you decided not to wear a condom.", "You are in dangerous territory.\n\nI went to boarding school during high school. \n\nNot every kid can fit into boarding school - my parents were overseas with their business so it was natural for me. \n\nI think the main thing you need to address with your son is that he shouldn't feel abandoned. Yes there are the day to day things that if a kid stay at home you have to deal with, and that is good that its taken care of.  But when you spend time with him, he feels whether you made effort is super important.  Kids get bullied in boarding schools as well, but if your kid adapts well boarding school would be a fantastic experience for him.", "ESH - except your kid. You both made a human but are fed up with raising him so you're paying strangers to the raising for you.\nHonestly with parents like the two of you, it's better that he stays at that boarding school.", "ESH except your son. If you both care so much about your careers it takes precedence over your son why even bother having him in the first place?", "My dad was always gone when I was a kid, working on his business, making money to pay the bills. Guess who I don't have a relationship with as an adult?\n\nYTA", "YTA.  Sounds like she needs to take you back to court again, if you fought for custody just to ship your kid off.", "Based on this post, OP is treating his kid worse than I would ever treat my pets! \n\nBeing “inconvenienced” by your child is not a valid reason to send them to boarding school. You should’ve thought through how to balance work and parenting BEFORE having a kid! Or at the very least before agreeing to full custody. \n\nYTA, one of the biggest ones on this sub honestly.", "We share an 11 year old says enough, he's his kid and I understand he has a business but  he needs a father and a mother and not to be seen as a burden", "This is true, but also the child may well be better off at the school, if it is a good one, than with either of these two parents.", "he really sucks. he took full custody because he has an income and probably could afford a better lawyer than his sahm ex.\n\nnothing like screwing over your son while trying to stick it to the ex huh. i hope he sticks op to a nursing home where he \"would be well looked after and taken care off\" when op is old.\n\nedit: his update doesn't make sense. the boy is older now, why couldn't his mom go back to work if she wanted a career? a lot of single moms work.", "I hope his kid grows up and puts the OP in the worst nursing homes in their state when the OP gets old and becomes an inconvenience to the family.", "Agree with this  YTA OP do better for your child or he will resent you.", "He wrote straight to the point… you can’t fault him because he’s rather focus writing facts then feelings and emotions", "boarding school are there for the kid. if it's a better learning environment for the kid. not because the parents are lazy ahs", "Your so wrong and judgmental he offered to pay the ex child support. She declined.. she didn’t want the child. \nAmerica is so used to having dead beat dads… but 50 percent of moms are dead beat moms and the father needs to pick up the pieces", "I hope op likes Shady Pines.", "This ^^^^^\n\n\nHe wants someone to RAISE his son...\n\n\nIf he didn't, he definitely would have hired a nanyn or sittet", "Exactly so.\n\nAlso, children are usually a lot more resilient than commenters here are giving credit for.", "I had such a difference experience in boarding school then your son did", "You know, kids going through traumatic times can get drugs in other places than boarding school right? \n\nIn fact, if OP's kid is going to be a latchkey kid if he and his exwife are working all the time, it will be very easy for him to get drugs.", "Yep. There are a lot of boarding schools for all sorts of different things.", "You wonder why his marriage fail, this is why.", "Why didn’t you and your ex just do 50/50 custody if neither wanted/could handle it full time.", "Sounds like being at boarding school is the best decision for your child since neither you nor your ex wife want to parent him.", "Or maybe it was because she didn't want to take care of your misogynistic, selfish, egotistical ass.\n\n\nIts quite obvious your wife was doing everything. I don't really blame her. \n\nI mean, don't get me wrong...\n\nShe not mother of the year...\n\nBut you are a top notch YTA", "Or maybe it was that she *needed* to work after being a SAHM while you were married, and now that you're divorced, she has to start again from nothing with no work experience or job savings from the last 7 years... Hmmm.......\n\nSounds like there's a little more to it than just \"wanting to take a break from being a full-time parent.\" She's actively trying to get your child under her care; she definitely wants him!\n\nNot really fair of you to only give out the details that make you look in the best possible light. There are a lot of facts here that are being glossed over, omitted entirely, or simply manipulated to make you seem better...", "So neither of you want to be a parent. \n\nYTA", "Oh so none of his parents want him? Great …", "He said that his ex didn’t want primary custody bc she wants to focus on her career. Obviously if mom gets visitation and he offered to give her full custody and he would pay child support, mom wasn’t denied custody, he should have just been straight in his original post. Both these people are horrible people. If he can afford to send his kid to birding school, he can afford to hire a nanny to care for him after school and help on weekends when the kid isn’t at his mom’s.", "Wife didn't want custody because \"she needs a break to focus on career\" that's why he did get 100%. \n\nAlso if he has a business he probably could afford at least part-time child care... thing is he doesn't want to be a parent when he comes home, \"he doesn't want to be inconvenience\". I know plenty of people who have their own business and simply take their kids to work or even have them help with simple stuff. He's 11 not 1.", "Exactly. And boarding school is seen as different in the US but in the UK for instance, boarding school is the norm. You are looked after in, usually, a beautiful country campus. You have classes, activities, a health care attendant, meals, friends. I don't think it's a \"bad\" thing at all. Certainly better then being a \"latch key\" kid, making his own afternoon snack, watching his iPad, waiting for a parent to come home....", "Where does he say that? He just says \"due to some unrelated reasons\".", "He shouldn't have agreed to 100% custody (as he has offered his ex the son back and he'd pay child support to her) if he didn't intend to actually look after his son? Why did he want custody (apart from passing off ex) if he knew doesn't have the time or energy to have a business and be a father? And obviously the business won, it's more important than his son.\n\nAnd worst thing: mum has time to at least visit. He doesn't even \"have time\" to visit his son? 😭😡\n\nIt's ESH imo too, as there doesn't seem a medical or other actual reason the mother cannot take care of her son, apart from \"don't want to\". They both abandoned him.\n\nI feel sad for the son. He has been abandoned by both his parents willingly. I would however ask the son if he wants to come back if that ever would be an option... maybe he's actually happy there as the people looking after him probably give more shit about him than his own parents.", "We don't know her circumstances. He's leaving a lot out. \n\nBear in mind she was also a SAHM who can't do that anymore. It's a huge transition.", "If you can't tak care of you son than why did you have him in the first place.\nIf you have a kid then sometimes You as a parent need to make sacrifices", "Yeah I buy that he is “cool” with it as much as I buy your BS “I was given full custody for reasons”. Reason really being bc your ex is just as selfish as you and also doesn’t want full time custody bc she wants to focus on her career. And there is definitely no excuse to not talk to your child EVERY. SINGLE.DAY!", "As long as your relationship with him is good, boarding school is no big deal (I went to boarding schools, people has a warped perception that boarding school is child abandonment facilities, its not like that).", "I assume if you can afford boarding school, you can afford a nanny", "With all the random assumptions being thrown around here, one assumes he actually wants a significant relationship with his kid later in life.  Everything might actually work out as desired here, for everybody.", "So did his friends he went with. I still see some of their families. And smile while doing it.", "Hundreds of thousands of dollars later, dozens of programs, schools, dozens of attorney bills, loads of blame on me, and all he will say is, “You should have kept me close and loved me.”  \n\nYes, I know it can happen anywhere. But it cuts like a knife that I did what I thought was right for him, listened to “professionals” and failed him. Should have just kept him close. That’s my advice for OP.", "Sometimes it isn’t a choice, I don’t want kids but if we got pregnant I wouldn’t just have an abortion either. Life  is complicated Reddit is not the answer", "No he clearly said he would give her child support to take custody of the kid. The kid is school aged and she can definitely work and raise a child, just as he can. They are equally horrible people.", "This\nThis\nThis", "That's what I'm wondering", "Child support is for raising a child, which op is not doing. If he was actually raising the kid, then she absolutely needs to be paying child support, but he really isn't.", "He didn’t say anything about his wife wanting to focus on her career! He was pretty mysterious about why he got full custody. He should have been upfront with the court though that he didn’t want full custody - cause he clearly doesn’t.", "I wonder why so many people are okay with the mother not parenting because she wants to focus on her career but are tearing into OP for doing the same thing?", "Actually life would be hell.\n\nLife IS suffering, and our lives are based on getting away from pain", "Boarding school is definitely not the norm in the UK. Most people are at state (non fee paying) schools that definitely don't have any boarding. A small percentage of kids are at private (fee paying) schools. Even of those, most are not boarding schools. Boarding schools are just used by a tiny percentage of the population (generally the very wealthy) and cost a huge amount of money. Personally, I would never even consider sending my child to a boarding school. Why have kids if you don't want to be around them?", "[deleted]", "Hmm I was mostly just making a joke about how it’s so bizarre to send your kids to a weird little elite camp without parental oversight, and I think virtually all private schools are an exercise in antisocial class-sorting that should be mostly illegal, but it’s not a hill I’m dying on.", "That doesn’t seem like a cold way for a child to be brought up at all.  /s", "Not the norm, mate.  Not even close.", "It most certainly is not the norm. Being a latch key kid is awesome, teaches you self-reliance and responsibility. All boarding schools teach kids, is how to hide their feelings, play stupid mind games with each other and treat anyone with less money than them like pure shit. \n\nNever met a boarding school kid I liked, and the parents are even worse. Plus the places are riddled with bullying and child sex abuse", "Sweetheart, you’ve read a little too much Enid Blyton and over done the Harry Potter. Sshhh.", "In a reply up a bit. OP should really make some Edits", "Five bucks says he FOUGHT for custody so he could \"win\" and also not pay child support, but now being a grown up daddy is boooorrrrriiiinnngggg so mum can have him back", "Custody is decision-making, parenting time is access. You can have full custody and only spent 1 hour parenting time per year. He has full decision making, he can unilaterally decide it is in the child’s best interest to go to boarding school. She waived her right to have any input. She can claim a material chance in circumstances and apply for shared decision making, but arguing that a child’s best interest is better served in the care and control of a historically inconsistent parent rather than trained professionals will require strongly argued exculpatory facts. Neither is it in the child’s best interest for the breadwinning parent to become wilfully underemployed. The child’s best interest is in having financial security.", "My DREAM as a kid was to go to boarding school. My parents were split but both loved me, so it wasn't due to neglect/feeling unloved like some other commenters. I just wanted that boarding school experience lol", "It's not rare for fathers; that's a myth.", "I had **great** parents, and I would have loved boarding school. No commute? Independence? Additional access to a library? \n\nIf I could have brought my Gameboy (years ago), boarding school would have been great for me. I'd have missed my dog more than my parents and sister, to be honest. I wasn't big on family at that age.", "You are assuming a lot of things here. There was not a word about other family members and they might not be in picture at all. He also comes home for the weekends, so it's not like he wouldn't see his friends ever again. We obviously know nothing about OP's son and his relationships, but he might actually be happier at the boarding school, where he has a responsible adult at hand 24/7 + his parents instead of just absent and absent minded parents who never pay attention.\n\nSource: I moved out at 11 and later went to boarding school, because my parents either weren't present or interested in parenting, best decision ever.", "what the fuck are you talking about", "Neither of his parents want him and have made that abundantly clear. So for him, it's probably a nice change of pace to be somewhere where he can feel wanted.", "I loved boarding school. I fought with my parents to let me go because they wanted me to stay home; it was a great experience though. It was close enough to home that I also saw my family weekly, and I never felt like it was a bad thing - because it wasn’t. It was a prestigious college-prep boarding school with tons of enrichment activities that my parents couldn’t have afforded for me but my merit scholarships paid for.", "When I was that age, I went to summer camps where I was away from my parents for two weeks at a time with zero contact. I would have found daily phone calls absolutely suffocating. He's 11, not 6.", "And the kid is also going to be busy with \"homework\" (yes, boarding schools give kids homework every evening) sports/clubs/activities and generally hanging around with and getting to know his new friends. Some kids would need daily contact, others would be fine with one mid week conversation, others with emails, others with not bothering at all. Kid may very well not feel at all homesick and would prefer not to talk too often and seem like a \"baby\" to the other boys. I don't know and neither do you. The pastoral team will contact the dad if they think the kid could benefit from more calls. Bear in mind the mother may well be calling on the alternate nights or seeing the boy midweek or something. He's not at Hogwarts (probably) so there are actually teachers who care about and look after the welfare of the kids. Pastoral care actually exists in the real, modern world.", ">“You should have kept me close and loved me.”\n\nI think you should take this with a grain of salt. He is placing the blame on you to avoid taking responsibility for his own part in his outcome.\n\nPlenty of people go to boarding school and come out ok. Plenty of people go to day school and end up fucked up. And vice-versa for plenty other people as well. Don't blame yourself, you made the best decision you could at the time.", "And then a few years later after his kid has built that community and support system, he'll remarry and his new pregnant wife will urge him to bring his son home from boarding school to look after their new kid.", "And connections to start life with a head start, and to immediately go NC when he starts his life.", "Sorry, but if you choose against an abortion you better priorities your kid above your career or other \"inconveniences\". Or choose adoption. Otherwise an abortion would be the more humane choice and you're a cruel monster.", "So abortion isn’t an answer but making sure your kid knows that neither his mom or dad want him and he is nothing but a burden is okay? TF?!?", "Adoption", "Oh they are both massive AHs. The mother (ex wife, not wife) just as much as OP. \n\nThey both suck big time. Poor boy.", "Everything Stephen King writes is terrifying, according to his editors.  He just writes and writes and writes and they pick out the crumbs, stitch them together and make a story.  Then the ol' bastard got his kid a book deal under a different name using the same method.  Keeping it all in the family.  Hats off to the editors for not going mental by now.", "I think in some circumstances boarding school makes sense. For example, I went to a high school (in Australia) that had both boarding and day students - most of the boarding students were from rural areas, and their parents sent them because there were limited educational options where they lived, and they were too far to commute.\n\nHowever, this type of school is not common, because it doesn't need to be.", "[deleted]", "Oh Jesus, of course we are only talking about the wealthy. So, in that subset, the UK population sends their kids to boarding schools. The same rich people Subset in the US, do not send their kids to boarding schools (except a bit on the east coast).", "Well you will never know about boarding school so bye.", "There is quite a bit of oversight. Much more at boarding schools then at home. Well, as a parent with a child in private school because the publics are so so so so bad, I must respectfully disagree with your tirade against privates.", "\"I never met a boarding school kid I liked\"....😂😂😂😂😂 doesn't sound like you run in those circles...you never met one....you just listen to gossip and what whatever Piers Morgan says . 😂😂😂😂😂😂😂😂. \n\nBetween the lot of you, I'm totally starting to understand why the Brits drink excessively. In fact it seems like they down a few pints and then go on Reddit. 😂😂😂😂", "She was a sahm, and from the way OP describes his story he probably left it all to her because 'he was busy working' and 'it was her job'. It could be that she came to hate being the all day/all night home worker, cook, maid, child minder to the point she couldn't stand it anymore.", "He offered her to have the son back. He doesn't give a shit as long as he doesn't need to look after him.\n\nAnd the boy is 11, not 1. Not like you can't have a business and an 11 year old child to look after, it just costs \"too much energy\" in OPs words.", "Exactly! And you get to play with your friends all day long after school?", "Going at 14 is different than going at 11. That is too young, in my opinion.", "Not everyone is American and cut off their parents when they move out.", "LMFAOOO, did you just read the reddit about the \"stepmother wanting to bring home her step kids from boarding school after she just found out she was pregnant,\" too? 😂😂😂", "Read that. Was a bit put off. Guys wife gets cancer so he puts kid into a boarding school, and wife dies within 2 years and he’s already got a pregnant wife? and now that the kid is settled and likes it he wants to pull him out to play ‘happy blended family’", "No no no no no. She wanted them to *bond.* In her experience, older siblings *bond* with the younger ones by *taking care of them!*", "lol I just read that one too! 😂😂 I thought this was guna be the dad to that story 🤣", "I really like the direction this thread is going. It could be good marketing for boarding schools.\n\n\"Boarding School: for when abortion isn't an option.\"", "Definitely an option abortion wasn’t my point.", "This is interesting.  Is there an article or something about this that I could read?  I couldn't find one by doing a search.", "A good portion of kids don’t have loving parents and boarding school provides support and structure. One of my good friends did have loving parents and she chose to go to boarding school and she loved it.", "Many parents are attentive or loving, but from my working class (childhood) and middle class (adult) experience the vast majority are not both.\n\nI scholarshipped into a boarding school for high school. Absolutely the most loving, enriching, and worry free months of my life were the ones I spent there. Home weekends and breaks were stressful. My parents were loving, but too attentive. At boarding school I lived with my friends and had professional counselors who noticed and helped with social problems.\n\nSome of my classmates would have been significantly healthier with parents who didn't expect them to be doctors or go to a specific university, but none were sad to be there.", "Have you been? I attended boarding school grades 9-12 and absolutely loved it. My parents visited regularly and I went home on weekends. The teachers, dorm parents and coaches were ABSOLUTELY warm and loving. I still maintain many of the friendships I made in those years, with students and teachers even now in my late 30s.", "Back in the dark ages when I was at boarding school, about 90% of the girls there were the children of members of the armed forces—who would move to a new posting every two years or so.  Rather than have the kids' schooling continually disrupted, they'd go to boarding school.\n\nNot just the province of the wealthy.  I mean, it is a \\*long\\* way from being the norm, and seriously, a 'beautiful country campus'?  Not in my experience.  It was fine, but it wasn't that!  (Sorry, that's really a reply to Appropriate-Fishies, not to you.)\n\nAlso, being raised by two loving parents is ideal.  Some of us were happier at boarding school than in a house with one very nasty parent and one who pretended it wasn't happening.", "I'm afraid you aren't correct. 6% of children in the UK are at fee paying schools. While only 0.5% of children are at boarding school. Boarding school is very niche choice in the UK. The media may portray it as common but most people in the UK have never even been in a boarding school, let alone attended one.", "[deleted]", "Oky-doke", "You're definitely not British, or you would know that 'public school' is the *poshest* school, and generally all boarding.", "So she abandons her child?", "You do not know how much I loved Zoey 101 as a kid", "I don't know about Madeline, but it is very obvious that JK Rowling did not go to boarding school.  She gets \\*everything\\* wrong!", "Omg me too. I read endlessly and reread HP about ten times over to escape my childhood.", "I read Mallory Towers by Enid blyton as a child, I was desperate to go to a boarding school because of it 😂", "Gotta admit, also not big on friends. I'd have most appreciated the books. Provided their library was on-par with that of even a public school, it would have been better than what I had at home.", "There is absolutely nothing wrong with calling your parents everyday as long as they live if this is what you and they are comfortable with. Judging others and their relationship with there parents for calling every other day is wrong.", "Abnormal behavior is a red flag, not a confirmation of an issue. I love my parents, but the only person I talk to daily is my SO. Calling your parents every day sounds like you may be lonely or depressed. Most people are more independent in adulthood. Good luck regardless!", "I couldn't help myself LOL", "is this a real post? If so can i get a link?", "Honestly thought you were kidding. What horrible people 🤦🏽‍♀️", "Again, we aren't talking about the entire population. We are talking about wealthy people. Again, there are many boarding schools in England and they are not empty. Yes, there are non English children that do attend but the majority are the rich English set.", "No it's just a pointless conversation to have how bad boarding school would be for anyone that never attended. Have you been to Iceland? No? Tell us all about it then. Do you speak Russian? No? Tell us how we can become fluent. 😒", "Getting a job is not being horrible parent. Wanting the other parent to actually parent half the time is not being horrible parent.\n\nOP demands that she either becomes sole care provider or kid go to boarding school, that demand is wrong in the first place.", "Now that they are divorced she probably has to work and can no longer afford to be a SAHP.  Either, way, they are both horrible parents and I feel for this poor unloved child.", "Maybe she is only able to support herself and not have a safe housing situation? Child support unless it’s from someone rich doesn’t really cover half or all the expenses children have especially if there’s medical or other issues the child has and particularly if a parent with most custody has problems with making enough money to maintain the basic needs like shelter. It’s possible OP is in a better position to care for the son but he’s not even considering the thought and maybe he’s the type who thinks only children can be raised by their mother. He’s very dismissive of the son. OP isn’t a reliable narrator so I don’t trust how much or what info he’s giving about the ex.", "https://reddit.com/r/AITAH/s/qMovG10Y3N\n\nHere you go", "I can't find the post anymore. Not sure if OP took it down; she was getting torn a new a**hole in the comment section 💀.", "Sadly, I wish I was. The post was very sad, and my heart broke for these kids. Their mother passed away tragically, and their father ended up remarrying years later. Before he even remarried, he sent the kids to a boarding school, got married while they were there, and once they had found their own sense of normal, wanted to bring them home, because their stepmother INSISTED all the kids be together. The children were in their teens, so they know full well what's going on. Seemed like the stepmother only wanted them back in the house as a family when she got pregnant and realized she'd need a village (which obviously shouldn't be the kids). The children were very upset and blew up on their dad and stepmother. I can't blame them honestly. I'd be having to have a serious talk w my father if I were them.", "If you are going to move the argument from \"in the UK for instance boarding school is the norm\" to boarding schools exist in England and some English children are educated there, then I think this argument has run its course. Have a lovely evening, but it is getting late here across the pond.\n\n (For the future, if you are going to try to argue with people from the UK about the UK, you might want to brush up on the difference between the UK and England. Using them interchangeably makes you look ignorant.)", "Are you in the UK?\n\nI am, and grew up wealthy, going to a boarding school. My kids are in one now.  However I went home every evening as did most of the other kids, as do my kids. They had beds to stay in for the occasional overnight or weekend while our parents were away. \n\nVery few actually lived there, mostly students from overseas. In my experience wealthy parents want to spend time with their kids.", "I can tell you from personal experience that you're incorrect. I went to a minor day/boarding school and a lot of families paid reduced fees- there were scholarship kids, those who had parents in the forces or in the church, people on the assisted places scheme... it was mainly foreign kids whose parents paid full fees. I had a 90% scholarship and my mum was able to afford the remaining 10% on a single teacher's wage. Going to private school is no indication that you're rich or well connected.", "[deleted]", "Their child is school age; there is zero reason she cannot be a working mom. They are both horrible people.", "Or maybe they are both just assholes who shouldn't bring children into the world that they are just going to dump when they want to do what they want. Condoms are cheaper than children", "Ok thanks for pretending like you know everything. Thanks for pretending that nobody but you knows what the UK is. No wonder the Commonwealth is fleeing.", "Of course, you missed the point. Of course.", "I mean, you do definitely sound like you know nothing about the UK, and doubling down on your arguments when given facts. You then project your own behaviour onto the people that have given you the statistics - \"thanks for  pretending like you know everything\". They're talking about things they know in this case, while you are not. Realising you can be wrong and listening to other people will grow your knowledge. You obviously like to think you are right, so work at it a little harder!", "[deleted]", "Have you been to boarding school in the UK?", "YTA...poor kid.", "YTA.\n\n I feel like you are leaving a lot of information out.\n\nSending your kid off to boarding school like that is your only option because there are no other options for working parents is ridiculous.", "ESH I hope you and your ex have both taken precautions to not procreate anymore", "YTA. Watch Archer.", " ultimately it is your son's decision. NTA unless your son is unhappy.", "Are you dyslexic", "ESH but the kid.\n\nYou all should have settled on 50/50 custody if neither of you can be full time parents. I don’t see why you agreed to allow her to abdicate all parental responsibility knowing that you weren’t able to take over.you guys are both the A-hole for making an unworkable agreement. \n\nAnd if neither of you can even take 50% then the kid is probably better off in a good boarding school, poor kid. And your ex is a double A-hole for wanting to bring the kid back knowing that he will be neglected in your home.", "Imagine bringing a child into this world and banishing him to boarding school for the sole reason because you need to concentrate on your busniess and don’t have time to take care of him. Imagine how this child will feel growing up with neither parents making time to actually be a parent", "Wow…YTA.  Way to put your son first.", "YTA- if you couldn’t take care of him yourself then you should have made better arrangements with your ex.", "What's interesting to me is that you're viewing this decision through the \"your convenience\" lens and not through the \"what is best for my son\" lens. What would your life be like if your son took precedence over your work? It doesn't sound like this is something you even considered. It sounds like you just decided to put him in boarding school and thought, \"That's taken care of,\" and crossed it off of your to-do list. I encourage you to rethink your life's priorities, talk to your son, ask him what he wants, and figure out other ways of parenting him. Show your son what a father can really be. YTA.", "You chose your business over your child. Of course YTA.", "Uuuuu esh. 11 is borderline casual of taking some limited care of themselves.", "Both of you parents are T.A ,but hey just ask your son in ten\nYears about how he felt about being shoved into a school were he spent every day at best being shoved around. At worst getting the snot kicked out of him by older students. Constanstantly living under high stress as he forced to follow the directions of complete strangers that only see him as a money source. That will constantly shame him for not reaching their standards and using his nonpresent parents disappointment as leverage.  And how he  got to grow up with the knowledge that his own flesh and blood put him there,not for the benefit of higher learning but because neither of them could be bothered to take care of their own kid. Have fun.", "YTA\n\nDid you not think about how you would manage being a single parent since you're apparently so busy? Why didn't you say anything when given full custody? Poor kid...", "YTA. Boarding school was 4 years of bullying, arrogant privilege, and crippling social anxiety.", "There is SO MUCH missing here. It doesn’t sound like your ex chose her situation.  Obviously, there is a reason a judge gave you, a man without an ounce of parental love for his son, full custody when your ex is the one to have taken care of him for the past 11 years.  YTA", "What does your son want? If he is a good candidate for boarding school—good student/loves school, meets new people easily, like challenges, has a well-rounded personality, has experience being away from home, has a strong sense of self, and can adapt to a residential lifestyle—this might be a good option since neither you nor your ex are interested in being the primary care giver. \n\nI might suggest taking a good look at the school you have chosen and determine what kinds of support your son will have outside of academics as well. If he’s introverted, you may want to pay extra so that he has his own room. This will allow him a retreat if the new environment is too stimulating. Do they have counseling services to help him adjust? \n\nIf it is a military style school, or if it has a strong history of athletics (and he does not enjoy these types of activities/is lagging in these skills) he may be miserable. If it is a religious affiliated or blue blood institution (and you are not a part of the mainstream there) he may struggle to fit in while learning new sets of rules. \n\nThese are just things to think about. You may be better off investing in activities he enjoys, finding local people to hire so that he has some supervision when you are out of town and just getting to know your son. He’s going to be an adult before you know it, and you will have missed out on parenting. Typically, people make concessions for their children during transition times.\n\nI wish all the best for your son.🩷", "yta  \"simply don't have time or energy\".... Most single parents have to figure out a balance, yours is to send him away.  \n\nThe kid is in school most of the day, So why didn't you get a housekeeper/nanny to help with non-school hours?\n\nYou created this child and you can't be bothered to raise him.", "Is your son happy at the boarding school?  If yes, then you made a good decision.  If you son is unhappy, perhaps bring him home and hire a nanny to look after him when you have to work.", "Thank god for boarding school. I was so happy to get away from my divorced parents, neither of whom could handle full custody of us. Leave him in boarding school!!!", "Yta:\n\nI say this cause kids are an 18-year commitment, and if you can't be bothered to raise the child with your ex, then you should give her what she wants.\n\nYour business is important, yes, but so is your child, and your child needs both parents to be there for him.\n\nA boarding school can't teach him the things his parents can, and just because YOU think it is a good place doesn't mean that it IS a good place for him to be.\n\nGrow up and realize that your child will hate you for this, and rightfully so.", "Hilarious no one seems to have asked the son what he wants. The way you speak about him speaks volumes of you (lack of) character. I feel awful for him having two completely self absorbed AH parents. Poor kid.", "YTA. FFS if you can afford a boarding school or child support, it means you can afford a sitter for the kid or even a full time maid. Or is it that you can't be bothered to spend time with him by earning the money you will take to your grave?\nHave you also considered that perhaps an 11 year old would be thrilled to start learning the business from his dad?\nYou should seriously consider a vasectomy.", "YTA.\n\nHe is eleven.  He is old enough to get on the bus by himself.  He is old enough to be trusted with his own latchkey.  You *offloaded him* because...thing?  Work thing?  Business thing?\n\n*Your son IS your business.*\n\nETA: I am walking this back *slightly* because I saw some of your comments.  But I am still letting you know that most likely your relationship with your adult son is going to be distant albeit cordial, if he goes to boarding school for the rest of his childhood.", "Yta\n\nThis is so sad to read . Like OP why did you even have a child?", "yrta dont have kids when you are \"too busy\"", "YTA, from a person who was dumped into a boarding school because the parents wanted their alone free time back.\n\nGuess who doesn't get contact or financial assistance now?", "NTA. Boarding school is such a great thing to do for a kid. Will help them be set up for a successful future. She can visit him", "Uhhh, you both fuckin suck. God bless your son, he’s definitely gonna need therapy.", "from the childs perspective ESH from the parents perspective also ESH. if you have enough money for boarding school why not hire a nanny or something", "YTA and a disgusting sorry excuse of a human.", "INFO: if neither of you can raise your son full time, why not split custody? This poor child, neither parent wants him.", "It really just depends on the quality of boarding school tbh. He’s 11, so pretty young to send them away from home but it’s not insane. Especially considering that he will be coming home on the weekend \n\nIf it means he gets a better education then it’s good. Considering you got full custody I’m going to assume there is some reason that his mother can’t take care of him, I won’t prod but it’s pretty difficult to get full custody. \n\nDon’t let your ex wife who doesn’t have full custody dictate things as important as education. There is a reason why you have full custody. \n\nI would make sure you let the school know this however, they might try to contact her by default instead of sending you.", "YTA \nPossibly so is your ex depending on what her reasons are. If she can't be a full time parent now, can she be a part time one? Can you share custody? If you can afford boarding school, you could afford a part time nanny if your ex can't contribute at all to childcare. Have you even asked YOUR SON what he wants?", "YTA Jesus Christ you chose work over your own son you do realize when he’s 18 he’ll probably never talk to you again right? Either that or he’ll stick you in a nursing home", "YTA but perhaps unknowingly?\n\nPerhaps you are perpetuating a relationship you had with your parents but both the way your write about your son and your actions seem to come across as cold and distant. \n\nYou absolutely do have practical responsibilities for your son and you seem to recognize that and have provided for them. You also have emotional responsibilities, to provide a loving and caring environment for him. He probably isn't feeling great about the disruption caused by the divorce and to then be shipped off to a foreign environment. \n\nPut it this way, you had two choices, spend the money on the school, or send him to the local middle school and hire an au pair / nanny to keep house and run him to school and back, and find an hour or two every day to sit down and have dinner and watch TV or play catch. Which do you think would   he would want and would help form a well balanced individual. You might be working hard on your business, I remember that well, but you can always find time for family. It doesn't have to be much and you can sacrifice some sleep to make it happen, but you won't ever get this time again and every choice you make shapes that boy. \n\nGet him out of boarding school and if you can't make the time for him, let his mother. Hell, I'll adopt him and save you the child support. Boarding school might not be a bad choice, for some it's a great choice, but for a kid that especially needs some family stability it seems like a bad choice.", "You actually read the OP. I only read the title and already knew OP was YTA.", "Yes! And he also can’t claim credit if the kid turns out great, starts his own family, and only sees dad once a year when he’s placed him in a memory care facility.", "By the way, the mom also sucks a lot. She had full and gave it up because the kid took up too much time and energy and she wanted to put her career first. Both parents are trash.", "Ugh or ick", "Doesn’t sound like she’s any better than him", "I really like the post that likened it to rehoming a pet that becomes inconvenient\n\nYTA", "He got full custody so he COULD send him to boarding school", "he comes home friday evening and i drop him off sunday night  unless there some sort off emergency", "He’s 11 years old, what does she even need to do to care for him? Plenty of parents work full time and still manage to spend time with their kids. He’s old enough to bathe and dress himself, entertain himself, and even feed himself snacks and microwaveable food. What exactly do you two do that school drop off/pickup and meals is so difficult?", "My god that’s insane….", "Stick to your guns. Boarding school bad but off to college good?\nThe alternative is what public school with a distracted “single” mom?", "OP, Clear up the confusion please and be honest - why did the judge give you full custody?", "I don't see anywhere that the op said she abandoned the child to pursue her career. He did say he got custody due to unrelated issues but didn't go into detail about what the unrelated issues were.", "It doesnt say career (unless i missed it in a comment) She could be sick or anything", "It’s ok. The Business will come and visit.", "Both.", "Just saw a comment that he doesn’t come home on most weekends, if ever.", "> The courts gave you full custody which is rare for fathers.\n\nMen typically get about as much custody and visitation as they ask for.", "hes not being shipped away hes like 30 mins away and comes home every weekend", "Whooooosh", "Yikes. 39-year-old UK boarding school survivor here, about to start therapy yet again (for the twelfth time in my adult life) to try to deal with absolutely any of the massive amounts of complex PTSD that place left me with, as it did just about every other person who was at that school with me. I have spent my whole post-school life fending off people who think that because it’s ‘posh’ or ‘rich people stuff’ or ‘in the countryside’ or ‘privileged’ or etc etc boarding school must be wonderful and marvellous and just like in the old children’s adventure novels they read or whatever. And I think sometimes at some schools it is like that - I have a friend who went to a pretty small and uneventful one. But a lot of these places are just hell on Earth - enclosed, tyrannical prison systems run by the sort of people who enjoy the idea of having total control over vulnerable children with no state oversight or accountability. And every child at my school knew that we were there because we weren’t wanted at home. Every single one. I’m not going to argue whether that’s ‘better’ or ‘worse’ than being a latchkey kid but it fucking sucks, and then you can’t even go home, because you’re not welcome there. /getting off my soapbox now, this post is not exactly about this issue, but I live for the day I see less romanticisation of these cruel and unusual relics of British Imperialism, which is really all they are when you get down to it.", "In that case, you still take care of your kid. I didn’t want to have a kid at 17, but that’s what happened. I’ve done every single thing I can for him and I would NEVER consider boarding school. “Not wanting kids” isn’t a good enough reason to treat them like shit and throw them away.", "I’m not sure, but it may be that she did all the parenting to this point. Even if the dad worked crazy hours trying to get the business going, the boy might see his dad since they used to be living in the house. His dad has left the marriage when the son is on the cusp of becoming a young man. The wife may not have anything for herself and thought she’d tag out for primary care only to have him play the Uno Reverse after “winning” custody in court.", "Because A. OP is the one who wrote the post and is present for people to yell at, B. the mom purposely giving up custody for her career is in a comment and not the original post (and you can in fact see a ton of people also being pissed at her in response to that comment from OP), and C. she at least has the slight excuse of having \"done her time\" as primary caregiver who previously majorly sacrificed her career for it compared to OP instantly tossing his son to boarding school. (Not to say that she isn't also a shitty parent, because she is, she just has an excuse people may be sympathetic to.)", "There's a comment where OP claims his wife didn't want any custody, so that she could focus on her career, after it taking a backseat for the previous 7 years.", "Got a source for that?", "If it is \"rare\", it's because men generally don't ask for it.", "\\> he stays at home \\*most\\* weekends and i call him every other night\n\nContradiction there. Is it every weekend or most weekends? (Or “some“ weekends)\n\nAlso:  \n\\>  I couldn't feasibly care for a kid full time while focusing on my business. So I made the decision to send him to a good boarding school\n\nSounds like the definition of being shipped away.", "my five bucks says that the ex wife became sick/disabled & that's why he left her & got custody.", "I thought about that post while reading this one too 😂", "Hey, it worked for Harry Potter, didn't it? I mean, other than the constant threat of death at the end of the year, but how likely is that, really?", "The \"most\" might mean he spends weekends with friends, mom, and other family members who live in the same place. Also his mom's a deadbeat who abandon him so his dad is taking care of him by himself. It sounds like this is for the best. Also maybe his old school sucked. Maybe the place was CRAZY underfunded and he couldn't thrive there. Maybe the school has a really good program he likes. There's literally a hundred reasons he might like the boarding school better.", "Wow bro! What did SK ever do to you?", "Yeah. I really hope that one was fake because it was fucked up", "It’s harder to be a single working parent when kids are in school. In my area, a school day is 6 hours. Most office jobs are 9 hours. That’s 8 hours with 1 hour lunch break. If you have to commute that’s even more time. It can be difficult to find part time childcare, and it’s expensive. Especially if the childcare provides after school transportation. Busses are not available for every student here. You have to live a certain distance away from the school. Parents working schedules do not qualify a child for the bus. The schools have aftercare programs, but many of them require waiting lists because they don’t have enough staff to handle a lot of kids. Added to that, is what to do if your child gets sick. They can’t go to school, they’ll get sent home. If you don’t have PTO you are losing money and can possibly lose your job. \n\n\nAll of this is exactly why my ex husband and I remained only 5 minutes from each other. We were able to put our personal issues aside to make sure our kids were fully supported by both parents and neither of us had to worry about losing our jobs if the kids needed someone at home, since we would trade off calling out. OP’s entire post feels like these parents need to work together. If mom wasn’t doing drugs, having mental health issues, or abusing her son this should not have escalated like this.", "It sounds like she was a stay at home but when they divorced she didn’t have anything like stable income or home to fall back on (and is a risk for when you’re a stay at home parent and the breadwinner rips the rugs  out) which likely is why he got fully custody and possibly he was able to throw his money at a good lawyer (how he talks it sounds like he’s well off especially compared to his ex). He glossed over her financial situation so I’m not picturing someone who is trying to rake in hundreds of thousands with some “hotshot” job but someone getting on their feet and trying to build some sort of life. He also doesn’t mention if she got large amount of money in the divorce that we could say she’s a bad spender. Like with a lot of OPs information that can make other people involved more reasonable is withheld, downplayed or hidden in the replies. And yes it’s possible they’re both horrid parents."]}