{"id": 29080, "submission_id": "179l8ot", "title": "AITA for arguing with bf for reaction at gender reveal?", "selftext": "AITA for getting mad at bf for reaction at gender reveal?\nI (F19) and my boyfriend (M26) are expecting a baby girl. We recently had a gender reveal party cause we were honestly just looking for a way to get the family together and have a nice time. My boyfriend always assumed that it was gonna be a boy, I always had to remind him that it's not 100% sure that it's gonna be that way.\nLong story short, at the reveal we found out it was a girl and he looked so…. disappointed. He didn't have an outrageous reaction but it totally killed the mood for me. I for one was really happy, I would have been happy either way.\nLater when everyone left I got really mad at him and we argued. He's on the couch right now and I'm alone in bed. I feel really sad but also really guilty.\nAITA?\n\nEdit: I couldn’t sleep so I went downstairs and talked to him. I apologized for yelling at him and he apologized for his reaction. He basically just said he really wanted a boy, but it doesn’t change how much he loves our daughter. I think everything is gonna be ok :)", "created_utc": 1697502221, "permalink": "/r/AmItheAsshole/comments/179l8ot/aita_for_arguing_with_bf_for_reaction_at_gender/", "score": 370, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I argued with my boyfriend because he was disappointed with the results of our gender reveal.\n\nI fear my actions may have been too harsh\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Gender disappointment is a thing both men and women can experience with a new baby. Most people move past it pretty quickly and it doesn’t mean they won’t love their baby.\n\nMy bigger concern here is the boyfriend in his mid-twenties knocking up a teenager. It’s a red flag for either stunted development or predatory behavior for men in their mid-twenties to seek out and shack up with barely legal women.", "NTA. Honestly OP you shouldn’t have hitched your horse to a 26 year old who can’t control his emotions. Enjoy the next 18 years.", "Your boyfriend thinks it's ok to get a teenager pregnant when he is closer to 30. His reaction to the gender is the least worrying thing about him.", "Wtf are these ages gaps man. What do you even talk about? The life experience gap is astronomical", "INFO: how long have you known your boyfriend?", "You’re a teenager. Don’t have kids.", "Gender disappointment is gross and so is a 26 year old making a baby with a 19 year old. This guy doesn’t seem like a winner.", "I’m only gonna say this; there’s a reason why a man nearly 30 isn’t dating somebody his age. \n\nIt’s bc women his age don’t take that stupid childish “am angy” from another grown ass adult. Emotionally immature men go after younger women bc they feel like they can get away w/ more.", "NTA but just ick at the age difference.  You were probably 17 or 18 and he was 24 or 25 when you started dating.  Then again he's still acting like a toddler.\n\nYou might start by asking him sincerely why he values boys more than girls and take it from there.  It's a horrible attitude and you can bet if your next child is a boy he will favor him over your daughter.  Not a good look.", "Your man is knocking up his 19 year old girlfriend and he’s 26… and you’re worried he had an immature moment? Lmao. Good luck.", "Do these boy/men not understand that that the man’s swimmers determine sex not the mom??", "This is why gender reveals are dumb.", "He’s a weirdo", "NTA but use 2 kinds of birth control from now on, because he doesn't want to be a father.", "19 and 26 🥴", "Your bf is TA for knocking up someone barely legal who I can only assume he dated before she was legal. That guy is with you because you're young and easy to manipulate, especially now that he has you trapped with a child with him. Run girl.", "You stole this from Tik and gender swapped it.", "Info: are you saying he had a bad reaction or just not a positive one?", "“I think everything is gonna be ok :)” I feel like you’ve said that a lot during this relationship considering the MASSIVE age gap, run. As a women expecting a baby girl, I couldn’t be happy knowing she’ll understand what that age gap means when she’s older… I felt the same way when finding out my mother and dad’s age gap. We’re in 2023, why is this still continuing?", "The gender reveal party makes all of you and everyone who attended, and maybe the baby, TAH.", "Have you ever seen pictures a meme: \n\nWhen dad doesn't want a dog. \nDad with the dog.\n\nSame energy. Don't hate me for using a dog as an example for your daughter. Because dogs also are lovely.", "ESH. The age gap is creepy. I’m 26 and the thought of dating a 19 y/o is yuck. You’re the AH because you don’t understand gender disappointment is a valid feeling and many parents (not just dads) get it. Maybe he could have pretended a little harder for the sake of the party, but his feelings are not abnormal. It doesn’t mean he doesn’t want to be a father, people commenting on this are clearly ignorant and not parents because they have no idea wtf they’re talking about and are speculating on an experience they’ve never had. \n\nY’all shouldn’t be having a gender reveal in the first place if you haven’t talked about reactions first. My husband and I talked about how we would react with either scenario (coming to a conclusion that it was important to be neutral no matter what) and made sure we were on the same page and comfortable before going into it because we didn’t want to have that “disappointment” in front of our guests.", "YTA for having a gender reveal party.", "NTA. His reaction is fine. Childish, but fine. Painting a picture in your head and the result is of something else does that to you. Him knocking up a 19 year old on the other hand?\n\nFor this they’d most likely been dating since she was 18… Maybe even earlier. So he’s a fucking creep.", "26 and he got a 19 year old pregnant?", "You are being groomed…", "NTA   I don't know why it matters to some men but it does for whatever reason.   He really should be very excited he's having a girl.    She just might be, \"Daddy's Girl.\"   \n\nMy dad was my hero.   \n\nThere are lots of Daddy's girls all over the world.", "Well I knew by the second sentence that we were dealing with a couple of dumbasses. Gender reveals are dumb as shit. ESH", "NTA. It’s only ever gender disappointment when it’s a girl and it is so disgusting to see. That baby girl deserves a father who is just as excited for her than if she came out with different anatomy. And the fact that he knocked up a 19 year old already says so much about his maturity level.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nAITA for getting mad at bf for reaction at gender reveal?\nI (F19) and my boyfriend (M26) are expecting a baby girl. We recently had a gender reveal party cause we were honestly just looking for a way to get the family together and have a nice time. My boyfriend always assumed that it was gonna be a boy, I always had to remind him that it's not 100% sure that it's gonna be that way.\nLong story short, at the reveal we found out it was a girl and he looked so…. disappointed. He didn't have an outrageous reaction but it totally killed the mood for me. I for one was really happy, I would have been happy either way.\nLater when everyone left I got really mad at him and we argued. He's on the couch right now and I'm alone in bed. I feel really sad but also really guilty.\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "So a 24 year old started dating a 17 year old and now you’re pregnant? Good lord; get therapy. This man is a predator.", "Let me tell you that we didn’t find out the sex with our first child, who was AMAB. We found out with our second, who was also AMAB. We were very happy with our lot, two beautiful babies.\n\nFast forward to now and we have a daughter and a non-binary child. And zero boys. And we still love them very much and are happy to see them thrive authentically. So all in all gender reveals *might* be pretty pointless (although obviously I am biased by our own experience).\n\nTo the point though, NAH. If he is disappointed then at least he has the opportunity to work on that before the baby is born. But also it’s totally normal to be frustrated that he isn’t elated by the news.", "Your bf is a walking red flag and youre too dense to notice.", "NTA, but all i was able to read is: Grown ass man babytrapped barely adult woman.", "You were 18 and he was 25 kinda bad", "NTA\n\nAlso... the math is concerning...", "Babies having babies… Gender reveal used to happen as baby is delivered.\nEverything needs to be complicated these days. Any event to pull at those purse strings goes. \nYou said he looked disappointed, not that he said it. Either way if he hasn’t come around yet, he will. \nYou guys are so young & there will be lots of things to worry about from now on. Congrats on the baby. \nNTA yet", "Not to cast judgment, but I really wouldn't expect the man who impregnated someone fresh out of high school to react maturely. NTA", "NTA, gender disappointment is gross.", "ESH\n\nGender reveal parties are actively harmful to gender diverse kids (and the gender diverse adults who are put through them). The inventor of the gender reveal party has literally disavowed them after the child she had turned out to be nonbinary.", "Why are gender reveal parties a thing even?", "ESH", "What an immature boyfriend. He is a grown 26 year old man that cares whether his baby would feed into his male dominated mindset? What a horrible situation.", "Neither of you are the asshole. And it’s also gonna be okay.\n\nBoth my Mrs and I were stunned when we found out that we were having a girl. She was so sure that it would be a boy (based on nothing but old wives tales really). Revealing the gender also makes it real and brings up a whole load of complex emotions. But as soon as she was born we just loved her immediately.\n\nYou’re gonna be fine. Best of luck, hope it all goes well.", "the age difference is a bit off putting for me.", "Glad you two made up.  Congratulations having a wonderful baby girl on the way!", "26 and 19? Oh girl. I hope everything goes okay and not how I think it will. But NTA. It comes from an internalized misogynistic place when men don't want daughters. It's something he needs to internally reflect and work on.", "Everyone here is not answering the damn question and it’s pissing me off. First of all you are a legal adult and he is too. The age gap is not that bad (7 years both my father and step father had a 5 and 8 year age difference respectively when dating my mother) and even if the age gap was a big deal it is not our business to judge. As far as whether or not you’re TA for arguing with him about it, I’d need to get more information about how you started the argument and how aggressive you were initially. Being upset at him for being visibly disappointed after it was revealed to be a girl isn’t unreasonable, but it’s also not unreasonable for him to disappointed that he didn’t have a son, many men want sons just as many women want daughters. If he loves his child all the same then it doesn’t matter. I’m gonna say nobody was the AH in this situation, but you two should probably shouldn’t have done a gender reveal party in the first place", "OP, you got your answer. Good.", "YTA. Anyone who does a gender reveal party is a self obsessed AH.", "NTA.", "This is why gender reveal parties are stupid.\n\nYou had a stupid fight over something neither of you really had any control over.\n\nGo back to finding out from your doctor and then not telling anyone.", "Gender disappointment is real, and honestly valid. My parents struggled with infertility and had me, a girl, and my dad was disappointed at the time because he wanted a son to play soccer with and do “man” things. He never made me feel less loved or wanted. We still play soccer together, and he’s teaching me car things. It was a feeling in the moment but he says he wouldn’t trade being a girl dad for all the sons in the world", "Red flags to that age gap…", "Redditors so toxic.  He wanted a boy, let him pout a little.", "You're NTA and if a grown man nearing 30 is disappointed, imagine how he's going to treat her the rest of his life.", "YTA to yourself and your future daughter for being with this misogynistic guy.", "NTA If he is disappointed, he only has himself to blame. He should brush up on his biology.", "It's ok for him to be disappointed. It would be wrong from him to hold that disappointment. I'd say give some grace and see if he works on it!", "YTA. Gender disappointment is a common outcome when having a child. It is understandable to get disappointed by something you have no control over. Also YTA for having a gender reveal party.", "The fact that you both communicated with each other is a great sign. He will absolutely adore your daughter. I was very upset when I found out I was having a boy. That disappointment faded quickly tho, and I absolutely fell in love with him. He’s almost 12 now, and we’re besties lol. But I can’t imagine *not* having him, my little boy. \n\nHe will love her so much, and I guarantee you, he’ll look back and think, “I can’t believe I was ever disappointed”. I promise.", "Nta but neither is he either. He got himself excited for a boy and got disappointed, its not the end of the world and I'm sure he'll be a great dad.", "Really sick and tired of these comments suggesting their relationship is somehow sick or the boyfriend is mentally screwed up because he’s with a 19 year old - from literally just hearing the ages people make such horrible assumptions and its just painful to read, this subreddit is jnsanely toxic about certain things. OP please be careful of that.\n\nFor the actual situation and question, NAH. I’ve seen multiple mothers and fathers both be disappointed at gender reveals when expecting/hoping for the opposite outcome, its not that big of a deal. (of course this changes if a negative attitude continues) I understand the frustration and wanting to discuss it but getting angry and yelling about it isn’t the best course of action here. Like you said, he didn’t overtly make a scene or anything, you both just need some time to cool down and then you can continue making plans for your life and family together :)", "Yta he's allowed to be disappointed . You're mad at him for feeling a certain way.  I will also say it's his first initial reaction to news he wasn't expecting.  He really  hoped it was a boy so when it wasn't he was naturally disappointed . That doesn't mean he won't love her or bond with her it's his first reaction to the news .  Before I had my son I had always wanted a little girl . When I was pregnant 9 hoped and told myself it was probably a girl.  So when I found out it was a boy I was a little disappointed . After hearing the news I moved on and looked forward to meeting my little boy . Then when he was born I couldn't imagine being anyone else's mother.  You're literally mad at him for not reacting and feeling the same way you do dude . Think about It .", "This is the point of any gender reveal. If the gender didn’t matter, then people wouldn’t have them.  \n\nYTA", "Yeah I don't really care about his reaction to the gender reveal. I'm more concerned and confused on why he decided to knock up a teenager and let her make him sleep on the couch.", "I'm gonna say the whole couch thing is a red flag for me...", "He is 26 and he knocked up a teenager. I don’t know if you were 18 or 19 at the time. I say this with love and kindness, please consider getting out of this relationship.", "When are people ever going to wise up and realize how asinine gender reveals are.", "Mild YTA for getting mad at him.", "No AH but lots of really dumb people. Just don’t have a gender reveal if there’s any chance of gender disappointment", "We can’t know if YTA or NTA because we do not saw your boyfriend’s actual reaction. If he just was disappointed only when the announcement came probably YTA because he was expecting something too much that did not turned out the way he wanted. It’s not misogyny or anything like that… personally, I’m a male but I would like to have a girl, thus, if at a gender reveal party came out a boy I won’t like jump on the pool celebrating or seem very excited😅\n\nOn the other hand, if he was disappointed for the rest of the party and showed that too much, then NTA", "YTA.  People from a very, very young age have a “picture” of their family, of what they’re going to do with their kids, how they’re gonna spend their time looking after them, and in one moment that mental image is shattered and they then have to put together a new image based on a coin flip.  Now throw in there that the male partner is responsible for that coin flip, and you’ve got a recipe for a minor mental crisis as their brain tries to re-draw that family picture and all those “hobbies” they were going to share with their child while simultaneously feeling guilt, particularly if in the run up you’ve both been talking about your preference of outcome.\n\nNow, reality is that the kid’s picking the hobbies anyway and best hope you’ve got is helping them in a given direction, but you slowly come to terms with that as you move through their childhood.  It isn’t a one-move shatter like gender disappointment.\n\nDon’t listen to anyone that tries to wag a finger at misogyny for this, just remember as well for blokes it’s a whole new set of skills they’ve got to learn from as stupid as “don’t wipe forward” to “how does this go in?”.  It is massively daunting.", "The real issue here is how the first thing you do is go to reddit to ask for opinions.", "Real time double standards at play folks the comments here  are different from the [ones here.](https://reddit.com/r/AITAH/s/uhNF3vHwO6) gotta love misandry", "Remember the good ole days where you found out the sex of the child through child birth ✌️\nETAH", "Upvote for happy ending.", "So, what you’re saying is someone you love was genuinely disappointed about something, but didn’t make a big deal out of it. \n\nYour response was to pick a fight with that person, because you weren’t disappointed. \n\n…", "Buckle up buttercup you fucked the wrong prick", "Glad you've talked it out.  I think sometimes you get in your head what you think you are going to have and you do get a bit disappointed if it's not what you were hoping.  We didn't find out the sex in advance and I think I was a bit disappointed with my 1st and I was REALLY set on what I wanted for my 2nd and I'm glad it worked out.  I knew ultimately I just wanted a baby and didn't care either way, but definitely had a preference.", "Don’t have a gender reveal if you even think you might look disappointed, or you have your expectations up for one gender over the other. People should only have these parties if they will be genuinely happy with whatever gender they get. Your child will get to look back at this moment and realize how disappointed her father looked. That’s just sad. You’re NTA for being annoyed with him, I would be too.", "This might be why a public gender reveal is a bad idea.\n\nWe had twins.  We had two girls, and didn't know what gender they were until they were born.  My husband really wanted a boy.  When the first one was a girl, he later told me he knew they were both girls.\n\nHe was so excited when they were born he didn't care what sex they were.  That's why it's best to be surprised.  You just look at your own baby and are thrilled.", "NTA", "Hold up, someone explain this to me, why didn't the parents of the sone to be born baby not know the gender before hand? Isn't this one of those things that you know before you do it and the reveal is for all the family members so none of them can complain about not being the first to find out?", "esh for having a gender reveal party\n\nyou can't complain about having a bad reaction - when a gender reveal party implies gender of a baby matters (it doesn't), literally just have a party without the reveal part. also reactions are natural and can't be avoided. or have the reveal be a reveal for everyone else excluding you and your husband who already know.\n\nthe comments also esh. two consenting adults but ageism prevails.", "Gender disappointment isn’t healthy just because something is common doesn’t mean it’s normal r@pe is common doesn’t make it a good thing it’s weird to have any preference on your baby’s genitals it’s weird imagine genuinely being sad because your baby doesn’t have the genitals you wanted that’s weird", "The dude is 7 yr your senior. You’re a teenager who’s knocked up. Unless y’all rich, you have much bigger things to worry about than the dudes reaction. Good luck in life after the rosey glasses wear off", "lmfao you got pregnant from a grown ass man meanwhile you're still a kid", "NTA  \nThe sex of the child is determined by the male sperm. So all questions about this matter should be addressed to the future father.", "Gender reveals should be over by now. \nAnd why is a 26y/o with a 19y/o?", "Let’s break this down…\n\nHe’s mid-twenties and got a teenager 7 years younger than him pregnant - that’s a bit predatory.\n\nHe was so desperate for a boy that he killed the whole mood of the gender reveal when he found out it’s a girl - there might be some misogyny bubbling under the surface there. \n\nHe’s happy to act like a moody child in front of your guests - what will he be like when the baby comes? What’s he like behind closed doors?\n\nI’m really glad you’ve resolved this with him. I hope so much that you manage to make this work with him for the sake of your baby. ESH - him for all of the above and you for enabling it all.", "You're possibly only an asshole for having a gender reveal in the first place.  Those things are out of control. ;)  Good luck!", "i’m so sorry girl but you are a victim.", "How uh… how long you been together for? Just curious….", "Nta good luck to you you’re gonna need it", "Your kid could be transgender, sex reveal doesn't equal gender forever. Either way, here's to hoping for a healthy kid!", "Wait what? Gender reveal party is for parents to reveal the gender of their child to family and friends. Parents find out at doctor's appointment...", "Why is a 26yo with a 19 yo and having a baby? Good grief. Esh", "Having a baby with that age difference might be rough", "NTA. Why the fuck does the gender of your child matter? Its fine to have a preference but to get disappointed at the gender of your child even for a little bit is so weird to me. You should be happy no matter what if you want a baby, a baby is a baby, gender should not be important. Can we also talk about the bigger issue here that she's 19 and he's 26 and their expecting a child together, so most likely they've been together a few years...", "Sketchy enough that he's 7 years older than you and you're not even of legal drinking age (in the US at least). You might say he apologized and everything is gonna be okay but that doesn't guarantee it will be. My ex husband had the same type of reaction when he found out his first born was a girl. He had been so involved in the pregnancy up until that point. Once he found out it wasn't going to be an heir to the throne so to speak, he basically ghosted me as much as one can while still living together. Be watchful and don't make excuses or try to rationalize when he's being shitty. If he really means sorry and keeps being there for you, great! But please don't make your little girl witness the trauma of an unhealthy relationship before you get sick of his shit if he's not.", "why you feel guilty? He is the person who should feel sorry about everything he done !", "those red flags are long gone. 26 and having a  child teenager is worse than the reaction", "Naaah don't worry about the age gap! My sister was 18 when my 29 year old boyfriend got her pregnant, it's all totally above board and not concerning at all in my family! /s\n\n(That really did happen the way I wrote it, by the way 😂)", "A 26 year old should either keep his disappointment to himself at a gender reveal or not have a gender reveal party. He's a baby himself.", "Gender disappointment only ever seems to happen when the baby is a girl, it’s just misogyny", "Now he has to worry about his own daughter getting knocked up in her teenage years by mid-twenties creep. :(", "Cheerfully disagree on the age gap - they’re adults. My SO is 11 years older and we’ve been together 25 years so far. May be unusual but not necessarily such a red flag. As long as people are consenting adults and happy!", "Teenager? 19 year old is considered an adult in civilized world", "They are both adults in a relationship they both consent to. What's a concern is that you infantalize an adult. She is capable of choosing who she is in a relationship with.", "I agree with this, the guy doesn't exactly sound like father material", "Can't wait for op to eventually say she's fine because they've been together for since she was 16 or something, not realising how much worse it will sound.", "don't blame OP for that. when you're that age someone that much older showing any  interest in you makes you feel special and flattered.\n\n&#x200B;\n\nas you get older you realize how creepy and predatory it is.\n\n&#x200B;\n\nhe's been a fucking predator from the start.", "There’s a big difference between 26 and 30. You could round anyone’s age to make it look more appropriate. \nEither way they’re BOTH too young to be having a baby and they barely know each other.", "Agreed", "Why are you rounding up like that? I can round up too: he is in his mid twenties, by the time she gives birth she will be in her early twenties. They are both adults in their twenties.\nYou can even say that his brain has barely finished developing.\n\nIn a couple of years, their age difference won't be a problem anymore.\n\nThe problem is not the age gap, but the fact that she is having a baby at 19. No one should be having a child so early. A teenager doesn't have enough stability, maturity or life experience to have a child. It's best to wait AT LEAST until 25.", "Imagine raising a kid at 19. \n\nOnly thing I could raise at 19 was my dick and even then that wasn’t a sure thing.", "I’ve known him for around 2 years dated for a little under 2", "Little too late lol", "Every fucking time, massive age difference and the guy a total fuck up.  Like I know it a bit common but I swear at some point people are doing it to just farm upvotes.", "Omg foreal. I cringed when I read their ages.", "I can’t believe parents can already find something “wrong” with their kid while it’s still in utero. Really telling.", "My first thought. His age coupled with his reaction- somehow this tracks.", "“Gender disappointment is gross” 😵‍💫\n\nDisappointment is a natural human emotion and often involuntary. Don’t be so judgmental", "I don't understand you Westerners you make the rules about age then when someone follows it you be like \" ew gross 26 yr with 19yr \" it's not even that big of a difference wtf I've seen 50yr with 18y quite alot of times and no one says anything except on reddit 😂", "Ya you’re right, the age gap is gross. She’s probably taking advantage of him for his money.", "Nearly 30... Yeah, no. There is a huge difference between 26 and 30. I was nowhere the adult at 26 as I was at 30.\n\nUndoubtedly at this age their difference is huge though. Even when he just turned 26 and she is almost 20, 6 years at their age is a big gap. Heck, I'm 31, but dating a 25 yo girl/woman is not something I hold as really realistic.", "Ngl guys you are just ruining their relationship for no reason. They have a baby together now it's none your business writing stuff like this you want the baby to be fatherless? Just shut up then.", "I don’t think conversation will get this couple too far. \n\n19 and 26? Christ..", "He's a 26-year-old who got a teenager pregnant. I'm guessing there are a whole lot of things that he doesn't understand and is a miserable, childish wretch about.", "Anyone can feel gender disappointment. Why does it matter who’s biological ‘fault’ is?", "At least they didn't burn down a forest or some shit.\n\nESH", "And a predator", "Are any AITAs real?\n\nRemember when Reddit posts used to be verified? Or when people weren’t downvoted to oblivion for differing opinions?\n\nThe fuck happened..", "Some people do anything for upvotes", "Definitely not positive and I’m definitely leaning towards negative cause he was moping for the rest of the party.", "Agreed. \n\nGender reveals are lame as hell. Usually attention-seeking and not even about the child.", "OP already fulfills that role.  Ugh.", "Having any gender expectations is so odd to me. Why get your hopes up when you know how it works", "There are plenty of videos of both men and women being disappointed to find out they're having a boy. Gender disappointed is real and, as long as the people can get over it by the time the kid comes, it's OK. The fact that a 26 YO is impregnating a teenager is definitely a red flag", "Not true. I knew a couple with 6 sons. One of those sons had a daughter and her grandparents, father and uncles all were ecstatic and pretty much worshipped her. She was their third grandchild.", "So weird that people insist its only girls. My husband and I both desperately wanted a girl and it took a little while to come to terms that we were having a boy. We are now both excited, but part of my journey included joining a support group online for moms with gender disappointment with *only* boys and it had tens of thousands of members. The group was super helpful in getting me excited to be a boy mom, but it's definitely a very large group and lots of talk of how their partners wanted to have little girls too and that contributes to their disappointment.", "Gender..diverse..?", "Even the person who came up with the idea has come out saying they regret creating the concept", "Yah the lady who started it did so bc she had a terrible fertility journey and lost a few babies before finding out their gender.\n\n\nSo when she finally had a viable pregnancy and found out the sex of baby, they had a big party to reveal.\n\nVery wholesome, has devolved into this shamozzle.", "People should just stop putting their ages on posts because the Reddit hoard absolutely loses their mind when there is an age gap especially if it is a younger woman and older man. The whole discussion devolves into the same old tired arguments that don’t matter in the real world.", "Nah. You're having a kid, you sign up for the whole fucking thing. It's actually *not* okay for him to be disappointed. he'd better fucking get over it ASAP.", "I think this is totally false, the gender of the baby should be irrelevant, I guess the whole idea of a \"gender reveal party\" is lame in the first place.", "They started dating when she was 17 and he was 24. She was still in HIGH SCHOOL. This is predatory and disgusting.", "Hoping it is one gender over the other to begin with is a problem", "Actually to me that makes it seem a lot more balanced a relationship than the ones screaming abuse are pretending it is; if they’re equal enough in this relationship that they can argue as equals and he can end up on the sofa despite being this horrific predator people are pretending he is… he doesn’t scream of it to me.  The predator would have had her on the sofa.", "Everyone in those comments are saying she is creepy?? What point are you trying to prove?", "Jesus…I had to re read this, but wow. That’s awful all around.", "Go over to the pregnancy sub reddits. The gender disappointment post are fairly evenly split.", "Not true: a friend of mine wanted to have a girl and was very disappointed initially when the scan revealed it was a boy.", "Don't think this is necessarily true but seems extremely common in men when the baby is a girl, which is likely underlying misogyny.", "Nope - I wanted a girl.  Have several boys (that I love and wouldn’t change for the world.  But my gender disappointment was very real. As was my partner’s.)", "I was depressed for months when we didn’t have a girl. There’s sexism here… but it’s you", "Actually a guy friend of mine talks frequently about how he really hopes he'll have a daughter. He dreams of being a good dad and works at doing the work he can before any pregnancy occurs. Part of it has been that he does self reflection work on unpacking that having a son would be as fulfilling as having a daughter.\n\nI think people just associate particular experiences more with one gender than the other. Foolish to do so if you ask me but ranting bout gender roles isn't relevant right now.", "My Mom's best friend has 4 boys because they \"kept trying for a girl\" it goes both ways", "My aunt. Three boys. She sobbed for hours. She had only ever wanted a girl. Three back to back gender dissapointments.", "I don’t have kids yet, but deep down I really want a daughter. I just have always pictured having one first. If it was a boy, I’d be sad at first. But I’m already talking to my therapist about how I would prevent these feelings from treating my kids in different ways. We aren’t even going to start trying for at least one or two years so at least I have that going for me lol", "If you spent some time in any of the pregnancy related subreddits you’d see how wrong this statement is. There are many, many people who hope for girls and experience disappointment when it’s a boy.", "I absolutely love being a father to girls. The days of them wearing poofy dresses and letting me French braid their hair are over now, but we still find ways to have a lot of fun. Guys are missing out if they’re upset that they have girls instead of boys.", "First off, this is completely untrue. Where is your evidence that it happens with majority girls? It’s clear you’ve never experienced it so stop speculating. \n\nSecond, I am a woman. I had gender disappointment with my daughter. It is a perfectly normal feeling to have. If you’ve ever been pregnant you would know that from the moment you find out you are pregnant you have this picture of your baby in your head. It can go either way, and when you find out the gender of your baby is the opposite of what you’ve been imagining, it’s normal to feel some disappointment. \n\nI was scared to have a daughter, scared because I value woman differently than men. Scared because it is likely my daughter will face challenges in her life for being a woman. She will face sexual harassment, she will be silenced in the workplace, she will experience heartbreak in a different capacity than a man, she will have to deal with periods for gods sake!! I understand these struggles, I went through them. I still face challenges as a woman. \n\nBut I would NEVER change my baby for the world. It took me only a matter of days to get over the initial disappointment and after I had her, I never could imagine anything more perfect. I actually feel like I would be disappointed to have a boy as my next baby, because I love being a girl mom so much. \n\nStop making normal people feel crazy and horrible for feeling normal feelings!!", "That’s just not true at all. Plenty of people get gender disappointment when finding out about their baby being a boy. Especially if it’s boy #2 and there’s no third chance. Head over to any of the parenting subreddits and you’ll see the proof for yourself. \n\nDon’t look for sexism where there is none. That’s playing the victim.", "Nah, I'm  pregnant right now and would have been mildly disappointed if it was a boy.  Of course I would of gotten over it quick.", "How can I roll my eyes even harder", "Seriously? I've known tons of women who were depressed when they weren't having a girl.\n\nETA: my SO was visibly upset when we found out baby #2 was a boy. He had a sort of trauma from being a boy raised by his father. He didn't want history to repeat itself.", "Not true/accurate", "You heard about what used to happen in China and decided to paint everyone with a brush. Irony", "Not true. I was very disappointed to be having a boy.", "This is a lie. I've seen multiple videos of women being very very disappointed they were having boys. It's not misogyny. Everything isn't based in sexism.", "No, I hate the idea of parenting a boy so much that I think I'd be devastated and struggle to love them + would HATE my time as a mother. \n\nI've chosen to remain childfree and this is one of the many reasons why.", "You went through some Olympic level mental gymnastics to come with this stupid affirmation", "This is such a bs statement.", "Completely disagree; attributing it to misogyny is just lazy and toxic feminism.  I would be disappointed to find out that we were expecting a girl - probably not to the extent of it being particularly obvious, but it would be there.  Mainly because I haven’t a Scooby Doo what to do with one, and in the simplistic words of a friend “with a boy you only have to worry about one penis, with a girl you have to worry about all the penises”.  What to do with him is simple, so, so simple.  Both myself and my partner are in absolute agreement that a girl would puzzle us.", "Clearly you’ve never been part of all the gender disappointment posts on the pregnancy sub", "This is nonsense. I locked myself in the garage and cried when I found out one of mine was a boy. I was convinced he would be a girl and was so disappointed. Thankfully it only lasted a day or so but it wasn’t pleasant. \n\nBeing pregnant is very strange sometimes.", "He knows how he feels about women and he sees the future", "Ha!  Wrong.  I had a girl and twin boys, and I wanted a little girl during my last pregnancy.  So did my 9 year old daughter, who did a little homework upon finding out at the ultrasound that she was to have another little brother.  (She announced at the dinner table the next night that she had learned how a man's x or y chromosome ultimately decided the sex of a baby, and she was never talking to my husband again.  She even stuck to it for a few days. 🤣)\nWhen my youngest son was born, we immediately fell in love, and we're still ashamed that we ever wanted him any other way.  He was exactly what our family needed, and he and my daughter are best friends in spite of their age difference.  But the disappointment definitely works both ways.", "What the hell are you talking about plenty of people are disappointed they don't get girls. You're the only one being sexist here", "Men tend to want boys women tend to want girls.  You sound fun 😬", "If you found out your first time out on parenting was going to be on Hard Mode, some disappointment might be called for", "My dad was really disappointed I’m not a girl. Not saying misogyny doesn’t exist, but your statement seems to be an exaggeration.", "I mean, I (42M) wasn't disappointed, but I wanted a girl first and a boy second. Got what I was hoping for. So, there's definitely people hoping for girls out there.", "I had gender disappointment with my second son as I was convinced he was going to be a girl. Lasted all of 30 minutes and then I was choosing names and completely excited for him.", "I found out the gender of my kid at birth. I was disappointed but got over it and I love my boy so much :)", "My grandma had 5 boys and all she ever wanted was a girl. She ended up with only one dil (my mom) that didn’t give a shit about most “feminine” stuff and for\ngrandkids, first a boy, second tomboy chapstick lesbian, and third non binary asexual that did like dresses for awhile which was a win for me and briefly for her.", "My mam really wanted a girl, with the thought that it'd be swell having an older brother and younger sister as siblings. Was disappointed to find out I'm a lad", "Not true. I can think of several women off the top of my head who initially had gender disappointment with boys.\n\nYou're right that misogyny can be a driver, as can just a general sense of a parent thinking they'll relate better to someone of the sane gender.", "It's often the case, but even when it's the opposite, it's still just sexism.\n\nThe whole gender expectation that isn't fulfilled is always about very gendered roles. About an idea of who, personality wise and hobbies wise, your child is going to be based on their genitals at birth.\n\nIt's an archaic vision supporting traditional gender roles and upholding sexism throughout society, and I'm not surprised a 26 year old grown man impregnating a 19 year old girl thinks this way. Sexist all the way.", "It doesn’t.", "Naw, they originally thought I was a boy for some reason and my dad was bummed because he already had a boy and wanted a girl next for variety.", "I literally just read a post about a woman who had 6 sons whose husband was very disappointed she \"couldn't give him a daughter\"", "Its amazing how crazy other people are about age gaps here, look at all the downvotes lol", "They were not both adults when he decided to prey on a minor. She said they have been dating since she was 17.", "He's a 26-year-old who knocked up a teenager. What was your first clue?", "She’s 19 and he is 26, I doubt they have done minor home repair with eachother yet. She is betting on a total wildcard with selecting this guy to be the sperm donor. \n\nAtleast her credit will survive the oncoming break up.", "Wow yall are some misandrist.  Because he was disappointed and had emotions that makes him a bad dad?", "there’s a big difference between people within the same relative age group in school and a relationship between a graduated adult man and a girl who become legal only a year or so ago 🤷‍♀️", "He groomed her. He's a man in his mid twenties impregnating a teenage girl, he met her before she was even 18.", "The problem is absolutely the age gap, he groomed her. They started dating before she was even 18, he was already well into his 20s.", "Heck I’m in my mid 20’s and can barely raise myself outta bed😂\n\nLiterally own a shirt “namaste in bed”🪷", "He groomed you and now you're pregnant. Please talk to a therapist about this situation.", "So you’ve known/ been with him since you were 17? Hun, i know age gaps aren’t really a big deal when you’re older; but please take it from someone who’s 27, your boyfriend not only is doing something morally disturbing it’s also illegal in a lot of places if not most. Your boyfriend is a predator, there’s no really nice way of putting it. You may have a nice relationship and feel like you’re on cloud 9, but it’s because you’ve been groomed since you were a minor. Please trust me that no morally intact 24 year old person is going to want to date a 17 year old. He’s with you because he likes young women, not younger women, young women, minors, kids! You were a child! He knows it’s wrong and it’s disgusting. He’s not with someone his age because it’s easier to manipulate someone so young into being with him by making them feel so mature and special that an adult wants to be with them, than actually finding someone his own age to be with and being a mature adult. \n\nOP, please be honest, are you safe? Is this what you want forever? I know it’s too late not to have his kid, and you can coparent, I know you probably love him, but he doesn’t love you for the right reasons if at all, and I’m so sorry there’s no gentle way to really put all of that. Please do what’s absolutely best for you and leave him, talk to a therapist about the whole thing and really let everything out, none of it is your fault, go somewhere safe and where you’re properly loved. \n\nHave a good one OP, I wish you the absolute best", "So you were groomed. No 24yr old has good intentions dating a 17yr old.", "19-2 is 17, I'm pretty sure that's illegal bro", "Yiiiiikesssss…", "So you were 17?", "Apparently, this post was stolen from a TikTok, but with the genders swapped. \n\nHonest question, what do you get out of posting fake stories?\n\nIs it attention? Or maybe validation? I’m not even throwing shade at this point. Just curious.", "If there is a 50% chance you will be disappointed, maybe don’t have a party???", "lol gtfoh with your sexism, what 26 year old has money, he probably wishes he does.\n\nIf anything she's probably being taken advantage of because she's younger and therefore more naive and easilycontrollable, that's usually the way these things go, but go off.", "Yeah, that’s the one", "they don't argue he gives her a time out 🤣🤣", "I noticed that too recently 🧐 da heck. If people wanna post fiction there should be a separate subreddit for that. Fictional am I the asshole or hypothetically am I the asshole\n\nFAITA/HAITA\n\nJust saying", "You need to run. As soon as that baby comes out he will only get worse. Sweetie you were groomed. How old were you when you *met* this guy?", "Goo...gle?", "Yeah like being transgender, including nonbinary", "I agree.  Their argument *may* be valid in some cases, but stop projecting it onto every single post.  Where was the condemnation of the 40-something woman living with the 20-something me?  Not everyone is Jimmy Savile, sometimes a woman (and at 19, you are a woman in every measure) is more mature than her peers and the 26 year old man is less mature than his peers.  Many of these couples go on to lead happy lives.", "A clear example of another person who has never had a relationship at a young age and is basing their judgement off of media crap.", "Uh ok. I said what I said it doesn't change because you and other ppl  on reddit think it's a problem", "If their relationship was equal then neither of them would be able to make the other sleep on the couch. I do agree that the fact that she somehow kicked him out the room shows he's not predator or a threat to her.", "Can confirm. Judging by how fast my parents got to work on having another kid, my sister is only 11 months younger than me, and how much they shamelessly favored her it's pretty obvious they just wanted a girl.", "This was me! My oldest was born afab and I wanted my second to be girl. I found out the gender as soon as I could so I could experience the disappointment and work through it before baby came if it didn't happen to be a girl. It worked out great for me and I was very excited to welcome our little boy into the world. Several years later and now I have two boys and can't be happier, they are great kids!", "True. It probably has to do with the mental picture that the expecting parent builds over a few weeks, if not months.\n\nThey visualise themselves doing things with the child (girl or boy) and then in an instant they have the rug pulled from under their feet. There are of course exceptions, but boys and girls will be drawn to different things.  For example, [boys tend to enjoy roughhousing](https://www.fatherly.com/parenting/why-boys-like-roughhousing-fighting).\n\nThat’s why it’s probably wiser to not make assumptions about the gender until you know for sure. Or try to visualise both possibilities until you know.", "I'll be honest. For some stupid-ass reason, I had myself convinced from the age of 16 I'd have a girl. I had a name picked out and everything. When I actually got knocked up, and the ultrasound tech said it was a girl, I wasn't even surprised. Just assumed I'd been right. Went out and bought a few cute girly outfits.\n\nFinal ultrasound at like 8 months and they told me no, that's definitively a boy. I was disappointed. But less, I think, that it was a boy and more that I'd been such a dummy. And that I now had less than 4 weeks to pick a name. \n\nBut yeah, it happens.", "It definitely happens both ways but are we actually going to pretend its roughly even? Most people in the world would rather have a boy. Hell, when China had a 1 child rule it created a huge gender imbalance because folks didnt keep the girls \n\nIts true that gender disappointment can happen any which way but its also true that a lot of it is misogyny\n\nAnd the 25yo who just knocked up a teenager is probably in that subset lets be real", "Lots of *anecdotal* evidence in the comments but there’s [plenty of research](https://www.nber.org/digest/oct04/do-fathers-prefer-sons) demonstrating that overwhelmingly parental bias skews misogynist. Also here’s a bonus fact: [reverse sexism](https://feminisminindia.com/2018/05/10/debunking-notion-reverse-sexism/) doesn’t exist.", "Depressed for months? What is wrong with you?", "And you actually!", "All I can think of is the mom from Malcom in the Middle. It was SO messed up that she didn't get a girl. Its a fictional TV show! They couldn't cut her character a break??? For those who don't know the show, she already had 4 boys and then had a 5th.", "That doesn't sound like dissapointment to me. That sounds like having rational fears that come with being female.\n\nWhen I think disappointment I think of people being bummed they won't get to do certain things with a kid because they are not the gender they wanted. Seems a little crappy but whatever.", "I don’t think anyone who experiences gender disappointment doesn’t love their baby, but the fact is, the majority of the time it happens with girls, there’s countless sources that show this across the world. And you disagreed with my comment but you experienced gender disappointment when you found out you had a girl", "Here:\nhttps://www.nber.org/digest/oct04/do-fathers-prefer-sons", "It's OK to be disappointed, but than I wouldn't make a gender reveal party. There might be a video from that event and years later the doughter sees her dad's reaction and feel bad about it.\nOr other people tell her about her dad's reaction.", "Also shows you as a woman are oblivious to the challenges boys/men face since none of that entered your mind", "It’s actually pretty common in a lot of countries in Asia. Don’t know about other countries but it is more common than you think.", "Damn she REALLY wanted a sister 🤣", "Yeah crazy people aren’t cool with this 26 year old who started dating this 19 year old girl when she was still a minor and he was 24 🙄", "no, she didn't.", ">minor home repair\n\n? Like changing a faucet or something? Is this a new milestone to hit before marriage/baby?", "Because he *showed his disappointment at a party for their baby*.\n\n\nThere is nothing wrong with feeling disappointment, but you hide that shit until everyone has left and discuss that feeling with your partner. Like an adult.\n\n\nIt doesn't make him a bad dad, just bad at emotional regulation, which is a big part of parenthood.", "Where are you getting this? Did OP comment somewhere else?", "No idea how anyone can look at the age gap and say it’s not a problem.", "Maybe OP is in a country where this is acceptable, doesn't make it ok tho but it could explain it.", "I feel like there’s no way I can prove to you this is real. I saw the comment, it’s their word against mine ig. I posted here cause I was facing a dilemma and wanted opinions from other people. I have better things to do with my time lol 😅", "If only it were that simple!\n\nOh wait, it is.", "Something tells me OP wanted the party, not the guy", "Lol, I somehow doubt it was his idea. Plus, that’s like saying don’t have a Super Bowl party because your favorite team might lose. Don’t have a birthday party because you might not get the gift you want.", "I’m sorry. Does sexism only go one way? Everyone is ok with calling the guy gross, but the minute I call the girl a gold digger, I’m a bad guy. I guess sexism only goes one way. \n\nAlso, many people make decent money at 26. Everyone in my circle made 6 figures or damn close by that age.", "Lol.  I was making six figures at age 19 selling door to door", "She was 17.", "So you also like underage high school girls then?🤢", "I’d normally agree, but pregnant other half trumps equal in most decent men’s eyes - you got beef, you give her space and she gets the comfy space.", "I think this proves that you never really know until the kids start talking and developing their personalities (which really is the best part).", "Aw, I love stories like this. Reminds me of my own family a bit. I have an older sibling, a younger brother and a younger sister. My sibling was so disappointed when they found out that our sister was a girl and that they wouldn't be getting another brother. Fast forward ten years to 2018 when I came out as trans, and my sibling did end up with that second brother they wanted, haha.", "But if you read that article, it's clear that the reason boys tend to favor roughhousing is because of how they've been socialized and how the culture around them tells them they gotta act. At the same time though, there'll be girls who'll enjoy roughhousing just as much because they also wanna test the limits of what they can do, and boys who dislike it because they don't like pain or conflict. The crux of it is though that even if a boy doesn't like it if every example of men around him shows that this is how men bond he's gonna do it anyways; likewise most girls are gonna have the women around them and the culture telling them to be meek and polite and not roughhouse. It's all socialization. If you boiled it down to biology there is no innate programming saying that boys prefer x and girls prefer y, just what people and the culture around them do.", "I had twin girl names picked out since I was a teenager, but was instead blessed with two boys two years apart and I refuse to go through that ever again, so they'll never be used. I wasn't too disappointed, because I thought I might still have a girl after my first boy, and when the second was also a boy I was relieved because I had at least done that before.", "I think that’s a little different, you’d been explicitly told you were having a girl, you’d picked out a name, chosen outfits and likely bought girly things and imagined having a girl for 8 months. But I think being as disappointed as OP’s bf is when it’s literally a 50/50 is just strange and despite a minority of cases where gender disappointment occurs when the baby is a boy, most cases occur when the baby is a girl.", "Reverse sexism doesn't exist because sexism is sexism.  And sexism can be targeted at men or women, because most people don't indulge bullshit redefinitions of words to suit ideologically driven academic frameworks erected on sorting the world into oppressors and oppressed.", "Personally I liked that she didn't get a girl. TV families seem to be a son and daughter family only...it was nice to have a show where it was all boys as those families exist too!", "I new a lady that absolutely didn’t want to have another girl because their “so much trouble”… yeah she didn’t really like the daughter she already had. And tbh the girl wasn’t trouble she just took after her momma🙄\n\nIdk what that’s called when they think one sex in particular is “more trouble” but it honestly doesn’t have to be unless the parents raise the kid that way🤷🏻‍♀️", "I agree with you. Of course, there’s gender disappointment about sons but you have to be willfully oblivious (at best) to not recognize that the majority of the time gender disappointment goes one way. I mean, for one example, look at what happened in China under the one child policy.", "Yeah, I have 10 years of my biological father beating the shit out of me because he wanted a son. And girls need a fathers heavy hand to keep their lack of worth in line. But any day now he’ll love me gender disappointment is only temporary! /s.", "Do you have any proof of this? Because you’re claiming there are countless sources yet you’re not providing sources. Which seems to me like you’re speculating. \n\nEven if there is a statistic that shows that gender disappointment is disproportionately towards females, its a surface level statistic that literally means nothing. It wouldn’t be able to tell us the reasoning for the gender disappointment. There is such a wide range of emotions surrounding having a baby. And there are different definitions and reasons behind “disappointment” Gender disappointment towards females doesn’t automatically equal misogyny. \n\nYou completely ignored the point of my comment and focused on one minute detail which is that I experienced gender disappointment with my daughter. Not why I experienced it. My experience does not represent the whole, and it’s a pretty good example of why your assumption is wrong IMO.", "We aren’t even talking about this right now. I never said that men don’t face challenges but the challenges woman face are different and as a parent they are scarier and harder to handle IMO. Woman are generally more emotional than men and handle issues differently. It doesn’t make me oblivious for listing the reasons I was scared to have a daughter and not including how I would have felt if she was a boy. What do you want from me? Do I have to list all the challenges men face when I’m talking about my daughter because “men also face challenges” ??", "It's pretty common globally. On average, bio-kid boys are preferred but if couples are adopting, they prefer girls. It's not too strong of a bias, though.", "It's an annoying part of cohabitation. I'd definitely wanna make sure I can live with someone and deal with the logistics of that with them while we're both in a frustrated mood before I'd venture into baby making territory", "I think it's the idea that you don't really know someone until you do home renos with them and see their true colours/how they react to things going wrong.", "It's just funny how one little thing and now a man's a horrible dad. Just normal reddit", "Yes, and even if that weren't the case, that would make the alternative scenario that he met a teenage girl and got her pregnant very soon after knowing her..Not exactly a better scenario.\n\nShe commented that they've been together for 2 years.", "OP commented that they started dating when she was 17 I'm pretty sure", "Agreed :((", "Acceptable as in legal and acceptable as in not morally creepy are different things.\n\nMost places in the world a 24yr old creeping on 17yr olds is morally wrong.", "You’re really compairing being disappointed in your childs gender to being disappointed that your team didn’t win the freaking Super Bowl??", "No, thats not at all the same thing. That child is gonna be a person. If you have such huge expectations on what your kid is gonna be based on its gender, the least you can do is find out the gender in private and not show off your disappointment in your kid publicly before its even born.", "The super bowl is not a human being with feelings. Years later the girl might be told about her dad's reaction or worse see the video of it.\nThe problem is not the man's disappointment. The problems are her feelings about that, that stuck with her her whole life", "it's not because he's a guy and she's a girl, it's because he's 26 and she's 19. she probably just graduated highschool and he's old enough to have a degree plus some years lmao. \n26 is not old enough to gold dig from i 100% garuntee it, especially in this economy.", "She’s a 19 year old, she’s barely an adult", "No sexism doesn't go one way. \n\nMen get taken advantage of in age gaps relationships too. It's unfortunate people don't address that because of myths about how maturity works or men not being ever viewed as victims when it comes to domestic violence. That's fucked up. Men matter. \n\nBut your reaction is sexist because you're making such a massive jump to a conclusion. One that would make Mike Powell blush from how big of a jump it is frankly. \n\nWe (or at least most people) don't have to think hard to understand why a 19 year old and a 26 year old is a problematic age gap. \n\nBut you're suggesting she's a gold digger. Where is that coming from other than sexist rhetoric?", "First of all that’s not underage in almost every single country in the world - educate yourself. Secondly no, I’m not interested in high school girls. I did have consensual relationships at that age 16-18 with partners who were several years older than myself - there were never any issues.!At that point, I was (or thought I was at least) in love with someone who could potentially be a life long partner, I wasn’t about to wait til high school ended to pursue that.", "I disagree I don't think she should be able to kick out the boyfriend just because she's pregnant.", "Oh, for sure. I think my point is that, whether it's justified or not, you can build it up in your head. \n\nI had an awful time after birth, because to me, I still felt like my child should have been a girl. I tried reaching out on forums and was treated horribly because \"at least [I] still had a baby\". It was a long time before I found anywhere that acknowledged that you can still grieve a baby that never really was. \n\nThis isn't to justify OPs baby daddy being a dick. You still ought to be happy and grateful for the baby you have, and not behave like an asshole in public. Only to say that sometimes, that feeling of loss is justified.", "I also experienced gender disappointment with my son. My whole family, for several generations, has been a  big-sister and a little-brother. Even though I of course knew that it was possible for a first born to be male, and even correctly predicted that my baby was a boy, I felt weird about my family not following that same pattern. The feeling passed pretty quickly. \n\nIt doesn't sound like OPs boyfriend is completely distraught, just a little disappointed. I totally get why that would upset her, but it's not unusual.", "[removed]", "So true. Besides, it's not like all genders like the same stuff. My mom wanted a girl so damn bad (I am one), but sadly for her, for the first 13 years of my life I was a tomboy which I could tell really bothered her because I didn't like the clothes she wanted me to wear and I didn't.", "Yup one anonymous redditor proves us all wrong with her SINGULAR experience of gender disappointment without anything but her word!", "Sex selective abortions are definitely an issue in certain countries, especially China and India. \nIn China during the period of the One Child Policy the societal preference for male children meant many female children were aborted prior to birth, families would keep trying and keep aborting until an ultrasound would confirm a male. This has led to China having a vastly skewed gender ratio for certain age groups. \n\nAccording to [this](https://www.bmj.com/content/338/bmj.b1211) BMJ article \n“In 2005 males under the age of 20 exceeded females by more than 32 million in China, and more than 1.1 million excess births of boys occurred. China will see very high and steadily worsening sex ratios in the reproductive age group over the next two decades.”", "Fair 🤣 I had a house on my own for years before my husband and I got married. So he kinda got tossed to the fire, cause I don't need help on small stuff (like faucets). I will however drag him into major home repairs with very little warning 🤣🤣🤣 \"hey babe, let's install the water softener this weekend! I got a better pipe cutter to cut into the water main!\" \n\nAnd yes, we've made it through several projects that involved numerous trips to Lowes/Home Depot. 🤣", "Oh fuckin hell", "Yes, I’m making a parallel about your silly comment about not having a party “because it’s 50/50”. This is such a stupid argument. People get disappointed sometimes. It’s not an indictment on their character. It’s being a person", "What’s the problem if she’s happy? Who are you to tell her what she can and can’t do? Have you never dated anyone older than you? What’s the acceptable age difference? You act like women are so dumb that they can’t make decisions on their own. \n\nJust apologize for jumping to conclusions about him and we can move on. Her edit shows he’s a good guy.", "Barely an adult? Last I checked as soon as you hit 18 you’re a legal adult and can make your own decisions.", "So are you saying we shouldn’t treat her like an adult and let her make her own choices? Barely an adult is still an adult. I made a statement to show all of you sexists that it’s not right to jump to conclusions no matter what side you are on. OP made an edit and now you all look silly. I will wait for your apologies now.", "I hope you’re replying to all the other people talking negatively about the man here and jumping to conclusions since you wanted to call me out specifically.", "Everyone jumped to conclusions about the man, so I jumped to a conclusion about the woman just to prove a point. No one knows anything about him or her. He had a normal reaction and I don’t see a problem. Gender disappointment happens and it’s nothing to go crazy about. \n\nIn reference to your statement about a problematic age gap, what is acceptable then? Who are you to tell this girl what’s right and what’s not? She’s an adult and she can make her own decisions.", "Also your story (as with op's) shows the risk of somehow convincing yourself, or allowing others to convince you, that the baby is going to \"definitely be a boy/girl\".\n\nI was convinced my first child would be a boy. Idk why, but since I was a teenager, I just felt that I'd have a boy first.\n\nI fell pregnant and until 6-7 months approx 99% of people told me I was having a boy, because of the way I looked, because of the way I carried, always guessed a boy. Parents of boys at family parties, and strangers as we waited to cross the street would say \"you're having a boy?\" I'd just be like oh i don't know, maybe? And they'd be like \"no, that is a boy in there!\"\n\nSo I was *convinced* I was having a boy. \n\nMy husband however was the only one all throughout my pregnancy responding to people's comments with \"nah ... I think it's a girl\". At 8 months my mother and mil changed their stances to girl.\n\nBut it got to the point that I had a dream a couple weeks before I was due that I was delivering my baby, and then out it comes and the OB says \"congratulations, you have a beautiful baby girl!\" and goes to hand the baby to me and I push it away saying \"no I'm having a boy first\" and even in my dream my obs face was priceless.\n\nAnd my dream, partially, came true, thankfully minus me rejecting my baby girl lol", "No, it is why.  And it’s not a guess.  I’m surprised that you would even suggest it was given that you posted a link to the very type of article my comment was describing.", "The classic sexist woman response. You can't be sexist against men and if you disagree you're an idiot.", "Yoo same, except I am still tomboyish. I’ve tried being a girly girl it just doesn’t work for me but it seems kinda like me and my mom have more fun because of it. We can both laugh at dirty jokes and occasionally swear like sailors(she’s British)👀", "Sorry if my word isn’t good enough for you, oh rando of Reddit! Of course the person I was responding to, not you, said they didn’t think a single parent didn’t love their child because of gender disappointment. Well, I was a child who wasn’t loved because of gender disappointment. That disapproves their point that not a SIGNLE child wasn’t wanted over not getting the gender the parent wanted. \n\nAnd if a parent beating their child for the first decade of their life because it wasn’t the gender they wanted isn’t good enough evidence of gender disappointment for you, then I highly doubt any evidence would be good enough for you.", "That’s not gender disappointment my friend. That is murder and discrimination. This story is not about the genocide of female babies in other countries, and alternative pea’s comment wasn’t about that. It’s about GENDER DISAPPOINTMENT IN A WESTERN COUNTRY. To compare the two is absolutely ridiculous. There is no such level of misogyny in America as there is in places like India and China. This is grasping at straws to prove an untrue point that has nothing to do with what you’re saying.", "Legality doesn’t define morality", "You’ll be waiting a long time then", "God you're exhausting. I'm not going to try and explain how power dynamics work in relationships.\n\nBut can you seriously picture yourself at 19, dating a 26 year old, and having it be a healthy respectful relationship???", "I disagree with you about the gold digger part but I do agree that everyone here is being extremely ignorant and sexist towards the man. It’s so blatantly obvious but I frequent this subreddit and it’s not a surprise anymore. I also hard disagree on people saying the age gap is predatory. If you personally find it creepy then more power to you, I might personally find a lot of the shit these people do on here creepy, but at the end of the day she’s 19 years old she’s been an adult for over a year it’s not like she’s fresh 18 just had a birthday because THEN that would be predatory.", "Lol", "It was a generous suggestion, I admit. I see now that you are *proudly* wrong 🫡", "I'm pretty feminine now but I feel my mom was so persistent that she actually made me want to be more feminine. To this day, I'm honestly not sure if I really care about looking feminine or if it was just beaten into me by mom and the snotty people I grew up with.", "I don’t see why so many women have this internalized misogyny about jokes and fun being reserved for boys.", "a) that is gender disappointment because of a preference for one sex with an extreme reaction. I’m sure the many Chinese parents who learnt they were having a girl were extremely disappointed, to such an extent they had an abortion. \n\nb) The comment you replied to mentioned “across the world” which is what I was giving evidence for not specifically just western countries. \n\nc) there is probably still a low gender preference for boys even in western countries, see boy moms, and fathers who say they’d prefer boys so they don’t have to deal with a girls ‘emotions’", "Yes I can. At 19 I had more difficult things to worry about than a relationship with someone. If I don’t like something, I’ll just leave. It’s not a difficult concept. There are power dynamics no matter the age. You’re insulting the intelligence of everyone who dates people that are older than them.", "hey!!! they're having a baby!!! she's 19 and they've definitely been dating for a while if they're having a kid and inviting families to gender reveal parties!!!! let's think for a second!!!", "I just said that to show all of these people how wrong it is to assume things about people. OP made an edit, and now they all look silly.", "I don’t bother with pride; it goes before falls more often than not.  For me, anyway.\n\nBut I accept your concession, which is the only reasonable way to interpret your ad hominem attacks and lack of engagement with the substance of what I said.", "Are you suggesting i have internalized misogyny? \n\nHuh? All of my female friends have a great sense of humor. I've never heard of women feeling humor was only for men. Never heard that. Same goes for fun.", "Just turned 20 myself not long ago. Since I was 18 years old I’ve had to work, pay bills, build credit, pay rent, utilities, phone, etc. You are considered a fully grown adult by the age of 18. I’ve also pursued sex with women in their 30s and late 20s it’s not predatory if you’re of legal age you can screw whoever you want 😂🤣", "I understand that, but she’s still old enough to make her own decision. Is it stupid? Absolutely. Having a child at 19 is absolutely stupid. But all I’m saying is that her decision to be with an older guy doesn’t make him a predator.", "Of course they do. This subreddit’s reaction to anything minor is “dump this man” “leave him” etc when it’s never even that serious. Personally I don’t think anyone was the AH except the commenters ironically", "Seriously. All these people really think women are so dumb that they can’t make their own decisions. They don’t even realize how insulting it is.", "For example if she was 25 and he was 32 nobody would bat an eye"]}