{"id": 29082, "submission_id": "179jpz6", "title": "AITA for “disinheriting” my daughter?", "selftext": "I didn’t actually disinherit my daughter it’s just what my wife and her claims. \n\nMy first wife had drug problems and still got primary custody of our son. I was young and didn’t fight her on custody and when he got older we weren’t close so I felt awkward asking him to live with us. She tried to prevent us from communicating and moved around a lot so it was always hard to spend any time with him until he got his own phone. But now I have spent more time with him and now we are close. \n\nMy second wife is hard working and very financially successful as an engineer. In fact she makes more than me. Our daughter takes after her, she is a straight A student and is going to be back in school to be a nursing practitioner soon. \n\nMy wife is angry with me because my daughter and I aren’t close. She goes to her mom for everything and doesn’t speak to me much. We were close when she was young but since high school it’s like she pretends I don’t exist. I try to reach out but it’s met with silence. I think my wife poisoned her against me because I have spent most of my money on my son. My wife told my daughter I didn’t pay for an cent of college for her and my wife did all the saving for her college fund. \n\nI didn’t really contribute to my daughter’s college fund.I didn’t pay for any piano lessons etc. I did pay for half of the family expenses with my wife like the mortgage but my extra money has been going to my son. Partly child support but I’ve also been contributing outside of that. He didn’t finish school with good enough grades for college. I gave him money to upgrade his grades and helped him get a place to start college. He got 2 semesters in and then left because he was depressed. He has a lot of issues from growing up with his mother and I feel partly responsible because I didn’t try to fight for custody. I give him money for rent and he has issues holding down a job so he needs support. \n\nMy daughter recently reached out with an schedule for her and her fiancé’s wedding. It had his and mom’s dance but not the father daughter one. I was confused and asked my daughter about that and she replied “we aren’t close enough for that”. I was shocked and asked her why she would consider us not close and she said “well you basically disinherited me”. I called her and asked her to explain and she said because her mom paid for college and will be helping her with her NP degree and I didn’t give a crap about her after middle school because of my son. I explained everything I said above to her(and she knew most of it before that as well).She said I should have split my funds and time between them. I told her I felt like I did and she got angry and said I didn’t and it’s like she was raised by a single mom and that’s why she is uncomfortable with having a wedding dance with me because it would be a lie.\n\nI felt like I was fair to them, I lived with my daughter I just didn’t pay for things outside of food, mortgage, utilities etc. that’s because I felt like my wife had it covered and my son was getting nothing. My ex wife wasn’t saving anything and I wanted to help him because he was having a much harder time than my daughter who had an attentive mother. But she felt I was prioritizing my son and in her words “disinherited her”. I feel like she should understand the situation but she didn’t want me to be included in the wedding much at all.", "created_utc": 1697497934, "permalink": "/r/AmItheAsshole/comments/179jpz6/aita_for_disinheriting_my_daughter/", "score": 301, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the asshole for not spending money and time on my daughter as she felt like I disinherited her\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "YTA, mate\n\n>My wife is angry with me because my daughter and I aren’t close. She goes to her mom for everything and doesn’t speak to me much. We were close when she was young but since high school it’s like she pretends I don’t exist. I try to reach out but it’s met with silence. I think my wife poisoned her against me because I have spent most of my money on my son. My wife told my daughter I didn’t pay for an cent of college for her and my wife did all the saving for her college fund.\r  \n\r\n\nvs\n\n>I was shocked and asked her why she would consider us not close\n\n&#x200B;\n\nLike, don't be obtuse. Use your brain and it's pretty obvious", "More Info - are you divorced from your 2nd wife too?\n\nRegardless, YTA - you admit that you spent most of your money on your son, but you also throw in a line where your daughter accuses you of not splitting your \"money and **time**.\"  Seems like you left out details about how you failed your daughter.  It sounds like she has plenty of reason to not feel close to you.", "YTA, and you sound like an all around shitty parent to both your kids.  \n\nYou let your son stay with a drug using Mom and didn't pay attention to your daughter.  Why are you surprised she does not want to be around you?", "YTA. You didn't disinherit your daughter, you neglected her in an effort to save your son. You failed both. Apologize to both. Vow to be better and do it. You have a lot to make right with your daughter, and it will take a long time. Your son needs support in getting professional help, not just paying his rent.", "YTA.  Poor little OP, nothing's ever your fault, is it?   You didn't father your son because of the evil ex (and you didn't fight for custody, even though you paid child support) and you didn't father your daughter because you spent all your time and money on your son?\n\nAnd your wife \"poisoned\" your daughter by telling her the truth?  And somehow this was enough to trump all the actual parenting... because you were still a fully involved parent, right?  Right?\n\nSomehow it's all the women's fault that you didn't raise either of your kids.  Sure.", "YTA. From the get go. \n\nYou let your son be raised by a drug addict. Why the fuck didn’t you fight for custody? So crappy parenting from the start. Doesn’t surprise me that it carried over to the second. \n\nYou claim you did do that (in terms of splitting time and money), yet everything you wrote clearly shows you didn’t. So just stop with the lying. \n\nYou yourself said that you paid for half of the family expenses but none of the extras. So no, you didn’t do shit. And your daughter is absolutely right. \n\nWhy the fuck weren’t you putting money into a college fund for her or helping pay for piano lesson? \n\nAnd now you pretend to be surprised when she says you’re not close?\n\nOh ffs. Grow up. You sucked with kid number one, and it continued with kid number 2.", "INFO\n\n> My first wife had drug problems and still got primary custody of our son. I was young and didn’t fight her on custody\n\nWhy the shit did you not fight to keep your child away from someone with a drug problem?\n\nWTF does being young have to do with anything?", "I know you meant well, but YTA. You fell into the very common, but still unacceptable, trap of ignoring the child you think didn’t need you (at least not like your son) and overcompensating with the child you perceive as needing more.\n\nIf you can manage a sincere apology and work on yourself through therapy, maybe your daughter will come around. Your end goal, however, should be to realize your mistakes and be better, not corral her into the relationship you want. She doesn’t owe you that.", "YTA.  I have a feeling your wife has been telling you how she and your daughter feel for years. And you ignored it. I see why you did what you did, maybe it was the correct thing even, but you don’t just ignore a festering resentment like this.  You needed to work this out with your wife, marriage counseling or even divorce, and continually communicate with your daughter.  \n\nI think that if you’d involved anyone else in your plans you might even have come up with a better solution, for both your kids.", "I’m going to go out on a limb and say that you and your daughter probably weren’t that close prior to middle school either, she was just too young to realize that her dad wasn’t all that interested or involved.  \n\nI know you didn’t pay for her activities but how many of them did you attend?  Not just the recitals or big events but the every day stuff?  How many times were you the one taking her to doctor’s appointments or helping her navigate situations with her friends?  If she feels like she was raised by a single parent it goes deeper than you not paying for college.\n\nYou have a lot of excuses why you weren’t involved with your son and now you’re using him as an excuse for why you couldn’t be involved with your daughter. Have you considered that maybe you’re just kind of a shitty parent?  Also, YTA", "YTA\n\nYou managed to be an absent parent while living in the same house. Impressive. \n\nYou failed both children. You abandoned your son with a drug addict then tried to make up for it by neglecting your daughter in favor of your son.\n\nETA: OP was 22 when his son was born. He is using the fact that he was young as an excuse. I would have assumed he was 16 based on the spin he put in it. 22 is old enough to put on your big boy pants and be a parent.", "YTA- to BOTH of your children. YOU CHOSE not to fight for your son when he was a child and as a result his life was crappy.  YOU CHOSE to ignore your daughter because you finally decided to be a father to a son you never cared about.  You are a massive TA and deserve everything your daughter said. Count yourself lucky she is CHOOSING to allow you to come to her wedding. She'd be well within her rights to ignore you the way you keep CHOOSING to ignore her", "Why should she treat you like a parent when you’ve never acted like one to her? You were a roommate, Her moms husband. You don’t get to be mad at her now for the role you chose to play in her life. YTA", "what's the relationship between your son and your daughter like?", "YTA . She grew up and realized that daddy spends all his time with his other kid. You neglected your daughter and now you’re suffering from it . Nobody’s fault but yours", "YTA. You had two children but only “helped out” one you thought deserved it more because of your guilty conscience. To not contribute anything to your daughter except the minimum it’s almost like she was on minimum child support while your son got everything extra. Honestly I’m surprised your wife is still with you.", "YTA.\n\nYour reason for only supporting your son doesn't matter, you had the exact same obligation to your daughter.\n\nYou did what many parents do, you failed one child and, in your attempts to fix that failure you fail your other child.\n\n>I told her I felt like I did \n\nDon't lie, it just makes you a bigger AH.\n\n>I lived with my daughter I just didn’t pay for things outside of food, mortgage, utilities etc. that’s because I felt like my wife had it covered and my son was getting nothing.\n\nSo, you admit you didn't, it doesn't matter that you daughter mother could provide her more, YOUR obligation was the same.\n\n>I feel like she should understand the situation but she didn’t want me to be included in the wedding much at all.\n\nShe does understand, it's just that you are wrong.", "How is this a question? Is this written by the daughter?  \n  \nEither way, YTA.", "YTA. Your daughter was communicating her feelings, and you're dismissing them while also being defensive. If your daughter doesn't feel like you were an emotionally present father, then you  weren't. Stop trying to force a relationship, and start rebuilding on her terms.", "Your daughter seems to have a fairly accurate grasp of the situation and your priorities. What a shame. YTA.", "I kept having to double check your post that this is your actual biological daughter you're talking about, and not a stepdaughter you aren't related to or legally responsible for.\n\nYTA. You did let your wife raise her as a single mother. She got nothing from you other than a roof over her head and food, which is the absolute legal minimum - and I get the feeling you only covered those because you had to pay for those same things for your own upkeep. Her mother's ability to pay for all of her extracurriculars and provide emotional support didn't absolve you of your parental duties, it only meant even less for your daughter because she had only one parent, not two.\n\nWhy do you want public credit for parenting someone you admit that you didn't have a hand in raising? Why do you feel you should get a dance with her when you admit you put all of your effort and money into your son? You had two biological children, not one. Parenting is about being responsible to all your children, not just the one that's easiest to throw money at.", "YTA\n\nLet me reword this. \"I felt so guilty for earlier mistakes with my son that I made a whole new new set of mistakes with my daughter, who now thinks I don't give a darn about her because I'm doing everything I can for my son and nothing for her. Why does she think I'm a bad father?\"", "I love how you casually slip in that you not only not payed for anything for your daughter, you also spent very little time with her. You clearly favor your son, who you used to neglect, but in trying to make it up to him, you completely disregarded your daughter for years. YTA.", "YTA. Her mom time doesn’t make up for not having dad time. Get a grip!", "YTA she's prioritizing herself and her fiance on their wedding day.  I'm sure she's sure you'll understand the situation", "Your daughter had an attentive mother. That's great, since she has a parent who cares about her. But you can't ignore her needs in favor of your son's and expect her not to feel abandoned.  She works hard and gets no support; he drops out of college, and you pay his rent. It sounds like your time goes to him as well. You have two kids who needed you, but you're trying to make up for abandoning the first by abandoning the second. YTA", "YTA. You don't even see that you made the same mistake twice. As a father you neclected both of your children. Money can't make up for the all the times your son would have needed you growing up and living together didn't save your daughter from feeling like she couldn't rely on you either. I think you would benefit from therapy to talk about the relationship you have with your kids right now. The good thing is your daughter and you were close in the past so there is a foundation to build on. Your son would also benefit from a father who could guide him with more than just financial help to find a more independent path in life.", "Supporting your son is an understandable goal. But pushing your daughter over to her mother like a passed football is not the best way to do it. Daughters need to feel dad is there, you have not been. She started slipping away and you never really tried to find out why, just seemingly shrugged and accepted the convenience of it as allowing you to dedicate your guilt to your other child. Apologies and amendment of behaviour could help... but it could also be that the ship has sadly sailed away. The excuse of 'you were okay and someone else needed me' is not acceptable, SHE needed you.", "I don't understand how a family runs finances where you can identify which parent paid for what for which kid. In families I am familiar with,  kids are a family expense and are funded with family money based on family decisions. Your description of time is also foreign to me.  Did you really not go to your daughter's activities,  drive her and her friends all over the place,  and travel as a family?", "Why are you with your second wife? In a real marriage people share their money. So it’s not his money or her money. The fact your wife has told your daughter it’s only “my” money that paid for xyz shows that she wanted a wedge between you and your daughter. Maybe you did spend more on your son but when your 2nd wife married you she became his stepmother and she should have been willing to treat him just like her own child. Divorce your wife! I do not think that you can save your relationship with your daughter.", "YTA. How do you not see it? You feel guilty for screwing over your son (because that's exactly what you did), so you think screwing over your daughter in his favor makes up for it?\n\nGuess again. Now she doesn't even love you anymore.", "YTA unintentionally, and so are both your wives are too but more directly.\n\nYou meant well for your son, but ignored your daughter in the process.  Of course your ex made things difficult, and that sucks, but your current wife also made it worse.  By making it obvious she was paying for everything, not \"we're supporting you\" but \"I'm supporting you\" to the daughter she deepened the rift.  Your current wife should have spoken to you about what she was seeing with your daughter far sooner, or maybe she did and you missed it.\n\nEither way, you inadvertently caused this issue, and only time spent could possibly fix it - if your daughter is willing.  The fact you still are favoring your son with basics isn't helping when you're not contributing time, energy, or money towards your daughter.\n\nThe only ones innocent in this are the kids.", "YTA - you managed to be an absentee parent for both of your children, congrats.", "You can stop waiting on that father-daughter dance.  That ain't happening.\n\nBut no, you didn't \"disinherit her.\"  You \"severely neglected her.\"  Semantics are important.\n\nOh, and YTA.", "YTA, Hope your son takes care of you in your old age because you clearly picked your favorite.", "YTA \n\nYou sound really confused like \"that was the situation\" \"wife had it covered\" yeah she had it covered because you didn't. That was the situation because YOU made it the situation. Your daughter shouldn't have to come to you on her own to form a relationship, you are her father, why weren't you doing more? Yeah maybe some teens don't want to be close to one of the parents but you know what those parents don't do? Stop trying. \n\nYou didn't try with her and she noticed. She saw you try with your son. She saw you spend money, emotional needs, attention on your son but never on her. In your mind she didn't want it and had those needs met, and that's exactly why she was raised by a \"single mother.\" You chose not to do those things for her and these are the consequences. \n\nRealize that what choices you made, even though you just thought was just how it was, were still choices. Just like how you made the choice to leave your son with his drug addict mother. In situations you make choices, and by not making a choice because you think it won't help or change things, that is still a choice. \n\nDon't make excuses because in the end they're just flimsy excuses. People see actions as a way to prove words. You weren't there for your daughter, period. For whatever reasoning, you just weren't. Instead of being stuck in the past, think of what you can do to fix the relationship. Because if it was fine like how you thought it was, you wouldn't be in this situation now. Just because it's like this, it doesn't mean your wife poisoned her mind. She's an adult, she has eyes, her own perception. She doesn't need anyone else, not even your wife to tell her that you were an absent father. Even in your own words, in your post to us, we can see that you were not a great father to her, of course you don't have a close relationship and it is of your own doing. Sure you lived together, maybe paid for the food on the table, a roof over your head but you did nothing more than that. And if you think that's all it takes to be a good father, well, lay it out. What did you give your son that was more than that and not give to your daughter? Doesn't matter if one needs more than another in your perspective, they're both your children. And by not making it fair, you favored your son and so your daughter knows she is less compared to her half sibling because that's exactly how you treated them. \n\nYou're trying to argue with people in the comments but realize this is exactly what your daughter feels and we are trying to help you understand. Whatever narrative in your head that made you innocent is not how it seems in the real world, in writing to us or in person to your daughter. You will never form a good relationship with your daughter if you do not attempt to see things from her perspective and take some responsibility for your actions.", "ESH\n\nYou’re doing things opposite. You should be loving and caring with your daughter and harder on your son. \n\nAlso, why does your wife complain about you not paying for college when she was saving for your daughter college the whole time? Just want to complain. \n\nYour daughter for being a jerk and ungrateful. Is she in a serious relationship by any chance?", "YTA. I bet you haven't contributed to her wedding either. I'm left wondering who is giving her away because I don't think it will be you.", "The train left the station years ago and only now do you notice?", "YTA times infinity.\n\nAnd you paid for your son to \"upgrade his grades\"? What, like a bribe to the school? Paying a hacker? Your daughter is right, you ard not a dad. You are an AH, though.", "YTA\n\nYour daughter had the opposite of what your son got. \n\nShe had an absent and emotionally neglectful father and an attentive mother.", "Oh, so you shared a roof with your daughter that automatically makes you a good father? Nuh. \nIt’s your fault. YTA.", "YTA, you were not a present father to her. You don't get to be shocked when you didn't do anything with her extra curriculas and leaving everything that wasn't a necessity on your wife.", "YTA.  You were an absent father to your daughter whom you lived with.  You didn’t fight for custody for your son.  You shift blame for your crappy parenting in your wife poisoning your daughter’s mind.  She doesn’t need to.  You said your daughter is smart and could see that you weren’t there and doing bare minimum all the while trying to buy your son’s affection.", "YTA. So you pay for basic basic things and call that fair? I don't see a valid reason as to why all of your money goes to the son.", "YTA and in the top 5 of those I've seen here. The only things I don't get it's why your wife is still with you but I think now your daughter is going to be married you are going to be single really soon lol.", "ESH, kind of surprised at all the YTA comments. \n\nIt sounds like you weren’t entirely fair to your daughter and gave majority of your time/money/attention to your son- with that being said though, your first wife took time away from your first child and made it difficult to have a relationship with him and you likely felt you needed to make up for that. Your second wife was extremely immature telling your daughter all these things that would obviously make her feel bitter towards you. Both these women have acted incredibly petty and immature and I’m not going to blame you entirely for not knowing how to navigate this with 100% success rate. \n\nThis stuff is hard. Keep doing your best, and try to make more of an effort contributing and considering your daughter as well as your son - take them out together, contribute to them equally.", "ESH\n\nYour wife, daughter and you all suck for focusing on the money.  You did not disinherit anybody.  You spent more on the child who had different needs.  This happens even with biological siblings.  If one out of three kids needs braces, a tutor, plays an instrument whatever.  It doesn’t sound like the daughter lacked for financial support.  Her and your wife are just now mad it didn’t come from your paycheck.  You need to discuss with your wife, if she didn’t feel you were pulling your full share of your daughter’s expenses she should have discussed your joint family budget with you.  Not complained about it to your daughter.  I’m not sure how bad your relationship is as husband and wife right now but I’d have a deep discussion on budget issues.  Does she think also haven’t done your share towards retirement savings, vacations, other discretionary spending?  If you can find a common ground then together talk to your daughter.  They are poisonings the well when they mix budgeting into resentment about being close.\n\nBUT you also need to talk about the apparent neglect.  If they were ever neglected because you didn’t help them with expenses, understand what they did without.  But it sounds like they never came to you and said “we need $$$ for band camp”.  So it seems like the neglect is more spending time and paying attention to your daughter.  If she can’t even share a dance at her wedding there are some deep resentments you should try to understand, apologize as appropriate, try to develop a way better adult relationship with her than you had with as a teenager.  You should not have let her set the tone of your relationship as a teenager.  When she stopped talking to you it should have been a priority for both you and your wife.  \n\nIt does sound like as your daughter got older your wife might have used her as her venting partner.  That’s not appropriate to put a child in this position.  You and your wife should seek couples therapy to learn how to function as a couple, not 2 separate households sharing a roof.  If it’s not too late.\n\nDid your guilt make you overspend on your son?  Possibly.  Look at this with your wife.  Do some planning now for your future retirement and if you’re in the position estate planning.  If it’s truly a disproportion, and some of the spending was indeed luxury spending and unnecessary, you have time to adjust whatever is truly “inheritance” money.  With your children fully aware why and it’s dependent on you not needing the money yourself in your old age.\n\nGood luck.", "I'm going to go against the grain and say NTA. As I read a lot of these comments, I get the sense that most people voting YTA are not parents. \n\nI'm 38, have a wonderful spouse who is a really great parent, and we both still struggle to raise our two kids. Those who don't have kids have NO CLUE how difficult it is, and they're not considering the fact that your \"choice\" was to try to fight to be the primary single parent at such a young age. And being a parent at 22 is YOUNG. Commenters make the assumption that just because you're not in high school, that should make you a fit parent, and that you should be making great decisions in life. You know what I was doing at age 22? I was going out, drinking, and clubbing! \n\nNobody is also accounting for the fact that the legal system has historically favored the mother in custody battles, so the best that OP could have hoped for was shared custody. Based on the info he had at the time, there was no way he was going to get full custody. \n\nAs a father myself, I also understand that you can't treat your kids the same. Even if they resent you in the future, some kids just have greater needs. Take an extreme example such as a child with mental illness and another that doesn't. These same commenters would never judge you for treating them differently. They don't get it, and are living in an ideal world - one that they will understand was unrealistic at best once they grow up.", "I’m gonna go with all around ESH here. \n\nIf you did spend more time with your son than your daughter, that’s probably why she leaned on her mom more and can make you an AH. HOWEVER, you paid for mortgage, groceries, etc. around the house, which your son was not receiving from you so you spent money on him as well. I think your daughter is TA for faulting you for not paying for her college and post graduate tuition. It is always a great bonus to have a tuition fund but if you couldn’t afford it, then what the hell is her problem if your wife was able to? \n\nYour wife is the biggest asshole here because she voiced her issues with you to her underage daughter. That is NOT ok. It’s a marriage therefore it should be a joint effort - your wife made the divide between where money is spent pretty clear and I’m surprised you’re still with her after this.", "Sounds like you are gonna ruin the relationship with both your kids. You said you are paying your son's rent. Does he work? I wouldn't worry about his education. it sounds like he's not interested. You are making him dependent on you which is not a good idea", "You don’t mention how old your son is. If he’s had two semesters of college, I’d guess over 18. Why are you still paying child support? You know he’s not a full time student. You financial responsibility to him ended when he quit school.\n\nNow, your moral responsibility is something else. You feel guilty so you enable his hobo lifestyle. You’ve basically turned your back on your wife and daughter. You should consider divorcing and moving, by yourself, to a new city/state. Try again. See if it works better this time.", "YTA. You need to have more faith in your daughter for one thing. She's old enough to see that you're picking favourites without her mother poisoning her perspective. \n\nLet's just assume your wife is trying to sabotage your relationship with her. I don't believe that from the fact that you're still with her and she wants you to be closer to your daughter, but just for arguments sake I'll play off that assumption of yours. That's still partially on you for not demonstrating that what she's saying isn't true. You don't need to spend a fortune on taking your kid out once a week, spending time with them in the evening or helping them with their homework. You get out of relationships what you put into them, and from your own words it doesn't sound like you put much of anything into that relationship.\n\nEven if every single one of your assumptions is on the mark it's still your fault for not taking responsibility for your son when it actually mattered. You can have visitation and custody agreements changed. Your relationship with your daughter is a direct result of you not taking responsibility for your son when it mattered and over compensating for it and prioritizing him over your daughter when your daughter needed you as well. You need to put in some work without bringing any expectations into this if you want to even somewhat fix your relationship with her.", "YTA man, you made some seriously bad choices over the years. For both of your children, not just your son. Regardless of how you feel about what your daughter is saying, that is how she feels. It didn't come from nowhere. It came from her experiences with you. And its not like you can talk to her out of feeling the way that she does anyways. You need to acknowledge and accept her feelings, and then work on being a more present parent to her. You're correct in that you should have fought for custody of your son, especially given that you knew his mother was on drugs. But you also shouldn't have been trying to make up for that by dismissing and neglecting your daughter. Stop focusing on who is right, start focusing on trying to better your relationship with your daughter.", "YTA. Is this for real?", "I don’t think you’re the ahole , except for your taste in women. Your first wife poisoned your relationship with your son, and then when you try and build one your second wife poisoned your relationship with your daughter. Maybe you could have been there more for her, but what can you do when all she ever says is no.", "Oh my, another one where if the married couple shared funds there would be fewer issues! I do the college saving planning for my kids, but I am not putting ‘my’ money in the account because we have ‘our’ money. It’s all the same. I swear, people who can’t even share in a marriage, yeah, you probably also did a shitty time of sharing your time with your kids. Still, cutting you out of a 3 min dance, bullshit. ESH", "ESH. You ignored your daughter in favor of your son. But your wife’s behavior is messed up too, she shouldn’t have been telling the daughter that you didn’t contribute. Usually in a marriage you wouldn’t specify to the kid who is paying for college or whatever, you’d just say we’re paying for it. Obviously it’s not uncommon for one parent to earn more than the other. Like if someone were a SAHM it would not be fair to say they “disinherited” the kid because they did not contribute financially. It sounds like this is not much of a family, it’s more like everyone for themselves.", "You've been a bad father to your daughter and a bad husband to your wife. You dumped the entire financial burden of education for your daughter on your wife. You have prioritized your son over your daughter again and again. You should have done so much more to help her. You don't get to be in the spotlight as the loving father at her wedding when you repeatedly showed that you didn't care about her as much as you did your son. Shame on you! YTA", "“I was shocked” - BS!!! You know all the reasons your daughter doesn’t feel close enough to you to have a dance at her wedding. You ignored her for the better part of her life bc you realized you F’d up with your son and then overcompensated. You are just playing dumb. YTA", "YTA. You admit to spending more money and time with your son. You did so at the expense of your wife and daughter and because of guilt. So now you’ve screwed up with two children. Your son bc you did nothing to save him from his mother with drug problems. You admit to this. Your daughter because you basically gave no fucks about her once you could spend time with your son. You know what I hear in this. Me me me me me, woe is me, poor me. You’ve taken NO accountability for anything. Your son doesn’t only have mental health issues because of his mother but because you gave up on him. Your daughter does not have a relationship with you because you put more effort into your son. The key component here is YOU.", "YTA on so many levels.  You effed up with your son. Then, when you realized you effed up with your son, you screwed your daughter over, giving her the absolute bare minimum, trying  to buy your way back into your son's good graces. \n\nTalk about your epic fails.  Count yourself lucky your daughter even speaks to you.", "YTA. The word balance obviously has no meaning to you.", "Really? YTA. So you let your wife single handedly support the daughter you have with her basically her entire life? And you think this is ok?", "So let me see…\n\nYou abandoned one child, knowingly leaving them in a dangerous environment because it was too hard\n\nThen when you’re daughter got older you abandoned her because it was too hard \n\nYou are beyond YTA - you are the worst parent possible who did absolutely nothing for anyone but themselves and now want pity", "YTA - You let the guilt you had from neglecting your son lead to neglecting your daughter. You know, it is possible to prioritize BOTH children. You just cannot seem to do that, and it has cost you. Do better, and maybe you will get to see the grandkids.", "YTA. Are you actually living with them? You sound like you don't. Didn't you actually talk to your wife these years? These are family matters that should have been brought up along the years or some form of communication should have existed on them. Just from what you wrote you sound disconnected from your wife and daughter so yeah, reality is probably much worse.", "YTA.\n\nYou have an opportunity here to reach out to your daughter and let her know that you would like to make a connection regardless of your role in the wedding.  You need to recognize that you did prioritize your son, and did not focus enough on your daughter, and admit that to her.  Don't ask her to how to \"make it right\" or to \"mend fences\"; rather, let her know that you want to be involved in her life.  Your daughter needs to see your active involvement in her life, financially and otherwise.  She sounds very accomplished - celebrate her.\n\nYou have two more issues:\n\n1. Your wife.  It sounds like you may be on the verge of divorce.  Just an redditor guess.\n2. Your son.  He is old enough, and need to get therapy and hold down a job.  Stop enabling his irresponsible behavior.", "Wow. So son with all the issues got everything and well behaved daughter got nothing. Read your post again and then understand YTA.", "Your son is old enough to go to college but you’re still paying child support? It also sounds like you’re just enabling your son in all his problems instead of truly trying to help him. He can’t hold down a job because why does he need to? You’re taking care of him in all his needs.\nYour daughter has every right to be upset and feel the way she does. She’s not wrong and you’re the only one who can’t seem to see that.\n\nYTA", "YTA\n\n1. Your are enabling your son out of guilt. Stop it. If you really care about him, you will set some boundaries that will help him be accountable and handle his life. If you care more about yourself and your guilt, you will continue enabling him.\n\n2. You done fucked up with your daughter. But until you stop enabling your son, you will continue to have no relationship with your daughter. You are hyper focused on yourself and your guilt, not either of your two kids.\n\nThe only thing you should be paying for for your son is mandatory therapy. \n\nYou should be going to family counseling with your wife and daughter too.\n\nDon’t worry about looking like an asshole. You can’t fix it until you stop worrying about yourself.", "NTA..I mean it is possible you are one, but based on your post NTA. This is the problem with keeping everything separate finance wise. Your wife didn't pay for everything to do with your Daughter, her parents income did. Your wife entered into marriage knowing you had a son and responsibilities to your son and the household income needed for your son went to that and the household income needed for your daughter went to her.", "YTA. You sound like a very uncaring parent and who favours your son and your daughter knows it. So does your wife. Do you even LIKE your daughter?!", "yTA wow how oblivious can one man be you basically thought well wifey has it covered so I don't have to do anything and that's how you reacted you admit you didn't pay for anything you have everything to your son and nothing to your daughter and wonder why it bit you in the @$$", "YTA, and an absolute deadbeat.", "YTA and will have no relationship with your daughter apart from your wife. Make sure you and your wife don’t ever separate, because without your wife telling you, you will have no information about your daughters life in the future. She won’t want you around her kids if she has them. She knows what blatant favouritism feels like, and she won’t give you a chance you treat her kids like that. Although if your son has kids, you probably wouldn’t care about your daughters kids anyway. If I were your wife i would leave you. Why was it her responsibility to pay for everything for your daughter that you share? She basically was a single mother.  I feel for your daughter.  She must feel so unloved and tossed aside by her own father. That’s really has to hurt her self esteem. To know your father can toss you aside for his favourite child without a second thought? I’m so happy that she at least has a mother that fully loves and supports her. Poor kid needs someone in her corner that she knows she can rely on.", "YTA. You'll probably still blame everyone else in a few decades when you're divorced again and your kids stick you in some shitty nursing home and never visit. And you'll deserve it.", "YTA\n\nI side with your daughter because you should have split 50/50 between the two. It sucks she would have gotten more, but she's as much your kid as him.", "YTA.  I'm surprised your wife did not divorce you.", "You wear pajamas to the grocery store.", "NTA. Your wife seems like a vindictive woman who doesn't like you much. You are a couple and your money should be spent jointly. The way your wife talks about her money and your money is odd", "It seems like you spent a lot of time and money worrying about your son. That's not bad. His mom didn't do anything to help pay for college, you did. His mom isn't helping him in life, you are. Those are things you should be doing. At this point I'd be concerned that you're maybe enabling your son more than helping when it comes to paying his expenses, but that's really subjective.\n\nWhen it comes to your daughter, it reads like you washed your hands of that situation. I understand why you prioritized your son, as he had less, but it seems like you prioritized your son *to the exclusion of your daughter.* It's not unreasonable for her to have feelings about that. She saw you always spending money for your boy, but never for her. Her mother seems to have simply told her the truth!\n\nI'll believe that you gave your daughter time and the disparity really is only in finances. On that, I'd say NAH. Your wife should have been clearer if it was an issue how you were splitting expenses, but yeah. Now that your daughter is an adult, maybe you can sit down with her and explain you weren't malicious in your actions, just maybe a little dense.", "Ah, the joys of married couples with separate bank accounts.  The wife knew of OP’s financial commitment to his son before marriage.\nIf instead they shared an account, both kids would have received financial help (maybe not the same) but neither parent would have taken all of the credit.\nOP may not have been a great parent but HER PARENTS made sure she received appropriate financial support.\n\nNTA, but the wife sure is.", "NTA at all.", "You are not the asshole. That implies intent. It’s common for kids to feel slighted when one kid requires more attention. It doesn’t seem like you did it on purpose. You did provide a household and necessities to your daughter which is not something to be taken for granted. It’s hard. Unless you left out some important details regarding how you treated her.. I’m not seeing it.", "NTA. I think your daughter's decision is extremely immature, even petty, and her explanation even more so. I don't hold you entirely blameless in the emotional department, but all the same it is not about the money.\n\nI think you should consider skipping the wedding altogether.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI didn’t actually disinherit my daughter it’s just what my wife claims. \n\nMy first wife had drug problems and still got primary custody of our son. I was young and didn’t fight her on custody and when he got older we weren’t close so I felt awkward asking him to live with us. She tried to prevent us from communicated and moved around a lot so it was always hard to spend any time with him until he got his own phone. But now I have spent more time with him and now we are close. \n\nMy second wife is hard working and very financially successful as an engineer. In fact she makes more than me. Our daughter takes after her, she is a straight A student and is going to be back in school to be a nursing practitioner soon. \n\nMy wife is angry with me because my daughter and I aren’t close. She goes to her mom for everything and doesn’t speak to me much. We were close when she was young but since high school it’s like she pretends I don’t exist. I try to reach out but it’s met with silence. I think my wife poisoned her against me because I have spent most of my money on my son. My wife told my daughter I didn’t pay for an cent of college for her and my wife did all the saving for her college fund. \n\nI didn’t really contribute to my daughter’s college fund.I didn’t pay for any piano lessons etc. I did pay for half of the family expenses with my wife like the mortgage but my extra money has been going to my son. Partly child support but I’ve also been contributing outside of that. He didn’t finish school with good enough grades for college. I gave him money to upgrade his grades and helped him get a place to start college. He got 2 semesters in and then left because he was depressed. He has a lot of issues from growing up with his mother and I feel partly responsible because I didn’t try to fight for custody. I give him money for rent and he has issues holding down a job so he needs support. \n\nMy daughter recently reached out with an schedule for her and her fiancé’s wedding. It had his and mom’s dance but not the father daughter one. I was confused and asked my daughter about that and she replied “we aren’t close enough for that”. I was shocked and asked her why she would consider us not close and she said “well you basically disinherited me”. I called her and asked her to explain and she said because her mom paid for college and will be helping her with her NP degree and I didn’t give a crap about her after middle school because of my son. I explained everything I said above to her and she said I should have split my funds and time between them. I told her I felt like I did and she got angry and said I didn’t and it’s like she was raised by a single mom and that’s why she is uncomfortable with having a wedding dance with me because it would be a lie.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "[removed]", "YTA. You paid half of the bills, and contributed nothing towards helping her in the future, while spending the rest of your money on a kid you didn't fight for. Yeah, you basically disinherited her. Consider yourself lucky she invited you to the wedding.", "YTA.\n\nYou have two children and you've been acting like you had the one for a long time. You created the gap between you and your daughter by playing favorites. Your son may have had a shitty life because of his mother but that doesnt mean your daughter should pay the price. Coddling your son isnt doing him any favors either especially since he is now an adult.", "YTA. Family therapy. Or I see you divorced with no daughter and if it continues, a live in son with depression.", "YTA- you favored your son and neglected your daughter. You should have treated both children equally financially. Instead, you let your wife carry all the financial burden for your daughter. Why did you even have a second child if you had no intention of loving her as much as your first child? \n\nWhat shocks me is that your wife didn’t leave you after seeing how you favored your son over your daughter. Your wife didn’t poison your daughter. She simply told the truth. And you don’t deserve a father/daughter dance at the wedding, which (let me guess) you aren’t paying for. Your wife deserves the dance with your daughter instead.", "YTA. Sorry dude, but you fucked up with both of your kids. At least you’re doing what you can to help one. Time to help the other.", "YTA. You didn’t fight for your son and then tried to make up for it by ignoring YOUR daughter. \n\nI actually had to read your post again because I thought she was a step-child you had no financial contribution towards.", "YTA: You did ignore her. It’s time you admit it.", "YTA. Do you think kids are stupid? Don't you think your daughter would be fully aware who was financially contributing towards her upbringing? You have neglected both of your kids tbh. What on earth happened that the courts decided it would be better for your son to stay with his mum in that situation? You say you were young,but you must have known that was not a good environment for him?\n\nYou massively overcompensated for letting your son down and in the meantime you let your daughter down. You should have treated both kids equally financially and I can't believe you are surprised your daughter doesn't think there's enough of a bond there for a father/daughter dance", "A familiar AITA trope here.\n\nAs a direct result of my actions  / inactions X happened, I was confused.\n\n\nYour daughter says she felt like she was brought up by a single mum. Even if you didn't have money for her education and hobbies there are other ways to support and encourage your child, with encouragement, time and enthusiasm for them and their achievements.\n\nYou left your son to be raised by someone who you portray as chaotic and now he is an adult you chuck money at him, out of guilt I'm guessing. Do you give him emotional support and time?\n\nDo your son and daughter have any relationship? The way you talk is doesn't even sound like they've met!\n\nYTA for being an absent dad who was right there.", "My situation was similar to yours in that I have a son with an ex wife and one with my current wife. YTA. No excuses. You could’ve spent a day here and there just to have time with her. It wouldn’t have cost much but would’ve been priceless. I, personally, don’t see how you could let your daughter go through that entire season of her life without your involvement. You should be ashamed.", "YTA. You can’t tell someone that how you made them feel isn’t valid. You fucked up with not taking time with your daughter. \n\nAlso, she was a child when this started. She is not responsible for her brother, and as a child she shouldn’t have been neglected and expected to just suck it up. Sounds like she really did grow up with a single parent lifestyle.", "YTA 100%", "Yeah.. You're then a-hole.. You help with only the necessitys for your daughter, from what I understand you have put so much work spending time with your son (which is not the bad thing alone, but you have another kid.) And you don't treat her like you treat your son, let alone like your child at all. Iv she doesn't what a father daughter dance leave it be, try to repair the relationship if you care enough, you seem like a horrible dad to your daughter.", "YTA. Whether you intended to or not, you clearly showed your daughter where your priorities were. It DOES NOT matter what you intended at this point, or what you thought you did, because she didn’t see it. She didn’t feel it, and she no longer see you two as close, so you two are not close. Do not fight this, as it is her reality. Your only way back is to accept that you fucked up and try to move forward being better.", "YTA. You neglected your kids, and are enabling your son out of guilt.", "YTA, it just requires to read between the lines a little. There is a total divide between how you describe your own behavior and confusion as to how this happened and your wife and daughter expressing MANY YEARS of general neglect. Your wife has been bitter about this for years, and I simply don’t believe you’ve haven’t heard about it many times before. I also simply don’t believe you this is out of the blue or a surprise to you unless you’re really in thag much denial. Your story playing dumb doesn’t hold water.", "Something here doesn't add up. Why is this all about money? You don't buy relationships with family. If you're not close to somebody, it's usually a time issue, not a money issue. Did you ever do activities with your daughter one-on-one? Take her out for dinner, watch tv together, go on a road trip? Where are your daddy-daughter memories? Somehow, it feels like you were content for your wife to give more than just her money, but also her time and emotional energy to your daughter. YTA", "YTA- \n\nWhat I don’t understand is how could you miss this? Your daughter is already a full adult, how could you miss this? Your wife never told you, you have two kids not just one?", ">She said I should have split my funds and time between them.\n\nBecause it's not only funds, but Time. Were you really close at all when she was young ?\n\nYTA here, stop lying to yourself. You know it.\nMaybe you didn't want to, maybe you try to do what you can on bad decision at a time, but now you're just with a long list of bad decisions.\n\n.... Ffs you were living with her yet she didn't felt close to you !", "Why do men think providing money is adequate these days?\n\nYou messed up early on. If you were there for your daughter emotionally then the money issue could have been talked about. She's not distant because you felt guilty about your son, and your wife isn't responsible for this either. Your actions have spoken for you, and they didn't speak loudly enough to your daughter.\n\nWhat feels fair to you as an adult will feel like favouritism to a child. YTA for not hearing her when she tells you what's wrong", "Are you positive you and your \"wife\" are married?  Your narrative suggests you two are merely roommates .", ">She said I should have split my funds and time between them.\n\nYup, YTA. The dinsinherit choice of word is Strange but I don't live in this house so...\n\nYou seems like a guy who sincerely (?) want to be good but can't deal with historic of bad decisions, like \n\n>I was young and didn’t fight her on custody\n\nSucks, but when you're growing older you need to be, like, \"proud of yourself and your choices\" but reading your post, you seems like someone who's too ashamed to look at the past. So you can't improve, correct yourself, make amends.\n\nIf you have aknowledged earlier what was happening with your daughter, you could have fixed your relashionship, but now you'll always be that \"\"\"\"\"father\"\"\"\"\", even if you put some effort on the long term, she'll be cordial...\n\nYet you really should give a hard try at correcting things 'cause she's growing her own family now, and you may want to be part of it. DON'T FORCE YOUR PLACE. Offer your help anytime help could be needed, don't expected forgiveness, just... kinda wait for it, while being a good listener (being passive didn't do much for you doesn't it)", "I’m guessing your wife is on the spectrum, any other idea why she would corrupt your relationship with your daughter? I would be tempted not to go to the wedding. Or at least not walk down the aisle.", "ESH. You and your wife should have had thorough discussions about finances regularly.", "there is way more to this than is stated, is the feeling i get. probably YTA for omission. but i see clear signs of neglect towards your daughter", "YTA. Do you actually like any of these people? All the details seem too bizarre to be fake but they’re all described as one-dimensional beige “characters” so I’m not sure. There is definitely no real emotion about any of them displayed", "I’m not sure what you expect from Reddit, since you have given a very clear explanation of how you dumped one child in favour of another. It should really be entitled How to be an Asshole.", "Nta", "YTA", "YTA without a shadow of a doubt.\n\n>I think my wife poisoned her against me because I have spent most of my money on my son.\n\nYes sure let's blame your wife for your actions. So yta and a coward.\n\n>But she felt I was prioritizing my son and in her words “disinherited her”.\n\nIt's exactly what you did.\n\nSo you failed your son by not fighting for him, and you failed your daughter by putting all your efforts on your son out of guilt. And you do continue to fail her because you refuse to admit how wrong you were. Did I mention how you failed your wife too?\n\nBe grateful you're invited to the wedding at all.", "Dude it sounds like you abandoned both kids. Your daughter emotionally and your son physically.", "You need family counseling with your daughter.\n\nAlso probably marriage counseling too of your wife has-been feeding those attitudes.", "YTA. Your daughter has felt neglected and unwanted for years. You're not helping your son by throwing money at him either, as there is no motivation to improve himself if you'll just keep paying for him no matter what. Your children deserved to be supported equally, and you have not done that at all. You showed your daughter over a significant portion of her life that your son was the priority no matter how hard she worked. You may have a chance to connect with her but only if you can see the error in your own actions and then work to change. As for your son, you left him in a traumatic situation to grow up in so of course he's struggling mentally and emotionally. That's also on you, but can't be fixed by tossing money at him. If you want to save your family relationships and so they don't get to add to their resentment, do a lot of introspection and look at changing your behaviors... and then action the changes. You can apologize but it's not worth anything without changing your thoughts and actions moving forward.", ">I think my wife poisoned her against me because I have spent most of my money on my son.\n\nYeah, so…read that back. Pretty sure it isn’t your wife who poisoned her. You did that all by yourself.", "YTA, you could've divided your time and money equally. You reap what you sow, unfortunately", "This, basically sounds like didn't give a crap and failed both kids", "Ah yes, the ol' Missing Missing Reasons.", "Though I see your point, it seems like daughter didn't miss anything because of a lack of funds. She had her activities and education paid.\n\nWife N°2 should have discussed the issue with her husband instead of turning her daughter against him if she wasn't pleased with their financial situation.\n\nI would almost say ESH but the kids. Stupid spending decisions from the husband, bitter wife N°2.", "But the details he does give make his neglect clear. Am I the only one who was confused about which wife was the wife in this narrative?", "I’m not divorced from my 2nd wife. \n\nI spent time with my daughter too! Especially when she was in middle school. In high school she suddenly didn’t want to spend time with me and even stopped talking to me much and began spending more time with my wife. I think she was poisoning her against me. My wife also tells me she feels like a single mother because I don’t contribute to my daughter but I can’t because of my son’s needs and child support. She also makes more so it’s not my daughter didn’t have what she needed. \n\nI did take my son on vacation but I took vacation with my daughter and wife the year before and after and my son never went on vacation before.", "Well you see he was uncomfortable because he wasn’t close to his son, so he left him to be raised by a drug addict mom who moved around a lot and gave him many mental health issues. /s\n\nYTA", "Plus he’s enabling the son. Depression is a reason, not an excuse.", "I was 22 and she was 28. I was working min wage without much direction. She had a fairly well paying job so I didn’t fight for custody because I thought he would do better with her. She had a drug problem but I didn’t realize she used meth until he was in elementary school. When we were together it was just weed and cigs. I also used weed at the time.", ">You fell into the very common, but still unacceptable, trap of ignoring the child you think didn’t need you...and overcompensating with the child you perceive as needing more.\n\n⬆️ this. A million times this.\n\nMy mom did this to my brother and i, basically neglected me and spoiled him, because she was convinced he needed her more. Some of the disparities are comparable to what OP describes. \n\nI will never be close to her. She literally ignored me in my time of greatest need, when i was pleading for help, and i will never forgive her for that.\n\nOP, you have your work cut out for you to make up for neglecting your daughter and leaving your wife to basically be a single parent. \n\nYTA.", "Did he mean well??", "It certainly seems like he didn't bother bonding sufficiently with his daughter. Sometimes it's not about the money but the attention and love. If he had made sure his daughter felt secure in her father's affection, she would probably not resent how much assistance her brother was getting. Maybe she'd even sympathize or understand. At the very least, their relationship wouldn't be this bad, in which she barely acknowledges his existence. I don't think she really wants him at her wedding at all.", "They don’t talk. They have met half a dozen times or so over the years.", "She’d prob have to pay bum ass OP alimony (which he’d probably then funnel into his son) and then she might even lose half of her house because OP was technically paying 50% for the roof over their head.", "So his current wife should pay half the mortgage, all childcare costs, and also necessities and tuition for their daughter and then OP should get 50% credit for raising the daughter? For paying her tuition? \n\nNo thanks. \n\nI knew who paid my college tuition because it’s almost impossible to hide and I knew which parent was taking me where and buying me what because it’s actually incredibly obvious on it’s own. \n\nAs a teenager, my parents would just hand me one of their credit cards. I knew who paid for what.\n\nAnd as an adult with aging parents, I would REALLY want to know which parent is getting dumped in a home and which one is being cared for.", "BS.  The second wife is not the culprit at all.", "This is the first resonable comment I could find! My God, this thread is insane! He only paid for food, mortgage, utilities. ONLY? And hardly anyone is even touching the subject of the insane parent alienation done by the wife, while still married! \n\n&#x200B;\n\nSheesh, talk about hating men/husbands/fathers.", "I voted YTA and I'm a parent. If you read his comments,it's not that the court favoured the mum,he didn't even bother fighting for custody as he thought his son would be better off in the house of an addict. Then when he was older and realised meth was involved, he still left him there.", "I knew who paid what in my college tuition because it showed up on my student account.\n\nI also knew who paid for what because I would see my mom or dad pay or they’d let me borrow their credit card which has a name printed on it. \n\nIt’s not rocket science for a teenager to figure out that her mom gave birth to her, worked full time as an engineer, paid her half of the bills and 100% of the parenting costs and then 100% of her tuition and OP chose to funnel his extra money and time into his son who he never bothered to raise and who now needs assistance as an adult.\n\nHis daughter doesn’t want to dance with someone with this shitty of a character and pretend to be “daddy’s little girl” in a room full of people who probably don’t know the details of what OP put his own family through. And that does NOT make her TA.", "I wrote something similar to this so glad to see another comment with the same logic.   I've been married a long time and money is a joint thing no matter whose account it comes from its just the way it's been budgeted.", "This is probably the most appropriate judgement.\n\nEven if they didn't fully merge their finances, OP and his wife should have been in agreement on their spending, including how much of his income was going towards his son and how much was going to their family. They are both at fault for not discussing it properly.\n\nHe shouldn't have assumed that she had stuff covered and he could spend on his son without discussing it. But if she wasn't happy about that, she should have talked to him.\n\nMaybe she did and he didn't listen very well. But taking it to the daughter was wrong. OP may be exagerating the claim of his wife poisoning their daughter against him... but  i doubt it is wholely without merit. There is no reason for OPs wife to give their daughter the details of how the college fund was funded, unless there was already resentment built up. But turning your kid against their other parent is an ugly way to deal with it.\n\nI also think the daughter is included in the ESH. She's been cutting him out of her life since HS. Probably 8 years, possibly more. Did OP maybe spend more time with his son and not enough with her? Possibly.\n\nBut at the same time, once she started to cut him out, it would have become an ugly negative feedback cycle. She's having nothing to do with him, so of course he'd spend time with his son (and generating resentment). She doesn't involve him in an activity, or acknowledge when he does show... and it becomes the reason he's not invited/acknowledged the next time. Lather. Rinse. Repeat. Eventually the cycle goes on long enough that how it started is forgotten and all that's left is the pain. And when something hurts, it is natural to start avoiding it.\n\nIf she's cutting him out of her wedding because of he didn't spend enough time with her, then she needs to acknowledge her role and contribution to it happening too.\n\nOP, your choices on how you spent your time and money may have been a major contributing factor. But your wife and daughter also sound to have made choices that contributed to it reaching this point. ESH", "From the sounds of this guy’s comments, had wife #2 shared all of her money, he would have spent it all on his son and himself.", "By the sounds, he’s lucky (and should be grateful) he even got an invitation to the wedding.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "He’s also a terrible husband. He seems to think he deserves a medal for paying the mortgage on a house he lived in. All the while abdicating any responsibility he had towards his daughter, emotionally and financially. Frankly, he’s lucky to even be invited to the wedding at all.\n\nOP yes, YTA", "No missing reasons here. OP literally lists them all and is still confused what the issue is... \n\nYTA", "Perhaps W2 didn’t poison daughter at all. OP did that all by himself.", "My take on that too. But, OP, daughter is entitled to her own feelings and you should respect that. Maybe try to bild a relationship w her as you did with your kid", "You're so selfish. You blame your wife for your bad relationship with your daughter while refusing to take any responsibility for your bad behavior towards your daughter. You forced your wife to pay for everything but the basics. She did all the work that went into parenting. You barely did the bare minimum.", "Stop making excuses. \n\nYour wife feels like a single parent because she basically is. \n\nYou keep talking about your sons needs. What about your daughter’s needs?\n\nYou have two kids. Act like it.", "Both of your kids have one attentive parent. You are to your daughter what your ex is to your son. Take a good long time and think about that.  \n\nYTA \n\nYou need to try and understand not your child you basically ignored since she was, what 13 years old???", "I’m not divorced from my 2nd wife.\n\nYET. You forgot the YET.", "I’m confused. \n\n“I can’t because of my sons needs and child support”\n\nYour son is older than your daughter, who is old enough to be going to school to be an NP, so he’s at least mid-late 20’s. Child support ends at 18 so unless you’re THAT behind, this is a mute point. What your son NEEDS is a job and some therapy. You’ve messed up both your kids and honestly it’s just a matter of time before your wife divorces you", "She stopped talking to you because it was clear you prioritize your son over her. You didn't priortize your daughter at all. Should your wife have covered for your shitty behavior? Also, you think one vacation makes up for the lifetime inequality?", "You keep saying that your wife poisoned her against you but also saying your wife is also pointing out how shitty of a father you are. Why would she be pissed at you for being a shit dad while also \"convincing\" your daughter that you're a shit dad? Sounds like you're blaming your wife, your daughter, your son, hell you even felt the need to take a shot at your ex but nothing is you're fault", "Honestly if I was your 2nd wife I’d leave you. She’s been a single parent this whole time because of how you failed going after custody with your son. Quit trying to justify your behavior. You failed both your kids.", "Did she know that you weren’t going to offer any financial help towards your daughter? That you were only going to pay for your living expenses and she was going to have to subsidize yours?", "Doesn’t sound like your wife poisoned her, just told the truth….", "You should be grateful for being invited to the wedding at all. If your daughter seats you in the back with the odd uncle, just accept it because that was basically your role in her life.\n\nStop blaming your wife for your bad parenting. The blame lies solely on you, for both children.\n\nJust be quiet and stop throwing a tantrum because your daughter is smart enough to know you abandoned her.", "You seriously think the wife you are still married to you poisened your daughter against you? If you really believed that (which I actually don't believe) you should have addressed it.", "It’s not just your wife’s responsibility to provide for your daughter is it? You CHOSE to spend majority of your money on your son out of guilt.", "No one needed to “poison” your daughter against you. You did it all by yourself.", "I'm betting right around then is when all your spare time and money started going towards only your son. You stopped being a dad to your daughter and did the emotional equivalent of just paying child support. Sounds like you did a poor job supporting either kid.", "Is it really not obvious to you that she started going to her mother more when you and your son starting becoming closer again? Look at the timeline. It seems pretty self explanatory.", "Stop with the excuses. YTA. You weren’t there for your daughter. I’m sorry your son had a shitty set up, but you have TWO kids, not just one. So you don’t get to leave one parent to do all the work, and focus on one child and not the other.\n\nOh and kids aren’t stupid. Your wife didn’t have to say a word for your daughter to know. I guarantee she figured it out by your actions.", "YTA accept it. You didn’t do right by either of your kids and think bc you paid for the half the mortgage and utilities that makes you a contributing father? Your wife didn’t have to poison your daughter. You did that yourself. Newsflash: Living in the same house is NOT the same as being a present parent to your child.", "YTA.\n\nMaybe the reason your daughter didn't want to spend time with you when she was in high school is because you were ignoring her for your son.", "Not yet*", "Your wife is also the AH then.  If she had issues with how you were spending your money, she shouldn't have discussed that with your daughter (or she should have waited until your daughter was an adult).  But that doesn't change the fact that you decided your son needed you more than your daughter.  Obviously your daughter picked up on it and felt abandoned; you can't blame that all on your wife.", ">I think she was poisoning her against me.\n\nThis is despicable. I hope your wife sees this and divorce your sorry a$$. After everything she had to do, you dare treat her like that.", "Sounds like when she was a highschooler, you started to ditch her in favor of your son and she noticed and acted accordingly. YTA", "Pathetic. You thought he’d be better with a drug addict?\n\nYou realized meth was involved when he was in elementary and still did nothing?\n\nHonestly, I’m surprised he’s close with you at all. Although, it could just be because your paying for stuff. I’d be surprised if he’s truly over the fact that you left him to be raised by a druggie.", "Ha. I assumed you were 16. 22 is young but not young enough to use as an excuse.", "This gets worse. As soon as you realised meth was involved,you should have stepped in. I mean you should have stepped in at the start,no kid is better off in the house with a drug addict.", "You would have noticed if you'd been paying attention. How often did you actually see your son until he was in elementary school? \n\nRegardless, YTA to both your children. You neglected one and let him be raised by an addict. Then you tried to make up for it with money (btw, you know that's the only reason he tolerates you in his life, right?) and you started neglecting your daughter. You keep trying to make this about money but yojr daughter also blames you for not sharing your time between her and your son. Which was probably the most important element, since she didn't really lack money growing up (thanks to your wife).", "You forget that your son ALSO saw that you didn’t fight for him. \n\nStarting to see a lot of reasons for depression…", "This. I was literally disinherited because mom thought siblings needed the money more. Parents have this need to \"rescue\" the poorer performing child while ignoring the one who \"doesn't need anything.\"", "“Meant well” by trying to help his son. He went over the top with it, though.", "both your wife and your daughter has always aware of the existence of your son since the beginning?\n\nI will be honest, a lot of children who grew up as an only child will go through a stage of grief, if you will, once they suddenly have a sibling in their life. Because at one point, they didn't have to \"share\" their parents. All the attention and love was on them.\n\nThink of it from her perspective, hmmmm, my friends have a brother and sister to play with, I don't. And in order to deal with that, she comes up with \"oh well, at least both of my parents are MINE only, and I get all the attention and everything\". For some it gets to the point where that thinking becomes rooted as an identity.\n\nEven for full siblings, it is a difficult process. There has even been cases where the older child threw her baby brother out the window of an apartment building out of these negative feelings. But what usually happens is that most older children starts finding joy in having a sibling by their side, and so despite the fact that (as long as it's not too imbalanced) they have to share attention...etc. It feels more than worth it.\n\nBut in your case, she seems have gotten all the negatives of having a sibling, no positives.\n\nThis would be way easier to solve if she's still a child... but she's not anymore. And quite frankly, she's at an age where she's no longer in as much of a need of a father figure compared to before. In other words, you kind of missed your best chances.\n\nHere is what I suggest,\n\n1. do not have expectations of her returning any feelings, your efforts to make things right...etc. Whether or not you choose to put effort in is your choice. Whether or not she accepts is another question that you cannot force things. But do not be discouraged. As long as you've tried your best, she 100% knows, but years of uncertainty and hurt cannot be that easily forgotten. Make sure to be consistent with your effort, and don't take rejections personally.\n2. have a talk with your wife. This is the one person she trusts, and it is very important that you have your wife on your side. You guys are in this together, she is not your enemy. Ask her for advice and how to help, make it clear to her that you guys are in this together, also let her know your boundaries. (i.e. ask her to instead of going to her child telling her that her mother did everything and her father \"disinherited\" her, comfort her, offer her assurance that her father loves her no matter what. And instead, go to her father to discuss these negative feelings to find a solution.)\n3. Make sure to let your daughter know that your love never subtracts, only multiplies. You can invite both of your children over at the same time or go out with both of them, it doesn't always have to be one or the other. I have two younger sisters, the youngest one require more attention from me for obvious reasons. I always tell them that I love them all the same in amount, just in different ways. The older one feels comfortable coming to me when she feels like she needs more from me, and I set up a time to fulfill that need while asking for my grandparents for help with the youngest one during that time.\n4. set up a will (can be something along the lines of wife 50%, daughter 25%, son 25%- whatever you do, make sure that your children get equal amounts) send it over to your children, let them both know that they are both not any less important than the other, and that you feel so lucky so proud to be the father of them.\n\nagain, there is not as much you can do at this point with both children being adults and having their own lives, I do wish you luck. Recognize your shortcomings as a parent (we all have those), it's never too late.", "The financial choices of the parents on which contributing parent is directing money where is not a child's concern.  In a marriage where kids are involved, most have a level of joint funds.  Unless OP refused to pay for his daughters stuff, but more likely it was an arrangement they had based on circumstances and available funds, this issue is only there because the wife made a point of it.\n\nI'm not saying OP is a saint here, far from blameless, but it isn't as if the daughter is going without in favor of the son overall, and it isn't as if dad is wasting money gambling or on something frivolous.  When parents are together it should be a united front of caring for the kid, that's what the wife should have projected, not a \"I'm the only one helping/supporting you.\" and then getting mad that dad and daughter aren't close.", "I think you're overly focused on a small detail and losing sight of the bigger picture. A decision that he regrets and is doing what he can to rectify doesn't mean it was a bad one. \n\nThe courts will always have favored the mother. She also made more money than him, and she asked for it. He would have had to pay a ton of legal fees to try to fight it, and there's no way he would have won. OP said she had *primary* custody, not sole custody. \n\nWe don't know the timing of when he found out that the first wife was doing drugs. His comments state that he only knew about weed and cigarettes at the time, and that he also did weed, so that would have been a moot point in court. Plus, this is about his decisions and how it impacts his daughter, not a relitigation of whether he f-d things up with his son. \n\nEven then, one can't just go on just regretting and then ignoring one's life's decisions - especially when it comes to kids. I actually think he was NTA for trying to make things right. You don't just write off one of your kids because you f-d things up earlier. Would you?", "I don't fully agree that it's always that black and white, in my family something coming from one of the accounts doesn't mean that the other parent hadn't contributed it could simply mean that when budgeting finances the agreement is, for example, Mum pays for school fees and Dad pays electricity bill.\n\nIn a normal healthy family this kind of who paid what tit for tat wouldn't be a thing.   If your Mum was a SAHM does that mean she never contributed? No.  A family life is a team effort.\n\nOP - ESH for not setting healthy boundaries and having more communication and compromise in your marriage.", "It’s not abnormal for teens to distance themselves from their parents.", "I think it's his daughter who's the ingrate, and he should cut her off.", "That's the point. The phrase and concept of \"missing missing reasons\" refers to parents who, even when their kid tells them flat out what they did wrong, acts like the kid is pulling away for no reason. The \"missing reasons\" are right there in front of them, but they're acting like they're still missing bc the reasons don't fit the narrative they've constructed in their head. Hence, instead of \"missing reasons\", they're \"missing missing reasons\".", "\"We're supposed to be distracted by the hinkiness of the sons reading the email, and never notice that Vagnioni *just told us that she knows exactly why her sons cut her off. Pay no attention to the missing explanation behind the curtain.*\"\n\nEmphasis mine. Also: https://www.issendai.com/psychology/estrangement/missing-reasons-given.html", "They were BOTH his kids.  He only favored and invested in the boy.  He was emotionally and financially absent from his daughter’s life.  This was not her mother’s doing.  She has tried to shoulder the entire responsibility as a single parent married to a Boy Dad.", "Honestly he likes blaming his failures as a parent on his partners instead of taking responsibility lol like he commented that he found out when the kids was in elementary that the  mom was drug addict and still didn’t fight for custody. Son grows up and tries to make it up to him financially and emotionally but ended up sacrificing his daughter to do so. And to an extension his wife.", "Moot.", "How about no.\n\nA teenager is old enough to pick up on who is paying her tuition and who is buying her necessities.", "Please! He didn’t even fight for custody of his child and left him with a drug addict bc he felt awkward? Really? I mean I have heard a lot of shit excuses, but that takes the cake.", "It is the concern of the entire family. You don’t get to decide whether or not a neglected child can be angry about this or not. \n\n\nOp clearly says that any extra money he had would go to his son.\n\nI’m guessing the wife told him over the years, even though she shouldn’t have to tell him to be a fucking parent.\n\nAnd she was the only one supporting her daughter. She could have downsized her home and lived with her daughter alone and the outcome would have been the exact same. She’s a married single mom. OP is a shitty parent and his daughter deserved to know.", "No you don't. I agree there,but he overly compensated letting him down. I understand why,I do,but it was at the expense of his daughter. I have a problem that he didn't \"invest\" in his daughter. Im trying to find a way to word this,but it's hard because it just comes back to money. Not contributing to anything of hers bar her basic needs means he didn't invest in who she was. What mattered to her. It's more than the financial contribution. The financial contribution does help shape a child and the adult they become. Yes mum had it covered,but it's still not right.", "Neither of these parents are SAHP. So that immediately does not apply. \n\nPlus, OP pays child support and then spends his expendable income on his son. I have a strong tingling feeling that they do not mix finances.", "It would be hard to cut her off when he doesn't provide for her. Her MOTHER has been paying for everything she needed growing up and even now as she goes to college. He can't stop paying the basic household bills because it would affect him the most.\n\nHe's not providing for his kid financially OR emotionally. If you noticed that she said he didn't split any TIME with her  as one of her reasons they ain't close. He stopped trying after middle school which is likely when she grew into her own opinions and personality and they didn't mesh because she isn't easily distracted like most middle schoolers can be", "But he was young and he felt awkward fighting for custody 🙄", "Here's where I'm coming from - both my husband and I are pretty well off, despite coming from pretty humble roots. We got here by working our butts off. My sister, and my husband's brother are both not nearly as well off, but pretty squarely in the middle class, driven by their life choices and what they value. \n\nThere's a good chance that my parents and parents-in-law will be giving a vast majority of the inheritance to our siblings because they need it more than we do. This is also despite the fact that we treat our respective parents much better than our siblings do. It doesn't seem \"fair\" but what somebody does with their money is their own prerogative. There's no requirement that somebody has to spend their time, attention, or money equally on their kids. \n\nThe daughter got the financial support that she needed. Quite frankly, graduating with some student debt is not the end of the world. OP makes less money and has two kids to support, while 2nd wife made more money and only had the one kid to support. \n\nI actually suspect that the 2nd wife really was whispering things to the daughter, and that's pretty f-d up, so if it ended up being true, I'd say that she's TA in this situation.", "That's my point though ... They have had at some point had discussions around how things are split for the house so this should have come up, been agreed by both parties and been left as nothing to do with the children.  That's why I'm saying ESH.\n\nMy husband has children from a previous relationship but everything still comes from us, as we have healthy communication and treat income in this way.   It wouldn't matter whose account it came out of so your comment about knowing who paid wouldn't work in that scenario. \n\nFamilies are one team not a pick a side game.", "And I'm coming at it from the other side. I see the effects of the op's situation in my work daily. It never ends well. But I do get your point\n\nI still say though he could have taken on financial responsibility for some thing if his daughters outside of basic care. Can't afford to contribute to the school fund,fine,so pay for the piano lessons,or pay half of them. Any contribution would have been better than zero and may have changed the outcome of the wedding", "Well maybe that’s because my comment isn’t about you and your husband.\n\nA lot of couples keep finances separate and contribute to the household in an equal or proportionate manner.", "Yes, so my point would still stand even in that scenario. \n\nYour initial comment was about your own parents so I just followed your lead in using my family in my example.\n\nNo drama."]}