{"id": 29096, "submission_id": "179whic", "title": "AITA for telling my FIL to give back the key we gave him to our house?", "selftext": "Myself (31f) and my husband (33m) recently moved to a house within a ten minute drive of his parents. Initially I was happy about this, because I've always had a great relationship with them. My husband and I both have keys to their house, and they have keys to ours.\n\nRecently though, I've started taking serious issue with the habit my FIL has of letting himself into our home without warning. It started when he would come over frequently to help us put things up in our house. While I've always been incredibly grateful for his help, I don't like that he never lets us know when he's coming or even which day (despite express requests for him to let us know). One weekend when my husband and I went away, my FIL went over to our house without permission or any prior discussion to work on our garden. \n\nIt just feels rude, and makes for awkward situations. So far he's entered our house when my husband and I have still been in bed, when I've just got out of the shower in a towel, or when we've got other plans. There have been times I've walked into a room thinking the noise within is my husband, and it's my FIL. He never seemed to acknowledge any fault in what he was doing either. \n\nNaturally all this was very frustrating and upsetting to me, and I spoke to my husband. To start with he thought I was overreacting, because I don't think any of it had actually bothered him yet. Of course when it started to he suddenly understood my point of view, and said several times he'd get his dad alone and talk to him. That's apparently because his dad can be easily offended and my husband still wants his help around the house. My reply was basically that I'd welcome his help and don't want to offend him, but he's overstepping our boundaries and I'm getting tired of not feeling like I can relax in my house in case someone bursts in. \n\nThe last straw came the other day. I was home alone and my husband texted to ask if his father could come over to grab his work boots from our garden. He wouldn't need to come in or anything. Before I even had a chance to respond to that, my FIL came into the house. He hadn't even bothered to wait until he'd been given permission, let alone respected my opinion on the matter.\n\nI politely but firmly told my FIL how I was feeling, and mentioned that if this continued, I'd feel uncomfortable with him having a key to our house and would like him to give it back. He instantly became very sullen and non verbal, put his key on the side table and left. \n\nMy husband thinks I've handled this wrongly by overreacting, particularly since his dad has told him he won't come round anymore, but frankly I was at the end of my tether with this situation and handled it as best I could at the time.", "created_utc": 1697543227, "permalink": "/r/AmItheAsshole/comments/179whic/aita_for_telling_my_fil_to_give_back_the_key_we/", "score": 33, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1) The action I took that should be judged is telling my FIL that he should give back his key to our house\n\n2) This action may make me the AH if it was an overreaction to my FIL's behaviour, and if it would've been better handled another way\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA and you handled it very well. If your husband wanted to approach it a different way, he had his chance and didn't take it. Your husband needs to learn to listen to you.", "NTA - He thinks you handled it poorly while he dragged his feet not handling it at all. He was provided many opportunity to address this and did not....he is TA.  Oddly, he 'wants to keep good relations so you both can benefit from your FIL free labor....yikes. He's motivated to get what he can for free instead of building a healthy relationship living so close to one another. \n\nIt is creepy to be in your home and the door becomes unlocked without you knowing who or what is occurring. Yes, you reached the end of your patience and in the moment addressed it; unlike your husband.", "NTA \n\nEspecially in today age, where you can text your request and have it answered it minutes. I get that the FIL is doing things when he can and has the momentum but yeah he needs to have permission to enter someone’s home. \n\nOP, I would consider upgrading the locks to electronic ones that can be monitored from your phone, you can even give FIL a code that allows him into the house , some system  allow you put hours on the code where he can only use for noon to 1pm on Saturday, that way you have more control on when he has access.", "NTA.\n\nAn emergency key is not permission to invade your privacy.", "NTA, FIL being a massive fucking baby isn’t your problem. Let the toddler have his tantrum", "NTA\n\nHe's seriously overstepping boundaries.", "NTA.\n\nIf FIL cannot accept your boundaries then he shouldn't have a key.\n\nI think the obvious asshole in this situation is your husband. He clearly didn't set boundaries with his father and left you in an awkward situation. If he thinks you overreacted then he can only blame himself for creating that scenario.", "NTA \nYour FIL was stomping all over boundaries and didn't care and your husband wasn't firm enough.  I will be moving close to my in-law's soon and they won't be getting a key. I have been talking about my MIL fence since my partner and I discussed moving closer.  My home will be a fortress against my MIL because she hasn't any boundaries. I'd rather sit outside in the snow for hours than give her am emergency key because I know she would let herself in any time she felt like it.", "NTA\n\nYou were calm and said it respectfully. It’s his dads problem if he’s gonna be sullen and act like a child about it. Honestly, I personally wouldn’t ask him to help around anymore. If he takes back his help like that just because you don’t agree on him barging into your house whenever he wants, then you don’t need his help. I hate it when people do that.", "Why has nobody had a conversation with dad before you decided to say you wanted ur key back?  How are they expected to correct behaviour?  Now his pouty attitude is bs. But seriously?  Does no one know how to sit and have an awkward discussion anymore?  NTA to ESH because no one is communicating to the in laws.", "The only option I didn’t see was for you to do the same exact thing to his house.  Show up unannounced at bath or bed time like he has done to you.   Scare the hee-bee-gee-bees out of MIL a couple of times and he will clearly get the message?", "NTA of course, but maybe FIL should get a taste of what he's doing to you?  Show up unannounced and just walk into their house at random day/hours.  See how he'd react, then ask why it's OK for him to do that to you.", "NTA, it appears that either husband had been sufficiently afraid to talk to his father that he was letting it continue, or FIL was ignoring what he was told.  Given that FIL was supposed to be not coming in and came in anyway, I wonder if he was hoping to catch you coming out of the shower or something.   (He may not be a creep - could be just someone lacking self awareness and with boundary issues, or perhaps your husband never spoke to him about it at all.)  But, without knowing the details of what was said, it's perfectly fine to tell someone you're uncomfortable with them coming in uninvited and without announcing themselves or knocking, if your FIL is mad because he thinks he should be freely able to barge in on you walking around the house naked, or on you and your husband, for example, having sex on the living room floor, that's his problem not yours and if the subject comes up, you might put it that way.", "Can you get an electronic keypad lock and give him his own code? You can control when it is active so he can't come in unannounced but still has emergency access.", "NTA, you did the right thing and confronted him directly.  Problem solved.", "Your FIL overreacted. You did not.", "Just change the door to a keypad lock. Claim you wanted to upgrade in case you forgot your key. Keypad locks can be pretty nice to be honest. \n\n\nNTA.", "NTA - but I think you did slightly overreact & maybe could have handled it a little better. Of course, I don't know the whole situation, but possibly talking to your MIL first would have been better. You could have said, \"It would be nice if FIL gave us a heads-up when he is coming over, sometimes you're asleep, showering, etc and it surprises you.\" Let her relate to hearing an unknown man in her house and let her approach FIL and maybe hint that he should give heads-up if he is stopping by. Make it not sound personal, just startling. They may be more comfortable with family coming and going and just say how you are not used to that \"yet\" (even if you mean long term). It will definitely be helpful down the road to have them keep a key on-hand and keep that relationship solid.", "NTA. Entering your property without permission is trespassing, even if your FIL has a key.\n\nYou've tried the nice approach, but FIL is still breaking your boundary. Change the locks straight away and make it clear to your Husband, FIL is not to have a key.\n\nAlso, be sure to make it clear FIL is welcome any time, IF he is specifically invited.", "NTA \n\nYou can’t ever fully relax \n\nYour FIL doesn’t respect your privacy or  that it’s your home and garden \n\nAbsolutely take that key from him. He can pop round when he arranges it with you.  He’s been asked…  he’s been told … not listened?.. now he cant have a key!  Simples", "NTA\n\nYour FIL is wildly inappropriate.", "NTA he doesn’t need the key at best just another clueless and entitles male", "NTA. Change the locks, because I don't trust this guy to not just make a copy", "Your husband had handled the situation I don't understand why you would do what you did, it's like you don't think your husband was capable of resolving this!", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMyself (31f) and my husband (33m) recently moved to a house within a ten minute drive of his parents. Initially I was happy about this, because I've always had a great relationship with them. My husband and I both have keys to their house, and they have keys to ours.\n\nRecently though, I've started taking serious issue with the habit my FIL has of letting himself into our home without warning. It started when he would come over frequently to help us put things up in our house. While I've always been incredibly grateful for his help, I don't like that he never lets us know when he's coming or even which day (despite express requests for him to let us know). One weekend when my husband and I went away, my FIL went over to our house without permission or any prior discussion to work on our garden. \n\nIt just feels rude, and makes for awkward situations. So far he's entered our house when my husband and I have still been in bed, when I've just got out of the shower in a towel, or when we've got other plans. There have been times I've walked into a room thinking the noise within is my husband, and it's my FIL. He never seemed to acknowledge any fault in what he was doing either. \n\nNaturally all this was very frustrating and upsetting to me, and I spoke to my husband. To start with he thought I was overreacting, because I don't think any of it had actually bothered him yet. Of course when it started to he suddenly understood my point of view, and said several times he'd get his dad alone and talk to him. That's apparently because his dad can be easily offended and my husband still wants his help around the house. My reply was basically that I'd welcome his help and don't want to offend him, but he's overstepping our boundaries and I'm getting tired of not feeling like I can relax in my house in case someone bursts in. \n\nThe last straw came the other day. I was home alone and my husband texted to ask if his father could come over to grab his work boots from our garden. He wouldn't need to come in or anything. Before I even had a chance to respond to that, my FIL came into the house. He hadn't even bothered to wait until he'd been given permission, let alone respected my opinion on the matter.\n\nI politely but firmly told my FIL how I was feeling, and mentioned that if this continued, I'd feel uncomfortable with him having a key to our house and would like him to give it back. He instantly became very sullen and non verbal, put his key on the side table and left. \n\nMy husband thinks I've handled this wrongly by overreacting, particularly since his dad has told him he won't come round anymore, but frankly I was at the end of my tether with this situation and handled it as best I could at the time.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "Admittedly I'm unsure if my husband even brought this up to his dad in the first place", "And we'd always text him too, to ask us to let him know if he's on the way and he'd read them but not respond", "Right. We have keys to their house but always ring the bell when we come over. It's just common courtesy surely, unless you have an agreement in place to just let yourself in whenever, which we certainly do not have.", "I really do feel that way.\n\nIt started off feeling more like a bit of an inconvenience and that he was being well-meaning but a tad unthinking, but now it truly does feel like a huge violation of boundaries.", "Just from my perspective, if this were the other way around and my father kept bursting in and my husband had an issue with it while I didn't, I'd still talk to my dad and tell him to stop. I'd do it simply because my husband had a problem with it and I love him and care about his feelings.\n\nIt feels to me that because my husband didn't find it an issue, he didn't care that I did, which feels massively invalidating.", "If I were to come to someone's house to help out, I'd never think to be angry that my coming over was on their terms and not mine.", "I have doubts as to whether he even bothered to speak to his dad about this, frankly. Given that he thought it wasn't a big problem.", "Ultimately I felt like direct confrontation (but still done politely) was the best way to go. If my husband actually did talk to him, nothing had got through that way.", "To expand a little on your last sentence - as you say, if he's invited then he's welcome. I never told him that he's barred from our house or anything like that.\n\nIt's the barrelling into someone else's property unannounced and with no prior discussion or permission that just comes across so selfish and tone deaf.", "The thing about never being able to fully relax is something I tried to explain to my husband the first time I brought this up. He thought I was overreacting but I remember just saying things like \"even if you don't get my point of view on those things, can you understand how this makes me feel on edge all the time in our home?\"", "It's distressing to think that words wouldn't be enough to get this across to someone, and that actions such as the one you describe would even be necessary in the first place", "This is a good place to start...\"Did you talk to your dad since we discussed this (date)\" -- he needs to take responsibility for not navigating this relationship. It's unfortunate this was not a priority to him. Guess the free labor was more important."]}