{"id": 29091, "submission_id": "179vdzj", "title": "AITA for refusing to take a pregnancy test my boyfriend bought?", "selftext": "I F(26) was lying in MY bed last night around 7pm eating popcorn and cranberry cookies while watching a movie. \n\nMy boyfriend (28) who doesn’t live with me (but has a key) came over after work. \n\nHe recently got a new job and has been working nonstop for the past 4 months to save up for a new car. I’m talking double shifts, overtime, working 7 days a week, hardly sleeping - just working all the time. So as a result, I only saw him approximately 3 times in the past 4 months - and each time we DIDN’T do anything because he was super tired.\n\nAnyway, he came over last night to see me and berated me for eating cookies on my bed saying that I’m messy so I’ll leave crumbs for ants for bite him while he sleeps. I responded by just staring blankly at him for a couple seconds. \n\nHe said “oh, I forgot you’re on your period.”\n\nI said, “what? I’m not on my period.” \n\nHe looked confused and pulled out his phone. He said according to his PERIOD TRACKER - which mind you, I didn’t know he had - I was supposed to start my period since the 13th and by me not being on my period, it means I’m really late.\n\nI told him that I’ve been stressed with work and home life lately so maybe that’s why it’s not here yet.\n\nHe said “or maybe you’ve been having fun with other people while I’ve been working hard for us.”\n\nAt this point I’m offended and upset. \n\nHe then demands that I take a pregnancy test. I told him that I don’t just have pregnancy tests lying around. \n\nHe said “okay” and left. \n\nI try calling him - no answer.\n\nHe comes back 10 minutes later with a pregnancy test from the pharmacy up the street. \n\nI was appalled. My jaw is still on the floor.\n\nI told him that I am not pregnant because I haven’t done anything to get pregnant and I’m not taking a pregnancy test and that if he doesn’t trust me, when I’ve done nothing wrong, then he needs to figure out why. \n\nHe said If I can’t take a pregnancy test that just proves that I have something to hide. \n\nI asked him politely to leave and he did. \n\nI thought that was the end of it but this morning I woke up to a bunch of messages from him, his best friend and his sister - all calling me horrible names for “cheating on him.” In one of the messages he calls me an AH for not taking the test to “please his mind.”\n\nI haven’t responded yet because it’s 6:38am and I don’t know what to say. \n\nAITA?", "created_utc": 1697539163, "permalink": "/r/AmItheAsshole/comments/179vdzj/aita_for_refusing_to_take_a_pregnancy_test_my/", "score": 1098, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I might be the AH because I had nothing to hide so I could have just taken the test.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "So he reprimands you like a child for eating food in your own bed. Brings up your period and whips out a period tracker that he is used without your knowledge, accuses you of cheating, tried to force you to take a test for his benefit and then gets multiple members of his family involved telling them that you are cheating and gets them to berate you into doing what he tells you to do because he wants it.\n\nGirl this man is a controlling abusive AH run now because this will not get any better. Trust me. Is this the kind of person you want in your life?\n\nNTA", "NTA periods can get fucked up from stress, the fact he jumped right to 'youre pregnant cause you're cheating' is ridiculous, especially when he sicc'd his family onto you. Throw the whole man away, he proved he'll assume the worst and go running to his flying monkeys if you don't do what he says", "WHATTTT?? 🚩🚩🚩🚩🚩🚩🚩🚩🚩 \nGirl, change the locks of your house and dump the crazy guy! This is not a person you wanna be in a relationship with. \n\nHe has been \"working\" so much that you only been together 3 times in 4 months?! He berated you for eating cookies at your own bed on your own house?! He has a period tracker on you? He acused you of cheating without any good reason? He try to forced you to do a pregnancy test? He has been bad mouthing you and sprending this cheating nonscense? \n\nDump the guy!!! \n\nYou are NTA for not doing the test. You will be one if you let this behaviour of his going on.", "NTA\nIt sounds like he did something he shouldn't have and he'd rather make you the bad guy so he can leave with a clean conscience. I'd get your key back and tell him to fuck himself.", "NTA but get your key back before you break up with him.\n\n\"I can't believe I have to respond to this but here we go.\n1) I would never cheat on you. You can either accept that fact or we have some much bigger problems \n\n2) nobody but me should be tracking my bodily functions and there's no reason for you to have a period tracker \n\n3) I'll eat cookies where I damn well please in my house. As a reminder, this is my house - not your house. \n\n4) I'm not sure why I'm waking up to angry messages from your sister and best friend. I don't have the energy to deal with this BS over, as I remind you, eating cookies in MY bed watching a movie, and not taking a pregnancy test because it's unnecessary...and\n\n5) back to the cheating thing, is there anything you'd like to fess up for? Because the way I see it, I'm eating cookies in my bed one minute and then being berated about cheating the next. Periods aren't a clock you can set your watch you. You also clearly need to learn about how a woman's body works.\n\nDo you have anything to say for yourself?\"", "NTA. Get your key back and/or change your lock. Tracking your period? Taking pregnancy tests when he demands them? Oof. I wonder if he's been up to something other than work and he's trying to push you to dump him.", "Lol, 4 days late isn’t late. \n\nAlso, this seems like mad projection.\n\nNTA.", "NTA. Girl RUN. This is a major red flag. He’s controlling and ignorant, at the very least. Getting people to harass and berate you is VERY alarming. He’s trying to manipulate you into thinking this is okay, probably gave an exaggerated story to them to make you look like the bad guy. Is this how you want arguments to go for the rest of your life? Because this will only be the beginning.\nPeriod cycles fluctuate for many reasons and you’re not even a week late. Anyone with google and a brain cell has figured this out. He probably knows this and is really just trying to see what he can get away with. Getting people to pressure you to give into him. This is how abuse starts out.", "Get your key back. Block him and his flying monkeys. \n\nHe’s tracking your period?!\n\nOh and I don’t normally agree with the leap to ‘he’s done something and he’s trying to make you the bad guy’ but he’s seen you three times in four months and he’s not even attempted getting his end away?! Not normal 20 something male behaviour I’m afraid. I think he’s been busy. But probably not where you think he has.", "NTA (edited to add that part, which I forgot since I’m worried about your safety). Change your locks ASAP. He’ll have made a copy of the key if you get it back. This is classic abuser behavior so please also call the hotline about how to protect your own safety as much as possible in the breakup. You need to get this guy and his family out of your life, just be careful. https://www.thehotline.org/", "OMG.  He's tracking your period?  OMG.  And four days late is nothing.  I'm currently 15 days late and I'm absolutely not pregnant.  I'm stressed as hell and have had insomnia recently.  \n\nNTA and honestly, it might be time to dump the boyfriend.  If anyone else aside from him texts you about this matter, I'd respond with \"and this concerns you how?\" and then wait until you see they read the message and then block.", "NTA. Your BF is coming across as overly controlling and demonstrating huge red flags... ...RUN!!", "You sure he's really taking double shifts 7 days a week? I'm getting major projection vibes.", "NTA\n\nTime to change the lock and change the boyfriend", "Nta. \nQuestion::: With how hard he pushed the \"cheating\" narrative (especially involving family), could he be projecting? \n\nNext, he needs to go and take a health class to learn more about a female body. \n\nNext, he needs to apologize about the cookie comment. It's your damn house. \n\nLast, take the test, then berate him for calling you a liar and a cheater (make sure to berate his best friend and sister too). Get your key back, and say adios! You deserve better than this.", "NTA- dump this asshole.  He is displaying weird controlling behavior.  Is he messing with your birth control and tracking your period?\n\nThe cheating accusation is probably projection of his own guilt as it is in most relationship cases.\n\nLove yourself and dump the asshole.  You deserve better\n\nChange your locks.", "NTA\n\nCHANGE THE LOCKS CHANGE THE LOCKS CHANGE THE LOCKS OMG PLEASE CHANGE THE LOCKS.\n\nJust asking this wankmonkey for your key back will not cut it, he's probably made a copy the creepy period tracking weirdo. Block him, his family, and his friends on every messaging app and for the love of God change the locks.", "sounds like your bf is a manipulative insecure controlling AH", "Change the locks and block them all. That’s insane behaviour and he’s likely projecting. \n\nI have PCOS I can go months without a period. Period trackers are getting better but generally they work on the misinformation that everyone has the same cycle. He won’t have the exact details to input to make it more accurate either.\n\nHe’s controlling and creepy. Bin him. You deserve 1000% better", "Do not engage with this man or his monkeys any more. Get the locks changed asap, don’t bother asking him for the key. He is unhinged. This is not usual or healthy behaviour, and as such should not even be discussed or argued over. He is bad news.\nNTA.", "NTA. But I would have taken the test and dumped him.\n\n\"See? Not pregnant. As I told you. Given that you clearly don't trust me, I have no reason nor interest in continuing this relationship. I suggest you read a book and do some research before you get with your next gf. Bye.\" and then block on everything", "NTA: Good riddance. Write his sister what he did and then block all of them. Jesus. He would make your life miserable forever.", "He👏is👏cheating👏and👏projecting👏on👏you👏", "NTA this is a MASSIVE red flag.\n1. Why does he have a period tracker? Wtf?\n2. He obviously doesn’t trust you if he thinks you would cheat. He’s clearly very paranoid. Maybe he’s a cheat. In my experience the ones who accuse for no reason… are usually cheating themselves.\n3. ITS YOUR BED! If he has an issue with YOU sating food in YOUR bed, tell him to get lost!\nNgl, I’d get my key back… break up with him, and then take the pregnancy test just to send him a “goodbye AH” message with a photo of it😂🤣", "NTA unless you stay with him.", "NTA girl just block him and move on. What could this relationship possibly be providing other than angst.", "NTA. Dump his ass right away. And cut all contact with his sis and best friend who are siding with him without even talking to you first.", "NTA - You have an insecure and controlling boyfriend. I'd take his key away or change the locks. Don't be so naive as to think that this isn't going to escalate. And for him to drag his family into the narrative makes all of this even worse.\n\nDo yourself a favor and find an adult to date.", "NTA - Let's peal this union shall we? He:\n\n\\- has been working all the time for the past 4 months\n\n\\- complains about you eating cookies in your own bed\n\n\\- somehow feels that \"being on your period\" is relevant to stuff you are allowed to do, in your own home\n\n\\- allegedly  tracks your period (without your knowledge or being around you for 4 months)\n\n\\- has been working 'hard for us' where us means 'his new car'\n\n\\- tells people you have cheated on him without evidence or even a reasonable suspicion\n\nHonestly, the only redeeming thing in his behavior here is that he left when you asked him to. It sounds like the dude was itching for a fight with just this outcome. \n\nChange the locks, don't look back.", "NTA. Why on earth does he have your period tracked on his phone. That is so wild. Throw the whole dude out.", "NTA\n\nThis guy is a walking red flag. I'd either ask for keys or straight up change the locks before breaking up with him because I don't even know where to start with his controlling (if not even abusive) behaviour.", "NTA. 🚩🚩🚩\n\nHe just wants to get out of the relationship. No one starts a fight with “you are cheating” in 10 minutes after seeing you in a long time. \n\nHe wanted an excuse. He created it.", "NTA \n\nOk, this is a mini lesson in him you need to pay attention to. He has falsely accused you of something, then smeared you to the people closest to him based on that premise. He orders you around in your own home and tracks your period. He's the big martyr working hard for you, so he gets to treat you however.\n\nMy ex husband was a covert narcissist and unbeknownst to me he was smearing me with lies he told behind my back our entire marriage, and so when things ended I had an army of people to contend with while I was isolated by him to have no one.\n\nYou are being set up for failure.", "NTA\n\nHe seems like a controlling asshole. Don't answer him and take it as trash taking themselves out.", "NTA.\n\nHis insecurity isn't your problem. You don't need to jump through hoops for his peace of mind.\n\nI would get the key back and block them all.", "NTA\nGet your key back. Often the person accusing their partner of cheating is the one cheating. Don't let anybody treat you like this.", "NTA. He’s projecting. He cheated.", "Change your locks, get your *own* pregnancy test and send him a picture of it being negative, and break up with him. He's too controlling, it's really weird that he's tracking your period and even worse just assuming you've cheated and then telling his whole family because you wouldn't take the test. He's not smart and has no idea that periods are not exactly like clockwork for many women.", "NTA, this is so so so unhinged. He doesn't sound like a good guy. Please change your locks first and break up with him in a public place second.", "Change the locks and congratulations on shedding that ~180+ pounds of excess weight!\n\nNTA, he’s a controlling creep.\n\nEdit: Tell the ex to stop projecting and give you your keys back since he’s shown he’s untrustworthy (change the locks anyway though - he may have made a copy of the key).\n\nTell the ex’s sister and buddy he’s projecting due to his own guilty conscience, then block them. Not your (flying) monkeys, not your circus.", "NTA. As if the pregnancy test weren’t bad enough, the period tracker bit is so incredibly inappropriate. This boy has no sense for boundaries. Break up with him ASAP.", "NTA. Respond with don’t contact me again.", "Dodged a bullet there. Not just him but a whole family.", "NTA. You are dating an insane person. Also, when someone jumps to accusations of cheating, it's sometimes because they are projecting. He might not be MIA because of just work.\n\nYou might want to take a pregnancy test anyway to make sure you aren't linked to this AH permanently. Though if you were 4 months pregnant, you'd probably notice.", "Are you sure he is actually working that much? Its very common to get super paranoid about their partner cheating when THEY are the ones cheating.", "NTA. I agree with other folks - get your key back before breaking up with him. You've done nothing wrong and he comes over and tried picking a fight almost instantly. \n\nMe thinketh the man doth *project* too much.", "Nta. Red flags", "Drop him.", "Nta inform him and the others that he lied and who wants a liar like that. He is insecure in himself. Return my key in my hand and have a nice life.", "NTA.\n\nYour boyfriend is completely out of line, disrespectful and utterly delusional.  \nThat behaviour really isn't healthy in any way.  \nI would also like to add the possibility of projection: When someone starts accusing their partner of cheating out of the blue, there is a very reasonable chance that they are the one doing the cheating.", "NTA.  Tell you boyfriend  that you  trusted him when he  was working extra , but he doesnt trust you and now spreading lies.  It is time to break up, since he doesnt trust you.", "You said boyfriend. Surely you mean EX-boyfriend.", "NTA\n\nThe only correct response here is to change your locks, leave his shit in a pile on your front lawn (with the unused pregnancy test sticking out the top like a candle), and block him and all his people.", "nta. your boyfriend has issues bc firstly,  why does HE track YOUR period? esp without your consent.  get your keys back and leave him", "You don’t know what to say?\n\n“I’m going to need my key back” \n\nThe end", "NTA get your keys back and dump this creep.", "NTA \n\nDamn. This dude needs a reality check. There’s a multitude of reasons why periods aren’t on time. I was once late for 2 weeks and I never knew why as I certainly wasn’t pregnant. \n\nYou’re just sitting there, eating cookies in your own bed and he comes in and starts attacking you for no reason. He clearly wanted to bring up this period thing otherwise why would he have said it? Maybe he’s projecting, maybe he’s just paranoid. Either way the damage is done and he’s gone and told people you’re cheating when you haven’t been. Get your key back, or change the locks and then break up with him. There’s no coming back from this as once he thinks it, he’ll always be thinking it even if he says he isn’t. \n\nJust because you wouldn’t take a pregnancy test for his crazy accusations, he’s gone and destroyed the relationship and any trust you could have in him.", "NTA \n\nBut your bf sounds incredibly controlling. Also it’s pretty alarming that he has a period tracker on his phone that he didn’t tell you about. I would seriously consider leaving this relationship. Your bf sounds low key abusive.", "NTA. But you need to dump him. He is putting your body on a schedule and doesn't accept that nature chooses otherwise sometimes. And then he blames you for it. Not for not having your period on his schedule, no, for cheating and becoming pregnant as a result. \n\nThis is so fundamentally wrong, that I ask you, please, for your own safety, leave this man.", "NTA. Kick him out of your life for good. He's waving all the red flags for you to see. Change your locks to be safe because there's no way a dude this insecure and creepy hasn't made a copy for his bestie or his sister \"just in case.\"", "NTA\n\nAnd get your keys back and change the lock, just to be sure!", "Break up with him, massive red flags. \n\nNTA.", "NTA honestly cut all of them out of your life. I hate that reddit is always immediately \"break off\" but his behavior is disgusting in so many ways. Also get new locks on your door. Not just the key back", "NTA He’s too old to be acting like an insecure high schooler. The fact that he tracks your period is odd and him getting bent over shape over a couple days late and jumping to conclusions. It also sounds like he’s projecting some type of guilt. I think you should take this as a sign and take a step back from this behavior. Recover your key, but change your locks as well.", "NTA get your key back.  He’s either insecure, jealous and/or projecting.  He’s also lying to his family about you since he has no proof that you are cheating.", "He would have been out my front door as soon as I realised he was tracking my period.  Creepy as fuck! NTA", "Ex- you better mean ex. NTA he's very insecure.", " I don’t know what to say.\n\nHow about  \" this relationship is over\"\nAnd mean it.\n\nNTA", "Sounds like he's wanting an excuse to break up with you.\n\nTake it. See his ass to the door.", "Tell him to go and fly a kite. But worse. What a pratt. You don't need him in your life - PERIOD!!!!!", "NTA. Ask your landlord about getting your locks changed ASAP. Even if it costs you some money. If you ask him for your key back he could have made copies. Once the lock is changed, dump him. It’s weird that he would track your period. It’s also weird that you being late made him immediately think of cheating. Lots of women don’t have a clockwork cycle. I wonder if he’s the cheating one.", "NTA, him neither cuz he kindly showed you just why you should dump his ass so clearly.", "NTA - girl PLEASE get outta there. Block him and his crazy family, change your locks (don’t just ask for a key, he probably made a copy), and depending on where you live, call a hotline that helps with staking/abusive relationships and ask them how you can protect yourself. GET OUT OF THERE. This is a MASSIVE red flag", "If he’s tracking your period he might be trying to baby trap you. Literally had an ex do this with me. Red flags all around.", "NTA. what a red flag type of guy. the toxicity. i'd break up with him.", "🚩 🚩 🚩 🚩 run away", "NTA. He either grows the fuck up or will die alone and miserable.", "People who don't understand the basics of sexual health shouldn't be allowed to have sex. If you think 4 days being late means \"she cheated\" then buddy you need to get out of this adult relationship meant for adults and go back to school and study biology again. \n\nNTA Op, but your boyfriend should really be an ex at this point - that's how you respond. His trust issues are his issues and wanting you to pee on a stick to \"please his mind\" is utter bullshit.", "NTA, you say 'bye asshole ex boyfriend.'", "NTA, dump his ass before he starts abusing you worse.", "NTA but dump this man, he track your period, he berated you in your own house because you were eating cookies in your bed, what the hell.. \nHow do you think it's gonna be the day you start living with this guy ?", "The universe has a really nifty way of showing you your future without the aide of magic. \n\nNta\n\nKeep eating your cookies and move along to some else who isn't so insecure.", "NTA.  Please see the red flag…. Dump this guy.  Please.  He will not change.  He will be like this the rest of your life, and that’s not acceptable behavior", "NTA - get your key back from him and anything important and then block him. fuck this guy if he doesn't trust you. and don't take any fucking test from this bozo", "NTA Girl, run. This guy is dangerously controlling. He doesn't sound safe at all. He doesn't trust you. He is sick. Mentally sick. You are not safe with him. You deserve better. Don't bother asking for your key. He probably has a copy. Just change the locks today", "NTA sorry but dump him", "Nta. Change the locks. Block him and his crazy family.", "NTA ... and he told everyone he knows?\n\nI'de take the test, post a picture to all of them and tell them to never contact you again, especially you \"bf\".", "I would take a pregnancy test and show him the negative results when he comes over then tell him to leave his keys and get out. He obviously doesn't trust you and lied about you to his family and friends.", "NTA from what I hear it's usually those that cheat on their spouse that accuse with no proof.", "He hasn't spent any time with you for months because he's working too hard, and now he's mad that you're 'cheating' accusations like that rarely come out of nowhere. \n\nI'm thinking projection. He needs to make you the bad guy, because he knows what he's doing is wrong. I'm so sorry, but chances are high that there's cheating going on, you're just not the one doing it.", "NTA. This guy is violating boundaries left and right. \n\nText him back “I am not cheating. Accusing me of doing so has shown me that you don’t trust me. With your behavior about this, I’m starting to wonder if you’re projecting and are cheating on me. Either way, it doesn’t matter anymore, because you can consider yourself single now. I expect you to return my key within the next 24 hours.”", "you got rid of the asshole easily and quickly.", "NTA He shouldnt be your BF. He was out of line. How would a negativ test even prove you didnt cheat? he would just jump to the next conclusion and say that at least you used protection.\n\nMaybe he was trying to make YOU break up?", "NTA \n\nWtf?", "NTA. Seems sus on his end to just jump to that conclusion. Bet he's the one doing it.", "NTA but can you say red flags???", "NTA. It’s exceedingly weird that he tracks your period. That aside, he was waiting for a reason to accuse you of cheating. He’s seen you three times in four months? My guess is he’s projecting. I wonder who’s in his bed when you’re not there.", "NTA. Red Flag! Please break up and move on.", "NTA, he’s being really creepy.", ">while I’ve been working hard for us.”\n\nUs? Dump him.", "NTA. Well, he showed you who he is. You’ve barely seen him lately, so ending the relationship shouldn’t be that hard.", "NTA.\n\nMarinara flags all over. This looks like coercive control to me, my advice would be to break up with him, change the locks and stay somewhere safe with someone else for a few days.\n\nIf he's capable of this behaviour over something so small I would be concerned how he would react in the future if you do something he doesn't like.", "I would take the test proof him wrong and break up with him.", "Don’t worry about getting the key back, change the locks and break up with him.", "Maybe I'm petty but I would take the test and demand an apology.\n\nThen I would dump him.", "Yo, don't be daft. This relationship is over. He told his whole family you cheated on him. You'll never recover your reputation from that, not that this man is worth it. Move on. You know you're worth better than that.", "🚩🚩🚩🚩🚩🚩🚩", "NTA. \n\nHe got someone else pregnant or he's worried he might have.", "NTA get your keys and get rid of the guy.\n\nI have heard of the jealous type who will spy on phones and computers, I have heard of the very jealous type who can't stand knowing that you talk to the opposite gender during the day, I have heard of tracking the location, but this has to be a first.\nA pregnancy test to prove you didn't cheat? What could possibly have crossed his mind to behave like that and ask you that.\n\nAnd his behavior is very suspicious, you don't usually suspect that unless you have yourself something to hide or try to find an equal screw up in a partner... Plus the mother and sister giving their thoughts, I really think he wants an easy out without looking like a jerk.\n\nAnd of course, you were very right to refuse to take the pregnancy test. I really don't know how other women are ok with such an invasion of privacy, I wouldn't do a pregnancy test required by someone with trust issues. It starts like that and then it's the phone, who you are seeing, who you are talking to, what you're wearing...", "NTA but girl GTFO.", "NTA. Make it clear to everyone what happened. I think he is projecting? Or has someone in mind and was afraid he has to own up and be dad?\n\nEither way, this is not ok! Run.", "The guy doesn’t trust you and is a controlling asshole (a period tracker, WTF).  There is not a pregnancy test in the world that saves this relationship. NTA. Get out of this relationship please.", "NTA\n\nHe’s insecure and controlling. And his first thought was to trash you to his friends and sister. You refused his stupid loyalty test, and he jumped straight to allegations of cheating on him.", "Just copy the next sentence.\n\nScrew you and your appalling controling behaviour,you can pick up your toothbrush on friday 8pm,if not it can be found in the trashcontainer.\n\nNTA like who has a period app of his gf in secret,even worse the thing woth the test to please him", "NTA. Buy more cookies, change the locks. This dude sounds insanely controlling.", "how about: what kind of crazy pills do you all take and his only evidence is a perriod tracker he has on his phone WITHOUT MY CONSENT AND KNOWLEDGE.  NTA. his stressed that much is clear. but berating you is so much out of line ... Red flag city", "Obviously NTA for all the reasons people have listed. But my main confusion is, why does he not know that you can clean crumbs out of a bed? Eating in bed doesn't mean you just leave the crumbs there. Hell, even if you just brush them onto the floor, no ants in the bed. What a moron.", "NTA\n\nRun fast, run far.  This is not normal, it's not healthy, it's not okay, and it doesn't get better from a place like this.", "Tell him to fuck off…..100% NTA", "It’s your apartment. If he doesn’t like where you snack then he can go to his own apartment. NTA- but you need to reevaluate this relationship.", "Why would you wanna stay in this relationship?  I do t get it", "Lace up your sneakers and run.", "I don’t know any man that would take it upon himself to purchase a pregnancy test.", "NTA he sounds like a fucking weirdo", "Oh honey, please drop that man like the sack of \\*dookie\\* he is. \n\nYou do not have anything to prove to him  just because he's been working a lot and neglecting your relationship, no matter whether that's for a new car or not. He has no reason to distrust you other than the fact you are not currently on your period, but we know that stress can impact periods, because menstruation sucks ass. Also, I would have kicked him straight out when I found out that he had an app like that because it's a massive violation. What the hell does he use it for? Even if a partner of mine used it so he knew when to bring chocolate gateaux home and be extra nice, or so he could predict when I was going to wake up at 3am and be on the bathroom floor because of the pain I was in (ADHD means tracking it myself doesn't happen) I would feel like that was such a violation if he had done it without discussing it with me first because it's my body, my hormones and I just find that really ick. He's now doubled down on his cheating accusations by including his friend and family? Nah, mate, this boy is a controlling jerk and you can't let this behaviour stand. \n\nYes, you could have just done the pregnancy test because let's face it, peeing on a stick doesn't hurt or anything, but not being pregnant doesn't prove that you didn't cheat. (I'm not saying you did, of course.) I can understand what he means about not eating in bed, but I also understand that stress and being overworked, even if it is willingly, can cause things like depression which make you want to eat in bed or mean you don't care about these things. \n\nYou are absolutely NTA.", "NTA. This is your EX boyfriend now I hope. What an absolute jerk. Get your key back and get a new partner who treats you with respect.", "NTA. Look man, I am not usually a Reddit relationship conspiracy theorist. But taking it upon himself to track your period (without telling you!), seeing you 3 times in 4 months, not having sex any of those times, and then immediately jumping to accusations? Honestly sounds like he’s sleeping around and tracking periods to not get anyone pregnant. Idk, cheaters go to insane lengths to not get caught.\n\nSeriously, what 20-something (no matter the gender) goes 4 months without seeing their s/o regularly and isn’t at least trying to do anything on the rare occasion they do see each other?\n\nLastly, he literally, immediately told his friend and sister, who are probably gonna start a chain reaction of gossip. He’s trying to paint you as the bad guy.", "I felt stressed just reading this. He is projecting stress onto you, imo. NTA. \n\n Edit: After reading the comments, I'm not bugging lol. I would also want my key back (and change locks)...and would start considering how I should part ways.", "I’ll bet him having a key was his idea…he sounds creepy- who tracks another person’s period??!??", "NTA. Sorry, but if this happened yesterday then your “super late” is 3 days late?? That’s not even really considered late by my standards. That’s well within normal date fluctuation. Especially is stressed. What a butt. I wouldn’t take a test and I wouldn’t continue to date him. Clearly he has no trust in you and no logic or reasoning abilities.", "NTA and WTF. GIRL, RUN", "NTA. He was expecting you to have your period, so he came over with an attitude and then was going to pin any fall out on your emotions. That was the first thing I noticed. That isn't healthy. \nHe told you he doesn't trust you. Listen to that.", "NTA   Are you sure that he actually working all the time? Cause it sounds like he’s doing a whole lot of projecting. He clearly was looking to pick a fight with you.", "How is this even a question?!?!\n\nNTA and the BF is obviously a mentalist.\n\nRun very fast.", "NTA. There's dozens of reasons to be late for, or miss, a period. And I don't know if four days even counts as \"late\" or is that just a normal amount of variation? Him jumping immediately to you cheating as a reason is extremely immature and insecure of him. Huge red flag. No, you absolutely should not need to placate someone's fears when they indicate a lack of trust in you. It's his problem if he doesn't trust you, his thing to work on, not for you to appease by doing what he says when he worries you're cheating. Doing that would only validate his insecurities and let it continue, when in reality he needs to figure out how to trust.", "NTA. Change your locks, and dtmf, in that order, asap. If he asks, make it about what he did (disrespected you, tracked your period which is creepy af, and broadcast your business to his nearest and dearest), not what you didn’t do (cheat).", "You block all their psycho asses and get your locks changed today what the actual fuck. \n\nNTA", "NTA. Run. The boyfriend, his friends and his family are bad news. \n\nThe complaint about cookies in YOUR bed is the kind of entitled, this is my bed bullshit that's a big red flag. \n\nAlso, don't eat cookies in bed.", "Get your key back and tell him to fuck right off.", "I never believe these posts. How does everyone have an issue then all the sudden all the significant others family, friends, etc. all harass OP. Either everyone is dating crazy people with crazy families or they like making things up.", "YTA to yourself if you stay with him. This is not a healthy relationship.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nI F(26) was lying in MY bed last night around 7pm eating popcorn and cranberry cookies while watching a movie. \n\nMy boyfriend (28) who doesn’t live with me (but has a key) came over after work. \n\nHe recently got a new job and has been working nonstop for the past 4 months to save up for a new car. I’m talking double shifts, overtime, working 7 days a week, hardly sleeping - just working all the time. So as a result, I only saw him approximately 3 times in the past 4 months - and each time we DIDN’T do anything because he was super tired.\n\nAnyway, he came over last night to see me and berated me for eating cookies on my bed saying that I’m messy so I’ll leave crumbs for ants for bite him while he sleeps. I responded by just staring blankly at him for a couple seconds. \n\nHe said “oh, I forgot you’re on your period.”\n\nI said, “what? I’m not on my period.” \n\nHe looked confused and pulled out his phone. He said according to his PERIOD TRACKER - which mind you, I didn’t know he had - I was supposed to start my period since the 13th and by me not being on my period, it means I’m really late.\n\nI told him that I’ve been stressed with work and home life lately so maybe that’s why it’s not here yet.\n\nHe said “or maybe you’ve been having fun with other people while I’ve been working hard for us.”\n\nAt this point I’m offended and upset. \n\nHe then demands that I take a pregnancy test. I told him that I don’t just have pregnancy tests lying around. \n\nHe said “okay” and left. \n\nI try calling him - no answer.\n\nHe comes back 10 minutes later with a pregnancy test from the pharmacy up the street. \n\nI was appalled. My jaw is still on the floor.\n\nI told him that I am not pregnant because I haven’t done anything to get pregnant and I’m not taking a pregnancy test and that if he doesn’t trust me, when I’ve done nothing wrong, then he needs to figure out why. \n\nHe said If I can’t take a pregnancy test that just proves that I have something to hide. \n\nI asked him politely to leave and he did. \n\nI thought that was the end of it but this morning I woke up to a bunch of messages from him, his best friend and his sister - all calling me horrible names for “cheating on him.” In one of the messages he calls me an AH for not taking the test to “please his mind.”\n\nI haven’t responded yet because it’s 6:38am and I don’t know what to say. \n\nAITA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "NTA. What a jerk. That kind of controlling behavior is a huge red flag and he has no right to accuse you and force you to take a test to prove anything to him. That would be it for me, I say get out.", "NTA. There are a lot of concerning red flags here. \n\nThis is not healthy relationship behavior. \n\nI'd encourage you to change the locks, like others have said, and cut ties with him.", "Nta\n\nYou dodged a bullet.  End things now, block everyone", "nta. break up, leave anything he gave you or you have him because he seems unsafe to be around and BLOCK HIM( and tell his sister specifically what he’s doing). any man tracking your cycle without consent is a red flag!", "NTA. He is acting very suspicious. I’d be worried his guilty conscience is making him paranoid.", "Dump his controlling ass. NTA.\n\nThat is NOT normal boyfriend/husband/significant other behavior.  Also, even with a period tracker, it's not always right. Do not take a test for him. Leave him", "Run", "NTA - guarantee he will become more psychotic", "Change the locks, if he is willing to do this who knows how much he will push this issue. He is irrational and can act accordingly. Safety first.\n\nNTA.", "NTA but I suggest to change the locks, take the test, take a pic of the result, send it to those who call you a “cheater”, before breaking up. Make sure you break up at the presents of your friends and family.", "Oooh wow. Um, yeah. NTA", "NTA, i'm not sure if it's the way you wrote it or it's just really creepy behaviour. Period tracker is not so bad (he at least know when it's time to not get on your nerves or buy some stuff to help you get through ), but the way he acted after you told him you're late because of work related stress is really weird.🚩 Then went away and spread rumors about you cheating just because you think he was acting ridiculous. Like he doesn't trust you. 🚩\nTaking test to please his mind?🚩 What else he demand in future to \"please his mind\". Paternity test? Since he called you cheater now. 🤷‍♂️", "NTA a guy keeping a period tracker on his phone for his GF is about the most intrusive thing I’ve ever heard… wow", "NTA \n\nHis behavior just makes me scream **EW**\n\nGet out of that relationship and get your key back or change your locks", "NTA. Periods can vary for a variety of reasons and the fact that he’d rather track your period than trust you with your own body is a massive red flag. Get out", "No response required. A simple block will do.", "Seems very manipulative and crazy to make you feel that way out of the blue. You should be rethinking him and his actions than wondering if you’re in the wrong", "NTA.  Dump this train wreck and change your locks.  Have you seen any of this extra money he’s supposedly making?  Sounds like he’s actually the one cheating and projecting it onto you.  And tracking your period without your knowledge is creepy af.  Best to just wash your hands of him and move on.", "NTA. Get your key, change the lock if possible, and break up", "NTA periods are weird. A huge amount can change them. Honestly I’d take the test - prove it’s negative and then send him the picture with a text dumping him. Block him and get your locks changed. Girl I’m so sorry that he sucks so hard.", "Dump his controlling ass, after you change your lock.  Forget the key, he probably made copies", "Girl. C'mon. You know the answer to this. Block him and go on with your life!", "NTA jeez lots of controlling issues here, drop this guy like a 2-foot put,", "This guy is absolute trash and a walking red flag. Don’t bother to get your key from him. Change the lock and never speak to this person again. \n\nNTA", "NTA your boyfriend is psychotic break up with him immediately. Change your locks. He was tracking your period without your consent?! That’s so creepy I have no words. His immediate assumption that your cheating makes me feel like there’s a strong possibility HE is cheating which is why you haven’t had sex. This is insane. Leave", "I’ve only read half way through this and going I say.. your boyfriend is an arsehole and a paranoid one of that.. dump his ass asap op.", "He’s cheating. If he’s calling you out like this for cheating…he’s feeling guilty and displacing it on you. Also…run. Run like hell. Get out of that relationship. Change the locks since he has a key. Don’t play this game.", "This can not be real. I refuse to believe that someone who can afford to live on their own actually chooses to spend time with this unhinged, extremely creepy, asshat. Eeew. Get far, far away from this guy.", "NTA\nRun! This guy will ruin you!", "NTA, please break up with him for your own sanity", "NTA. But none of this is okay. Tracking your period?! My husband can barely remember my cycle…that is so so not normal. I would take your key back and work on things when you have the time to sit and talk. Actually I would run 🫣", "NTA, dump his ass this guy is a huge red flag factory; not only is he accusing you of cheating he also installed a period tracker without you knowing about it?! That's super weird behavior.", "NTA.  He’s going to bring you a life of misery (him AND his family & friends) if you stay with him.  This is all the warning you need!   He will get worse.", "Bro cut and run before you end up a new story. NTA", "NTA- What the literal fuck.  Who shows up at someone's house, *berates them* for eating cookies *in their own bed*, keeps a period tracker on their partner without their knowledge, and then demands a pregnancy test because they're going off on information they formed themselves about *your body*?????\n\nHonestly OP, I don't think you'd be losing out on a breakup.  Maybe you'll actually gain some peace of mind without this guy monitoring your eating habits and menstrual cycles.", "NTA\n\nIt’s your house. I’m sure you’re old enough to know how to eat in bed without leaving crumbs. Also, he’s an idiot. He can track your period but doesn’t know how it works. I’d honestly set up a group chat, explain the cookie thing, his horrible behavior, and tell them all it’s over because clearly he’s done something wrong he’s trying to compensate for. Tell him to keep the key because locks will be changed today. Then block them all. Enjoy your cookies and catch up on some sleep.", "NTA. I was already done with periods when these types of apps came out. Is it common for bf/husbands to download these? It seems a little creepy to me but I’m a boomer so what do I know. Lol\n\nEverything about this situation is weird. He’s tracking your periods and is trying to force you to take a pregnancy test because of some insecurity on his part, telling you what you can and can’t do, then berating you when you don’t do what he wants. That’s some controlling behavior. \n\nYou haven’t had sex in over 4 months? Are you sure he’s really WORKING non-stop? Sounds like he might be cheating and projecting it onto you. JS.", "“I expect my key to be returned through my letterbox by the end of the day. I have not cheated, but since you feel it’s appropriate to slander my name to anyone who will listen I am not prepared to even attempt to resolve this as I now know I can no longer trust you at all. Maybe once the stress of dealing with you has gone from my life my period will see fit to return. This is not a discussion, a quick google search would have shown you that what I was saying was feasible but I am incredibly hurt that your first assumption was that I had been unfaithful. Goodbye”", "NTA. Change your locks and dump him. That is crazy behavior and it won't improve. There are exactly zero reasons to stay with someone who thinks you're a cheater. Oh and FYI - a lot of times it's projection. Cheaters tend to think other people cheat.\n\nEdit: typo", "Who did he knock up?", "Do not sweat it at all. Leave him and never look back. He has some serious trust issues. His accusatory comments w/o merit is insulating. He is not working hard for \"us\" unless you told him that you two need a car.", "NTA. No need to get his key back, because you're changing the locks.\n\nThe cookies sound awesome.", "NTA… and DONT ask for the key back. All those red flags says he has a back up. Call your landlord and have the locks changed.", "Nta. Does he not know you can be late on your period. Goodluck to you when it does come, I know when my partner gets hers late it hurts more. Hopefully you guys can have a conversation about this when he gets sleep because I believe he is being irrational at the moment. But maybe it's better for you guys to go separate ways.", "Yikes, this is full of red flags. Find someone new who respects you, please. Tracking your gf’s period is fucking weird.", "I'd send a group message with the lot of them saying 'before you start name calling I'd like to clear up some things. 1 I was accused because I wasn't on my period when his tracker states I should be which I wasn't aware he was tracking anyway which as you know (if you passed biology) many things can impact how regular your periods are for 1 stress which I explained to (bf). 2 this all began because I was eating cookies in my own house in my own bed which bf doesn't approve of despite it not being his house. 3 it is no one else's business but mine and my bf so perhaps before sending abuse consider your not getting the whole story im now blocking you both. Then demand your key back from bf", "NTA. Your boyfriend is very controlling. It's not okay that he's dictating what you should and shouldn't do in your own house. And him tracking your period on his phone is just weird. If you ever move in with him, expect him to not respect any sense of privacy you have.", "NTA - how many women's cycles run like perfect clockwork?  I've never heard of one.  If he is working, he needs an education on women.  However, I think he is the one cheating and try to make a big deal about it being you to rally support.", "NTA, just reply to them telling them that he has fed them false information and it is not you that has cheated but him. That you two are broken up now and you don’t want them to contact you again with their false accusations.\n\nIf he can accuse you of cheating without evidence - then so can you.", "usually I condemn those instant hints to break up reddit usually comes along with, but this time... NTA obv, I would take it, show him it's negative and leave him. If it's positive, you deserve it", "Definitely NTA, he sounds like a tool.\n\nBut, serious question - why is it weird to vaguely keep track of your partner's cycle? It has some impact on what she may or may not want / be able to do, which is at least somewhat relevant for making plans, and I've in fact had partners who shared their tracking app data with me so I'd always know. I'd never confront her about it being not according to my predictions, because I'm older than 12 and know it can be irregular for a billion and one reasons, but there are a lot of responses here making out like it's hyper creepy.", "Dude if there's nothing to counter this red flag then have fun lol. Everyone slips ups and over reacts so remember that and think about your relationship before listening to the 94639363926143960 internet strangers that say leave his ass", "Eating food in bed is disgusting, but the rest of his stuff here is psychotic.\n\nYTA for eating food in bed\n\nNTA for everything else", "Women can't be trusted I understand his mentality", "NTA, but I find the number of people here telling you to end the relationship based on something so trivial to be simultaneously, disheartening and laughable. \n\nThese people clearly have no idea what the dynamics of a real long-term relationship are, but people in relationships, from time to time, put up with some ridiculous shit because usually, eventually, you’re gonna be guilty of giving just as good as you get. \n\nDon’t take the test if you don’t want to.. tell him that’s nonnegotiable. Tell him to calm the fuck down, and not bring it up again if he wants any chance for you to forgive him when he’s proven wrong, because when that happens, he will feel foolish. \n\nI don’t understand the lack of empathy and patience, all of these people have, and yet consider themselves relationship experts. You’ve only seen each other three times and how long? Months? People say and do stupid things. It doesn’t make them bad people. If you feel like he doesn’t care about you or actually doesn’t trust you,, that’s a problem. But honestly,, I think all of these people are either incels or asexual, because you can’t have a relationship with another adult without having to demonstrate kindness, patience, and forgiveness. It just will never happen. They’re certainly not married or parents and I shutter her to think how they were raised to have this mindset. I guess just allowed to be completely selfish and assured that it’s somehow going to pay off for them in the long run, but it won’t.", "You’re not the AH but you should have told him to not let the door hit him in the arse as he left. Get rid of him now because things will not change. He will never trust you. NEVER.", "nta", "NTA. \n\nI was going to ask if he’s on drugs but then I remembered you said he’s been working a lot and not getting any sleep. His mental is right atm. \n\nIt’s crazy that his solution was to have you piss on a stick. \n\nHis friends and family are definitely out of pocket though. If the relationship ain’t that serious, you should sit your ass right there and keep eating your cookies. If he doesn’t come to apologize. Then that’s that.", "NTA\n\nI'm wondering if he is trying to deflect his own cheating. And what kind of person has a period tracker for their girlfriend, and without her knowledge? I'm married and I don't even have a tracker for my wife because it isn't any of my business unless she wants it to be.\n\nAs for the food in bed, it's your place so you can do what you want. If ants got int he bed they would not be like \"ooh, their is \\[bf\\], let's go bite him.\" \"No, don't bite \\[OP\\], she fed us today.\\].\n\nThis guy is throwing some massive red flags and you should probably get out now. \n\nChange your locks and get rid of him. It is not worth the trouble and he will likely get worse.\n\noh, and what kind of cookies? I'm curious now.", "NTA. periods get fucked up for all kinds of reasons. Most of them are not pregnancy scares. \n\nStress is a common one. Illness- I straight up skipped September because I had 102F fever for 3 days when I should have had it in September.\n\nI straight up skipped every period in 2020  because of stress. \n\nI later did get diagnosed with PCOS so it might have been both in 2020. But periods while they are supposed to be regular aren’t always. Sometimes your body’s schedule just changes", "NTA\n\nWhat the hell did i just read. leave this guy immediately!! Controlling, toxic, red flag central.", "Whoa! Red flags flying everywhere! Get your key back and and let him know it’s not working out.", "NTA. This insecurity won't get any better. He's tracking your period because he will never not be satisfied that you're faithful. You can do better. Change your locks and break up with him.", "Please run FAR AWAY NOW PLEASE FOR THE LOVE OF GOD.\n\nHe is so sick in his head. You dont want to live like this rest of your life!!!", " Absolutely not", "NTA, get your key back, maybe even change locks. And fire him.", "NTA - I’ve heard of people tracking their partners period so they can make buy snacks/treats and maybe supplies they know they prefer. It sounds like he tracked your period with the intent to make sure you don’t cheat? In a weird way I almost hope he was cheated on on the past because that’s the only way I could see even attempting to justify such unhinged behavior. \n\nTo sisters/friends I’d send a copy/paste of: “X showed up to my apartment and made a comment that I was on my period. I stated I wasn’t and he showed he had been tracking my period without my knowledge. His response was to accuse me of cheating and try to bully me in to taking a pregnancy test which I refused. I will not allow myself to be berated by him or others for his uncalled for behavior.”\n\nAs for the (hopefully ex), I’d ask him for your key back and block him on everything.", "NTA - girl you can do 100x better than dealing with this nonsense. Normally I wouldn’t jump to a “break up with him” response, but this is fucking ridiculous. I’ve never once heard of another guy having a period tracker for their spouse UNLESS they both had the same app and were tracking ovulation together (ya know, WITH their doctor etc). To assume you cheated and are pregnant, then demanding you take a pregnancy test, THEN tell his best friend and sister you’re cheating simply because he didn’t like that you were eating in bed?!?!?!?!? This is a whole different level of crazy I haven’t encountered and I’ve seen some shit. \n\nThis isn’t just a red flag. It’s THE red flag lmao", "NTA he threw up major red flags.", "[removed]", "Change your locks and NTA", "This is one of the most insane things I've ever read\n\nHe does not have the right to act the way he did in many many ways: behating you for eating cookies on YOUR bed, tracking YOUR body, demanding you do a pregnancy test, telling made up shit about you to other people, allowing them to be aggressive to you...\n\nThis story is one absurdity after the other. He's controlling and if I would guess probably cheating on you and projecting", "Change the locks. You are done with this person.", "Dudes fucking weird, tell him to get fucked.", "NTA, obviously. But is there a single man out there who both secretly tracks his partner's cycle and understands that 28 days is not applicable to all women and that most women's fluctuate by a few days anyway? I swear everytime I hear about one of these dudes, they fuck it up but are convinced they're the authority on it.", "He’s 100% picking a fight and trying to make you look like the bad guy. \n\nAt minimum, he’s purposefully taking the cowards way out. At worse, he’s projecting big time. \n\nI also doubt his sister or best friend have gotten the full story. I can’t imagine another women would take the mental leap from ‘*slightly late period*’ to ‘*she’s 100% cheated and is pregnant’.*\n\nNTA.", "NTA \n\nMy concern would be that he ran to cheating so fast , he must be projecting. \n\nAnd now I’m asking myself if he’s actually working when he say he is.\n\nBut regardless of whether or not he’s cheating , he crossed a line. No one walks into my home calls me messy and then a cheater.\n\nI’d text the sister and friend that I’m dumping his untrusting butt and then block all of them, and have my locked changed.", "All I have to say after reading all of that is...WTF?!?  So your boyfriend is tracking your periods with an app on his phone.  He demands that you take a pregnancy test because HE has trust issues and is a controlling as-hole.  Now he and his entire family are harassing and abusing you because he wasn't able to bully you into taking a pregnancy test???  Oh girl...you can do soooo much better than this.  DTMFA and don't look back!", "NTA and most likely this is a helpful warning sign indicating it's time to get out of this relationship BUT given that you've said he has been working non-stop and might be seriously stressed, his immediate jump to \"you cheated\" might be more indicative of his stress level and/or exhaustion, rather than a sign of what he will be like long term. That said, his having a tracker for your period on his own phone is pretty damn weird so it is definitely time to have a discussion about why he does. There is the very slight possibility he saw it as supportive rather than creepily invasive or possessive.\n\nAnd now I'll take off my rose colored glasses and repeat, most likely you should just run away.", "Looks like he bought the test at the red flag store.\n\nNever trust someone who Flys off the handle over a cookie.\n\nNTA", "The tracker Has probably been a day off here or there the whole time because he probably doesn’t have perfect details in his little secret tracker.  I bet you aren’t even late.  The idea that he would even secretly track you is creepy.  It’s like he thinks he needs to know to manage you.  And what is this about you eating in your own damned bed?  He needs to fuckity the fuck fuck off.", "NTA but dump this idiot and block his family. So not worth it", "NTA. Hope you break up with this lunatic.", "You absolutely do not need that level of insanity in your life. Tell him if he has that little faith in you, then he isn't the person you need in your life. Tell the rest of his family that he is an idiot, you have nothing to hid, he is making baseless accusations, and you won't stand for that kind of disrespect. They can all pack sand. Then block the rest of them too. NTA", "Respond to him, his sister and whoever else in a group text:    This issue is now mute, george and I have broken up, therefore there is no reason for any of us to communicate again.   Have a nice life.”      Then block them all and change your locks.    Just be done with the whack a doodle.   If he says stupid crap like this now, it will only get worse the longer you are together.   He has no trust in you and does not value you.    Please don’t do this to yourself.", "NTA dude wtf lol that story was fucking bonkers I'd break up with that dude he's probably cheating", "NTA\n\nWTF. Change your locks, block him and his family. He showed you who he is. Believe him and dump his ass accordingly.", "Oh boy he’s projecting. Have fun with him cheating on you. NTA obviously.", "Omg run. NTA.\nI’ve been like 1-2 months late sometimes. And yes it has to do with stress. Dudes insane to jump to that conclusion and then without any proof other than his lack of basic biology, he went and told ppl you’re cheating on him?? I can’t even imagine what he’s telling ppl about other things in your relationship. Tracking your period… he probably rates your sex and cleaning skills. Throw him out.", "NTA, change your locks. What a controlling turd.", "NTA\n\nChange your locks and block him.\n\nHe has shown you who he is really is, don't ignore it, don't give him the benefit of the doubt, get out and forget him. No one deserves to be treated like that.", "NTA. change your locks and be done with him. That level of paranoia and mistrust is dangerous. Get out!", "NTA. dump his controlling insecure ass and change the locks", "NTA - Change your locks to a key he doesn't have.", "Can people stop dating men already? I’m tired of hearing these crazy unhinged stories with this deranged gender. They make the lives of women significantly harder and worse. We need a mass exodus and let these crazy men stay alone like they deserve.", "Girl, he’s projecting. \n\nHe’s likely sleeping around on you, and therefore assumes you’re doing the same to him. It’s a tale as old as time. \n\nChange your locks first, then break up with him. You deserve better. \n\nOh, and NTA.", "NTA\n\nThis is coercive, controlling behaviour. \n\nTracking your periods is a massive red flag.\n He has no need to be tracking your periods, especially without your consent. I doubt he is tracking anything but is using it to 'justify' his demands for you to take a pregnancy test.\n\nAccusing you of cheating is a red flag.\nHe has no reason to suspect anything, he has clutched at straws to find an excuse to accuse you of being unfaithful.  This does not happen in a healthy relationship.  He knew he was going to get all theatrical and go and buy a pregnancy test. It was all a show. \n\nAsking you to take a pregnancy test is a red flag. Again, he has no legitimate reason to suspect you. He is trying to see what he can coerce you into doing. You have nothing to prove, he is being completely unreasonable. \n\nInsulting you is a red flag\nYou said he called you horrible names, and has recruited people close to him to join in. This is bullying and harassment, and not part of a normal healthy relationship. Again he is trying to coerce you into doing something for him tk prove your faithfulness. Fuck him. \n\nMy advice? Block him and move on. He is an absolute arsehole. Also change your locks for your safety.\n\nEdited to add nta", "If hes tracking your period check your coats, bag and car for apple I tags and similar devices and check your phone for tracking software.. and I'd check your house for hidden cameras cos whatever is wrong with this male hes clearly been hiding his paranoid personality disorder and is potentially full blown stalking you when you are unaware.. also change social media passwords ASAP \n\nAnd dump him, change the locks immediately and block him and his family", "Run fast and run far. He has a period tracker on his phone wtf.", "Sounds like he is having a stress induced psychotic break. A buddy had this same thing happen after too much work and no sleep. Time to say goodbye. NTA", "NTA.\n\nThe guy is controlling for sure and could end up being abusive. Please leave him.", "Take the test then throw him out with it. (Only take it to rub it in that he’s a stain)\n\nAlso send his sister and friend this post and a pic of the piss stick. Aaaaaand block\n\nNTA", "Respond to everyone on one group chat “I’ve never cheated, he’s just an insecure idiot”\n\nNTA but you’ll be one to yourself if you don’t dump him", "NTA and change your locks. And phone number. And possibly your name. Run far from this dude.", "Definitely NTA. Like plenty of others have said it seems like he is projecting his own behaviours onto you. And even if it isn't the case, the fact that he seems so controlling and immediately jumps to accusing you of cheating out of the blue with no logical reasoning is a major red flag. Jump the ship!", "Change the locks to your house and block his ass and everyone that’s associated with him. Cause WTF?!", "NTA - get your key back immediately!!\nHe shouldn’t be tracking your anything. He sounds insecure and you shouldn’t have to deal with that.\nAlso, eat what you want, where you want it’s not his place to dictate what you do.", "nta", "NTA  Block all of these toxic fuckers", "Not only NTA but this is how abusive partners test the waters. They do small things like this to see if you will abide or if you do question this request they will pull shit like this to manipulate you. If this doesn’t work and you hold your ground he will make an excuse for this behavior and try to win you back.\n\nThis is your chance to get out of this mess of a relationship. So many red flags I am not going to bother naming them all. Also after reading some of the comments lots of people have already highlighted them. Please change the locks to your apartment and break it off with him.", "Hey OP you’re NTA but you should do this easy math equation with your boyfriend. \nSubstrat him from your life, substrat your keys from him, add him to your ex list, add him to your block list and see that the result equals piece of mind.", "NTA. He's controlling, and the cheating accusation is wild. \n\nUnless you were TTC, it is reasonable to wait longer  to test. Cycles absolutely go bonkers due to stress.", "NTA the fuck, get rid of him him", "I would take the test, through it at him and tell him to gtfo\n\nNTW", "In the last 30 years, my period has never been EXACTLY when my tracker has said I'm due. Sometimes it's been right, but I use it more of a guide to make sure I've got supplies in the house. \n\nMy husband has never had a clue when my period is due. It's not that he doesn't care, but he trusts that it will get here whenever it's good and ready! 😉 It would never have occurred to him to track it himself.  \n\nI don't usually jump on the \"dump him\" bandwagon,  but for a guy his age to behave like this?....and his first assumption is that you cheated?! All sorts of environmental, emotional and physical factors can affect your cycle,  and if he doesn't realise that by now, he has no business being with any woman until he gets educated.  \n\nGet your keys back, and eat cookies whenever and wherever you damn well please.\n\nNTA of course.", "Congratulations on being newly single.  Enjoy!", "Girl get that key back and leave his ass. NTA no matter how this story is read", "NTA\n\nIt sounds like this nut came from a whole tree of them. \n\nBullet, dodged. \n\nChange your locks.", "NTA. But damn, girl!! Get rid of the whole dude. \n\nThe fact that he has a PERIOD TRACKER that you didn’t know about is so wild. And clearly he doesn’t even understand that not every woman is like clockwork with menstruation- mine is irregular AF. \n\nFor you to wake up to texts from his family is beyond wild too. \n\nI would take the pregnancy test and just say “Now you can all fuck off because your son is out of line.”", ">“or maybe you’ve been having fun with other people while I’ve been working hard for us.”\n\nOof\n\nPersonally I'd have done the pregnancy test just to splash the urine on him when the results show negative before telling him to get out", "NTA and tell him he apparently has NO idea how the female body works or how periods can come early, late, or not at all(without being pregnant). Get your key back and block him and his family!", "NTA.\n\nIt sounds like he's projecting. Maybe he's the one who's been off having some fun (easy to sneak that in and pretend he was \"working\"), and now he's trying to convince himself you've been doing the same thing to make himself feel better about his shitty behavior.\n\nThis is controlling and abusive. I know everyone on Reddit says this every time, but this time he's earned it: please dump him. You don't deserve this from him and you don't deserve all his friends and relatives ganging up on you for something so unnecessary and grossly overreaching.", "Yeah. This is irrational behavior. Don't take this shit from him. Tell him to give you back your key and get back to you when he's rational.    \nNTA.", " Run baby run", "Woah... change the locks, move out, change your name etc...\n\nI know men can be possessive.. I'm a man and I tend to be possesive but this is a whole other level..", "There have been times in my life where I’ve been late on my period, but haven’t had sex in a while, and thought “hmm wonder if the lord thinks of me like a Virgin Mary and I’ve had an immaculate conception”. \n\nAm I the only one?\n\nOh an NTA", "NTA\n\nIs this a good time for the old \"If I take the test, be ready for me to leave when it shows that I'm not pregnant\" thing? His disrespectful and insecure ass doesn't deserve you.", "This did NOT go where I thought it would by reading the title lol\n\nYou're not obliged to take the test of course, but do you really want to put up with this nonsense if he doesn't trust you? My advice: take the test to prove a point, get your key back, and move on from him.\n\nNTA", "I see it as a man who is over worked and tired. Is this his usual self? Maybe you need to talk to him about how his work is affecting him, yourself, and the relationship. Definitely NTA.", "the red flags are really bold in this one. if he can’t trust you, then leave. there is absolutely 0 reasoning he should be treating you like that. he shouldn’t have a period tracker on his phone for you, he shouldn’t be accusing you of cheating, forcing you to take a test then telling his friends and family your pregnant when you told him no? i would definitely not count my losses with him. I hope you have the strength to get away from this controlling AH. NTA, he’s the AH.", "Ignore clearly no trust here and he’s overworked just send him your tampon when you come on and block him job done", "NTA but who on earth do these other people think they are sending you messages like that? You might want to ditch this guy", "NTA - 1st change your locks.  2nd - It sounds like he's cheating. I was in a relationship with someone years ago, who accused me of cheating because he had a dream about my infidelity; come to find he was banging every chick he met.  3rd - do not respond. You literally dodged a bullet.  Also, since he sounds a little nutty, make sure to check your home for nanny cams.", "I though it funny the 1st “comment” was a DrafKing app advert.  Get the key back and show this AH the app and tell him to go play with himself and show him the door.", "NTA. He’s been sooo busy “working for us” huh? Soooo busy that he hasn’t been around and you haven’t seen him much. Now he pops up and is all the sudden suspicious that you’re cheating and is basing it on a ridiculous reason. What a coincidence! \n\nOr maayyybbbeeee, he’s been working extra but also cheating. Maybe he’s picking a fight so he can  feel justified. Or maybe he really thinks you’re cheating because we tend to see our negative behaviors in others. Either way, even if he’s not cheating and really is just working ALL the time, these accusations are who he is and what life with him will be like. He’s shown you who he is.", "NTA, Run!", "NTA. Get your key back and send him on his way. He is EXTREMELY creepy. He is tracking your fucking period? Ew red flag city. And besides that, he immediately came in and started berating you in your own home. This is NOT a keeper. Actually, change the locks if you can.", "Run. Do not pass go. Do not collect $200 dollars run.   Just get out of this relationship. He is working extra to BUY HIMSELF A NEW CAR and just assumes you’re screwing the town. Then throws out that he’s working for both of you in your face. He doesn’t trust you. He will constantly pull his family into your arguments. This is not the one", "Get the key back, block his number and all his flying minions. Go live a happy life & be glad you dodged a bullet.", "NTA In my experience the one most concerned about cheating are themselves a cheater.  When someone shows you their true face - believe them.  This is red flag city, he is controlling and extremely immature.", "NTA\n\nHe lost me at \"period tracker\".\n\nChange the lock, block him, move on", "NTA and get that key back now. Then send a group message to all of those people telling them to fuck off.", "You need to kick him to the curb asap. This is unhinged. NTA btw", "NTA. Change your locks and break up with this nut job. This guy is a walking red flag.", "NTA\n\nBlock all of them and change your locks today.", "As someone with PCOS, who hasn't gotten a period in three years, your bf can go to hell, there's zero chance I would continue this relationship. The people he has as friends and family also show you what life would be like if you were married. I rarely say this on AITA, but please do not continue your relationship with this guy.\n\nNTA", "Ho.ly.SHIT!? \n\nIs this even real? You eating cookies turned into you being pregnant by cheating. \n\nThis guy is dangerous.. change your lock! \nNo, NTA! He cant track your period without your knowing.. and everyone with a period knows damn well that it's close to normal to be late or even skip a month or two without any good reason. Mine skipped 6 months for no reason. \n\nPsyco...", "Definitely NTA \nYou don't know what to say? How about I want my key back and BYE! It's not your job to \"please his mind\". He's either projecting or has serious trust issues... either way ur better off without.\nAlso what's this BS that his working hard for yous? Unless he plans on buying you a car too...he's working hard for himself.\nOh...and let's not forget the period tracker...what the heck is that all about???\nHe's showing you who he is... believe him!", ">according to his PERIOD TRACKER - which mind you, I didn’t know he had\n\nI already knew who the AH is here, but the fact that he is tracking your period without your knowledge puts him way beyond that.\n\nWhat is up with dudes who track their partner's periods in secret, and then proceed to fight about it when there's a discrepancy between their silly app and reality?\n\nThis actually was one contributing factor to me breaking up with my last boyfriend. Just the sheer audacity it takes a cis man to tell a woman how her periods function, and the guys who do this don't see anything wrong with how they behave. 🤯\n\nYou can do better, and you deserve better. NTA by a longshot.", "NTA and girl, please, break up with this loser, 98% of the time people bring up the subject of “cheating” out of the blue, these people have already thought about cheating or have already cheated. Besides him being ignorant, there are MANY reasons for a period to be late, from hormone problems to psychological and emotional problems, do you have a fucking hidden table but you can't open Google to search? Stay away from this guy and tell him to fuck off.", "Get rid of this man, his family and friends! Change your locks! And never look back! NTA", "Ummm, what the hell is wrong with him and why are you still with him?", "NTA. I think it's VERY clear you need to ban this guy from your life based on how creepy, controlling and distrustful he is.\n\nThe only people I would talk to are his sister (if she's generally reasonable) and maybe the friend if they're female, because they have only heard one side of the story and what he told them was most likely nothing more than \"she's pregnant from another guy\". Tell them that as women, they should know that a period being late doesn't automatically equal pregnancy and instead of being mad at you for being appalled by his behaviour, they should berate him for tracking your period without knowing and accusing you of cheating for no reason whatsoever.\n\nBut that's just what I would do. You're in no way, shape or form required to talk to any of them ever again.", "NTA what the fuck Is wrong with him!?", "NTA Girl run while you still can, your bf showed you how he really is. He doesn’t trust you and is clearly creepy with this period tracker. You’ll be better off without him…", "Sounds like he’s the one who’s cheating and is projecting so you don’t figure it out", "Don't forget to send him and the others a picture of a used tampon/pad when your period starts.", "Change your locks and leave.", "NTA.\n\nBUT I am wondering about the ants. Do they really bite either of you in bed?", "NTA girl RUN away from the moron he’s very controlling", "My thoughts are under each comment.\n\nberated me for eating cookies on my bed \n\n* who cares? It's not HIS bed\n\nHe said “oh, I forgot you’re on your period.”\n\n* he didn't go there?!? Tell me he doesn't...\n\nhis PERIOD TRACKER \n\n* OMFG, he does!\n\nHe then demands that I take a pregnancy test\n\n* what the mf? Seriously? Who keeps pregnancy tests in their pocket?\n\nHe comes back 10 minutes later with a pregnancy test\n\n* JFC! He went to buy one???\n\nHe said If I can’t take a pregnancy test that just proves that I have something to hide.\n\n* Projection much?\n\nI asked him politely to leave \n\n* You are a much better person than I am. He would have left me with the pregnancy test where the sun don't shine.\n\nI woke up to a bunch of messages \n\n* Obviously his family is as batshit crazy as he is. You dodged a bullet there.", "NTA", "NTA\n\nTell him to get his shit sorted.", "Jesus Christ, I’d leave, that’s too much drama for me. NTA. Gaps between my periods used to be like 4 weeks, then 3 weeks, then six months, then 4 weeks, then 2 months…I took pregnancy tests monthly just in case. Periods are weird, there are all sorts of reasons for a delay.", "NTA. Just throw this entire relationship away.", "NTA, you dodged a bullet. Kick him.", "You would only be a a hole if you fail to cut this jackass lose.\n\nWeird controlling stalkerish bullshit.\n\nI wouldn’t even ask for my keys back - change the locks. \n\nI’d also double check he doesn’t have some way of tracking me - my car, an app on my phone, etc\n\nThat guy needs gone", "Do you see all the red flags? Cause they are looming and flapping in the wind.\nGet rid of him. He is a controlling insecure narcissistic jerk.", "Change the locks. Controlling behavior doesn’t ever get better. It will always get worse.", "This is the behavior of a guilty person. He probably cheated on you and is deflecting. This is also abusive and controlling behavior. You haven't really seen him in 4 months and you're doing fine so it should be easy to just block him and move on. Good luck.", "Change the lock", "I am old.. like really old and all I have to say is leave his a$$ because this shows you how he is under stress which in turn could easily turn into violence every time he is stressed. No way to live your life. Also..wtf..a period tracker on his phone? I’m my days it was writing it on the calendar now he has the app on his phone?? No freaking way.. Please don’t waste your life on someone that wants you to jump thru his hoops and then he gets friends and family involved when you dare disagree with him. Put yourself first babygirl and take no sh*t from any man. Go live your life and be happy!", "NTA. Get your key from him and kick him out of your bed and your life.", "Block block block change the locks and don't even reply to him or anyone else who gets involved with your relationship", "Ooof this guy is CHEATING and is trying to frame you so he can be blameless. NTA and DUMP HIS ASS.", "girl, this is red flags all over the place. RUN!! and change the locks asap. NTA", "NTA\n\nGet locks changed and then break up with him once your period starts.", "NTA.\n\nDump him, he's a controlling freak. And of course, take his key back. Better still, change the locks and block him and his flying monkeys for good.", "Yeah.  No.  \n\nYou’re like 3-4 days off his WEIRD tracker??? 😮😂\n\nWhat an insecure ass. Maybe HE is the one cheating?? Maybe he’s not working ALL those hours. \n\nYou’re just dating-not living together, not married-people show you who they are-he’s showing you. Believe him. \n\nGet out now.", "He wants to break up, he’s just too much of a coward to do it. Either that or he cheated and he’s projecting.", "NTA. I’m gonna keep it simple and just point out that his behavior is a massive red flag 🚩 I’d use this as an opportunity to think if this is someone you truly want a relationship with. Insecure people who don’t handle it or go to therapy a lot of times are manipulative and controlling. This is def a sign of that", "NTA.  Get a new boyfriend.  Clearly he doesn't trust you and he thinks that he's entitled to place his insecurities on you.  Also, his lack of respect for your bodily autonomy is, to say the least, appalling.", "NTA. Get your locks changed asap. Block them all and buy yourself a jumbo sized bag of cookies, snuggle up in bed with a glass of your favourite drink and celebrate getting rid of the AH", "My first thought was the period tracker was for his side piece and he'd gotten mixed up about which girl he was with.", "nta but he might have trust issues", "Huge red flag. Anyone who is convinced their partner is cheating on the basis of shallow proof, such as this, may be projecting their own guilt and shame. Possible your partner is actually the one who is cheating? And trying to direct focus away from their own actions?", "NTA you either trust your partner or you don't, he clearly doesn't and that's a him problem.", "NTA\n\nI bet he cheated on you though and is projecting. Even if he didn’t it’s appalling behavior and I’d advise to block and delete the entire relationship\n\n#And change your locks !\n\n(Even if you get your key back he might have extras)", "get your key back or maybe change the locks. NTA", "🚩🚩🚩🚩🚩 There isn't enough red fabric that can be sewn together fast enough to make a flag large enough for this post. RUN!!\n\nHe's either cheating on you or trying to baby trap you. I wouldn't even bother asking for the key back because he can make copies. Just get the locks changed. Also, if you have a vehicle, have it checked for trackers. Your phone too just in case. Block him, his sis, and his bestie. You don't want this level of crazy in your life.\n\nIn case I was too subtle, NTA.", "OK I accept TV programs are not solid science, but one thing talk show hosts do, is turn the cheating allegation back on the accuser.  And Bingo, most of the time the one accusing their partner of cheating is the one doing the cheating.  \nNo idea if this the case with you, but it might be worth bearing in mind", "Nta take back your key and send him packing. Then block all those phone numbers.", "As soon as I saw that he had a period tracker on you against your knowledge and consent, that's an instant NTA. That is just so violating. Change your locks ASAP.", "Seems like he was looking for a way out. NTA. You don't berate people you love, and you don't make them do things because *you're* insecure. Trash took itself out. Don't respond and change your locks.", "If you’ve only seen him 3 times in 4 months there are other questions you should be asking.  Even if working hard he could have made the effort.\n\nI wonder if he’s trying to break up?  In any case this shows such a low level of trust from him, and so much drama, that I’m afraid it’s shown what he’s like. Run now while you can, don’t marry this absolute creep.", "NTA - I don’t think I’ve come across such an extreme NTA post in a long time. WTF? My jaw is also on the floor. His best friend and his sister are just as bad. None of these people deserve the time of day from you.", "Agree... and it seems his sister and friends will be on board to make your life hell", "I wonder if he thinks the earth is cheating on him when his weather app is incorrect.", "Yeah I couldn’t get over the part about reprimanding her for eating in her own bed. I eat in bed all the time. I also allow my cats in my bed. Thus, I change/wash the bedding more often than your average person. If any guy tried to give me crap about it, that would be the last time we saw each other.", "Even if he's just gone temporarily loopy from having worked so much, this is just not on.\n\nPersonally I wouldve done the pregnancy test, waved it in front of him going \"see\", and then asked for my key back and said goodbye.", "Yep. This even if OP did a pregnancy test (which she absolutely shouldn’t), this is the type of guy who will move the goalpost. Suddenly it will be, well, just because you aren’t pregnant doesn’t mean you didn’t cheat.", "He sounds very controlling.  Change your apartment locks and get rid of him.  He is probably the one cheating on you, and turned the accusation towards you to avoid being accused himself.  Also, maybe he is tracking other partners' periods and got your schedule mixed up with another girl.", "Agreed NTA once didn’t have a period for 3-4 months straight due to stress (it was amazing)", "Not to mention she may have other issues that cause period inconsistencies like PCOS.  Sheesh, at least he outed himself as this earlier than later!", "Projection. Pure and simple. My ex-husband did the same to me. Yeah. He married is affair partner that he was seeing internationally while still in marriage counseling with me. \n\nKick is a\\*\\* to the curb. Change the locks. Block him on phone, SM and whatever else you can think of. His \"flying monkeys\" too.", "Right! This is one of the most ridiculous things I’ve ever heard. He gots taahhh goooo.", ">change the locks of your house\n\nThis, he sounds like someone who already has three copies.", "It would be better to change the locks TBF. He might have made copies of the keys.\n\nNTA! It's really weird that he was tracking her period without her knowledge, even without the rest of it.", "Fuck himself? But he might get himself pregnant! 😂😂😂", "Maybe all that “overtime” is another lady on the side and he’s projecting his guilt.", "I wouldn't even go this far. Much too much effort for one disrespectful dipshit. Get the key back and tell him to fuck right off, OP", "She should change the locks completely because he may have copies  🤢", "Just add \n\n6. Periods do not always come like clockwork, any changes to one's body can throw them out of sync, stress, illness, mood swings. OPs boyfriend should brush up on his basic biology knowledge before he jumps to conclusions. And why is he tracking her period? That's just plain creepy. \n\n7. Getting his flying monkeys onto OP instead of having an adult conversation just reeks of projection. Did he cheat on one of the days he was supposedly pulling overtime?", "Don’t do any of that. Just change the lock.", "Seriously, he thought the ANTS were going to get him? This weirdo needs to just buy a car off Craigslist and take a break before he goes full-on The Shining.", "Yeah this is what I came to say.\n\nIf you want to confront him, this is a good way to do it. Or just get your key and dumb him (or just change the locks).\n\nThis guys is showing hella red flags", "I would probably change the lock. He sounds like one who probably already made a copy for just in case.", "I hope she copies and paste 1-5 and sends it to him.", "This is the response. That is if you don't want to just block him.", "NTA - he is. You could ask him to take an STD test to prove he's really been working all those extra hours. Unless you think this request will turn him in a dangerous way. Honestly, this is a large flapping red flag. You know him better than us, if you feel he could become dangerous, time to protect yourself.  Get the key back, if he won't give it change the locks and get cameras.", "Every accusation is a confession. OP in NTA but her bf is a massive AH and should be dumped. He doesn’t deserve such a detailed explanation. Also she should change the locks and put him and his flying monkeys in her rear view mirror asap!", "He’s “been working so hard for us” to buy himself a new car?", "it seems tho like she is cheating, if he period is THAT late there’s no excuse. and if he’s spending the night it’s really disrespectful to be eating food in the bed when i’m sure she has a couch, or a kitchen/dining table where she could eat. and why is a boyfriend tracking his girlfriends period such a bad thing ? i would love if my boyfriend knew when i was gonna be on it.", "Change the locks. He may have copies of her key.", "Or baby trap her? Maybe it's just a control power trip thing. Either way good riddance. Take that test though because you could have a period after he got you pregnant.. also those cookies and popcorn were probably full of fiber and sound like a delicious snack.", "I might start to worry a little at four days, but more health wise worrying and not pregnancy test.  \n\nBut also, nobody else should be tracking your period unless they are a medical professional who you are seeking treatment from for a specific issue that requires it.  (Which I have to say because of all the pro-life nonsense out there).  That’s a huge red flag for controlling behavior on top of the lack of trust.\n\nNTA.", "Yeah, plus there is pelnty of people who have periods irregular. Like very irregular. For example I never knew when it will come. One time was my cyclus 21 days, other time it was 42. I had no chance knowing how it will be neext time. \n\nFunny stroy - somehow person who organised karate camps where I was every year going always made the camp at time I had my period. Like the term of the camp was always know more than half a year before the camp was happening, and it was always different date (like 3rd week of July, 1st week of August, every year something different), but every single time I had period on karate camp.", "Yup yup yup yup.", "Yeah, I was a two weeks late once because I lost some weight. It's pretty normal for menstrual cycle not to work as a clockwork, few days here or there are not uncommon at all.\n\nAlso, can't a woman eat cookies in her own house anymore?", ">OMG.  He's tracking your period?  OMG.  And four days late is nothing.\n\nAnd the current boyfriend somehow never learned in nearly 30 years of life that normal periods don't necessarily arrive on the day you're expecting them. Sometimes early, sometimes late, all perfectly normal.", "Depends who you are. You could set your watch by mine. The only time it shows a day later is because it’s been starting later in the day and started at like 10pm last time and 6am the next. Stress has never changed it, lack of sleep has never changed it, and even extreme sickness and no real food intake has changed it. In 2 decades. The only times it has been different is when I’ve been pregnant. If I was 4 days late, I’d be panicking.", "I'm like three months late so according to your boyfriend I should be showing by now. (I'm asexual and dgaf ABT my periods, that's a separate issue lol). NTA. Change your locks and never meet this man again, he sounds dangerous asf.", "And the question is, is she really late or does he have a wrong cycle length in teh app? (Considering they met 3 times the last 4 months and the stress op mentioned that is very possible)", ">You sure he's really taking double shifts 7 days a week? I'm getting major projection vibes.\n\nI agree. It's a new job for him, and unless he has some very unique skill, it would be cheaper to hire another hourly worker rather than paying him overtime or scheduling him for double shifts. And he's just saving for a new car for himself; why is he telling her \"I’ve been working hard for us\"? They don't even live together. I think he's up to something.", "thats all so tiresome. Break up and eat cookies", "She did say they’ve only seen each other 3 times in 4 months and didn’t “do anything”. So he hasn’t had sex in over 4 months? He hasn’t had sex WITH HER in 4 months. Sounds like projection to me.", "wow that would be wild if he was messing with her birth control...... I'd take that test.", "Just to piggyback off this: \n\nCHANGE THE LOCKS CHANGE THE LOCKS CHANGE THE LOCKS OH GOD OH GOD PLEASE CHANGE THE LOCKS.", "Prior to being on birth control (because my flow for so heavy I was getting light headed and anemic) my cycle could be 40-45 days instead of the average 28.  The period tracker I was using couldn’t seem to figure out that I didn’t have an average cycle, so I gave up on apps.  Also, four days late is not uncommon especially when under stress, and obviously OP was not concerned since it’s, you know, her body, so he shouldn’t be either.", "I agree with you. Screw getting the key back. Cut him off, block him and change the locks. Don't feed into any type of argument. He's obviously abusive and starting to show his true colors or he's cheating or both. Trying to argue or talk about that is going to end up with manipulation.", "He'd have still spun it to make it her fault somehow and she still would have woken up to abusive messages. Douches who can't control you try to control everyone else's perception of you, it's abuser 101.\n\nStill, I do love the sass in your version.", "🚩🚩🚩🚩🚩🚩1) berating OP for eating cookies on HER bed 2) Having a period tracker on his phone without GF knowing 3) Accusing OP of having \"fun\" with other people 4) demands that OP take a pregnancy test 5) telling everybody that OP is “cheating on him.” 6) Stupid enough to assume that a pregnancy test is a cheating test. He has already crossed the 3 strike rule.", "Forget the key. Change the locks.", "To be fair, I can think of good reasons a person might want a tracker for their girlfriend - like wanting to make sure you're available to take care of them if needed, especially if they have difficult periods.  But I see none of those good reasons in this post - and honestly, if you have good reasons, you're not going to keep it a secret that you have it (you might not think to mention it).\n\n&#x200B;\n\nOP, I know you've said you haven't done anything to get pregnant. If you have been having sex with this person and he has taken responsibility for birth control, please take a pregnancy test. He sounds like someone I wouldn't put it past to have poked holes in condoms or the like.", "I'd suggest both take the key back and change the locks. Definitely dump the boy though. He's not mature enough to date.", "Maybe he was cheating and you know, knew that his position would be better, if she \"cheated\" on him than him being an AH bc he's the cheater.", "Change the locks. Don’t even give him a heads up by asking for the keys.\n\nBoyfriend escalated things really fast. Who knows if he will stop?", "I'd bet money on this being the case.", "change the locks more like!", "Except they haven't had sex in the last 4 months", "I assume it's not random and that it's more common for crazy people to have crazy family/friends. \n\nFamily have the same genetics and either raise you or are raised with you, and you become friends with people because you have things in common.", "I can see in this situation that if your best friend or brother told you “OP cheated on me and is pregnant by someone else” you might text them and say “what a B-“ or something. I doubt he said anything honest (even if he said “maybe” I doubt he said it kindly) and if my best friend told me her bf cheated on her and got another girl pregnant I would send an “f u” text. \n\nFor nearly all of these situations we see on this sub, I would not text him about their relationship problems, but assuming it was something truly egregious like that, I think I would. I already have his number though and consider him a friend. I wouldn’t ask my friend “give me his number”.", "What? You've never had the urge to suddenly text your mate's girlfriend to yell at her over something he told you?\n\nI mean, me neither, but I assume I just live a charmed life.", "Noticed that, too. How come there seems to be so many people who don't seem to know how to manage a situation other than yelling at the OP? And you know, in real life, how often do you see that happen? It's hard to believe.", "Dude. You don't track someone else's period WITHOUT THEIR KNOWLEDGE, it is hyper creepy.", "seriously, my partner kept track of my periods when i still had them and i always felt it was a good thing. even just for simple things like not planning surprise dates out of the house when i wouldn't be feeling up for them. also he made sure to replace painkillers he used before my period came and tracking was helpful with that.\n\ni know sometimes it's because of control issues, but tracking your partner's periods is not inherently creepy or bad.", "Yikes", "He whined to his friend and his sister, who took it upon themselves to also make huge leaps to accusations. Hardly mature and rational.", "It’s not trivial at all\n\nThe first thing he does when he shows up is berate her and then he accuses her of cheating and then went and told his best friend and sister and allowed them to harass her\n\nThat’s not trivial\n\nEdit: also six year relationship and two kids\n\nNever once accused her of cheating because her period was late \n\nStress can make it late, everyone knows that, or they should", "Trivial? He went and told people she cheated on him.\n\nYour take is horrible. If the dynamics of your long-term relationships include behavior like this, I've got news for you: your relationships haven't been healthy ones.", "Out of curiosity, has your partner ever asked you to take a pregnancy test because he assumed you were cheating?  He doesn't trust her.  Could be for a lot of reasons.  Could be that he had a past partner that cheated.  Could be that he's cheated and now he's projecting. Add to that, he's tracking her period without her knowledge and she woke up to messages from him, his best friend, and his sister calling her horrible names.  \n\nThis is a basket full of yellow flags and when taken together isn't trivial.  I don't like telling people to break up, but she should at least take a look at her relationship to see if there are anymore yellow flags lying around that could be added to the basket.  She's NTA", "I wonder if his sister takes a pregnancy test every time an app alarm goes off, regardless of whether she’s had sex or not… either she got the same sex ed her brother did, or he told her a wildly inaccurate story. Or both, of course", "If she caves and does the test, it's validating and appeasing his unreasonable behaviour. It would set a precedent for the future. \nOh you are tired ? You must be cheating, give me your phone. \nOh you are running late? You must have been cheating, I need to install a location tracker on your phone now.", "I had the same problem, but reversed. I would always know I was not addressing extreme stress when my period would come out of sequence. I would have to stop and think about what was going on in my life. Good \"Stop Sign\" from my body. Listen to your body.", "At this point yup this is the right thing to do... Guy gives no shit about his gf for the past 7 months and 4th time he sees her during this period he begins by saying \"wtf you eating on your own bed\"... \n\nNo effort needed for this type of person.\n\nNTA op but please get out of this before you waste more time with this person.\n\nEdit to say changing the lock might also be a better idea. You don't know how bad he can react after this.", "It's important to atleast change the locks, a normal break up no worries. A controlling creep that assumes you're cheating and tells everyone because you don't want to take a pregnancy test? Not normal", "I also wouldn’t respond apart from a hearty “ cheerio motherfucker!” to the thin air as I close the door with the new locks on it for the first time.", "Absolutely tell him to fuck right off. I’d get a locksmith though as that way you **know** he doesn’t have a key whereas if you get the key back you have to hope he doesn’t have a copy.", "Honestly, tell him to fuck right off and change the locks.  It's not even worth wasting the energy getting the key back.", "I'd like to hijack top comment to add that OP should really get some STD tests because way too often those accusing others of cheating without solid grounds are the ones who are cheating themselves.", "Yeah totally. Tracking someone's period is gross and controlling. OP doesn't have to defend her character or choices to someone like that. Just dump him and rejoice that mess is out of your life.", "I would just copy and paste the above reply😂", "I agree. I wouldn’t trust this guy with a key. I’d even go a step further and recommend having her locks re-keyed. If she’s in a rental, it might be a bit of a hassle having to go through the landlord/property manager, but I think it’s necessary. No way to know if he’s made additional copies of the key.", "Depends, I love to tell the person I'm breaking up with exactly why I'm doing so. I see it a community service.", "That’s what I came to say. Fuck this guy he’s obviously psychotic and feeling guilty about something", "100% agreed. Change the locks and let him keep the old key. Then get a doorbell camera so you can record him trying to come in after the breakup. \n\nMake sure to have text messages telling him he is no longer welcome in your home. If this escalates to needing a protection order you need the evidence.", "AND a doorbell camera.", "Oh he totally does. If he's willing to creepily try and track her cycle without her knowing, he's probably made copies of the keys, or planned worse things\n\nOP, NTA, but stay safe", "He’s picking a fight based on whatever he has available. He also probably has someone else already and doesn’t want to sleep with OP, hence coming over when he thinks she’s unlikely to want to. So yep he’s projecting, and getting his monkeys involved is because he’s now performing for them — his story will be that he dumped OP for cheating. He’s deep into the “devalue” stage for OP; it’s not enough for him to simply break up, he feels he needs to paint her as trash first. He left an opening for continuing to sort-of have a relationship with OP if she lets him demean and control her, but he’d just find a different accusation later.", "Number 6 especially. In high school I had missed like three periods in a row. I told my mom because I was concerned. She informed me about stress causing delayed periods. I missed three months because of algebra. Stress will throw your body way out of routine", "And how was he \"tracking\" them the last 4 months when he's never been around...", "8. how in the hell does cheating = pregnant?! first off - sex does not equal guaranteed pregnancy, if she were to cheat, she could just use protection, and even unprotected no guarantee of pregnancy - there is zero correlation here wtf - so if she pees on a stick and isn't pregnant then that's proof she didn't cheat?\n\nsuper weird he obsessively tracks her period too... like I am sure my husband has a vague sense of my cycle, and sometimes is aware of it due to limiting factors on certain activities, seeing period undies in the wash, etc. but I can guarantee that he does not actively think about it!\n\nNTA - he doesn't sound like a great boyfriend, he sounds like 3 red flags in a trench coat", "That’s what I was thinking too! My crazy ex used to make all these outrageous accusations about what I had been doing been doing. I didn’t understand it at all UNTIL I found out that what he had been doing!! Total projection!", "This is the best option. Listing all those points is how you get caught up in an argument that goes way off topic and resolves nothing.", "THAT late? He said the 13th; this all happened on October 16th.\n\nAnd the problem with the period tracker is exactly that: he’s using the information to police her.", "That's bullshit. That's not how periods work. I didn't get my period for almost a year because of stress. I hadn't had sex for 2 years.\n\nTracking someone's bodily functions, especially without their knowledge is creepy as fuck.", "Re-read your comment in 5 or 10 years. Some life experience might just change your thinking on this. Or, maybe you want to be a Stepford Wife :)", "I seriously hope you are joking. This is textbook abusive behavior on his part & a period being 3 days late doesn't mean pregnancy or cheating. You need to learn more about the way women's bodies work. I bet you don't even know what your own vulva looks like.", "Don’t talk about subjects you clearly don’t know anything about. And pick up a book on periods and do some reading.", "She did not sleep with him in months she cannot be pregnant.", "I usually get a warning.  My period sends a painful zit under my right nostril, so I know I have about 12 hours to get to CVS if I'm low on supplies.", "some men are ignorant to that. and being ignorant was never an excuse for anything.", "Hell sometimes I skip entire months.. I’d be damned if my husband accused me of cheating based on whether or not he sees me on my period. Absolute weird energy from OPs “boyfriend”", "Mine has a personality of its own and just shows up when it's good and ready.  LOL", "Not infront of him and not before the locks on the apartment are changed.  I’m just wondering about the birth control.  OP has made no mention of it but I worry if he’s tracking her period he may be doing other things to baby trap her.", "Exactly. I think I actually had 98 days between periods in my final year of uni. So, so much stress. The apps did not work. Since having my daughter my cycle has regulated out more to 41 days and Clue copes with that but it’s the only app I’ve tried that does.\n\nThe fact OP isn’t worried and he’s jumping right to her cheating and being pregnant is a red flag but add in him tracking her period? Just super creepy", "Oh I'm aware, don't worry. That would be more for my satisfaction than anything else. I think it would be funny to see his smug face, thinking he convinced me, crumble when I dumped him.", "Yup, it would be \"why would she have agreed to take the test if she didn't have sex with anyone else? She must have thought there was a chance!\" \n\nYou can't win with this type of person.", "Yeah I understand why some men could use one… with their partners permission. It seems weird that he would have one without her permission though… almost stalkerish.", "Good thinking. You can't be too careful, especially when he's already shown a level of jealousy and insecurity so base. This guy can't be trusted to be safe around her. Anyone that does what he did, will do worse.", "So, if I notice that my girlfriend has her period, do I just... scrub that knowledge from my mind? Because it's not like it's not obvious. Mostly because she'll tell me.", "I mean, yeah, having your partner track your periods can be a great thing if they’re doing it out of love (not mistrust) and if YOU KNOW ABOUT IT. That’s the whole issue here. OP had no idea their partner was doing this.", "Seems like this corner of the internet disagrees, I'm being downvoted for having the audacity to ask...\n\nBut yeah, if I know she's more likely to be feeling rough and want access to running water a bit more than usual then maybe I won't hyper-enthusiastically suggest we go on a long hiking and camping trip exactly then.", "May I ask how old you are? May I ask if you have ever cohabitated, been married, or had children? Healthy relationships whether storms. People make mistakes. He should apologize for what he’s done. He should be contrite for it. But you’re kidding yourself. Instead of spending their time on here, telling a bunch of strangers about their problems, and getting bad advice, They should be journaling exactly how they feel so they can present it to their SO in a productive, mature, succinct way. You’re the one making the mistake of introducing declarative absolutes. And yet… It’s all about communication right??", "I guess the guy is just worried since they don't spend a lot of time together now.  But that's not a reason to act like that and involve other people. He needs to trust her. That was a childish move", "Yep. Because even if he doesn't flip when she asks for the key, he could have made a copy already.", "The fact he was tracking her period is super weird to me. \n\n\nWhat purpose would he have to do it? Especially without ops knowledge", "Seriously, change the locks. He could easily have had copies of the key made, plus it saves the aggro if he refuses to hand it over.", "100%. This guy totally has a copy already made.", "Came here to say this. Fuck the key. Change the locks immediately.", "No need for a locksmith (unless it's a rental), just go to the local hardware store. It's not hard to switch them out.", "I might be the only one here but I don’t think keeping track of your partners period is a problem in and of itself, it very much depends on why you do it/what you do with the info. \n\nIf you just do it to kind of help understand your partner and try and be more caring (while understanding that cycles are subject to change and won’t always be what ur tracker says they are), at least I’d appreciate if my partner just kind of kept an eye out for my depressed week before period etc. \n\nIf it’s what OPs boyfriend is apparently doing though, using it to use the info I get “against” a person then yeah that’s shit.", "Or just send a screenshot of it with an accompanying text \"this is what people on the net think, and so do I\"", "Exactly! No effort at all.", "Yep he might steal her cookies too/S", "This. This is absolutely what my cousin's ex did. To the point of before he moved out he put a stroke logger on the family computer (early 00s) to then confront her when she was looking up lawyers or trying to change important passwords.", "Some women need to know this too. In high school I skipped two periods and was concerned so I talked to my mom. She became convinced I was pregnant and took me to the hospital for a pregnancy test (military hospital). When the pee test came back as not pregnant,  she demanded the doctor do a blood test because nobody just skips periods, I *must* be pregnant.   The doctor asked her to leave the room and asked me if there was a possibility I'd been sexually active.  I told them that I was a virgin. It was then that I was told how many things can impact a woman's cycle.", "And on the other hand, I never in my life missed a period unless I was pregnant. Not once. Wish I did!", "I almost died because of algebra.", "Didn't you know? You only need the dates of one menstration, then you have them all!/s 🤣😂🤣 *Laughs in PCOS*\n\nSeriously though, this guy is unhinged and you're definitely better off without him. NTA", "Oh contrair mon frier. You can have a period for months after getting pregnant.", "Yikes, that's a mean period. \n\nI'm not regular but my signal is being ravenous and craving chocolate. Literally nothing is safe. 😳🤣🤣", "Sounds uncomfortable but very practical!", "You have a polite period! Mine never warns me. It starts and I’m like, “OHHHHH…. So that’s why I was being awful to the people I love.”  You’d think I’d know the signs by now.", "Mine have a \"meeeh somewhere within the last two weeks of the month\" starting day. \nMy man just look at my general behaviour.. if i vaccuum the house for any snacks at all, we are a week away! \nIt even skip a month here and there because fun.", "They haven't done anything in months. OP mentioned that in the post.", "Evil, I love it", "That's the thing that stood out to me, the fact that he tracked her period without her even knowing AND is using it as some sort of 'gotcha' proof of cheating.", "It's not weird to have an idea of when your partner is on their period. It's about the fact that he had a period tracker on his phone, without her permission or knowledge, and whipped it out as a sorta \"Gotcha\" moment. He wasn't doing it so he could care for her on her period.", "You're being purposely obtuse. Noticing periods is one thing. Having your partner shared their tracking is another thing. Asking if you can track their period using an app in another thing. TRACKING THEIR PERIODS USING AN APP WITHOUT A PRIOR CONVERSATION IS CREEPY. \n\nWhy are you conflating completely different situations, you are literally making it clear you are not tracking anyone without their knowledge which I highlighted was the issue in my first response to you. \"Do I just scrub it from my mind?\" Dumbass question that's completely irrelevant.", "No, he’s not “worried,” he’s feeling insecure and trying to make his feelings her problem by accusing her of something she didn’t do instead of asking for support for his stress or dealing with his insecurities like an adult.", "Yes. Depending on the locks, with one YouTube video you can change out the tumbler yourself, no need to call a locksmith.", "I mean, it’s nice I guess to skip it, but it’s also more stressful. It’s usually because of something bad happening anyway, like stress or an actual medical issue going on. It’s better to be healthy and never skip it.", "But you can't get pregnant unless YOU HAVE SEX, which OP didn't for months now.\n\nThat's the point.", "Umm, no.\n\nLooked it up:\n\n\"How common is it to keep your period while pregnant?The short answer is no. Despite all of the claims out there, it isn't possible to have a period while you're pregnant. Rather, you might experience “spotting” during early pregnancy, which is usually light pink or dark brown in color.\"", "Au contraire mon frère, ftfy, also I'm mildly curious of where you learnt that expression from as you don't seem french", "Oh that’s a relief!  Thanks for pointing that out.", "Thank you finally someone who understand that since she did not have sex with him she could not have conceived a baby.", "Yes you can. That's what sperm banks are for.", "The English language has lots of French phrases that are commonly used. That’s one of them. Not the most popular, but not exactly unusual.", "For sure!", "Crazy what reading can do.", "Does not apply to this case at all.\n\nBut if you want to be obtuse, by all means, be my guest!", "Your take on the pronunciation must be epic, lots of french Rs you guys can't pronounce, must sound like ow cowtwew moh fwew and it cracks me up"]}