{"id": 29111, "submission_id": "17a0l4o", "title": "AITA for telling my son to just elope since clearly he wants no one religions people to show up", "selftext": "On phone sorry for errors\n\nMy son is getting married and we got the invitation today. I am still in the faith and he was raised but he left which is okay. The rest of the family is still religions if they do it on the down-low or they are really involved.\n\nHe always talked about wanting a small wedding and the women he is marrying has a very small support group. It’s just her and her sister due to their parent being gone. Now before he talked about getting married on he beach, which made the grandparents upset that it wasn’t the temple but they got over it after I told them to knock it off.\n\nHe was upset with them but I thought they got over it. He sent out the invitation and it was at the satanic temple. I called him if he was joking and he told me no. That they wanted him married in a temple so he is getting married in a temple\n\n\nI have been getting calls from everyone asking me what is happening. I told him that if he doesn’t want anyone religions their then just elope because none of the family will be going.\n\nHe called me a jerk for siding with them. I got a text from his fiancé and she told me I am shive jerk for not support him on this.\n\nAlso we are not Mormon, we live about 3 hours from Salem. So yes it is the satanic temple or at least that is what is on the invite.", "created_utc": 1697555460, "permalink": "/r/AmItheAsshole/comments/17a0l4o/aita_for_telling_my_son_to_just_elope_since/", "score": 381, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I told my son to Elwood if he doesn’t wan any religions people to show up at his wedding. He is very upset that I am not supporting him on this and that could make me a dick\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "Seems a lot of people aren't reading carefully enough.  The father supported his son's decision to have the wedding on a beach.  When the grandparents complained about it, the father told them to knock it off.  They did so and that should have been the end of it.  \n\nNow, the son, despite his father supporting him and getting the grandparents to shut up, has decided to be an asshole for no other reason except to upset his grandparents.  \n\nOP, NTA", "Family are AHs for telling him how to have his wedding.\n\nYour son is childish for making it at a satanic temple for the seemingly sole purpose to piss people off.\n\nYou were correct in suggesting he just elope. It doesn't sound like he cares to have any of his family there anyway.\n\nIt sounds like he's resentful of his family, and using his wedding as a way to piss them off. He should be focused on his fiancé instead. The fiancé’s anger was misplaced at you. She should be angry with your son for turning her wedding into a circus designed to piss off religious family members.\n\nEDIT to add judgement:\n\nNTA, as long as you stay out of it moving forward. Your family was being AH, and your son is being dramatic.\n\nEDIT 2 - As u/OHarePhoto pointed out.. and google seems to confirm, there is no such thing as a Satanic Temple. The orginaization does not have a physical building. They have chapters across the country, but do not have \"temples\". Unless OP happens to live in Salem, MA, where they have a headquarters. Pictures make it look more like a novelty \"temple\". \n\nNot sure if the story is completely made up, or if OP is mis-understanding or not describing the detail correctly.", "INFO: Where are you that The Satanic Temple actually has a physical, permanent Temple? My understanding is that TST congregations usually meet in general use community centers and the like. And, IIRC, they don't have their own premises on purpose because they don't feel like that's a good use of their organizational funds and whatnot. \n\nI ask because it sounds like he's really, really gone out of his way to find a needle in a haystack type of spot, or is proclaiming that the wedding will be at a Satanic Temple just to piss people off.", "I don’t know if you’re personally the asshole but it sounds like your family were assholes. It sounds like he had a very reasonable wedding planned out on a beach, everyone gave him shit got it not being in a temple, so he gave them a temple. I’d personally just rather uninvite anyone giving me a hard time. But his way works.", "NTA, he wants to burn bridges with his entire family to be an edgelord contrarian, that's his right. But he's either going to have\n\n1. No family there (because he did this to make them not go) or\n2. Family there shitting on he whole idea and being rude.\n\nLike what is he expecting here?", "NTA\n\n- You made no demands on his wedding\n- You are not trying to force him to return to your family religion \n- You told the grandparents to stop pressuring him to marry in the temple and then they did\n\nSo far you haven’t done anything wrong. \n\nIf I’m reading this post correctly your son isn’t a satanist, he’s just having it at a satanic temple as a way of thumbing his nose at his grandparents, who you’ve already chastised. \n\nTBH I think planning your entire wedding as a fuck your religion party to your grandparents is petty AF. He could have just not invited them and had the nice beach wedding he really wanted. \n\nHaving a wedding in a satanic temple to spite family is just as ridiculous as having a religious wedding to please the family. He’s still allowing the family to direct his choices instead of doing what he wants.", "This entire post is a steaming pile of lies. The Satanic Temple is a non-theistic religious organization, and they don't actually have a bunch of temples. Some very specific places have some buildings where they meet, but certainly nothing like an actual temple.\n\nYou are a big ol' lying liar, which makes YTA.", "YTA. \"I told him that if he doesn’t want anyone religions their then just elope because none of the family will be going.\" what, so his future spouse's sister doesn't matter and neither do any of the couple's friends? Even if nobody from your side of the family are there, they'll have other guests at the wedding.", "Well for him to pick a satanic temple I would say your family has put more than a little pressure on him to have it in your temple. I have no idea how far or how bad they have been to him. Anyway why should they elope? They have her family and both their friends to come. I think the choice of satanic temple maybe to insure none of his family come. I am sure they will have a blessed marriage ceremony. YTA", "Yta they can hold it wherever they want and do not have to elope just because you say", "hmmm\n\nNeither TOS or TST have actual temples do they?  This post has lots of missing reasons.", "Honestly NTA\n\nI'm an atheist and I would never have a religious wedding. But I would also not use my wedding to mock someone else's religion.", "YTA the TST is for religious equality and you can still show up and support him if no one else will", "YTA. Your son can have any wedding he wants. It’s his, not yours.\n\nSounds like he doesn’t want people who can’t respect his wishes to come to his wedding and I get that.\n\nYou also clearly didn’t even bother to look into the satanic temple. They don’t actually believe in satan….", "NTA, you tried to support his decision to do the beach ceremony. He's the one being petty about the satanic temple knowing it would cause drama.", "I never heard of the Satanic Temple before this.\n\nThe name is unfortunate, because I’d assume it’s about Satan worship, and as an atheist, that’s just as ridiculous to me as any other religion.\n\nBut after looking at their website—-  sign me up!\n\nYTA.  They can have their wedding wherever they want. Go. Don’t go.  Up to you", "I kind of understand your son. Its their (son and future DIL) big day and family members just force their relgious views on how that day should be on them. I dont know how strong of a role religion had in your family, but a lot of people that leave it suffer from relgious trauma from that so its a really triggering topic for them. Its propably something like that for your son. \n\nOn the sidenote, the Satanic Temple doesnt worship satan. They just fight christians trying to water down the seperation of church and state with lawsuits and other actions etc.", "YTA", "YTA.  You say \"you don't want any religious people at the wedding\" like it's a bad thing.  I'm assuming he knows he'll hear a barrage of snide comments about the wedding not happening in the temple for the entire ceremony and reception and wants to avoid that.\n\nSource: Me, exmormon who has been to non-temple weddings with exactly that result.  It's cringe-worthy at best and infuriating at worst.", "YTA - BAHAHAHA - they satanic Temple is atheist group that uses freedom of religion that so many use to push for more secular rights.", "YTA. You expect him to respect your and your family's religion, but you won't even allow him to freely live his beliefs? The intolerance of your family is disgusting. They don't ACTUALLY worship Satan, you know that?", "YTA for making this up. Members of Satanic Temple have already commented in this thread that there isn't an actual temple.", "IIRC there are no \"Satanic Temple\" actual temples, so I think this might be a joke.", "A wedding at the satanic temple sounds based. YTA", "NTA, assuming he has no actual ties to the Satanic temple, and is only doing that to try and antagonize the religious family members. If you hate your religious family members that much, don't invite them. But to turn your own wedding into a dig against someone else's religion is just ridiculous.", "But... have you actually looked into the tenants of satanism? And what they actually stand for?\n\nhttps://thesatanictemple.com/pages/about-us", "oh i fucking love this one. i’m totally doing this.", "Hahaha!!! Your son is my new hero. 🤣 I thought I was making a statement when I got married at a metal festival, but god damn! Brilliant. Just so ya know, the Satanic Temple isn't a place of worship like a regular church. They don't actually worship Satan. Most don't even believe in Satan. The history of the Satanic Temple is actually pretty cool. But it's hilarious that y'all are letting your cognitive dissonance get in the way of celebrating with your kid. Very typical. 👍", "I mean, elopement is good advice.  That's what we did back in '95, and we've never regretted it, not once.\n\nBut I don't think you offered it with good intentions.  I'm gonna be on the kid's side on this one.", "NTA.  So his future wife can throw slurs at you and then tries to say you're the jerk?!?  I don't think so.   If they didn't want this dramatic mess then they shouldn't have made it.   Let everyone reply no they aren't coming and be done with it.", "NTA, your son is an edgelord.", "Your son needs to grow up and your family needs to keep their opinions to themselves.", "I'm guessing you're Mormon? I'm not Mormon anymore but damn getting married in a satanic temple to piss off your family is just stupid. What's even stupider is being mad no one is showing up. What did he expect? A bunch of devout Mormons to show up to the satanic temple like it's all good? NTA", "ESH\n\nIt’s not great that he was being pestered about the temple. It’s his wedding, he gets to choose. And if he isn’t religious then the grandparents need to just shut up and get over it. But it sounds like he’s being deliberately antagonistic. I love TST, they do good work. But this just reads as him giving his grandparents a big FU. Which is childish and obnoxious.", "YTA. I don't blame him for not wanting people from a hate group at his wedding. He is hilarious.", "YTA. It's his wedding, and he can have it wherever he wants. Why does it matter if he's getting married at a Satanic Temple?", "NTA. Ask your son if he really going to celebrate his wedding out of spite instead of out of love? Is being angry at his granparens the corner-stone of his wedding?", "INFO: are they actually attending regularly the Satanic Temple? have you also told him that even you would not attend?\n\nthe jump conclusion for the choice would be that your son is being petty and wants to shock the family, but he might just want to weed out all the persona non grata, which I don't think it  includes you.\n\nas for what you told him, it's also depend of the tone you used. you are just stating a fact in telling them that nobody of your family will attend, but it's not necessary for them to elope. I'm pretty sure they have friends and they will attend, just no family (it's a  petty way, but I think it might be in their right). your suggestion of eloping diminishes their desire to have a celebration and the validity of their choice.\n\nthe Satanic Church is not what you think. get some info and talk with your son again, especially in why they chose the ST as their wedding location.\n\ngood for you for sticking out for him the first time, but I think there's something more behind his subsequent reaction and it needs to be aired.", "I started out NTA, but as i’ve read the additional replies i’m getting an impression. Currently YTA.\n\nI’m willing to wager theres been comme try on his none belief from fanily members in the past, especially as it looks like a most practising family. I’m going to wager being challenged about the neutural venue (honestly who gripes at a beach?) has made him realise exactky what’s coming, so rather than un-invite people who are going to stir up drama he’s given then a venue to clutch pearls over and save the hastle of un-inviting.\n\nCorrect me if i’m wrong here, but the moment the new venue became a sticking point for immediate family instead of just older relatives it’s became clear this isn’t about being “immature”, its who’s capable of unconiditional love vs doing whats expected.\n\nGood luck to your som, I hope he has a great day with those who actually support him.", "NTA\n\nInstead of staying with the beach idea,  he chose to get petulant and \"edgelord\".  Whatever.", "[deleted]", "Sounds like some of your family are the As.  And you're bordering on being one.  My guess is that he is going to be just fine if folks don't show up because their religion is more important than being there to celebrate his wedding.  Telling him to elope, in an effort to get him to hold it elsewhere is bordering on being an A.  Attend the wedding, or don't.  But recognize the message you are sending with that choice.\n\nOften the religious dont have any issue pressing their beliefs on others when it is decidedly unwelcome and at the same time act offended when they aren't treated with inclusivity.  I am assuming your son is an Atheist, and as such, he's intentionally creating an environment where people will not only need to keep their beliefs to themselves but also be a bit uncomfortable as he has been made to feel.   They can all choose to respect him or not.", "I support the Satanic Temple's mission and have donated money for its causes.\n\nThat said, your son is intentionally being an asshole with this decision. Are you and his grandparents being TA by pushing your beliefs on him? Maybe.\n\nI'll go with ESH.", "If you're not comfortable with his venue, then simply do not attend.  That goes for the family as well.  And his fiancee can just deal with it too.", "INFO\n\nWait, there are satanic temples? I really wanna see that.", "Your son will probably see this post because he definitely sounds like a Redditor lmao", "Tbh, looks like everyone is an asshole here except you.\n\n&#x200B;\n\nRest of the family? Kind of assholes for demanding the ceremony in a temple.\n\nYour Son? SuperMassive asshole even for deciding on doing it in a satanic temple **for the sole single reason to spite the rest of the family**. This is not how responsible adults do things. What the fuck.\n\nFiance? Also ok with the satanic temple ceremony instead of a nice beach ceremony (again) **simply to be a prick and annoy religious family members?** fuck that childish shit.\n\nWhat do they (the bride and groom) win out of this?\n\n&#x200B;\n\n>I got a text from his fiancé and she told me I am shive jerk for not support him on this.\n\nWhy are 9 year old children getting married here?\n\n&#x200B;\n\nI apologize if I got the ages wrong, I'm just making assumptions based on how fucking childish they are acting.", "YTA.\n\nEveryone who tries to push their beliefs on someone is an AH. The grandparents need to keep their misguided opinions to themselves. Why would you even push for a religious ceremony if the people getting married aren't religious? Isn't that an affront or some nonsense?\n\nYou're being petty. Your remark was unnecessary. Religious people insult non-religious people *constantly*, but can never eat their own dog food. You need to grow up. You're not an AH for having faith in something, you're allowed to believe in whatever you want. But religious people always think they hold some sort of higher ground and can never see their own issues right in front of them because they have Sky Santa on their side.\n\nThink about it, you told them to elope just because YOUR side of the family doesn't want to attend. That's discounting their friends and his fiancée's family. Implying your side of the family is the only one that matters and if they can't come, there may as well be no wedding at all. How narcissistic of you. And is your faith so weak you think your god can't protect you inside some bricks just because the sign on it says \"Satanic\"? Go, don't go, you're allowed to do whatever you want to, but stop making the wedding about you.\n\nAs long as he's keeping the spirit of his wedding in mind, it sounds like your son just figured out how to ensure the people who attend his wedding are folks who don't have their own heads up their asses.", "ESH. Nobody should hassle them regardless of their choice of venue, including you on the \"just get eloped\" comment. Your son shouldn't use his wedding as an \"f u\" to family either. It's supposed to be about their shared love and commitment, full stop.", "The \"Satanic Temple\" is a parody of religion formed as a political movement. Its purpose is to mock religious faith. I support their free-speech rights to exist, but will always choose not to attend any of their events.\n\nSeems like your son doesn't understand what a \"jerk\" is, because by choosing to mock his family's faith like this, he's revealing the jerk to be him. You would have all happily attended his wedding at a beach, in a hotel, a courthouse, or whatever other secular venue he wanted. Yeah, the grandparents would grumble about it not being in the temple. Grandparents often grumble that their grandchildren are less religious than they are. They'll get over it, and as you say, you told the grandparents to stop it.\n\nNTA", "ETA, you all are immature, yes what he did was childish but its his life and his wedding yet you all keep pushing your religion on him, as someone who left a religion i know how it is having my family agree that i dont have to be religious but still trying to make me have events like this be how they want. Its his wedding and if he wanted it on a beach your the grandparents should have left it at that. Also you op, telling him to elope if family isnt there is fucked up. Me personally if you were my mom id rather have friends at my wedding than invite you", "ESH. Family for shoving religion down son's throat and him for rubbing it back in their faces.", "YTA. Why do you hate your son so much? You should just not talk to him anymore because clearly you hate him", "NTA - Your son is a petty little shit and your relatives are also dicks.", "YTA. You obviously didn’t shut your parents down as well as you thought you did, and they did more damage then you thought before they eventually quieted down. Son is also the AH because instead of actively disinviting the people who’ve offended them, he’s passive-aggressively allowing their guests to disinvite themselves by choosing not to go. It was a dig at grandparents specifically, but the rest of the family is collateral damage. \n\nMissing missing reasons, but you know it’s not about religion or being religious - there’s always *way* more to it.", "He wants to get married there so what’s the problem? It’s his wedding. He never said religious people can’t come and never said they had to come. You’re nta but neither is he.", "NTA, but it's worth noting that \"satanists\" are actually an athiest group whose commandments center around being good to other people and other similar tennants.", "NTA\n\nHe’s being childish and outrageous for the sake of it. \n\nGrandparents are ah. Why would you even WANT someone not in your religion to pretend a religious marriage at your temple? \n\nFiancé needs to stay out of it. It’s an obvious issue. \n\nOther family who bitched about him not having a religious ceremony in a religion of which he is not a member.", "The satanic church IS a religious group. So the fact that your post says many times that your son “doesn’t want religious people” there is further diminishing his thoughts and feelings.", "NTA, and you sound like the only person in this story that isn’t.", "NTA\n\nOf all the non-religious groups he could have chosen to host his wedding to prove a point, he picked one that doubles as an anti-religious hate group.", "lol this is amazing. I love the son's level of petty. I don't understand all the N T As - you all sound like you want to micromanage your son's wedding and he is responding perfectly. I hope he and his fiance have a beautiful wedding which will be blessed in a temple (as per your wishes)", "Nta, it does sound like your son is resentful towards religion and made him act childish.", "NTA. You only spoke the truth. Giving him grief about not being religious is what started this, but his F-you is loud and clear. If he wants to get married at a Satanic temple, then he needs to be completely unsurprised when his religious family members cannot, by their own faith, step inside of it.", "[removed]", "NTA. How old is your kid? What kinda petty ass, one-upmanship, BS is he trying to prove?", "NTA. He is being a dick to spite the family. He doesn't actually have an affiliation with the satanic temple, but wants to shock and pay them back for asking for a religious wedding.", "😂😂😂 Yta", "NTA. He knows exactly what he’s doing by choosing a satanic temple. That’s antagonizing and too high an expectation for religious family members. Any secular location would’ve been fine I assume but he’s trying to stir the pot here. I’m sorry what should’ve been a happy event had turned into conflict and drama.", "NTA", "NTA", "[deleted]", "NTA... Sounds like both him and his fiance are both too immature for marriage. The whole family are assholes. Everyone except you. What you stated is an honest way around everything. Hell even I'm thinking of eloping just so I don't have to deal with family....", "Probably ESH - why can’t religious people be there? He didn’t say that, you did. Maybe do some research on the temple first, be accepting and open minded. No one is asking you to convert. Him only a little because he’s kinda making it a bigger deal, although I bet he has had similar issues before. But it might be kinda cool to check it out.", "Why can’t you just respect his decision?  Call back and ask what’s the dress code? Boycotting your sons wedding over his choice of religion or lack thereof makes you the AH.", "YTA grow up, its clear you son doesn't want anything to do with toxic religion", "lol Your son is hardcore and I AM HERE FOR IT! The grandparents didn't indicate whose temple they should marry in. I myself believe in and love the Lord, but I do not want to get married in a church, as I don't go to church anymore. I don't like people who try to force their beliefs on others. YTA", "At yes Religion destroying another family. A tale as old as time. Your family demanded and he responded. Entire family is AH for putting religion above all else.", "YTA. There is no validity in the dissappointment of your relatives, it makes no sense to marry in the temple of a religion you do not subscribe to. You should also look at what the satanic temple actually is, it's not an evil and immoral organization at all, so maybe keep an open mind. It's perfectly reasonable for a religious person to interact with people associated with it, despite disagreements.\n\nYour son is pulling this move to piss off your relatives, but they have shown that they don't respect his personal perspective on religion and are fully deserving of this in my opinion.", "ESH, because I do get the vibe that he chose the Satanic Temple to be petty. Though I’m personally a fan of the Satanic Temple, their core tenets, and the fact that they exist in opposition to high pressure Christian systems (which is probably why the son chose the temple),  the son explicitly stated he did this because of his family pestering him to get married in the temple. His wedding venue should have meaning for him and his soon-to-be wife, he shouldn’t choose it out of spite. \n\n\nAs for OP, I say this as a person that just eloped and had a magical time: telling someone to elope because their family won’t show up is so scummy and rude. You did not tell your son to elope because it’s a better option financially or because their union would be so much sweeter without pressure from family, you told him to get married alone because his family wouldn’t bother to show up. You and your family are just as petty as your son. You say in a comment he’s too immature to be getting married, but I think he’s displaying about as much emotional maturity as the rest of his relatives.", "I'm wondering if anyone else involved has looked up the satanic temples main tenants.", "YTA and the family are TA.  It’s their wedding.  They can have it where they want.  \n\nThe Satanic Temple (I believe, confusing with Satanic Church) is mostly an atheist organization that uses the guise of religion to combat religiously motivated laws and points of contention.  \n\nSo basically he’s having his wedding at an Atheist Temple.  \n\nEveryone’s free not to go.  IMO, it just saves him money.", "WTF is a \"satanic temple\"? I call BS on this post.", "people are saying the son is an AH but I think he's hilarious lmao. especially if he has religious trauma and is fucking sick of your family's shenanigans.", "YTA\n\nYour son is a LEGEND and I want to be friends with his petty ass.", "ESH \nAs a person who was raised in the faith you’re talking about, I was forced to go to the temple and church weddings. When I was older, I was excluded from my loved ones weddings because of my faith (or lack thereof). Literally spent two of my cousins weddings in the temple parking lot babysitting other peoples kids….  So I can understand your sons bitterness and pettiness.\n\nThat being said, at the end of the day, no one wants to be excluded. Grandparents and other family members should’ve kept their mouths shut from the beginning and everyone would have been able to attend a lovely small beach wedding. Now, your son won’t have his loved ones at his wedding.", "NAH I mean, it's their wedding they can have it wherever they want. Maybe your parents still badgered him behind your back, maybe other people did, too. No way to really know that though. If you're not comfortable with the venue and don't want to go, that's also your decision.", "NTA.  Your son's a sad little boy who still think \"le ebic trollface\" is a way to live life.  Unfortunately he appears to have found a community of enablers who will keep him stunted so there's not really anything you can do other than keep your distance.", "NTA I don't care if I'm downvoted to hell but your son is being petty and playing the victim of his own actions. Look I know that the satanic temple is not what most people think, but for most of the religious people it would be uncomfortable to be there to say the least. Your son should know that people in your family would not attend a wedding in the satanic temple so i don't get why he is so mad. As reddit loves to say an invitation is not a summons.", "NTA. You were supporting your son in his choice until he decided to be an AH.\n\nNow he’s getting married in a Satanic Temple out of pure spite.\nMaybe he’s not ready to get married", "NTA\n\n&#x200B;\n\nHe is an A H. He is turning the wedding into a spectacle in a way that is guaranteed to upset religious family members. This is utterly immature behaviour.", "NTA, son sounds extremely childish. Your wedding is a strange time to try to have a “gotcha” moment lol", "NAH", "NAH", "NTA part of me gets your son’s annoyance. The satanic temple was to much and a beach wedding sounds lovely! I vote you stay out of it and let it implode.", "NTA.\n\nDo you get to see your son in person?  If so i would ask for 2 minutes with him alone, just let him know in person that you can’t make it, still wish him the very best, etc.", "NTA\n\nYour son needs to go back to the first plan before he wanted to get back at people.  How does his fiancé feel about this?  You stood up for him, I wonder why he made such a big leap.  Of course, he can marry wherever he wants, you can also not attend.", "NTA. Your father is not supporting the grandparents. In fact, he told them to knock it off. Your son could have had a lovely non-religious wedding on the beach, with a service performed by a JP. Instead, he chose to insult his family with his choice. I would bet that he doesn't even belong to this \"temple'. \n\nIt is your son and his fiancee who are the assholes. A wedding is not the time for such pettiness.", "lemme guess, the 'temple' is a mormon one?\n\ni don't really blame him. sounds like he's immature as hell, though, but i would be totally good cutting off people still in that particular faith. NTA for not supporting his stupid stunt, though. in fact, it's such a stupid and implausible stunt that it makes me doubt the post is real to begin with. what satanic temples offer wedding services?", "Childish reaction by your son to pull that stunt, and that's exactly what it is a stunt.\n\nAssuming he nor his soon to be in laws and wife are members of the satanic group.\n\nAnd if those 2 think this is a good idea to pull a stunt for their wedding, I can't take them seriously as people.  They are a joke.\n\nNTA.", "NTA, he sounds extremely childish and petty.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\n\n\nMy son is getting married and we got the invitation today. I am still in the faith and he was raised but he left which is okay. The rest of the family is still religions if they do it on the down-low or they are really involved.\n\nHe always talked about wanting a small wedding and the women he is marrying has a very small support group. It’s just her and her sister due to their parent being gone. Now before he talked about getting married on he beach, which made the grandparents upset that it wasn’t the temple but they got over it after I told them to knock it off.\n\nHe was upset with them but I thought they got over it. He sent out the invitation and it was at the satanic temple. I called him if he was joking and he told me no. That they wanted him married in a temple so he is getting married in a temple\n\n\nI have been getting calls from everyone asking me what is happening. I told him that if he doesn’t want anyone religions their then just elope because none of the family will be going.\n\nHe called me a jerk for siding with them. I got a text from his fiancé and she told me I am shive jerk for not support him on this.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "ESH - All of you and the family for trying to push what they want in terms of a venue, but your son as well because he picked the Satanic Temple just to spite people. \n\nI feel bad for his fiancée, because I doubt she loves the site of her wedding ceremony being used just to upset some of her future in-laws", "Hi OP,\n\nNTA,  I think you should have said something different however.\n\nI would have communicated that your side of the family is being inflexible and it must be hurtful and stressful to plan a wedding when your side is being uncooperative while his fiance's side isn't. I'd tell him that if ppl on your side won't respect his choices as painful as it is it'd be best to not invite them and only invite ppl he truly feels supported by even if it's less ppl than his fiance.\n\nI think your son is hurt by your family and retaliating with petty games. \n\nI think you've done well to support him being different and the fact that he can't see that is a shame. \n\ngood luck hopefully the kids come to their senses and plan a wedding they truly want and not one just designed to spite ppl!", "He is being petty, but the right thing to do would be to attend regardless, IMO. Take the high road, and just put up with it. If you don't attend, he'll just feel he's proved the point.", "NTA for telling him to just elope.  Old people are going to have dated thinking, it's to be expected.  You don't have to accommodate them but maybe a little bit of grace when telling them no would be considered respectful.    \n\n\nUsing his wedding as a way to poke his relations in the eye is not a very good foundation to build a marriage upon.  It sounds like he lacks the maturity to be getting married but then again, a lot of clueless immature people get married.  You son isn't uniquely bad in this department he just took it a little too far.", "The grandparents were upset it wasn't in a temple, so he made it in a temple.  They didn't specify which temple.  This malicious compliance is pretty impressive.  Idk why they're asking what happened.  He literally did what they asked.  If they don't feel bad about offending him by asking him to get married in a church he doesn't like, then why should he feel bad for offending them by asking them to attend a marriage in a church they don't like?  Como se dice, hypocrite?  \n\nNTA, OP.  Sorry you're stuck in the middle, but this is your son's wedding.  He didn't get a say in their wedding, so they shouldn't get a say in his.", "NTA.\n\nYour family was being annoying, but it sounds like they basically backed off when you pushed back. Not that bad.\n\nHis reaction is extremely petty and absurd. He’s just doing it to be insulting to his family. Not cool.\n\nYou’re just stuck in the middle trying to play referee. Tough spot.", "YTA. Just don't go if you don't like it. Your opinion is irrelevant and should be kept to yourself.", "And this is just a small scale version of why i think religion is shite.  All across the world, religion just seems to be an excuse for one group to be really shitty with another, which idms a joke in itself considering the majority say to be kind to one another. \nReligion - Be nice and love thy neighbour...... as long as they are with what you're saying. Sounds like politics.", "You don't sound too bad, OP, and I think your advice of eloping is sound, so I vote NTA. The rest of your family sounds like they deserve each other though haha.", "NTA\n\nIts an invitation not a summon. If people cannot attend for whatever reason (including religious beliefs) its up to them, but obviously it can compromise the relationship. But at this point your son made clear he wants nothing to do with them by his petty behavior", "NTA. He did that clearly out of spite towards the grandparents and is taking his hurt feelings out on everyone. Tolerance and accepting something are very different. OP, you dont have to accept or support this. As a Christian, I know that it wouldn't matter who was having the wedding, if they hosted in at a satanic temple, I wouldn't go either.", "I just wanted to say, you son sounds great and I have fallen in love with him too. Not sarcasm... I really appreciate that level of rebellion. *Chefs kiss*", "YTA - you aren't hearing the point, he got so much heat for trying to have a non-temple wedding that he felt the need to say \"Fine, you want a temple, here, have a fucking temple.\"\n\nNot supporting him to your family is how he landed with this issue.", "Its very in character for a religious person to be barely literate, spot on", "Yta", "NAH\n\nAs always, an invitation is not a summoning. They're free to get married as they please and you're free to dislike it.", "The Satanic Temple is great. What's the issue here?", "Sounds like he’s not old enough to get married.", "I think you and the family are the AH here.  If it's your son, and he truly loves his partner, your religion shouldn't matter, and based on how your son is reacting, I'd assume you/the family gave him reason to be spiteful about it.  \n\n\nReligion is not as popular as it once was, especially not with younger generations.  It's quite funny, because the concept of marriage is a religious concept in general, so the whole situation is kind of ass backwards if you ask me.", "Damn honestly I think ESH except OP? The grandparents suck for trying to dictate how someone else should have their wedding but the son also sucks for making a joke out of it. OP seems to be the only reasonable one in here.", "YTA: Freedom of religion, deal with it.", "Well, it’s sad your son thinks so little of his family because they have their faith.  Family shoulda kept their mouths shut about the beach cuz now he’s showing them. 🤦‍♀️.   Son seems immature and fiancé isn’t scoring points. Let them have their “satanic wedding”. Are they even actual satanists?   Don’t go if you can’t support his choice.", "NTA.... your son is a jerk.", "NTA\n\nYou respected their wedding wish and got others to back down or respect it.\n\nIn doing this, they are being petty and might as well elope. You are correct if no one is coming that they should.", "Personally to me religion is a cancer, if your son's grandparents make comments like these about his wedding I can only imagine the other kinds of comments they make to him. I can completely understand his desire to burn bridges with the religious people in his life. On top of that the satanic temple is essentially a cringy atheist group, nobody there worships satan. I think his point with this move is to say 1 that he doesn't want religious people who'll make comments in his wedding and 2 showing everyone's religious ignorance, where as soon as they hear satan it's the end of the world", "NTA - but crikey, what a nightmare, from the judgmental grandparents to the party groom. \nNo advice, really just what a garbage situation. Was his (admittedly kinda funny) response a culmination of several years of eating his grandparents' sh*t? It sounds like he's fed up with them and he went all out.\nEither way, he should take your advice and elope.", "NTA but your son is.", "YTA. Mormonism is an inherently antisemitic cult and your son getting away from the \"secrets\" revealed to you guys at 18 is good for him", "Everybody is an AH, except for OP. \n\nBeach weddings are fairly common both among religious and non-religious couples. Family members are AH’s for trying to tell him how to have his wedding. Just let them have their beach wedding. \n\nOn the other side he is also being extremely childish by changing it to a satanic temple, especially if that’s not actually what he believes in. It would be different if he practiced satanism on the regular, but it doesn’t seem like he does just from this story and rather seems like he did it purely out of spite and to be petty instead of just putting his foot down and telling them “no I’m having it here, you can either come or don’t.”\n\nThe only one that seems to be making reasonable suggestions and trying to resolve this better is OP.", "YTA because you're lying. Your story falls apart the second anyone realizes what TST actually is and does. Dumbass.", ">I told him that if he doesn’t want anyone religions their then just elope because none of the family will be going.\n\nThere's a difference between \"siding with them\" and just stating the facts.\n\nHe thinks he can force people to do something against their will.  It's not going to happen.  You're just simply stating the obvious.", "NTA, (not so much the other family) you were pretty understanding and civil even when he decided to make the wedding to clearly spite the family.\n\nReddit is generally against religion so don't take the YTA's to heart\n\nYou were respectful of his boundaries throughout.", "NTA you were just trying to help. Its their wedding if they want to be hateful about it, thats fine their choice. But I wouldn't attend and  wouldn't send them any congrats, gifts or cash. \n\nThey can choose to get married how they want. But no one has to come or support it.", "YTA. Is he (and his future wife) not allowed to have their event at a building that is owned by an organization that does a lot of good? What if they support that organization huh? Are they not allowed to do that? Have you read the 7 tenents or did you just *assume* the location choice was a joke and a dig at religion?\n\nIf they are indeed supportive of that organization you did a major booboo by saying the thing you did. Then you shat on his religion/way of life. And it does sound like they support TST since future DIL said \"support him in this.\" either that means to support his beliefs, or support him against relatives that might have been nastier than you know of.\n\nAnd elope? Does your DIL´s wishes and family/friends not matter? There are two people getting married, maybe DIL doesn´t want to elope? Its their wedding get your nose out of it, its a location.\n\nChoosing this location really helps your son filter out the people he don´t want around him, they can choose to be offended by the name of an organization. They can also just google what it means and then decide if they want to come.\n\n\"because none of the family will be going.\" you said? so you are not planning to show up at his wedding. Of course son and DIL is calling you a jerk.", "This... smells like bullshit.\n\nThere are not that many \"temples\"/physical locations for either the Church of Satan or the Satanic Template, both of which could be what you are talking about. They could have a local chapter for either, but from experience the focus is less on worship and more on the community and making life better in this world (so, my group did more community service and met at a cafe for prep).\n\nTypically, folks who leave a religion leave on not so great terms. If you really did tell your parents to knock it off, the damage was probably done, both in the moment and from the years past\n\nLastly, it might legitimately be his spouse to be's practicing religion, which as one of two people that the wedding is for, they get a say in their ritual. If someone doesn't like it, they don't need to bad-mouth it, they just don't. go.\n\nAgain, this seems like rage bait.", "YTA - For writing this BS.", "NTA\n\nUnfortunately, everyone has input when its someones wedding, I mean he needs to get over it. Who hasn't had a wedding where someone makes a comment, you just un-invite and move on (really that simple if their comment offended you).\n\nThe fact that he retaliated in general was soo petty, then to do it at a place that is so anti- the families beliefs, you'll be lucky if you get wedding presents. Which I assume is the main reason why he'd be inviting people he clearly doesn't like... yeah he needs to go and elope and count your son's relationship with family dead.", "Yes.  You are the AH. support your kid.  Your family is going to be totally cut out of his life if they continue to force religion on him or judge him for his decisions", "sorry, but i’m going with yta.  it’s your son’s wedding, and he can have it where and how he and his fiancée want.  satanism isn’t a theistic religion, by teh way.", "Your son’s an asshole for getting married at a place he chose to intentionally piss odd his family. \n\nYou’re an asshole for using the word religion multiple times instead of religious 😂", "I don’t fully understand. \nMan planning wedding invites grandparents. Wedding location likely beach. Grandparents would prefer a temple. Man refuses. So either Grandparents can attend beach/other non-religious venue or opt out altogether.  \nAll the above is understandable. How did we go from there to “I’ll show you and have my ceremony at a Satanic Temple! Bwahahahahha!”  How is this mature or even debatably sane?  I mean fine have your wedding somewhere to spite your Grandparents (who naturally won’t attend) but that seems a disrespectful choice to your bride and the relationship. It should be about you two not a “gotcha” for anyone else.  If Bride is onboard then, well, y’all are perfect together and need to lock this down.  🙄", "Is the Satanic Temple nice?  If nobody was going to approve of what he did anyway, may as well make sure the people who can't act right don't show up.", "Wow, was not expecting to come to this conclusion, but... NTA\n\nYour family sucks of course for their pressure on him to have a wedding in their preferred religious building, but it sounds like they backed off! And you told them to back off.\n\nBut he then responded with a \"you want a temple HOW BOUT A SATANIC TEMPLE\". That's childish. If he was an actual satanist, then fine. But it does not sound like it. It sounds like he's trying to create hostility.\n\nI may be missing info of course. Maybe your family was worse towards him than indicated here. Maybe they didn't back off and kept pestering him. Or maybe there's way more history - history your family is at fault for. Any of those would change this to a situation where your son is not being an asshole (and maybe you are, or maybe you're ignorant to the background). But I can only judge based on info I have, and so far it seems childish.", "He can have his wedding where he wants. If he wants it at the nonexistent temple then he can host it at a nonexistent temple. \n\nHis grandparents definitely suck. \n\nThe rest of the people not going because it's the \"devil's nest\" (your words) are simply uneducated, and/or a bit bigoted if that's what they believe the place is. Other than being in the news fairly often for reasons purely related to the separation of church and state it would take all of ten seconds to look up The Satanic Temple and see what they stand for. \n\nI'm not gonna call you or your son an asshole, but I have a feeling your family has a few bigoted assholes based on the reaction and attempted coercion, and I'm guessing your son is better off not having them at his wedding. NTA. Your son is NTA. You parents are definitely assholes.", "YTA", "[deleted]", ">She should be angry with your son for turning her wedding into a circus designed to piss off religious family members.\n\nFor all you know she is on board with this.", "Well this story is made up because the Satanic Temple doesn't have a real temple. So this is some kind of made up mormon fan fic.", "Responding to top comment to say: the church of satan doesn’t have temples or physical churches.  According to their website: “Unlike most churches, we have no set activities, meetings or contacts. We are not a congregational religion.”  Here’s a link to a page on their website describing how they’re not a congregational religion: https://www.churchofsatan.com/satanism-is-not-a-congregational-religion/\n\nThis is either fake or OP’s son is making it up.", "[removed]", "I would not suggest dramatic I admire him for his pettiness.  Made me giggle.", ">your son is being dramatic.\n\nIn my opinion he is being supremely funny, but humour is subjective I suppose.", "> She should be angry with your son for turning her wedding into a circus designed to piss off religious family members.\n\nThe wedding isn't *her's*, it's both of theirs. It's pretty shitty, perhaps even sexist, to imply this isn't both of their decisions when you have no way of knowing and *especially* when the post has the couple on the same side of the issue. \n\n\n*Weddings are not just for women.*", "If ur pissed off by a \"satanic\" temple you deserve to be pissed off", "Completely agree with you. Some people hate religion so much they aren't able to see past anything else. \n\n Not sure why anyone is calling you sexist. People just like to argue these days", "Tbh I think he is too immature for marriage, never expressed that to him but this really sealed that opinion.\n\nHe could have done so many things than make it a circus and I am not cleaning it up.", "No wait. I want more details on the “satanic temple” cause for a very religious person A WHOLE LOT OF THINGS can be “satanic temples” (Eg: a temple of another religion they consider a cult or whose teachings they strongly disagree with). \n\nSo is it a literal satanic temple or just a satanic according to religious people?", "You're currently the top comment so your A H judgment counts.", "I've been to the place OP is referring to. It's essentially a novelty tourist trap in Salem. Not a real temple with real religious ceremonies. The vibes would be very similar to having a wedding at someone's private art gallery.  \n\nThe space is also very small. They're not fitting a hundred people in there. I doubt they can even fit 50 people in there. So even without OP specifying the number of guests, I know it's a small wedding. \n\nIt's a gift shop + a museum. The museum doesn't even really have anything historical or religious. It's just vaguely Gothic looking art and furniture. \n\nSometimes if you're lucky, they'll have the famous Baphomet statue. But it's not even displayed. It's in a locked  shed at the side of the property.", "I was about to add that. What is a Satanic temple? Cause I also googled it, and nothing showed up... So is she asking to get married in a church that is a different religion than OP? Or is she a full on satanist. But either way, this whole thing sounds very strange.", "I live very close to Salem and have for over 50 years) and while there are a lot of Wiccans and Witches (and weirdos ;) ), this is a first for me hearing there's a Satanic group.\n\nThere is a Masonic temple I believe - lol!", "I found a Satanic Temple", "OP's son just put that on the invitation for the shock value. He wanting a big FU to that side of his family, and he got it. This story may be fake, but him listing the Satanic Temple as his venue is more about the statement than it is an address.", "TST has a \"temple\", art gallery, and general headquarters in Salem, Massachusetts. They do not generally ordain ministers to officiate weddings, nor do they rent out their space as a wedding venue, AFAIK.\n\nThis seems like a well-crafted \"fuck you\" on OP's son's part.", "I think this whole story is made up. You are right, there isn't a physical temple. Not all chapters even meet in person. I've never met anyone in my area that is also a member.", "There is a physical location in Salem, MA. It's the headquarters for The Satanic Temple, and the place where the Baphomet statue lives when it's not out in public spaces. \n\nI've been there before. It is not a religious organization or actual temple. It's legit just a museum with gothic looking furniture, art and decor, and a gift shop. \n\nIt's essentially a hokey tourist trap. If you need context for the type of events that the location usually has, it's mostly drag nights, art shows, and paint and sip nights.", "I don’t know, the grandparent’s definitely won’t go, his sister probably won’t, cousins are a no, so they leave me and I don’t even know if I want to go. \n\nHim doing this just seems like a huge fuck you.", "I'm a Ex-Mormon and it sounds like what OP is based on him not marrying in the temple. A lot of Ex-Mo's who are still good with their families will have a wedding at a venue, a beach park etc.  They make it neutral. Of course older generation of Mormons push back a little bit but OP stood up for him. Moving it to a satanic temple is way too far if he wants anyone from his family to come.", "Actually a quick bit of research shows you CAN actually get married by the satanic temple. They may not have an actual temple but a member can officiate weddings, on the link scroll to weddings. This may be what OPs son has done but not told his family that. Took me less than 5 minutes to find this.\n\nhttps://thesatanictemple.com/pages/faq", "Thank you. I'm surprised this isn't top comment. There is no temple. I'm a member and have been since 2016. There are chapters in different areas but there isn't a physical temple.", "It took me all of 2 minutes on Google to find that you are dead wrong. The Satanic Temple offers ceremonies, including weddings, at their headquarters in Salem. \n\nAt this point you are only talking semantics about what does or does not count as \"a temple\", but it is clear from context what the OP meant.\n\nIt will be a wedding ceremony held in Salem, at the headquarters of the Satanic Temple.", "I’ve got no idea, but isn’t there two of these religions/cults/organisations? The Satanic Temple & Church of Satan. \n\nMaybe one has local club houses or something?", "Or son is the liar??? Seems like an edgelord move to me.", "People know only what they make up in their heads or by fictional tv shows about the Satanic Temple.", "Preach!", "People are so gullible.", "OP said it’s HQ. You’re just a big ol’ asshole", "They don't.", "Me, too. \"Thank god I'm an atheist.\" — Michael Stivik", "One thing to note, though, is that they don't actually have temples. There are a few places where they have enough people together that they may have a building. But not actual temples.\n\nUnless they are in Salem, and are doing an elopement ceremony at the headquarters, this is a pure lie.", "It's usually just another form of atheism.   \n\nPeople get all bent out of shape because, you know, Satan.", "The name is not unfortunate, it's a big part of the point. They basically use being a Satanist Temple as a glaring example of lack of freedom of \"religion\" in the US when that religion isn't Christianity. They're a pretty cool organisation.\n\nThere are actually people who regard themselves as religious Satanists, but they generally espouse pretty good and eglatarian views. \n\nAs far as the OP, the son is really shooting himself in the foot if the goal is not a huge drama. ¯\\\\\\_(ツ)\\_/¯", "Reading comprehension problems? Op will not go, just as the rest of the family. Since her drama king son only chose the temple to rub it to the family, Op suggested to elope. Son could elope with his bride and marry on a beach, as they originally planned.\n\nNTA", "Yup; it's never just \"Oh you aren't getting married in the temple? Okay\" it's a whole nonstop social commentary that deliberately creates unhappiness. Who has time for that at their own wedding? Or any time, for that matter? OPs kid is making sure anyone who would be offended by him and his fiancee stay away. OP says his kid is acting in anger. No shit. But it's not the display of immaturity that OP believes it to be.", "So, shouldn't, then, he elope like his mom suggested? Don't want religious people? Don't invite them. Inviting people when you know it's going to piss them off is an ahole move. Besides doesn't seem like you're mature enough to get married if you want to be petty with your wedding ceremony.", "\"and wants to avoid that.\" Wouldn't it be easier to just rescind their invitations and not change their plans? What happened with mature approaches?", "Exactly.", "If he and fiancée decided to be married by someone through the TST as a way to prevent religious bigots from showing up to their wedding that is 100% their right and choice. This makes sure only the people who truly live them show up. The TST isn’t a dig at someone else’s religion. It’s the secular view that one’s religious beliefs shouldn’t be dictating how an entire community or country treats others based on their own interpretation of that religion!", "When you do, reach out to your local TST chapter. One of their Ministers can talk it over with you.", "The grandparents definitely are. I don’t think OP is. OP ran interference and told the grandparents to knock it off.", "I have to say, he came up with a really clever way to separate the people who love him, from the people who don't.", "Not hilarious, more like embarrassing edge lord.", "Let's suppose that your family are mostly a bunch of patriotic conservative Americans, and you're progressive and think that patriotism and national identity politics is the most dangerous feature of contemporary geopolitics.\n\nYou would obviously choose not to have any patriotic symbols at your wedding, and that would be fine, and nobody would seriously expect different. You'll get some low-level grumbling from the hard-core patriots, but that's it.\n\nBut what OP's son did is the equivalent of choosing to celebrate his wedding with a communal flag-burning. Would you expect your hypothetical patriotic family to attend your flag-burning? I think you'd be unreasonable and unrealistic to expect that. Expecting your religious family to come to your Satanic Temple wedding is the same thing.", "No, he has never attended for my knowledge. I don’t know if I will attend or not. I don’t really want to but he is my kid", "OP made it clear they didn't care if the wedding was on the beach. OP said they told the rest of the family to get over it.\n\nIt doesn't sound like OP is pushing beliefs onto their son.", "LOL You had me at “Sky Santa”!  Excellent", "I love this comment getting downvotes for calling out OP. Guessing the Sky Daddy (though i’ll admit i’m adding sky santa for the seasonal jokes) crows didn’t like that", "As a member, your interpretation of TST is false. It is not a parody nor is it meant to mock religious faith. It is a recognized non-theistic religion whose focus is on compassion, empathy, and emphasizing that we are a pluralistic society with many different religious backgrounds. Court cases such as those involving ten commandment statues, and the formation of the After School Satan Club in different districts, is our way of making sure that the line of church and state is not becoming even more blurred. The idea that if one religion can exist in a public space, so should others.", "It’s not.  Look it up", "Sort of. I think a lot of people in this thread are conflating two different organizations.\n\nThe Church of Satan is a proper church.\n\nThe Satanic Temple is a quasi-religious organization devoted to religious equality, especially in cases where there isn't a clear separation of church and state.", "I don’t think OP’s son is a Satanist. I think he’s still salty his grandparents wanted him married in a temple, and even OP told the grandparents to be quiet he’s having it in a Satanic temple to thumb his nose at his grandparents.", "Calling them a hate group is ridiculous. They challenge hypocritical religious laws to try and keep religion out of government. That's what they do. They do not actually worship Satan, or foment hatred against religious people.", "I think being petty for the sake of pettiness is being an AH.", "Your comment has been removed because it violates rule 1: [Be Civil](https://www.reddit.com/r/AmItheAsshole/about/rules/). Further incidents may result in a ban.\r\n\r\n[\"Why do I have to be civil in a sub about assholes?\"](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\r\n\r\n**[Message the mods](https://www.reddit.com/message/compose?to=/r/AmItheAsshole) if you have any questions or concerns.**", "I don’t get why he didn’t stay with the beach. There is no way the family will walk into ( their words) the devils nest.", "Lots of other religions have temples. Jews,  Hindus, Buddhist etc.", "OP said they're not Mormon so maybe Jewish? Jewish people don't actually believe in satan tho so idk why they would try to be offensive using that.", "You're probably right. Hopefully she recognizes that her fiance seems to be just using their wedding as a platform to piss off his family. \n\nIf they were previously part of the satanic temple, that would be different. And appropriate for them to have their ceremony there. I'm not a part of the satantic church, but I appreciate what they stand for. \n\nBut based on OP's account of things, it seems like a whim decision to piss everyone off. What a sad misuse of a wedding.", "HA.. thats funny. Looks like there is one in Salem, MA. But yeah I'm having trouble finding any other physical buildings for either The Satanic Temple or the Church of Satan. Interesting.", "Wait the satanic temple isn't the church of Satan. It does really sound as if the son is either ignorant of the satanic \"temple\" or is banking on the ignorance of his relatives, like \"you wanted me getting married in a temple and I chose this\"", "Or the OP is using Church and Temple interchangeably.", "Agree. The phrase \"cutting off your nose to spite your face\" comes to mind.", "Pretty funny if you're, like, 14", "Geez. going a little far on one statement. \n\nMy point was that OPs son seems to be making the wedding about pissing off his family, instead of making it about he and his fiance's marriage.", ">Weddings are not just for women.\n\nAll the women in my life (-1) would disagree with you", "He didn’t make it a circus. The people upset made it a circus. He simply responded in kind.\n\nHe gets to have his wedding however they want, and if y’all don’t wanna show up, you don’t have to show up, but he doesn’t need to elope just because y’all are too into your religion to respect that he isn’t .", "How many times did ur shit hole family disrespect him cuz of ur shitty ass God? I can understand why he is going all out like this. I did the same thing. I stayed married for 9 and a half wonderful years til May of this year when my husband passed from cancer. And God didn't save him. Fuck religion. Fuck God. Good on ur son for going full out war on ur cringe ass family. NTA on ur son", "The fact his response to mild criticism is to go full-cringelord makes it pretty clear he isn't.  Maybe by the time his second wedding comes around he'll have grown up enough to make it last.", "Probably so. \n\nBest to just not communicate about the wedding anymore. Decide for yourself if you would like to attend or not. \n\nHe sounds like he has a lot to work through. Unfortunately you cant help him much with that.", "Well, it's pretty hard to grow up with your head on straight when you're raised in a cult.", "I would be pissed just on the principle of having to get a temple recommend again! Do people know what was being asked of him? 10% of his income for life, no premarital sex, and the fiancé would have to convert as well. They couldn’t live together, and would likely have to repent for everything they did as a non-Mormon couple before they could get married, which could be up to a year. Everyone calling this guy an edgelord has no idea what he is being asked/guilted to do.", "Let me tell you a story.\n\nMy daughter and son-in-law have an inter-faith marriage.\n\nThey got married at the wedding venue by a non-religious officiant.\n\nNow, my side adores my son-in-law and his side adores my daughter. But, quite a few people had “opinions” on their decision. Some thought they needed a priest. Others said a rabbi. Someone said hey, why not both.\n\nYou know what I, the dreaded mother of the bride said? It’s their wedding. And if anyone makes my daughter or my son-in-law cry over how they want to handle this wedding, I’m going to make that person cry. Long and hard.\n\nYTA. Your son’s not too immature to get married. You’re just too self absorbed and hung up on your own beliefs and desires to recognize you might be too immature to be a proper, supportive parent.\n\nI like how your son handled things. If pushed, I might have done worse.", "He’s definitely immature.", "[deleted]", "Or maybe he is just so done with your kool aid that there’s going to be no productive actions done to appease your cult members.", "cleaning what up?", "He was probably talking about The Satanic Temple, which doesn't actually believe in or worship Satan. Or considering they sound Morman, it could be anyone but them.", "AH isn't a judgement, so if it remains the top comment mods will manually review.\n\nYou also don't need to space out your AH even if it was a correct vote because the bot only reviews top-level comments.", "[deleted]", "[https://thesatanictemple.com/pages/the-satanic-temple-salem](https://thesatanictemple.com/pages/the-satanic-temple-salem)  \n\n\n\"64 Bridge Street In Salem, Massachusetts, Serves As The International Headquarters For The Satanic Temple (TST), A Non-Theistic Religious Organization With Active Congregations Worldwide.\"  \n\n\nThe Satanic Temple's political activism is often characterized by its campaigns to uphold and promote the principles of secularism, individual rights, bodily autonomy, and freedom of expression. The Satanic Temple uses Satanic imagery and references to draw attention to its activism, but its principles and actions are rooted more in Enlightenment values and a commitment to rationalism and individualism.", "I have a friend that moved to Salem after college and it seems like all the \"weirdos\" exhaust her. She's part owner of a children's book/toy store there which is probably like the exact opposite of \"spooky witch stuff.\"", "FWIW - The Satanic Temple has nothing to do with satan, worshiping satan, witches, wiccans, or anything magical. Its more of an \"anti-religion\" religion. Its a group for people to belong to who don't otherwise have a shared faith with anyone else. Thats my opinion of it anyway.", "Him doing this just seems like a huge fuck you.\n\nI’m guessing it definitely is TBF.", "If your religion tormented him, then a big fuck you is in order. It's his wedding, your religion shouldn't matter at all. Sounds like the whole family is full of religious bigots.", "Have you looked up the tenets of the Satanic Temple? Go look their tenets up first, then come back & tell us what’s so bad about them.", "It seems like that because it is.  Sorry, your kid fell in with a bad crowd who is actively working to cut him off from outside voices.  Funny how the people on this site who usually point out how bad that is are instead cheering it on in this post, ain't it?", "BY the Satanic Temple, not IN a Satanic Temple", "Yes but OP is talking about a physical building which doesn’t exist.", "I'm wondering if the groom may have sent his family fake invitations with that as the location and directed the people he really wanted there to the beach.", "https://www.salemartgallery.com/products/the-satanic-temple-salem-ceremony", "You’re right, they are two different organizations. The satanic temple has a physical location where you can have a wedding ceremony.", "Well it’s a good lie to keep his bigoted family away", "They have weddings and he said it was in a temple.  \n\nI like some of the rooms love books. \n\n[https://www.salemartgallery.com/pages/satanic-ceremonies-at-the-satanic-temple-salem](https://www.salemartgallery.com/pages/satanic-ceremonies-at-the-satanic-temple-salem)", "Or he can stick with his plans and have only the people who care about him and his new wife show up!\n\nThat’s what I would do.\n\nP.S. Rude much?", ">The TST isn’t a dig at someone else’s religion.\n\nSure, if OP was genuinely involved with them, that would be true. But unless there's omitted information, he's not, and is just using them as a tool to try and root out people in his family he doesn't like.", "I think that’s fair. We still got assholes on multiple fronts.", "By trying to force them to attend to a place that probably go very much against most of the families beliefs? When the problem (grandparents) had already been dealt with? There was literally zero reason to do this other than spite (and as some spiteful mf myself) that's just petty and kinda sad that you wanna celebrate your wedding by spite instead of love.", "You example is a false equivalency. The family isn't being asked to participate in or endorse TST merely attend an event on their premises. A better example is a Catholic is having a wedding in his church and his Jewish friend comes and attends his wedding because they're friends and he wants to be there for his friend, happens all the time.", ">Expecting your religious family to come to your Satanic Temple wedding is the same thing.\n\nOnly to people who don't actually understand what the Satanic Temple is.\n\nSome people stop reading at the name, I guess.", "Do you know what TST is? And the good work they do?\n\nBut if you want to use the logic of religious family attending a wedding at TST, you could also say it’s unreasonable to expect your atheist family to attend a church wedding… do you realize how stupid that sounds?", "If you don't go, just be aware that any relationship you hope to have with him in the future will be dead as you'll clearly demonstrate your love is entirely conditional and your faith is more important than supporting your child.\n\nIf you're okay with sending that message then by all means, don't attend.", "There is no physical temple. You are full of shit.", "You don’t want to attend your own son’s wedding?", "Genuine question: why did they call themselves the Satanic Temple instead of the Non-Theistic temple or something like that, if not to mock?", "Valid. My comment specifically is “satanic church” which technically isn’t right either lol. \n\nI was/am talking about the church of satan \n\n\nHoweverrrrrrr in this situation I could see why the son would think the satanic temple would be a good fit", "He is not, we all know it was a fuck you to the grandparents", "I don’t think that’s up for you to decide 🤷🏼‍♀️\n\n\n\nActually, that is kind of the whole bottom line of this post right? The son gets to practice (or not) what ever religion he wants too and it (shouldn’t) have any effect on his family attending his wedding", "I am aware they do not worship Satan. However, they are notoriously hostile to people of the Abrahamic religions, chose their name and aesthetic to be as offensive to certain religious groups as possible, and stole the Eucharist from a Catholic church, which is the most sacred item to the Catholic faith, for the purpose of desecrating it.", "It has nothing to do with the devil. I would have assumed you would have at least did a quick google search seeing as your son’s wedding will be held there.\n\nHell, (no pun intended), I even looked it up just from reading this Reddit post!\n\nYTA and your son is brilliant", "He’s not stuck with the beach because the backlast on it’s given him an insite on what he’ll be dealing with.\n\nHe’s chosen a venue thats basically garlic to family members who’s drain the joy from his wedding wiilst leaving them free to overcome their prejudices if they’re capable of truely loving unconitionally.  \n\nThe question now is can you truely act like a christian, or will you stick with dogma?", "[deleted]", "Ohhh then I really don't know. I don't see a comment with that", "That's just the headquarters. All registered religions have to have some type of headquarters address. I think you can take tours of it. There aren't any kind of church funded locations. If chapters do meet, they will meet in community halls etc. I've never met any other members in my area in person.", "They're aren't any. Imagine the vandalism that would take place from \"good good fearing folk\". If this is real he probably meant being married by a Satanic Temple Minister. Or he was sick of his family's demands and said that to get them to go away. \n\nHey OPs son, if you ever find this. Reach out to your local TST chapter. I'm sure they'll be happy to marry you on the beach.", "Church of Satan and TST are two completely separate organizations.", "Correct. TST is basically a civil rights group that fights for true rligious freedom by pointing out Christian hypocrisy and discrimination. They are registered as a church because it puts them on equal legal footing in regards to religious freedom, but the organization itself is atheistic and secular in nature.\n\n\nChurch of Satan was founded in the 60s by Anton LaVey, and is completely different.", "They’re allowed to chose the wedding they want. Regardless of your assumptions about why they’re doing it.", "I didn't read anywhere in the post that said the fiancee disagreed with his decision or wasn't a part of making the venue decision. If they both agree on the venue and the family is making a stink then i dont see how they're not making this \"about their marriage\". It's not their fault their family prioritizes fairy tales over family.", "> geez. Going a little far on one statement\n\nYou mean the exact same thing you did? Maybe try introspection.", "one very stupid statement.", "Seems like OP's family is making the wedding to be some religious experience for themselves when it's really about the couple's celebration however they see fit.", "Sucks to be you then.", "Condolences", "You think this is the first time his family has shunned or disrespected him for leaving his religion, op has mad it clear religion is very important for most of them.\nThey tried to make him as a grown adult have his wedding where they wanted knowing he didn’t practice. Wonder what they did when he first stopped…", "To think that religious trauma is just mild criticism is wild", "How so? Maybe he’s enforcing his boundaries? I’ve been legally married for over 20 years. I was raised catholic, and the last time I stepped foot in a church was for my grandparents funeral. And that will be the last time. Everyone knows that I no longer believe, and my mom asked me if I would lead a prayer. I pulled up a reading from one of the pillars of faith from the Satanic Temple and showed her. She left me alone after that. If my wife and I chose to renew our vows and someone asked me to hold a religious ceremony, I would do this as well. My children know that for my funeral that I want absolutely nothing to do with religion. I don’t want a stranger standing up there talking about me like they knew me. My children understand that they are going to piss off certain family members, but they’re ready for it. I don’t know how much more clear OP’s son needs to make it for her that he wants nothing to do with any religion.", "If they were Catholics and demanded a wedding in a Catholic Church it’s fine, but if they’re anti-religious and want a wedding in the satanic church it isn’t?\n\nThis kind of double standard is exactly why the church of Satan exists.", "Edgy", "They're not Mormons.", "Very well said.", "THIS. This right here is the only appropriate response.", "If atheists are purposely having their wedding at a temple to piss off relatives, you might have a point. The wedding is at a satanic temple with the sole purpose of pissing off family members. He cares more about sticking it to his grandparents.", "Sorry, but as a committed atheist and someone who is familiar with the \"satanic\" (really, teenage philosophical nietzchean atheist) stuff, I'm siding with OP. This is just immature. The satanic church is just a purposefully provocative atheist movement that you're supposed to outgrow with age. It is incredibly immature to conduct the wedding that way. If you want a non-religious wedding you can get that, but choosing the satanic temple is not out of any type of religious conviction, just pure spite. NTA.", "I think they were just pointing out that I forgot to actually input a proper AH judgement. Which was true. I made the edit to include my judgement.", "They weren't hidden when I made my comment.\n\nEdit: idk if I mistakenly commented here instead of somewhere else, tbh.", "Yeah, you def sound like your projecting. And if the region is what tormented the son, then why is father getting punished? Why not a eff you to the church or the pastor or whoever specifically helped I'm the downfall our his relationship with religion. I'm a Christian, so does that mean if OP is Christian, does that mean I deserve a big eff you as well? Your logic is flawed.", "seems like ur projecting lmfao what's these assumptions ur making?", "How was he tormented?", "[deleted]", "Right if you were a Muslim or an atheist and refused to go to a Christian wedding you would be seen as an asshole. No one is asking OP to convert", "That’s not the point. They do a lot of good for equality and separation of church and state. Still doesn’t change the fact that having it there as a non member is just to fuck with religious family members. Son is a dick.", "Noo you got it wrong, it’s okay when it’s about topics they like", "People can't be consistent in their ethics when it comes to an opportunity to dunk on their \"foes\".", "Let’s be honest, when sending out a fuck you invite the son is going to put satanic temple wedding not wedding done by a satanic temple employee", "Oh that’s good! I hadn’t thought of that lol", "Yes, in Salem, MA, at the museum in their headquarters. Not a temple.", "I'm fairly sure that the lie is not coming from a possibly non-existent son. OP is straight up lying.", "Yep! If you love your skydaddy more than me, then you don't love me. If your religion won't allow you to enter other houses of worship even if you don't absorb those beliefs, then your religion is bigoted. This scenario is pretty much just that.\n\nThe religious zealots are the ones who destroyed any chance at a loving relationship, not the ones getting married as they choose.", "Nope - that's not equivalent. And the reason it's not equivalent is that the Satanic Temple is purposely mocking and parodying religion. Christianity hasn't always had the best relationship with Judaism, but it's not like it was deliberately set up to mock and parody it.\n\nI've been to Christian weddings. I've been to Muslim weddings. I've been to plenty of secular weddings of all kinds of descriptions. I haven't actually been to a Jewish wedding, but there's no reason why I wouldn't go. I would attend a wedding at the headquarters of pretty much any humanist or freethinker organization.\n\nBut I'm not showing up for the Satanic temple, because it's deliberate mockery.", "It's an intentional parody of religion, created as a political move by atheists opposed to what they consider state favor shown towards mostly Christianity.", "I assumed the same until I looked it up.  It is an unfortunate name for a group with such a good cause.\n\nI myself am a Pastafarian and worship The Great Spaghetti Monster.", "Yes, I know what the Satanic Temple is. A lot of the time, I agree with what they say. (Not with the actual atheism, but on probably the majority of issues they get publicly involved with, I'm at least mostly in agreement with them).\n\nIf they didn't have the intentional mockery and the satanic imagery, I'd be quite well disposed towards them.\n\nIt's the mockery and parody that makes TST different from \"just an atheist organization.\" And if I had a church which made it a key part of their branding to mock atheists, I'd think it completely reasonable that atheists didn't want to come to a wedding in it.", "There are multiple congregations.  And the headquarters  in MA can be found on weddingwire as a bookable venue...", "They actually address this question, and similar ones, on their website if you would like to check it out under their faq. I will give you my opinion as a reply though. I think rather than using the imagery to cause outrage, it's for many reasons including being a critical thinking \"test\"/opportunity. John Milton's character in Paradise Lost isn't just some evil devil with horns and a pitchfork. He fits more with the namesake of \"adversary' and TST uses him as a symbol against tyranny and arbitrary authority. To me, this symbolism connects with their political viewpoints and activism. That we aren't just causing a ruckus, but calling out injustice from those in positions of power. I also feel that there is some shock value there, but I believe it's a bit of a necessity on two fronts: the first being that those pushing their religion in these positions of power would claim from a legal standpoint that we have no footing if we were just under a heading like \"American Atheist Society \" or something similar. They would argue we could not understand their deep-rooted faith with nothing similar of our own. My second point would concern garnering media coverage for our legal battles and attempts at keeping those church and state boundaries. If we had a name like \"Nontheistic Religion\", or whichever example you would like, no one would really pay it much attention. It would easily fade into the background, and most news sights might not even bother to cover it. Tldr the name is both a shock point to make sure it doesn't fade into obscurity, bit more importantly, it's a literary nod to Milton as well as a way to point out hypocrisy in those abusing their position of power and using their religion to do so. Sorry for the verbose answer", "Yeah, as a response to religious pressure it's pretty much perfect.", "Well the grandparents agitating for a temple marriage when they know he's not religious was a fuck you to *him* and his morals, and his fiancee.\n\nI can wholly understand him being pissed, especially since you seem to be more invested in making sure there's no boat-rocking.\n\nI think you disparaging his action and calling him immature is just an indication that you don't care to understand what he is doing and why it's important to him. \n\nYou're very dismissive of his anger.\n\nYTA.", "I’m not deciding anything. WTF are you on about. \n\nOP has been fully supportive of son leaving the religion and having a secular wedding on the beach. OP told the grandparents to shut up and mind their own business when they stepped out of line. \n\nThe son is the one making his entire wedding about someone else’s religion.\n\nEdit: OP can’t diminish the sons religion if he doesn’t have one.", "Jew here, colloquially we call the synagogue the temple. And many of them are named Temple ______.", "Oh shit it just occurred to me that they could be Hare Krishna which could very well result in trauma. After all, they're essentially the \"mormons\" of the hindu/jains/sikhs (in terms of strict rules and lifestyle, and also the conversion attempts). My county has actually one of the highest populations of hare krishnas in the US so I know some families that are hare krishna for a couple generations or so. I also one time wore [this t-shirt](https://www.amazon.com/Steven-Rhodes-Summon-Demons-T-Shirt/dp/B0BPTHLNW5/ref=asc_df_B0BPTHLNW5/?tag=hyprod-20&linkCode=df0&hvadid=647212028392&hvpos=&hvnetw=g&hvrand=11241056100781114660&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1015033&hvtargid=pla-1969104264663&psc=1&gclid=Cj0KCQjw4bipBhCyARIsAFsieCw1n31FySxnd-7eN4fw_hAVBZiOxN0rbFxIQTKULDk8Z4ANYFyX5C4aAkYTEALw_wcB) to get lunch at the krishna-house that was down the road from my house (they make a fantastic vegetarian lunch 5 days a week) and one of the guys there got offended and started questioning me for wanting to summon demons and I was like \"ohhhhh I bought this as a joke, I don't think summoning demons is a real thing\" legitimately not realizing they might find it offensive.", "The headquarters is lovely inside. The most beautiful wallpaper and drapery that I've ever seen. It would honestly be a great place for a very small wedding.", ">for either The Satanic Temple or the Church of Satan.\n\nHow did I imply otherwise?", "Never said they weren't allowed to do it.\n\nJust saying OP is NTA for suggesting they elope considering both the groom and the extended family seem upset at eachother for the whole thing. And groom doesn't seem interested in the family even coming. \n\nBut tbf.. it does seem pretty obvious that they changed the venue in response to the family's gripes about a beach wedding. And considering the son literally said \"they wanted a temple.. they got a temple\". \n\nAlso.. the whole thing seems weird seeing as how there is no such thing as a satanic temple. So I'm curious where they plan to hold the wedding.", "And he’s allowed to share his opinion. It’s why the story was posted here. To ask people’s opinion.", "Because the initially wanted it on the beach, and completely changed the venue in response to the families disapproval of the beach. \n\nRegardless, as someone else pointed out, its likely a fake story anyway. There are no physical satanic temples. Its not a thing.", "I was never implying weddings are just for women. \n\nIf thats how you want to read it though, by all means.", "Hence why they are determined as AHs.", "They coordinated a love bombing attack followed by ghosting OP when they see the guilt trips and manipulation aren’t going to work for them. \n\nThen when they need something, crawl out from under the floorboards with their hands out, shouting “but FaMiLY” like they never did anything at all in the first place.", "To think that the modern zoomer use of \"trauma\" has any meaning whatsoever is wild.  No, being actually parented isn't trauma.  You're just weak.", "> which made the grandparents upset that it wasnt in a temple but they got over it **after i told them to knock it off**\n\nwhat part of this post implies that OP cared about them having a religious ceremony? the only complaint OP had was about it being in the satanic temple since they’re religious themselves and dont want to step foot in a satanic temple which is 100% valid.\n\nETA: since some people aren’t getting my point I’ll be clearer. OP stood up for his son’s right to not have a religious ceremony. OP did the right thing. OP is also in the clear to not want to attend a satanic wedding. thats his right just as much as its the son’s right to not want a religious wedding.", "> Maybe he’s enforcing his boundaries?\n\n\"Enforcing boundaries\" is keeping the beach wedding.  Canceling it to have it at the facility of an anti-religious trolling org is going full-cringelord and is a glaring sign of being way too immature to make a lasting marriage.", "Sending the entire family satanic temple invites is childish. He’s enforcing his boundaries in a childish way instead of like dad said, just eloping and saying fuck their opinion.", "Ironically the Satanic Temple is doing the lord's work.  I am a member.", "Yes, it's a trolling organization made up of cringelords who can't handle the fact that their lack of sincere beliefs means they have to live without the things that come with sincere beliefs.  Sorry but that's just childish.", "Just read the edit, good thing!", "Generally, people don't actually leave a religion unless it has tormented them in some way. \n\nNeutral people tend to just say they are a non-practicing Christian, Muslim, etc.", "Probably because his family made everything about religion. That's one way to do it, and given the details from OP, I would say there's a pretty good indication that this was at least part of it.", "I’m sorry, but speaking as an atheist, keeping a wedding at a Satanic temple and expecting religious people to show up makes no sense. Just don’t invite them if you don’t want them there. This is just drama seeking.", "He's an AH for going well beyond wanting \"nothing to do with it.\" I won't be getting married in or stepping foot in another church unless it's a huge desire of whoever I'm marrying. He could have just had the beach wedding he wanted, and he got OP's backing on, but he instead went nuclear and blew things up with that side of the family. He knew they wouldn't come. He could have just disinvited them for not respecting his wishes. Instead, he made it so his own parent may not come to his wedding.", "Especially Mormonism which is what it sounds like", "I think it's different to refuse to go to a wedding based on the same abrahamic tradition as your religion, vs refusing to go to one based around the supremely evil being in your religion. \n\nNowhere in the Bible does it say \"The muslims are evil, do not associate with them\". It does say that Satan is evil and should be shunned, avoided, and mistrusted. You're asking them to go against a deeply held core belief. That's different than showing up at a wedding from a different religion.", "I have seen a lot of atheists refuse to go in churches even for weddings and funerals and the response is generally supportive", "Exactly.", "I'm as atheist as they come so you don't need to convince me that religion sucks don't worry, and am not defending the zealots in any way, all I'm saying, the problem was already as good as solved, don't wanna risk gossip and unpleasantness during your ceremony? Rescind invites and let everyone know they'll be kicked out if they start with the negativity. But going the extra mile to just try and bother them? I mean I love pettiness, but that just feel like staining one of what's supposed to be the best days of your life with petty revenge and childish approaches?", "Oh, come on now. I'm as against skydaddy as anyone, but this isn't just another house of worship. If they truly believe in their religion, this is a place of evil to them. OP's son is being directly antagonistic, just like the family members who are pestering him about choosing their holy building of choice. It seems like passive aggression runs in the family no matter what they believe in.", "How about as an atheist attending any religious wedding cause all of them persecute and mock atheists. \n\nAlso how is the satanic temple \"mocking and parodying\" religion?\nThey often fight for equal representation when religion encroaches on public space but that is not mocking religion. A baphomat is no more offensive than a crucifix. I think it's your bias that perceive anything outside of beliefs you deem acceptable to be mocking you for merely existing.", "… that literary fight for religious freedom. What??", "They do not parody religion nor do they have satanic imagery.  You either don’t know what you’re talking about or your own bias is causing you to misinterpret things.", "The place in Salem is a house, not a temple.", "You said you don’t think he is a member of the religion he is choosing to use for the temple at his wedding. Then you based your opinion on the fact that you “don’t think he his”\n\nSon sent out invitations with the address to a satanic temple. Not a beach. That’s where he wants to get married.", "I just saw the update that they aren't Mormon haha. I was looking for a commen. So now I don't know", "Ooo I guess I should try to make a trip next time I am home then. I never really thought about visiting it. But I've never been to Salem either, even though I'm a New Englander.", "There is a such thing as the satanic temple. You just make things up fast as we can question it.", "The temple doesn’t exist they didn’t change the venue they just added a temple as demanded", "They probably made a Satanic temple out of cardboard boxes in their backyard", "There is in Salem.", "are you lost?", "I've just read all these nonsense arguements and I would like to apologise to you on behalf of the braindead people that use this site.", "So you don’t believe in religious trauma? you don’t believe that being raised in a harmful religious organization could cause trauma? It must be nice living in such a delusional world.\n\nThose of us out here, deconstructing and living after religion can tell you we aren’t weak we’re stronger than we’ve ever been and more knowledgeable because we’re not being controlled by a fairy tale written hundreds of years ago .", "Nothing in this post is actual parenting. This is overstepping in your grown child’s life.", "Why is it ok to expect someone to go into a church if they aren’t religious but not the other way around? \n\nYou realize the entire point of the satanic temple is to highlight this very hypocrisy?", "Christians are always hilarious. Rape, they're ok with that,  abortions are evil,  caring for kids once born- optional, stepping inside another religion's establishment never! Kinda joking, but I'll bet these are the same people that spout family first, until that family gets in the way of god.", "There is no difference between not wanting to step into a satanic temple as opposed to any other place of worship.", "OP's feelings are valid and he can do what he wants but to say his reasons for not stepping into a Satanic temple are 100% valid is going a little far. People with no religious/contrary religious beliefs go into temples of other faiths all the time, you don't have to worship a deity to go in a building and I'm not aware of any Bible passages explicitly saying to you can't go into the building nominally \"owned\" by another deity. His son probably did exactly that for years after all. Hell, Jesus PURPOSEFULLY went to the sinners and nonbelievers so arguably anyone who follows scripture should be honored to follow suit.\n\nI'm just saying that his son isn't asking him to become a Satanist or even to explicitly contradict any tenet of his religion. He's just asking his family to do what he probably did for years and what countless others do across the planet all the time. OP has just gotten it into his mind that this is a personal attack or directly contradicts his religion. He obviously doesn't have to go but to say his reasons are valid is going too far IMO. YTA.", "His mom has to tell the grandparents to knock it off after finding out about the beach wedding… knock what off? They clearly didn’t respect his boundaries, he probably the changed the venue with the hopes no one from his family would show up, sent out the cards to make sure.", "It’s no more childish than sending them invitations to a Catholic Church. \n\nThe church of satan was invented to exhibit Christian hypocrisy, and it’s doing its job.", "You obviously know nothing about it. But ok lol!", "Having an imaginary friend is weak and childish.", "That's not true. Loads of people recognise is is all nonsense and don't want to be associated with it for that reason.", "I'm agnostic. My parents are ortodox. I decided I'm agnostic because I have never did anything related to my religion (besides christmas, easter an ocasional ceremonies). I \"left\" not because of some trauma, but because I never truly belived and it also has some outdated views (and in my country the church does some shitty things).", "The grandparents wanting him to get married in a temple is being tormented? Are you just filling in the blanks in order to satisfy your own beliefs?", "[deleted]", "Can’t believe this hasn’t been spotted yet honestly, you’re absolutely correct", "I’m an atheist and I go all the time", "But we have no idea that the venue choice was solely for petty revenge. OP just thinks that because he's an unreliable narrator.", "And there are Christians that consider synagogues and mosques to be \"evil\"; so what? If you care about people more than religion, you'd be willing to go to \"evil places\" to support them. If you can't do that, then you are not really supportive.\n\nI don't really see the problem with the son turning his wedding into a loyalty test, especially since he seems ok with his family not attending over it. Nothing wrong with making a stand. OP is the one that wants to make peace with the religious zealots.", "He told OP that he was getting married in the satanic temple because his grandparents wanted him to get married in a temple and its as good a temple as any other.", "The Satanic Temple is a religious organization. Just as the Church of Satan, founded by Anton LeVey, is also a religious organization. There are different chapters of The Satanic Temple across the country. \n\nBut as far as I could tell, and a few other users confirmed, there is no physical location where one could actually hold a wedding ceremony. There is a headquarter in Salem, MA.. but it doesn't seem clear that ceremonies can be held there.\n\nOP said \"He sent out the invitation and it was ***at*** the satanic temple\". Implying there is some physical temple. \n\nIf you find other information, let me know.", "Now *thats* a wedding I would attend.", "Right.. its technically the headquarters. As far as I can tell, it doesn't facilitate ceremonies.", "What point are you trying to make here?", "Haha.. I appreciate that actually.", "> So you don’t believe in religious trauma? \n\nI don't believe Zoomers when they cry about \"trauma\" knowing how fragile most of them are.", "So you're being even more fragile in acting like what's in the post is trauma.  You're not doing yourself any favors here.", "im a member of the satanic temple, so yeah im aware, but OP *isnt doing that*. in fact, OP stood up for his son and got the grandparents to stop pestering him. thats my point. \n\nOP did the right thing, so how is OP at fault at all here?", "If you aren't religious, surely that means you don't believe in the entity being worshipped in the church. Correct? Now, that might make some people not want to enter, but others might find it no different from entering a grocery store.\n\nPeople of the Abrahamic faiths very much believe in Satan as the antithesis of all that is good. Entering a sited devoted to his worship can never be like walking into just another building. Do you see how that's different from not-believing?", "Be careful, you might cut yourself on all that edge", "im aware, and i agree, thats why i dont understand how OP did anything wrong since he was standing up for his son’s right to not have a religious wedding", "Except the satanic temple doesn’t exist it’s a concept, but there is no physical temple", "I know all about it.  That's why I know it exists solely to troll.  Which is just sad.", "That is true, but in the case of OP's son, given that his grandparents were so against a completely secular location like the beach, I am thinking this family did a lot more damage in the past, using their religion.", "No, I'm talking about why OP's son left the religion in the first place. That predates this whole wedding debacle.", "He can do whatever he wants, but he shouldn't be upset with OP's hesitancy. Even if he's justified in cutting them off, he did OP no favors as the mediator. OP is in an impossible situation here, and I don't blame them for not wanting to go to the new location if it was just chosen out of spite.", "Oh I know a ton of people do, I just meant that some people who are atheists have very strong issues with religion and won’t go into any church in the same way some people are very against going into the church of another religion when they’re religious.", "The idea before seemed to be a wedding on the beach, which is why the whole problem with grandparents started, that then OP helped his son shut down.", "You think he rearranged his wedding from a beach to a Satanic temple for a reason other than pettiness?", "If the son actually wanted to have his wedding there, and it wasn't just some spectacle, maybe he'd have a point about their ignorance and care for him. He's making an intentional scene to test everyone. I wouldn't go either if I knew the wedding was more about proving a point than sharing love.", "Well,\n\nIt’s is as good of a temple as any other. \n\n\nSo again, you don’t get to decide how OPs son feels about the subject since we only have their hand knowledge of him", "The Satanic Temple Salem has the headquarters and also a chapel for ceremonies. \nI’m not sure how all you people google that you can’t find it. It’s not hidden on The Satanic Temple website.     \n\nhttps://www.salemartgallery.com/pages/satanic-ceremonies-little-black-chapel", "I googled satanic temple wedding and that came up. I could be wrong.\n\nhttps://www.salemartgallery.com/pages/satanic-ceremonies-at-the-satanic-temple-salem", "Since I’m not a fucking zoomer, you can just take my word for it then", "How am I being fragile stating fact? I’m pretty sure you don’t even know what the words you’re using mean.", "OP is at fault for saying they should just elope instead of actually having the wedding they wish to have", "I mean, considering how the abrahamic faiths actively discriminate against people who believe differently than they do, no I don’t see the distinction. Christianity specifically, holds a special privilege in western society that other religions simply do not.", "It didn’t read that way to me. You said it was “100% valid to not want to step into a satanic temple.”\n\nThats refusing to allow someone to choose the location of their own wedding. That’s not right.", "Yeah there is nothing saying he was abused then, you are assuming he was.", "Yeah, OP and his son talked about a wedding on the beach, nothing was decided at that time. If grandparents threw a fit at that, then maybe the couple decided fuck it, let's just do what we want, since the compromise options are still too inflammatory anyway. The fact that OP had to play interference with the grandparents over a simple beach wedding is a very bad sign.", "I don't think it is petty. \n\nIf I had family members who had to be convinced to go to the beach wedding, I wouldn't want them there at all. A satanic temple sounds like a great way to accomplish that without actually having to rescind invites.", "By that point of view you can’t decide he is a satanist by the information given, and therefore can’t say that OP diminished the son’s religion since you don’t have enough information to decide what the son believes.", "Curious if OP is in Salem, MA.", "Interesting! Love those rooms.", "a wedding invitation isnt a summons. OP is well within his right to not attend a satanic wedding, just as the son would be well within his right to not attend a catholic wedding. if the son wants OP there then he has to accept that there’s certain venues he won’t or can’t enter. \n\nthe son was originally going to have a beach wedding which OP was clearly fine with, and even defended his right to do so. OP didnt care about it not being religious, but he does care about it being satanic which, again, is his right. the son doesnt have to accommodate this, but he also can’t demand that OP attends", "Where does it say that OP is refusing to allow the wedding to be anywhere? He just said that the family wasn't going to go.", "Didn't say abused, just tormented. That torment could simply be the inner turmoil of \"how can I reconcile the fact that my family basically thinks I'm evil because I don't believe what they do, even though I know in my heart I've tried to do everything I possibly can to be a good person?\"", "I mean it *is* petty, you find it justified pettiness. He’s intentionally burning bridges, which is fine if that’s his goal and he doesn’t mind those bridges being burnt.", "I didn’t.\n\n\nI said that it is a valid religion so saying he “doesn’t want anyone religious there” is incorrect. (My comment says it diminishes his thoughts and feelings. He can have thoughts and feelings about religions even if he is not a member)\n\nAnd I said that a satanic temple is just as good as any other temple.\n\nNo assumptions about the son or his beliefs. Just statements regarding what is defined as a “religious person” and a temple.", "They’re 3 hours from Salem", "But we don’t know that", "Fair enough, I think it is justified pettiness then. \n\nMy actual opinion though, is that the grandparents were being petty in the first place, so they're getting what they deserve. Why they thought they should be allowed to dictate their grandson's wedding venue, well that's between them and their god(s)."]}