{"id": 292, "submission_id": "yighd5", "title": "WIBTA if I moved into my brothers room?", "selftext": "My brother (19) has moved out and into his own apartment for a while now, though he takes occasional visits for a couples nights back to the house where me (f16) and my mum lives. \n\nI have always had more stuff than him and have felt like I’ve needed a bigger room for a while now, especially since I have started growing plants and my room is lacking light (unlike my brothers). The problem is that my mother (and most likely my brother too - for various reasons, we don’t get along) is against it and she has told me that I am too messy of a person and that the room is still my brothers regardless of the fact that he’s no longer living with us. \n\nThough it is true that I am a far more messier person in comparison to my brother, this is in part due to the fact that my room has become a storage room of sorts for old childhood toys. I also do various arts and crafts, and am in need of larger desk space (currently I just sit on the floor), and I have a few books which I’m simply cramming into the small bookshelf I own. In short, I feel that I would be a much more organised person had I actually more space to store my belongings. \n\nI’ve told this to my mum but she’s taken it that I’m being an asshole to my brother for wanting to switch rooms. So, WIBTA?\n\nEdit: hey thanks for the replies and advice everyone :) I’ve cleaned my room today and got rid of some old and unwanted items, though just for clarification I can’t get rid of all my old toys as my mum says she wants to keep them for memories. I’ve settled for trying to keep my room as neat as possible over the next week or so and also ask my brother for permission. Wish me luck :)", "created_utc": 1667232918, "permalink": "/r/AmItheAsshole/comments/yighd5/wibta_if_i_moved_into_my_brothers_room/", "score": 11, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > I want to move into my brothers old room, my mother thinks that I would be the asshole for doing so.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "N TA for wanting to switch room, but YTA if you switch without your mother's approval. It's her house, she gets to set the rules, even if they seem unfair.", "NTA. Get rid of everything you no longer want. If your mom wants to keep the toys she can store them.", "YWBTA if you moved rooms - it’s not your house. It’s fine to want to move and ask but you got your answer.", "YTA\n\n> The problem is that my mother is against it\n\nEnd of story. Sorry but this doesn't sound like abuse like you're Harry Potter living under the stairs. I bet your mom is (rightly) worried that if you move into his room, you'll just accumulate more stuff and it'll end up being the same thing but with more stuff. Why not get rid of your old stuff? Can you ask your mom to help you figure out a way to get more organized in your current room?", "NAH\n\nYou are completely justified in wanting more space, and your mom and brother are justified in the sentiment of wanting to hold the space for him as he transitions out. The move itself may happen in days, but the heart side of it may take longer.\n\nHave you talked to your brother about how he feels about it? If he's agreeable with it, then maybe you could get him to suggest it to your mom and set up your current room as his own room.\n\nHe may not be ok with it, or she might still be against it. End of the day, it's her house. That doesn't mean you can't still find some solutions. You say you have a lot of stuff being stored in your room - see if you can get that stuff to be stored in his room in a corner or something, and come up with a proposal design of how you want to keep your room (and how it would be tidier) if you could clear out some of the stuff you don't use anymore.", "YWNBTA but I just read the edit and if your mom is actually the one who wants to keep your old toys for \"memories\" sake and you have no use for them at all, shouldn't she be the one to store them?\nYou said your room is turning into a storage unit and your mother is hounding you about being messy, so you should bring this up in the future because you deserve to have a space that's yours and not the prep kitchen for your mother's future nostalgia.\nWait a while until the room situation has resolved itself and then try to bring it up when both of you have time and patience for it. And be as polite as possible because this is probably dear to her heart. Just say something like \"Hey, I was sorting through my things and I found these. I don't need them anymore but I wanted to ask if you would like to keep some of them as memorabilia because I know that they are important to you. If you want to keep them, could we please store them in the attic/basement/not my room, so I can try and be more organised? If not, I was thinking about donating them out giving them away to *insert younger family member or family friend*, so another child can enjoy them and they don't go to waste.\"", "YWNBTA your brother has his own place. Holding out a space you could use for yourself and that has no other real purpose but to let guests sleep (because that is what your brother is now when he comes over) is cruel. Your old room could be turned into a proper guestroom", "NTA\nIt's normal that siblings move to the biggest room available. My little brother did this too. Why should the youngest stay in a smaller room forever..?", "NTA\n\nTalk to your brother but organize yourself too.   If you tend to be messy, a bigger room just means a bigger mess.  \n\nBut maybe you can set up a craft area in a corner of his his room just to start the transition so they both get used to the idea.", "YWNBTA for moving into a free room that better suits your current wants and needs. \n\nYour brother has literally left the building.", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy brother (19) has moved out and into his own apartment for a while now, though he takes occasional visits for a couples nights back to the house where me (f16) and my mum lives. \n\nI have always had more stuff than him and have felt like I’ve needed a bigger room for a while now, especially since I have started growing plants and my room is lacking light (unlike my brothers). The problem is that my mother (and most likely my brother too - for various reasons, we don’t get along) is against it and she has told me that I am too messy of a person and that the room is still my brothers regardless of the fact that he’s no longer living with us. \n\nThough it is true that I am a far more messier person in comparison to my brother, this is in part due to the fact that my room has become a storage room of sorts for old childhood toys. I also do various arts and crafts, and am in need of larger desk space (currently I just sit on the floor), and I have a few books which I’m simply cramming into the small bookshelf I own. In short, I feel that I would be a much more organised person had I actually more space to store my belongings. \n\nI’ve told this to my mum but she’s taken it that I’m being an asshole to my brother for wanting to switch rooms. So, WIBTA?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "It’s your mom’s house, so if she said no, it’s a no. If you get rid of the childhood toys that are cluttering your space, would that not give you more room? Also, cleaning up your space might help show you’re mom that you’re willing to work on your messiness. NAH.", "NAH\n\nIt's fine that you want more space. It's also okay that your mom said no. It's her house. She may be sentimental about your brother's room. \n\nFirst, go through your room and get organized. Clean out old projects and maybe shuffle your furniture around. \n\nNext, after you have maintained a clean space, approach your brother about trading spaces. \n\nThen, approach your mom if your brother is also agreeable.", "Nta", "NTA Brother doesn't live there so you should get the bigger room. If mum wants the toys, they go in HER room.", "NTA since you cleaned. \n\nRefer them to an episode of the Brady Bunch were each next kid got the bigger attic or keep,the room. Most life lessons have a Brady Bunch episode lol.", "NTA\n\nYour mother just wants to have an empty room for no reason instead of letting you have a space you'd benefit from. No one is gonna get hurt or worse off with the change. The only thing would be that your brother would have to sleep in another room for what, a dozen times a year maybe less? He doesn't really need that specific room anymore and yours could be turned into the guest's room.\n\nI can tell from experience that at any functional home this would be a no brainer, but your mother decided to be an asshole.", "Haha I certainly don’t think this is a Harry Potter situation either and I love my mum very much. Today I’ve been clearing some old stuff out of my room.", "Yeah today spent some time clearing out more stuff I don’t use anymore. I would prefer to get rid of the old toys etc, but my mum insists on keeping it for memories. I’ll see if I can move them to my brothers room instead. \n\nI have also been meaning to ask my brother about it, yet never found the right time.", "It sounds like you are taking good steps.\n\nFor things that you are ambivalent to but your mom wants to keep. Just put them in a box and tell her that these are items that you don't have a spot in your room anymore. That your sense is that she wants to hold onto them which is fine but that you don't have the storage space.\n\nGetting rid of/donating things is always hard but always amazing how much space you have when you are done. I did that with my clothing about 2 weeks ago- went thru my entire wardrobe. Ended up getting rid of about 50% of it. I still have plenty of clothing but now I can actually see what I own.", "This is actually a really good way to put it on her to help you out. I didn't even think to ask: is she the one who wants to keep your old stuff? If so, tell her that she needs to find a spot for it, perhaps even your brother's room!"]}