{"id": 29201, "submission_id": "17b5c54", "title": "AITA for wanting to plan MY wedding?", "selftext": "My (22f) fiance's mom is extremley controlling. She has been taking various pictures of him throughout his life and has almost documented every second of his existence. Up until he was 17, she would choose what clothes he wore, and made all decisions for him, and refused to let him choose by himself.\r  \n\r  \nShe told him multiple times as a teen, that she would be planning his wedding and that whoever he found would \"just have to be fine with that.\"\r  \n\r  \nWell, I'm not. For a while now, I've been wanting to plan my wedding. Like.. any normal bride would.\r  \n\r  \nMy soon to be MIL, immediatley after my fiance proposed, almost started talking to me like I was her child.\r  \n\r  \nShe told me where I'd be having my wedding, and sent me some wedding dress styles I could choose from. I immediatley told her no, and said that it was my wedding, and she didn't have any right to control aspects of it.\r  \n\r  \nShe was very angry, and told me that I was an AH for not letting her \"live out her dream.\" But, nevertheless, I continued to plan MY wedding.\r  \n\r  \nEverything went sideways when I decided I did not want photos being taken during the ceremony by anyone else but the photographer. I would like everyone attending to be mentally and emotionally present and be respectful of everyone’s view.\r  \n\r  \nTo be clear, I don't mean no photos for the whole wedding, I just mean for the ceremony and the first dance. Guests will have permission to take pictures after that, but I want them to keep their cameras down, and enjoy the ceremony.\r  \n\r  \nI texted her and explained this to her. She was absolutely furious and said that I was insane and that she would not be following my wishes. She's gone no contact for the past few days, despite me trying multiple times to explain. I have a feeling she's never going to let me have the day how I want it.\r  \n\r  \nAt this point I'm considering telling her that if she can't accept my wedding for how it is, then she doesn't need to attend. I know that she will want to take a bunch of group photos, that I don't know we have time for, and may cause unnecessary chaos regardless.\r  \n\r  \nAm I an AH? Should I have just let her take pictures? I feel like I'm ruining things with her, but she won't let me plan my wedding the way I want it.", "created_utc": 1697673684, "permalink": "/r/AmItheAsshole/comments/17b5c54/aita_for_wanting_to_plan_my_wedding/", "score": 20, "replies": ["Welcome to /r/AmITheAsshole. Please view our [voting guide here](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_what.2019s_with_these_acronyms.3F_what_do_they_mean.3F), and remember to use **only one** judgement in your comment.\n\nOP has offered the following explanation for why they think they might be the asshole:\n\n > 1. I'm not going to allow photos at my wedding, and therefore I feel like I could be seen as an AH. \n\n2. I believe I may be the AH, because I could be overreacting to the situation, and I might just need to leave it alone. I have an underlying feeling that I am creating unnecessary conflict, and being an AH.\n\nHelp keep the sub engaging!\n\n#Don’t downvote assholes!\n\nDo upvote interesting posts!\n\n [Click Here For Our Rules](https://www.reddit.com/r/AmItheAsshole/about/rules) and [Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n##Subreddit Announcements\n\n###[Happy Anniversary, AITA!](https://new.reddit.com/r/AmItheAsshole/comments/15vlv9g/almost_better_than_a_double_rainbow_celebrating/)\n\nFollow the link above to learn more\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](https://www.reddit.com/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*\n\n*Contest mode is 1.5 hours long on this post.*", "NTA. But where is fiance in all of this?", "NTA.   She should get remarried and have the wedding her way or adopt a daughter.  Your wedding is yours to plan, not hers.  She can't have HER special day and take yours as well.", "Nta. You gotta do this now, or she's gonna steamroll you forever.\n\nBut also..you bf needs to back you up.  If he doesn't, you're better off not marrying him", "You don't have an MIL problem, you have a fiance problem. YWBTA of you didn't expect your fiance to handle this issue, otherwise welcome to the test of your life being overruled", "NTA\n\n&#x200B;\n\nThis is easy: If your partner can't have your back in this, don't marry him.\n\n&#x200B;\n\n&#x200B;\n\n\"She's gone no contact for the past few days\" .. sounds like a win.", "NTA but her son needs to be the one to tell her to back off and that she's not in charge. It's practice for the rest of his life, and if he can't do this you don't want to be married to them anyway.", "NTA.  Along with everyone else, I do ask where is your fiancé in this. Because you may have a fiancé problem more than a MIL problem. \n\nIf your fiancé has spoken to his mother and gotten nowhere, you need to ignore her. You also need to put passwords on all your vendors and give them specific orders not to take any additional instructions from her.", "You talk a lot about \"my\" wedding when it should be \"our\" wedding with your fiance.", "NTA But don't threaten to disinvite her without your fiancé's support.  He should be working with you to ensure your wedding is what you both want, not what his mom wants", "NTA - but I’m guessing this is more of a rant than something you really needed judgment on", "I would elope", "NO NO NO! This is going to set the course for the rest of your life with this woman. Start out with a spine or you will regret it.", "NTA but where is your fiance he should be the one who manages his mother you and your fiance need to be on same team. Because your mil will not change not only plans your wedding but she will have to do it with everything in her son life. Like bought new house , house decorations, when you have a child, how to raise her grand children.", "You didn't mention how your finance is handling this, so I suspect he is hiding and letting mommy run the show.\n\nThis is a preview of every event and holiday in your future.", "You’re only going to be an AH to yourself if you marry into this family. You realize that she’s still going to be around after the wedding right? \n\nWhere’s your fiancé in all of this?", "NTA Hold your ground now and set clear boundaries or the expectations set that MIL can steamroll every birthday, baby name and Christmas stocking that comes up in your life from here on out.", "Nta - you and your partner need to be on the same page.", "Info: what has your fiancé said about all this?\n\nNTA either way. Your future MIL is trying to live vicariously through you by planning your own wedding and is mad you’re not tagging along for the ride. Stand your ground. \n\nIf she wants to plan a wedding, she can divorce her husband and then remarry him (though I doubt he’d stick around after that).\n\n(She seems like the type to wear white/her wedding dress to another person’s ceremony too).", "Where is your fiance in all of this? Who is paying for this wedding? Some important info. It doesn't change my vote of NTA, but your fiance should be running interference here. If he isn't, then you've got a long road ahead of you, where his mom tries to run his and your lives.", "NTA. Tell your fiancé to talk with her. He can tell her the two of you want photos of the guests faces during the ceremony, not the guests holding up their phones in front of their faces. \n\nChances are she’ll take photos anyways btw. (Something to know and let go so it won’t bother you on the wedding day)", "^^^^AUTOMOD  ***Thanks for posting! This comment is a copy of your post so readers can see the original text if your post is edited or removed. This comment is NOT accusing you of copying anything. Read [this](https://www.reddit.com/r/AmItheAsshole/wiki/faq#wiki_post_deletion) before [contacting the mod team](https://www.reddit.com/message/compose?to=%2Fr%2FAmItheAsshole)***\n\nMy (22f) fiance's mom is extremley controlling. She has been taking various pictures of him throughout his life and has almost documented every second of his existence. Up until he was 17, she would choose what clothes he wore, and made all decisions for him, and refused to let him choose by himself.\r  \n\r  \nShe told him multiple times as a teen, that she would be planning his wedding and that whoever he found would \"just have to be fine with that.\"\r  \n\r  \nWell, I'm not. For a while now, I've been wanting to plan my wedding. Like.. any normal bride would.\r  \n\r  \nMy soon to be MIL, immediatley after my fiance proposed, almost started talking to me like I was her child.\r  \n\r  \nShe told me where I'd be having my wedding, and sent me some wedding dress styles I could choose from. I immediatley told her no, and said that it was my wedding, and she didn't have any right to control aspects of it.\r  \n\r  \nShe was very angry, and told me that I was an AH for not letting her \"live out her dream.\" But, nevertheless, I continued to plan MY wedding.\r  \n\r  \nEverything went sideways when I decided I did not want photos being taken during the ceremony by anyone else but the photographer. I would like everyone attending to be mentally and emotionally present and be respectful of everyone’s view.\r  \n\r  \nTo be clear, I don't mean no photos for the whole wedding, I just mean for the ceremony and the first dance. Guests will have permission to take pictures after that, but I want them to keep their cameras down, and enjoy the ceremony.\r  \n\r  \nI texted her and explained this to her. She was absolutely furious and said that I was insane and that she would not be following my wishes. She's gone no contact for the past few days, despite me trying multiple times to explain. I have a feeling she's never going to let me have the day how I want it.\r  \n\r  \nAt this point I'm considering telling her that if she can't accept my wedding for how it is, then she doesn't need to attend. I know that she will want to take a bunch of group photos, that I don't know we have time for, and may cause unnecessary chaos regardless.\r  \n\r  \nAm I an AH? Should I have just let her take pictures? I feel like I'm ruining things with her, but she won't let me plan my wedding the way I want it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*", "> but your fiance should be running interference here. \n\nI'm with you right up to this point...\n\n> If he isn't, then you've got a long road ahead of you\n\n... but this is where we part ways. If the fiance isn't, what OP *should* have in front of her is a very *short* road back to being single: having MIL trying to run every aspect of your lives together is something no bride should ever have to put up with.", "The group photos should be something you can talk about with the photographer! They can deflect things for you “let’s maybe take those extra photos later during the reception because we have to start couple portraits right now” or whatever else they can say. “Later at the reception” often turns into “never because half of them are drunk” 😂😂😂"]}